{
    "r/Catholicism Prayer Requests — Week of June 17, 2024": {
        "title": "r/Catholicism Prayer Requests — Week of June 17, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/Catholicism/comments/1dhp8en/rcatholicism_prayer_requests_week_of_june_17_2024/",
        "content": "Please post your prayer requests in this weekly thread, giving enough detail to be helpful. If you have been remembering someone or something in your prayers, you may also note that here. We ask all users to pray for these intentions.",
        "num_comments": 112,
        "comments": [
            "I am very fat and have been for many years, and I am requesting prayers for losing weight. If anyone in similar situation.\n\nThank you. \n\n🙏🏽",
            "Please pray for me and my friends success in our upcoming exam.\n\nIt is the most important one of our life so far. May God stay by our side throughout this whole exam week, help us, and may we all pass it, with the highest  distinctions. \n\nAmen \n\nThank you !",
            "For my family’s intentions regarding a possible new potential direction our family is headed in, and our strength to endure.\n\nThank you 🙏🏽",
            "Praying that I find a spiritual director for vocational formation who is the right fit. I'm looking for someone who is rather experienced in contemplative prayer, and those are apparently few.",
            "For the salvation and final perseverance of me and my loved ones\n\n\nFor the health of my girlfriend's dog\n\n\n For reparation for offenses committed against the Sacred Heart and Immaculate Heart.\n\n\nFor my next Confession to go well.\n\n\nFor me to trust Christ through my scrupulosity and receive Communion.\n\n\nFor the mental health of a loved one to improve.\n\n\nFor peace in the world and mitigation of any potential chastisements.\n\n\nFor a loved one's meeting with a therapist to go well.\n\n\nFor my uncle with throat cancer to get medical treatment and for him to turn back to God.",
            "Hi.\n\nI would appreciate your prayers towards me. I still don't have good days.\n\nI'm still struggling at my job (yesterday I was expecting a salary increase and I won't have it. Things where I live are getting more expensive as time goes by); I feel unsupported in a country where I know no one and where it is difficult to form a Catholic community. I feel my professional knowledge is useless. I want to move to another country and company, but the current job market is very complicated and I feel I can't fit in any current position they offer (again: I feel my knowledge is useless and I'm afraid of falling in the same hole where I'm currently).\n\nI feel alone...",
            "Hey,\nA small request but I have a driving test on Wednesday (Australia). I failed the first time and I’m a bit nervous and scared. Could you please pray for me to be calm and be strong, and pass this test.\nThank you and God bless you all",
            "For my wife and me as we try to grow our family and improve our health.\n\nFor me as interview with several companies for jobs this week.",
            "For the victims of the shooting at a local splash pad this weekend, and for the soul of the shooter.",
            "Pray for me as I continue to feel the Lord's calling and that I may be guided to continue my discernment and vocation to the priesthood. Pray for me that anything which can distract me from my vocation will be removed in my life.\n\nPray for my purity and a chaste heart.\n\nJoin me also as I pray for the conversion of all sinners, those who have left the Church, and those who do not believe in the Catholic faith.",
            "I am a writer and am looking for a writer's group that welcome me and my beliefs. Please pray for me.",
            "My cat was recently diagnosed with congestive heart failure, ventricular premature contractions, and underperforming kidneys. If you know of any treatments and/or professionals who might be able to help, please let me know. Also, please pray he be cured and have more good days of life on Earth ahead of him than total days of life behind him. I have become better because of him and never want to leave him nor have him leave me. Pray death never touches him nor any other under my protection and pray they always live and remain my eternal companions.\n\nAlso, if I may, I’d like to draw your attention to a new study regarding hypertrophic cardiomyopathy (HCM). Researchers at UNC are testing an existing once-a-week medication for use with cats who have HCM. While early (very) small-scale research is giving hopeful results, much work remains to be done.\n\nSpecifically, the researchers need A LOT of cats with HCM to work out the different variables as to who should take the medication, who shouldn’t, how effective is it, etc., etc., etc.\n\nSo, if you or anyone you know has a cat with HCM, please go to http://hcmincats.com/ and sign up today. Please forward this information to all your local veterinarians and veterinary schools and veterinary professionals and ask them to spread the word.\n\n“How many cats do they need?” — As many with HCM as you can find.\n\n“What’s your angle in all this?” — My cat was recently diagnosed with congestive heart failure, ventricular premature contractions, and underperforming kidneys. (If you know of any treatments and/or professionals who might be able to help, please let me know.) If I can help either him or the someone else’s kitten, especially him, that’s a BFD for me.\n\nThanks and praise be.",
            "Please pray for my partner who is battling with porn addiction and is newly reconnecting with Catholicism and pray for our relationship as this isn’t very easy for me. Thank you 🙏🏼",
            "For my family's beach trip Tuesday - Saturday.\n\nFor a friend's birthday party Sunday.",
            "Please pray for my dad, he is most likely going to retire this year and has financially struggled with my mother, he has worked ever since he turned 6 years old and I know he’s tired. I will keep your requests as well on my prayers 🙏.",
            "So that my parents accept my conversion, and of course, for my own conversion.",
            "Please say a quick prayer for me if you see this. I’m having some random unexplained allergic reaction to something that we have not yet identified and the medicine they gave me is having all types of weird side effects, mental and physical. I feel really weird and not like myself and it’s kind of scary, hence why I’m on the Catholicism Reddit at 3:00 am for comfort. 😐",
            "Please keep my father Joseph him in your prayers as he is getting scopes this week and soon a brain scan to check for areas of cancer, hopefully we will continue to be blessed and all will be clear as it was on his last PET scan xx",
            "Friends, please pray for my soul and my confession this week, so that I can have a good confession.  Please also pray for my job, for Jesus to guide my professional path to holiness and fulfillment",
            "Please pray for the Holy Spirit to bring me awareness of the next steps in my path, I am facing difficulties at this time. \n\nThank you 🙏",
            "For my immediate family & I, things aren't great right now despite efforts to prevent the worst case scenario. Especially pray for my brother Xavier & cousin Madonna.\n\nFor those struggling with emotional issues, habitual sin, spiritual dryness, despair & indifference to their practice of the faith (incl. active participation at Holy Mass).\n\nFor those affected by & involved in violence & displacement in Eastern Congo & Haiti. Please pray for some successful form of mediation & intervention that will prevent a resurgence of tensions, and more importantly restore order & decrease inequality in these nations.\n\nFor the conversion of many with roots in Latin America, Louisiana & the Caribbean from old syncretic religions (e.g. Voudou, Candomblé, Palo) or New Age influences & towards the fullness of unadulterated faith in Christ.",
            "Please pray for my son having difficulties in a relationship and with his court date today. \n\nPlease pray he finds stable work and is motivated to be the happy, confident person he was before. \n\nThank you.",
            "I ask for prayers for my marriage. We are going through a tough time right now.",
            "Pray for all those struggling with suicidal thoughts. There are a good many suicidal people looking for help on this Subreddit.",
            "For the woman who bit the priest in Florida, her partner & their families.\n\nFor the health & safety of Fr. Fidel Rodríguez, [Fr. Gabriel Ukeh](https://www.catholicworldreport.com/2024/06/10/nigeria-archdiocese-appeals-for-prayers-for-priest-abducted-from-parish-rectory/), Fr. Louis Merosne & their parishes.\n\nFor better catechesis & a wider acceptance of the truth on Purgatory, indulgences & extra ecclesiam nulla salus (outside of the Church there is no salvation). Lord help us.\n\nPlease pray for the people of Nicaragua & Nigeria, especially our fellow Catholics & ex-Catholic siblings in baptism.\n\nFor the hermit who recently revealed that he is trangender, for better oversight by dioceses for applications as far as possible and a charitable resolution to all of this.",
            "Hi all, I just applied for a job at EWTN. Prayers appreciated.",
            "I am trying to learn more about chanting but I just don't know who can help me with it.\nPray that I will learn more about it.",
            "Hello - I would like to request a prayer for vitiligo and mental distress \n\nThank you 🙏🌹",
            "For my health and my mothers health and that I may have a clear mind to reflect on my faith and to build it stronger and one last thing being to pray that my loneliness gets better, would greatly appreciate it.",
            "Begging for prayers for a medical miracle for a condition there's no cure for that I cannot get rid of - I don't deserve his mercy and I will suffer if He wants that for me but I want nothing more in this world than to be cured of this. Thank you.",
            "Please pray for my Uncle. He has cancer in various places in his body. I'm so heartbroken. Please pray the doctors can treat it and are able to do surgery. Also please pray for the strength of his son. And please pray for both of their conversions. Thank you very much, God Bless.",
            "For a major Career decision that is coming up in 2 weeks. Praying for wisdom to make the best choice for myself and my family.",
            "Please pray for my girlfriend who is struggling with depression and for my family.",
            "can somebody pray for my boyfriend who’s trying to get sober? please he really needs it",
            "I request a prayer \n\nThe feeling of mediocrity is starting to bear on my life, and I hope to strive for more",
            "I am autistic and struggling to find Christian community and friends. Please pray for me, I am very lonely. ",
            "Hello, \nI‘m asking you guys to pray for my father (52) We got devastating news that his cancer returned and now he needs both kidneys removed. \nPray for his health, both physical and mental and that god works a miracle on him that he may keep one kidney or get‘s a suitable donor fast. \nI want to thank you in advance from the bottom of my heart.",
            "Please pray for my legs and my health….",
            "I am very seriously ill.  Please pray for miraculous healing.  I would be very grateful.",
            "Please pray for a little boy named Logan and his family. He joined Our Father in the Kingdom of Heaven early. He was 11 weeks of age. He died of suffocation at a day care. \n\nMy wife found out about the death of this poor little one on a new Mom's forum. I don't know the parents, but they asked for prayers. They are going through a very dark time.",
            "1.  Please pray for the repose of my uncle, a Catholic convert who passed away on 6/7, and his family.  He was the only Catholic in his immediate family.\n\n2.  For help making decisions \n\n3.  For all dealing with addiction, illness, and injuries \n\n4.  For my upcoming eye procedures in July\n\n5.  For priests moving on to new parishes and new ones coming in.  The parish closest to me trains new priests for the first 2 years after ordination\n\n6.  For Catholic author Leah Darrow and her son Sylvester who was born 5/1 at 22 weeks.  He has many medical hurdles ahead but is still alive and is doing amazing well.\n\nThank you and I will pray for your intentions.",
            "For the healing and conversion of B.E.",
            "I'm struggling with sexual sins at the moment. Please remember me in your prayers 🙏",
            "Please brothers and sisters, I beg you. Pray for my vocation. I want this lust to go away, to live a life that is more worthy of the Gospel, and become a religious (priest or so) in the future. Please, I need your intercession",
            "Please pray for my brother, he just got diagnosed with P.A.N.D.A.S and might need a blood transfusion. I pray for all of you.",
            "Please, pray for me and my family as we are struggling to find a new home. We are currently in a dangerous place, in a difficult financial situation, and almost being evicted.",
            "Please pray for me. Life is getting overwhelming and just seriously injured my shoulder. Too many bad things happening at once.",
            "[removed]",
            "Pls pray for my personal intentions. I will pray for yours. Thank you brothers and sisters in Christ.",
            "I look around and see people twisting Scripture to mean whatever they want.  I see Christians providing a poor example, and others scandalized into apostasy.  I see us lose, and lose, and lose, and it destroys the hope within me.  Please pray for me to see something else.",
            "Please pray for my dad, who's currently hospitalized with heart failure.",
            "I just learned from my friend that her grandmother is dying and they're trying to get a flight up to see her for the last time. \n\nPlease, Lord, let them be able to get there to say goodbye and be with them in her time.",
            "Please pray for the Latin Mass (I saw some stuff about further restriction) \nAlso please for me, my nana and great uncles(there’s two) that we may be saved. ",
            "Please pray for me, I feel very lonely.",
            "I could use help with my job/business. It's at a turning point, which I pray that God turns into an opportunity for me to use my gifts for the Church.",
            "I'd like to pray for the young adults and teens in my family, that God might bless them and hold them close as they grow from teens and young adults into adulthood.",
            "Prayers for my general struggles and to stop being so weak.",
            "I will pray for your health !",
            "Come on over to /r/loseit and /r/cico. I'm down 110 pounds over the last 2 years. Looking to lose maybe 60-70 more. /r/loseit has been helpful to me. Wishing you the best, my friend",
            "I will pray for you",
            "I will pray.",
            "Praying for you friend!",
            "Prayers of health to you! ❤️🙏🏼",
            "My advice is to not make excuses. I don't mean that in a condescending way, but back when I was 278, I used to tell myself \"oh, it'll just be this one snack\" Much like sin, when it comes to overeating, you can't let the idea take root in your mind. You have to run away and divert your attention *immediately*.",
            "Also have some exams this week and next week myself. I'm thinking of you and your friends in my prayers",
            "you’re in my prayers",
            "I will pray.",
            "I will pray God bless✝️",
            "I will pray.",
            "I've prayed for you xx",
            "I will pray!!",
            "I will pray for you ✝️",
            "I will pray.",
            "I will pray for you",
            "I will pray.",
            "I've prayed for you!",
            "I will pray for you",
            "I will pray. You are not alone.",
            "I will pray for you, please remember that you're not alone!",
            "I will pray.",
            "I will pray",
            "I will pray.",
            "It may not help with the treatment, but if you do need to euthanize your cat, you should look into at home euthanasia clinics in your area. My wife is a vet and used to work for one in our area that was so, so much more healing and patient than going into the vet to do it. They let your cat pass at home in your arms.",
            "I will pray for you!",
            "I hope you feel better. Lord hear our prayer",
            "I'll pray for you. Please pray for me too, I feel very lonely.",
            "Praying for you all friend.",
            "Praying for you friend.",
            "I'll pray for you!",
            "I'll pray for you. Please pray for me too, I feel very lonely.",
            "🙏",
            "Praying for Logan and his family friend.",
            "Praying for these friend.",
            "Praying for them friend.",
            "Praying for you friend.",
            "I will pray for your brother, may the Lord hear our prayers.",
            "I'll pray for you. Please pray for me too, I feel very lonely.",
            "r/Catholicism does not permit comments from very new user accounts. This is an anti-throwaway and troll prevention measure, **not subject to exception.** [Read the full policy.](https://www.reddit.com/r/Catholicism/wiki/agekarma)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Catholicism) if you have any questions or concerns.*",
            "Praying for you and your father friend.",
            "Thank you ! I’ll do the same ✝️",
            "Thank you! 🤗",
            "Thank you! ♥️",
            "Thanks!",
            "Thanks!",
            "Thanks!",
            "Thank you all so much",
            "Thank you, my brother in Christ - I just had one and I believe it went well! I will pray for you and yours as well.",
            "Thank you ❤️",
            "Thank u brother. God bless",
            "I will, thank you",
            "Amen :)",
            "Aww thank you for the prayers, he's out of danger rn.",
            "Thanks for the update friend! Wonderful to hear!"
        ]
    },
    "Who are they?": {
        "title": "Who are they?",
        "score": 165,
        "url": "https://i.redd.it/jfqzwtcth28d1.jpeg",
        "content": "Roman Catholic Womenpriests\n",
        "num_comments": 94,
        "comments": [
            "Schismatics and heretics.",
            "Not Roman Catholic for what it's worth",
            "Bad theology aside, every time I see this group mentioned, I loathe having to see the expression \"womenpriests.\" So tacky!",
            "Surely not Roman Catholic...",
            "They literally got excommunicated from the Vatican",
            "Plenty of room at the Methodists lady.",
            "Protestants in denial",
            "Heretics, they are heretics.",
            "Cosplaying boomers.",
            "I found this on Wikipedia, if it helps.\n\nhttps://en.m.wikipedia.org/wiki/Roman_Catholic_Womenpriests",
            "blows my mind how rejecting the Vatican still keeps you Roman Catholic ... that no action is being done to remove one self from excummunication... that staying in perpetual tangent from The Church is still being in the Church?\n\n[https://arcwp.org/about-us/](https://arcwp.org/about-us/)\n\n>*The ordained women of the Association of Roman Catholic Women Priests (ARCWP) live and minister in the United States, Canada, Latin America and around the world. We prepare and ordain qualified women and men to serve the people of God as priests. We use equal rites to promote equal rights and justice for women in the church. We affirm that justice for all of God’s people is constitutive to the Gospel of Jesus Christ.*\n\n[https://www.romancatholicwomenpriests.org/history/](https://www.romancatholicwomenpriests.org/history/)\n\n>*The question of women’s ordination in the Church in the early 20th century was linked to the question of women’s suffrage in several countries. The St. Joan’s Alliance campaigned in both England and the USA in 1911 for both women’s ordination and women’s suffrage.  As the 20th century progressed, numerous Protestant denominations began to ordain women. By mid-century, most of the mainline denominations in the USA had some ordained women.  A big breakthrough occurred when the Episcopal Church USA, a member of the Anglican communion of churches, ordained women as priests officially in 1976. This breakthrough followed a long struggle, with 11 women being ordained illicitly (but validly) in 1974, followed by another group of 5 in 1975. This phenomenon inspired hundreds of Roman Catholic women who felt called to ordination to gather together with men and women theologians in Detroit, Michigan to organize an effort to bring their campaign to the Vatican. The gathering took place in late 1975, and was known as The Women’s Ordination Conference. Shortly thereafter, in 1976, an organization was formed to carry this campaign forward, and it was named The Women’s Ordination Conference.*\n\n>*There were almost immediate reactions in Rome to these developments. The Pontifical Biblical Commission studied the issue in 1976, and announced that there was no biblical impediment to the priestly ordination of women.*\n\n>*However, Pope Paul VI hastily issued an encyclical known as Inter Insignores which denied that women could adequately represent the male Jesus as presider at the Eucharistic table. Women’s Ordination Conference was not deterred, but built a large constituency within the USA, and inspired women in many other countries to organize in similar ways in their countries.*\n\n>*Soon after, there was the Canadian Network for Women’s Ordination and by 1985, Maria von Magdala developed a group in Germany.  By the mid-1990’s there were also organized groups in Britain, Australia, New Zealand and many other countries.*\n\n>*In 1996, at the First European Women’s Synod, held in Gmunden, Austria, representatives from the above-mentioned organizations and other interested women met to organize an international coalition which was to serve as an umbrella group for all of the individual groups. This group became known as Women’s Ordination Worldwide (WOW), and serves as an international resource to all. Three international WOW conferences have taken place in 2001 and 2005, and 2015. Strategies for finding ordaining male bishops were shared among WOW groups. The result was that what had not produced results on one continent (North America), did so on another (Europe). Catholic bishops were found who were willing to ordain women, and thus the movement was born on the Danube River.*",
            "Heretics!",
            "The same group that released a song with the lyric \n\n“Don’t listen to St Paul”",
            "Heretical cosplayers",
            "I feel this is kinda like the National “Catholic” Reporter calling itself Catholic (despite, IIRC, being told not to)",
            "A bunch of LARPers.",
            "Boomer women that are LARPing as Catholics.",
            "Their organization is excommunicated.\n\nSince 2007 it's automatic excommunication for anyone who confers a sacred order on a woman. They're all heretics, no exceptions.",
            "About as Roman Catholic as the Antipope of the Palmarian Church in Spain, ie. not Roman Catholic at all.",
            "I’m pretty sure the Roman Catholic Church doesn’t ordain women to priesthood.",
            "Roman Candle Women Peas",
            "There is an “old catholic” church near my house and they will take advantage of hispanic catholic immigrants and not tell them that theyre not the roman catholic church the hispanics think they are. A lot of them will find out later on and need to go through all of the sacrament classes again because the classes they took before, through no fault of their own, were unfortunately not valid.",
            "The Church should trademark the world Catholic.",
            "Arrogant.  Arrogant.  Arrogant.\n\nFormer Protestant here - there is a lot of use of the word 'catholic' with an honest, well meaning, but very different intention than what Rome means by that word.  We always made some careful, linguistic distinction, like using a lower case 'c' when reciting the Creeds.  We never added 'Roman' and actually intended 'The Roman Church' as a bit of a dig against Catholicism.  The implication was you/we started as the True Church, then lots of the dominant culture of the Roman empire + power grabbing politics got assimilated, so now you/we went from 'The Church' to 'The Roman Church'.  Most Protestants dislike 'Roman' but not all apparently (!)  It is noteworthy and depressing that this group refuses to acknowledge schism with their choice of words.  They lack humility and seem to not be as serious as they let on - u/KristenK2 beat me to is - 'cosplaying boomers' is right.\n\n(EDIT) 'womenpriests' - English has a word already, no need to make up something sophomoric, they want to be ***priestesses.***",
            "No idea but certainly a lying person, it is evident that he is not Roman Catholic.",
            "Narcissistic and prideful women who went so far as to become heretics.",
            "Can't the Church utilize copyright/trademark law to fight this kind of thing? Think of the confusion these people are causing.",
            "Is she he's Anglican? Or confused? Or Our Lady Tier of Knots... ",
            "I put this in a comment responding to someone who said they didn’t understand why women couldn’t be ordained, so for anyone wondering or just wanting to read something excellent on the topic, I recommend this relatively short (and IMO easy to read) book by Cardinal Müller:\n\nhttps://www.amazon.com/Priesthood-Diaconate-Recipient-Perspective-Christology/dp/0898708923",
            "Heretids",
            "This is what your brain on feminism looks like.",
            "Aw you stole my answer",
            "Like the former papal nuncio to the US?\n\n  \n[https://www.pillarcatholic.com/p/vigano-charged-with-schism-calls](https://www.pillarcatholic.com/p/vigano-charged-with-schism-calls)",
            "Are you telling me that just because you claim to be something doesn’t actually make you that thing???",
            "Not Bishops or 'Womenpriests' either.",
            "[removed]",
            "They forgot the word priestess exists",
            "It's like when people feel the need to say \"MALE NURSE\", holy shit.",
            "It's just the female version of Menpriests. You know, Menpriests!",
            "It makes me think of how atrocious it would be if we called priests \"menpriests\" instead of just \"priests.\"  It sounds awful and makes me cringe every time.",
            "They claim to be the Roman Catholic Church though",
            "this is from the international site:\n\n>[**The Vatican states that we are excommunicated, however,** we do not accept this and affirm that we are loyal members of the church.](https://arcwp.org/about-us/) *We continue to serve our beloved church in a renewed priestly ministry by welcoming all to celebrate the sacraments in inclusive, Christ-centered, Spirit-empowered communities wherever we are called. There are women priest communities in Germany, Austria, France, Scotland, Canada, the United States, and South America. From our birth on the Danube River, RCWP has evolved into two streams in Europe (West and East), two in Canada (West and East), and two in the United States (RCWP USA and ARCWP). Someday streams will flow in Latin America and elsewhere.*\n\nthe most concrete form of denial.\n\n>[ **How do you deal with excommunication?**](https://arcwp.org/about-us/frequently-asked-questions/)\n\n>We reject excommunication. No punishment can separate us from Christ or cancel our baptism. No church authority can separate us from God. This is our church and we are not leaving it. (No matter what the Vatican says or does.) (The Vatican's official line is that our excommunicate is the automatic type, by your choice, you have excommunicated yourself)",
            "…along with their \"consecrating\" bishops",
            "Good one",
            "Cosplaying Catholics.",
            "The thing that makes me laugh about this is to remember that, as a ~17 year old Canadian Catholic girl, who had not encountered Episcopalianism, I corrected an American online acquaintance when he referenced his female priest, Mother Lastname.     I said that only men could be priests, and he came back with what amounted to  \"Ha, ha, sheltered little Catholic, who thinks you're the center of the Universe.\"\n\nNow, at *considerably* older than 17, I understand apostolic succession, I understand schism, and I understand that 17 year old me was correct, in a way I didn't realize at the time.   If we expect a valid Eucharist, we must receive it from one who has the authority to consecrate it.    And hence, only men can be (true) priests.\n\nBut I shouldn't laugh.  This is serious.  They are leading people away from true sacraments.  They will have much to answer for.",
            "I physically gasped when I heard that song. Heretics are bold I will give them that",
            "Repeatedly",
            "Larpers?",
            "Larping?",
            "This is confusing to me. I understand that Jesus's apostles are traditionally all men but I still don't see how that excludes women from the priesthood, since no existing priests are Jesus's apostles anyway. In the time when Jesus lived, it would have been highly irregular and inappropriate for an unmarried woman to travel with a band of single men. And a married woman would have been at home tending to the household and also not traveling with single men. But now we have nuns and such, so what prevents them from taking Holy Orders?",
            "The antipope? Does he explode if we out him near they real pope?",
            "I completely agree. Everyone wants to claim it now",
            "No, Catholic has long ago entered the common lexicon and can't be copyrighted nor trademarked",
            "Uhh… yes.",
            "There were never woman priests",
            "You are arguing against a couple thousand years of Catholic theologians, popes, scholars, apologists, etc.  I’m not sure where you received your information but it is just not true. Individuals spreading incorrect interpretations of the Bible is why there are so many Protestant religions out there.",
            "So did I for a bit😅",
            "They purposely avoid using that word because they know it has pagan connotations.",
            "FEMALE doctor, the list goes on...",
            "Ugh that makes my skin crawl 😂",
            "There are those who claim to be us, but are not us.",
            "And I can claim to be Superman",
            "They can claim all they want. It won’t ever make it true. But it’s still heresy. If women want to be pastors, there are quite a few Protestant churches they are free to lead.",
            "Vatican: You're excommunicated.\n\nThem: Nuh uh",
            "mega copium",
            "I see they played the reverse Uno card. Bold move - let's see how it plays out.",
            "Cosplaying sacerdotals along with bishops LARPing Sacerdotal Consecration!",
            "Live Action Role Playing",
            "Trying to act like something you aren't. Its like those guys who say they are SEAL but never went to the army. Its a wannabe.",
            "> it would have been highly irregular and inappropriate for an unmarried woman to travel with a band of single men.\n\nDid you ever read the gospel? Mary Magdalene was a woman and she travelled with the apostles",
            "Except that there literally were single women traveling with Jesus the whole time, the most obvious being Mary Magdalene! It's not as if Jesus only traveled with men, the Gospels literally say that women traveled with Jesus and supported Him. Yet He didn't pick Mary Magdalene, not because she wasn't \"good enough\", because she certainly would have been better than Judas. Jesus did not pick His Apostles based on merit, else He would have absolutely chose the most meritorious of all His creatures: His Mother. The fact that He didn't pick the greatest of all creation shows that it wasn't due to \"merit\" or \"freedom of travel\" that He specifically picked only men. He picked only men on purpose, so we have no authority to even attempt to ordain women, and to try is an insult to Jesus's authority.",
            "> we have nuns and such, so what prevents them from taking Holy Orders?\n\nYou can absolutely not compare priests with sisters. Nuns work for the world, priests work in the world. Nuns are closer to monks, who do not celebrate the sacraments.",
            "I highly recommend this book by Cardinal Müller. It lays it out very succinctly.\n\nhttps://www.amazon.com/Priesthood-Diaconate-Recipient-Perspective-Christology/dp/0898708923",
            "That's the story today but what if it's not true? We know that not everyone in the Church was a good actor. They were just people and they had good intentions for sculpting the early history of the Church to show unity and cohesiveness. It was important that later changes looked like they were there from the start so they were not motivated by evil. But it's important that we look at this objectively and correct things historically instead of holding on to what we want to believe. That's not against the Church - seeing reality and not examining it would be. We are owed the truth and I get you have great intentions but the truth will only help the Church. [Early Christianity ](https://news.harvard.edu/gazette/story/2000/02/women-priests-vegetarianism-an-early-christian-manuscript-holds-some-surprises/#:~:text=Church%20leadership%20was%20democratic%20rather,sister%2C%20a%20woman%20named%20Mariamne.)",
            "Yes I am arguing against tradition like many have in the past which has made the Catholic Church have integrity and has made it better. Which part do you disagree with or you think is false? I get your great intentions, but correcting history is a good thing for the Church and it can only benefit from it. History shows this. Putting our heads in the sand when presented with evidence is not helpful to the Church. We're better than that.",
            "Male mailman",
            "Pregnant male…\n\n\nseahorses",
            "They hate us ‘cause they ain’t us.",
            "[https://www.youtube.com/watch?v=jkmxHGdIg\\_k](https://www.youtube.com/watch?v=jkmxHGdIg_k)",
            "She was already a prostitute, no? At least by tradition? So how much more \"defiled\" could she get, in a time when women were the property of their fathers until they were \"sold\" to a husband? She was used goods; she wouldn't have had any saleable value so she was a free agent, so to speak, sort of like a widow would be, but with shame attached.\n\nIf she traveled with the apostles then she was an apostle, unless you can come up with a reason why she was any less apostolic than her male counterparts. If she's not considered an apostle then it necessarily must have something to do with the perceived taint on her.",
            "No, I understand that, but I'm asking why women who can become nuns cannot also become priests. Clearly they are holy and devoted enough, and they have a deep understanding of the faith, so why would it be inappropriate for them to lead a Mass?",
            "There’s never been any evidence of female priests serving mass, no writings at all. we would know if there was evidence of this. There were never female priests before Jesus came either. There’s literally no evidence at all.",
            "Mailmen are always assumed to be male",
            "What did you say?",
            "Mary Magdalene was not a prostitute, she was possessed by demons and Jesus cast them out\n\nPlease stop talking about things you don't know anything about, read the gospel, talk to a priest, do anything but stop arguing with strangers online \n\nYou're trying to use \"facts and logic\" to counter church teachings, you're dangerously close to heresy",
            "Because the priest acts as a representative of Christ on Earth, and Christ was a male\n\nHe chose apostles to guide us and proclaim the gospel, and he chose only males. Mary Magdalene wasn't an apostle, she was a disciple.",
            "HE SAID THEY HATE US 'CAUSE THEY AIN'T US",
            "Christ wasn't just a male. He also had other genetic traits. He was a Middle Eastern Jew, for example. Do we limit the priesthood to only Middle Eastern Jews? Of course we don't. So to me, picking \"male\" as the only exclusionary genetic trait that Christ had and using that to define who gets to be a priest is a bit nonsensical to me."
        ]
    },
    "Post your prayer spaces/corner": {
        "title": "Post your prayer spaces/corner",
        "score": 158,
        "url": "https://i.redd.it/t3e1xd0yo18d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Bluds Prayer corner has aura",
            "Love the ambience ",
            "All mine is is just a statue of Our Lady of Guadalupe and a drawing of her. I don't even consider it as a prayer corner honestly. I've been wanting to buy a Our Lady of Guadalupe Rosary though.",
            "Damm you definitely just bragging on how awesome yours is 😭",
            "My room or anytime, anyplace.\nI'm 15 and would kill(jokeing)to have a prayer space like that.",
            "Mine is just empty wall 😂",
            "You're living my dream lol",
            "Great😍",
            "beautiful set up",
            "Hey Mike Winger !!",
            "This is beautiful.",
            "Mine is a budget \"Romanitas\"",
            "Currently don't have any prayer spot, but yours is truly beautiful.\n\nFrom this photo it gives off that spiritual aura you'd feel in a church.",
            "Mine is way less impressive than that 😂 I've always kept my religious items in a box in a cupboard, and I developed a habit of praying next to the cupboard while I was looking at all of my prayer cards/rosaries/prayer books and whatnot that I kept there. So I just worked with it and now the inside of the cupboard door is covered in crucifixes and pictures of saints so that I have something to look at while I pray. And that's now my prayer corner I guess lol.",
            "Blessed Michael McGivney… I take it you’re a fellow knight?",
            "Really cool!  I'm working on a little one for my college dorm room next year- it's going to be pretty small, just a crucifix and 2 prayer cards- one with an image of Mary and the other with my confirmation saint.  I'm super excited about it!",
            "Don’t have a prayer spot. There’s just pictures of Jesus, Bibles, and a big poster of Mother Mary on my closet door.",
            "I’m moved by the beauty of this prayer corner",
            "I love this one: https://ruggedrosaries.com/collections/original-paracord-rosary-collection/products/guadalupe-rugged-rosary",
            "I built this up over time, you can do the same. But never feel like you must have a large prayer space. All that matters is what’s in your heart when you pray."
        ]
    },
    "Pope told by student to stop using anti-LGBTQ language": {
        "title": "Pope told by student to stop using anti-LGBTQ language",
        "score": 52,
        "url": "https://www.bbc.com/news/articles/c7220y9jx04o",
        "content": "",
        "num_comments": 104,
        "comments": [
            ">The Pope waited for all three students in Mr Rivera's group to speak before giving his replies.\n\n>He did not address Mr Rivera's concerns specifically but he said through a translator that he was advising Mr Rivera to differentiate true love from false love.\n\n>\"Always pick true love,\" he said.\n\nMost relevant section in the article.\n\n**EDIT:** In all fairness, Pope Francis was *quite* charitable with his response. He looked busy and tired. He could've overlooked the student(s) entirely. I can't imagine being in his position, especially knowing how everything he says is taken out of context by one party or another; scrutinized and over-analyzed for insidious latent meanings. He's also in his mid-to-late eighties, with one lung, and a bad knee that leaves him wheel-chair bound in public. Let's pray for him. The forces he has to fight are much stronger than for us.",
            "This student wore a rainbow sash and asked the pope to allow divorce in the Philippines. From the image in the article, this almost looks like a struggle session.",
            "“No, I don’t think I will”\n-Pope Francis",
            "Please allow for divorce? What kind of Catholic is this dude that he thinks the pope has the power to change the word of God?",
            "People shouldn't tie their identity to their base instincts.",
            "> The student from the Ateneo de Manila University told the Pope that he has been \"outcasted and bullied due to my bisexuality, my gayness, my identity and being the son of a single parent\".\n\nJump to the 37:21 mark:\n\nhttps://www.youtube.com/watch?v=OaYFc8zQ4u0",
            "He should take the rainbow sash off. So disrespectful",
            "The rot goes deep. \n\nLooks like whoever selected the student from Ateneo de Manila University intended to set up Pope Francis.",
            "Asking for divorce and choosing to wear a rainbow sash kinda tips off that this is about more than the Pope’s use of a word. I 100% agree that we should avoid the use of slurs, which, when uttered by the Faithful, act as a stumbling block which pushes people away from conversion. Asking for the same, plus asking for divorce, plus wearing a rainbow sash in an audience with the Pope? Come on. That reeks of a higher agenda.",
            "Progressive media and RadTrads agree that they find Pope Francis’ language ‘confusing’, but for widely different reasons. It’s a bit comical. The former feels betrayed because he isn’t the reformer they wanted, but holds to the Church’s stance, and the latter, because he hasn’t declared another Inquisition lol\n\n[https://www.nytimes.com/2024/06/22/world/europe/pope-slur-church-lgbtq.html](https://www.nytimes.com/2024/06/22/world/europe/pope-slur-church-lgbtq.html)",
            "A student? Oh my... I guess the pope now has no choice than to revoke his words!",
            ">He did not address Mr Rivera's concerns specifically but he said through a translator that he was advising Mr Rivera to differentiate true love from false love.\n\"Always pick true love,\" he said.\n\nGod bless Pope Francis! And shame on that sexual deviant.",
            "No",
            "Why does he care? He will just immigrate to the US or Canada anyway where divorce and LGBTQ are legal.",
            "shocking",
            "Ateneo has been overrun by modernists",
            "lol the bbc. The most anti catholic media in the world. You could\nAlmost set your watch to their daily hit piece on the church. ",
            "I'm from the Philippines. When I read about this article yesterday, I literally laughed off because those are actually students from a prestigious Catholic school and I can't believe that he asked the Pope to allow divorce in our country when even the Catholic Bishops Conference of the Philippines (CBCP) cannot even stop the bill from becoming into law should our president approve this. What's more interesting here is that, each time there are moral issues to be debated like divorce, same-sex marriage, abortion, etc. the progressives would usually use the \"Separation of Church and State\" card literally telling religious people to stop using religion in matters concerning these issues, yet here they are asking the Pope to do something which obviously he has no authority.",
            "It's really disturbing how emboldening some of you find the pope's referring to gay men in this way",
            "[removed]",
            "I agree, it's not very nice of him.",
            "I think there are two relevant sections. That is, given true love and one of its meanings:\n\nhttp://www.scborromeo.org/ccc/p3s2c2a6.htm\n\n> 2358 The number of men and women who have deep-seated homosexual tendencies is not negligible. This inclination, which is objectively disordered, constitutes for most of them a trial. They must be accepted with respect, compassion, and sensitivity. Every sign of unjust discrimination in their regard should be avoided. These persons are called to fulfill God's will in their lives and, if they are Christians, to unite to the sacrifice of the Lord's Cross the difficulties they may encounter from their condition.",
            "That’s what he need more of from pope Francis.",
            "Not ambiguous at all. Saying to someone who defines true love in a progressive manner to always pick true love sure isn't confusing at all! Surely they won't apply their meaning of the term over what you said and if they do it the sole source of confusion is the nasty media (as if they weren't capitalizing on a confusion already there)",
            "Frankly, that's confusing as it sounds like an endorsement of the LGBTQ+ community.",
            "Asking that from Pope Franics shows their hand. An actual Catholic would know it's outside the authority of any pope to undo what God has done.\n\nWhich begs the question - why do non-Catholics care? The answer is simple. To undo the \"old world\" to usher in the new  rebellious world. I wonder who's spearheading this effort...",
            "https://www.npr.org/2024/05/28/nx-s1-4983747/pope-francis-apology-slur-gay-men-vatican",
            "Not even the word of God, but just the laws of a sovereign country. Unlike some other countries, divorce is impossible in the Philippines, legally speaking. So it's not just Catholics who can't be divorced in the Philippines, it's everyone, including Protestants and non-believers who have a civil ceremony (but apparently, there are some exceptions for the Muslims).\n\nAnd I don't think that's something the Pope can do anything about.",
            "They think the Pope is an absolute monarch like Louis XIV",
            "Well if I do remember correctly, the Catholic Church does allow for annulments for marriages that do end in divorce.",
            "They shouldn't, but with how important sex is in a person's life, it's a powerful thing that can control a person to see it as their identity or take pride in it; especially if they feel as if that identity is being opposed. It's a sad crisis and we should pray for them",
            "40:40 is when Jack Lorenz Acebedo Rivera speaks.",
            "AFAIK the Philippines is actually pretty accepting of gay folks. I wonder if it’s a one-off or more complicated than he’s letting on.",
            "How can he be bisexual and gay? Bisexual already includes attraction to men",
            "Indeed. In fact, it's not even part of office attire, which is what's needed for such discussions.",
            "I have several Filipinos in my church. My *priest* is Filipino. Mr. Rivera is *definitely* an outlier. Like you said, especially with as much as Pope Francis has been discussing SSA lately, it's possible this was a set up, but then again, it's a university in Manilla, so who knows? I found it odd how he shoehorned in the Muslim bit too. I don't know, of all the priorities for the Church to be concerned with, I'm not sure he addressed many of them.",
            "We should pray for the conversion of the student. That was quite a scandalous public stunt to make. Definitely, wouldn't consider the positions to be 'in full communion' with the Catholic Church. This is why we must all make full use of the Sacrament of Reconciliation.",
            "Actually, my struggle is that I feel deeply insecure about losing my parish, a place of deep importance for my children, my wife, and myself. Our parish is our home. My 11 children have known no other liturgy other than the traditional Mass. This is our rite. And we live in fear of being scattered to the wind. My job as father is made more difficult by most news that comes from the Vatican.",
            "Yep, saying \"always pick true love\" to someone who thinks homosexual relationships are true love isn't confusing at all...",
            "https://www.reddit.com/r/Catholicism/comments/1dllq1v/pope_told_by_student_to_stop_using_antilgbtq/l9prb3i/",
            "It reports on the video shared here:\n\nhttps://www.reddit.com/r/Catholicism/comments/1dllq1v/pope_told_by_student_to_stop_using_antilgbtq/l9png8r/",
            "Are you disturbed right now?",
            "> He did not address Mr Rivera's concerns specifically but he said through a translator that he was advising Mr Rivera to differentiate true love from false love.",
            "Lol",
            "Well, I meant from the BBC article you shared with us.\n\n**EDIT:** But yes, thank you for sharing that as well. Since this thread shouldn't be used to discern what *is* or *is not* true love among us. We have the Church for these purposes.",
            "Can you break that down in a bit more simple English?",
            "That seems fair. I believe it might be shortsighted for the Pope to anticipate that others would grasp the intricacies of his language without providing some form of clarification to prevent them from drawing their own potentially inaccurate conclusions. However, considering that media coverage often provides only brief soundbites, it's possible that the Pope may have conveyed more nuanced thoughts in private discussions. It's unclear, but I offer my prayers for him.",
            "Is this a troll? Are you doing a bit?",
            "I didn't read it that way at all.",
            "Is love not good? Especially true love?? It’s the safest answer and frankly the pope is in a giant crowd full of cameras and people wanting to interact with him…it’s not the place for a lecture. The pope has spoken about same sex marriage plenty of times.",
            "They just think the Pope is the absolute monarch of catholicism, as if he is Louis XIV",
            "I can only imagine they care for the same reason Catholics care about non Catholics using anti Catholic language.",
            "He said it after that too.",
            "Right? It's entirely a civil matter in the Philippines. What can the Pope due outside of legal jurisdiction? Nothing. Besides, even if he could, he wouldn't change doctrine on the matter to have a law overturned anyway. He doesn't have the interest and more importantly, doesn't have the authority to do so.",
            "Annulments are declarations that there was no valid marriage to begin with due to some defect present at the time the sacrament was attempted. You aren't guaranteed an annulment, and the sacrament enjoys a legal presumption of validity like accused people enjoy a presumption of innocence.",
            "True, it's very powerful, even true of hetero sexuality: people can define themselves by it.",
            "The main complaint is that gay people are relegated to jesters in Filipino society rather than being \"accepted\" as in Western society. You wont see any gay TV shows without being given R-18 status  and some backlash\n\nAlso  the large Muslim communities still are not very accepting for obvious reasons",
            "I think he was referring to being bullied for the gay side of his bisexuality.",
            "I think attraction to men by a man is part of being gay.",
            "Of all the students at a Catholic university, they pick the gay bi rainbow sash kid to have the honor of addressing the Pope. Def an inside job.",
            "Indeed. This seems like an “inside job”- someone trying to change the Church “from the inside”, whether or not they have faith in the Church and the promises it makes, and the promises it was given.",
            "Well, I'm not calling out folks like you or me, but the schism-baiters. You have a lot of good reason to be nervous about it. There's a lot of push towards a universal liturgy.",
            "If you identify more with a rite than with the church itself, isn’t that a sign of a problem? ",
            "He also said don’t choose false love, and from prior teaching, his upholding of one man and one woman in a relationship as effectively the true love.",
            "We hear what we want to hear. That's basic human psychology.",
            "> The number of men and women who have deep-seated homosexual tendencies is not negligible.\n\nThere are a lot of people who struggle with homosexual tendencies. \n\n>This inclination, which is objectively disordered, constitutes for most of them a trial. \n\nSuch people struggle and feel conflicted between these desires and their faith.\n\n>They must be accepted with respect, compassion, and sensitivity. Every sign of unjust discrimination in their regard should be avoided.\n\nDespite how unusual it may appear to Catholics who don't have these tendencies, we should treat them with respect, compassion, and sensitivity, and avoid dehumanizing and condemning them for these disordered impulses. \n\n>These persons are called to fulfill God's will in their lives and, if they are Christians, to unite to the sacrifice of the Lord's Cross the difficulties they may encounter from their condition.\n\nLike us, people with these tendencies are *also* called to seek fulfillment and union with God; handing over their plights and trusting Him.",
            "Many people experience ssa and we don't know exactly why. We do know that we must treat them like we'd like to be treated and refrain from abusing or discriminating against them. They are called to do God's will still and to unite whatever sufferings they face to Christ's sacrifice on the cross",
            "The Pope can't walking everyone through Salvation History Genesis to Revelation in every discussion.\n\nHe has to assume a baseline knowledge.",
            "Always pick true love?  If someone has SSA, they will, I'm assuming fall in love with someone of the same sex.  Anything other than that would be false love.",
            "I believe love is good, yes.  I have no issue with LGBTQ+ relationships.  I'm sorry if my comment came across differently.",
            "I mean, he sort of is. He's a monarch so absolute, he can even bind future monarchs. And is bound by the monarchs of the past in turn.",
            "I was speaking in a more metaphysical sense. \n\nRegarding your comment, as Catholics, I would say focusing on derogatory comments made by non-Catholics is a lack of focus. It's better to live properly than worrying about what strangers say. You can't control people's thoughts and words, but you can prove them wrong by your life. \n\nI do understand being upset by derogatory comments. It gets to me, too, but pivoting back to what's really important - faith in Christ - is more productive, in my opinion, than say, for example, telling the pope what to say and do. This is just me, but maybe the ideology of the sash he's wearing is more important, which explains why this happened.",
            "I'm from the Philippines. When I read about this article yesterday, I literally laughed off because those are actually students from a prestigious Catholic school and I can't believe that he asked the Pope to allow divorce in our country when even the Catholic Bishops Conference of the Philippines (CBCP) cannot even stop the bill from becoming into law should our president approve this. What's more interesting here is that, each time there are moral issues to be debated like divorce, same-sex marriage, abortion, etc. the progressives would usually use the \"Separation of Church and State\" card literally telling religious people to stop using religion in matters concerning these issues, yet here they are asking the Pope to do something which obviously he has no authority.",
            "Doesn’t gay typically mean homosexual and not bisexual attraction though?  He could say maybe bisexual and queer which is more of an umbrella.",
            "When I was a university student, my professor admitted that our school had a diversity quota. They had to include and represent at least one hundred foreign transfer students in their curriculum for cultural diversity purposes. This was because the university was located in a small, rural area. The idea was to help the local students learn about different cultures. I wish I were making this up, but the expressions the professor used were even more blunt. Most liberal arts universities, whether private or public, have similar agendas. Why? Because educational departments and administrations impose these quotas on schools in exchange for funding. Private schools often follow this for the same reason: affluent, typically more liberal donors. I don't know how much of this is policy and how much is mandated, but regardless...\n\nI tend to agree with you on this. It seems terribly ironic to select that particular student to represent and reflect the interests of other students and the university as a whole by offering them a position on that panel. I understand the desire to be inclusive and provide diverse perspectives, but ultimately, I question the value of this compared to the majority census at a CATHOLIC university. If I were a donor, I would want the university to express CATHOLIC ideology, not secular ideology. Unfortunately, that's not what happened. Maybe the student had a right to express their opinions, but was it the proper forum for it? What good did it do, except generate publicity through controversy? That’s the issue. Pope Francis has never 'scandalized' me, if you will. It’s the cheap tactics others use against him that should be scrutinized because they actively attempt to undermine our faith by using individuals who claim to be Catholic but sound like modernists.",
            "He did not say any thing to suggest this",
            "So you were ok with the latinization of the Eastern rites?",
            "Yes, but when you speak with someone it is simply inneficient to ignore the meaning they ascribe to your words. If you are someone important you have to make it certain that your words don't need context and more context and more context, being concise and going direct to the point helps with that.",
            "And that is why someone whose words have great influence over others should do whatever they can in their wording to minimize this tendency of human nature",
            "That interpretation is all you, and it's British tabloid-level drama seeking. I'm not saying it's deliberate, just that you might have a taste for drama even when it's not there.\n\n\nA more reasonable inference is that true love is that which is inline with natural law, you know, that thing the Church has consistently promoted for millennia.",
            "The way Pope Francis sighs and leans back in his chair lol\n\n[41:32](https://www.youtube.com/live/OaYFc8zQ4u0?si=MMuvSg_wCFvBbU1E&t=2491)",
            "Really? Loving their siblings or parents or friends would be false love? Loving God Himself would be false love? All love is false unless it involves sex?",
            "SSA couples do not experience true love.",
            "You're forgetting the magisterium",
            "He’s not the monarch, he’s the viceroy. The monarch is Christ. The viceroy rules in place of the monarch. ",
            "I think there are gays who aren't bisexual.",
            "He might not, but the language is kinda ehhh. It's OK to love a rite, especially if it's culturally connected to you, but it just came out weird",
            "Jesus spoke in parables. And the Pope didn't have time for a complete de-cultification of the man.",
            "For some people, even the best explanation is insufficient. Also, Pope Francis is extremely busy so I doubt he has time to prepare or preface everything he says. On one hand, I agree, but on the other, I disagree. In the end, I trust the Holy Spirit to guide the Church.",
            "I assume by natural law, you don't mean 'occurring in nature'.",
            "No, but I assume this was in reference to romantic love.",
            "I don't understand.  I've been told on this sub in fact that the act of homosexuality is the sin, not the feeling.  So an LGBTQ+ couple could be together, as long as they were celibate.  I can't imagine a truer love than that.",
            "Casual Sex Culture (also widespread on straight couples) probably being more common on homosexuals doesn't mean true love doesn't happen",
            "Am I though? [CCC 85] describes the magisterium as subordinate to the Bishop of Rome and the bishops in communion with him.\n\nWithin the limits set by his predecessor, of course.",
            "No, they're referring to the Catholic concept of 'natural law', being essentially the objective moral sense that God has given all people that enables them to discern good and evil. It has nothing to do with what occurs in nature.\n\nThe Pope was very clearly not endorsing homosexuality in this comment. Any interpretation that he did clearly comes from some peoples' assumptions that he somehow secretly supports a bunch of progressive causes despite repeatedly denying such.",
            "Your assumption is correct, because that's not what it means to in the slightest.",
            "\"Natural law\" is just a way of pretending they're not just citing faith/doctrine. Some better apologists can play with flowery language to disguise it, but a shortcut to cutting through the distractions is to ask:\n\n* What premises are at the foundation of natural law?\n* Through what method could I _independently_ reconstruct natural law from those premises?\n\nHeavy emphasis on \"independently\" because you'll find that natural law depends on appeals to authority and prophets to determine what is or is not \"natural\" or \"ordered\". Even if you go back to ancient Greece.",
            "Being a gay couple is acting on the tendency, with or without sex.  It also links to the sin of scandal.",
            "No, a celibate couple is still sinful.",
            "[**CCC 85**](http://www.scborromeo.org/ccc/para/85.htm)  \"The task of giving an authentic interpretation of the Word of God, whether in its written form or in the form of Tradition, has been entrusted to the living, teaching office of the Church alone. Its authority in this matter is exercised in the name of Jesus Christ.\" This means that the task of interpretation has been entrusted to the bishops in communion with the successor of Peter, the Bishop of Rome. ([888](http://www.scborromeo.org/ccc/para/888.htm)-[892](http://www.scborromeo.org/ccc/para/892.htm), [2032](http://www.scborromeo.org/ccc/para/2032.htm)-[2040](http://www.scborromeo.org/ccc/para/2040.htm))\n\n\n\n***\nCatebot v0.2.12 links: [Source Code](https://github.com/konohitowa/catebot) | [Feedback](https://github.com/konohitowa/catebot/issues) | [Contact Dev](http://www.reddit.com/message/compose/?to=kono_hito_wa) | [FAQ](https://github.com/konohitowa/catebot/blob/master/docs/CateBot%20Info.md#faq) | [Changelog](https://github.com/konohitowa/catebot/blob/master/docs/CHANGELOG.md)",
            "Yes, that is because natural law is created by God.",
            "Gay people having chaste companionship is a sin now because they’re gay? ",
            "So why did the other comment say “ inline with natural law, you know, that thing the Church has consistently promoted for millennia” and not “ inline with the Church, you know, that thing the Church has consistently promoted for millennia”?",
            "Friendship is not a sin, but a romantic relationship without sex is still sinful."
        ]
    },
    "My therapist expressed worry over my interest in the catholic church because of focus on guilt.": {
        "title": "My therapist expressed worry over my interest in the catholic church because of focus on guilt.",
        "score": 22,
        "url": "https://www.reddit.com/r/Catholicism/comments/1dlq067/my_therapist_expressed_worry_over_my_interest_in/",
        "content": "What should I say in response? I mean, my interest is because I believe the historical evidence points to the catholic church, not because of some personal feelings or because I’m magically “born again” like some street preachers talk about. I came to a new understanding of history that matters a lot.",
        "num_comments": 35,
        "comments": [
            "Your therapist’s comment reflects a misunderstanding that is unfortunately quite pervasive in the broader culture. The Catholic church isn’t concerned with promoting guilt per se. Catholic faith, however, IS centered on belief in a God who is “personal” (actually the 3 Divine Persons of the Trinity united in perfect love) so not merely a conception of some ultimate but impersonal sort of goodness or “higher power.” (Buddhism, for example, is not centered on a personal deity.) Consequently, Judaism, most forms of Christianity, and Islam—as the 3 major world religions that claim the ancient Hebrew leader Abraham as a key figure—all emphasize each individual’s accountability to God-as-Person. “Accountability” doesn’t equate to “guilt.” It’s a way of recognizing the special dignity we enjoy as beings who can choose (or refuse) to reflect God’s own perfect goodness and love.",
            "As someone who had years of therapy, along with at least one terrible therapist, I don’t think it’s appropriate for your therapist to express their opinion of your religious beliefs.\n\nIs your therapist Catholic? Have they studied the faith extensively? On what grounds is it guilt focused? Confession?\n\nI am reminded of a recent comment Jordan Peterson made -“psychotherapy is secularized confession and atonement”.",
            "I had a similar issue with my therapist. He was atheist, which for me would have been fine, but he’d throw in abrasive jabs that made me realize that he didn’t understand my faith. When we talked about important struggles, I’d approach it with a faith perspective, and he’d often ask me to not do that, but approach it normally. I tried explaining that my faith isn’t compartmentalized, and that everything in my life has something to do with my faith, and he didn’t agree. I once mentioned God when we were talking about unconditional love, and he disagreed and said it sounds like I have to do a lot to earn Gods love. This was through Catholic Charities. He was bad in other ways though. ",
            "I’d change therapist. She’s crossed the line. Happened to me too. She encouraged me to have pre-marital sex with my girlfriend 💀",
            "I mean we don’t know the context either. If you are already becoming overly focused on the rules and feeling constant anxiety and guilt over not doing things just right, than she might have a point. I’ve noticed for some personalities, getting too invested in all the Catholic stuff, at least from the Roman rite angle can foster a lot of anxiety and obsessive thoughts. Otherwise idk.",
            "Ask her what she means.",
            "Is it that YOU tend to have overly strong feelings of guilt and you have said that guilt is something that is important in the Catholic Church that attracts you to it? Or is it that HE believes the Catholic Church is fixated on guilt?",
            "That is so inappropriate. My wife is a therapist, she would never comment on her client's personal religious views/faith. ",
            "Catholic theology next to Protestant theology gets the characteristic of being \"guilt focused\". That's more due to \"faith alone\" theology underscores the consequences of sin. Catholics are more upfront about it.\n\nHowever the whole \"Catholic guilt\" thing is more a meme than anything. There's recognition but the focus on Jesus mercy overshadows it.\n\nEdit: If you decide to go through with investigating Catholicism maybe tell the priest about your therapist's worries.",
            "It sounds like your therapist has a pretty oversimplified and stereotypical view of Catholicism. I'd say that if they fail to accept what is the most important part of your life then they are unlikely to be a good therapist.",
            "I feel ya. I personally don't believe in SOME forms of therapy or therapists, but I do understand that it does help people in certain ways and maybe tremendously. Just explain that the guilt is the guilty feeling of sinning that comes with the Catholic Church. Maybe she/he will understand then.\nHopes this helps, and you'll be in my prayers.\nGod bless❤️",
            "Therapy is so overrated.",
            "Ask your therapist if they would express similar concerns if you came out trans or something similar. If they just express concern for the catholic thing, find another therapist.",
            "You should get a new therapist.",
            "Your therapist is a bigot. Get one who isn’t.",
            "Personally, I find \"secular guilt\" more pervasive and insidious than \"Catholic guilt\".",
            "What does she mean by \"focus on guilt\"?",
            "New therapist time. IMO when therapists do this they're crossing an ethical line from therapy into trying to influence your beliefs. This seems highly unprofessional.",
            "The only people I ever hear talking about this are Protestants and non believers. We have the sacrament of confession, once we go we don’t have any guilt. Jesus speaks about forgiveness and love and the bible reminds us that good is a gentle\nMild and loving god. \n\nI’d change therapist no point in see a hate filled lunatic that is regurgitating anti Catholic non sense.",
            "If your therapist won’t work to understand your understanding of the role of guilt and the church’s view, they probably aren’t a good fit. If they are willing to learn that guilt means something different than the cultural stereotype of “Catholic guilt,” which many Catholics themselves believe and perpetuate, then it could end up being fruitful for you and formative in a positive way for them in their work. \n\nI had a non-Catholic therapist who was very willing to learn from me and have me correct her perspectives on the ways that my faith informs my perspective on these things. But I reached a point where I needed to be able to speak more freely without educating so I switched to a therapist who would understand where I am coming from. If she hadn’t been willing to try to humbly learn about my faith, it wouldn’t have been good, possibly harmful. \n\nCould be worth reflecting on what guilt does mean to you, and what God’s mercy means to you and trying to express that. If they are going to stop at just “concern about the focus on guilt” then I agree with other people here that it might be good to switch. But I don’t think that needs to be the automatic response l",
            "What is meant by \"guilt\"?",
            "If you are not someone prone to scrupulosity, OCD, or extremes, you should be fine.\n\nI admit that when I converted to Catholicism I was told that “Catholic guilt” was a myth. But within a couple years of being Catholic the possibility of falling out of a state of grace and losing all charity in my soul in one instant by one action really weighed on me, and I became very scrupulous and focused on sin and guilt in unhealthy ways. Then I found some other Catholics who had these obsessive tendencies as well, and we encouraged them in each other and made it worse.\n\nIt was highly detrimental to my mental health, and ironically the mindset was ineffective at growing in love to overcome sin. But I broke out of that within a couple years and began healing over more years. And I have since met more Catholics with much healthier perspectives.\n\nSo from my experience the “Catholic guilt” stereotype is not a complete myth and something to watch out for, but it is not universal for all Catholics.",
            "I agree with the others: time for a new therapist.",
            "Get a new therapist.",
            "Maybe ask to not let her personal opinion influence the consultation, it’s kinda unprofessional",
            "THANK YOU!!\n\nDon't confuse accountability with guilt.  \n\nThat's all I need to remember as my starting point in conversations with others.",
            "To be fair, some religions definitely are cult-like. I suspect some conflation. Maybe they don’t take into account the confessional seal compared to scientology for example exploiting your secrets.\n\nIt wasn’t exactly an in depth conversation.",
            "This is actually one of the challenges I have with this sub sometimes I’m regards to scrupulosity.  “Go see a therapist” is often the first, and only advice given.  And yet we know psychology isn’t always amenable to faith.  It can be really helpful, and I encourage anyone struggling to go to therapy, but we can’t neglect our duty imho to define what is and isn’t sin.  That’s not the therapists job, it’s ours.",
            "diabolical.",
            "Yes especially if OCD or anxiety is an issue. I can’t lie, I know *many* Catholics who have struggled with scrupulosity or OCD-like tendencies at one time or another, myself included. \n\nNot every Catholic struggles in this way, and for some it’s just a passing phase, but it is a real issue for some.",
            "I think it's fair to say that there is a big focus on guilt in Catholicism. That's for a reason, but the claim that guilt is a big thing here, is not wrong. We have obligatory confession, where you are required to examine your conscience and make a list of sins you are guilty of, and then confess them to someone who has the authority to tell you how wrong you were for those sins. We have the Confiteor, where we admit our guilt at Mass on Sundays (\"through my fault\" etc), we have recommendations for a nightly examination of conscience, and we have the extremely strict \"rules\" where a lot of things that are considered \"normal\" in modern culture are considered sinful in the Catholic Church. So in that sense, she's not wrong.\n\nObviously, in another sense, she's wrong. We admit guilt so that we can enjoy the mercy of Christ and be cleansed of our sins. Going to confession, in addition to being theologically required, is a huge source of comfort for many people. Also, guilt is not something invented by the Catholic Church. It's something we evolved with. If there were no Catholic Church, we would just feel guilty about different stuff, but here's the thing: with no possibility of redemption. \n\nI do think that cradle Catholics can go overboard on guilt and sometimes we focus more on looking inward and ruminating on our own faults and on how poorly we are doing, rather than focusing on Christ and His redemptive power.",
            "The problem with secular guilt is that there is no true redemption. Because there is no one to redeem you. You might be told that you are forgiven, by your boss, your friends, your social group, but whatever you did will be stored up and used against you later, because the people who are forgiving you are just as flawed as you are.\n\n And, in some (growing) portion of that culture, there isn't even a belief in free will. How can you be forgiven for your actions if you never freely chose to do them? Instead, you're doomed to being told that this is just the way you are. Then, depending on whether your flaws match those the culture finds acceptable, you are either told that you don't need to change (and therefore you should keep doing the very same things that have been making you miserable) or you are told you are a monster and should be cast out of society and fired and have your life ruined because you committed some microaggression that the internet deemed harmful.",
            "I was going to say, I’ve never felt more guilty about literally just existing than when I was away from the church and embraced modern secularism. Things like examining your conscience and going to confession may be interpreted as being guilt-ridden but I’ve found so much freedom and redemption in them.",
            "You're probably right about that. Secular guilt involves the person having to deal with their conscience when they do something that harms someone else. Then they feel a need to make up for it by righting the wrong that they committed, or if it can't be righted, then their conscience feels a need to do beneficial things for humanity to correct the balance.\n\nReligious Catholic guilt is much easier to remedy. You just ask Jesus or a priest to forgive you, and it all goes away.\n\n/sarcasm\n\nI don't like this train of thought because it implies that Catholics are morally lazy and prefer to be religious because it lets one get away with murder and just say, \"Whoops, sorry, love you, God! We good?\" and it all goes away. We need to have accountability to our fellow man or we are a stain on this Earth.",
            "I would only encourage someone to see a Catholic therapist for this exact reason."
        ]
    }
}