{
    "Monthly Events & Things To Do in Chicago Thread": {
        "title": "Monthly Events & Things To Do in Chicago Thread",
        "score": 34,
        "url": "https://www.reddit.com/r/chicago/comments/1d5fdu2/monthly_events_things_to_do_in_chicago_thread/",
        "content": " Welcome to the monthly [/r/Chicago](https://old.reddit.com/r/Chicago)  events thread. This is the place to advertise any upcoming events or  group gatherings you're a part of or anticipating that other Chicagoans  might want to know about.\n\nThis thread is exempt from Rule 8 regarding promotion, so we invite  anyone and everyone to advertise anything going on in Chicago. But  please be mindful of rules 2 & 3 which still apply in this thread,  as well as the Reddit Content Policy when posting.",
        "num_comments": 76,
        "comments": [
            "If you are a parent who'd like to introduce biking to your kiddos - there's Lincoln Park Kidical Mass this weekend at 9 AM Sunday [https://www.chicagofamilybiking.org/eventscalendar/lincolnpark2405](https://www.chicagofamilybiking.org/eventscalendar/lincolnpark2405) starting at Oz Park.",
            "The Field Museum is free for Illinoisians every Wednesday for the rest of the year! Wednesday opening hours are from 9 AM to 5 PM.",
            "https://www.freshwaterlab.org/projects/backward-river-festival-damen-silo-city\n\nSaturday, June 8, 2024 | 2 to 6 p.m.\n\nCanalport Riverwalk Park\n\n2900 S. Ashland Ave., Chicago, IL 60608\n\nThe Freshwater Lab at the University of Illinois Chicago invites you to reclaim your water and foster a sense of joy and possibility through music, performance and community connection. Meet us where the legendary Damen Grain Silos tower over the South Branch of the storied Chicago River.\n\nFree and open to the public. No tickets are necessary to attend. \nCelebrate the efforts and achievements of environmental justice advocates and artists. \n\nLearn about the history of the silos and their current state.\nEnjoy knowledge-sharing and performances on the main stage.\nImagine alternatives for the silos while considering the impact of demolition on residents. \n\nEngage with the river and each other through curated activities and art installations.\n\nConnect in meaningful ways with representatives from community-based organizations.\n\nThe Backward River Festival: Damen Silo City is the final event of a program supported by the University of Illinois Presidential Initiative for Arts and Humanities in which The Freshwater Lab hosted cultural events along the South Branch of the Chicago River: a two-day festival in October 2021 at Park 571; an activation event in September 2022 at Canalport Riverwalk Park to launch Rio de Bienvenida/River of Welcome; and another festival in June 2023 at Park 571 to unveil Rio de Bienvenida/River of Welcome. \n\nThe Backward River Festival: Damen Silo City is also supported by a generous donation from the Chicago Frontlines Funding Initiative.",
            "Join [The Chicago Undersea Explorers Society](http://divecues.org) at our annual fundraising gala, [Scuba Prom!](http://scubaprom.eventbrite.com), on June 22nd at Third Space in Lakeview. \n\nTickets are on sale though June 21, and include food, drinks (open bar with beer, wine and party punch) a DJ and dancing, a silent auction, games and prizes, a Prom Court and more — all proceeds support our scholarship program which helps us provide free and low-cost SCUBA training to divers in Chicago and NW Indiana. \n\nJune 22  \n7-11pm @ Third Space Lakeview  \n[scubaprom.eventbrite.com](http://scubaprom.eventbrite.com)\n\nProm attire encouraged. Snorkel not required.",
            "Good list of things to do all month: https://www.thesavvyglobetrotter.com/things-to-do-chicago-june/",
            "Your friendly improv redditor here with another shoutout to Malarkey House Teams which plays Wednesday nights at 7pm at the iO Theater! Tickets are $5 and you get to see THREE teams perform improv! Great for date nights and middle of the week pick-me-up!\n\nTickets here: https://ci.ovationtix.com/36725/production/1174977",
            "Thai food festival is this weekend!\n\n* June 8, Saturday: 10am - 9pm\n* June 9, Sunday: 11am - 7pm\n\nAt 851 W. Irving Park Rd, Chicago, IL (just ~~west~~ east of the Sheridan red line)\n\nEvent FB page: https://www.facebook.com/thaifestivalchicago\n\nEdit: it's east of Sheridan, not west",
            "If you like puzzles, cryptography, magic, or escape rooms, I highly recommend The Enigmatist at Chicago Shakes https://www.chicagoshakes.com/productions/the-enigmatist/ it's here through the end of the month. Definitely show up early to do the pre-show puzzles!",
            "Check out local musicians! There are plenty of shows at venues across the Chicagoland area. My band, Everyday Fantastic, is playing at the Cubby Bear on June 20th!",
            "We are working on bringing Indoor paintball to Chicago!\n\nWe are just gathering support in the form of signatures. Looking for 1000+ Already have over 770 signatures!\n\nFor more information check out our [Change.org](http://Change.org) petition in the link below:\n\n[Windy City Wasteland](https://change.org/chicagopaintball)",
            "# COIMETROMANIA CEMETERY TOURS & EDUCATION\n\n•\n\nCoimetromania's inaugural cemetery tour weekend at Graceland Cemetery this June! In just two hours, we will demystify cemeteries by discussing the basics of cemetery culture and design while learning about Chicago’s most influential figures. Join Grace Robbins, former Visitor Services Ambassador at Graceland Cemetery, for an engaging walking tour to gain a foundational understanding of what makes cemeteries such fascinating places of community, remembrance, and reflection.\n\n•\n\n# Cemetery Tour Dates: [https://www.eventbrite.com/o/coimetromania-76014612463](https://www.eventbrite.com/o/coimetromania-76014612463)\n\n•\n\nCemetery Insights on Instagram: [https://www.instagram.com/coimetromania.chi/](https://www.instagram.com/coimetromania.chi/)\n\nCemetery Community on Facebook: [https://www.facebook.com/profile.php?id=61555719097276](https://www.facebook.com/profile.php?id=61555719097276)\n\nHistorical Research on Substack: [https://coimetromania.substack.com/](https://coimetromania.substack.com/)",
            "I don't know if there are any writers in this sub, but there's a one-day writing conference at the Hotel Plaza Congress this Saturday. I'm teaching two workshops: one on Outlining for Pantsers, and one on Creating Characters That Agents and Readers Love. Check it out! \n\n[https://chicagowritingworkshop.com](https://chicagowritingworkshop.com)",
            "Any good places to see a lot of cicadas between downtown and the western suburbs? My daughter wasn't alive for the last round and I want her to see an area where there are a lot. Thanks",
            "https://www.eventbrite.com/e/solidarity-in-nature-music-festival-tickets-901564272007\n\nSolidarity In Nature Music Festival\n\nAt North Park Village Nature Center\n\nJune 15, 2024\n\n4 - 8 pm\n\nFree",
            "Bucktown Backgammon Tournament at Green Eye Chicago tonight at 7:30PM.",
            "There is a FREE legal educational event for Family and Housing Law on Saturday June 8. Hosted by an Attorney…includes QA.\n\n[https://www.instagram.com/p/C7kibi4M178/?igsh=NGRtc2c2bWdoMXAz](https://www.instagram.com/p/C7kibi4M178/?igsh=NGRtc2c2bWdoMXAz)",
            "Some Juneteenth events going on next Wednesday! \n\nThank You Chicago Juneteenth Market at The Promontory (Hyde Park): https://www.eventbrite.com/e/2024-thank-you-chicago-juneteenth-market-tickets-873003265267#tickets\n\nRefine Collective Presents the 4th Annual Juneteenth Freedom Market @ The Salt Shed: https://www.ticketweb.com/event/refine-collective-presents-the-4th-the-salt-shed-outdoors-fairgrounds-tickets/13496134",
            "Hi everyone.\n Do you know a bar where I can watch Copa América in Lincoln Park/ LakeView area? I'm asking because I want to watch today Chile vs Peru and I know there isn't much interest in that match.\n Thanks for your help!",
            "Hey, mods, I suggest adding into the text from your other catch-all thread text:\n\n> Also, check out the [/r/Chicago Event Calendar](https://calendar.google.com/calendar/embed?src=chicagosummercalendar@gmail.com)\n\n> where to [visit](https://www.reddit.com/r/chicago/wiki/visitingchicago)",
            "# Want 2 tickets for Jeff Tweedy Solo Tonight at The Vic??\n\n# Will transfer via the AXS app. Seated general admission. I can't make it so will take best offer, below face value :)",
            "Is there a public place to launch a paddle board with a locker to store stuff on land?\n\nI just bought an inflatable paddle board, but I don’t have a car, so I’ll be traveling to wherever I launch using the CTA or my bike. Once I inflate the paddleboard, I’ll need to store the pump and large duffel bag I’ll carry it in. I know I could store this stuff on the board itself and just bring it with me, but is there anywhere that has lockers you can use to keep that stuff in while you’re on the water? I’ll go anywhere I can get to via CTA.",
            "Cosmetic Dermatology recommendations in Chicago\n\nI'm new to Chicago and from outside of the US. Going about the medical system in the US has been quite different for me tbh, like scanning one's photo ID. Just very different cause usually where I am from you just give the insurance number and that's it, or just register by writing on paper but everything in the US is done online, even payments. Anyways, any cosmetic dermatology recommendations in Chicago?",
            "Is motoblot free entry? Their website has ticket sales but I'm leaning towards thinking that it's for donations only like semevents?",
            "Here's a [big list](https://blockclubchicago.org/2024/05/20/the-ultimate-chicago-summer-guide-2024-120-fests-fairs-and-more-fun/) of events running all summer!",
            "When the fuck did Billy Goat move in to Wrigleyville?",
            "I have two tickets for Monsieur Periné tonight; GA, send me a message if interested.",
            "Booked a vacation downtown during the NASCAR race. How screwed am I? My family is taking a train up to Chicago on the evening of Saturday, July 6 through the afternoon of Tuesday, July 9. We were going to walk everywhere (Navy Pier, Shedd, Field Museum, Children’s Zoo, Lincoln Park Zoo/Conservatory, Daley Center, etc). Is that actually going to be possible?",
            "Not sure where to ask this.\nI'll be spending some time at Northwestern Hospital for school and was wondering if anybody knows if there is secure bike/e-scooter parking.\nThanks!",
            "Im in Chicago for a month for work, my work is at Chicago ridge, Worth. \n\nWhat’s the best place to live in for this month and how can I get to Chicago ridge in the most cost effective way?",
            "Anything going on for Eid?",
            "Anybody looking to sell tickets tomorrow for the Jazzin at the Shedd event? I'll pay the face value.",
            "i know chicago has its own \"open community\" for people that are lgbtq and stuff... where is that by exactly? if someone wanted to make friends that are more...open and stuff where are good places to go? (lets say i grew up in an \"enclosed\" lifestyle so i know barely anything about much about stuff.) i dont mind giving more info and stuff.",
            "The regional mass transit company in Las Vegas runs a dedicated bus along Las Vegas Blvd that connects downtown to The Strip. The busses are double-deckers. The interiors are clean. They even offer reading lights and AC vents like you'd find on an airplane. It's $6 for a 2 hour pass / $8 for a 24 hour pass. I really wish that the CTA would adopt something like this for the most popular routes such as the Loop, LSD, Clark Ave, or Western Ave. The only downside to this bus route is the name: The Deuce. I get that they were going for the poker reference but... it's like... phrasing? Yeesh.",
            "wtf is going on next week in the city that there are very few hotel rooms left? I don't see any big conventions (unless that HR convention is larger than I thought) in town. \n\nfor example - hyatt - every hotel is booked up except for the one in the west loop and they're asking for $630/night. \n\nwhiskey tango foxtrot.",
            "We're planning to come to Chicago September 6 - 10th, we noticed that hotel prices that week seem to be almost double the weeks preceding and following, any idea what's going on in the city those days that would cause prices to be double?",
            "6 Amazing Events to attend in Chicago this weekend;\n\nFat Plate Fridays Pop-up BBQ\nEmporium Fulton Market\n\n Hyde Park Jazz Festival Artist Corps June Performances\n4015 W. Carroll Ave.\n\nRiver of Deliverance: Juneteenth Dinner\nNational Museum of Mexican Art\n\nBronzeville Vendor Fair & Wildflower Music Festival\n3201 S State St.\n\nOLIO Presents: Less Is More\n2352 N Clark St.\n\nThird Friday Open Studios\nBridgeport Art Center Chicago",
            "Does anyone know a good gym to play some bball? I'm planning on having a bachelor party sometime in the late summer with about 4-6 friends and would like to find a place to play some 4 on 4 or 5 on five, preferably an indoor court (could be paid if need be). I don't mind places like LA Fitness or 24 HR as long as the games are good and there's no drama.",
            "omg, Kidical Mass.  That is too damn cute.",
            "Juneteenth this would be a good move for people that have it off",
            "Ugh, that I heard about this too late. I may likely have gone to this, if I got word about it in advance. :(",
            "Never been to that theatre.  Are there any \"bad\" seats there?  For a show like this I gotta imagine the closer the better.",
            "Not exactly the area you want but the Chicago Botanic Garden had a ton last weekend and it's an awesome garden with a nice kids zone.",
            "The Globe or AJ Hudsons are both bars that show a lot of soccer. Both will have the game on, I'm sure. Probably won't be a super big crowd interested, but they will be on.",
            "You could probably get Will’s to turn it on and Butcher’s Tap and Tuco and Blondie will likely both have it on",
            "I believe the Lincoln Park Zoo has lockers and it's right by the south lagoon where you could launch.",
            "About a month ago",
            "The NASCAR race will only affect things on the Museum Campus. From your list, that's the Shedd and the Field Museum. The Field Museum has a [page on their website](https://www.fieldmuseum.org/know-before-you-go-nascar) about the Nascar race. The Shedd doesn't, but from clicking around on their website it looks like they'll have reduced hours (10-4 instead of 9-5/6).",
            "Do you mean bike racks, or do you have something else in mind? There are some basic bike racks outside the hospital.",
            "It depends what you are looking to do -- if we're talking about generally LGBTQ-friendly neighborhoods, the most popular are Northalsted aka Boystown (the party zone), Andersonville (older demographic, more chill area with shops and restaurants). Logan Square and Wicker Park are trendy neighborhoods that host plenty of queer-friendly events. Check our [https://gay.do312.com/](https://gay.do312.com/) for events, Eventbrite is also a good place to look for things to do. Facebook also has Chicago LGBTQ groups :). I hear Slomo is a great party. Anyway I'm rambling, but Chicago has plenty of opportunities to connect with the LGBTQ community.\n\nP.S. I'm a straight woman, but I saw nobody answered this yet, so I thought I would at least get the ball rolling (:",
            "It’s a big HR conference, SHRM is massive and the conference goes to Wednesday",
            "It's June in Chicago. Prime tourist season.",
            "Is it Pride related, perhaps?",
            "SHRM - huge HR convention has the city's hotels completely sold out (am hotel guy).  June is a bad month if you're looking for good rate (ASCO, Neocon, SHRM, etc.)",
            "International Manufacturing Technology Show at McCormick Place draws 100k+ attendees to the trade show",
            "Lots going on that weekend.  Taste of Chicago? Lit Fest?  Tom Jones at Ravinia?",
            "East Bank Club.",
            "It's a small black box with stadium seating and 2-top tables in front. You'll have a good view from anywhere, but if you want to get called on you'll have the best luck if you're sitting at one of the tables.\n\n\nHave fun! I really loved it.",
            "Thanks",
            "To add on: the Reveler I’m at turned on Netherlands-France",
            "I appreciate you!",
            "More secure. I didn't want to leave my scooter outside. Some Swedish Hospital buildings have bikes within cages that our badges get us into. We started using them more after a friend had her U lock cut out front.",
            "🧐 ill check that website",
            "Wow, had no idea …",
            "I’d understand if it was the weekend, but seems like the HR conference is sucking the rooms",
            "all the way to Wednesday?",
            "Cheers, thanks for the info",
            "HR is the worst.",
            "There's the Pride Fest one weekend, the Pride Parade the following weekend.",
            "We noticed the same thing a few years ago during Market Days. I couldn't fathom why hotels (checking for a friend) were $300+ per night."
        ]
    },
    "Weekly \"Meet me at Broadway and Sheridan\" Casual Conversation & Questions Thread": {
        "title": "Weekly \"Meet me at Broadway and Sheridan\" Casual Conversation & Questions Thread",
        "score": 19,
        "url": "https://www.reddit.com/r/chicago/comments/1dhq8uv/weekly_meet_me_at_broadway_and_sheridan_casual/",
        "content": "Welcome to /r/Chicago's Weekly Casual Conversation & Questions Thread.\n\nThis is the place for casual discussions that may not warrant their own post, or questions/topics not allowed as their own posts under our content policy. Please be mindful of rules 2 & 3 which still apply in this thread, as well as the Reddit Content Policy when posting.\n\nAlso, check out the /r/Chicago wiki for other Chicago-related subreddits, where to eat/drink, how to get around/navigate the CTA, where to visit, what neighborhoods to move to or hotel in, tips on living here, and more. And be sure to use the search feature to find responses to other users asking similar questions.\n\nThis thread is sorted by \"new\" so that the most recent comments appear first. The new weekly thread is posted every Monday morning at 12:00 AM.",
        "num_comments": 164,
        "comments": [
            "Stay cool this week, y'all.",
            "[Cooling centers. Check on your neighbors this week.](https://www.chicago.gov/city/en/depts/fss/provdrs/serv/svcs/dfss_cooling_centers.html)",
            "How many of you have Wednesday off?",
            "Any recommendations for bars to watch Euro/Copa America at?",
            "Bruh, what is up with real estate agents fronting as the landlord getting all upset when getting asked for more information about the location of the apartment they listed?\n\nReached out to an Evelyn Soto from Realty Professional Group for a unit that they didn't disclose the address to. Asked if they could share the address of the unit so I could figure out commuting logistics, and they replied back with a range of the location (located between the L Line and expressway). Asked again but mentioned if they could provide the intersections instead since I dont have a car and want to figure out commuting, and they just cussed me out in their response. Like wtf? If you don't want to answer questions, just list the address.\n\nWhoever lands that unit, good luck.",
            "Instead of speed cameras I'd rather there was a camera that caught people blocking the intersection when the light turns red.\n\nThey don't even have to get a ticket, just send me the address and I'll come hit their big toe with a mallet.\n\nI'll never understand the mindset, you're literally in bumper to bumper traffic. You're actually better off stopping at the light and let the traffic spread out a bit.\n\nDicks.",
            "30 minutes for a bus at rush hour in this heat is absurd. Sorry I don't have anyone else to vent to.",
            "Took CTA back from the Sox game yesterday. Got to the red line platform and there was a 12-minute wait for the next train. After getting on, I had to move train cars 3 times until I finally got one with nobody actively smoking. Got off at Jackson to transfer to the blue line and there was a 23-minute wait until the next train.\n\nThe CTA is such a shameful embarrassment to the city.",
            "After swearing for an hour, I finally got my window a/c unit in. Think I might just sleep on the floor in front of it tonight...",
            "I tagged along with my husband who is attending a work conference in Las Vegas. It's 102F. Frying pan: meet fire.",
            "Went to Cindy’s for the first time ever. That view is STUNNING! Not a rooftop guy but best view I’ve seen yet",
            "Hi y'all! I'm working on putting together a network for LGBT people in the Construction/Architecture/Engineering and adjacent fields. If you or anyone you know would be interested in joining or learning more, here is a link for an email signup google form: https://forms.gle/7eWkJUrw7chPGfx49",
            "Any place to get a sourdough donut in the city? Tried to Google but not having much luck.",
            "Week 2 of wondering if people edge in Edgewater",
            "Are there any neighborhoods, streets, or blocks that still have the old orange-y streetlights? I'd very much like to bask under that warm glow again.",
            "I don't agree with all of La Spata's political positions but his constituent services and office staff are genuinely top notch. They're so responsive and helpful.",
            "What are some good free wide step, low incline stairs I can run up and down?\n\nCTA stairs are a bit steep, and cost money, and smell. \n\nI need some of that good Rocky workout moment, preferably on the north side. I want my booty and ab line back.",
            "Has anybody here rented a flat bed dumpster before?  I'm clearing out and finishing my basement and need to get rid of the junk.  I looked up a dumpster rental company, and it looks like I need to handle the permit for the dumpster myself.  It will need to be placed on the street in front of my house.  So it looks like I need to get an Occupying the Public Way permit at https://ipi.cityofchicago.org/Profile/\n\nBut it asks for business name and license information, which I don't have.  I'm just some guy. Any help is appreciated.",
            "Anyone know the best place for smash burgers in Chicago?",
            "Anyone gotten a big wool rug cleaned? I have a 8x10 1\" inch thick beast.",
            "Best place to stand up paddle board within an hour ish drive?",
            "Any recs for shops around the O'Hare area that apply paint protection film?",
            "What is the range of cost for a single office somewhere in the loop? Would 750-1000/month get me in the game?",
            "Why are we all meeting at the Edgewater Verizon Store on Broadway and Sheridan?\n\nOr is it the Jewels in Uptown?",
            "Ladies, where are we getting our nails done these days? I have an event coming up and want to get gel nails and a pedicure. I haven't had my nails done in 6 years. Hoping to pay around $30 for hands and $30 for feet. Looking for recommendations in the Southport/West Lakeview/Roscoe area. Thanks!",
            "Good morning everybody, I just put on a pot of coffee if anybody would like a cup",
            "For those of you thinking about seeing Mr. Suit and Tie this weekend: seems he tied one on and decided to drive.",
            "Came back from a nice weekend trip to Milwaukee to a shut-off heat pump and two confused cats 😿\n\nGoddamn this sucks",
            "How much are you all spending on car insurance? I haven’t owned a car in over a decade but was just curious what it would cost if I did get one. I did a quote with full 100/300/100 coverage and it came out to 1277/6 months. Is this about standard for city living coverage? 38 year old male looking at a boring ass Camry.",
            "Does anyone in bucktown know what the large plume of smoke is from?",
            "Is something on fire?",
            "I recently came to decision that I really need to move away from Chicago and I’m starting to make preparations to move to North Carolina. It really breaks my heart. I thought Chicago was going to be my adopted home. I’ve been living up here since 2015. I’ve gone through so much since then. I feel like I just want leave all sad memories behind and I feel that being on my own and trying to make things work it’s just not really feasible for me here. I have some really nice friends and community here but I need stability. I don’t want to rent anymore and I don’t want buy a home only to have to foreclose on it because I can’t afford the random property tax hikes. I feel very defeated, but I really need to change something in my life. This sucks and I just felt like I wanted to share it somewhere.",
            "anyone else’s old apartment not cooling down even with central ac? 👍 this happens every summer and management refuses to investigate. would be solely frustrating except we have a cat so it’s stressful worrying about keeping her cool. not sure why i pay for central ac when my apartment gets to 85 degrees every time it’s hotter than 80 out. gah",
            "Meanwhile in Logan Square: https://reddit.com/r/comedyheaven/comments/1dkx4rg/frying_pan_got_him/\n\nhttps://www.nbcchicago.com/news/local/video-captures-man-fending-off-intruder-with-a-frying-pan-at-logan-square-home/3469605/",
            "Okay I'm not a fan of Dunkin's nitro cold brew",
            "Old window unit that we took out of storage has died. Does anywhere pick up broken ACs",
            "Anybody have info on why fires are happening? This feels like I’m back out west. Are they electrical? Someone leaving a cigarette still burning?",
            "Is anyone familair with the Centrum apartments in lakeview or the Van Buren in west loop? If so, have you had a positive experience for either?",
            "Finally doing the architecture river tour with my CityPass! It's a 75 minute tour and we want to see the city with the lights on at sunset/night. Debating between a 7:30 or 8:30 start time.....with the sunset so late, leaning towards 8:30pm start time, but would 7:30 be good enough to see the lights or would that be too early? I know we'd catch them at the tail end, but that's it. Any thoughts? 8pm would be the perfect start time but alas....not a thing.",
            "Where do early thirties old singles go out to meet each other in this city? What part of town?",
            "Has the red light camera at Irving and Pulaski been disabled? I watched two cars within 10 minutes of each other brazenly run the red light and I didn't notice a flash. \n\nAnd these weren't \"it just turned yellow\"runs. one of them fully blew through a solid 5 seconds after it turned red at 30+ mph. Could've been an extreme accident.",
            "Any recommendations for indoor activities for this weekend? My parents are in town and are quite sensitive to the heat. Is Garfield Park Conservatory quite hot in the summer? Any other tips?",
            "Any recommedations for getting to and from Billy Joel concert tonight?\n\nNormally just take BNSF into Union Station and then walk or catch bus / CTA train to wherever I need to go.\n\nThinking we can't get from Soldier Field to Union Sta. in time to catch last train out, so need new plan.\n\nTrain in and then Uber back out to suburbs? Train in and hope we can get back in time? Drive and park and if so any parking recos (thinking Millenium Garages if we do this...)?\n\nAppreciate any perspectives...",
            "where can i find people that want to play sports, probably soccer (not a league) during the weekend? nothing serious, i just want something to do besides light jogging occasionally.\n\nit seems that people are either too serious when playing sports\nor extremely lacking in physical activity.\n\nare there any people in the same camp here?",
            "Why all the fog downtown? Or is that smoke.",
            "Where could I go to find other looksmaxxers in the city? I just wanna mog somebody 🫡",
            "Does anyone know what happened at the Grand Red Line station today around 5:20pm? There was a commotion when I went into the station with a police officer chasing after a man, and when I got on the train the other passengers said something about two men attacking a little girl. But the train was loud so I could barely hear them.",
            "I would tell everyone here to stay cool but I know they already are 😎",
            "you too, daddy-o",
            "Hello, It's me. I have Wednesday off.",
            "State employee here, I have it off.",
            "This year is the first time I've had Juneteenth (or MLK Day) off.",
            "I did at my old employer in Boston but not here in Chicago. The company offers 2 flexible personal holidays though, I guess in case someone wants to take a day like Wednesday off they can without PTO.",
            "Me! Federal employee",
            "yep (green fintech startup)",
            "Hudson’s, Globe, Fadó, apparently Butcher’s Tap",
            "Milanos off school and Milwaukee has had the games on and have the brackets taped up on the windows. They may open early for some of the matches.",
            "Cleo's.",
            "AJ Hudson’s",
            "The Butchers Block on N Southport was going off last year.",
            "My initial reaction is, they don't want you going to the unit and striking a deal with the landlord that cuts out the real estate agent. A little more nefarious, and its because they don't actually have any authority or connection to the unit. There used to be a Craigslist scam where the \"real estate agent\" would try to talk you into a deposit before you see the place, only to find out they were just using fake pictures in the listing and disappeared with your deposit.",
            "Leave a review on Google",
            "the unit is probably not exclusively listed with them (if their listing is even legit), check other websites to see if you can find it on your own and cut them out of the picture.",
            "I get honked at all the time for not pulling into the intersection while it's green. If I can't clear the intersection and get safely to the other side, I'm not going. You can honk all you want. I'm not blocking the intersection.",
            "Can't we have both?",
            "join r/cta to commiserate with fellow riders",
            "When someone's smoking, I remind myself how fast we went from smoking everywhere in public to nowhere.  It definitely helps.",
            "I was there when it was 104 but it still felt better than when it's 95 here.",
            "After being there for a week at the end of May, don't think I'll complain about the heat here again lol. I miss Vegas though.",
            "Is it a dry heat at least?",
            "I used to live in Albuquerque and had forgotten about the desert heat. The sun makes your skin hurt. Having said that, it's really pleasant at sunset.",
            "I bet you're glad you could escape Chicago weather, huh!",
            "Is highway engineering a part of this or just construction engineering ?",
            "Maybe R&A Sourdough?",
            "Nah, only in Uptown",
            "According to the banners hung along Broadway and what is (i guess) the motto, we live on it.\n\n\"Living on the Edge\"",
            "Edgewater is one of the densest neighborhoods in the city isn't it? Statistically I'm pretty sure some people there are into that kind of thing.",
            "Lower Wacker and viaducts. Dunno about basking in either of those spots though.",
            "I think those are “sodium lights” (which gives it that color). Struggling to think of one around here. I’m still pretty new…",
            "I'm pretty sure the Sunnyside mall still has a bunch",
            "Are you feeling chaotic?\n\nUnion Station has re-opened their marble staircase made famous by a scene from The Untouchables\n\nhttps://youtu.be/eRJ539f5Ugc?si=f-xUhEL7XbR-L-if",
            "If you decide you want to explore a little and do some stairs…\nhttps://blockclubchicago.org/2019/03/21/these-new-dan-ryan-woods-stairs-are-made-for-walking-so-you-dont-have-to-trek-to-swallow-cliff-anymore/",
            "Field Museum has some pretty wide stairs. Whether you're able to jog up and down them without someone saying something to you is up in the air.\n\nYou could also head towards the lake and use the pedestrian overpasses on LSD. \n\nUnfortunately for your quest, Chicago is an exceedingly flat place.",
            "There's a sledding hill by McCormick place that has some stairs on the back side. I don't remember just how steep it is but it might be worth checking out.\n\nhttps://maps.app.goo.gl/8W2nLmG2iodSZ6XMA",
            "Elks memorial near diversey and sheridan.",
            "Curious. Would renting a dumpster be cheaper than a junk haul-away service like 1-800-junk (or similar)?",
            "In my limited experience, the dumpster company handled the permitting. Perhaps check into that before bothering to get a permit?",
            "As someone else stated its best if you go with a company that will handle the permitting for you. Otherwise info can be found here if you want to do it yourself [https://ipi.cityofchicago.org/Resources/Information/CDOT/DOT\\_DumpsterLicenseApplication.pdf](https://ipi.cityofchicago.org/Resources/Information/CDOT/DOT_DumpsterLicenseApplication.pdf)   \nTo my knowledge you leave the company info blank but you will need insurance and letter of credit.",
            "I really like Red Hot Ranch",
            "Red Hot Ranch is the gold standard by which I judge all other smash burgers.",
            "Went to SmallBar over the weekend. Amazing smash burgers there",
            "Marz has one of the best burgers, and they are hosting a burger fest (sadly sold out). Also a vary cool brewery to visit. \n\nThe best for the money is probably topnotch beefburgers.\n\nMy number 3 would be Red Hot Ranch and then probably Fatso's and small cheval",
            "Fatso's",
            "Tacos Sublime at Marz Brewing.",
            "Leavitt st inn",
            "Soapie's in Evanston did a good job on ours.",
            "Yeah. North Center Rug Cleaners is the place",
            "Lake Michigan?",
            "I've never done it so I don't know what's important to consider when choosing the best, but I just saw a group of people paddle boarding on the north branch of the river by the launch at River Park in North Park / Budlong Woods area the other day",
            "Dempster Street Boat Beach in Evanston has SUP rentals",
            "There are options in the city, look up Chicago SUP at North Ave beach and Urban Kayaks at Monroe Harbor.",
            "I go to the lagoon in Lincoln Park",
            "My vote's for the Gill Park instance.",
            "Look at this stud drinking hot brew this morning         \n(I'm sticking to the iced stuff for at least the next two days)",
            "Don't worry he's already out of jail",
            "I cant figure this out, why do the cats care about the heat pump? Is it connected to the AC?",
            "nobody expects to have to deal with confused cats.",
            "I just paid 1200$/6months it's pretty bad out here ",
            "If you rarely drive, I have Allstate's Milewise where you pay per mile I pay like $70/month. You pay a base monthly fee then it's like 5 cents per mile. A GPS plug-in goes under your dash, there is an app that tracks, shows you all your trips, etc.",
            "$470/6 months with progressive on a 13 year old rav4. Switched from gieco a year or two ago. Also helps that I have had a motorcycle policy with them for almost 10 years.",
            "Look at GEICO for coverage. Also, GEICO only quotes in 6 month increments, so you could get your next 6 months significantly lower than your first 6.",
            "I pay $1100/6mos, full coverage on a civic, I’m 30sF no accidents, clean driving record wrt moving violations",
            "I'm paying a tad bit over $100 for a new-ish X3. Not sure if I got full coverage, but I got a pretty policy limit. Your \\~$200/month proposal sounds like it's just too high",
            "I think your quote could be so high because you haven't had insurance in a long time. If you get insurance then get a new quote after a few months (at least 30 days) your rate should go down significantly.",
            "That's almost exactly double what we pay for full coverage on a couple year old CX-5 through State Farm.",
            "https://wgntv.com/news/chicago-news/firefighters-battle-commercial-fire-in-west-town/",
            "im in old town and we can see the smoke and even flames at some points - wild",
            "[https://blockclubchicago.org/2024/06/18/massive-fire-hits-west-town-warehouse/](https://blockclubchicago.org/2024/06/18/massive-fire-hits-west-town-warehouse/)",
            "Good luck. Curious, but why North Carolina? I am originally from there and am baffled that so many people from this area are trying to move there. It's just so different from Chicago. But I hope you enjoy it more than I did!",
            "Hey friend, thanks for sharing.  Hoping you find the stability you seek in NC.",
            "I'm sorry. What's your financial situation? Where in NC works better?",
            "That's some trash building management. My unit had the same problem when we moved in and they had to swap out a filter. Now we stay chill 😎",
            "I used to have that problem. Top floor apartment in pilsen with large southern elevation windows. AC and heat were both underpowered for the space. I simply moved out, but I would consider getting window units if you want to stay in the same apartment.",
            "Put it in your alley and some scraper will take it. But put a sign on it that it doesn’t work so someone doesn’t take it thinking it works.",
            "It's just the two in the news right? Two of anything happening in a general area in a week can be ascribed to coincidence.",
            "I would rather be able to see the actual architecture. You can see buildings with their lights on just walking around?",
            "Garfield Park Conservatory will be hotter than the outdoor temp as its a giant greenhouse, we have many world class museums that are all climate controlled.",
            "I think shoot for the train and worst case is you miss the train but also miss the insane surge pricing you'll get from ordering an Uber immediately after the concert",
            "It's mist. Cold front coming off the lake hitting the warm air",
            "It’s lake fog ",
            "You wanna do what to who",
            "get a life",
            "same",
            "^And also train pics.",
            "The common metaphors are a blow dryer to the face and sticking your head into an oven. ",
            "Yes!!  Open to any and all!!",
            "🥹",
            "Definitely.  I already used a junk removal van for some yard waste (dirt/lava rock).  Like a large Chevy transit van, and one van load was $300.  That included loading the van and the dumping fee.  It was just some random craigslist guy though, but it was the cheapest option.  \n\nA 10 cubic yard dumpster is costing me $550 which includes the city permit ($125)  I'll will be able to dump much more in terms of space and weight in this dumpster compared to the removal.  The removal companies are pretty useful for bulky items, not so much when you have a lot of weight to get rid of.",
            "Had them 2 days ago, was pretty good :)",
            "Have you done their conventional or immersion cleaning?",
            "Nah mate I've got the firepit going, got that tin coffee pot sitting next to the blaze",
            "I may break down and do the same",
            "Yeah it's my central AC!",
            "I’ve had a non owners policy for car rentals for years, so it’s not a full insurance gap. So it is high though? I genuinely don’t know what’s normal",
            "Pretty scary looking ): I hope everyone is okay",
            "It’s more affordable and I don’t want to change my career. I can transfer out there with my current employer and stay in my current position. My job is completely seniority-based (union) and I would have to start over if I tried to go somewhere where I couldn’t transfer. Charlotte is the best option for me as far as transferring. I also lived out there for a little bit back in 2014 and enjoyed it. I have become really close to one of my fellow trainers located out there and it would be great to work with him. He’s become like my best friend.",
            "Thank you, I appreciate that.",
            "Single, full-time employed at O’Hare as an aircraft maintenance trainer. I’m looking at moving to Gastonia, NC and working in Charlotte. \nI lived out there before and I have some friends out there. I think the work situation will be a lot less toxic than it is here. I think I can actually afford a little house out there on my own and have a yard for my dog. I’ll miss a lot about this city but it feels so hostile for me currently. I think it’s more of a reflection of my own mental state but I think it’s time for some change.",
            "Thank you for reminding me to change my filter.",
            "they clean our filters about twice a year but it doesn’t seem to make a difference :’) been here for 3 years now and summer heat is always brutal. we’re a top floor west-facing unit with poor insulation which doesn’t help. curious to see if chicago eventually gets something similar to a heat ordinance regarding cooling with the climate getting hotter every year.",
            "we were considering that! i think we’re going to move at the end of this lease, so hopefully that’ll be the permanent solution to our central ac woes :-)",
            "Damn. With all the posts in this sub I thought the downtown had turned into a matchbox.",
            "Thanks for the insight. I meant to say in my original comment that they have been here many times and have done so many museums quite a few times, so I was hoping to get them to try something new, but I was worried about Garfield Park Conservatory for that exact reason.",
            "You betcha!",
            "woof",
            "Thanks. I had no frame of reference. Now I know.",
            "just the regular. ive been happy with the results. you can see what they recommend tho based on the type and how dirty it is",
            "Ah, gotcha I was thinking the heat pump to a radiator",
            "Ours went from 720 to 840 with Geico last time out (2016 Fusion) so we went to State Farm and got it for 730 as long as we have the State Farm black box thing in the car. Prices are going up tho.\n\nETA - packaging our renters insurance with it took that down from 200 to 80 as well, if that's relevant to your interests.",
            "Do you have registers (vents) in your apartment or room that blow any cold air? Or are you not getting any conditioned air to come out?\n\nIf you're not getting enough cold air, your landlord or someone may need to adjust the dampers for the central AC system to switch from a winter to a summer setting. That would involve shutting down some of the air flow on the lower floors to force more cold air up to the top floor.",
            "consider taking a slow walk somewhere near the lake, promontory point is a great shaded spot. The south shore cultural center is another cool building to check out with a walk in the South Shore Nature Sanctuary. Otherwise maybe see a movie at the music box or a show at one of the theaters. \n\nCould also do a boat tour on one of the boats that has indoor seating (do a tour they have not done before).",
            "thanks for the tip! we requested the hvac guy to come out this week and take a look, and i’ll make sure to mention this possibility to him"
        ]
    },
    "I feel seen": {
        "title": "I feel seen",
        "score": 779,
        "url": "https://v.redd.it/frzrmky9008d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Charlotte says you only get two great loves in your life, and mine are SATC and Sears tower.",
            "I have the same reaction every time I drive up the Dan Ryan",
            "I did not know how much I needed this edit!",
            "When I was younger and my family would drive into the city, my folks would always point at the Sears Tower and ask “what’s that??” And me, who was like 4 and only knew a few famous tall buildings, would excitedly say: “The Eiffel Tower!! :D”\n\nTook me a while to realize that no, there is not One Singular Famous Tall Building, lol",
            "Lmao excellent",
            "I’ve seen Sears Tower thousands of times in my life…and I smile every time. Never gets old.",
            "I moved from Chicago a year ago and I miss it so damn much. I took her for granted. I feel like this every time I come back (every 2 months, thankfully)",
            "I have rewatched this non stop for almost an hour",
            "me every day",
            "Daaa Sears",
            "Why the long face?",
            "“Standing Talllll, on the wings of my dreams!”",
            "[deleted]",
            "This really means a lot to me.",
            "That doesn't even look close to Chicago.",
            "So a horse walks into a bar.....",
            "[deleted]",
            "Same, always lived in the south subs, always a smile when I go up LSD",
            "Yeah, the Dan Ryan is pretty majestic as far as expressways go",
            "Until someone runs you off the road for only going 5 over while you’re looking at the view lol",
            "I’m dying.\n\nEdit: I have to clarify you’re being serious but I literally could only think of gridlock at first and started cracking up. \n\nI love this skyline and every sneaky bit of it that carries over the horizon.",
            "Same energy as when I was young with my family driving on LSD and exclaiming \"I love the ocean!!\"",
            "I worked in that building for years. It was a sad day when my company decided to move out.",
            "😂",
            "Neigh, the Paris of America!",
            "Dude 😄",
            "A bit equine in feature",
            "It’s from an episode of Sex and the City but someone smarter than me replaced the Eifel Tower with the Sears Tower",
            "Oh honey",
            "/r/woosh",
            "You dare to drag SATC? It’s iconic, used to sweep the awards shows a couple decades ago, I’m watching reruns rn as I scroll Reddit just like I do most nights bc it soothes my soul, it’s my go-to for comfort television, you should watch it, you might like it",
            "I actually have the same reaction from the video every time a Nissan Altima with no bumper and no plates runs me off the road too",
            "Neigh!",
            "Oh, I thought it was something like rumble in the Bronx where the Japanese mountains were visible in the Bronx.",
            "Thanks for the suggestion. I should be doing the same.",
            "Why is it always a Nissan",
            "Ha! Rumble in the Bronx was filmed in Vancouver! Thats why there’s all those mountains in Brooklyn"
        ]
    },
    "Memories of the 1995 heat wave": {
        "title": "Memories of the 1995 heat wave",
        "score": 39,
        "url": "https://www.reddit.com/r/chicago/comments/1dlulvu/memories_of_the_1995_heat_wave/",
        "content": "At the time I was living with my boyfriend in a small 1 bdrm corner apt. on the top floor. We were lucky to have a/c units in the living rm. and bedroom, but we had to hang sheets to cut off the kitchen and hallway in order to keep it under 80 degrees. My boyfriend was a laborer with streets and sanitation, he had some interesting stories to tell. \n\nPeople pulled mattresses out onto porches and balconies, and walking to work at 5:30 in the morning I'd pass them while they slept. \n\nTaking a stroll along a crowded Montrose beach at 10:30 PM under an almost full moon. There were families camped out, kids playing on the water's edge. \n\nAnd ambulances, I remember ambulances.\n",
        "num_comments": 15,
        "comments": [
            "I did the sheets trick, too. Only had A/C in the living room. Lucky for me the 20's courtway apartment already had a place to hang them, as it was the style to have valances between rooms until the 50's. I had to teach the cat how to move the sheet. She wasn't too pleased with the heat. I explained to her many times that her mommy gave her the fur coat, not me.",
            "Neighbors camping out on the parkways overnight, hydrants perpetually open, lots of ambulances.  Also the summer I finally bought a window unit a/c - had happily lived without for years prior.",
            "I nailed up blankets in the dining room to block air access from the rest of the house and put the bed where the dining room table was. Us and the wall AC unit. The amount of sweat. Third floor.",
            "I was 8 when the heat wave hit. It was obviously the first time I had ever experienced something like that. My mom was in the hospital giving birth to my sister and my dad had my other sister and me at home. We had no a/c whatsoever. However, my mom had 3 high velocity fans, we did the blankets on the doorways and camped out in the living room. All 3 fans blowing on us each night. It's funny, I've never asked him about it, and maybe I should, I wonder how worried he was that he wouldn't let us out of his sight. Every night we all slept on the floor in the living room, I wonder if he slept at all that week.",
            "We had just moved here two weeks before it started. Our apartment had no air conditioning. We saw the forecast for the pending heat wave and ran to Sears (remember that place?) and bought a window unit for our bedroom, one of the last units remaining. We left our dog in the bedroom during the day when we went to work, then camped in there once we got home. That was some devastating heat!",
            "That year we had to sell pop for the cub scouts at the fest in our burb.  People were dropping like flies. One passed out right next to our tent.",
            "My best friend moved from India to Chicago that summer.  Although the term hadn’t been invented yet, he was expecting a “hot girl summer”.  Instead he got a “gurl, this summer is too damn hot!”  \n\nIt’s unfortunately somewhat normal for people in India to die in extreme heat.  He wasn’t prepared for 400 people to die from heat exposure in a temperate climate.",
            "I cannot recommend enough the book Heat Wave: A Social Autopsy of Disaster in Chicago, by Eric Klienberg.  A horrifyingly fantastic dissection of how everyone fucked up.",
            "It was early in my career, and I worked in the loop and had to wear a jacket and tie. Ugh, pure torture walking to the red line--my shirt collar was soaked by the time I got to the office.\n\nI lived on the third floor with barely working AC wall unit in the living room. My bedroom was like an oven.",
            "Lived around the corner from Bloomer Chocolate Factory in a loft with not many windows and no AC. It was over 100 degrees at night. The cockroachs in the loft gained flight. Never experienced that before or since. Fucking smelling Chocolate the entire time. That is a plane in Dantes's hell right there. I was a bit happy when I heard that the Factory was closing from that experience 30 years ago. I am repulsed by the smell of chocolate to this day.",
            "Being born lol",
            "Oh wow, I can't imagine how hard that must have been on your parents! It was a scary time.",
            "It’s actually around 750 people that died from the heat wave.",
            "Over 700 people died that week. Nobody was prepared for that, unfortunately.",
            "And that’s the official number. It’s absolutely much higher."
        ]
    },
    "Some pictures I took while visiting the city": {
        "title": "Some pictures I took while visiting the city",
        "score": 316,
        "url": "https://www.reddit.com/gallery/1dlbyy5",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Since be a kid I'll never get tired of looking at the sears tower so I applaud your multiple photos of it.",
            "Where was the first picture taken?",
            "Ah the Sears Tower, so simple in its design yet puts forth a bold statement. We see you queen 💅✨",
            "Great city to visit",
            "The bottom river part of trump tower is so ugly. It looks like an afterthought.",
            "Beautiful",
            "Nice, I like number 4 a lot.",
            "Hope you didn’t spend too long looking at the fugliest building in town.",
            "You're missing the middle finger in the trump tower Pic.",
            "Except for Orange Cheeto Tower, nice pics",
            "I still plan to get more photos of the tower as I Do plan to actually go to the tower tomorrow",
            "Yeah, it will never be anything but sears tower.",
            "I took the picture while at the Shedd Aquarium",
            "I'll get that tomorrow when I head back downtown",
            "Hey do yourself a favor and take the train out to the division stop on the blue line and walk around the neighborhoods there, there's lots of beautiful non tower architecture",
            "Cheers to you my friend!",
            "You're officially one of my heroes."
        ]
    }
}