{
    "Upcoming Darkmoon Faire and Valor Points Changes - Cataclysm Classic Discussion": {
        "title": "Upcoming Darkmoon Faire and Valor Points Changes - Cataclysm Classic Discussion",
        "score": 280,
        "url": "https://us.forums.blizzard.com/en/wow/t/upcoming-darkmoon-faire-and-valor-points-changes/1874343",
        "content": "",
        "num_comments": 229,
        "comments": [
            "Volcanic decks went from 8k to 22k on the AH 😂",
            "W blizzard",
            "Massive win for alts with the valor change. Felt insane seeing people on this sub argue against it.",
            "As someone who had a week of family vacation this is a huge dub",
            "I don't really care about dmf but those valour changes are amazing. No longer will alts be perma behind for no reason. Now you can grind out the valour whenever you want instead of getting punished for going on holiday for a week.",
            "This is good.  Now I don’t have to get my cap in every week.  Some freedom",
            "I think this is a W.",
            "Classic Prog players get treated too well by our devs. Wrath was all W changes and Cata is already off to a good start with this stuff.",
            "I started from fresh at launch and had a week of holiday with family, but currently 77 and delighted I now have the opportunity to catch up! This all helps remove the natural feeling of FOMO too",
            "I am so fucking happy. I bought my deck a few days ago without realize the next one wasn't until july",
            "Can someone explain that valor cap thing? I missed a week of it already does that mean i get to free farm valor each week now?",
            "\n\nThe following changes will be made to the Darkmoon Faire schedule and the Valor Points cap in Cataclysm Classic:  \nDarkmoon Faire\n  \nStarting this weekend, Darkmoon Faire will become available every two weeks, instead of once a month.  \n\nValor Points. \n\nWith regional realm restarts this week, Valor Points will behave like Conquest and the current weekly cap will be replaced with a rolling seasonal cap. If you’ve missed any Valor Points in previous weeks since Cataclysm Classic launched, you’ll now be able to catch up from those weeks.\n\nThere is no longer a cap to the number of times you may earn Valor Points from Random Dungeon Finder each week, up to your normal Valor Points cap.",
            "It’ll never happen but they should make Rep account bound 😬\n\nI like the idea of having multiples chars, I don’t love the idea of having to farm additional reps to exalted for pre-bis 359 gear",
            "[deleted]",
            "Of course the announcement occurs before I can get home and buy a volcanic deck lol",
            "Oh that’s nice. I’m really tired right now but was going to have to hop on to hit VP cap for the week. Nice that I can just go to bed! Goodnight all!",
            "Let’s gooo. Didn’t have time to level 3 alts or whatever is the standard rate these days. Now my 83 shadow priest is smiling!",
            "Nice, now I can finally get my Worgen skinning to max and unlock the 80 Crit in only 1 month rather than 2 (bug where Worgen couldn't max their skinning and thus can't get the highest level of Master of Anatomy)",
            "So DMF will be Monday, then? Or does this2-week period start now and DMF will be on the 24th?",
            "VP change is amazing.",
            "Wish they would boost valor points from raids tho. Sucks having to grind so many dungeons every week just for valor cap.",
            "I stocked up on cheap inferno ink and cheap earthquake decks for DEing in the last few days. As I read this news I came twice",
            "goods change  just started anew  dk yesterday  and taught i had to  grind valor tonight  >P\n\nmade no sense to have it for pvp but not for pve",
            "A very nice change. Now I won’t feel bad if I miss a week.",
            "If I've capped every week on my main does this change affect that character?",
            "Sooo good",
            "This will make the BoE boots less valuable this week by a lot.",
            "The deck-market will put Trading Places to shame today.",
            "Do we know what the seasonal cap is?",
            "Man i bought volcanic deck yesterday for 8k and was sad to have to wait 4 weeks to save gold, now deck is 22k and i might get my trinket this weekend or within 1-2 weeks so thats a w :D",
            "big w aggrend, i ll give you that",
            "When this update came out, I watched the market for cards change in real time and I thought it was interesting lol. Was able to make an easy 10k gold :D",
            "Big W.",
            "W",
            "I breathed such a heavy sigh of relief. Power levelled my rogue from 0 trying to get to 85 before today, made it to 82 :( but now? Now i’m chillin 😎",
            "Did this actually change the cap for anyone? I missed week 1 but this week was still capped at 1600 total for the week not 3200.",
            "Well to come back and revisit this: it's nice to be able to work more quickly on the pets and transmog items.\n\nHowever, as of now the \"Cloak of the Darkmoon Faire\" is not able to be transmogged, and I'm sad about that.",
            "[deleted]",
            "I wonder if this will include the extra reset since the game launched on a Monday.",
            "W",
            "I literally just said to myself before I scrolled upon this post “damn I missed getting valor cap last week” annnd boom alright we up, sounds gr8 thanks Blizz.",
            "Awesome!",
            "I think there is a bug here:\n\nOn my DK, I've spent almost all my valor and have 1515 leftover, it says my seasonal cap is 1515 even though I've spent many points and maxed each week.\n\nOn my Pally, I've just hoarded all valor since week 1 and it is counting that against my seasonal cap!\n\nTLDR; You got more total valor if you spent all your valor before the change yesterday, and \"lost\" all valor you had hoarded till then.\n\nCan anyone clarify?",
            "Update to bug, your cap currently goes down when you spend valor aka you can farm heroics for full valor set right now if you buy and reduce your cap as you fill it.",
            "glad i spent all my extra time leveling alts to farm valor to sell boots, sick game",
            "[deleted]",
            "Those 7 dungeons per week were so onerous, I can't just couldn't get them done in time /s",
            "17k to 52k on pagle lol really insane stuff",
            "Glad I got mine for 11k on Mankirk on Monday, now the question, to flip, or not to flip, how much do I NEEEEED a volcano card",
            "Wait, other servers aren’t charging 55k for volcano decks? Pagle here",
            "Managed to get one for 18k. Still better than the 42k for the actual trinket lol.",
            "me no happy. I invested all my money on making one volcanic deck to sell it during the time in between fairs. The price crashed down from 60k to 40k overnight. That's less that what i had to invest in making one :-s",
            "Not even alts, but just people who weren't speedy at the start.  I know I missed a couple runs the first week, and some of my guild isn't even max level yet.\n\nIt's not like they don't still have to run the heroics, they just don't have some arbitrary timed bullshit putting them even further behind.",
            "People are always arguing against QoL and things that favor them. Just look at American politics. People are idiots.",
            "[deleted]",
            "Yeah it was wild seeing so many people being against Valor being treated like Conquest.",
            "I have argued against the BoA shoulder enchant since I felt it was quick but this one ? How can you think it is a good design. This fix is awesome.",
            "Overall, it's a W, but I will say the number of absolute trash players this attracted to heroics made it feel like Week 1 all over again for us healers, which was a bit of an L.",
            "The only argument against it I can see involves the no-lifers no-lifing it to seasonal cap early and then either gatekeeping raids from normal people or pushing even *more* GDKP spam.\n\nI can see it now-- \"LFM 10M BWD/BOT GDKP, 370ilvl+ req 50k min\"",
            "Fr. I’ve been in vacation since it came out and I’ve been stressin about being so behind.",
            "It's certainly a W",
            "huge W",
            "And I'm the opposite, wish I didn't buy the trinket because I wasn't expecting to be able to for another month lol",
            "They probably went up in price since the release date is now closer.",
            "Usually you get 1600 per week. With this change, your cap instead goes up by 1600 every week. So now if you hit max on the 10th week, instead of only being able to get 1,600 valor, you'll be able to get 16,000. 1600 for every week that has elapsed",
            "With the valor catch up, there is no way you cap valor without getting at least 3/4 exalted.",
            "theyre actually doing that in the latest retail expansion lol",
            "To me the best would be Tol Barad rep/commendation account wide.\n\nTrinkets are too good for tanks and caster dps and that's basically all I play lmao.",
            "I sorta get it, but you will probably end up having all the gear you need from valor and raid before getting exalted on more than 1. MAYBE 2 if you are unlucky with raid drops.\n\nGearing up alts will be soooo much easier now that you can just spam heroics for justice and valor, that's a ton of 359 and 346. You don't really need the rep items to get raid ready anymore.",
            "From what I can tell on my 2 characters it is basically forgetting that you spent any before the patch, so its treating how many you have as of now as how much you earned... meaning despite having bought gear etc, my Hunter has 5400 to earn",
            "It was a godly flip angle. If I wasn't at the airport I probably would've bought like 5 lmao",
            "still half the price of trinkets, not many people know about this yet, by mid day tomorrow everyone will though",
            "It will be a lot cheaper now lol",
            "DMF will start this coming Sunday.",
            "I really disagree with this. It's nice that skilled players are still doing heroics, if they got it all from raids there'd be only noobs in there and gearing up alts would suck/require guildies.\n\nIt's really not that many dungeons.",
            "No",
            "As I understand it shouldn’t affect you unless you planned to start doing less than 1600 valor some weeks. Then you’ll start benefiting",
            "It's just changing the weekly cap to a cumulative one, so it'll increase by 1600 each week",
            "That is not bots, that is regular players with unlimited gold to buy mate.",
            "I'm confused, how is this a bot problem?",
            "Nope. It was an intentional decision to skip those 2 days as a full reset.",
            "Try capping and see if it lets you pass 1600 for the character where you've already gotten the previous week's valor. Could just be a visual bug.",
            "Is there some reason you're against quality of life changes? Is it just self hate, or..",
            "Ok Andy",
            "it's meant as a catchup mechanic for people who level late and/or alts.",
            "turns out not everyone was 85 on all their alts by the first week cut off",
            "Now you can hit 85 on an alt any time and catch up to the same amount of valor as your week 1 main.",
            "Man you must be the only cata player at all complaining about that",
            "[removed]",
            "Impressed that really someone complains about this.  \nSome people here are just batshit crazy.",
            "sometimes you don't wanna play a game for a week stop being cringe",
            "If you're not in a sweaty heroic guild pushing for 99s/speed I'd flip it and buy another one for 1/4 the price next DMF. Same thing happened with Greatness cards at WOTLK launch.",
            "You dont need it, how many alts you play? That $$$ could fund leveling lots of professions",
            "Good. It really isn't worth more than 20. Overinflated prices are not good for the game.",
            "The people arguing against it are people that have no intention of leveling any alts so they don't want others getting benefits they will never see for their self. It's the same losers that argued against changing archaeology.",
            "reee devalues me leveling to 85 week 1 reee",
            "*VaLoR-pOiNtS-CoMmUnIsM!!!!*",
            "I kinda get it in retail. But in these condensed classic versions alt boosting makes the game fun. Otherwise raid logging ensues.",
            "For a lot of people classic is all about tedium for some reason, don't ask me why",
            "Yeah Europeans kinda based in their latest election unlike the usa",
            "Literally crying.",
            "[removed]",
            "[deleted]",
            "honestly the TB dailies are super fast in a group and it takes a week to exalted, which also gets you enough tokens for the trinkets. if you want to see awful dailies wait for mop classic.",
            "1 week of Tol Bard dailies is like at most 3 hours of gameplay, that's fine",
            "> just enough of a slog\n\nCata",
            "How do the number of dailies for TB suck? You get it over with sooner than later.",
            "That's not how it works. The cap goes up every week - you can't no life grind it all early, that would be bad design.",
            "22days vacation mofo over there",
            "That's pretty sad to stress about how taking a vacation affects your in game standing.",
            "Massive W",
            "On my server it's doubled in price for a deck in the last few days. I paid 8500 and they're at 16500 now",
            "ohhh thats so cool, great change",
            "nice, I was lazy leveling my shaman and so much of their pre-bis is crafted epics and valor 359. this will help tremendously",
            "67 heroic dungeons. Doable no-lifing for a long day.\n\nUnless of course the 240 Valor is still only for the first 7 and if so this change isn't all that great but still better than weekly caps.",
            "Just did the 1600 cap with my rogue and my first faction (hyjal) still is not revered.\nIf I complete the cap 2 more times I doubt I will hit exalted with 3.",
            "You wouldnt have the tokens though. Exalred TB gives you barely enough tokens for one trinket.",
            "Volcano deck went from 10k last night to 30k, which is what it was at last DMF.\n\nAnd herb prices mysteriously doubled. It's almost like the reason they collapsed last week was because DMF left town. (While all the smoothbrains on this sub blamed shadowy bot conspiracies.)",
            "The price was collapsing fast because there's was almost 5 weeks to claim it.  Now with it being very accessible again there'll be a price surge.",
            "It was 10k like 2h ago on faerlina, went to 30ish now. Should settle lower but yet",
            "deck and trinket will stabilize, aka deck will go up, trinket will drop",
            "Awesome, thanks",
            "that's what I thought but I needed someone else to say it too",
            "Thank you sir",
            "This. Means an alt that is leveled on week 10 has a cap of 16k valor instead of 1600. You can actually get your tier pieces relics etc in a reasonable time with new alts now. Good change",
            "ita mosty meant as a mechanic for people to make less gold with selling the boe boots. on my server if you sold a boe boot you could almost buy a wow token, so now they are gonna be way less expensive if they sell at all.",
            "Because alts need to be valor capped week one? Is that really your argument?",
            "Yes I know. I wholeheartedly disagree with giving alts a leg up three weeks into an expansion.\n\nShould have waited till the end of P1 to do this.",
            "I'm sure there are plenty of people with my view, just not on this sub filled with casuals.\n\nIt's honestly fine as a change, just unnecessary, Blizz are accelerating the game to retail, by MoP Classic we'll be playing MoP Classic timewalking edition.",
            "Hilarious. Enjoy the ban",
            "They could announce selling raid loot on the store today and the casuals here would cheer for it, and people like myself being opposed to it would get this same comment from people like you.",
            "I'm not saying it's a bad change. What is bad is that they did this annoucement in the middle of nothing, F-ing up those that still had crafted items in their hands, or those that hadn't bought their herbs yet (prices went x5 on my server over the night)\n\ni had to enter the market on week 1 at overinflated prices, because the next darkmoon fair was too far away. Now that was all for nothing.\n\nPS: they should have made that change from the start. the calendar is still off btw.",
            "I learned there are \"1 toon only\" andies that don't think alts count as content. They want everything in the game to be catered to them and any \"dev time\" devoted to other parts of the game they won't touch is a waste. They also subscribe to the feeling that if they had to do it one way, so does everyone else. \"Back in my day I had to walk uphill to school both ways and so do you!\"",
            "How was archaeology changed?",
            "Or there are people willing to play alts but without having everything unlocked by the main character on the get go. Not everyone expects their alt to do the exact same content as their main asap.\n\nI’m kind of tired of the obligatory unavoidable account bound extravaganza. I could enjoy retail WoW or Diablo 4 but I would feel forced to create a new account and buy the games again the moment I want to create a new character because those account bound things are not cancellable.",
            "Just delevel in protest",
            "Grinding 20+ heroics immediately after hitting 85 should be plenty of tedium still.",
            "We are fat, but you watch WWE brother. You can't comment on intelligence.",
            "Not really entering with all those items if you're playing right now; I reckon most guilds interested in heroic raiding has already begun progress and we currently don't have the VP budget for all them epix.\n\nStill a good change which will benefit alts a lot.",
            "They're still going to be doing 10-12 hours of RDF to get the valor to buy that 3set and boot/trinket.",
            "> 10-12 hours of RDF for reputations.\n\nSomeone didn't play TBC",
            "Tell me you're an American without telling me you're an American (I too feel the struggle).",
            "Oh yeah it’s terrible, I’m totally not enjoying my island hopping. Look how sad I am, :(\n\nCmon, it’s more so I check discord and see everyone else with all their heroic gear and realize I still have to level up! Then I catch a 100 lb tuna off my boat and completely forget about wow.",
            "The W has pixar lamped the L",
            "Likewise, went from 5k for a hurricane deck to 17k",
            "The fuck? 8500 for volcanic deck?\n\nOn Mankrik volcanic decks were over 50k easily, often approaching 80k. Now with this announcement price is tanking lol. This server is opposite world I suppose.",
            "It was a thing in retail so I was really praying they'd add it here. Glad they did",
            "No shot is 67 heroic dungeons doable “no-lifing for a long day” lol\n\nIf each run takes an average of 30 mins that’s 33.5 hours of heroics. 15 min runs is still over 16 hours of non stop heroics with zero breaks and 0 downtime, and no chance you’re finishing every dungeon in 15 mins average",
            "You'll always get 240",
            "You get valor from raids aswell if im right",
            "I missed the first few days of cata. I hit 85 last week and went hard on heroics. It took me 3 days to cap at a pretty aggressive play pace, but that was queuing with randos to catch up. \n\nLast night I ran through all the normal raids and felt my lack of tier pants pretty significantly.",
            "I got hyjal revered just by questing there.",
            "Yes, but I can do the dailies with my 2 85 characters for commendation if they're shared while I'm still leveling other alts.\n\nIt's still less time than doing 10 days of dailies for each character after reaching 85.",
            "just grabbed one for 18.5k on Faerlina, but yea it's obvious prices adjust depending on DMF and apparently people still dont understand that",
            "the other sideeffect of this is herb prices have shot up because a lot of people are gonna be making cards again.",
            "This is an absolutely insane take. Blizzard makes money on tokens, the price will always normalize, so blizzard doesn't care how much gold people have outside of player enjoyment level.\n\nThis change is so alts have some level of catch-up mechanics (they still need to level, raid, do tons of dungeons, and level up professions) and to prevent FOMO if you are busy for a week or start the xpac a week or two late.",
            "It allows alts to not have to start X weeks behind with no ability to catch up depending on how long the phase is",
            "do you want healthy server populations and economy or do you want everyone raid logging?",
            "This was the best time to do it. With slow people hitting 85, people making alts, or people wanting to swap mains.\n\nValor points and the cap will be reset at the end of P1. So doing it near the end of P1 would have been insane, would have been a lot of pressure for people to cap.",
            "But there is no change for mains since they usually do their weekly anyways, it's just for alts.\nSo why should \"non casuals\" be bothered by that ?\n\nDoesn't change the pace at all",
            "Nice strawman dude, nice strawman",
            ">selling raid loot on the store today\n\nWhat a weird and wild comparison, mr self-proclaimed hardcore gamer  \nBut love the part where you victimize yourself while not even be able to understand why people like you get comments like that.  \n\n\nMaybe, just maybe, you are the problem and not everyone else.",
            "Again, good. You're trying to scam people at almost 3 times the actual value of the item.\n\nI have no sympathy for you.",
            "For sure. Personally i absolutely despise making alts.",
            "I mean you would run those hcs anyways for gear and rep.\nAnd you don't have to do them at once, you can space it out at your will",
            "Did you really stalked his profile? Loser\n\nEdit: 22 butthurt losers in the comments.",
            "8500 Tsunami deck. I'm talking the deck that requires turning in as opposed to the card you can equip. Prices have gone up on the deck since the wait was gone from a month to a few days.",
            "[deleted]",
            "> If each run takes an average of 30 mins that’s 33.5 hours of heroics. \n\nI'm tanking RDF for last ~15 days, average dungeon clears are 15-20m.   \nTo get 30 minutes clear you really need to get full group of 320i characters that play dungeon for the first time. But most groups already know how to speedup clearing, like healer already triggering boss animations while we are killing last pack before him. Or DPS pulling patroling packs before they walk away.",
            "Next to nothing :/ They really should look into buffing it, imo. 35 for a normal boss and 100 for a HC boss. If your average raiding guild does e.g. Halfus on HC and the rest on normal in BoT that's still less valor than a 15 min random HC which feels a bit off.",
            "Sad that not every faction rep is reachable to revered just by questing. Uldum just giving 6k honored when doing all quest is a joke.",
            "Yes you can do that. I leveled my alt with going in a new zone asap for the bigger quest experience. I guess many alt’s are doing that, why many alt’s will start with a lower rep.",
            "I'd settle for TB the zone being opened up at level 83 so you can incorporate those dailies into your leveling experience.  Sure it'll be a bit harder dealing with lvl 85 mobs, but oh well.",
            "the market was like that in original wrath and cata releases too lol.",
            "I literally dropped like 20k into herbs when I saw the news post, cause I knew they would be higher tomorrow when I get home from work. Was thinking about buying a few volcanic decks a few days ago. But they jumped faster than I was. Could have easily been a 30-50k flip lol.",
            "Again, why do alts need to be on a level playing field with mains? What's the gain there?",
            "This will have no impact on raid logging what so ever. People who were going to do the 3\\~ heroics you need to cap valor after full clearing on their main and alts were always going to do that.\n\nThey will need to add other rewards for doing extra heroics to stop people raid logging, most likely the Gamma dungeon stuff we had in LK.",
            "The pressure on people to cap is the game, that's the challenge of the system, it's urgency.\n\nThe same way weekly lockouts work, shall we start giving alts and slow levelers double loot from the raid because they missed the previous lockouts? It's exactly the same thing.",
            "There are a million changes you could make that don't directly impact mains that aren't a good idea though.\n\nRemove the cap entirely, let people grind as much valor as they want, is that a QOL improvement?\n\nMake the valor gear have a gold price, why do we need to do stinky old dungeons on our alts right?\n\nThe game is about grinds, making things easier isn't always a good thing.",
            "None in attendance. Try again",
            "It cost me +60k to level and craft that one deck, the price of mats were insane on my server during the first week. Nothing is a scam in there.",
            "Love when people call clicking a single hyperlink and spending 5 seconds looking at it \"stalking\". Get over yourselves lol",
            "this is peak reddit",
            "Lol he criticized an entire country and you're worried about people looking at his reddit posts?",
            "With a full group of dedicated and geared players, which a newly dinged 85 toon 7 weeks from now is not. So you’d need to have 4 other players willing to grind it out with you for 16 hours to get valor capped? Nah lol\n\nIt’s not doable in a day unless you have some truly degenerate friends that want to inflict pain on themselves.\n\nIt’s more reasonable to expect at least 20 minute runs over the course of 67 which is 22.5 hours of dungeon grinding. Which is more like a 2-3 day no-life event, not a single day thing",
            "That has to be a stat from a full pre-made group with previous run knowledge. There’s no shot you’re getting cross-realm groups of 5 randos through any heroic in 7 minutes lol",
            "Yep agreed. I only need 1 item from uldum exalted so it's going to be the absolute last.",
            "Why wouldn't they be?",
            "[deleted]",
            "more alts= more raids being run = more time playing = less raid logging.\n\nThis is the most basic shit",
            "No, no its not, not even close.  \nWild how delusional some people on this sub are",
            "You still have to do the same grind with those changes.\nAs I said those changes don't impact mains at all because they do their weekly cap anyways.\nHow is waiting on alts making the game difficult ?\n\nHow ?",
            "Yes it is. You bought overinflated mats to craft it, and expect to turn a profit.\n\nI'm glad prices are going to go down. It's better for the general playerbase",
            "The point is why need to do that in the first place? I don't think I've ever felt the need to do that",
            "Keep in mind that u earn valor for killing bosses in raids aswell so u catch up anyway if u raid every week",
            "You can, if you are the one tanking",
            "Why would they be?",
            "Why tho",
            "Don't think this is going to get more people raiding, the same people who raid on 10 alts doing the same 10 raids they would have been doing anyway.\n\nValor is very quickly useless anyway.",
            "Yea, you",
            "Without access to all that valor you need to make do with shitter items, use crafted gear etc. etc. etc. it's way harder to gear up an alt without this change.",
            "Something something stones in glass houses",
            "[I can think of at least one reason](https://i.imgur.com/FKwVt49.png)",
            "Now I really want to go check the profile of a guy yo uare arguing with :D",
            "Well good for you.  Aren't you special?",
            "Idk if its incorrect values or not but the valor from raids is laughably low. Like i think its 400ish VP total for a full clear of everything.",
            "How much do you get Pr boss?",
            "Do you actually have a reason?",
            "I will be raiding on an another alt because of this, and I'm sure I'm not a statistical anomaly, also VP definitely isn't useless since you can buy tier and tons of good gear from it",
            "If Valor is quickly useless why do you care if alts can catch up then?",
            "If you are not trolling, seek help, seriously.  \nOh hey, he replied and blocked me, now he feels like he won lmao",
            "But you complained about the impact on mains in the first place.\nMoving goal post much ?\nWhy even care that alts can buy like 3 items while they already lost all raid IDs till that point ?\nSome people are just weird",
            "I only get 35 so heroic is still neccessary",
            "Do you?",
            "Your vote of one is heard loud and clear lol.\n\nAnybody who has been raiding the last two lockouts and has been capping their valor has either already run out of things to buy or will have run out by the end of this coming lockout.\n\nWe've already had plenty of raiders who have nothing left to buy and are selling valor boots.",
            "Because the early valor on an alt is some of the most important part of gearing, that's gone now, you just get it all week one.\n\nI know it's hard for people to understand this, but getting everything easy in an MMO makes you happy today, makes you bored tomorrow, QoL is a very delicate balance.",
            "Disagree about a video game and you make mental health insults? You're a horrible human being. Grow the fuck up",
            "Where did I move the goalposts? I didn't go back on any of my points at all.\n\nWhat's next, you going to complain that alts and slow levelers missed out on the first two lockouts and should get double drops from the raid?",
            "Yeah. I want to gear my alt sometime this year, thanks.",
            "well i had to lvl and alt to get a raid spot and missed week 1 and haven't gotten any tier from raids, but yea go off im sure everyone has 4pc and better than valor gear already and you aren't lying about half your raid's gear to try to win a stupid argument",
            "[removed]",
            "I know I already asked this, but I have yet to see what your actual reason is.",
            "Slippery slope fallacy"
        ]
    },
    "Daily Questions Megathread (June 22, 2024)": {
        "title": "Daily Questions Megathread (June 22, 2024)",
        "score": 2,
        "url": "https://www.reddit.com/r/classicwow/comments/1dlnxjq/daily_questions_megathread_june_22_2024/",
        "content": "Our Daily Question Megathread is for those questions you don’t feel warrant making their own post, such as:\n\n* Can my PC run WoW: Classic?\n* When does my class unlock a certain ability?\n* Which dungeons are worth doing while levelling?\n* Feel free to ask anything related to WoW: Classic!\n\nAsk the unanswered questions you’ve never gotten around to asking.\n\nYou can also ask these questions over on our [Discord server!](https://www.discord.gg/classicwow)",
        "num_comments": 1,
        "comments": [
            "Nostalgia is hitting hard and I want to give cata a chance but i have analysis paralysis choosing a class to play. I've narrowed it down to:\n\n  \n\\* Blood/Unholy DK\n\n\\* Feral OT \n\n\\* Lock\n\n  \nCan someone give me some guidance? My goal is 10man and casual pvp"
        ]
    },
    "My 5 man dungeon went normal": {
        "title": "My 5 man dungeon went normal",
        "score": 90,
        "url": "https://www.reddit.com/r/classicwow/comments/1dls8me/my_5_man_dungeon_went_normal/",
        "content": "Had a nice 5 man hc dungeon. Just wanted to say. No one was kicked and nothing went wrong. ",
        "num_comments": 9,
        "comments": [
            "I just vote kicked a random so it’s all balanced out, fuck you.",
            "I'm sure someone was reported for spam and will get a softban any second now...",
            "This is why anecdotes are mostly useless.  😅",
            "The balance of nature",
            "bruh 🤣",
            "I just invited some rando then clicked queue just to off set this.\n\nSo what if he didn't join, still counts."
        ]
    },
    "POV: You play Horde in the Season of Discovery.": {
        "title": "POV: You play Horde in the Season of Discovery.",
        "score": 100,
        "url": "https://i.redd.it/ldsn4tvea28d1.jpeg",
        "content": "How do you spend your time while waiting for phase 4? ",
        "num_comments": 28,
        "comments": [
            "Play alliance on sod and horde on cata fml I never win bgs",
            "Imagine even pvping in sod.",
            "i too delete my losses on Nova Instance Tracker so my record looks cooller",
            "Surely none of the entries were deleted",
            "SoD’s hero class",
            "SOD pvp hahaha what a joke",
            "I don't get the perception that alliance is even losing BGs, unless this is a region/realm thing. I probably only play two or three a day at most but I can't even remember the last time I lost, with or without a premade.",
            "I love the cope of people who think this is solely because of shamans being strong.",
            "Pov you abuse blizzard's shit tier balancing",
            "player diff",
            "horde tend to lose more in cata? why is that? I don't play cata so I don't want bgs are like there.",
            "52 line is a loss. I decided not to show it for a better effect.",
            "God gamer",
            "Crazy. Half the WSGs I jump in, the team complains about there being 4 shaman and afks at the gy",
            " Why are there a ton enhance nerfs and paladin buffs in p4?",
            "actually a skill issue. paladins are so strong but they are always played so terribly",
            "Pvp meta for cata is alliance because of humans getting a free trinket and horde racials are better for pve. Good ol blizzard\n\nThe ratio is not as terrible as sod but alliance wins way way more",
            "The Alliance racials (specifically Human and Night Elf) are significantly better than what the Horde have on offer which in itself isn't really an issue as they're not *too* absurdly ahead at least before p3 trinkets—the issue is that there is a quantifiable power increase which, coupled easy pay services like server transfers, allow for modern players to indulge their worst impulses. So, you're left with a PVP meta that is incredibly weighted towards Alliance.\n\nAfter that, Blizzard's changes to BG group matchups exacerbate the problem where it's *significantly* faster to stack yourself up in a \\~10 stack for the more numerous faction. This is because the matchmaker is checking \n\n1) Are you in a group ≥10  \n2) Are there members of the opposing faction in the queue\n\nSince it wants to queue Alliance into Horde as much as possible, those Horde solo players are sent to face off against large Alliance premades which in turn are more common due to how long the queues are if you don't enter such a premade as Alliance.\n\nSo, the mass exodus of skilled PVP players to the more powerful side, the superior racials, and the premades that make BGs more efficient for Alliance all couple together in the end to make the Horde both less likely to win the match and significantly less likely to try once they fall behind. Heuristics tell them if they try and fight, they will likely lose against their stronger and more coordinated foe like they have in the past and, even worse, just be farmed for honor/the kind of dopamine rushes that hit from bullying weaker opponents in competitive formats.\n\nReally, Blizzard has failed to save us from ourselves as there is an inverse profit incentive for them to do so. It's the unfortunate state of Cata BG PVP (which to be clear is not the same thing as the state of arena).",
            "the sweats play alliance and the dads play horde",
            "Alliance has the PVP racials in Cata, so serious PVP players all play Alliance. \n\nIt's not as bad as SoD since both factions have the same classes though, but Horde:Alliance winrate definitely favors Alliance (like 70-30)",
            "I don't know what to say man, I've seen a lot of people say similar but then typically its the fucking priests who are dunking on everyone. Almost certainly when my luck runs out it'll be because there were two or three priests on the enemy team.",
            "Cause most balance changes are PVE driven and enhancers were topping the charts, while also being able to offheal like crazy as healhancers with the inverse being true for paladins.",
            "I have yet to see a paladin in AB who doesn't just run into Blacksmith with divine shield off the rip only to guaranteed die 10s after it wears off. It's peak brain rot.",
            "Ok why don't you suggest how I should play a melee class with 1 cc every minute, low damage, no mobility, and only hard cast heals. \n\nI'll give you a hint on how it goes, every 5 mins you guaranteed die after 10s, outside of that you just die. \n\nPaladin is only good at one thing and that's one shotting squishy classes that don't have their trinket up immediately after demounting next to them. Ever since damage reduction was added their one gimmick is gone.",
            "You’re not a burst/pressure class. You’re a support class with a decent damage rotation. Use your hand spells on others. Dispel others. When a horde reaches someone on your back line you should bop/freedom your teammate to save them and then HOJ the horde guy and then dps him. Your bubble should be used to heal/dispel others with impunity. Instead you use it to save yourself after you charge into 10 people to do mediocre damage to someone.",
            "Everyone dies if they run into 10 people at black smith. Peel for your healers instead, make sure you give them freedom and and clean up when the opponents burned their bigger CDs.\n\nI can count on one hand the amount of times i've seen a retri dispel anyone but themselves and/or drop a BOP on team mate. It straight up semes like a spec that attracts the terminally stupid.",
            "Meanwhile, 2 Ele shamans flameshock the entire Alliance team to death.",
            "If 2x300 damage avg on 5 targets (with rune) with a 5s CD kills your team, you've got other issues. Now, Ele shamans are absolutely banging, don't get me wrong, but people let them free cast like they want and hardly ever dispel flame shock, despite there being 3 palas+3 priests at BS in that initial battle.\n\nIf you dispel flame shock, Ele burst is significantly neutered: they don't get guaranteed Lava Burst procs, they don't get insta cast procs, it's honestly sad how much it nullifies them."
        ]
    },
    "EU Classic-Era Fresh project, [Zandalari Tribe] ": {
        "title": "EU Classic-Era Fresh project, [Zandalari Tribe] ",
        "score": 32,
        "url": "https://www.reddit.com/r/classicwow/comments/1dltfrc/eu_classicera_fresh_project_zandalari_tribe/",
        "content": "Yo everyone,\n\nI made a post here a few days ago asking about what the opinions were on a fresh server, got suggestion to try out Zandalari Tribe which is community driven project for \"fresh\" characters.\n\nMC hasnt been done yet, people are still in leveling phase and it might take some weeks more before we see first MC.\n\nThere is quite a decent population with often 150-250 ppl online in all levels split into 3 guilds connected with Greenwall to communicate (2 guilds for lvling, 1 for Raiders lvl 50+) new people joining in everyday.\n\nIt gets alot of hate with these classicprojects, but even Blizzard decided to help us out by locking Zandalari Tribe for transfers so we can drive the project further.\n\nQuite easy to form groups during daytime/evenings, people have a will to help and a strive to make this server great.\n\nDont hesitate to msg me ingame (Noxhow, Hordeside) or anyone else in the Fresh Enjoyer/s guild for questions or invite :)\n\nCheers! /Nox",
        "num_comments": 21,
        "comments": [
            "Im in the guild almost 1 month, best experience in a while. I recommend",
            "FRESH POG",
            "most fun I had in a long time playing wow. fresh undefeated.",
            "Great fun so far! Can recommend",
            "best place to be right now for sure!",
            "Super fun. Currently leveling, fresh vibes feel guuud",
            "GREAT FUN COME JOIN",
            "best experience this year!",
            "Come join us, its not too late to join era.",
            "WoW vanilla is just pure masterpiece and in my opinion there will still be people that want to play it no matter what. If you like the vanilla wow and you love good community and fresh start, this is exactly the thing you should try!",
            "I love it there !",
            "Sounds like a great community! Good luck with the project",
            "In the guild, can verify its full of great peeps solidly tons online and groups are easy to get. \n\nJOIN US",
            "thriving",
            "Lmfao, all the comments here are by alt/bot accounts lol",
            "No way :) theres real people. I Just posted it in Guildchat and in the guild discord. Feel free to join and ask them urself \\^\\^ we are all online, 100ppl in guild 1 atm.",
            "They are not, it's just people that don't use reddit promoting the game they enjoy. Don't be a hater! :D"
        ]
    }
}