{
    "Everyone, it has been an honour.": {
        "title": "Everyone, it has been an honour.",
        "score": 974,
        "url": "https://www.reddit.com/r/clevercomebacks/comments/14g2m1d/everyone_it_has_been_an_honour/",
        "content": "After over five years moderating this pirate ship we call a subreddit, I'm stepping down. \n\nIt's been great being able to build a subreddit where you can say whatever the fuck you want without worrying about some power-hungry mod banning you because you said or posted something they didn't like, where you can actually have an argument without the mods stepping in and sending you to timeout. But I'm old, and I'm tired. I'm handing the \"stupid sticky comment at the top of the thread\" keys over to my fellow mods and the actual owner of the subreddit (no, this isn't my subreddit, I'm just the dumbass you all saw the most).\n\nThanks to everyone who ever called me based, a good mod, or even a goddamn idiot. Y'all are great, and I'll miss this fuckin place.\n\n(also in b4 \"this ain't an airport, you don't have to announce your departure\")",
        "num_comments": 93,
        "comments": [
            ">where you can say whatever the fuck you want without worrying about some power-hungry mod banning you\n\nDamn.. I didn't know this sub exist. \n\nGood luck in your next venture and as we say in Australia,  you been a good cunt.",
            "New phone, who dis ? (Have a great life)",
            "Hasta la sagna, don’t get any on ya",
            ">also in b4 \"this ain't an airport, you don't have to announce your departure\"\n\nJust because you don't have to, doesn't mean you can't. But departure announcements are much like airport ones - there will always be only so many people who care. Thanks for your work and all the best!",
            "I mean, will miss you man. Take care of yourself. Hope you live a good life. You are still a member though right? Come, We'll call each other idiots in the comment section... As equals :D",
            "I don't know you, but that doesn't matter. Farewell, stranger, and enjoy your life.",
            "You're a goddamn idiot and I hope you have a based retirement from being the good mod that you've been.",
            "This ain't the airport, you don....shit beat me to it",
            "I'm old too, can I get my meds now and watch songs of praise with a cup of tea?",
            "Like Steve off the Internet, or whatever the fuck that worthless slug’s name is. He banned me for rickrolling of all things, just because he didn’t like it. No warning. Banned. I appreciate your work.",
            "Anyone got papers?",
            "🫡",
            ">(also in b4 \"this ain't an airport, you don't have to announce your departure\")\n\nAnd on your way out the door, you invented the cumforward. Why not skeet into existence a new subreddit, with new mods, and blackjack and hookers?",
            "So I guess from now on, if we want any more comeback from you… we’ll just have to scrape your teeth?",
            "We look forward to seeing you at Milliways.",
            "Bb come bacj",
            "Um, how long is this going to be stickied?",
            "I hope all the good things happen for you.",
            "Is this on principle because of....  you know what? \n\nI hope it is.",
            "Take care, have fun. We’ll miss you.",
            "thank you so much for your service",
            "I’m ready to go",
            "Gotta do what's best for you... \n\nTake care and best to you",
            "Good luck in your next project, you are a good inspiration, nice to meet you.",
            "So long,\n\nAnd thanks for all the fish.",
            "Thank you for being the one cool mod in this shithole of a community. I mean, mods are like those Karens who drag their expensive cars into repair shops and tell the underpaid mechanic to fix whatever the hell is making that weird noise and please have it done two hours ago. \n\nI would love to say whatever the fuck I want, but unfortunately, my usual sub bans you for calling someone out on their bullshit and trying to argue with the mods is like trying to argue with a camp counselor. (I got banned in under three days.)",
            "Legitimately one of the better subs that way re: being free to speak, with and within reason. I don't know you, but fuck off and enjoy a rightly earned retirement.\n\nAH the ol' Necrothread!",
            "Nobody cares, never heard of you, probably inflated your usefulness, dont let the door hit you on the way out",
            "Not an airport.",
            "Ok",
            "this is stickied and I just want to tell you, no one cares.\n\n>(no, this isn't my subreddit, I'm just the dumbass you all saw the most).\n\nYou are such a fucking main character syndrome narcissist dude. No one even knows who you are judged on the comments and here you are leaving a stickied post up for 8 months LMAO.\n\n>(also in b4 \"this ain't an airport, you don't have to announce your departure\")\n\nyou put this as an inb4 defence because you knew no one would care.",
            " Yay found my community I literaly had my comment removed for containing a gendered slur. \n\nWhat was the heinous comment I hear you ask?\n\nAfter dropping pearls of wisdom I closed with... apologise if you been behaving like a dick'.\n\nSorry not sorry.",
            "A",
            "Mods are people? I thought its bots",
            "[removed]",
            "Go fuck your self",
            "Power hungry, like the fucks at r/whitepeopletwitter as an example?",
            "GTFO",
            "Oh no. Anyway",
            "Thats a fucking lie dude... I got a 3 day ban from Reddit due to a comment i made in R/Clevercombacks",
            "A\n⁰",
            "RIP Freedom of information.",
            "Sure, he can call me cisgendered, but if I call 40 people the n-word on r/aww, suddenly I'm the bad guy...",
            "Not everyone says that.  Only some trying to ham up thier ausieness",
            "Underrated Mission Impossible quote, Emilio Estevez.",
            "Oh, and uh, don't chew it.",
            "Barry! \nMy long lost brother!\n-Doug M",
            "Hi q",
            "Only if you give me a snack pack and apple juice 😁",
            "Yeah Mon, let the weed bunn!",
            "And bud and Jack Daniels… (DISCLAIMER) I don’t wanna work for whoever makes it…have you seen amazon lately?",
            "Assuming I'm able to arrive on time.",
            "\"You can blame it all on me\"",
            "Late as hell but yes.",
            "Just watched the movie last night and I intend on reading the book soon.",
            "I'll be honest, I miss moderating this subreddit, and seeing comments like this just intensifies that feeling.",
            "Wait until you feel 2 tits at the same time. :)",
            "And this account has been suspended. I wonder why?",
            "Happy cake day",
            "Thank you, thank you",
            "Bingo",
            "This sounds like a great deal.",
            "I can't even remember what you know what was 😀",
            "What's the \"you know what\"?",
            "r/clevercom ... Oh wait",
            "Aww thanks!"
        ]
    },
    "r/clevercomebacks is recruiting mods": {
        "title": "r/clevercomebacks is recruiting mods",
        "score": 88,
        "url": "https://www.reddit.com/r/clevercomebacks/comments/14icdrm/rclevercomebacks_is_recruiting_mods/",
        "content": "Hey everyone\n\nYou don't really see much from me, which is a testament to how great of a job u/TheGreatZarquon did of keeping everything under control all these years. But with his stepping down it's become a bit apparent just how much he did. \n\nNo point in writing some long essay or whatever, but if you'd like to be a mod then fill out [this google form](https://docs.google.com/forms/d/e/1FAIpQLSfQ39Cdh0GRys5oH8bdbRaa0K6xK9Zoc6O21Q0e8I1IPawtsw/viewform?usp=sf_link). It's not too intense and most of the questions are aimed at just figuring out your mod style to make sure you fit in with the direction we want for the sub, which is pretty much the status quo of what those of you who spend some time here would be familiar with.\n\n(Anybody applying who's flaired as a karma farmer spotter or bot hunter, make sure to include that)",
        "num_comments": 24,
        "comments": [
            "Is this why so many people get away with breaking the rules and nothing happens?",
            "Hello. No life haver here.",
            "I'm more than willing to help though only on week days 8:00am to 1:00am sorry if its inconvenient",
            "66****",
            "90% of mods just want a power trip and ban for no fucking reason... This whole site is nothing but a toxic cesspool..",
            "ok- I can delete all the unclever strawman and whataboutism comebacks,  but then this place will be empty",
            "This clevercomebacks hs become too much of a political platform more often than not instead of it’s original intent IMO",
            "I joined the sub a few minutes ago how do i sign up",
            "When",
            "How much can i charge for my duties?",
            "will act arbitrarily for food",
            "Гол",
            "A",
            "[removed]",
            "No I'm 2 we 4w nox no 2",
            "You can charge as much as you want",
            "Л",
            "И я",
            "qq1111"
        ]
    },
    "The original comeback": {
        "title": "The original comeback",
        "score": 33992,
        "url": "https://i.redd.it/tlc4cr5io18d1.jpeg",
        "content": "",
        "num_comments": 460,
        "comments": [
            "Wait until she finds out about Noah and his big ass boat...",
            "God canceled everyone on earth once with a huge flood so????",
            "I mean, that’s his MO",
            "I think she means instead of cancelling people, they should be tortured and set on fire. It's what Jesus would do.",
            "What about the time God cancelled every first born child in Egypt except those whose families cancelled a goat and smeared its cancelled blood on their doors?",
            "It wasn't over an apple. It was over being annoyed at his lie being found out.  The very first lie in the Bible is told by god: \"don't eat this, it'll kill you\". The snake comes along and goes \"well, that's bullshit\". They believe the snake, because everyone knows sneks are nice animals that help and eat pests, and god gets pissy when he's found out. The \"knowledge of good an evil\" they got from eating the apple was obviously \"god is evil\".",
            "Remember when god turns someone into a rock for looking over their shoulder or when he smites two entire town because they were full of sinners",
            "Let's not forget God cancelling Onan for ... *checks notes*\n\n... Pulling out when raw dogging his sister in law, instead of nutting in her as God intended.",
            "God also supposedly killed the whole human race several times over.  Also the first born of everyone except the Jews. That’s a lot of cancel culture.  Basically every time he realized he fucked up he wiped the slate clean.",
            "Bruh, the bible is full of God cancelling shit. At one point he cancelled every living thing on the planet except for dude and his boat full of animals.",
            "Didn’t God cancel Job and his entire family just to test his faith?\n\nThere are repeated stories that paint God as an abusive alcoholic type personality",
            "And then there are sodom and gomorrah, this small thing with the flood and the Tower of Babel…God basically defined cancel culture 😂",
            "Wait until she finds out that god impregnated a 14 year old child to save us from himself.",
            "The second bible story is about god canceling one of the sons of the people of the first story for no reason whatsoever which causes the first murder. Then cancelling him even harder.\n\nThe third bible story is about god canceling everything and everyone except a dude with his family and pets.\n\nThe fourth bible story is about god canceling everyone again because they worked together peacefully and build a tower.\n\nWho wants to continue?",
            "Do Christians even read their own book?",
            "You’re only susceptible to cancel culture if you believe in it.",
            "Canceling almost all life on earth, too, with a flood.",
            "And the book of Revelations",
            "Hey, Soddom! Get Gomorrah! They're talking about you guys!",
            "Yahweh is the evil god and the snake is the true god saving them from eternal prison. \n\nThat’s why Moses has a staff with a snake on it to warship later on.",
            "god cancelled a looooot of people plenty of time..   \nbut hey, american jesus is a totally different religion bro",
            "Bro has canceled all of humanity because he didn't like the vibe",
            "r/wooosh",
            "He made it rain for 40 days and 40 nights and spared Noah like he’s a school shooter and Noah was the one kid that was nice to him.",
            "Another acceptable clap back for this would've been: \"tell me you haven't read the Bible without telling me you haven't read the Bible\" imo",
            "The story of Job… holy fuck.",
            "Sodom, Gomorrah, Babel, Noah... has that guy ever seen a bible?",
            "God flooded the world canceling almost everyone.\n\n\nBased on the Bible god is a mass murder on multiple accounts. And people worship him instead of trying to get rid of him. Makes zero sense",
            "Also as an atheist I’m probably worth less than a lamb to god",
            "What about the rapture? God will have to cancel all the nonchristians and the bad Christians. Religion is all about canceling the others to proof that we have the best sky daddy.",
            "God also cancelled the entire world, and only told one dude to build a boat.. dudes a psychopath",
            "God literally cancelled his own favoured seraphim because the dude liked God's children a bit too much. Also because he was a saucieboy",
            "Tf is the first girl on? God has *smited* people for less. Tf outta here. Why do the people who claim to be religious literally know fuck-all about said religion!? It’s mad science man.",
            "Not to mention he drowned the entire world (poor animals too) because he gave people free will and then they didn't do what he wanted",
            "According to Christians, God is still cancelling people! At the moment or your death, you're either included or cancelled and apparently it can be for something as trivial as loving people with the wrong genitalia.",
            "And mind you, the first 2 people had the innocence and naivety of a toddler.\n\nGod punishing them is the same as a parent punishing their child for getting kidnapped by a dude with an ice-cream truck.",
            "Wait till she finds out about Sodom n Gomorrah",
            "Funny how people act like cancel culture is relatively new, but boycotting is obscure.",
            "God also allowed Job to lost his wife, his children and everything he had *just* to see if Job would continue to worship him after that.\n\nBut it’s cool. He gave Job the replacement family after that. /s",
            "No way that’s not sarcasm",
            "Man, God literally burned down the Sodom coz people there got too immoral",
            "God was such a massive prick in the Old Testament. Asshole flooded the whole word just because it got a little “corrupt”. How corrupt could have things been when the economy consisted of subsistence farming and sticks?",
            "Sodom and Gamorrah, Cain, The Great Flood, Pharoah/Egypt, Jericho, Every single person who hasn’t been baptized by the rapture. Who hasn’t he cancelled besides Ezekiel?",
            "Or every first born Egyptian child",
            "*Noah and the Everything Cancelled*\n\nDon’t mention the Amalekites.",
            "Also, the last story in the Bible.",
            "Isn’t Satan basically an angel that got cancelled by god?",
            "It wasn't an apple! Stop spreading this lie and read the bible.\n\nIt was the fruit of the tree of knowledge of good and evil, i.e. get smart and god will fuck you over.",
            "Lol 'god' apparently spites and punishes people for doing anything it doesn't like. Like not worshipping him.",
            "These God Believers, never read any of the books.",
            "And remember those two entire cities he's canceled. And that one time he canceled the whole world with a flood.",
            "I believe God has canceled more people throughout the Bible than the devil has. God when on a cancel spree",
            "God cancelled the entire planet (according to their stories) with the exception of Noah and a few animals.",
            "And flooding the world",
            "Cancelling every firstborn.",
            "The Bible does not directly state that the forbidden fruit eaten by Adam and Eve was an apple.\nThe idea that the forbidden fruit was an apple became popular in the Middle Ages, possibly due to a 4th-century Latin translation that used the word \"malum\" to refer to the fruit. \"Malum\" can mean both \"evil\" and \"apple,\" and over time, the second interpretation prevailed in popular culture.\nHowever, the Bible only describes the forbidden fruit as the fruit of the tree of the knowledge of good and evil. No description of its appearance, taste, or type is given.\nIt is important to note that the story of Adam and Eve is a symbolic narrative, not a literal historical account. Its purpose is to convey a message about human nature, disobedience, and the consequences of sin. The identity of the forbidden fruit is not a central element of the story.",
            "He’s got a point lol",
            "Guess they ain't heard about the PMRC then huh? \n\nThe original cancel culture.",
            "Wait until she finds out there’s a TON of shit you can say or do and God will cancel you for it!!",
            "What is hell? Oh baby Jesus don't hurt me. Don't hurt me no more.",
            "What does \"smiting\" mean, exactly?",
            "He cancelled 500 million people in the flood. Who’s going to tell them?",
            ".. over an apple created by God. so is it planned?",
            "Isn’t hell kind of the final, ultimate cancel?  New Testament, of course.",
            "You’re literally canceled at birth according to the Bible",
            "I would love cancel culture if everyone would start boycotting things that matter",
            "The funniest thing about God cancelling so many people is they were all guys he made.",
            "Well, I think he meant that god doesn't \"cancel\" for words, not action. That's untrue too, but still canceling people only for their opinions or quotes is amoral",
            "r/noahgettheboat",
            ">Fry: Well it's not right to make my dead pet an exhibit. That's like digging up Lassie and putting her on display in the Louvre.\n>\n>Amy: Lassie is on display in the Louvre.\n>\n>Fry: I know. I was deliberately describing a similar situation.",
            "Those MOST LIKELY to cancel ANYBODY, are those who \"believe\" in.a.religion...PERIOD...END.STOP...NO.ARGUMENT.POSSIBLE.... PROOOOOOOF IIIIIS EEVVEERRYYWWHHEERREE.....\n\nseriously...don't even try to challenge this REALITY peeps....",
            "Where does it ever say an apple?",
            "Wait wait wait, they do know about the hell?",
            "One rule: don’t eat this fruit. What do they do? Eat the fruit. Snake tricks them, and they all get punished.",
            "doesn't god forgive all earthly sins as long as you recognize christ as your lord and savior?",
            "No one said it was an apple though",
            "Bible stories alive, let's talk about all the prehistoric species that went extinct",
            "I could have sworn my family & church told me God was gonna cancel me just cuz I like the kind of kitties that like getting wet 🤭",
            "Technically we don't know which god she's referring to. Fucking Buddha didn't cancel anyone.",
            "That’s not true actually genesis in the Bible starts with a bunch of sex and baby having.",
            "LMAO",
            "More like had their subscriptions cancelled for breaking terms of service.\n\nWhat does it even mean to be cancelled anymore?",
            "no, the first bible story is how satan got cancelled of his heaven subscription just because they wont respect adam.\n\nthere is a reason as of WHY satan offered the forbidden fruit (which is not an apple, btw) to both adam and eve.",
            "Lol. But not really, though. They broke the law. God’s Law.\n\nCancel culture is just a mob punishing someone that didn’t break a law.",
            "as a christian, I have 0 issues with this XD",
            "Isn’t half of the Bible about god cancelling someone for some minor infraction on arbitrary rules he made up?",
            "Cancel culture is still shit",
            "Yeah. I think God canceled me after I got kicked out of my 4th preschool for not \"assimilating in the correct manner\".",
            "Wait until they hear about the first testament.",
            "Jesus Christ and his apostles to his cancellation.",
            "Vindictive SOB calling us all sinners ever since🙏",
            "I'd probably question why he made me like that, ask what the great design was and then start naming people that actually did fucked up shut, I'd also ask why people with extremely disabling conditions were created.",
            "Cancelled everyone with original sin. Then cancelled his own son to un-cancel the original sin, provided the once canceled people get baptized.",
            "Yes but those are the parts of the Bible they ignore when complaining about cancel culture.  Cherry picking the Bible:  justifying bad actions for 2000 years.",
            "Cancelling all of mankind for eternity over an apple actually.",
            "that’s not exactly a comeback. God was the villain in the story.",
            "Hi, how do I give someone a Nobel Prize?",
            "People who hate cancelculture probably have something to be cancelled for",
            "\"God cancelling you because you did or said the wrong thing\" is, like, the *theme* of the Old Testament.  \nIt got to the point where he was telling his peoples \"OK, OK, I promise not to kill every person on the Earth again. ...At least not by *this* most recent method.*",
            "Yea, god just kills you instead.",
            "I feel like that first tweet is pretty obvious and heavy handed sarcasm.",
            "Subsequently, a deluge erased mankind once more.",
            "I wonder if these people ever actually read the Bible. It’s a collection of atrocious (and somewhat arbitrary) capital punishment and genocides. Ask the Pharaohs for instance…",
            "Technicaly he gave Adam and Eve what they wanted. Living on their own deceiding whats good and bad.",
            "Seems this fool is oblivious.....Noah and family were the only ones to survive a serious cancel by God.",
            "The bible is literally god cancelling people. Heaven vs hell is literally god cancelling people...\n\n  \nAnd cancelling, I might add, for reasons that are only possible based on his own directives. Like giving cake to a child and the punishing them for eating it. \n\nWe shouldn't all get into all \"bad\" things, but it is a very stupid oversight on the part of a being that is supposed to be omnipotent.",
            "Well who can just brief me what the Cancel Culture means?",
            "He also cancelled the tower of Babel and the cities of Sodom and Gomorrah because they were too woke.",
            "Literally the entire premise of Christianity is God cancels all humans for any sin they commit no matter how minor",
            "God's in his uncancel era rn tho ✌️",
            "God is the OG of cancel culture.",
            "In fairness, his views may have changed after his son was cancelled",
            "They had one job I'd cancel them too",
            "NITA FROM BRAWL STARS??11??1?1",
            "Were any of the sermons recorded in writing by anyone that’s not his followers? (Not exactly without agenda if you are a follower)",
            "mf ever heard of hell???? god literally sends you to a physical recreation of twitter",
            "Also not using god’s name in vain lmfao",
            "The very first story about God told by humans. Very telling",
            "I hate stuff being reposted ad nauseam.",
            "Isn’t the first one just satire?",
            "Clevercomeback or r/woosh, we will never know.",
            "God be cancelling any non believers too 💀",
            "Yeah, I'm good with that.....should have followed the rules!!",
            "Lmfaoooo people be mad at the wrong things on this earth I’m telling yall",
            "God plans to permacancel a bunch of his alleged children when they die",
            "We don't even know if it was an apple and at that time they were 'innocent' like a kid, imagine telling a kid, any kid you can open any door in the house except this one.  You are asking for trouble. \n\nAnd since the Christian God is apparently all knowing he knew it was going to happen, it was planned. They were set up for failure.",
            "You mean imagine getting fired because you said something racist or intolerant?",
            "That story is literally the \"put candy in front of a kid\" test, and Adam and eve failed.",
            "Cancel culture isn't even a new thing.. And the people who keep bitching about it still have a platform to bitch about it from. Fucking people.",
            "Can somebody tell me where an apple is mentioned in the bible?",
            "\"My God, my God, why have you forsaken me?” - J.H.Christ.",
            "Based God.",
            "What is the definition of cancel in this context? Is it make a pariah? Its weird using that term for people and not classes or shows or something",
            "God literally zapped Onan for pulling out and spilling his lil cummies on the floor.",
            "She forgot about Hell 💀",
            "This isnt a comeback since im 100% sure that the first person was being sarcastic",
            "That’s blasphemy!!!",
            "I think someone needs to read the whole bible",
            "I think she’s from Barbados",
            "God will ne er cancel us.  But with that said, he wants us to behave a certain way.  He does not want us to give in to our base urges.  Just like with children, there are consequences for our actions.  In the end, if you accept Jesus Christ as your Lord and savior, you will gain entry into heaven for eternal life.",
            "Isn't that literally what Blasphemy is?",
            "Didn’t god also cancel the world once",
            "Wait till you find out the Bible is the number 1 selling fiction book",
            "God cancels peoples tickets to heaven and sends em straight to hell 😅",
            "Not the point, but Rihanna is from Barbados.",
            "I have the impression that God get cancelled by more People than God is cancelling himself 🙄 these days anyway.",
            "Rihanna isn't Jamaican, is she?",
            "Christians always try to cancel everything, from rock and roll music, to video games. Christians have tried to ban literally everything that is remotely entertaining.",
            "And this is why you eat apples",
            "Can someone clarify what people mean by 'canceling'?\n\n\nI always thought it was digging something up from someone's past and using it to pressure them and many of their relationships, personal and professional, to drop them. Trying to remove everything about them from the public eye.\n\n\nIt's not consequence or boycott, right? ",
            "God canceled humanity with the Global flood, but in Eden, I thought he just taught them a lesson, didn't cancel.",
            "Wait till they hear about the unbaptised babies",
            "Remember that time god cancelled the planet?  Good times.",
            "God loves all of us as his children and like any other loving parent will *torture you forever* if you fuck up.",
            "Personally I think my favourite verse is [samuel 6 6-7](https://www.biblegateway.com/passage/?search=2%20Samuel%206%3A6-7&version=NIV)\n\n*\"6 When they came to the threshing floor of Nakon, Uzzah reached out and took hold of the ark of God, because the oxen stumbled. 7 The Lord’s anger burned against Uzzah because of his irreverent act; therefore God struck him down, and he died there beside the ark of God.\"*\n\nGod decides to strike a mother fucker dead, not because he went against an act he couldn't foreseen, but for an act he presumably programmed into us. There's worse verses that point out worse. But this just has some \"fuck you I'm god\" energy to it.",
            "Nah, God cancelled the entire human race over that apple actually.",
            "Isn’t that the whole plot and theme of the Bible? Man fucking up, god cancellinf.",
            "Not just two people, entire mankind",
            "Remember Sodoma and Gomorra?",
            "The Catholic Church cancelled Lilith and a number of other chapters.",
            "I just finished the Old Testament and God kills tons of people all the time. It’s kind of his go to move back then",
            "Except God searched for Adam and Eve (who hid on their own accord), clothed them, and prophesied that Eve’s offspring would one day destroy the evil that manipulated them. The take down isn’t a comeback, it’s an ignorant fool critiquing a Biblical account that they are grossly misinformed about. The only thing that God did was make life difficult (for the entire human race), he didn’t take anyone’s livelihood away. He didn’t blacklist anyone to the point they could never work again. God did cancel their lease, basically told them that ‘Since you don’t want the mansion you can take the trailer park and now you are all farmers.” And the purpose of this was to draw attention to the immutable truth that we need God and he alone has a redemptive path for our lives. The entire purpose of Scripture is to teach that the requirements of God are not burdensome (compared to the hardship of attempting to live life according to your own strength and reasoning). Compare this to the cancel culture that will forever take away your ability to find employment, harass you, eradicate your life’s work, memory hole you, and will mock you if you ask for atonement.",
            "Christians are the origin of cancel culture. Well, really religion in general.",
            "Jesus cancelled a fig tree for not bearing fruit out of season 🙄",
            "lol he turned up two thousand years ago, in the most superstitious part of the world, and since then he cancelled the whole world!\n\nHe don’t even look at us, he’s some strange evil dude. Like a dictator actually, he force us to love him by fear.\nBelieve me or you go to hell.\n\n(I’m been reading a lot of history books and it’s so obvious how religions starts, yes I’m agnostic)",
            "Oh god is a cunt",
            "God has been cancelling the whole world \n\nFor two thousands of years",
            "God came down to earth as human and suffered so you had the chance to not not be cancelled. Everyone does evil and deserves hell, but you guys pretend to be saints and never commit any mistakes.\n\nHeaven is not a place for good people because no one is good enough and no good deed can pay for the evil we do. Heaven is a place for people who repent of evil and are willing to change.\n\nLet the one with no sin cast the first stone.",
            "God has cancelled lots of ppl in the Old Testament",
            "I mean: if you don’t worship him or say blasphemous things, you’re sent to hell to suffer unspeakable torture for eternity. Which is, to me, kind of the fucking ultimate cancel.",
            "….this makes me wonder! What if, please, explore with me, what if there is another species of people in another galaxy that actually didn’t eat the fruit…what would their riches have been? What heights has this species reached with such discipline established?",
            "Cancel culture is just consequences for your actions. There is just a spicy phrase attached to it now. If you don’t do shitty things then people tend to just leave things be.",
            "God has cancelled millions.",
            "Isn't the first comment just satire?",
            "We went against Terms and Conditions",
            "I hate this, I can’t verify that either of those accounts actually exist. \n\nThe internet has become this weird place where people make it look real but it’s fake/spam and it’s damn near impossible to tel the difference. Nothing against OP.",
            "Canceled people with  a flood, first borns with a curse.  Do they even read the Bible their god supposedly wrote?",
            "Then burn the sex city",
            "Remember when god cancelled a whole man's family and livestock over some shit someone ELSE said? \n\nThen when the man asked good \"why\" out of grief good told him basically to stfu and that his human mind can't comprehend his reasons. But his reasons were just... He made a bet.",
            "Isn't that where the culture originates from",
            "lol. That’s literally what god is all about: act how I expect, and worship me, or burn in hell forever.",
            "Actually. \"Canceling\" isn't real. It's a form of illusion that weak people interpret as reality. You can cry all you want. You can say all you want, at the end of the day, I decide what is started or cancelled, not you. 😊 Cry more.",
            "God: the biggest bitch of them all!",
            "Yes because getting cancelled for things that are never more than thoughts in your head is so much better.\n\nLike, has this person never heard about the part where internal beliefs and desires are punishable offenses?\n\nThose are kinda major in Christianity.",
            "And who gave random people the power of God?",
            "The whole damned bible is about god canceling people.",
            "“God” cancelled the people of Canaan, ordered the Israelites to wipe them out and steal their land. \n\nThey’re still at it.",
            "it's prolly like 5 people here that actually read the bible, atually trying to understand it",
            "Christians never read the Bible. That is why they need someone to tell them what is in it.",
            "These same people try to use the Bible/God as an excuse to \"cancel\" LGBT+ people. Fuck them.",
            "According to most branches of Christianity, the very first story is god canceling every human ever over an apple.\n\nAccept jesus as savior or burn eternally!",
            "IN FAIRNESS TO GOD he did say \"My only rule is don't touch apples from this tree\" AND SHE COULDN'T EVEN DO THAT!",
            "I’ve never met a Christian who knows anything about their faith.",
            "Remind me where it says it’s an apple",
            "iuboun thing they be reading th",
            "This comeback will go down in history.",
            "People here are saying that god cancelled all the people he killed in the bible, but also nobody’s mentioned the fact that literally every single person sent to hell was “cancelled by god because they did or said the wrong thing” lol",
            "Dude then apparently makes himself flesh and blood, then suffers and dies so said descendants of that cancelled couple can be ‘uncancelled’?\n\nOld Testament is low hanging fruit here. \n\nNT is a bit trickier - if nothing else, JC’s message is pretty much the complete opposite of cancelling people. \n\nIf only 99.9% of those who profess to live by that message actually did the same.",
            "An apple?",
            "Nobody ever said it was an apple",
            "It never said it was an apple.",
            "The Bible doesn’t say what the forbidden fruit was…\n\nJust sayin tho",
            "Cancel culture is a rehash of the unforgiving, zero-tolerance practices of the biblical era. The absolute shunning of disapproved celebrities is the social equivalent of sending them into exile in the desert.",
            "[deleted]",
            "He sent Jesus as a redemption for what Adam and Eve did",
            "That's not true, though.",
            "Not over an apple. It was because after eating from tree of knowledge, humans were able to distinguish between what's right and what's wrong, and apparently that's a big no no.",
            "Thats a shit retort\n\nAdam and Eve were specifically told to stay away from that one tree",
            "People who criticize the bible tend to know the least about it, that \"comeback\" comment is very exemplary of that.",
            "Fuck you.",
            "No god didn't cancel adam an eve, he kicked them out of Eden, he didn't slander them in the public eye, he didn't make all the animals under stand they fucked up and make them shame and shun them, he just told them to leave.",
            "Or Lot and his wife",
            "Or how God cancelled all the other cooler gods out there!",
            "How about the entire concept of heaven and hell. Don't acknowledge God, straight to hell. Dad/Mom a POS and don't honor them, straight to hell. Look at your neighbors wife, straight to hell.",
            "and when he sent a bear to kill a bunch of children because they insulted a disciple",
            "The tower of babel too",
            "Were the animals also all being degenerate, ungrateful fucks? I get he wanted to smite the humans but wtf did the animals do\n\n\nEdit: I guess the fish were pretty pious and chill.",
            "Or that hell thing they talk about.",
            "Or Ham, whose crime was accidentally seeing his dad naked while he was drunk off his gourd.",
            "And that there was no apples in that story. \n\nAnd that snakes walked on two legs when he persuaded Eve to eat of the forbidden fruit............before she ate it, mind!",
            "Moral is, God's a bit of an asshole isn't he?",
            "The original reboot.",
            "You just assumed something about her God without knowing her religion. You should be cancelled too 😏",
            "That he somehow built all by himself and then managed to collect every species of animal. Most of which not all being in the same place.",
            "Or like Job, over a bet",
            "THIS",
            "Wait until people discover what real God is, and not base everything on a dogmatic view of a physical and almighty being in the sky telling people what to do 😅",
            "Nah. There were some on the boat... remember?",
            "It was worse than cancelling. He committed genocide several times with floods, 7 plagues, making people walk aimlessly for years in the desert, and if that isn't enough, once you die he can still send you downstairs to an eternal torture chamber. Oh and he might ask you to kill your own son, and then be like \"yo it was just a prank\"",
            "The top tweet was being sarcastic.",
            "The flood didn’t kill everyone lmao. In fact there is evidence that there was a flood at the same time as the biblical flood, but it was mainly in the Black Sea. The rest of the earth didn’t flood.",
            "Or drowned, or mauled by bears, or...",
            "Nope, Jesus didn't call for violence.",
            "That cancels itself out.",
            "Then cancelled his own prophet after he cancelled the tablets upon which were written the 10 Cancelmandments, which cancelled anyone who didn't obey them",
            "I mean, he wasn't wrong. They positively *did* die lol",
            "Right? And it wasn't just two people. Its every person ever unless they have Jesus save them from their original sin - or some shit - it has been a long time since I studied any theology. But as far as I know God is *still* mad about that shit.",
            "The snake imagery is actually from Milton, not the Bible.",
            "This is a real fun fanfic, but it doesn't make any sense. Are you saying that the authors of Genesis wanted there to be a subversive reading of the text that they badly hid in plain sight?",
            "It’s God’s fault people hate/are scared of snakes. Poor things.",
            "There is no snake nor apple mentioned in the Bible.",
            "What I don't understand is that when people try and act like they're intelligent, critical thinkers that are going to highlight nonsense in the Bible (which don't get me wrong, I believe the Bible does have a lot of nonsense), why do they what you just did, which is either lie? \n\nIn the Bible, God doesn't tell them the fruit from the tree with \"kill them\", he's say if they eat from the tree then they will die. Not that the fruit itself will kill them. But that their actions will have consequences that God will carry out.\n\n>But of the tree of the knowledge of good and evil, thou shalt not eat of it: for in the day that thou eatest thereof thou shalt surely die.\n\nWhich was absolutely true. They ate from the tree, God punished them for disobeying him, and he made them mortal beings that could die.\n\nAlso, the serpent doesn't say \"that's bullshit\". In the Biblical narrative, he is literally the one that lies by telling them eating from it will make them gods\n\n>For God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall be as gods, knowing good and evil.\n\nDid they become gods? No. The serpent very clearly lied.\n\nI mean, believe the Biblical story or not, but ffs at least be accurate and honest about WHAT the story is actually saying.",
            "And he is totally fine with Lot, banging his daughters. That old boozehound.",
            "According to this story they were sinners, but maybe this god is just murdery.",
            "Technically it was salt, but regardless, even that pales in comparison to the drunk incest orge that ensued.",
            "There's only one instance and its the flood",
            "[deleted]",
            "That's the point of the joke in the first tweet they were being sarcastic.",
            "Don’t forget narcissistic, gaslighting, and psychopathic",
            "He canceled him to win a bet. Omniscient God already knew Jobs heart. When I was a Christian I sugar coated it to people by framing it as just a test. Ruining someone's life to win a bet just sounded too much like the movie Trading Spaces to me.",
            "> There are repeated stories that paint God as an abusive alcoholic type personality\n\nIt's more of an abusive husband/father.\n\n\"I love you\", but then you do something He doesn't like and now you've got a black eye and cuts all over. But He still loves you.",
            "“Our Father who art in Heaven” is the OG narcissistic parent lol. \n\n1. Made his kids and then dipped, never to be heard from again\n\n2. Blames his children for things beyond their control \n\n3. Attacks his children on a whim\n\n4. Brutally retaliates against any perceived slight or disrespect \n\n5. Must always be in a position of superiority, and gets enraged when anyone else comes close\n\nThe man’s the Lord of r/raisedbynarcissists",
            "It's a lot easier to use it to justify horrible political opinions, if you don't.",
            "I do, and I don't think anything within it is \"bad\" xD",
            "Tldr - \nOld Testament Disobedience = Death - Separated from God\nNew Testament - because we are statistically disobedient (natural desires of the flesh) sends His only Son as a sacrifice (Jesus, YHWH, the Messiah, etc.). The sacrifice occurs (Roman punishment of death) and he dies and comes back from the dead. This allows us to be with God again one day for those who believe in the death, burial and resurrection of Jesus.\n‭John 14:6 AMP‬\r\n[6] Jesus said to him, “I am the [only] Way [to God] and the [real] Truth and the [real] Life; no one comes to the Father but through Me. \r\nNow for those who know Him (as stated above), and disobey, and ask forgiveness there is grace. Upon physical death they are welcomed into eternity with the Father.\nFor those who do not know Him (as stated above), and disobey, there is no grace (see mercy instead). Upon death, these individuals are not welcomed into eternity with the Father, they have died in their sins. \n‭John 8:23-24 AMP‬\r\n[23] He said to them, “You are from below, I am from above; you are of this world, I am not of this world. [24] That is why I told you that you will die [unforgiven and condemned] in your sins; for if you do not believe that I am the One [I claim to be], you will die in your sins.” \r\nCancelled looks different depending on the testament you're in. Most of this thread is OT stories to drive the point home but taken out of context, yes it is pretty funny.",
            "A staff, no matter what design, is a bad warship.",
            "God created America, and then Jesus was born and defeated the British with an AR-15.",
            "Almost the entire thread.",
            "School shooters are cowards. Noah built a boat, publicly, and gave people ample time (over 100 years) to RSVP.",
            "It's so generic, boring and overused that it would be worse",
            "*\"It's just a prank, bro\"*\n \nThe prank:",
            "As an orthodox Christian I say no, you are a child of God",
            "The rapture is literally a made up thing invented by a guy in 19th century america. Literally noone believed this prior\n\nAs a (soon to be) orthodox christian, I find american protestant christianity (espetially evangelicalism, baptists etc) to be a bunch of unquestioning 80 IQ people. They just swallow whatever unbiblical doctrine their \"pastors\" give them.\n\nAlso saying that religion is all about canceling the others doesnt really work, Christians (at least in history) were literally dedicated to spreading the gospel all over the middle east and Europe peacefully, especially in the east. Yes, there are a lot of bad fruits coming out of religious institutions, especially the \"catholic church\" which is literally like, insane nowdays, always has been  since the schism tbh",
            "this is truly a reddit moment",
            "Fridays, amirite",
            "(Not trying to be rude or anything)\n\nBut why is God flooding the world a bad thing in your view",
            "Enoch. Dude straight up got skybeamed UFO abduction style",
            "And sometimes for worshiping him too much and he just wants to fuck with them (Job comes to mind)",
            "But fundamentalists told me the bible is literal.",
            "Genesis not being a \"literal historical account\". \n\nSurely the first humans kept detailed written records. /s",
            "It's a 300 million volt cancellation",
            "He also forced the pharaoh to refuse moses demands by hardening his heart and then punished all Egyptians for the Pharaoh's decision. Murdered all their fist childen actually. For something he forced to happen.",
            "It's people being annoyed that there are consequences to actions",
            "No. “But while he was still a long way off, his father saw him and was filled with compassion for him; he ran to his son, threw his arms around him and kissed him.” Christian faith is about grace and mercy.",
            "Love me, stay with me, and do what I say. Or I will torture you forever...  I've had boyfriends like that.",
            "See Lilith",
            "Kicked them out and made women pay for it.   He cancelled Eden because his set up his own creations to fail.",
            "God flooded the whole earth.\n\nGod destroyed cities.\n\nGod turned people to salt pillars.\n\nGod canceled people all the time.",
            "I have some flood insurance to sell you.",
            "To be fair, if I had unlimited power and didn't want someone touching something, I'd put in anywhere else in existence and not five feet to their right",
            "Pomegranate *",
            "Because eating the fruit (there were no apples in that area at the time) is what allowed her to understand why disobeying was wrong.",
            "It's not specified what the fruit is",
            "The fact that you say \"Where it says ITS an apple\", you know the story they are talking about, so why are you acting like you're an idiot?\n\nWhat kind of fruit it is, isn't the point, but a lot of you are trying to deflect by making it the point.  Religious people are fucking nuts.  No not nuts, like legumes.  Nuts like you're fucking crazy.",
            "It is a red fruit.",
            "Jews",
            "The Bible? Correct, it's fiction.",
            "“Not over eating an apple. It was over eating an apple. Here is more about the apple”\n\nlol",
            "\"Right and wrong...\" or \"pleasurable vs not pleasurable?\" Seriously? you've wasted a chunk of your (presumably young) life worrying that SEX and PHYSICAL PLEASURE are wrong????? Wrong for what?? It ain't a matter of it being wrong \"for someone\" so, what's it gonna be buddy??",
            "Same reason people get canceled.  They did something they weren't supposed to.\n\nGlad you're all caught up now.",
            "Funny you say that, reading the Bible cover to cover is what prompted me to stop being a Christian.",
            "That’s really funny, considering the people least critical of it, Christians, the overwhelming vast majority of them have never actually read the Bible. Are notorious for it. Reading the Bible is exactly why people are able to criticize it, because we read past the same 12 non horrible verses that are read over and over\n\n But anyway, other than how the fruit being an “apple” is up for interpretation, what are you talking about? You seem to be trying to claim this is wrong, but failed to say how. I think there is a reason for that…",
            "Could you elaborate?  Are you snarking in reference to the fruit of knowledge being technically an undisclosed species?  'Cuz aside from that niggling detail the sentiment holds water.",
            "He literally condemned eve to suffer in childbirth and told Adam he was now going to have to work the land and toil hard to just be able to survive.\n\nThe exact word in the Bible are \n\n16 To the woman he said,\n\n“I will make your pains in childbearing very severe;\n    with painful labor you will give birth to children.\nYour desire will be for your husband,\n    and he will rule over you.”\n\n17 To Adam he said, “Because you listened to your wife and ate fruit from the tree about which I commanded you, ‘You must not eat from it,’\n\n“Cursed is the ground because of you;\n    through painful toil you will eat food from it\n    all the days of your life.\n18 It will produce thorns and thistles for you,\n    and you will eat the plants of the field.\n19 By the sweat of your brow\n    you will eat your food\nuntil you return to the ground,\n    since from it you were taken;\nfor dust you are\n    and to dust you will return.”\n\nSo he literally told them they will now live a hard life because they fucked up.\n\nAnd he was even more unforgiving to the snake, which he didn't \"shame and shunned\" it, he removed it's fucking limbs.\n\n14 So the Lord God said to the serpent, “Because you have done this,\n\n“Cursed are you above all livestock\n    and all wild animals!\nYou will crawl on your belly\n    and you will eat dust\n    all the days of your life.\n15 And I will put enmity\n    between you and the woman,\n    and between your offspring[a] and hers;\nhe will crush[b] your head,\n    and you will strike his heel.”",
            "The Egyptians, the Israelites, the Israelites, the Israelites again. Plus Revelation is just his whole plan to cancel like most people.",
            "\"And Lot's wife, of course, was told not to look back where all those people and their homes had been. But she did look back, and I love her for that, because it was so human. So she was turned into a pillar of salt. So it goes.\" -- Kurt Vonnegut, Slaughterhouse Five",
            "Or, Lot and his daughters and that time he got drunk… or that time he did the righteous thing… ya know, with them angel around?",
            "Gomorrah",
            "I love the way the Bible refers to Lot’s wife the same way Cotton refers to Peggy Hill",
            "Came to say this exact thing… cancelled for looking in the wrong direction",
            "Everybody likes salt.",
            "Or Lot and his daughters. 🔥",
            "Cuz god was feeling very salty.",
            "His wife that got turned into salt for looking back? Or his daughter-wives that drugged and raped him so they could have kids?",
            "Or Lot and his daughters",
            "Except that one demigod. What's his name? Something Hispanic, I think... Heyzous?",
            "Ain’t no cooler Gods bruh don’t be weird",
            "Believe it or not, straight to hell",
            "'Go up, you bald head! Go up!'\n\nHistoric burn.",
            "*Padawan voice* : “Master Pooh, what are we gonna do?”",
            "Let us not forget the babies. He drowned all of the babies.",
            "The earth back then was so evil and the blood so un pure even animals weren’t safe from having there innocent screwed by humanity",
            "god rewarded him with the eternal n word pass",
            "If snakes were up walking on two legs before the apple....home girl did the right thing 🤣",
            "Shut up",
            "Wait until people wake-up and realize there’s no reason to believe in gods when there’s no empirical evidence to back it up. Can’t wait for that day.",
            "Just the special people were on the boat.\n\nBut remember Jesus loves everybody!\n\nEven the people who go to hell.",
            "They were probably woke.",
            "Lol classic jesus of nazareth",
            "Holy shit no way!",
            "Brah no one cares about the specifics. The point is God loves canceling anyone and anything at anytime for the most minor of inconveniences.",
            "Having their hair cut off",
            "Matthew 10:34-36\n\n34 “Do not think that I have come to bring peace to the earth. I have not come to bring peace, but a sword. 35 For I have come to set a man against his father, and a daughter against her mother, and a daughter-in-law against her mother-in-law. 36 And a person's enemies will be those of his own household.",
            "The entire concept of hell is just torturing people and setting them on fire. I don't see how you can say this with a straight face-- or is it somehow worse to be set on fire and tortured in the mortal plane than it is to have it done to you for all of eternity because you were born in the wrong place and brought up in a culture that did not value Christianity?\n\nIf we assume hell is real, God would be the biggest canceller as well as the perpetuator of the most violence that ever existed.",
            "Didn’t he though🤔",
            "He supports his father though, who is a murderous psychopath.",
            "And when the prophet came back down from writing, “thou shalt not kill,” told him to kill a bunch of people.",
            "\"Now the serpent was more subtil than any beast of the field\" - serpent != snake ?",
            "Doesn't matter if it's a serpent and a quince. It's all the same, like potatoes, tomatoes, eggplants, peppers, and nightshades. It's all poison all the same.",
            "You’re right about the apple, but the word used for serpent in the Hebrew is clearly a word for a snake. The word used there is likened to a viper or an adder elsewhere. So generic fruit, but definitely a snake.",
            "> no snake\n\nWrong. It's universal that it's a snake. God curses it to slither on the ground, thus creating snakes.\n\nBut you're just trying to argue semantics. Snake and apple are used widely in explaining the story, including art dating all the way back to the middle ages.",
            "He was raped",
            "Regardless who's at fault: sky-daddy cancels all of them, at every opportunity.",
            "The former",
            "It wasn’t a bet, it was Lucifer who has his own free will testing God and Job and loosing",
            "So you have no problem with the rape and incest in the Bible?",
            "Job is what broke me. God goes on a tirade about how it’s not our place to know why we suffer, but we are the omniscient audience and we see why Job suffers a dozen chapters earlier: God is testing Job over a bet with an angel. The scholarly theory is there are two separate authors there, one arguing suffering is a test, one arguing suffering is a mystery. Read together, it makes God into a terrifying villain concealing his motives and intimidating Job into complying.\n\n\n\nChristians sold me on a god of love, but the god of Job is anything but. He isn’t patient or caring. He doesn’t value your growth, curiosity, or friendship. He values your obedience.",
            "Exactly. This was new, witty and straight to the point.",
            "You are outnumbered by the people who don’t agree with you.",
            "\"I love you, but only if you worship me eternally and do everything I say. If you do not, then I will make you suffer endlessly... out of love.\"\n\nWhy is it that we look at people who commit domestic abuse as immoral? Why is it that a man can profess his love for his wife over and over, but that doesn't absolve him from the scorn and consequences of him repeatedly raising his hand against his wife? Why is it that God gets to profess his love for His creation over and over again, but also gets to abuse His creation repeatedly and still be considered moral and good?\n\nWouldn't a demon be the one to demand eternal worship? Wouldn't a demon be the one to cause suffering if it doesn't get that worship? Wouldn't a demon falsely declare its love in order to get that worship? And wouldn't a demon make others believe its the moral and good one even when it abuses creation?",
            "He fucking killed a whole planet of people, is genocide not bad thing for you?",
            "Religion. Is silly.",
            "It was supposed to be like that",
            "It was a pack of sour gushers",
            "Some are green and yellow.\n\nMy point is that the Bible doesn't mention that it was an apple.",
            "Your reading comprehension seems to be worse than what I'd expect from a kindergartener.",
            "I really tried to make sense of your message, but I have absolutely no idea what you are ranting about.",
            "Yeah, you being stuck on porn all day dedicated all your energy to cooming and playing video games isnt great XD Even secular researchers admit that",
            "That seems way off? I agree that there is a loud minority of Christians that haven’t read the Bible, but I’ve never seen any data suggesting anything close to such a large portion of Christians not reading the Bible. I have no idea where you get these numbers from, but you seem to be very sure. Could you link me to your sources?\n\nAs to why the «comeback» in question is incorrect, I don’t know what the other commenter was hinting at, but I can try to explain it myself:\n\nGod didn’t «cancel» two people because they ate from a fruit, it was only a separation between God and mankind (not a «cancellation»). In fact, God didn’t even want this separation. This is made clear throughout the rest of the Bible, and is in fact the reason that NT even exists. When you read the rest of the Bible, you’ll see that God actually does almost anything to rectify the «mistake» of Adam and Eve eating from the fruit.\n\nAs to why them eating from the fruit created such a separation? In layman’s terms, it’s pretty simple. God is pure. God cannot endure sin (in this context, let’s define sin as «an act that’s against God’s word»). When God asks Adam and Eve to not eat said fruit, and they still do, they’ve commited a sin. Because God is pure, it is impossible for God to have any direct contact with Adam and Eve anymore. This is what creates this separation. As mentioned earlier, God doesn’t want this separation, and does what He can to rectify it.\n\nHope that clears up any confusion :-)\nI’d be happy to answer any questions you may have. Cheers!",
            "Still doesn't sound like canceling",
            "The last Egyptian Plague is literally cancelling the firstborns.",
            "Also st peter is basically patron saint of cancel culture.  He doesn't like the cut of your jib?  Banished to hell for eternity.  It's not even demonetization or a cash settlement.  Hell for the rest of time.  And there could be like billions of years left.",
            "Babylon..",
            "You know with how history has gone for the israelites god must really hate them.",
            "I hope that happens soon",
            "And Sodom, both cities canceled to a pile of ashes by fire and brimstone.",
            "Unlike every other example in this thread, Lot's wife totally had it coming. Ignoring safety rules is always at your own peril.",
            "Why you keep calling me Jesús?! I look Puerto Rican to you??  He didn't say Jesús. He said, \"Hey, Zeus!\" My name is Zeus!  Yeah, Zeus! As in, father of Apollo? Mt. Olympus? Don't fuck with me or I'll shove a lightning bolt up your ass! Zeus! You got a problem with that?",
            "Nuh uh",
            "There are a lot of way cooler gods throughout worldwide mythology",
            "Ha! Good one. \n\nAt some point in life I had the idea that hell was just the afterlife for fun people. If you didn’t like fun, heaven would be your predictable paradise, forever, where you could enjoy watering the lawn or enjoy a silent cup of coffee with your partner in your beautiful home. \n\nYour suggestion however would make hell unbearable.",
            "Well yeah it's like when I feel guilty after stomping a cockroach",
            "Only the special people were on the boat?",
            "[deleted]",
            "They began the antiwoke.\n\nHam saw Noah's ham chock, so Noah cursed Ham, but God liked Ham, so Noah's curse hit Ham's son, Canaan. Everybody had a different version of the dick story: Ham fucked on the boat, Ham fucked his dad, Ham cut off his dad's ham chock, Canaan saw his granddad nekkid and went and told Ham about Noah's big hog...it's an awful lot of dick-talk however the story goes. But, it's a really important story. And we know it's a dick story cuz nobody agrees about it lol\n\nSupposedly, there was possibly squabbling about land(don't they have, like, *everywhere?!*), so to reduce the amount of inheritance sharing, a dick was maybe sabotaged to prevent future siblings. Seems to me, the animals are what they'd fight about, not land.\n\nSo this curse that hit Ham, or his kid, would... Genesis 9:25: \"And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren.\" Aka, a slave.\n\nSome brilliant fella in the 15th century concluded that since there were so many black slaves, they clearly are inferior. \"The Curse\" is where he concluded the black people came from; they're the descendents of Cursed Cannan, the slave! And a curse like that wouldn't work unless God allowed it, cuz Noah wasn't a wizard. Unassailable logic.\n\nChristians invoked Noah dick to justify slavery of blacks in the south.",
            "This thread is full of people who think that the first tweet was serious and not a joke and that the comeback is a legitimate gotcha moment. Sorry for assuming you did too.",
            "But specifics are important? That's a disingenuous oversimplification of the Biblical narrative of the Noah and the flood. In the Bible it says Noah preached to and warned his people for 120 years, only after that and their continued rejection did God \"cancel\" them. That's vastly different to the \"cancel culture\" the women in the tweet is talking about, whereby people are more or less cancelled overnight for 1 mistake without even an opportunity to rectify themselves, and in some cases they *have* rectified themselves, but people still deem said past mistake as evidence enough to \"cancel\" them after the fact.\n\nThis isn't about someone being a Christian or not. You can be an atheist and still be factually honest about the Biblical narrative of the flood and it's comparisons to the current phenomena of \"cancel culture\" the woman is talking about.",
            "“No one cares about the specifics” you literally just said that the flood killed everyone bozo. That’s not “the specifics”",
            "Pretty sure Christians will pull out about 100 different interpretations out of their asses to ackshually this shit. Just you wait",
            "> For I have come to set [...] a daughter-in-law against her mother-in-law\n\nI think Jesus is trying to claim credit for something that happens by itself here.",
            "Ah, so this is why MAGAs think the orange shitstain is jesus.",
            "So, Jesus was pretty explicit that God comes first before anything or anyone else, even if that includes you being rejected by your own family. That's why he says he isn't here to bring peace to the world, he's really is not about that. He's here to bring the truth even if that means there will be conflict because of his teachings. He does not call people to literally take up arms and go kill everyone who doesn't agree with them. No, in fact this is quite clearly condemned by the church fathers and saints.\n\nI think you can see how taking a verse like that out of context is bad because the bible is not a collection of verses (not counting psalms, proverbs etc.) but every teaching relates to another teaching",
            "Atheist here.\n\nThat passage isn't about bringing violence, it's about recognizing that he was going to bring division.\n\nIt's a passage I used to paint God as the Devil, as only a Devil would divide people and be proudful of it (on top of demanding eternal worship, making those who do not worship suffer, and all the other Demonic stuff).",
            "This is clearly a hyperbole if you've actually read the rest.",
            "In the orthodox church, we don't hold that people who do not hear the gospel are going to hell necessarily, that is a kind of western catholic/protestant hyper-autism about salvation/damnation. We leave this up to God, I personally think it's prideful and stupid to condemn people to hell, as Jesus said, judge others only as much as you yourself want to be judged. But yes there are certain actions one can take that we can know for certain, as God reveals, damn one to hell without repentance, whether they are in the church or not.\n\n>If we assume hell is real, God would be the biggest canceller as well as the perpetuator of the most violence that ever existed.\n\nSo, God is the giver of life, he literally gives you life, he gives people the abilitity to even breathe, to eat food, to be able to do anything, to have all the pleasures you have in your life, but then people will come and say God is mean because he condemns people who reject him.\n\nIt's described that all of these things are absent in hell - the ability to breathe, the ability to move, the ability to speak or do anything, because hell is a place completely abbandoned by God.\n\nSo no, I don't think hell is an unfair punishment if you consider how much he does for us, and how little we sometimes do for him.",
            "Thank you for your opinion but no xD",
            "I’m going to admit a mistake! It was fruit vs apple being the Milton shift which has stuck. I hate being wrong, but I’ll admit it. It was a nice clickhole to research this morning as that class I was trying to remember that from was like 10 years ago\n\n[Here’s](https://bibleinterp.arizona.edu/articles/2015/04/day398028) some scholarly commentary on the servant/snake/shining one",
            "Could be a dragon\n\nOr another dinosaur.\n\nIm reliably informed by some of these religious people that there were totally dinosaurs around Adam and Eve",
            "It’s not poison either. It is just a generic death threat. Which, technically, is also true as they are sent off to live on earth where you eventually die, instead of continue living in the garden of heaven",
            "The word \"apple\" itself also used to mean any generic fruit",
            "It was a bet. Lucifer believed he would fail. God didn't  need to prove shit to him. God knew his heart. Lucifer testing God doesn't mean shit. God needed to show him he was wrong . 100% bet.. If I tell  my rich friend that his son only loves  and remains faithful to him because of all money and blessing he bestows upon him and he agrees to test his son to prove me wrong this is a bet.",
            "And God was tempted by the Devil.",
            "Yes, there are bad things commited by people within the bible. That doesn't mean that that is something that God necessarily approves. The bible is pretty clear that sexual immorality of all kinds is not approved by God, including rape and incest",
            "Yes, a lot of protestant sects wouldn't agree with me. But than again, we don't agree on basically anything anyway.",
            "Who could have resisted that? The odds were stacked against them from the drop.",
            "Acting like you had no idea what people meant by apple and you needed this explained, just to get to be able to say “ummm technically” is hilarious",
            "The Bible leaves a lot to personal interpretation...",
            "And then I said to them, “The Bible never said it was an apple!” And really showed them my book of genesis knowledge! Apple! Egg on their faces!",
            "Oh…you’re slow…\n\nYou’re not only too dim to understand how silly what you yourself did was, but even with someone pointing it out..it still went right over your head somehow lol that’s wild \n\nYou’re claiming it wasn’t over an apple, and then went on to describe how it was…the “apple” (whatever fruit it actually was) was eaten from the tree…which is what they were saying…and what you yourself said..while simultaneously claiming it was wrong.\n\nIt’s like saying “I didn’t get arrested for stealing a car. I got arrested for stealing a car from Tom.” Lol holy shit dude..just delete it or something. I’m getting second hand embarrassment seeing you try to get out of that",
            "Why would you go to the other end of the extreme?\n\nMost people are just normal and in the middle.\n\n\nUnless you would like me to assume that every pastor and priest is a turbocharged child molester, and I really don’t think you want me to think that.",
            "> That seems way off? I agree that there is a loud minority of Christians that haven’t read the Bible, but I’ve never seen any data suggesting anything close to such a large portion of Christians not reading the Bible. I have no idea where you get these numbers from, but you seem to be very sure. Could you link me to your sources?\n\n\nWe both know you could have just googled this and were counting on it not being linked.\n\n\nhttps://www.christianwebsite.com/how-many-christians-have-read-the-bible/\n\nhttps://research.lifeway.com/2021/05/28/more-americans-are-reading-the-bible-now-what/\n\n\nhttps://www.baptistpress.com/resource-library/news/study-americans-fond-of-bible-but-how-many-read-it/\n\nhttps://research.lifeway.com/2021/10/21/more-americans-read-the-bible-during-the-pandemic/\n\nAnd we have Christian sources here. The percentage is likely muuch lower than even that, due to the billions of people who identify as Christian \n\n\nMy other sources are being a Christian for many years,  speaking and hearing from more than most people, and specifically asking if they have ever actually read the entire Bible, but that’s not all. It’s common sense, considering it is just a fact that out of the **billions** (with a “b”) of people who identify as Christians, are in reality incredibly casual, *maybe* go to church on holidays, if at all, and obviously never and wouldn’t have sat down to read the Bible. Is it a guess? Absolutely. But to pretend like it’s not clearly true and you need hard data to support this conclusion is silly. I know if you actually think about that, you would agree it’s true. I’d bet my left nut you yourself haven’t either. I’d bet you skipped the begets begets begets. Even people who claim to have read the Bible, often not true. But to act incredulous about the majority of Christians never reading the Bible is so clearly dishonest. Even the people in the pews most Sundays. I know you don’t believe the majority of them have actually read the Bible. They read the popular passages, hear what the man in the front reads them, and that’s it. I know you don’t actually need that explained \n\n> God didn’t «cancel» two people because they ate from a fruit, it was only a separation between God and mankind (not a «cancellation»). In fact, God didn’t even want this separation. This is made clear throughout the rest of the Bible, and is in fact the reason that NT even exists. When you read the rest of the Bible, you’ll see that God actually does almost anything to rectify the «mistake» of Adam and Eve eating from the fruit.\n\nlol dude…you’re just being intentionally intellectually dishonest. Just replacing the word “cancelation” with something else doesn’t refute the spirit of the sentiment here. I know you know that. Adam was cursed to toil, they were given mortality for their disobedience, and the “separation”, however you would like to phrase or describe it, is what they mean by cancelation. This was the birth of original sin for mankind. Acting like you can’t comprehend what they mean or what we’re talking about, and just getting extra words on the screen, describing exactly what they’re talking about, isn’t a refutation to the point being made here. You’re being obtuse and masturbatory. \n\n“God didn’t literally cancel them the way we use the word exactly in modern day. They didn’t get fired from their jobs and flamed on the internet. So there. Obviously he just cursed them and punished the rest of mankind for eternity” “god didn’t cancel them. Here is a long diatribe that is essentially a synonym for cancel in this context” lol jesus dude stop it this is insane \n\n> As to why them eating from the fruit created such a separation? In layman’s terms, it’s pretty simple. God is pure. God cannot endure sin (in this context, let’s define sin as «an act that’s against God’s word»). When God asks Adam and Eve to not eat said fruit, and they still do, they’ve commited a sin. Because God is pure, it is impossible for God to have any direct contact with Adam and Eve anymore. This is what creates this separation. As mentioned earlier, God doesn’t want this separation, and does what He can to rectify it.\n\n\nRefer to previous paragraph. Holy shit dude what are you doing \n\n> Hope that clears up any confusion :-) I’d be happy to answer any questions you may have. Cheers!\n\nI haven’t cringed this hard in a while. Did you cum just now? Holy shit",
            "Hell is kind of like cancelling everyone",
            "It's endless suffering, if you put human life of 80 years in balance with endless suffering you realize God don't believe in fair punishment",
            "\"Eternity is an awful long time, especially towards the end.\"",
            "5",
            "According to their scriptures they are his chosen people and are persecuted because of this.",
            "I wonder when god is going to glass Las Vegas or like Amsterdam? Maybe? Does god hate gambling or drugs more?",
            "I don’t know I think if I was to destroy a city for disobeying me I’d kinda value an audience to attest to my might.",
            "Other people being warned is just a thing that preachers, priests, etc commonly retrospectively add in to make it seem less evil by god and Noah.  \n\nThere is no evidence in the Bible that anyone other than Noah and his family were informed of the flood!",
            "Shame about everyone 50km+ from Noah who didn't hear about it\n\nThey should have picked up their phones",
            "It was an over exaggeration and then you came along and were like “iT dIdNt kIlL eVeRyOnE” okay yea you’re right but that’s not the point",
            "Sure, because 2 lines can be too out of context like one like. But don't worry, they always are open to have a talk.",
            "You mean people dare to interpret differently a line which calls for violence in a totally counter-intuitive way said by someone who's known for non-violence but compassion and also for his metaphorical puzzles when speaking about how we should behave? Wow, all these Christians am I right",
            "Almost like theogony is a complicated subject",
            "Yeah as a christian I find that funny myself. They put Trump above God. This is literally idolatry.",
            "God also gives us the ability to experience pain, disease, loss and hardship. Regardless, you'd think an all powerful all knowing perfect being wouldn't be so insecure as to torture his creations when they use the free will he gave them.",
            "No. I mean potatoes, tomatoes, eggplants, peppers and all other nightshades are all poisonous plants. They are all poison.",
            "Not what happened",
            "Why would God include it in \"his\" holy book without explicitly stating that it's a bad thing and should be avoided at all costs?\n\nI refer you to the story of the daughters of Lot who gave wine to their father until he was drunk so they could rape him and get pregnant by him.\n\nAbsolutely unimaginable why an all-powerful being thought it necessary to degrade one of his prophets this way and tell us the story.\n\nThe mental gymnastics Christians have to perform to be able to read their Bible without throwing it out the window is crazy to me.\n\nTo quote George Bernard Shaw; \"The Bible is the most dangerous book on earth. Keep it under lock and key. Do not allow your children to have access to it.\"",
            "> including rape and incest\n\nExcept, why did Lot's grandchildren get to be kings of new cities, hmm? Why did Sodom and Gomorrah become destroyed because of \"sexual immorality\", but when Lot's daughters get their grieving father drunk and rape him, those children get to become kings?\n\nAnd let's not forget when Moses attacked the Midianites (Numbers 31). 15,000 soldiers got to divide 32,000 virgin \"women children\" as the spoils of war, a war that was fought in part because of the \"sexual immorality\" of the Midianite women, with the little girls being taken as revenge. Nothing happened to Moses or his soldiers. That's pedophilia being allowed in the bible.",
            "One god so many gods.",
            "You are unable to understand the difference between a symbol, and what it symbolises. It's like saying \"I got a ticket for driving a car\", while you were doing laps in your neighbour's garden.\n\n\nI really hope you learn how to read, so you can read the Bible. It's full of batshit crazy stuff, and most things you hear are just cleaned up versions for the children. Yahweh didn't even just kick humans off the paradise, but cursed humanity with a bunch of stuff, like menstruation and painful childbirth. Wild stuff. Highly recommended.",
            "Isn't the christian version of hell literally for what you do and say on Earth?",
            "Except Hell is actual consequences, and being “cancelled” usually just means people think you’re an asshole and don’t want to associate with you anymore. ",
            "Sounds a little forked up",
            "God gives you every opportunity to correct your ways.  He will ALWAYS forgive you.  But it is YOU that has to accept him and try to act in accordance with his laws.  He knows that no one will ever be perfect.  He doesn't expect that.  What he expects is your faith, love and effort.  It's all up to you, not him.  And for you to place blame on him when he gives everyone an instruction book and a lifetime to try and get it right is just ignorant.",
            "Our last best hope for peace.",
            "You never read the Bible, God is always punishing Israel for lots of sins, wanting onions after leaving Egypt? Death and 40 year of desert for you, even Moses was like wtf God please don't kill everyone or this religion thing won't work who the hell gonna follow a God that free them to kill them, when God got pissed and wanted to get rid of Israel for some other offense, lots of prophets saying they would suffer war and stuff because they have sinned and whatever",
            "Vegas has weed too. Amsterdam has legal hookers tho.",
            "Sure, go ahead and marvel at nuclear explosion, I mean what could go wrong.",
            "Womp womp",
            "well guess what, it was taken out of the greater context. You can see my response below.",
            ">I refer you to the story of the daughters of Lot who gave wine to their father until he was drunk so they could rape him and get pregnant by him.\n\nSo, when people try to say that the bible is contradictiory in its morality or theology, they often take certain verses out of contex, or just take what they hear from someone else as fact. This is human nature, it's something one needs to learn to overcome when studying really any text, be it a religious text or not, so this is not necessarily a criticism of your comment.\n\nIn this story, yes, what the daughters of Lot did was not in accordance with God's law. If you read the story, you can hear the daughters justifying their actions by saying (forgive my bad translation from my native language to english): \"And then Lot came out of Segor and lived on that mountain, and both of his daughters with him, because they feared to live in Segor. And he lived with both his daughters in a cave. And one daughter said to another: Our father is already old, and \\*there is not a man on earth, that is around here to give us children\\* as is the custom all over the earth. Let's get our father drunk with wine, so that we may keep his seed.\n\nAs you can see, this was not God commanding the daughters to have intercourse with their father, it was their own free will. That doesn't mean it's good. When you murder someone because you think you're doing good to the world, that doesn't mean that that action is good.\n\n>Absolutely unimaginable why an all-powerful being thought it necessary to degrade one of his prophets this way and tell us the story.\n\nNot sure what prophets you're talking about\n\n>The mental gymnastics Christians have to perform to be able to read their Bible without throwing it out the window is crazy to me.\n\nYes, religion and philosophy alike are not easy subjects. You need to study it carefully for its meaning to be really revealed to you. Priests spend years of their life studying the Bible.\n\n>To quote George Bernard Shaw; \"The Bible is the most dangerous book on earth. Keep it under lock and key. Do not allow your children to have access to it.\"\n\nA guy saying that something is bad because he doesn't like it doesnt disprove whether it's true or not. The argument most atheists use is basically \"god cant be real because he's mean\", well guess what, it's a non-argument.",
            ">Except, why did Lot's grandchildren get to be kings of new cities, hmm? Why did Sodom and Gomorrah become destroyed because of \"sexual immorality\", but when Lot's daughters get their grieving father drunk and rape him, those children get to become kings?\n\nSo you say that being a king is somehow magically a \"good\" thing, like, why is that a good thing on your world view? And even if thats somehow \"good\" or you see it as a \"reward\", you would have to take into account that there aren't that many kings/leaders in history that were good in God's sight. King solomon in the old testament was at first wise and good, but then sexual sin got to him and he became wicked. If God had to condemn anyone for anything bad they do in their life, he would have to do another flood, but he speciffically said he won't do that anymore.\n\n>And let's not forget when Moses attacked the Midianites (Numbers 31). 15,000 soldiers got to divide 32,000 virgin \"women children\" as the spoils of war, a war that was fought in part because of the \"sexual immorality\" of the Midianite women, with the little girls being taken as revenge. Nothing happened to Moses or his soldiers. That's pedophilia being allowed in the bible.\n\nok i dont remember entire numbers right now, but yeah bad things happen in wars, and in wars people go haywire. In the crusades the crusaders raped women even though they said they are faithful to the covenant. That doesnt mean that any of that was okay. Noone in christianity argues that pedophilia is something good. But that assumes that that even happened in numbers 31, which I can't take an atheist's word for and honestly am getting tired.",
            "not sure what that's supposed to mean",
            "Holy shit…I can’t believing you’re embarrassing yourself like this…all because you tried to sound smart, failed, and don’t want to admit you’re wrong. Doubling down like this is hilarious. “The symbol and what it represents” lol. The apple was taken from the tree of knowledge….eating the apple was what caused this, and you describing what happened in more words, obviously doesn’t mean it wasn’t “because of an apple”…like, it’s not just that you’re wrong, it’s that you’re so wrong and separated from reality that you’re incoherent. \n\nI can’t believe I’m even taking the time to address this, but the driving a car in the garden analogy doesn’t make sense. Consuming the apple *is* the crime. Hence the previous comment, where you’re correcting someone saying you stole a car, by explaining where you stole it from…\n\nBuddy, there is no getting out of this. You need to learn to admit when you’re wrong. Trying to do these mental gymnastics just embarrasses you further.",
            "Like the ultimate cancel.",
            "do, say and think.",
            "Most denominations state that all humans are destined for hell based on the original sin, so theoretically someone who has never committed a sin personally is still going to hell due their inheritance from Adam.  \n\nIf you don’t have jesus in your corner, you’re burning in hell eternally according to Catholicism and most Protestant branches!",
            " I grew up being told hell is your worst sin or your greatest fear.... on repeat . Think being bitten by a black mamba again and again. I don't even want to think about it. As an adult I now have friends from various religions and their version of hell is no better. I'm good",
            "Oh no don’t send me to the strip club with a massive amount of blow for all of eternity noooooooooo",
            "It failed.",
            "I have read the Holy Bible and I know that. Thats why I said accoring to their scriptures. I have not read the Torah but have heard them say this.",
            "“Chosen people” is a direct quote from modern translations in the Bible, as in the context of the Israelites god saying to them multiple times throughout the book of Exodus “you are my chosen people”. Not only that, shortly after their god says to them that they will be persecuted by every nation for being his followers. It’s amazing how confidently you state they’ve never read the Bible when they are actually 100% correct and you barely have a clue what you’re talking about.",
            "If you just say Nevada you capture all those things as well.",
            "Turning into salt is fairly unlikely",
            "One god supposedly one word but many factions",
            "The Roman cancel.",
            "Oh. Oh  no.",
            "Yeah, there are many people who through their pride and ignorance will make new factions, denominations and sects, but in the end there is going to be only one true church, as per the words of Jesus himself. I believe this to be the eastern orthodox church, because that's where my research on this topic led me.",
            "The Roman cancel puts you back to neutral though, so that's more gracious than most",
            "I think it’s all made up years after Jesus died. It wasn’t even transcribed at time he was around",
            "LOL “I grant you free will… just kidding! SIKE!”",
            "Well you're right, what he taught was recorded by the apostles possibly years after he died. That doesn't mean it's made up."
        ]
    },
    "Sooo… nonbinary people are also more like God? Because God is also technically nonbinary, having made man AND woman in God’s image… 🧐": {
        "title": "Sooo… nonbinary people are also more like God? Because God is also technically nonbinary, having made man AND woman in God’s image… 🧐",
        "score": 3610,
        "url": "https://i.redd.it/2jurnp0kp08d1.jpeg",
        "content": "",
        "num_comments": 266,
        "comments": [
            "The reason demons in the bible use those pronouns is because they are 'many speaking as one'.  They will refer to themselves as 'Legion', a collective name.  Remember those pronouns were assigned by the translators from the original Greek, which has uses plural pronouns there.\n\nIt is so hilarious when these fundies try to make a point based on the Bible's EXACT wording when it is all a translation of a translation .  I actually had someone tell me Jesus had to be American because he spoke English in the Bible!",
            "Do these dumb motherfuckers not know what \"plural\" is?",
            "Or you know… the original Old Testament was written in Ancient Hebrew and none of these pronoun debates make any fucking sense because y’all are talking about one of many different english translations…",
            "You'd think religious people would stop trying to use the bible against things by now.  Some of us know it better than they do.",
            "Almost like the English text here is a translation.\n\nAnd the pronouns used here are pluralis majestatis.\n\nI have no dog in this fight but could we stick to FACTS?",
            "Um, the only demon that does that is legion. Not because they were non-binary, but because they were literally a bunch of ‘em at once",
            "I’m not versed in the bible, but didn’t God created Adam in his image and he just created Eve from Adam? Never specifying he actually created Eve in his own image?",
            "r/religiousfruitcake would like this",
            "To me quoting the Bible is like quoting “Green Eggs And Ham”.",
            "God is also the devil. Everything God makes and plans is right and intentional, so he planned for the devil making evil arbitrary.",
            "There is such a thing as “royal we”",
            "Why is “THEY” capitalized? It’s referring to mankind, not God and the angels. Common comeback L.",
            "In Judaism, it's believed (although not widely taught) that God actually has a dual nature, male and female. When they use the word Shechina to refer to God (as opposed to Jehovah), that's supposedly the female side. I'm not exactly sure, I was probably rolling my eyes too hard to pay much attention in class that day.",
            "Trans people discover words used to describe a group of individuals, colorized 2024.",
            "Wouldn't that actually make God superbinary?",
            "And the one demon that did refer to themselves as that was legion, it was like 6 billion demons inside of  one dude.\n\nReminds me of this one meme with spiderman and venom and venom is like \"for the last time, our pronouns are they/them, not because we are non binary but because we are literally 2 beings\"",
            "Are you sure? Old Testament is written in Hebrew and Aramaic not English",
            "I love how we literally still don’t know the full intricacies of our own physical body, yet we claim that we know the nature and will of supernatural beings, even of God. What was said about vanity?",
            "Really? I was raised Catholic, and I remember that only Adam was created in God's image and the only reason behind Eve's existence was to give him a partner.",
            "The \"us\" could be a consistancy with that other biblical scripture where this god went up to see the other gods. The bible contains at least 3 gods in it.",
            "LoL no",
            "The Bible doesn’t matter. \n\nBut it matters to you… which makes me wonder, why are you so bad at it?",
            "We are not amused /s",
            "Halloween be THY name. It's as simple as that.",
            "And on top of this, even though god is always referred to by he/him pronouns in the Bible, he was an acceptable gender neutral pronoun until the early 1400’s",
            "Jon binary people are demons.\nWasn’t that their point?",
            "It's just wishful thinking by the activists",
            "This \"God\" appears to be talking in the collective or third person. Therefore, it seems clear to me that it is either multiple beings or The Rock.",
            "If nonbinary people still eat,sleep,sick,dead,since they were born then not god..",
            "So do several people",
            "Diphallic people: \"Am I...god?\" 😧",
            "People like you make me want to rip my hair out",
            "Id say stfu",
            "Id say stfu",
            "According to movies, demons don't use their names because it can be used against them. They possess bodies, so it's pointless to give a specific gender",
            "see even the bible warns the xyz+ is a result of mental illusion, these people are sick.",
            "It all makes sense now",
            "“I want to be special”",
            "The we when referring to Gpd was because Father, Son and Holy Spirit were pre-existent, there at creation.",
            "Or maybe read some bloody bible scholarship and you'd realize that the biblical god was originally part of a Pantheon and eventually the canaanite tribe that became israel made the god of metallurgy Yahweh, the god of storms Baal and the high god El into one entity.",
            "Can't speak for everyone, but I'm fine with being a little they/them demon >:)",
            "Can you really believe _Karen_ of all people were made in God's image though?",
            "Nonbinary people are indeed like God....",
            "As a non religious, it isn’t that stupid to believe that god was non binary.\n\nThough, did god have both genitalias?\nOr did he have none…",
            "It's called the trinity, three persons of one essence. Let us is God the father speaking to the other persons of the trinity",
            "Yeah because this book was written in english. This is totally not a translation from another very old language.",
            "I don't underand how this post is still up and with 2k+ upvotes. This is not clever at all? They/them is also used for plural. And in the text quoted it's clearly plural and not singular pronoun.",
            "Glad to be a demon then 💅🏻",
            "Binary literaly means that there is only 0 and 1. Only two states, so i would interpret god is 0 and 1 at the same time which would make him not nonbinary. \n\nI am not saying its not a complete braindead take in the picture, just the comebacks not that clever.",
            "Both the comment and rebuttal miss the point. There tends to be many demons possessing one person, and there were many Gods in the Bible. God is talking with other deities in Genesis.",
            "They have the attitude of god if you believe the media in their power struggle to total domination.",
            "Never met a non-bi that's better than me at guitar. Pffft gods?",
            "The bible was not written in English.",
            "So do the apostles.",
            "God lives in everyone confirmed",
            "In the bible god made man in his image and woman in mans image, however a lot of metaphors could be fit into this statement alone.",
            "Demons are plural, so they and we are grammatically correct.",
            "Let's get to the basics, god doesn't exists.",
            "I fucking hate it when people try to use the bible (incorrectly) to hate on others when the bibles teachings are to love everyone equally no matter the differences",
            "I always thought because God is Father, Son and the Holy Spirit, thus the plural?",
            "Alternative interpretation, to become they/them is to transcend being human, you become like demons and gods. And the last time we allegedly did that, God cracked the shits for building too big and made us speak many different languages.",
            "Now convince the muslims that Definitely will kill you😁",
            "My weekly reminder most Christians don’t know how to read the Bible and are spoon-fed straight up lies in their churches.",
            "There are so many queer themes in the Christian bible that US conservatives like to ignore",
            "I don't know.. In spanish God is reffered as a Him and only as a They when they are the Holy trinity. As god made first Adam and then he created eva from the base he had who was Adam. But the only way to truly know it's looking for the original source",
            "Using the bible to support an argument, LOL. The assumption is that I (or everyone) follow the same religion? If this criterion is not fulfilled then everything else does not apply. And they know it was written by humans right? (Welp, probably not)",
            "Hey, how come God talks about itself as \"the king of the gods\" or the mightiest lord in Genesis? Really implies that there are other deities to choose from, can I hear what they're offering? And how come the army that sacrificed a child to Chemosh, who is a demon, beat the army that sacrificed a goat to God? What does that mean? God demands child flesh for its power to be bestowed? That's fucked up.",
            "Just give up on the god myth. Every religion is debunked by science.",
            "One of the Buddhist Sutras tells the story of a trans boy. They are the hero of the story, after they die they get rewarded with a male body and then go on to lecture some monks.\n\nThe Buddha said that to become enlightened you need to be beyond gender, basically nonbinary. \n\nThere is not prohibition in Buddhism to premarital sex, or being LGBT. Unfortunately, celibate monks do a poor job of letting people know what the Buddha taught about sex for ley people.",
            "This is not true at all. The Christian Bible has 2 gods, a masculine and feminine god. \n\nIn the quote in the image god is talking to someone, let us make them in our image. Implying a second god.",
            "Wish you troons would've stayed happy with your pathetic delusions alone instead of forcing all the normal people to automatically be okay with it or get \"canceled\" lmfao. You're either a man, or a woman. Born with a penis or vagina. You cannot magically switch. Stop forcing the delusion on me.",
            "Wow! To insult a God this much. Why insult this particular God though?",
            "Sigh, cant you native speakers make up a new pronoun, “they” is so counterintuitive, how do I even specify one person from a group",
            "the thing is, is that you have to use them in that grammatical scenario. \n\ni'm with lbgtq all the way but this is taking it a bit out of context.",
            "Actually, the text says \"God created *man* in his image, male and female created he them.\" So cis and trans men are in God's image, but cis and trans women are not... /j",
            "Sooo God made man in his image. Women came as an afterthought from… ribs?",
            "So these folks are demons pretending to be God?  This just keeps getting worse all the time.  Too think I  just thought it was stupid and pushy.",
            "On addendum to this;  \nIn folklore, iron is used as protection against evil spirits, and other malevolent creatures...\n\nJudges 1:19  \nThe LORD was with the men of Judah. They took possession of the hill country, but they were unable to drive the people from the plains, because they had chariots fitted with iron.",
            "The whole concept of God are beyond what being is, so concept of pronouns are just how representation read by human language \n\nMany languages in the world do not have gender specific pronoun, \n\nWhat pronouns you use to refer Sun, Sky, Moon? Same concept, you don’t use gender specific pronouns, for such thing, \n\nThe whole and confusion because human interpretation, it was human limitations to understand.",
            "Nah God is gender fluid",
            "Pretty sure hardcore Christians don't believe woman was made in god's image but rather from man's rib.",
            "Fascinating, when an atheist does some good for others they don't feel anything?  So why do so many people who give large donations have their names attached to buildings and such? \n     When I give it's not because I'm supposed to.  It's because someone gave His all for me that I can never repay in a million years.  It's the least I can do which in the scheme of things isn't much.  But you wouldn't understand you'd have to be a believer.",
            "God is constantly referred to as He or Him. He has the title LORD God, which would make him male. Not to mention that Jesus is the Son of the Holy Trinity. \n\nAdam was made in God’s image, and Eve made from Adam’s rib as an equal partner.",
            "Yes, the girl in my class who didn't get enough attention from her father because she was raised by a single mom is just like god",
            "All this blasphemy",
            "[deleted]",
            "A common misconception. The literal translation for demons is the ‘Us’ as in ‘legion.’ For God, it is the royal ‘Us/We.’ I’m not sure if it’s common anywhere with kings and such these days, but until a few centuries ago, most royalty referred to themselves in the plural. I’m sure there’s some etymological reasoning behind that, but I’m too lazy to look it up.\n\nSo unless those identifying as non binary and such are referring to themselves as royalty (and by default all those they are speaking with as inferior) this doesn’t really make sense. I’m all for supporting everything Pride related, but at this point I hear infinitely more about shitting on religion and the religious in any given day than I hear the religious being assholes.",
            "Both sides are retarded",
            "Yes, people who want others to call them \"they\" are often narcissists with some kind of superiority or \"god complex\".\n\nEntirely correct.",
            "It makes you wonder how many adults have an actual child's mentality. Like I don't mean childish, I mean their worldview stopped developing at 8",
            "It is a solid point. Jesus must have been a white American. He turned water into gatorade, multiplied filet-o-fish and cheesburgers for the hungry and rode his mobility scooter over water.",
            "They never actually think this stuff all the way through for themselves.",
            "My favorite thing about the translations is that a lot of chuds hate the niv bible because they made a bunch of changes. But it actually didnt, it justs more faithfully translated the bible, the king james bible is full of translation errors.",
            "But... english didn't even originate in America so that logic doesnt even follow.",
            ">Jesus had to be American because he spoke English in the Bible!\n\nWeird.. I'm positive he is from China cause in new Chinese edition bible, Jesus speaks Chinese.",
            "Bro, it’s Jesus of Nazareth, not Jesus of New Jersey…",
            "The reason Elohim refers to We is thought to be a vestige of the Divine Council. When he ruled over a group of deities as the supreme one. \n\nhttps://youtu.be/iwogSOxj-l4?si=FbuxJ-0MUQ40rqfY\n\nhttps://en.wikipedia.org/wiki/Divine_Council?wprov=sfla1",
            "My name is legion, for we are many -Mark 5:9",
            "The amount that the English-speaking thing does not surprise me disturbs me.",
            "I just read the \"We are legion,\" bit the other day. I hadn't realized that's where Anonymous got it from.",
            "I think that demon hivemind was singular, we don’t see many instances of low tier demons but I don’t think all of them are like a hivemind",
            "I wonder how much better society could be if those people instead of mandatory Bible study actually got some extra proper education which they apparently would've needed",
            "Yeah, and the greek version was just a translation from hebrew bible in a time famous for very accurate translations. Hebrew -> Greek -> Latin -> English, google translate any sentence like that and it will fuck it up, and that's before getting 2000 years of changing cultural circumstances, an incredibly powerful doctrinal organization that decided what parts were true and tens thousands of people with their own agendas got involved. Fuck, a single monk being lazy and skipping a chapter while copying could have consequences if it happened early on.",
            "I was gonna say, let’s go back to the original Aramaic and Greek and see what’s going on before anyone starts making calls based on semantics.",
            "If you know how much Helenism was imported into the NT, you know there's barely any room for left for the Judaism it's allegedly founded on. It was white-washed LOOOOONG before it was translated into English.",
            "So... demons in the Bible were hard-core communists? Damn the capitalism vs communism game's been going on far longer than we expected. \n\n(I'm joking don't hate speech me)",
            "That’s only one example",
            "That's actually impressively stupid, I would wonder if they were being satirical and I had missed the joke",
            "I talked to a Jehovah’s Witness recently. He was talking about how Jehovah/YHWH is the true name of god. I asked him about the names Elohim and El Shaddai, and he politely indicated he had no idea about those, but would look into it.\n\nHe’s trying to convert me, I’m trying to deconvert him, fair play",
            "Worth noting Legion happened exactly one time and was shown for the explicit purpose of showing that Jesus was stronger than even an army of demons.\n\nGod speaks with a \"We\" in all translations, and the generally accepted intent is that God is all-encompassing (within this canon) and thus it is more of a \"royal we\"",
            "Only when they want to mock someone using they/them with \"lol are you several people then\".\n\nThere is no consistency. Only hatred.",
            "And those stories were just written corruptions of Sumerian tales.",
            "As an ex church boy I like quoting the bible they clearly never read. Much like the Constitution.",
            "I don't thing they're religious, just trying to use the name of the God for their side",
            "They’d have to read it first",
            "I am from a mostly irreligious country, and when we had a theology lesson in a university course (guest speaker) I asked him aboit the passages in exodus specifically pertaining to slavery after he claimed the bible is most foundational to modern western morality. I found that it is actually the contrast and departure of many of the bibles suppositions that form the basis of modern western morality. You have to limit yourself, though. You don't want to be the um ackshually-guy",
            "Ahem... \n\n\nLeviticus 25:44\n\n\nI have said that like 50 times in the past 5 days",
            "He created them both in his image. Through people wonder what it means, many belief that it means that God gave them dominion over creation, as He has dominion over creation. The ability to create, as he is a creator, a mind and a spirit, as He is.\nIn that sense they are both in God's image.",
            "He made a Man in his image After a while he made a woman to be the man's companion",
            "You are half-correct! God creted man and woman and his image Genesis 1:27:\n\n>So God created mankind in his own image,  \nin the image of God he created them;  \nmale and female he created them.\n\nHe then \\*re\\*created the woman known as Eve from Adam in Genesis 2:22:\n\n>Then the Lord God made a woman from the rib he had taken out of the man, and he brought her to the man.\n\nGenesis 1:27 uses \"נקבה\" (heb. female) while Genesis 2:22 uses \"אִשָּׁ֔ה\" (heb. wife). Interestingly the word Eve (חַוָּה) doesn't show up until Genesis 3:20 (after eating the fruit).\n\nThis double creation problem caused certain kabalistic schools of judaism to develop a belief that God actually created two women. The first of them is referred to as Lilith and is sometimes considered to be the mother of demons or the 'whore of Babylon' which is to come at the Apocalypse.",
            "This should be higher up. Trans people would be a part of God's plan if he was real.",
            "From my understanding,all actions have consequences. By giving us free will, it would also result in the creation of sin. As a result, there is evil. As to why God decided gave us free will, I do not know.",
            "There is two gods. Reread the quote.",
            "There are two rather different creation stories in the bible. One is the tale of Adam and Eve in the garden of Eden. The other is the creation of the world in seven days. In the creation of the world story you get the exact verse quoted in the OP.\n\nSo yes, really.",
            "It si prety obvius, that an entity with severe bypolar diorder would admit to having difren, but simlar personalities.",
            "??? Erm, no? There is only one God in Bible, but has 3 forms and this is called the holy Trinity: the Son, the Father and the Holy Spirit. Even if God has three forms, They remain as one entity. You know, like a bottle of male shampoo: 3 in 1",
            "Like the sassy god who throws a hissy fit and kills everyone when he doesn't get his way ?",
            "Same in English. God is mainly referred as a He. It is his preferred pronoun if you like to say it that way.\nMany believe that when he said We, he talked about the Holy Trinity and thus this is used as evidence of the Holy Trinity by many.",
            "The other kings and lords being referred to are of men, not divinity. \n\nAnd where does the Christian God demand the sacrifice of a child to bestow his power ?",
            "Ok ❄️, why are you so concerned about strangers penis’ and vaginas?? Have another Bud Light precious.",
            "How fragile are you to have delusional thoughts forced on you???  How has your life been affected by others thoughts?",
            "Idk, hard to ask the people who wrote the bible, as they're long dead now",
            "They is also singular. Look it up if you don’t believe me.",
            "Search up Neopronouns :) some people also use them",
            "What would you say when someone tells you how their friend graduated \"congrats to _____\"?",
            "It's probably best understood with an example. Recently in my IT job I had got a ticket over email from a client with a name that could've been male or female so I had to write my resolution like this -\n\n\"The client had an issue accessing their VPN. I asked them could they restart their laptop. They said they had already done that. I advised them I would sent them a new code. They received the code and tested it and confirmed it was now working.\"\n\nPeople use the singular they/them all the time when they (hey! I just used it!) don't know the identity of the person and don't want to assume. For instance, \"Whoever owns the green Ford Mondeo parked in front of the door we would like to ask them could they move it please?\"",
            "Same applies to demons who are said to be 'many talking as one'. If the bigots can take things out of context to justify their hate, I don't see a problem with replying to them like this.",
            "How are we supposed to know what your imaginary friends are like or how they compare to your (likely fictional) classmates?",
            "Well u clearly ain't nothing like God",
            "Even worse, god didn't have a mom or a father. It created itself.\nI don't think you want to go on with this argument.\n\nDo you know what else can create life alone? Banana trees. They just spread out from the same genderless parent tree.\nSo god would be a selfsexual genderless being or like those people who are born imbetween both genders?",
            "I just want to reply to this to so I can be notified of the incoming clever comebacks you’re about to receive 😂",
            "That he’s also referred to as “we” and that OP has a weak argument",
            "The singular they has been a pretty well established aspect of the English language for several hundred years. Nothing to do with royalty or superiority. Granted, the singular they traditionally is used when you don’t know someone’s gender rather than being a person’s specific preference. \n\nWhen I first had this conversation with my dad, he said “just because someone says they want to be called something else, doesn’t mean I HAVE to call them that” I had to pause and help him break down that sentence. \n\n“Just because someone (singular) says that they (singular) want to be called something else, doesn’t mean I have to call them (singular) that”\n\nWe use the singular they all the time without even thinking about it, it’s just in a slightly different context. The principal is the same though",
            "This is, honestly, most people. Every political, religious, and otherwise persuasion.\n\nThe average person in the US has not *ever* read a book they were not assigned to read.",
            "That's offensive to 8 year olds. They are generally curious and want to learn new things. These people are the opposite of that. They revel in their immaturity and ignorance.",
            "Only 10-15% of people ever progress into the final two stages of the development of moral reasoning, which is where someone is capable of coming to their own moral and ethical conclusions based on universal ethical principals as well as empathy and understanding for the personhood of others, as opposed to the previous stage where your morality is taught to you via social rules, traditions and the rule of law/authority. So yeah roughly 85-90% of people 👍",
            "That would be anyone that disagrees with my exact views, which is >99% of people. \n\nIm right and everyone else is wrong, and if you disagree, youre a smelly poopoo head.",
            "I visited a town in TN where the county had an average of an 8th grade education. I kid you not, someone told me off because of my “edjamacation.”",
            "I know everyone has to stop pretending they’re something that they’re not",
            "It gets better if you tell em the KJV was commissioned so the church officials would leave James alone to consort with his boyfriend, George Villiers.",
            "Logic is a foreign concept to them.  As in \"It's somethin those darn foreigners use to confuse us!\".",
            "Well... I mean his brother was Chinese at least.",
            "Korean Jesus has entered the chat",
            "I though it was because of the theory that early judaism has a pair of gods, Yahweh and his spouse Asherah, that's why the We.",
            "Or\n\nThe royal we\n\nFor the king James bible",
            "It’s like how a lich is many souls together forming one main personality while the souls that make up the lich technically are still separate beings.",
            "Yet they forget that “you” is plural as well. In fact, singular “they” predates singular “you” in English.",
            "Ok, that's a bit too much.  \nNot corruption, just retellings, cultural influences (they were literally conquered by the Babylonians).    \n\nI wouldn't claim the Japanese Princess Kaguya as \"written corruptions\" of the Chinese Chang'e.  \n\nFor a more contemporary example, claiming the Lord of the Rings to be \"written corruptions of Germanic and Celtic mythology\" would be insane.",
            "Ouch! Good one",
            "You just described religion.",
            "This one was a civil law, not a divine law",
            "\"Your male and female slaves are to come from the nations around you; from them you may buy slaves. You may also buy some of the temporary residents living among you and members of their clans born in your country, and they will become your property\" \n\ni think google is giving me the wrong quote becaue this doesn't make sense in the context.",
            "If not he will be playing The Sims",
            "I don't understand your comment. Are you saying that the two stories are contradicting?",
            "\n\nInterestingly, various biblical stories are ripoffs of other stories that contained multipal gods (such as Gilgamesh's Flood aka Noahs arc) the whole religion is fake. So therefore the god is fake too.",
            "What was that? \n\nPsalms 86:8\n\n'Among the gods there is none like unto thee' - there are many gods, but Yahweh is the most important one for Israelits.\n\nPsalm 82:1-2,6\n\nGod standeth in the congregation of the mighty; he judgeth among the gods. 2 How long will ye judge unjustly, and accept the persons of the wicked? Selah.\n\n6 I have said, Ye are gods; and all of you are children of the most High.\n\nIn Psalm 82 gods(elohim) meet. There's a divine council. I think it says it all.",
            "Be gay do crime✨️",
            "I like the part about the rainbow symbolizing God's promise to not kill everyone in the world because of their sin anymore, and the pride movement using the same symbol.",
            "I know you're angry with my opinion, I have no qualms with you. I will pray for you, I hope God lights the way for you in the end",
            "It affects my job, where we've hired multiple troons for the \"inclusion\" but really the troons threw a big enough fit to get special treatment i.e being picked first to be hired over anyone else due to his identity. I see troons and gays kissing in a lot of shows and movies now that could have absolutely went without it i.e star wars \"space lesbians\". I see openly gay pastors, troon pastors, and many other openly sacrilegious \"people\" show up on TV talking about the Bible in a way that perverts it. I am tired of seeing the troon pandering everywhere I look. Corporations and Governments everywhere are pandering to you CONSTANTLY. Troon day of recognition or whatever overshadowed fucking D-Day on almost all social platforms because of Biden and the troon squadron. There's no changing my mind. I will pray for every one of you. I hope that God finds His way into your lives and guides you to become the person you're meant to be.",
            "Lol. If you read the Bible they, the writers  didn't insult God but apparently people that are alive now know God deserves these insults. Apparently, they really understand who they are and how this world came to be.",
            "I believe you, but how does that make anything more convenient",
            "Nice, much more understandable then they",
            "Well, you really missed it.",
            "God does not use double negatives.",
            ">So god would be a selfsexual genderless being or like those people who are born imbetween both genders?\n\nno...  god would be a banana tree.  duh.",
            "All hail the herb father.",
            "Really? Not even just for fun?",
            "My sister is like this.  Has never read. No books in her home.    Although recently she says she has really started to read the Bible and has a deep understanding of it.   \n\nI’m thinking Dr Seuss books are probably beyond you, but sure, assume you have the reading comprehension to master one of the world’s most complex, historical and debated books in all history.  \n\nThen she tells me and mom all the things we should be doing in our lives, based on what she has read.",
            "Christians are incapable of morality because all of their actions are coherced via the threat of eternal damnation. Its the shopping cart dilema, the point is \"what would you do if there were no consequences to not returning the shopping cart\". Well an atheist doesn't fear eternal damnation, they dont belive in those consequences, so when they feed the poor and hungry, its purely of their own good.",
            "Even the Bible reports that the Jews had never truly been faithful to their God, Yahweh (and that's just the translation of the tetragram YHWH, the Jews will read it Adonai which means Lord). In the Bible, God punishes the Israelites for their idolatry, Asherah, Chemosh, and others. If you read the Bible you clearly see that God wouldn't want to be worship with association with any other. But they would always add a partner to Him + do things that He specifically told them not to do",
            "From my understanding, Asherah was El's wife in the divine council. YHWH was their child given rule over Israel. YHWH was also a storm diety in contest with Baal for influence. Hence the constant issues with Israelites worshipping Baal.",
            "Honestly true",
            "What abt numbers 31:17",
            "No, this is the quote, literally directly encouraging slavery",
            "That is the correct quote, directly encouraging slavery",
            "If God creates man*kind* in his image such that *they* may have stewardship over the creatures of the land and sea, etc., then how can there only be *one* man made in God's own image, and then God decides to make him a friend so he's not lonely?\n\nGod would have made *a* man to have stewardship over the creatures of the land and sea etc..\n\nAlso, iirc (been ages since I looked at genesis, and it was for a *very* different discussion) God makes Adam in his own image basically just because. And iirc his freedom was essentially restricted to the garden of Eden. How can he be steward over all the creatures of earth a) alone, and b) if he's only allowed in the garden?\n\nThe bible is *full* of contradictions, friend. And those contradictions start in genesis.",
            "Not angry at all, a little amused actually.  You never said how your life was affected. Why are you concerned with other people’s penis’ and vaginas? Are you embarrassed to answer?",
            "But how were you affected?  When you see these many people on TV why do you not change the channel? Or shut the Tv off?",
            "It’s just as likely that we exist inside a universal unicorn’s fart as it is the Abrahamic god created us.",
            "It's just stories for children bud. \nWatch this.\nUnicorns are pricks.",
            "I've read the bible, that's how I know it's a bunch of malarkey. It's just a tool for bad people to take advantage of the gullible.",
            "1 Corinthians 15:10 “God's 'grace to me was not without effect'\"",
            "Doesn't he ?\nHow would you know ?",
            "That sounds like a fun deity to follow.",
            "Correct. The split is generally 0 or 1 vs \"many\" - 12+ books per year.\n\n46% of *respondents* to surveys read no books ever. Imagine the non-respondents, a majority of the population.",
            "Not so fun fact: 21% of US adults (18+) are illiterate.",
            "My family are readers. My girlfriend reads, got it from her mom. Other than that, I'm in my 30s and I don't know anyone that just reads as a pastime. Some of my friends read comics but never prose fiction.",
            "In Christianity tou don't do good because you're scared of going to hell. The Bible says you should do good because you love God and you want to do what he wants you to not because you're scared of eternal damnation. Any Christian doing good things 100% purely because of their fear Hell is not a true Christian.",
            "So is just semitic mesopotamian mythos, right?",
            "I learned this in church. I don't remember the part of the Bible that talks about that, unfortunately",
            "Context is key. Whether or not you agree with it.\nIt talks about the sin in Peor. The people of Israel were traversing through the Jordan and one rule was given to them.\nDo not mix with the nation over there. Because God planned to destroy those nations beforehand (for context, he gave 400 years, the time of slavery of the Israelites in Egypt so that they could repent from their ways, they had a lot of human sacrifices which God hates).\nBut Balaam, a prophet, was called by Balak king of Moab to curse the people of Israel. Israel was passing through the land of the Moabites. They asked for passage and they refused, attacked them twice, and twice were defeated by the Israelites. Then Balak, was like: those people are too strong, we should curse them. They couldn't. \nBalaam then planned the incident in Peor. Were many Israel were killed due to their idolatry. That passage refers to the time when the Israel came back from the war against Balak and brought black the people mentioned. But it was a war of Vengeance, because of the death of the Israel a few chapters prior. Thus Moise was angry when they didn't bring utter destruction to the land of Moab.",
            "Yeah, never cared much about religion anyway. I'm not even baptized, just went to Catholic school because it was the same one my father attended as a child and it was cheaper due to that.",
            "Actually I did reply and tell you how it has affected me. I am concerned that my children are going to be forced to learn false narratives about gender within the public school system, so I need to worry about whether my kid's principal was brainwashed into chopping his penis off due to mental illness. That is why I'm concerned with the penis and vagina of a stranger.",
            "Are you blind to the precedent these shows are setting? The example I used, Star Wars, has been tainted. What's next? Star Trek? Marvel? DC? The list could be endless. All the shows and movies and books I read as a kid are being tainted with the mental illnesses of people that can't tell who or what they are. It's deeply unsettling. And of all the examples of how this affects me, you chose the Television problem. Didn't address a single other thing. Funny.",
            "Did you know that Paul the Apostle (the writer of 1 Coronthins) isn't god?\n\nThey are not the same person, hope that clears things up.",
            "because I used a double negative, and I'm not no god.",
            "Reading books doesnt make you automatically smarter, It greatly depends on the books you are reading and the information you gather from them.",
            "“Apes don’t read *philosophy!*”\n\n“Yes they do, Otto, they just don’t understand it.”",
            "Who goes to heaven? Do \"true Christians\" who believe Jesus is God go to hell if they're motivated solely by fear of it?",
            "I think Dave farina describes it best\n\nThe bible was written by, \"ancient ignorant men\"\nThe people who wrote it transferred their prejudice into it",
            "There's a debate between Alex O'Connor and Dinesh D'Souza, where they discuss stuff like this.\n\nGranted, Dinesh has one of the worst performances in a debate I have ever seen, but still it's worth a watch",
            "Fair shout :P",
            "So you haven’t been affected yet but you might be? Wasn’t bud light canceled?",
            "You’re right, forget about the tv that you mentioned.  What is one book that you read that is now tainted?",
            "How were you affected? Like, what are the effects that you experience?",
            "The Bible is the word of God no? The humans authors are divinely inspired no? Or did your strip mall church not teach you that?",
            "No, but it helps you broaden your worldview. It also encourages empathy.",
            "Yeah but do you know any idiots that would say something stupid like Jesus was American and that also read books… I sure don’t…. Like it practically doesn’t exist",
            "Reading books literally makes you a better person than not reading books.\n\nIt does not matter what kind of books you read, so long as those books expose you to new ideas",
            "Yes. Because the Bible says in James Chapter 2 than even demons believe that God exists but they will not be saved and the chapter essentially talks about people who claim to be followers of Jesus but their faith is insincere and compromised such as gay Christians and porn stars who claim to be followers of Jesus.\nAlso, love for Christ is the only motivation one should have as a Christian and that person must make sure they also  follow what Jesus says to get to heaven. But Claiming to be a Jesus follower but going against his word is unChristian.",
            "Not taking any side here, but every day we do things to prepare for or prevent things we *might* be affected by. \n\nThat’s very normal.",
            "You keep going back to your original question, which to me means you've run out of things to say. Have a blessed day, I will pray that God finds you soon and heals your fractured soul.",
            "As long as you don’t read, like, Mein Kampf or some manosphere garbage.",
            "You must be right, let me get a book from my list:\n\n“Zabiba and the King” by Saddam Hussein\n\nThe Little Red Book by Mao Zedong\n\n“Short Course” by Joseph Stalin\n\n“Mein Kampf” by Adolf Hitler\n\nThe Communist Manifesto by Friedrich Engels and Karl Marx",
            "Look at your social studies majors across America and Communist manifesto lovers and get back to me... They say idiotic things like \"Real Communism never killed no one\" or \"I would love to live in a Communist country\"",
            "That is simply untrue. There are plenty of well-educated, but fundamentally terrible people who misuse their knowledge (for example, all the “scholarly” justifications for racism and slavery), and also plenty of ignorant but good people. WHAT you read is just as important as whether or not you read.",
            "People use reading as a shorthand learning new things, and I feel like that results in a lot of conversations where it’s hard to tell if we’re talking about the effect or the cause. \n\nI’d argue it’s more precise to say “becoming more empathetic, seeing humanity from more angles, and learning new people’s stories makes you a better person, and reading can be one of the easiest ways to do that.”\n\nBut it’s not like there aren’t ways to read without really improving yourself (you could be a voracious reader of samey empty drivel or hateful propaganda) or that there aren’t ways to accomplish the same benefit without a book (you could be someone who regularly exposes themself to and learns about other people’s struggles in real life, or absorbs and internalizes the same stories through other media).\n\nI guess what I’m saying is that, every once in a while, you run into someone making this argument who seems to believe there’s something inherently noble about the act of turning pages and reading words, and I think that rhetoric is what people are balking at.\n\nIt’s unclear if you’re making this argument, or just using the shorthand meaning of exposing yourself to new ideas and stories, but if person A is watching something like a well-made movie that makes them examine humanity in a new way, and person B is reading a book that exists to reinforce their worst, preexisting biases, I’d draw a line in the sand saying that B doesn’t get bonus points just because their content is written and person A’s is audiovisual. ",
            "Reading books doesn’t make you a better person, there’s no moral value in reading. I think it makes you smarter and potentially a more reasoned, broad-minded person, but it absolutely does not make you a better person.",
            "meink..",
            "Demons believe believing God exists and having faith in God are 2 different things.",
            "I know you’re not taking sides but is this a normal concern?\n\nI am concerned that my children are going to be forced to learn false narratives about gender within the public school system, so I need to worry about whether my kid's principal was brainwashed into chopping his penis off due to mental illness. That is why I'm concerned with the penis and vagina of a stranger.",
            "Ok, in this specific context, the question was: How has your life been affected by others thoughts? What effects are you referring to?",
            "It only means that you have not answered.  I understand, you’re scared, I have no qualms with that.",
            "You’re arguing in bad faith.\n\nYes, there are horrible books, just like there are influencers making horrible and exploitative videos out there.\n\nAre you arguing that since not all online content is wholesome, it should be disregarded as enriching as a whole?",
            "Understanding their evil is a great way to expand your perspective and empathy. Tasting disgusting things makes you appreciate delicious food that much more.",
            "You WOULD definitely be a wiser and more empathetic person from reading those books, ESPECIALLY those books!\n\nKnowing what we now know about what these men did, it's very educational to understand the arguments they used to talk themselves and others into their murderous ideology.\n\nThe bottom one is the exception of course.",
            "I believe those terrible people are better than they'd be if they were less well read.\n\nI believe human barbarism is tied to a feeling of supremacy. Understanding others makes it more difficult to feel superior to others, in the aggregate",
            "There are exceptions to every rule.",
            "Imo, a more reasoned, broad-minded person, is a better person.",
            "> there’s no moral value in reading.\n\nI very strongly disagree with this statement.",
            "It's so weird that you doubt this.",
            "My point is most people's faith in God ends in just saying \"I believe in God\" and that's what a lot of people get wrong about Christianity. I'm sure you'll find lots of people claiming to believe in God and they constantly use swear words, have sex outside of marriage etc. Thebreal.poimt is defining what believing in God is because lots of people get it wrong. The Bible chapter I quoted ask \"what do you have to show for your faith in God? Because just saying so doesn't cut it.\" \nIt's sort of like saying you support the Boston Celtics but all the time you're at the Lakers' games and wear Lakers jerseys and everything basketball related you do is about the Lakers but you go around saying you support the Celtics.",
            "I'm arguing that not all books are good and reading books doesn't automatically make you a better person. If you read 100 softcore romance books you won't become a better or more empathic person, that's just insane!",
            "The last one is the reason for 95 million deaths by the hands of Communist regimes!",
            "Having read many books makes you feel superior because you theoretically have more knowledge",
            "Tell that to the Marxist movement that originated books that are till today used to justify millions of dead people in multiple communist countries!",
            "I’d genuinely be very interested to hear why, I’ve never heard someone make this argument before.",
            "i m sorry"
        ]
    },
    "Someone just got himself pantsed": {
        "title": "Someone just got himself pantsed",
        "score": 24127,
        "url": "https://i.redd.it/uy32fih05y7d1.jpeg",
        "content": "",
        "num_comments": 459,
        "comments": [
            "Bro hasn’t seen sundresses yet if he’s worrying about clothes sexualizing curves",
            "Pants were invented to ride horses. You dont ride? Then wear a skirt like historical men have done",
            "And high heels were invented for men. What’s his point?",
            "Woman wears pants: \"I can't control myself!\"\n\nWoman wears sundress: \"I can't control myself!\"\n\nHey, buddy boy, how about you control yourself and let the rest of the world get its shit done.",
            "PANTS SEXUALIZE MEN! PANTS SEXUALIZE WOMEN! PANTS SEXUALIZE EVERYONE! NOBODY SHOULD WEAR PANTS! LET'S EVERYONE WEAR SHIRTS N TWIRL AROUND ON GRASSS!!!💃🏻✨✨✨",
            "I’m not surprised to read this bs from someone who suggested to legalize rape on private property.",
            "Women wear different types of pants, but that's the only one he looks at.",
            "If you know Roosh, you know it's actually a lot of words for \n\n*Women in pants are much harder to rape*",
            "Women have other kinds of pants that’s just the only kind he looks at",
            "Do men not have legs and a rear end? A slight curve and even a something between their legs that's going to be highlighted?\n\nWhat's his point?",
            "It really is time to turn off the internet. Ideally we could do a virus scan for morons, racists, misogynists, phobes of all types and then reboot it but, I fear then there would only be a few 100 people on Reddit lol. I guess we just have to keep making fun of these idiots and hope that one day they go away lol - some chance but hey ho...",
            "There are super revealing skirts that literally show one’s gluteal folds and baggy pants that make you look like the strawman from the Wizard of Oz. OOP hasn’t seen a lot of pants.",
            "High heels were made for men so strap them on big boy.",
            "So mini-skirts and sundresses don’t highlight women’s bodies?\n\nRoosh is a booger-eating moron.",
            "This is shit a rapist would say.",
            "And you're telling me a guy wearing pants doesn't emphasize his legs, curves, and rear end? Because they absolutely do.",
            "\"Women shouldnt wear pants because i only wanna See sexy MALE asses\" there, fixed it",
            "My dude, you're the same guy who will also sexualize a woman in a dress or a skirt...\n\nIt makes more sense biologically for men to wear skirts anyway.... some of us have extra parts to get mashed by the seams of pants...",
            "I never understood how people can think pants are for men and skirts are for women? Dudes have something between their legs that would make wearing skirts the comfier and more logical choice. The Scottish had it right, and if anything, the rest of us are bavkwards.",
            "I don't get these so-called comebacks. They don't address any point of the post and make an unrelated nasty comment. Sure, you don't like the original comment since it's biased but that still doesn't make comeback a clever one.\n\nWith that logic you can say \"I want world peace\" and same \"no one will f**k you\" comeback can be as clever (or stupid).",
            "TIL baggy sweat pants are sexier than a short skirt.",
            "lol. the \"nobody will f me\" is really loud 🤣🤣",
            "Pants rule this guys world. Pants are peak human technology. Since pants came along, society has cease to advance in any shape or form. \n\nPANTS\n\nPANTS \n\nPANTS\n\ndoggo is hot",
            "See I have the opposite thought. I note I am female but I have often thought that men objected to women historically being in pants is because it’s harder to rape them that way. \n\nNow I in no way want to suggest every man felt this way or that every man is a rapist but I do think historically this was a sort of subconscious thing to make women more vulnerable.  \n\nWomen also wear short skirts to appear more sexy.",
            "This guy is turned on by Hillary Clinton and it makes him very, very uncomfortable.",
            "For the record until about the 1300s basically everyone wore skirts. Men women children. Everyone.",
            "Clever?",
            "I’m more of a boxers sort of guy, haven’t worn pants since I was a small kid. Single digits.",
            "Roosh is a just a pissed off upskirter whose perversions have been ruined too often by material",
            "My preference is women wearing long skirts but that doesn’t mean i dislike women wearing pants, i just think skirts are sexy. Some people are just cringe",
            "Learn some self-control, you gaslighting perv.",
            "Damn those men and their stupid, sexy, trouser-covered bums! Always flaunting their assets when honest people are trying to make a living!  \nMen in pants do not belong in the work-place! The least they could do is cover up properly.  \nIs it really that hard to wear a kilt to work?!",
            "I feel like Twitter just pays people to post brainrot for free engagement.",
            "It’s not clever comeback lol. Such a basic response.",
            "How the fuck do jeans eccentuate curves? Guy clearly has hetero bias. He'd never say they \"eccentuate male curves\" cause he's no looking for that.",
            "Haven't seen rooshv in a while. The original andrew tate",
            "Men who want to be modest should not wear pants either then.",
            "This sub should be renamed \"we took the bait\"\n\nBecause seriously, 95% of the posts in here are just ragebait and people engage with it and give those creators money.",
            "Pants also highlight men's butts. Do they sexualize men?\nI guess nobody has ever told him he has a nice butt.",
            "So, if I'm reading this correctly. He's saying pants were invented to sexualize mens' legs, curves, and asses?\n\nShit. I best be telling EVERYONE that my eyes are up here.",
            "Wouldn't pants make more sense for women, and skits for men as men have parts in-between our legs?",
            "\"clever\" comeback",
            "Pants sexualize the bussy as well.",
            "Sounds gay tbh, wouldn't that do the same thing for men? Is he looking at our butts and curves?",
            "Isnt this that lunatic from Return of kings? Adamsomething covered a piece this asshole wrote i think🤔",
            "How the fuck is Roosh still around and didn’t get bullied into retirement?",
            "So pants will highlight sexiness, and according to this guy, only men should wear pants. Wait... hmm",
            "I always thought that men wearing sports clothing, particularly the skin tight leggings during grappling football sessions and touchy feely wrestling, was low key obscenely homoerotic.\n\n Their trousers leave nothing to the imagination, and their touching each other just enhances it.\n\n Slow motion rippling of walls of flesh bouncing against one another and tumbling in high definition. Make men cover themselves with that logic - heavy kilts with thick straight trousers and petticoats, for decency\n\n/S",
            "what an absolute garbage sub\n\nso clever",
            "Pants also highlight a man’s curves. Track thighs and hockey ass for the win! And don’t get me started on gray sweat pants. \n\nDresses for everyone!",
            "How is this clever comeback? Like, I see, Roosh said very stupid things, but how saying “you got no bitches” is clever?",
            "I get that we don’t like the original tweet but like this shit ain’t clever in the slightest",
            "He wants women to walk around without pants?  Isn't that going to be more revealing than them wearing clothes?",
            "Not really a clever comeback. “You can’t get laid” as a response to something completely unrelated is not a “clever comeback”. The guy is a complete and utter moron, though. Not defending him, but this sub is “clevercomeback”, not “respondingtomoronswithbasicandpredictableinsults” (insults that are fair to hurl, to be clear).",
            "*Puts down mug*\n\nSo. It's about time that this myth of dresses being modest be revealed as just as flimsy as said dresses blowing in the wind. \n\nIf you ask me, *dresses and skirts* sexualize the wearer. \n\nTake a skirt, for example. A skirt just creates an open \"hole\" around the legs that you can imagine reaching up. \nThink of women dancing the can can or that famous picture of Marylin Monroe with an air vent blowing up her skirt. \n\nNot like pants, which preserves the shape of the human body while creating the impression that said shape has no genitalia and you can't even imagine reaching said genitalia without the garment essentially being removed.\n\nNow, a long and sweeping dress . . . yes. \n\nBecause sex is also about touching and intimacy, and what could makes someone's personal space feel more intimate than a dress that sweeps and brushes anything that comes close enough, with rippling folds that your hand can disappear right into as it envelops you. With a dress, the entire length of someone's body below the waist can give the subconscious impression of being a \"hole\" or something you can nestle/cuddle into as it wraps around part of your body. \n\nEverything can be sexual. Because sexuality is in the dirty mind of the beholder. If I see some Islamic extremist in a robe at one of those ISIS training camps on one knee with a big gun nestled near his crotch, in some part of my mind he is fucking that gun. \n\nI don't find pants sexual at all. They're just pants. But dresses, skirts, robes, I don't care if you're the pope, my mind is *going* there. \n\nTL:DR: What is modest and what is sexual is just, like, your opinion, man.",
            "Never new there were so  many men who  can’t get laid and then blame women somehow bc they have no game really pathetic and they all vote for the orange traitor",
            "This is a pretty common opinion among fundamental baptists.",
            "“Wow, I don’t even know how to reply to what you just said, so I’ll just call you an incel, because sex is the only thing of value that I understand.”",
            "That's not a clever comeback at all\n\nAnd the pitch was a fucking lob right over the plate. That's the best they could do? Damn",
            "Not clever imo and he is even right.",
            "What about the man curves you can see on trousers?\n\nI certainly can see their butt shapes, and they often highlight their package in the front. \n\nI am however a decent person and don't sexualising every man i see.",
            "Internet was invented for communication between bunkers during/after a nuclear war. He really should get off it.",
            "This guy has never worked in a professional business attire environment.",
            "Really, we are censoring “fuck” now?",
            "Stupid OOP, basic comeback.",
            "That's not even a good come back... that's completely nonsensical and based on nothing... i think people only like this one because its someone snapping back at a sexist... that's it. not the quality of the comeback...",
            "Is he an islamist? This guy is so weird.",
            "That's the opposite of a clever comeback. Just kind of a standard insult.",
            "There's nothing sexier than a woman in dungarees, if you ask me.",
            "He has got a point. My boyfriend turns into a rampant sex fiend whenever he sees me in sweat pants.",
            "Hey, that's Roosh the failed wannabe pick-up coach!",
            "....is this a backward way of admitting he finds it attractive when men wear pants? Cuz it's not shade from me cuz I came out 3 yrs ago but this is like the worst way to go about getting dick if he's interested.",
            "I'm not a follower of Roosh, but seeing what he generally talks about, I would wager that this is satire of someone else.\n\nBut he's said some stupid stuff over the years, so maybe this is a genuinely bad take.",
            "So he's against women wearing pants because all his google searches are for hot women in skinny jeans or yoga pants? And because of that women only dress like models in his world?",
            "Also he is buying the wrong pants if his pants don't fit him well and highlight his curves. I mean....I want my ass to look good in jeans too, as a man.",
            "Notice how no one says they want women to wear dresses because they allow much easier access for a man?  Dresses are much less modest in the real sense. Pants are much more of a hindrance to accessing the only part of a woman these guys care about.",
            "Wait until he finds out about high heels",
            "If he thinks skirts don’t sexualize men, then he’s definitely a virgin.\n\nI am a woman and I’m SOOOO into men in kilts.",
            "I thought it was about convenient peeing.",
            "There's an old term called \"Gird Your Loins\" as a method of \"Getting Ready\" or \"Preparing yourself.\"\n\nIt's when a man takes his tunic and turns it into short shorts for battle.\n\n[https://content.artofmanliness.com/uploads/2014/10/SOTW-Gird-Up-Your-Loins-1.jpg](https://content.artofmanliness.com/uploads/2014/10/SOTW-Gird-Up-Your-Loins-1.jpg) Manly.",
            "Pants were invented by wearing thigh highs and garters connecting them to loin clothes...",
            "The ancient Greeks thought Persans were féminine because they wore pants. As every Greek man knows, men wear skirts.",
            "I haven't heard of roosh in years. Is he still on that grift.",
            "I knew this girl that would wear a skirt over her pants for modesty. It gets cold in winter!",
            "Why the fuck does he think men used to wear hose?",
            "Bro the Romans would disagree",
            "Rush got more tail in a year than Echoplex Media the Basement-Dwelling Loser will have in a decade.\n\nThis is **not** a clever comeback.",
            "I wouldn't consider this response clever. I'd consider it typical.",
            "He has this on repeat in his head every time he sees a girl.",
            "IT´s also a lot of words for:\n\n\"People with pants make me gay\".",
            "These people want sharia law",
            "The message is stupid but the comeback is really not clever.",
            "Not a clever comeback",
            "This subreddit should be renamed \"juvenille insults against unlikeable people\"",
            "Another problem here is assuming anyone cares about what he calls \"modesty\"\n\nFor most women if it makes men like him not interested in them, it's doing them good.",
            "Tbh even if they were made only for men wich they might not be giving things that can have other use those uses even if it goes outside it's purpose it's something that's alright to do and probably something everyone does a lot and no one complains.",
            "This is the kind of thinking that puts women in burkas.",
            "That dude is literally famous for his ability to pick up women. Not that I agree with the statement he's putting out there but that's how he developed a following online. He fucks. A lot.",
            "Is he saying that pants make men look sexy and are highlighting a mens legs, curves and rear ends and are immodest to wear?",
            "wtf is wrong with these people? All no fap, incel nutjobs",
            "If they highlights legs, curves and rear end; why does he say they’re only for men? Thats a lot of words for “i want to only see men’s lower body”",
            "He is technically right because it was a taboo for women to wear pants for this reason and that pants were made for men, and in fact were illegal for wemen to wear. \nWhat he forgot to mention is that since the 17th and 19th centuries, people's views on who can wear what changed. And pants are now made for both women and men.\n\nHeck, Jeans used to be for farmers working on the field it was a poor man's cloth. Now everyone wear jeans and they are very expensive.\n\nPeople used to make a hole in their penis to put a metal ring in and get a hook to come from the pants and arrange the penis in a small pocket inside the pants so it wouldn't be noticable from the outside... getting your pants pulled as a prank must have been so painful.",
            "Personally I find a dress sexyer and thus, doesn’t that sexualize them more?",
            "A bit off-topic, but office trousers look amazing on women, and don't sexualize any curves. Chef's kiss",
            "I’ve said it before and I’ll say it again, based on genital configuration it makes way more sense for men to wear skirts and women to wear pants.",
            "He sounds like he's a pantsexual.",
            "Thus guy does not fuck",
            "Imo skirts are more sexual.\n\nEasy access is what I think.",
            "[I had to take a picture of the sexual pants I'm wearing right now ](https://static.tildacdn.com/tild3636-6232-4863-a238-303163313434/photo_2024-06-21_23-.jpg)",
            "Roosh V still exists?",
            "So wtf are women supposed to wear during the cold seasons?",
            "I mean I agree with guy#2 but this wasn’t clever or funny💀",
            "And here I thought pants were invented for horseback riding, just like high heels",
            "Just move to a Muslim country problem solved",
            "Huh, this imbecile statement reminds me of a certain culture.",
            "Yknow can we stop posting these? There is nothing clever about this. \n\nA: Literally anything\nB: Someone doesn't fuck\n\n\nWhere is anything even remotley clever? Its literally just another form of \"Well I fucked your mom\". This sub is going downhill",
            "actually pants were invented for women. We are all just wearing some form of bloomers. Men used to wear robes all the time, with nothing underneath.",
            "It’s crazy how this guy will say something like this and then try to say hijabs are evil",
            "That Andrew Tate?",
            "Hey, my ass looks great in jeans and my ex gf would constantly comment on it and give me little snacks. Jeans 'sexualize' everyone's butts. That's why we love them. The more butts the merrier. Bring on all the butsd. Men's butts. Women's butts. Enbies butts. ALL THE BUTTS!!!!!",
            "Motherfucker ain't seen me in a pair of jeans.",
            "Stfu Doosh",
            "Does he mean trousers?",
            "What if this is just a secret ploy to get women to not wear anything",
            "Wait, so every time this dude sees another dude in pants, it's sexual for him?",
            "So basically every female body part is sexual but no male body part is.",
            "Bro, y'know that like bigger pants than skinny jeans exist? Like you think you're looking all masculine in those skinny ah jeans on your ass?",
            "This is not a clever comeback. Someone just made a stupid comment, and the respond they just called him a virgin. What is clever about this?",
            "But pants will show off men's rear end and dick bulge. Doesn't that bother him? I assume it does not.",
            "\"Pants were invented for women. Men cannot wear pants without sexualizing their body. The slim fit of the pants highlights all their features (penis, bulge, shaft, balls, rear end). Men who want to be modest should not own pants at all\"",
            "i get that it’s a witty comeback but you should probably check out who the guy is first. not remotely accurate",
            "I’m not sure that a woman walking around with no pants on qualifies as modest",
            "Wait till he finds out dresses used to be for men. His head is gonna explode and leave almost nothing on the walls!",
            "Why do you think i like pants in the first place that the reason",
            "I don't agree with the first guy but the comeback is stupid and childish.",
            "I miss when social media was this naive",
            "Our guy only wants men to wear yoga pants and leggings from here on out lol",
            "Why would a person from a Western country want to be modest?\n\nModesty isn't a Western concept. We are the children of Bacchus. We are the society that had orgies of hundreds of people.\n\nModesty has no place in Western culture.",
            "If this is clever I'm a fucking genius.",
            "Pants were invented for riding horses originally. This was to avoid chaffing between the legs as well as to keep a man’s lower bits from flying everywhere and being crushed while galloping",
            "Shh. Never during the holidays.  It was just juneteenth",
            "I’m tired of having to pick a pant leg to cram my dick down and my balls getting snagged by the seem of my pants. Normalize kilts!",
            "I look so sexy in my fishing waders",
            "Nobody will fuck me.",
            "Guessing this guy is an expert on not getting laid",
            "**Ctesias of Cnidus** recorded that Semiramis of Babylon invented pants for women.",
            "Men didn’t always wear pants. Jesus didn’t wear pants.",
            "You'd be surprised (and disappointed) how many women actually find such a caveman way of thinking attractive.",
            "I’m a dude and jeans highlight my dumptruck ass. Strong glutes are for everyone",
            "A super quick wiki search disproves the stupid ass idea that pants were created for men.\n\n  \nAlso, Ireland anyone?",
            "Stg if I see a sharply dressed woman in a suit and pants my day is going to be ruined.",
            "you're helping people like him get engagement and therefore publicity when you post things like this on reddit.",
            "So he's sexually attracted to women who... look like men?  Is he maybe just sexually attracted to men?",
            "No, asshole, you’re sexualizing my body against my will. This is a you problem. \n\nEven the one who do have someone to fuck love to police other women’s bodies.",
            "Some of my longest skirts show off my ass better than most of my jeans",
            "This has to be trolling",
            "So, when you see men in pants....",
            "Fuck Modern Censorship Of This Form Precisely\n\nY'all, we got too many problems to turn into Old Christian Grandmothers over basic four-letter words.\n\n\\*\\*FUCK\\*\\*",
            "I think this is more along the lines of \"thanks for the acknowledgement reddit!  I will get many more clicks because of you\"",
            "I agree. All women should wear sundresses \n\n r/wtsstadamit",
            "Pants are for barbarians! Civilised man wear tunic or toga!",
            "Yeah sounds like a you problem dude",
            "Roosh i am sorry to tell you but pants suit women better than men. Go get a life dude",
            "I like the implication that the guy himself wants to highlight his \"curves and rear end\" when wearing pants :)",
            "He’d be right if Mama from Mama’s family didn’t look so effing sexy in that mumu she wore",
            "I get this dude didn’t even own a dress. He’s open for business.",
            "i mean, if you think about it, women have innies, so their skirt should have an innie a.k.a. pants, too.\n\nmen have outies, so an open pant a.k.a a skirt makes more sense. \n\nphysiologically speaking, that is. \nskirts probably much better for women's microbiome, men's too, really, and they feel great! \n\nwouldn't want to wear a skirt, to say, do drywall. there's a time and a place for everything, and neither sex nor gender identity should have anything to do with it.",
            "Lmso, rooshv is a pickup-artist who got old and suddenly \"regained faith\" to grift further,  just with another audience.",
            "In ancient Greece, men wore loose fitting togas and they thought foreigners that wore pants were effeminate.",
            "\"I can't control myself!\"\n\nDamn, that kinda sounds like a you problem.",
            "Reminds me that I should buy a kilt.",
            "Make sure you call it \"rear end\" if you really want to pull a lot of pussy",
            "Those pants would also sexualize your legs too, buddy, if you ever took the chance to grow some muscle",
            "r/suicidebywords",
            "So is he saying men wear pants to be all slutty and sexualized?",
            "In a few Years they will go full Sharia endorsing, mark my words... And it's worldwide too...",
            "If I can flaunt my legs and butt in jeans or dungarees, then women should be allowed too as well. Enough with this butt sharing double standard.",
            "this is the kind of guy who goes around town looking at men in pants and noticing how they contour the guys body, legs and ass... What an ass.",
            "I say more yoga pants, more better",
            "What is this the 1960's?",
            "Also - \"pants were invented for men,\" and they \"accentuate the legs, curves, and rear end.\" \nNo call for men to stop wearing pants...\nCome out as slowly as you want to brother.",
            "God can we actually get some fucking content",
            "Damn I haven't thought about roosh in years",
            "bullshit\n\nskirts are made for men.",
            "😂😂😂 got to remember this for later usage",
            "That's a lot of words for \"castrate me\"",
            "Sounds like he was caught by his wife for looking at a woman's legs and had to defend himself.",
            "Apparently prison suits have been invented for him too.",
            "He's living in the dark ages.",
            "Hall of fame",
            "He says that like bulges aren't visible when men wear pants or shorts lol",
            "Yeah WOMEN!\n\nI only want to sexualize men's legs, curves and rear ends. Stay in your lane!",
            "Wait til he finds out skirts were men’s apparel",
            "Casual reminder roosh is a rapist",
            "I can. 🙂",
            "The Huns would like to have a word with this gentleman.",
            "Pants were invented because they're more comfortable when riding a horse than robes, so I Don't think gender has anything to do with it.",
            "Bro, how many of you think the dude was being serious? Thats the most obvious sarcasm i have ever heard",
            "He sounds like he’s attracted to men in pants.",
            "I’m not a historian on garments nor do I want to be, but if i’m not mistaken didn’t men essentially wear skirts before the invention of of pants?\n\nadditionally I do know men were the first to wear heals that were high yes?\n\npowdered wigs a little rouge (or is it Roosh?) to go along with it for a night at the opera perhaps \n\nwhen did these inventions take place?",
            "Don't men have rear ends as well?",
            "Anytime I wear pants it sexualizes me. Butt, bulge, legs. Dude probably built like a wall on both sides",
            "The pants aren’t sexualizing her body\nYou’re sexualizing her body",
            "Damn, first skirts and dresses and now pants. When will women stop being so sexy?",
            "Is roosh still a thing? I thought Andrew Taint consumed all of roosh's life force.",
            "Does this mean he thinks that pants sexualize men's legs, curves and rear end?",
            " 🤣 🤣",
            "Another magat fishing for rage engagement.",
            "This is getting to be a lazy response... I never had a good hamburger in my life. Ooooh, that's a weird way to say you never had sex before. Get a new line.",
            "I’m sorry, what part of the body do dungarees highlight?",
            "If only bro learnt who they made high heels for",
            "Pants were invented for riding horses",
            "Pants were invented for the cold...",
            "if someone is really attractive no amount of clothing will make them “modest” in this man’s eyes",
            "Sounds like this guy needs to take a break from the internet",
            "Bro loves that round, sexy man ass.\n\nDon't judge him!!!",
            "Can someone telling him complaining about women not liking him won’t get him a girlfriend? LMFAO",
            "Brovo...👏🥀🌹🥀",
            "Man doesn't want to admit he has a \"women in tight pants\" fetish.\n\n\nDon't tell him about latex/leather pants.",
            "These dorks sound like 90 year old men off their meds in a nursing home 40 years ago. How have we regressed so fast? Lol",
            "When were pants invented, and what did men wear before that?",
            "In ancient times many women wore trousers just like men. This guy never studied history lmao",
            "Um pants dont always have to be skin tight you perv. Also, dreses are easy acces numbskull.",
            "Why did men stop wearing skirts and robes?",
            "I think a little part of it is true when it comes to skin thight pants. E.g. Its Impossible to wear Leggins without somehow show and sexualize your curves. \nI don't say that this is a bad thing, but showing your curves you should be okay when people look 🤷",
            "*chuckling in British*",
            "The chauvinist is a douche for sure, but that response is as far away from clever as can be",
            "“Sex is my weapon so my insult is this guy isn’t a victim of women”\n\nVery clever",
            "What i realy don't like is the fact that 👗 or skirts somehow sexualize men.  Why are Women allowed to wear everything and skinthight clothes and when man do it they are gay?    I want to casualy wear a skirt in Summer too. Or wear skinthight clothes where people can see my bulge without beeing weird.  Girls can wear thight stuff and get excited about it (you can see hard nipples poking)= no big deal.  If a men does it= pervert. \n\n*Insert \"that doesn't seem fair\" meme here*",
            "The one thing I love about the rightwing is that they wear their shallow misogynistic bs on their sleeves in what they usually like to call \"virtue signalling\". \n\nThey give you an early warning they are hateful little crazies and not worth your time and emotional investment. \n\nEvery time they open their mouths all the ovaries in the room dry up.(cant remember where I first heard this qoute but I want to say it was a stand up comedy bit)",
            "What I’m hearing is that pants are for men and pants cause sexualization of the body. So I guess this guy is horny for men in their sexy man pants all day and is sick of women ruining his boner?",
            "Sexy, sexy dungarees.",
            "he's never heard of scotland and men wearking kilts",
            "How is that a good comeback? Lol. 😂 \n\nThat person doesn’t know the other persons sexual life whatsoever. Maybe he bangs dudes. A ton of them. Or females. More of them. Or both. Who knows? Not me, especially not the “comeback” king. Lmao.",
            "Clever though? Like, he got the guy and the guy is a complete loser, but clever?",
            "This dudes argument is that he wants only to see other men be sexualized by highlighted legs, curves, and rears?",
            "But hold on a second that means the pants are sexualizing the men as well for highlighting there flat asses and square hips and of cuz we can forget about how those pants accentuate the BULGE.. this guy shouldn't be worried about women he's probably got all kinds of something hitting him up",
            "I think this guy is really into dudes in pants.",
            "Dresses are a lot less likely to show off a man’s bulge too so if dude is worried about modesty so much he should wear a nice frilly dress to hide his naughty bits. \n\nReally though, worry about yourself, not others. Then the world is a better place.",
            "problem: women arent modest enough\n\nsolution: have them take off their pants\n\nsmrt🧠",
            "Roman men were the last to adopt pants while stationed in Austria, the women adopted them faster. The winters here are harsher here than in Italy.",
            "[https://youtu.be/ghTeWNrH7mg?si=je8uPgJCq9dHFnxX](https://youtu.be/ghTeWNrH7mg?si=je8uPgJCq9dHFnxX)",
            "“modest” more like stop you from checking her out tf?",
            "I thought pants (trousers) were invented for women or am I wrong?",
            "Hahahahahhahahhaa I just flatlined",
            "Maybe bro wanna wear a dress?",
            "Idk, bare legs under a skirt is a lot more sexualizing than pants in my opinion.",
            "The fella seems really confused. \n\nLike does he want women wear dresses for 'easy access'?",
            "MEN HAVE THE DANGLING BITS\n\nWHY DON'T MEN HAVE THE DANGLING BIT FRIENDLY BOTTOM??? \n\nSeriously, women were built for pants. Everything's all neatly packed away. \n\nMen have what is basically herniated organs just hanging out of our bodies. Gotta keep them cool too. But no, men are in control and they say pants are for men only. \n\nBest proof that we're all idiots.",
            "There is of course, the more serious issue of thinking that it is your right to suggest that the 50% of the population that have developed a system of clothing with which they feel comfortable, should not be able to decide what to wear. There is humour in pointing out the futility of this on the one hand, but on the other, can he be trusted to choose wisely.",
            "I noticed that every god damn time women are not able to create an argument or come back with a witty remark be it a word play, pun or hypocritical observation. Everything to them revolves around their vagina. \"you are incel, you can't get laid, you wish to grab my pussy, you can't have it\" etc. Truly fascinating.",
            "Three things:\n\n1. it’s never clever to insult someone on his (potential) lack of success in that or any other area. \n\n2. I don’t agree with the original statement. \n\n3. it’s amazing how we just reframed the sexualization of the female body as some sort of strength and feminist action. \n\nIt’s pretty simple: the same stuff on tape can be considered art or porn. Depending on the sex of the director.",
            "You know this isn't clever. The fact that it's censored, as if the poster were ashamed of it, is kind of funny.",
            ">Incel!!!!\n\nTruly clever. And with the cool Tiktok censoring (of a screenshot?).",
            "Someone forgot the “clever” in “clever comeback”",
            "That’s not a **clever comeback**, that’s just a comment, I’d even say it’s unrelated to the subject and plainly stated.",
            "Okay, like, sure, let's say pants sexualize the female body?\n\nIsn't that fucking awesome to see? Cause idk, i like looking at pretty woman",
            "Sundresses are both sexy and classy, and the best part of the year. And you will die on that hill. (Not directed at you buddy)",
            "That reminds me of the AITA where the guy was playing video games and commented that he couldn’t wait for sundress season… and then his girlfriend got one and he said “I wasn’t talking about you” or something.",
            "> sundresses\n\nLegend. Why do they call them sundresses? \n\n<experiences the effect of dress being lit from behind by the sun>\n\nWow. Got it.",
            "Can we fucking stop blocking out curse words? Really? \n\nFuck \n\nFuck fuck fuck \n\nNow the blue cover is for nothing. \n\nI kinda get the word “unaliving” although I find that cringe. It’s a tough subject sure but there’s words for these actions either to yourself or others and we should face them. \n\nBut man more and more words are being covered blocked blurred. If it’s for like the auto systems for YouTube I can get but does Reddit have that too? I don’t think so.",
            "You all realize that people that feel this way about pants also feel this way about miniskirts, sundresses, any form fitting clothes? It's why the Duggar girls wear what they wear.\n\n\n\n\n It's why girls in fundamentalist Christianity such as some non-institutional churches of Christ and Baptist and Mormon sects, Pentecostal, Mormon, Amish etc. have these girls brainwashed since birth believing they are causing men to sin and therefore sinning by wearing anything revealing or form-fitting. I keep seeing *Islamic* accusations. It's in your own Christian backyards. It's abuse. ",
            "lol I was just about to comment this…",
            "Why you gotta toy with my fetishes like that, man",
            "lol yeah I was thinking “wait, so a dress or skirt doesn’t highlight a woman’s features?”, bro needs to get outside. ",
            "I think this is more along the lines of \"thanks for the acknowledgement reddit!  I will get many more clicks because of you\"",
            "r/wtsstadamit",
            "Not to be crass but sundresses are 👀",
            "Sundresses will completely change your life fr. The moment I went from a boy to a man. 😭🙏🏾",
            "He's probably already splooching his pants when seeing curves in pants as he is evidently starved of any kind of attention from the other gender and therefore probably wouldn't be able to stop splooching when seeing a woman in a sundress",
            "Just curious, what do you think a sundress is? It’s come to my attention that what many men think of when they say “sundress” is not an actual sundress.\n\nETA: downvoting this is legit so funny. What man is out here getting mad that someone dared to tell them they were wrong about a dress. Lord almighty",
            "The first \"pants\" were most likely created by warriors wrapping their tunic up between the legs and around the waist to keep it from tripping them while running. This is what the phrase \"gird your loins\" means.\n\nEdit: Historical corrections have been made by commenters below.",
            "Yep, by the Eurasian nomads. \n\nWhat's even funnier the is evidence is both men and women in those tribes wore them so his whole belief is wrong from the get go",
            "They were invented to ride horses, yes, but they were adopted by many civilizations (except the romans, greeks, and probably the Carthaginians as well) and used everyday. Horses were very expensive, but that doesn't mean only horse riders had pants. Women wore pants in some germanic tribes, for that matter. Pretty much every man had them by the early middle ages, and skirts fell out of use for them. I'm not trying to justify the original tweet here btw, but saying historical men wore skirts is a bit misleading.",
            "The emperor (Domitian) says, Lay aside your lati- clave. See, I put on the angusticlave. Lay aside this also. See, I have only my toga. Lay aside your toga. See, I am now naked. \n\nBut you still raise my envy. \n\n-Epictetus",
            "The first pants were found in nowadays china.\nBtw.",
            "I would like a lot to wear a skirt all day everyday. Pants are so uncomfortable for the scrotum.",
            "you know what i will *scottish noises*",
            "Idk this guy is an islamist or something? Who is he?\nI hate when people tell others how they should live and what they are allowed to do and not to do.",
            "I know they were 1-2\" heel riding boots, but I can't help imagine them being stilettos instead.",
            "He's trying to normalize and continue the objectification of women, and blame them for his lustful feelings. Then if won't be his fault when he assaults a woman because she dressed \"provocatively\", it will be *hers*. \n\nThis is the slippery slope that leads to women being forced into burkas.",
            "He's making engagement bait. This jerkoff's been doing this for, what two decades now? Unfortunately for him, there are other, more popular jerkoffs in his field. He doesn't care what he's saying. All that matters to him is that this message escapes his dwindling subscriber base, and look at that, it did.\n\nWhoever posted the screenshot is part of the problem for doing exactly what this jerkoff wanted, you're part of the problem for commenting, I'm part of the problem by commenting.",
            "They're just dumb lol",
            "Yeah honestly when someone says something like this it feels like someone screaming for help for the crime they are about to commit.",
            "It's skirts or nothing from now on!",
            "SHIRTS SEXUALIZE BOTH MEN AND WOMEN... I THINK EVERYBODY SHOULD BE NAKED ALL THE TIME (wait...)",
            "Why does this sound like this could have been the lyrics of a System of a Down song lol ?",
            "Oh I'm being sexualised because I wear trousers, is it?\n\nChance would be a fine thing.",
            "They don’t sexualize men.\n\n\nIf you have a tiny penis, no ass, and always skip leg day.",
            "Exactly, I thought men did all those squats at the gym so people would stare at their arses in pants",
            "Jfc, some people really just need to be exiled to Antarctica or something",
            "Is he the Australian guy who canceled his Pick up School meeting because women threatened to come and beat his ass?",
            "what? how? adfagfaD?",
            "Roosh is proof that the Manosphere just recycles itself every 10-15 years. He’s 2008 Andrew Tate.\n\nOr is Andrew Tate 2022 Roosh?",
            "We should bring regency breeches into style for women, the pair I made myself has *9 buttons* to undo to take them off…. I have made many a joke that if I were interested in clubbing, I would wear those pants as a safety precaution",
            "And the only things he looks for no matter what she wears, pants or otherwise",
            "It doesn't matter because he has legs and a rear end too that will be highlighted by his pants. Why is he focusing on women?",
            "Let this guy post his Instagram feed before he goes off all self righteous.",
            "Yeah, I'm genuinely so confused by this comment? There are pants that are formfitting (for both man and women) and ones that aren't. Same goes for dresses and skirts.",
            "Obviously true. Though current society does tend fairly overwhelmingly towards women wearing form-fitting pants and men frequently wearing baggier pants. Being of the man-preferring persuasion, it makes me a little sad.",
            "Yeah, I check myself out sometimes.  I think he's saying I should go get a women's pair of pants.",
            "Those are the things he wants. I know it sounds like he's hateful towards women, but he really just wants them to quit wearing things that distract him from those beautiful man butts. He probably sees a bulge and starts salivating. \n\n\nJust to be clear, I have no clue who this guy is, but going from his post, I assume his brain is just a crumpled piece of used cheese cloth. Also, I wasn't trying to imply there is anything wrong with man butts or salivating at the sight of a bulge, I personally love those pictures where a water leak gets behind the paint and it looks like a tick at the Red Cross.",
            "Even knee length skirts reveal a lot of leg and draw attention to hip shape.\n\nI've never understood this double standard insistence that women shouldn't wear pants.\n\nSure it shows figure, I guess, but it also conceals a lot more actual skin than many alternatives. \n\nHere's my suggestion for these clowns: maybe more of us men need to do a better job of not being fucking creepy. \n\nTime to stop controlling women. Actually its long past that point, but here we are.",
            "Sadly Roosh here almost certainly is. About a decade ago he advocated for the legalization of rape claiming that it would keep women safe (he compared a woman's body being raped to a purse being stolen, claiming rape legalization would make women guard themselves as much as they guard their things). He also published numerous books advocating Americans to go to Eastern Europe to take advantage of the women there. He was the original Andrew Tate.",
            "Joke's on you. My narrow Irish ass has nothing to accentuate!",
            "For real this dude goes out with his bros got super turned on by Joey's ass in those jeans, and wanted to know what it would be like to have his thighs wrapped around his head,  then lost his shit.",
            "Precisely! I'm all about easy access, myself. Which is why I have always worn oversized pants.\n\nThe autism is showing again, isn't it?",
            "The actual content of this sub is just ridiculously far from its premise. Whenever I see a post on /r/all featuring the lamest \"comeback\" I've seen that day it's always, always, always this sub",
            "Thank you. The people in this sub are absolutely brain empty",
            "This particular “comeback” is especially cringey given that it’s undisputed Roosh has fucked _very_ many women, most of them consensually. (And then he went crazy.)",
            "In this case there's more to it, though maybe this guy didn't know either, but Roosh is an admitted rapist, so he literally has to force women to fuck him.",
            "And that’s why we should make regency breeches fashionable for fems, the pair I made myself has *9 buttons* that need to be undone in order to take them off\n\nI jokingly say that if I went clubbing, they’d be my clubbing pants",
            "It's a Thing and I haven't heard a great explanation as to why. It is fucking annoying though.",
            "What kind of pansy ~~fuck~~ ~~fuck~~ing censors ~~fuck~~ like it ~~fuck~~ing matters, what the ~~fuck~~.",
            "Got a whole porn folder titled “denim overalls.”",
            "latterly roosh the failed orthodox christian influencer, now roosh the northern maryland delivery driver. not a lie in my comment.",
            "It’s not pickup he failed at, it’s relationship management",
            "nope, brain got broken when his sister died, spun around to doing an ortho christian prodigal son angle for a time, and has now vanished from the internet entirely after alienating all of his former supporters.",
            "roosh is, quite literally, a \"basement dwelling loser\" himself. he is dependent on his parents in his own middle age. all of his businesses have failed and he has voluntarily quit the internet. gotta find a different hatefluencer to simp for there, three month old account.",
            "Trying to intelligently argue against a dumb as fuck point like the OP screenshot is a waste of time, because the person who made the dumb as fuck argument is too stupid to be able to know when they are wrong.\n\nMaybe incels should just stop being misogynistic pieces of shit and not expect smarter people to do the intellectual labor of explaining to them why being a piece of shit is wrong?",
            "Such a low bar for fascination. Quantum physics? No. Osmosis? Nah. Biomes? Definitely not. Women’s remarks? THAT’S THE ONE!",
            "Why would anyone, women especially, try to argue with an idiot that thinks PANTS are controversial? Most people don’t stoop down to the level of someone with a lukewarm IQ to have a genuine conversation with them. Even right now I’m wondering if you can even read this far into a reply without having to sound the words out.",
            "Are you arguing that women wearing pants is sexualization?  I hope I’m just misunderstanding you here, cause that’s pretty fucked up.",
            "I can't remember the last time I saw any comeback in this sub that was even in the same physical plane as \"clever\"",
            "Rush has also gotten laid a lot more than the comebacker, 99% guaranteed.",
            "This aint it, chief.",
            "I'll direct it at him. He may be gorgeous in a sundress. Why judge until we've seen?",
            "I'm happy to be alive at the same time as sundresses and yoga pants",
            "They're the best kinds of dress to get railed in too the point that I feel like that's their purpose",
            "I also choose this hill to die on.",
            "As a man I agree, sundresses are peak women's clothing",
            "Christ, that's awful.\n\n\nUnless... (But real talk, we both know he wasn't eyeing one for himself.)",
            "Isn’t there an entire sub dedicated to that? I don’t remember if it’s NSFW or not, I can’t remember.",
            "If it’s something besides the kind you see on tiktok I have no idea. But I think it’s safe to say the the general idea of my message got across regardless.",
            "I just think casual dresses with fun patterns that you typically see around in the spring/summer. ",
            "The term \"gird your loins\" at most goes back to biblical times while  evidence of trousers goes back to the steppe of the 10th century bc far away from the Mediterranean. The two things are not connected.",
            "Interestingly enough, the first loins to be girded were made created by a Frenchman by the name Fru Ta'the Liume, and had a cornucopia insignia on all his work. That's how archeologists have been able to trace his work back so many years.",
            "real men battle with they junk swangin 😤",
            "That’s not really pants now is it? It’s more like underwear or a big diaper, or shorts if you want to stretch it.",
            "Na, the first pants were made in china for horse riding sorry.",
            ">wrapping their tunic up between the legs and around the waist to keep it from tripping them while running.\n\nI remember a class field trip to one of the colonial reenactment places and the kitchen lady showed us that trick.  Grab the back hem and tuck it in the belt.",
            "The first known pants. Which arent the first there could be originated a but earlier",
            "Who’s stopping you?",
            "They are.\nI wear skirts every day (I'm a woman) and I love it. It just fits well",
            "I think he’s one of those pick up artist, Andrew-Tate-like fuckwits. They make their careers out of scamming young, insecure, stupid men into buying their books because they think it will get them laid.",
            "He was a very popular pick-up artist with a huge web forum and tons of books, but became a hardcore Christian and shut it all down",
            "Yea, this sentiment immediately reminded me of a muslim coworker I had. He told me that his wife wouldn't be allowed to wear jeans. I was floored on multiple points. Allowed? Jeans?!",
            "You know that nonsense about men not wiping or washing their asses because that's gay? Well this is stanky mother fucker you can thank for that.",
            "Surprise! He's Christian\n\n*he's also kinda the original blog incel and pickup artist, his whole shtick was that he would just shit out dozens of useless books to publish in short timespans. He's kind of also the original 'men's rights activist'.on the internet and is sort of a big part of the image of 'men's rights activism' being perceived as so toxic and misogynist.\n\nPost-Trump, he transitioned to being a 'free speech advocate' and was the biggest, most explicit proponent of 'straight men are the most oppressed minority' bullshit you could generally find.\n\nHe then 'found God' and fucked off and tried to collectively forbid the entire internet from talking about his redpill incel past, went about as well as you'd expect",
            "I see more of this speech in Christianity, but I'm American, so that just means it's more common.",
            "Perhaps but this rhetoric comes from conservatives in almost every religion.  Based on this tweet he could just as easily be a Mormon or Catholic or Baptist or any number of religions if conservative enough.",
            "Roosh V was a prominent figure in the pickup artist community, until he was deplatformed in 2018. He has since rebranded as a devout Christian, condemning extramarital sex, however it appears that some of his underlying beliefs about women remain consistent.\n\n[This video about pickup artistry](https://youtu.be/_pEfhgG3Ocw?si=87ONpD6afp_r6MWe) features Roosh prominently, and really highlights how he appears to have continued to focus his career around misogyny.",
            "IDK who he is, but this opinion is pretty common in fundamentalist churches in the midwest/bible belt.",
            "Religious idiot.",
            "Did anyone else read this in the 90s nerf gun commercial guys voice.",
            "Yes, unsexualize nudity.",
            "Ngl, going back and rereading that, imagining it being shout-sung by Serj, made my day.",
            "Sounds like the dude would rape a penguin though",
            "Exiled to the sun.",
            "I mean, technically this man *can* teach you how to make women flock to you… in order to push in all your teeth.  ",
            "How dare you accuse my taste in ass of being so narrow",
            "this is a man who prior to disappearing from the internet quite sincerely said he would never get a colonoscopy because they \"are gay\".\n\nforget brainworms, my man is a bait shop.",
            "The internet is dead and shit like this is the proof for it. It's just farming engagement I guess with such low effort posts. Some people will engage to say that it's not clever, some will chime in to virtue signal and there you go lol. I refuse to believe that people genuinely believe this is a quality content.",
            "Right. I'd bet my next paycheck he's got *way* more tail than the comebacker. \"Clever comeback\", lol, not.",
            "MOST!",
            "Ha ha smart move",
            "As I understand it (as a non user), the TikTok algorithm is capricious, strict, and opaque about its content filtering. It will secretly hide your content if it picks up on some pretty tame words and nobody knows what the whole list is.\n\nTheoretically, that’s trained a generation of internet users to be wildly overzealous about censoring, and they carry the habit onto other platforms. It’s why you see very gentle words like “period” or “sexual” censored more than you’d think. It’s not that they think those are censor-worthy words, it’s that they are paranoid any given internet platform is going to shadowban them over the lightest of language, or just doing it out of habit. \n\nI’m wondering if this is just fallout from that. ",
            "I mean don't get me wrong the dude is scum. But the comeback is not really clever or anything that really fits with the subs theme.",
            "I think I tackled that with 2.\n\nI might add however that it depends on the pants of course. Just as the op probably wasn’t thinking of mini-skirts.",
            "\"Clever\" has been co-opted to roughly mean \"literally anything said by anyone in degratation of another person more conservative than Karl Marx\"",
            "Idk about the band, but probably, as for Roosh? lmao dude couldn't get laid if he paid a hooker to fuck him...",
            "That gave me a much needed laugh",
            "LOL immediately made me think of this video: \n\n\n\n\nhttps://m.youtube.com/shorts/_dVQ-Xvwsgc",
            "I was legit thinking the other day that we need some equivalent to sundresses for masculine bodies, or just to normalize sundresses for everyone, because honestly in hot summer weather they seem like they would feel amazing but some of us would just end up looking like a wild boar who got into a young housewife's freshly-folded laundry basket.",
            "He better shave his legs though…",
            "I’m gorgeous in a sundress and I’ve got a beard too",
            "I'll add crop tops to that list",
            "Yeah, going to college during the grunge era was NOT a real treat as far as lasses clothing was concerned.",
            "It is NSFW \n\nr/wtsstadamit",
            "I don’t have TikTok, so I’ve got no clue what they’re putting out there. \n\nBut to clarify, sundresses aren’t form fitting and traditionally don’t nip in at the waist, either. So you could be talking about the complete opposite of a sundress.\n\nI asked because you said sundresses are revealing of curves and they’re actually not.",
            "That’s in the right neighborhood for sure.",
            "Damn I thought I was on to something there.",
            "I thought the first pants were made in today's china.\nAlso horse people but, not the usual step-people (I think)",
            "gonna gird my loins tonight..!",
            "As a women who wears lots of skirts I have definitely used the old ways of girding my loins when needed.",
            "I don’t even care about the real history, this is something I’m now going to be passing off as known facts.",
            "The Chinese example is the oldest artefacts of trousers found, but the oldest evidence of trousers we have comes from Siberia in the form of small statues depicted wearing trousers.",
            "I am autistic and do not have the energy for the social interactions it will generate.",
            "OSHA, mostly.",
            "How it feels in the winter? Do you need to wear knee high boots? As a man, if you need to wear long underpants will kinda defeat the purpose (maybe a very loose underpart and combat boots). Or it is manageable? Sorry my ignorance, most women I had a relationship used skirts only on summer and I never asked that. I also dress very basically and never had an interest in fashion, so I am pretty ignorant about clothes in general.",
            "Lol that guy was the andrew tate of the early 2010s creepy pick up artist era. Apparently his bodycount is in the 3000 range (mostly poor eastern european countries) and then dropped everything when he became 44 and became an orthodox monk preaching celibacy.",
            "Roosh is the OG Tate and a bona fide rapist.",
            "Yeah, I bought one of his books ages ago not knowing who he was. I still feel bad having given him a tiny bit of money.",
            "I remember a book called something like \"what boys like\" and is kinda like a book for young girls who want to have a boyfriend.\n\nI know the title sounds terrible and it's even written by a man. It specifically targets girls with low self esteem too.\n\nBut it's a bait and switch. It was purposefully designed to attract young girls with low self esteem and tell them to love themselves. The end of the book states \"boys like girls who respect themselves.\"\n\nWe should have a boy version where it targets the same kind of young impressionable boys and teach them to be better people overall with self respect.",
            "Must work right? What will get you laid more than approaching a woman and telling her pants are for men only.",
            "Let me give it to you for free, at least what worked for me.\n\nGrow a beard.\n\nLearn to cook.\n\nHave a cute cat or dog.\n\nIdeally have a cool classic car, or \"future classic\" retroshite.\n\nMost importantly! Don't be a fucking \"pickup artist\" weirdo. They'll either go for you or not.",
            "Very weird. Normally all those pick-up artists are way more open minded than this. Like since when a pickup artist is stupidly prude like this? Maybe he's just trying to get attention like a stupid teenager.",
            "Bingo!",
            "The disgusting state of being which is caused by actively choosing to have permanent swampass should forever be known as *\"ROOSH RASH\"* 🤢🤮",
            "Ok we want to save the penguins from this guy! Maybe he‘d want to have a relaxing vacation on a hot place instead. The sun for example.",
            "<instructions unclear, got the shit kicked out of him by a militant adelie >",
            "Point him towards the sea lions.",
            "The North pole than. Let's see him try to rape a polar bear.",
            "Nah, this guy is American.  He left the pick up scene and internet in general because he became super religious.\n\n Now that I think about it, I’m pretty sure this tweet is a few years old because of that",
            "You really want an ass you could use as a level?",
            "And you've got his \"tail\" in your mouth it seems",
            "Yes. If the comeback had been about him being an abuser it would have been merited, unlike the one in the OP.",
            "I haven't thought of that, but it would be tragic if social media ends up rotting everyone's brains AND making an entire generation think basic words are inappropriate after I really felt like my generation was getting close to making 'fuck' a non-issue.\n\n\nAlso, forcing people (especially children) to censor words like 'period', 'sexual', and 'suicide' is just going to make those things that are already not typically fun conversations at that age, even harder to talk about.",
            "You didn't tackle shit with that garbled mess of a comment. What is \"feminist\" is treating women as human beings with free agency, including being able to pick out clothes they want to wear all by themselves. Imagine that. So feminist",
            "I hope you realize the guy in the screenshot sounds like the Taliban, but I suspect you do not.",
            "I’m not so sure about Geddy Lee.",
            "You mean like casual kimonos/yukatas?",
            "No way, bro. The hairier the sexier.\n\n\nDon't yuck my yum.",
            "overrun by onlyfan spam bots, as all of the niche nsfw subs have been.",
            "[deleted]",
            "Exactly, they're only somewhat form-fitting in the bust due to the elastic that's usually there, the rest is just loose fabric and doesn't show off the hips at all. Maybe they think spaghetti straps are sexy because it's pretty conservative clothing as far as I'm concerned 💀",
            "You tried homie",
            "Hey, you had a good hypothesis and took correction like a champ. That's commendable!",
            "Is a pretty cool idea",
            "Yeah western modern china",
            ">horse people\n\nShii unicorns?",
            "If it ain't broke, don't fix it",
            "I feel this man. I want the exact same thing and avoid it just to avoid the hassle as well",
            "I’m not one to slut shame, but, 3000 sounds dangerously high. Like you probably have a mental illness levels.",
            "Must have been around the time he discovered that measuring his self-worth entirely by how many women he could convince to sleep with him didn't fill the empty void left by a lack of meaningful relationships in his life.",
            "His claimed bodycount. Roosh V never struck me as a guy who actually fucks.",
            "Damn, my beard looks all uneven and ugly. Guess I’m a lost cause.",
            "I hear Guantanamo Bay is a good vacation spot! Some of the best water-boarding in the world!",
            "🐧🖤🤍  I learned about them from the TV series *Atypical.* \n\nSam:  “Adélie, Chinstrap, Emperor, Gentoo.”  🤍",
            "This sounds like you are going to send me a pic, please refrain from doing so.",
            "I definitely also worry that making people think they need to censor words like period and suicide is going to do some real harm for people’s ability and willingness to talk about important things that need to be talked about. That has a real ugly 1984 feel, and the fact that it’d all be due to some dumb company’s policy is even more disheartening. ",
            "Not the entirety of gen z is on Tik tok, nor are they the only generation on it, and nor does everyone on Tik tok censor words, so I think your fear is a complete non issue",
            "I wrote specifically that I didn’t share the views of the original poster. \n\nYeah, good for you. You have internalized the zeitgeist to the comma and aren’t able to have a thought of your own.",
            "Btw who said there wasn’t free agency? I didn’t even talk about that. \n\nBut since you brought it up: how far is that free agency of yours supposed to go? Indecent exposure doesn’t exist for you at all or does it only apply to men? \n\nJust to understand the boundaries you‘re setting here for me. (Even if you didn’t understand what I was saying and probably won’t understand my reply, should there be one.)",
            "Still it doesn't make the comeback clever.",
            "Hahahah “don’t yuck my yum”",
            ">Don't yuck my yum.\n\nThis is my motto! I said it twice earlier today!",
            "TBF, if you sort by Top even the 7-10 year old posts are like that.",
            "I think they think a bodycon or bandage dress is a sundress. That’s like the complete opposite.",
            "It really is.",
            "Well, I always thought the crabs were more honorable Warriors",
            "If you had sex with a new partner everyday for 8 years you're up to about 2920, just to give perspective.\n\nSeems a bit extreme.",
            "I'm a little into triple digits and 3000 seems completely impossible if you're not like, doing it for work. I'm in the lifestyle and even the most long-term, active swingers I know can't touch that.\n\nSeriously, when the fuck did he work?",
            "It's probably fine, just get a cuter dog.",
            "Just normal adelie things\n\n[https://youtu.be/Z7PlUGbsXlQ?t=56](https://youtu.be/Z7PlUGbsXlQ?t=56)",
            "Eh that’s kinda my fault - I’m the one started with the sweeping statement about “a generation growing up on TikTok” and that’s an overly broad generalization and I know it. \n\nHowever, the overly-cautious censoring phenomenon is more widespread among TikTok users than people who primarily use other platforms, and the user base of TikTok skews more gen Z / alpha than older generations compared to other social media platforms, so - as best as I can tell - the overly-cautious censoring phenomenon is probably more widespread among younger people than older ones. I was just trying to write that in a shorthand way.\n\nAnd nobody needs to internalize a habit or be surrounded by a zeitgeist that makes it look or feel like periods, sex, or suicide are things you shouldn’t talk about, but I’d wish that pattern on younger people least of all. They’d probably benefit from being encouraged to talk freely about that stuff more than most people would. ",
            "Wow, you really want to sound smart...but you have to actually say smart things, not just string words together and pray nobody notices. Oof.",
            "I'll reply to this garbled mess as well. You conflated sexualization with feminism, both accepting the premise that pants are more than pants, and that feminism is about anything other than letting women dress themselves.\n\nThe funniest thing is that you truly are not following any of this, while both thinking you are a genius and chastising me for not having original thought. Why not just call me an \"NPC\"? Because it's a lot shorter than \"internalized the zeitgeist\", sounds a lot less ridiculous, and it's obviously what you meant.  I am choking on the irony.\n\nOK. I need to stop engaging with mental illness on the internet. Sorry bro. Muting replies, have a good one.",
            "It's almost like I was responding to the absurd idea that OP is getting attacked for merely saying something \"more conservative than Karl Marx\", when he literally sounds like somebody who would happily stone women for showing a bare ankle.\n\nThe insult is weak, but it didn't happen because of an anti-Woke Marxist crusader. It happened because OP guy is gross as hell.",
            "Weird, I said it twice yesterday!",
            "🥰 its 10am on Saturday morning here in Western Australia and i just woke up to find the awesome video of \"the feistiest penguin in the world\" 💪🐧 \n\nLoving the video's comment section too, that really is an absolute unit up the back of the protective circle, might be Maori penguin on holiday.\n\n🐞🌻 THANK YOU! 🌻🐞\n\nHere's some crocs for ya, cheers! https://youtu.be/NVZ7nontZf4?si=69Y6LLhtmvNk7hMt"
        ]
    }
}