{
    "Ukraine Discussion/Question Thread - 6/16/24+": {
        "title": "Ukraine Discussion/Question Thread - 6/16/24+",
        "score": 44,
        "url": "https://www.reddit.com/r/CombatFootage/comments/1di5mw8/ukraine_discussionquestion_thread_61624/",
        "content": "All questions, thoughts, ideas, and what not go here. \n\nWe're working to keep the front page of r/combatfootage, combat footage. \n\nAccounts must be 45 days old or have a minimum of 25 Karma to post in r/combatfootage.\n\nWe've upped the amount of reports before automod steps in, and we've added moderators to reflect the 350k new users.\n\n[Previous threads](https://www.reddit.com/r/CombatFootage/wiki/uaqa)",
        "num_comments": 249,
        "comments": [
            "Please keep the [community guidelines](https://www.reddit.com/r/CombatFootage/wiki/rule1) in mind when using the comment section.\n\nPaging u/SaveVideo bot. \n\n___\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CombatFootage) if you have any questions or concerns.*",
            "[https://x.com/RALee85/status/1802751852456415387](https://x.com/RALee85/status/1802751852456415387)\n\n>Russia’s investigative committee is pursuing criminal charges against the commander of Ukraine’s 138th Anti-Aircraft Missile Brigade for shooting down the Russian Air Force A-50 aircraft on February 23, 2024.\n\nSo after months of lies (again), Russia has to admit, both A-50s were shot down by the Ukrainians.",
            "[Russian forces in the Volnovakha district of Donetsk region have beheaded a Ukrainian soldier, Prosecutor General Andriy Kostin said.](https://united24media.com/latest-news/russian-troops-behead-ukrainian-soldier-in-donetsk-region-801)\n\nRussian forces in the Volnovakha district of Donetsk region have beheaded a Ukrainian soldier, Prosecutor General Andriy Kostin said.\n\nAccording to him, yesterday the Ukrainian military received information that one of the units of the Russian Federation in the Volnovakha district was ordered not to capture Ukrainian soldiers and instead behead them. After that, aerial reconnaissance found a damaged armored car of the Armed Forces of Ukraine with a human head on the hood.\n\n“New horrifying evidence of Russia’s criminal policy aimed at the extermination of Ukrainians: we have received information that Russian commanders have ordered not to take Ukrainian soldiers as prisoners but to kill them with inhumane cruelty—by decapitation,” Prosecutor General wrote.",
            "Ukraine hit an oil storage facility in Azov, Rostov Oblast, tonight \n\n[https://x.com/war\\_monitor\\_ua/status/1802871384084812132](https://x.com/war_monitor_ua/status/1802871384084812132)\n\nTG channels are talking about \"tanks with oil products\". Caused a pretty big fire",
            "Gotta love the dictator, whose one over arching goal was to reestablish Russian Empire limits and bring them back to  super power status..... visiting North Korea to grovel for their 50+ year old shells that their frontline troops continuously complain about.",
            "Interesting info in this thread about Russian GPS jamming - https://threadreaderapp.com/thread/1803050064690159865.html\n\nIt repeats some info we already knew - Because of jamming, JDAM-ER are 60% effective, GLSDB are badly affected (Boeing is working on that) but GBU-39/B are 90% effective.\n\nWhat was new to me is that the US will be providing JDAM-ER glide bombs with home-on-GPS jam seekers. These will be dropped from F-16, will find the GPS jammer and then [can navigate to the target](https://theaviationist.com/2024/05/06/ukrainian-jdam-er-with-home-on-gps-jam-seekers/). Hopefully this improves the accuracy of Ukrainian GPS-guided weapons.\n\nAlso new to me yesterday it that the MiG-29 that are dropping JDAM-ER are equipped with  a GPS antenna that can [align the weapon's GPS/INS prior to weapon release](https://x.com/John_A_Ridge/status/1802786533864284401).",
            "[https://en.yna.co.kr/view/AEN20240620012200315?section=nk/nk](https://en.yna.co.kr/view/AEN20240620012200315?section=nk/nk)\n\n>The South Korean government said Thursday it will reconsider its stance on arms supply to Ukraine after North Korea and Russia signed a treaty that involves a mutual pledge to provide immediate military assistance if one of them is attacked.\n\nCongratulations to Putin on getting support from north Korea(GDP 36 billion) and antagonizing south Korea(gdp 2160 billion). \n\nSouth Korea's military budget is 20 times larger than that of NK. How can the west ever hope to match Russia when it is lead by a strategist of Putin's capabilities?",
            "Ka-29 gone according to Fighterbomber",
            "The Netherlands and another country are joining forces to send another Patriot battery to Ukraine.\n\n>Dutch Defense Minister Kajsa Ollongren announced that the Netherlands and another not disclosed country were able to organize another complete MIM-104 Patriot Air Defense System for Ukraine. \n\nhttps://x.com/Tendar/status/1804206156564381913\n\nEdit: Stole this from /r/CredibleDefense.\n\n**By Q1 2025, the Ukrainians should at minimum have 6 Patriot batteries active across their country, with a possible 7th depending on what happens with the Romanians.** \n\n> \n> So for those keeping track, total batteries are:\n> \n> -2 Patriots from the US\n> \n> -3 Patriots from Germany\n> \n> -1 Patriot from the Netherlands + an unknown nation\n> \n> -1 Patriot from Romania\n> \n> Of which:\n> \n> -1/2 of the US batteries are in the country. With training on the additional ongoing.\n> \n> -2/3 of the German batteries are in the country. With training on the additional ongoing.\n> \n> -1 battery from the Netherlands + an unknown country outside the country, with training likely to start soon.\n> \n> -1 battery from Romania outside the country, with training schedule unclear.\n> \n> By Q1 2025, the Ukrainians should at minimum have 6 Patriot batteries active across their country, with a possible 7th depending on what happens with the Romanians. At 7 Patriot batteries, this would reach the minimum amount of MIM-104s that Zelensky has asked for. That said, wide gaps in Ukrainian air defenses will still exist.\n\nhttps://old.reddit.com/r/CredibleDefense/comments/1dl2ay2/credibledefense_daily_megathread_june_21_2024/l9n7d7k/",
            "I wondered why we got so many \"concerned\" comments all of a sudden, until I realized the megathread got refreshed. I get that dumb persistence is a classic Russian/Soviet propaganda technique but surely they would get that, at least in this sub, they are wasting their time. Surely. ",
            "Some record breaking numbers from Andrew Perpetua:\n\n\nhttps://x.com/andrewperpetua/status/1803321818117226828?s=46 ",
            "I wonder what the Russian people who support Putin think about having North Korea as their new best mate. You would think that this alone would be enough for them to start thinking their country is rapidly heading towards a point of no return.",
            "[https://x.com/NOELreports/status/1803724122788081949](https://x.com/NOELreports/status/1803724122788081949)\n\n>The oil depot in Azov, Rostov region, is burning for a third consecutive day after a Ukrainian drone attack. Yesterday, the governor already confirmed the fire was still ongoing and couldn't be put out, today Russian media report that the problem still persists. The tanks cannot be drained.",
            "Romania is donating another patriot system. Decision was made .. just now.\n\n(Currently only Romanian news outlets broke the news ).",
            "[https://x.com/Osinttechnical/status/1803824054782111824](https://x.com/Osinttechnical/status/1803824054782111824)\n\n>Per a senior South Korean official on potential arms shipments to Ukraine: \n\n>**\"We will examine the areas that will hurt Russia the most.\"**",
            "KNDS will begin to deliver 54 RCH 155s (Remote Controlled Howitzer) in 2025. This means, Ukraine will get 18 systems more than initally (36 RCH 155s) proposed. Furthermore, KNDS increased the production rate of the CEASAR artillery to 6 systems (from 2) per month. They will deliver 78 CEASAR systems to Ukraine this year.\n\n[Source (in german)](https://www.n-tv.de/politik/Ukraine-kann-hochmoderne-Waffe-erwarten-article25026404.html)\n\n[Wikipedia to RCH 155](https://en.wikipedia.org/wiki/RCH_155)",
            "[https://x.com/archer83able/status/1803877620721037660](https://x.com/archer83able/status/1803877620721037660)\n\n>The US has further softened its restrictions on the use of US-supplied weapons by Ukraine, Politico reported. \"The U.S. has told Ukraine it can use American-supplied weapons to hit any Russian forces attacking from across the border — not just those in the region near Kharkiv, according to U.S. officials.\"",
            "Looks like even russian aircraft production is slowing down. \n\n[\"Fighterbombs complains about low supply of new Su-34s:\"](https://x.com/wartranslated/status/1803346516674806248)",
            "U.S.-made missiles for the Patriot air defense system manufactured for Switzerland are to be delivered to Ukraine despite contractual obligations, the Swiss outlet Blick reported on June 19, citing undisclosed sources: https://kyivindependent.com/patriot-missiles-intended-for-switzerland-to-go-to-ukraine-media/",
            "The U.S. \"has made the difficult but necessary decision to reprioritize near-term planned deliveries of foreign military sales\" to other countries of Patriot and NASAM missiles to go to Ukraine instead, per John Kirby\n\n\nhttps://liveuamap.com/en/2024/20-june-the-us-has-made-the-difficult-but-necessary-decision",
            "Did the FSB forget to pay the troll farms?\n\n\nOut of Rupees, already?😃",
            "Two videos posted by Russia in the last 24 hours shows Ukrainian infantry quite far north in Vovchansk. [Link to google maps](https://www.google.com/maps/place/50%C2%B017'54.5%22N+36%C2%B056'01.8%22E/@50.2992106,36.9278978,1796m/data=!3m1!1e3!4m4!3m3!8m2!3d50.298484!4d36.93384?entry=ttu)\n\n[https://x.com/EjShahid/status/1803793193944727658/photo/2](https://x.com/EjShahid/status/1803793193944727658/photo/2)\n\nand https:// t . me /pograni4nik\\_iz\\_ada/5119\n\nThis is about 1km north of the Russians who are still encircled in the aggregate plant at the river. The situation is still fluid here, but its interesting to see Ukrainians being able to move so far north there and it atleast shows Russia only fully control 4-5 most northern streets in the town. Reminder that Russia never crossed the river here, so they were \"only\" in control of at most 50% of Vovchansk, although the northern side is the most developed part. Almost everything there is destroyed now though\n\nUkraine is also apparently in control of roughly half of Hlyboke, but the opsec in both of these places are very good on the Ukrainian side. The videos they post are usually 2-3 weeks old",
            "Unfortunately this dude is quite influential in the UK\n\n>West provoked Ukraine war, Nigel Farage says\n\nhttps://www.bbc.co.uk/news/articles/cldd44zv3kpo.amp\n\nDefinitely on Putin’s payroll",
            "Western countries really handicapped themselves/Ukraine with the \"we're too good to use cluster munitions anymore\" train of thought.\n\n\nUkraine could probably be successful if they reattempted the southern offensive *if* they had like 50 *extra* M270s and 100k-300k M26/A1/A2 rockets; the original \"steel rain\" DPICM rocket that had 644 or 518 submunitions with a 32 or 45km range. The US had produced over *500,000 M26 rockets.*\n\nImagine if Ukraine re-did that offensive (of course after grouping enough troops & artillery ammo, vehicles, etc..) with ATACMS suppressing the S-300/400 and destroying  Russia's attack helicopters, and endless M26/DPICMs raining down on every tree line for kilometers ahead of the advancing UA group. That would really have helped UA with the ATGM spam and clearing the minefields",
            "Latest from Anders Puck Nielsen!\n\n\nhttps://youtu.be/wvu1KdbNXlg\n\n\n\nFocusing the summit for peace and Putin's recent toddler tantrum. ",
            "The Swiss might maybe perhaps will allow other countries to send Swiss military supplies/equipment to Ukraine.\n\nThey need to pass a new law first though.\n\n> The decision is surprising. Switzerland wants to be able to deliver arms indirectly to Ukraine. Specifically, countries such as Germany, Denmark and Spain will be able to supply Swiss war material to Ukraine in the future.\n> \n> The Security Policy Commission (SPC) took this decision only three days after the conference on Ukraine at the Boergenstock. The majority of the committee wants to amend the current law that prevents such re-exports, the chair of the Priska Seiler Graf (PS) committee explained at a press conference. A corresponding draft law will soon be submitted to the National Council.\n\nhttps://www.blick.ch/fr/news/suisse/et-la-neutralite-suisse-des-armes-pourraient-etre-livrees-indirectement-a-lukraine-id19857893.html",
            "wsj released a video 2 days ago talking about the glide bombs being used by russia\nhttps://www.youtube.com/watch?v=7ZknurbdEkE\nTalking about how they work, how its being used and what ukraine can do versus it",
            "How’s the Russian economy doing so far in the war? I hear a lot of mixed opinions on it.",
            "Putin published a article in the north korean state owned newspaper.\n\n>Russian President Vladimir Putin published an article in North Korean state-owned newspaper Rodong Sinmun praising Russian–North Korean cooperation on the eve of his visit to North Korea, likely to frame any future support that North Korea will lend to Russia as part of a common struggle against the West.\n\n>[1] Putin invoked the history of the Soviet Union's support for North Korea during and following the Korean War in his June 18 article and noted that the Soviet Union was the first country to establish diplomatic relations with North Korea. \n\n>Putin claimed that the Soviet Union's support helped North Korea strengthen its economy and establish a peaceful society following the Korean War and thanked North Korea for its support of Russia's invasion of Ukraine. \n\n>Putin praised Kim Jong-Un's dedication to his father's and grandfather's legacies and praised Pyongyang as a \"staunch like-minded\" nation who is standing with Russia in opposition to the collective West. \n\n>Putin reaffirmed Russia’s support for North Korea’s struggle against its enemy — the United States.\n\n>Putin also implied that Western states are common adversaries of Russia and North Korea. Putin noted that Russia, like North Korea, maintains its strong economy and independence despite Western sanctions and praised North Korea's long-term struggle against the West. \n\n>Putin claimed that the West has refused peace offers from both leaders, although both leaders appear averse to serious, good-faith peace negotiations.[2] Putin stated that Russia and North Korea will cooperate to develop a security architecture for Eurasia and expressed hope that their bilateral relations will continue to deepen\n\nhttps://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-june-18-2024\n\n\nPutin and Kim jong un signed a mutual defense pledge to help each other if either country gets attacked (the scope of such assistance is not clarified, so it can be all from supplies to military assistance/intervention)\n\n\n>President Vladimir V. Putin of Russia and North Korea’s leader, Kim Jong-un, revived a Cold War-era mutual defense pledge between their nations on Wednesday, signing a new agreement that calls for them to assist each other in the event of “aggression” against either country.\n\n>The Russian president, in a briefing after the two leaders signed the document, did not clarify whether such assistance would require immediate and full-fledged military intervention in the event of an attack, as the now-defunct 1961 treaty specified. But he said that Russia “does not exclude the development of military-technical cooperation” with North Korea in accordance with the new agreement.\n\nhttps://www.nytimes.com/2024/06/19/world/asia/putin-meets-kim-north-korea.html\n\nGuess we'll soon start seeing the effect of the visit by satellites and allied spies observing shipments out of north korea to russia, to help putin in his war against ukraine.",
            "The opportunity for South Korea to change its stance on weapons deliveries is interesting. On one hand, the Yoon administration will certainly want to retaliate against Russia over the new pact with Pyongyang. South Korea has plenty of munitions and weapons systems that Ukraine would love to get its hands on.\n\nOn the other hand, the Yoon administration is unpopular and has limited political capital. The South Korean left is already representing this pact as proof that South Korea needs a non-aligned foreign policy, and the right may not want to give the opposition another issue to rally around. On top of that, the pact will only exacerbate the threat North Korea poses to the South, so the South will likely want to avoid significantly denting any of its stockpiles.",
            "Putin landed in north korea today https://edition.cnn.com/2024/06/18/asia/north-korea-russia-putin-visit-intl-hnk/index.html\n\n Looks like another arms exchange is happening with north korea,  if we go by the iran russia deal will also include technology transfer. Iran landed a deal with russia to get  su-35 and mi28 attack helicopters from russia for technology transfer of drones,missiles + the usually ammunition. With yak130 combat training aircrafts already arriving in tehran + theres a rumor that they are getting s400 as well.\n\n>Iran has supplied Russia with munitions, artillery shells, and drones (Shahed-131/136 series and the more advanced Mohajer-6), which involves establishing an entire factory for producing Iranian-style drones on Russian soil. In November 2023 Tehran announced that it would be getting Russian Su-35 fighter jets as well as Mi-28 attack helicopters. The deal was reported as finalized but apparently has not yet occurred. Iranian ballistic missile shipments to Russia, if confirmed, suggest that the fighter jets, helicopters, and perhaps even the S-400 missile defense system will be sent to Tehran soon. In February 2024, Russia also sent an Iranian satellite into orbit marking burgeoning ties in the space industry.\n\n\nhttps://www.stimson.org/2024/iran-and-russia-enter-a-new-level-of-military-cooperation/#:~:text=Iran%20has%20supplied%20Russia%20with,style%20drones%20on%20Russian%20soil. \n\n \nAccording to CSIS, Kim jong un is interested in nuclear submarines, advanced telemetry, satellite wares and advanced icbm technology https://www.csis.org/analysis/threat-no-other-russia-north-korea-military-cooperation\n\n>Kim wants advanced telemetry, nuclear submarine technology, military satellite wares, and advanced intercontinental ballistic missile (ICBM) technology. Putin needs Kim’s weapons to make up for a monthly munitions shortfall of 50,000 rounds (even if Russia is producing ammunition at full capacity) in his pursuit of victory in Ukraine. A gaggle of Russian scientists were in North Korea prior to this month’s military satellite launch. Kim has also been expressing satisfaction with his nuclear submarine plans, which is a very bad sign. This aspect of the relationship not only destabilizes security on the peninsula and in Asia; it also heightens the direct threat posed by North Korea to the homeland. ICBMs with advanced countermeasure technology, overhead reconnaissance capabilities, and nuclear submarines would allow Kim to target the entirety of the United States with a nuclear force that Washington would have difficulty taking out in a preemptive first strike. \n\n\nSeeing all these authoritarian regimes team up does not give me a good feeling. Is this what it felt like leading up to ww2?",
            "I am curious about what surviving Russian soldiers are experiencing on the front lines. And what their responses/psychological reactions have been to the use of drones. What’s morale like in the trenches?",
            "Is it possible for Ukraine to hit power grids in Russia, or has it been forbidden by the States?",
            "So can anyone explain why the Biden administration was able to use emergency powers to go around congressional republicans blocking aid for Haiti today, but weren't able to do that for Ukraine?\n\nhttps://www.aol.com/biden-administration-overrides-gop-authorizes-225537281.html",
            "Are there any reliable estimates on remaining S-300 + S-400? \n\nIm ofc not talking about missiles but the launchers themselves. We know they have enough S-300 missiles to last a very long time.\n\nThere are \"claims\" that Russians are running low on S-300, but all I can determine is they are redeploying units from other areas to cover field losses from the war. \n\nAFAIK there's no actual sign they are running out of launchers but I am also not aware of any reliable estimates how many they may have in service/storage either, only that as recently as last year they still had ALOT.",
            "A new bbc article giving some insight at mobilisation in ukraine https://www.bbc.com/news/articles/cz994d6vqe5o\n\nPretty interesting, mobilisation squads will roam around and try to corner people. Men thats within the draft age of 25-60 goes to hiding, avoids public grouping and if they have to go out and they got kids they'll walk with them so the mobilisation officers wont just snatch them. \n\n\n>With many of its soldiers dead, injured or exhausted, the Ukrainian government has stepped up its efforts to mobilise more men.\nA new law, introduced in May, requires every man aged between 25 and 60 to log their details on an electronic database so they can be called up. Conscription officers are on the hunt for those avoiding the register, pushing more men who do not want to serve into hiding.\n\n>The mobilisation squads have a fearsome reputation, especially in Odesa, for pulling people off buses and from train stations and ferrying them straight to enlistment centres.\nFor those avoiding the draft, public transport is now off limits. So too are restaurants, supermarkets, and weekend trips to the park to play football.\n“I feel like I am in a prison,” Maksym said.\n\n\n>At the enlistment centre around the corner, an optimistic note taped to the door notified would-be-recruits that those who had come voluntarily could skip the queues. But there were no queues. A lone man sat waiting to be seen.\nWhen I asked whether he was there out of choice, he told me he had been “kidnapped” that morning and brought against his will.\n“The officers encircled me so I couldn’t run,” he stuttered in shock. “I’m devastated.\"\nOne of the officers at the centre, Vlad, conceded that there were barely any willing volunteers these days. Under the call sign Hora, Vlad fought in some of the fiercest battles along the eastern front line in the Donbas before being struck in the head, chest, and legs by artillery shrapnel.\n\n\n>On the outskirts of Odesa, Vova appeared sheepishly at the door of his apartment block, using his seven-year-old daughter as a shield. The IT engineer will not leave the house without her as he knows the officers cannot snatch him if they are together.\n\n>Last year, while on his way to work, he was ordered off a bus by the military at gun point, he said, and taken to an enlistment centre. He convinced the officers to let him go to fetch some documents, but vowed to himself he would never return.\n“I’m not a military man, I’ve never held a weapon, I don’t think I can be useful on the front line,” he said.\n\n\n>He then reeled off the same list of reasons given by every draft dodger we spoke to – a family to support, some minor medical ailment, and a defiant declaration he was sending humanitarian aid to soldiers.\n\n>But underneath these excuses is always the same fear, that within weeks of registering, these men would end up as cannon fodder on the front line that, to their eyes, does not appear to be moving. This is despite recent attempts by the government to give recruits some say over which units and roles they are assigned to.\n\nFor what its worth there has been instances when freshly recruited people with 1-2 weeks of training get thrown into the meatgrinder straight away, like these people that ended up in bakhmut less than a week after getting mobilised and getting taught how to fire a gun \n\n>The 16 men including Malkovskiy, enlisted into the 5th company of Ukraine’s 93rd Mechanized Brigade, left Kharkiv on Feb. 16 by bus for the brigade’s base 2½ hours’ drive south.\n\n>The passengers were mostly poor men from villages in the northeastern Kharkiv region, many of them unemployed, doing odd jobs as handymen or shift work at factories in the regional capital. Many had received mobilization notices that month, according to their military-service records. While some had completed mandatory service years or decades earlier, almost none had seen active combat.\n\n>They spent two nights at the base, where they were given Soviet-era rifles and uniforms, according to military documents and photos. On Feb. 18, they were driven to Kostyantynivka, 16 miles from Bakhmut, and billeted in a house on the outskirts of the garrison town.\n\n>On the morning of Feb. 21, the company sergeant major arrived to say he had orders to send the men into Bakhmut in groups of six. Russian forces were edging closer to the river that bisects the city, pressuring Ukrainian units defending themselves from constant mortar and artillery bombardment.\n\n>Some of the men threatened to write an official refusal to follow the order, citing a lack of training. Vladyslav Yudin, an ex-convict from the eastern city of Luhansk, said he told the sergeant major he had never held a gun, let alone shot one, and was scared. “Bakhmut will teach you,” he said the man replied.\n\n>When the first group of men arrived in Bakhmut that evening, they were told to follow a commander to their position. They walked down alleyways past the ruins of bombarded buildings, stepping over downed telephone poles and unexploded Russian shells.\n\n>They reached a high-rise apartment block separated by a shed, a chain-link fence and a small garden from Russian troops in the next building. They took up positions beside windows on the first floor. Then they came under fire with grenades and mortars, and Yudin said he saw Serhiy Didik, a 36-year-old villager, and the commander killed in front of him. “It was hell on earth,” he said.\n\nwsj is paywalled so someone copypasted the article in the comments here https://www.reddit.com/r/ukraine/comments/13rfkaa/wsj_36_hours_in_bakhmut_one_units_desperate/ \n\nWhen you read stories like these i sympathize with people that have no will to fight deciding to flee the country.",
            "Soo... Where's Zaluzhnyi? Been out of the news for a while.",
            "Why is footage of Ukrainan loss so uncommon to find here (I haven't seen any)? I know that it's something that we don't want to happen, but it does happen, and I feel like a subreddit like r/CombatFootage should be a place that shows the terrors of war from all perspectives. ",
            "Why are there protest over Palestine being hit by Israel but none over Russia pounding Ukraine.. thoughts?",
            "What are the most 3 fear**ed** weapons by russian soldiers and ukraine soldiers (usa/britain/france) in this war ?",
            "LMAO Apparently the A50 was peacefully flying around, and not part of any conflict: \n\n> A court in Moscow granted the investigation's request to impose a preventive measure in the form of the commander of a Ukrainian military unit\n\n> The Khamovnichesky District Court of Moscow granted the petition of the investigator of the Main Military Investigation Department of the Investigative Committee of the Russian Federation imposes a preventive measure in absentia in the form of the commander for the commander 138th anti-aircraft missile brigade (military unit A4608) of the Armed Forces of Ukraine, Colonel Nikolai Dzyaman.\n\n> On February 23, 2024, Russian airspace was patrolled by an aircraft of the Aerospace Forces of the Russian Federation.\n\n> According to the investigation, Colonel Dzyaman, **realizing that the aircraft in question was not for combat intended operations, had no weapons, and the flight taking was the place exclusively in the airspace of the Russian Federation, gave an illegal order to his military personnel to destroy it.** \"The actions led to the death of 10 crews and the destruction of the aircraft.\"\n\n> Dzyaman was charged in absentia with committing a crime under the paragraph of Part 3 of Art. 205 of the Criminal Code of the Russian Federation (terrorist acted in the death of a person), he is put on the federal wanted list.",
            "So the buffoons at r/UkraineRussiaReport were talking shite about Russia downing it themselves. Their claims it couldn't possibly be any other reason as the hallowed fighterbomber had confirmed it turned out to be as ridiculous as they seemed.",
            "Yeah, I think we need to give the green light to strikes as deep into Russia as Ukraine can reach without going full ICBM. ",
            "It's kinda puzzling that the US does not already have something for that. The HARM missile has home-on-jam function, we heavily rely on GPS-guided munitions, everybody already knew Russia has a lot of EW/jamming/spoofing assets.\n\nLike.. we haven't developed a home-on-(GPS) jam yet???",
            "Wonder what causes the big difference between the ground launched and regular small diameter bomb. The high g forces throwing the inertial navigation off? Difficulty setting the initial location?",
            "Who in the class can point on the map the Asian country which employs a large, modernized artillery army with enough production and stockpiles of 155mm to put the US to shame?",
            "It's funny how Putin says South Korean weapons deliveries to Ukraine will have consequences when this is a direct consequence of his deals with North Korea.",
            "Russian sources are saying that a Russian Pantsir shot in down in a friendly-fire incident.\n\nAllegedly, the Ukrainian sent naval and air kamikaze drones. The Russians launched the Ka-29 to attack the naval drones.\n\nThey also activated air defenses to attack the air drones, which confused the Ka-29 for a Ukrainian air drone and shot it down.\n\nCrew is dead apparently.\n\nhttps://x.com/bayraktar_1love/status/1804069356789190865",
            "Hope they feel comfortable enough with the amount of patriots they're getting to risk a roaming patriot.",
            "I'm pretty sure they have a list and are paid to go through all the points on it.\n\n\nWhat they're doing is pretty obvious to us, but it's not to a casual visitor sadly. \n\n\nThey get really annoyed if you directly accuse them of being a paid Russian troll because it pollutes their sock puppet account history, and those are \"lovingly nurtured\". But beware of how you do it, because they'll start harassing you directly when you do. I got suicide watch emails, and they managed to get me banned from /r/WorldNews because I was a bit too rude. ",
            "I think it's saturation - making sure the narrative lines they're given are everywhere",
            "There has been concern trolling since 2022 in fairness, there's little evolution to the tactic",
            "And while the Soviet stocks are being depleted and new Russian production being chewed up at the front, traditional customers are slowly giving up on buying weapons from Russia and looking elsewhere: \n\n\nhttps://m.economictimes.com/news/defence/india-us-advance-talks-on-joint-production-of-stryker-armoured-combat-vehicles/articleshow/111055729.cms",
            "Dude, people have tried to convince me that NK is the way it is because of the interference of western nations. They weren't even Russian. Humans are wild.",
            "Not sure what the Putin supporters think, but North Korea is one of the biggest producer of artillery shells in the world, and as such, an extremely powerful ally to have in this war. South Korea is the same btw, but they are not as willing to provide the same quantities.",
            "Deffo payback for the football. All is forgiven.",
            "It’s a total embarrassment that that matches the one system the US has sent and the one joint Dutch/German donation after 2.5 years of war.\n\nThere is a second from the US scheduled to be sent from Poland.",
            "Well, that is easy. Shells and AA, obviously. \n\nI'll hold my horses until something substantial actually arrives in Ukraine, they get way too much warm words, promises and memes - which are all extremely useless in a shooting war...",
            "Give'em the heavy duty drones. ",
            "Here is the Politico article in question: https://www.politico.com/news/2024/06/20/us-says-ukraine-can-hit-inside-russia-anywhere-00164261?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
            "Attacking would mean Ukraine has to wait till Russia shoots I assume. Which is total bullshit.",
            "Is this reliable? As in, why would they allow FighterBomber to post something really bad like that?\n\n\nIn any case, the only export buyer for it was supposed to be Algeria, but that's no longer in the news. Russia is now in a real bind - they can't export new ones because they badly need them, they probably struggle with spare parts and servicing for the older exports and as the clock is ticking, customers are looking elsewhere.",
            "I can’t help but feel this is a political move, as to give Switzerland a black eye for refusing to allow repurchasing of Leopard 1. \n\nHonestly this “Swiss neutrality” thing will doom Switzerland’s famed arms industry in the long run. Who’s going to buy from Swiss if they could halt your weapons out of neutrality claims?",
            "Now, if only the US would fund several batteries and increase the production of missiles.",
            "Spent all the money on spoiling Putin in North Korea maybe",
            "They're probably reorganizing and merging with the North Korean troll farms for greater efficiency.",
            "What is this in reference to? I'm out of the loop.",
            "first video is fpv drone attacks, second is drone view of  about the same location, I don't see ukranian infantry moving about in them. This doesn't mean russians have been pushed back to this point, it could but I'm not gonna assume that before I see infantry moving into these sectors. These are probably just strikes on known Russian locations.",
            "It is mixed, he is influential with a lot of the boomers and right wingers, mostly due to immigration but fortunately he is still insignificant (when you consider final election outcomes)\n\nShouldn't have let his putin cock sucking mask slip though as it is certain to make a lot of people question him, pretty sure he has been on stuff like RT, the typical braindead populist shill that russia loves\n\nThe people that knew he was a twat already will only think of him moreso after seeing this, me included",
            "Ah god dammit farage",
            "It's always the most despicable people that spew this garbage.",
            "Is he still relevant? I thought the brexit fiasco removed his credibility",
            "Cluster bombs are a short-term gain in exchange for a long-term problem.  Ukraine is fighting a war for survival, so it is happy to make that trade.  America mostly fights foreign wars, and littering countries with UXO is a bad look.    Thats why they decommissioned them.  Cleaning up Ukraine after the war ends will be a nightmare.",
            "There were reports a bit ago that Ukraine had gotten a licence/rights from the US to make certain US ammo types and weapons. Considering I doubt the US would be willing to give up the licencing for some of their more advanced things I could see Ukraine getting the licence to manufacture 155mm DPICM.   \n\nSo, for example the west produces conventional 155mm to provide to Ukraine and Ukraine itself exclusively produces DPICM.",
            "Completely agree. Are all m26 rockets dismantled by now by the way?",
            "with 300k GMLRs rockets alone Ukraine could render the remaining Russian army completely combat ineffective even just assuming half the effectiveness they have had so far.",
            "Putin some months ago: ‚why should we stop attacking and start negotiations just because Ukraine is running low on ammo?‘\n\nAlso Putin: ‚the West better starts negotiating with us, we mean it‘",
            "Ukrainians will finally be allowed to use pocket knives.",
            "Swiss eventually will allow other countries to send Swiss military supplies/equipment to Ukraine.. I am sure of that\n\nBut if we go by Swiss redditors who have been spot on until know maybe that year will be 2026 at the earliest",
            "We’ve been hearing that rumor for years now",
            "No one knows because Russia hasn't been reporting real numbers for a while now. What's clear is that some segments are ruined (like the Gazprom which is near bankrupcy - China f-ed them over with not willing to invest into trans-siberian pipeline and they don't have LPG infrastructure so gas trade is mostly gone) and government is wasting gold and foreign currency reserves and most income from oil into war effort.\n\n\nWe'll see how much longer can it last - they're still pumping oil and that's a lifeline. They're also exporting grain, coal, etc. Sanctions on enriched Uranium are still few years away but things like that are being tightened. Air transport & travel is slowly going to shit and indirect effects of lack of infrastructure investment are starting to show. \n\n\nTheir weapons exports are gone and customers are turning to the west - France pushed them off the 2nd spot year ago and by now they might not be in top 5 or even 10 anymore. \n\n\nLong term I think situation is even more dire - the opportunity loss will be huge as, unlike China, they don't really have any high tech industry and aren't investing into it. They'll increasingly depend on oil and resource exports and that can easily slip into not being profitable for various reasons (i.e. see Venezuela, but also hopefully oil becomes less costly as world slowly switches to EVs). \n\n\nI think nuclear deterrent will be a weight around their necks as it requires maintenance and upgrades to subs and ICBMs and airforce, and that ain't getting any cheaper. \n\n\nAnd then there's demographics - fertility rate is 1.5 which is worse than most of the west, but unlike the west, Russia won't be able to make it up with immigration as it's becoming a bigger shithole than it's poorer neighbours. \n\n\nSo... Short term - who knows, watch the ruble. Long term - they're pretty much f-ed if they swiftly don't get out of Ukraine. ",
            "It's growing....but its a short term gain based on super high government spending. They're rapidly emptying the national wealth fund, inflation is high and rising (now 8.3%) with interest rates of 16%. Export markets are now more costly to access with imports up....\n\nBasically the economy is running far too hot and isn't sustainable in the mid term they're stacking up a big moster of a recession when it all grinds to a halt....medium to long term they're in trouble....foreign investment will be impossible to access, export markets for their key exports of Gas and Oil have disappeared or got more expensive and they won't be able to export military kit for years to come (they need to replace all the lost gear, and its not performing well)...if they ever manage to export gear again they'll find China has taken the non-Western market...sanctions aren't going away either....",
            "Lot of cope on both sides about this. From a perspective of the Ukrainian war, it's doing kinda bad but not anywhere near bad enough to crash the war effort. Inflation is real bad, it's down from 2022 peaks but not really coming down back to normal pre-COVID levels. But it'd have to be way higher for them to lose them the war. For reference Germany and the UK had inflation rates of 50% and 25% in 1917.\n\nRay of hope is that persistent high inflation/Labor shortages will make further expanding war production (or mass mobilising troops) impossible without them really eating into the civilian economy more, which they seem unwilling to do.",
            "Seems good, but only because of the war.",
            "Not being an expert on south korean politics at all, wouldn't the pact between Russia and NK compel South Korea to actually respond to that threat to their security by strengthening their existing western bonds?\n\nI mean, they're responding to an escalating threat not of their own making. Choosing a neutral course wouldn't help SK in the slightest. NK will be belligerent no matter what\n\nFurther more, the North would actually create a dent in their own stockpiles by aiding Russia, and the new threat from NK would not constitute a convential one, but a added nuclear one, due to the nature of russian aid(technology). The US has already stated that a nuclear attack will be the end of the NK regime.\n\nIs the korean left using this as a political tool or is this a rational course from their perspective?",
            "There’s always surplus nearing expiration 👀",
            ">... so the South will likely want to avoid significantly denting any of its stockpiles.\n\n\nBut instead of reducing stockpiles, they could actually increase production for Ukraine (a lot of it paid by US/Europe), both ammo but also various other weapons systems. \n\n\nIn which case they benefit from the economy of scale and further build up of weapons industry and testing of their indigenous weapons, which places them in better position to defend vs North Korea. \n\n\nPlus they seem very open to sharing tech IP for collaborative projects, like the tanks for Poland. They could have the same opportunities in Ukraine. ",
            "Seems like an excellent opportunity to field test equipment and show of force to the North.",
            "Honestly I doubt SK will be helpful for once so I think they'll do nothing",
            "The destabilising security is actually quite important because it pisses off china\n\nThe more countries worry about north korea, the more they build up arms wise, the more they think about ideas like pacific NATO and the more they look toward countries like the USA for help\n\nWhich is very much undesirable if you are a honey eating chinese bear because it gets in the way of your dotted line horseshit, not to mention potential for economic sanctions shenanigans",
            "They are not allying up. They just want us to believe they do.\nThough the tech transfer to NK is indeed painful",
            "Axis power in ww2 has a globe spanning empire and access to vast resource. Russia's allies otoh is so impoverished that I almost feel pity for the spy master Putin as his entire political career machination only amounts to this.\n\nI live in a bonafide third world nation and my country's gdp output trumps both Iran and North Korea combine, but its citizens act humble and working hard to improve the lives of their family.",
            ">Looks like another arms exchange is happening with north korea, if we go by the iran russia deal will also include technology transfer. Iran landed a deal with russia to get su-35 and mi28 attack helicopters from russia for technology transfer of drones,missiles + the usually ammunition. With yak130 combat training aircrafts already arriving in tehran + theres a rumor that they are getting s400 as well.\n\nThere's no shot Iran is getting anything meaningful until the war is over - and that's if russia wins out and staves off collapse. They simply can't afford to trade critical systems - some of the only effective systems they have had in this war in the case of helicopters - for munitions. In all likelihood we're talking about the tech and tooling to domestically produce those things. \n\n>According to CSIS, Kim jong un is interested in nuclear submarines, advanced telemetry, satellite wares and advanced icbm technology\n\nI don't see them giving North Korea the technology that would allow them to achieve parity with their own military, nor do I see China wanting to risk doing so in the event that the regime collapses in the future and moves away from either sphere of influence. \n\n>Seeing all these authoritarian regimes team up does not give me a good feeling. Is this what it felt like leading up to ww2?\n\nDespite the fact that there's no direct intervention happening here, we are trying harder (comparatively) to stop history from repeating itself. If we weren't doing anything, I'd be a lot more concerned.",
            "This is just basically survival, TBQH. Iran's only future hope of not being attacked or decimated in some future conflict is to develop a credible nuclear deterrence like the North Koreans are attempting to build. Hence the need for nuclear capable submarines to keep a credible second strike capability.\n\nThese sort of things will become somewhat more common as time moves on as long as there aren't dramatically better, cheaper and more available ballistic missile defense systems available. \n\nIt's the same cat and mouse game in nuclear deterrence that has existed since the beginning of time. The purported dangers are not really that much greater. All of these maniacs with control of these various buttons also are likely to understand that they are not likely to survive the decision to \"go nuclear.\"\n\nIt's just a defense against invasion or attack by a far larger and more capable adversary.",
            "I would guess it varies wildly depending on where you are. If youre stationed in Polohy, an area which is entierly quiet since the war started, your moral is likely quite good. But if youre one of the zerglings who watched your entier company die outside Arkhanhelske and your next job is to assault the same position the next day, it must be extremely demotivating\n\nWe hear so little from these Russians who survive so its hard to have anything to point to, like an interview for example.",
            "Russian milblogger reports mass drunkenness among Russian troops in the Kherson sector. This has led to Russian combat deaths.\n\n>A Russian “military correspondent” under the name Ossetin complains that Russian military personnel in his Kherson sector have gone crazy from alcohol. Everyone drinks, as he says. And then this leads to unnecessary deaths, and if even one is drunk, his entire squad may die too easily.\n\nhttps://x.com/wartranslated/status/1802333555592171626",
            "Do you think Ukrainian armed forces face FPV drones as well or only Russians?",
            "From a war perspective it wouldn't achieve much. Unlike hitting oil refineries which are incredibly important to the russian economy.   \n\nAlso, as part of the soviet legacy if I remember correctly the russian power grid has lots of redundancy, so would actually be hard to take down unless you're destroying power stations.",
            "He did so on several occasions, right up until there was no money left in the part of the budget that is used to pay for \"Presidential Drawdown Authority\" expenditures.",
            "Not entirely sure on this but maybe someone can back me up. I’m pretty sure Biden did maneuver around Congress several times, once in [December](https://www.cbsnews.com/amp/news/biden-ukraine-military-aid-250-million-final-package-2023/) and the Pentagon scraped together another $100m package a month or so before the big bill passed. \n\nI think there’s a limited budget as to how much you can sign off on without congressional approval. He can’t greenlight an entire $60 Billion aid package alone, but $100m could be within their current budget, wherever they are pulling the funds from.",
            "From launcher point of view, they are doing okay. Their launchers far outstrip their need for radars though, which is what Ukraine has been heavily targeting. How many they have left is not readily available, but it is being strained enough that they may be adopting a mobile AA approach in Crimea.",
            "> AFAIK there's no actual sign they are running out of launchers... \n\n\nWhat kind of signs are you looking for? \n\n\nUkraine has been hitting various things such as refineries, infrastructure and even airfields in Russia (including a Su-57 https://www.rusi.org/explore-our-research/publications/commentary/damaged-su-57-emphasises-vulnerability-russian-airbases-near-ukraine ) with relatively low tech drones that can be shot down by S-300/S-400 so discussing whether they are or aren't running out is bit nonsensical given that it's not a binary thing and they need every system they can get. ",
            "Dont think Russia will ever run out of launchers. The estimate is somewhere between 500 and 2000 of them, and they have only lost a few since 2022. The radar is so much more valuable than the launchers\n\nUkraine has a lost a lot more launchers (and radars too) than Russia has, but atleast they have replaced them with western systems for the most part",
            "Just check wikipedia about the S-300 family. The launchers are no issue (the 2k units produced mentioned here? Those are for one of the original systems alone (S-300P)- as usual take russian sources with a grain of salt and a teaspoon of corruption).\n\nThe thing about long range AA is that you need a shitload of radar coverage and highly trained personnel and prime communication between them. Might be a reason the russians are using them mostly for jolly warcrimes...",
            "I say this a lot, but this is exactly how conscription is supposed to work. If war comes to South Korea, or Estonia, or Finland, the same thing will happen. There's just no other way around it, if you are invaded by a superior force, conscription is the only way. Most people don't want to fight a war, it's fine if you are fighting an inferior foe where the risk of casualties is relatively low, but in an asymmetrical or near peer wars against a relatively strong opponent, any \"volunteer\" army is impossible. In the Great War, there were a lot of cases with French soldiers injuring themselves on purpose in order to get discharged, so much that the French would execute anyone who do that. Let's say the US gets into a land war on US soil with an alliance of China and Russia without any ally, the US itself will start kidnapping people off the streets and force them to enlist, that's just how it is.\n\nThis is why you need to invest in your military, so that war will less likely come to you. If war is already there, it's too late.",
            ">*When you read stories like these i sympathize with people that have no will to fight deciding to flee the country.*\n\nJust imagine having such mindset in WW2.",
            "You all are trying way too hard to get this narrative going.",
            "Hmm.  \"Conscription Not Universally Popular, Some People Try to Avoid It.\"  If that's news, it must be a slow news day.....\n\n(I'm opposed to conscription as a *general* policy, but sometimes your country is up against the wall and you have to take extreme measures.  Ukraine is a pretty textbook case: we've already seen what the Russians plan to do if they take the country.  I can well imagine why some folks - even against that background - don't want to fight, but it's in no way surprising that the Ukrainian government is not in a position to indulge that preference.  After all, I don't think the folks quoted here would be too thrilled if their peers stopped fighting and left them to the tender mercies of the Russians.  As the saying goes, not being interested in war won't keep it from being interested in you.)",
            "im sure the brave redditors downvoting you are heading to recruitment offices as we speak",
            "[deleted]",
            "He’s the current candidate as the Ukrainian ambassador to the UK, Wiki says he’s waiting on his letter of credence as of May 2024 before it becomes official",
            "Because the west is already supporting Ukraine.",
            "There have been, two years ago. People are unable to pay attention for that long. Besides, this is a false equivalence - Palestine has attacked Israel.",
            "The policy of most countries where protests like that are allowed is already aligned with Ukraine, unlike Palestine. There were significant demos in 2022 before that was the case.",
            ">ukraine soldiers (usa/britain/france)\n\nwhat on earth is this suppose to mean?\n\n> feared \n\nwhy is the ed highlighted?\n\nthat being said, drones, artillery and rocket systems are the most feared weapons in the war.",
            "it is obviously a bot",
            "Neither were the power plants intended for combat operations, exclusively in the territory of Ukr.  I lol'd.",
            "LMAO indeed, that take is really something eh",
            "Those guys are experts at being wrong lmao. ",
            "We have it on GBU-39. But we are putting on a JDAM-type munition for Ukraine.\n\n\n\n>In fact, in December 2020, the Air Force Research Laboratory modified GBU-39/B Small Diameter Bombs with the addition of the SARA HOJ seeker. At the time, the Air Force described it as a home-on-GPS-jam seeker that gathers information about the battlespace, a software-defined radio for communication between weapons, and a processor preloaded with collaborative algorithms, developed by SARA and AFRL.",
            "All these weapons were originally designed by men who wanted to find the most efficient way to kill people. The people in charge now want to find the most efficient way to put a colorguard at a pride parade.",
            "A big part of the GLSDB was that it has high maneuverability to attack from any angle even behind the target so I would guess there really isn't an inertial guidance option",
            "The reports I have seen mention that GLSDB are being shot down after Russian radar targets the rocket launch. But then other reports mention jamming.\n\nI think that we dont have a good answer yet.",
            "The main problem was not GPS Jamming but the disconnecter from the booster according to other sources and also the reason why stocks were pulled off the frontline until there is a fix.\n\n[https://xxtomcooperxx.substack.com/p/ukraine-war-30-april-2024](https://xxtomcooperxx.substack.com/p/ukraine-war-30-april-2024)",
            "Flight time / distance too? Has to go up on a rocket and then glide down? ",
            "So they actually CAN shoot stuff...",
            "Thats hilarious how do we go about trolling them and hurting them in the rice bowl?",
            "Is it a case of low/no supply or real concerns over efficacy?",
            "Germany has sent 2 systems + 2 launchers",
            "Do keep in mind that the systems being sent will be replenished .. by the US and until then temporary deployments from other NATO countries will take their place.\n\nIn effect, except Germany, they are all US supplied, even if somewhat indirectly.",
            "They should at least send AA since it's defensive only",
            "The ROE for Ukraine using Patriot to hit Russian aircraft is that they were \"threatening Ukraine\" - thats a very broad definition that could include getting into position (see the 5 aircraft ambush last year).\n\nI assume that \"attacking from across the border\" means moving towards Ukraine as well as directly attacking Ukraine.",
            "ISW has reported that after the MoD purge, the Kremlin seems to have implicitly given milbloggers more freedom to express problems, in order to make the army a little more efficient. \n\n\nOf course all criticisms have to be directed either to Shoigus cast, or to no one in particular, since criticizing anyone in the current MoD is still very much a red line.",
            "Not just in the long run - Rheinmetall returned 35mm ammo production back to Germany last year.",
            "Denmark wanted to donate a lot of our older Piranha 3s to Ukraine, modern wheeled APCs. Switzerland was against it.\n\nSame also happened with some older air defence systems that people where willing to pay the swiss to acquire and donate to ukraine and they destroyed them instead.\n\nPersonally i hope my country never again buys from the swiss, if it had been my decision i would have just donated every vehicle right there and then and tell the swiss to get stuffed.",
            "In the long run? It is completely dead already with dwindling life support in the form of still existing contracts.\n\n(I mean... weaponry is freakin useless if you can't get ammo and parts once you have to use it.lol)",
            "It could be.  End user certificates are ubiquitous when trading arms though, it would be a bit unseemly for the world's largest arms exporter to shit on the Swiss for exercising the same rights that they regularly do.\n\nPersonally, I think it was done out of necessity, as a stopgap to protect the airspace around Kharkiv (in conjunction with the Patriot battery given a week or two ago) and hopefully keep Russian bombers out of glide bomb range until the Ukrainians can field at least a squadron of F-16s.",
            "At a certain point the Western countries had to look at them and say we aren’t buying your products in the future because you are an unreliable supplier.",
            "They have scaled up [production in the US](https://www.defensenews.com/land/2024/04/09/how-companies-plan-to-ramp-up-production-of-patriot-missiles/).\n\nAnd production is being [increased in Europe](https://www.twz.com/patriot-missile-production-is-headed-to-europe).\n\nThe US is also [sending a second Patriot battery to Ukraine](https://www.msn.com/en-us/news/world/us-to-send-second-patriot-missile-battery-to-ukraine-amid-attacks-reports/ar-BB1obiZo).",
            "Yes, more of:\n\n\nNameNameNumbers posted\n\n\n*'I am blue, white and red American man from Ohio who love football. I'm sick of my tax dollars funding pedophile Jew-Nazis in the Ukraine!'*",
            "lol good luck, some guy hacked the north korean internet and had it down for over a week recently. He did an AMA a couple days ago:\n\n[https://www.reddit.com/r/IAmA/comments/1divlp3/im\\_the\\_hacker\\_that\\_brought\\_down\\_north\\_koreas/](https://www.reddit.com/r/IAmA/comments/1divlp3/im_the_hacker_that_brought_down_north_koreas/)",
            "There was a chatGPT error that was popping up on a lot of social media accounts due to insufficient funds. Some of the errors had the location marked as Russia. Kind of hilarious actually.",
            "I’m hoping to see his poll gains flatline or reduce from now on after this",
            "He’s leading a new party called Reform UK that’s trying to split the UK even more and has made some headway in polls recently",
            "Think about the fact that they're still digging up bombs and uxo in WWII and that's about what Ukraine will look like for a LONG time. Especially with all the booby traps, ukrainian kids will be dying and losing limbs for awhile",
            "When the choice is keep territory with a risk of UXO bomblets, or losing territory, the choice is pretty obvious.\n\nHopefully someone is keeping a database on where cluster munitions have been targeted. It wouldn't be perfect, but at least a place to start when planning cleanup in the future.",
            "Yes, they would have to be cleaned up afterwards. But that's a much more controllable problem than an ongoing war",
            "Well, the longer the war goes on, the more unexploded North Korean artillery shells are going to be littering Ukraine's countryside.",
            "Not sure. Trump canceled a previous directive order to destroy them in 2017, so it sounds like some still exist. But they're also past their shelf life too.",
            "I've always been in favor of funding a massive increase in gmlrs production and sending them straight to Ukraine.\n\n Every target deserves 188,000 tungsten sphere of freedom.",
            "It wont matter. Not unless they create some really crazy \"incentives\" for arms companys.\n\nEvery company that could already moved their machinery out. The market is bat-shit crazy, but not for guns you are not allowed to fire (unless you are a Saudi), lol.",
            "A lot of good stuff you said. But yeah I agree they’ll probably have to be really self sufficient on oil as that would probably keep their economy from crumbling ( I might be wrong I don’t know much on economics ). There Weapon sales are already screwed. I heard India canceled the order on some military hardware but I don’t remember what. No one is going to want weapons from them. There really going to be fucked long term from this war.",
            "Unless they keep obtaining more land that they can then farm as ukraine has some of the best farming land in the world.  \nThey arent taking ukraine because \"its theirs\"  its because more land/residents = more power/respurces as a collective(country).\n\nMy 2 cents.  Not an expert",
            "Russia's only remaining relevant industry is the oil one, and they're short 40,000 workers. The more people they recruit into the ~~meatgrinder~~ Russian army, the fewer people they will have available to work in the oil industry.",
            "It’s simply crazy to me that if you dig beyond the economics, spreadsheet-level, sterile analysis you realize we’re talking about having too few human beings to do the work because the leadership keeps killing and wounding them in a war. ",
            "> I live in a bonafide third world nation and my country's gdp output trumps both Iran and North Korea combine, but its citizens act humble and working hard to improve the lives of their family.\n\nYou guys keep this up for 10-20 more years, you won't be a third world country anymore. Unlike North Korea and even Iran (who's going to be left hanging when oil and gas tumble).",
            "Would love an interview from a Russian. Most likely anybody who would have something to say is a pile of sketti tho.",
            "both sides.",
            "both sides use fpv drones.",
            "sometimes there's russian fpv shots on here if you sort by new. Equally brutal but they never last long, either downvoted or removed.",
            "No he never did.\n\n>right up until there was no money left in the part of the budget that is used to pay for \"Presidential Drawdown Authority\" expenditures.\n\n...that would mean he was just sending aid that Congress approved.",
            "Nah, that money was basically a leftover after the clerks were done with the math.",
            ">I’m pretty sure Biden did maneuver around Congress several times, once in December and the Pentagon scraped together another $100m package a month or so before the big bill passed.\n\nYou're welcome to demonstrate it if he actually did,  as far as I know he was just sending aid that was already approved by Congress.",
            "Exactly.  Within the past week I read an article that referenced 300-400 S400 launchers.",
            ">The thing about long range AA is that you need a shitload of radar coverage and highly trained personnel\n\nThis is even more true for Russian systems, which are notoriously difficult to operate in comparison to their western counterparts.",
            "Well, to be fair, some folks did.  It's always like that.",
            "This war is nowhere near the scale of ww2. If you told me russia,china,iran and north korea teamed up and started a world war you wouldnt see a shortage of people wanting to fight. I mean where are you going to hide if the other side wins? ukrainians fleeing still got a safe haven in nato countries and theres no 100% guarantee that russia will invade a nato country.",
            "What narrative? theres people that want to fight and people who dont and this article gives a insight into people who dont want to.",
            "Ah... So.. Just waiting, doing nothing? Alrighty! :P (I have unrealistic hopes. But let's leave it at that heh.) ",
            "What our comrade is trying to say is that NATO soldiers form the backbone of the Ukrainian army, because how else would the mighty second strongest army in the world be in the 2.5th year of the 3 day SMO, except by being against the entire Western World?\n\n\nUnfortunately OpenAI recently shut down access to Chatgpt to his troll farm so instead of a \"subtle\" concern post we get this pitiful mockery of a propaganda post.",
            "idk why the \"ed\" is highligted shouldn't matter.\n\nYour response isn't very precise, which rockets systems, wich artillery launchers specifically and ok for the drones but are there specific drones\n\nIt means you guys can include their weapons too into the list",
            "ChatGPT going hard.",
            "I don't know, that's a good question :)\n\n\nPointing out in clear but not abusive language that their message looks like a Russian misinformation campaign, with links to Vlad Vexler's (or similar) high level explanation (i.e. https://youtu.be/pdS-lwb58KU )? \n\n\nOne could also track the sock puppet accounts and keep watch on their history and track if they delete messages and then periodically post stats and etc? \n\n\nPossibly best to keep it on the informational/educational level only. \n\n\nSounds like lots of work :D",
            "Dismantle their incoherent arguments using clear, concise rebuttals completely devoid of insults. Let them joke. Let them meme. And then grind their delusions into the ground with logic and reason.",
            "Personally, I respond by donating to Ukraine in their honor, and posting the receipt.\n\nUsually they call me names, then delete their comments a day later.  I think it makes them look bad in review.",
            "Supply and reliability of supply - India needs new IFVs to replace their old BMP-2s and have slightly different requirements than before I guess. I think Russian BMP-3 bid failed before the war. \n\n\nBut no one's going to order anything from Russia when delivery is \"just wait until we win this 3 day special operation\"\n\n\nAnd the refurb-of-Soviet stocks part of the business is obviously gone now. ",
            "That case from last year definitely shows Ukraine could shoot down Russian aircrafts that are dropping 100+ glide bombs in Kharkiv region every day. But Ukraine is not doing that. Which leads us to the conclusion that they are not allowed. Nothing good will come from US till Jake Sullivan is replaced.",
            "Now that is rich. Government that proudly ridiculed the endlessly debating indecisive western democracies now has to ease suppression of free speech after realizing their military has rotten from a total lack of an error culture.",
            "Maybe they were betting that Ukraine would lose quickly and people would forget about this war shortly after. That way they wouldn’t piss off Russia oligarchs but keep their arms sales.\n\nOtherwise I can’t think about how it’s a good idea agitated your primary customers especially there are so many other options nowadays.",
            "Thing is, the Leopard was made by Germany, and was already purchased by a Germany company, as surplus physical stored in Italy. \n\nI don’t know exactly the EULA Germany had with Switzerland for these Leopard1 back in the days, but usually the manufacturer (Germany) has the final say on how to dispose these tanks. Like US regularly denies resell of F-16 or parts to countries they don’t like (e.g Venezuela who had F-16)\n\nYet Swiss went way out of their way to stop German government from buying back their own tank is certainly very unusual.",
            "tbh he might go higher as the Tory vote gets cannibalised, like maga eating the republicans in americaland\n\nFirst past the post voting system is what will keep his ilk from having any impact",
            "Wait, there are still people that haven't figured out that Brexit was dumb?",
            "Thanks for the update, that's interesting",
            "They're dying and losing limbs right now, too, because of a war that isn't ending. Every day, more UXO accumulates regardless.",
            "Yep. I work for an US company with offices all around EU and some of my colleagues are Russian. Some of them came here before the war, some in a rush after the war when our Russian offices closed.\n\n\nWhile they mostly had differing views on the war initially, they're now all kind of in disbelief and shock as to where this is going for Russia. Some of them are old enough to have seen USSR collapse first hand and can now see writing on the wall. \n\n\nOne of them is always telling me \"look at the ruble my friend, that is the key\" so I keep repeating it like a parrot :) \n\n\nAt this point, Putin is literally selling away their future to stay in power. ",
            "They are selling oil at a discount to India and China. India has been reselling it and pocketing the profits. So while it helps, they are still bleeding cash.",
            "The USSR constantly exploited and exported oil and collapsed nonetheless after several years of worsening standard of living. The real threat to the Russian economy is not a total stop of production and exports, more a tipping balance of the profits they get from those exports against increasing cost of the war. Ukrainian attacks on fossil infrastructure are effectively increasing cost of production and thus decrease Russia's profits. Russia on the other side will need to step up funding to replenish the free Soviet legacy arsenal they lost and to significantly increase the payouts to soldiers.",
            "Well so far, after the initial significant gains in '22, they aren't obtaining any land so that's kind of a moot point? \n\n\nI mean, sure, if they win the war in 3 day special operation then it pays off? But they haven't and now they're stuck. There's no scenario now, however unrealistically optimistic for Russia, where they will be better off than before '22. All of the resources of Ukraine aren't enough to offset loss in gas sales, let alone all other things - it's just nowhere close in scale. ",
            "Yes, goods for ordinary Russians are more expensive because the firms producing those goods are short on workers because an ever increasing part of the labour force is busy building artillery shells or dying in the mud",
            " There were a lot of Russians interviews and just documentary videos of soldier's life. YouTube just deletes it. Modern warfare.",
            "But which side uses more of these? I guess the ukranians but Russia could produce more or am I wrong?",
            "Biden didn't have to have the Pentagon continually engage in \"fuzzy math\" to create more funds out of thin air to be used for the purposes of exporting our outdated arms to Ukraine.\n\nYet he did so repeatedly, as recently as March of this year when suddenly $300 million was conjured out of thin air to provide more support.  Source: https://puck.news/ukraine-on-the-brink/ (second paragraph).",
            "u/SquarePie3646\n\nLooks like this is right, the December aid package was the last part of the drawdown of the previous aid package. Not sure where the Pentagon’s funds got shuffled around from though. \n\n I’ve spent some time over the last few days trying to find an article I once read about the differences in Biden’s funding programs between Israel and Ukraine, and why he was able to circumvent some of the congressional block for Israeli aid. It went on to detail that it was largely a difference into where the funds were originating from, and the funds for Ukraine had pretty much dried up by the point of the congressional block from previous aid packages that were exclusively from the executive office, but would have never have been able to source $60B worth in an override. \n\nBUT I could not find it, and google’s search algo sucks balls anymore, so feel free to dismiss that as you see fit as I can’t produce the evidence. \n\nI want to say it was a War on the Rocks piece but I’m not 100% sure on that.",
            "Leave Biden alone.\n\n\nHe knows better than you and he's a damn sight better than the alternative, a lunatic in Vova's pocket 🍊💩🤡",
            ">I mean where are you going to hide if the other side wins\n\nThis does not make any sense. In case of World war 2, the United States was perfectly safe, both Germany and Japan weren't capable of invading the US, so people could hide there in theory, the problem is that the US wasn't going to house the entire population of Europe running from Germany and the entire population of China running from Japan. Same thing here, NATO countries aren't going to house the entire population of Ukraine. \n\nSo you are saying, IF China is stronger than the US and invades the US, the US should be content with fleeing to Canada instead of fighting back? I assure you, IF the US is invaded by a stronger country, you will see police grabbing people off the streets of New York forcing them to fight.",
            "> This war is nowhere near the scale of ww2\n\nIrrelevant.\n\nThe scale doesn't need to be the same.  \n\nEither way a foreign dictator is invading your country, raping and murdering, committing genocide, wanting to reduce your country to slavery. You stay and fight when that happens.",
            "Very little want to fight, I wouldn't be surprised if the vast majority who raised their hands first actually have no interest in fighting. For some it's a moral thing, very very little want to actually be there.",
            "Valid question. He was sidelined by Zelenskyy and won't appear anywhere anytime soon.",
            "Well despite John Brennan and Anthony Blinken and CNN telling me this is the end for Putin two years ago, here we are with the weapons not working and paltry numbers of weapons and ammunition being sent despite the propoganda that somehow “dollars” equal results.",
            "Didn't Russia just refuse to send kit that India had already paid for, as well?",
            "It'll come, just way too late",
            "It's by design. When the Fuhrer purges someone, it's because they were always the enemy, even if just yesterday was Fuhrer's favorite. Orwell took his inspiration from the russians after all.",
            "Oh, no shit.  I (mistakenly) thought they had been produced under license by Switzerland.  I would not be surprised then if it part of the reason for this was political.",
            "Correct, they instead believe Brexit wasn’t carried out correctly by the Conservative Party and that’s why we haven’t seen any benefits.",
            "You're trying to say that you know for certain they wont continue to gain ground.  Sure currently the front lines arent moving as fast as they did earlier but they are still moving in russias favor,  the lines arent static as you suggest imo.  Aside from the pedantic argument both of us could provide about what quantitatifiable amount of land is acceptable to be considered not static vs static is also the future and that its unknown.\n\nLets just say trump wins and the us stops supporting ukraine.  Russia will most definitely start gaining more and more ground as ukraine wont have the resources to stop them as the us is the largest supplier to ukraine.\n\nhttps://www.usnews.com/news/best-countries/articles/these-countries-have-committed-the-most-aid-to-ukraine\n\nThe next largest military aid per country is germany which is half of the us per that article.\n\nSo even though, yes there are other suppliers, greatly reducing aid from the US would be a decent sized blow to their military respurces.\n\n\nSo to say that because at this moment and under current conditions the front line is static is not a guarantee it will remain so.\n\nSo you're point about russia never getting anymore territory is not only moot, but probably false imo.\n\nHave a good day",
            "Volodymyr Zolkin made an English language channel and posts interviews with POW's daily. The earliest ones were pretty wild, and mostly occurred on his original channel.",
            "they both use them equally. for every drone vid on a russian theres a drone vid on a ukranian.",
            ">Biden didn't have to have the Pentagon continually engage in \"fuzzy math\"\n\nYou're changing the subject not to mention moving the goalposts here.  \n\n>Yet he did so repeatedly\n\nYou're welcome to provide an actual source for that.  I have never heard it said this was done repeatedly, nor that Biden was personally responsible for this?\n\n> Source: https://puck.news/ukraine-on-the-brink/ (second paragraph).\n\nI can't read your paywalled blog post.  [The pentagon's accounting error was discovered back in May of 2023](https://www.reuters.com/world/us/pentagons-ukraine-accounting-error-revised-up-62-billion-2023-06-20/) and freed up $6 billion - that was well *before* the republicans started blocking aid, which began around September / October 2023 I believe.",
            "Usa pushed liberal and freedom so far that I'm not sure they can do that but maybe",
            ">You stay and fight when that happens.\n\nI will just take my family and leave.",
            "i thought it was more of a 3 day thing",
            "On videos of Russian tanks being destroyed, there have been comments purporting said tank to be built to Indian spec for export.",
            "If Trump wins then he doesn't get to make decisions until the start of '25, at which point Russia will be pretty much through its stockpile in key areas, and European support should be enough to ensure Ukrainian victory. Even if Trump were to try to pull support, which I actually doubt he would at that point because he'd want to take credit for the win. All his advisors will tell him to stick with it because to drop support would be to signal to all other European countries that the US is not a reliable ally, and the effect that would have on US soft power would be huge.\n\nEuropean support is slow and so far insufficient, but it will be enough to outlast Russia. (Though obviously continued US support will be very helpful.)\n\nBut the other point you're missing is that *even if Russia were to take the whole Donbas* it wouldn't leave them in a better position than in '22, because in '22 Russia was a genuinely feared military superpower, and now they have burnt all their resources and reputation. That is a huge and long term geostrategic loss.",
            "> You're trying to say that you know for certain they wont continue to gain ground. \n\n\nWell they can't \"continue\" to gain ground if they haven't been gaining in the past 2 years. \n\n\nAnd, no I'm not saying that - don't play the strawman, it's rude. \n\n\n> Lets just say trump wins and the us stops supporting ukraine. Russia will most definitely start gaining more and more ground as ukraine wont have the resources to stop them as the us is the largest supplier to ukraine \n\n\n\"Most definitely\" is just your opinion based on... well.. nonsense. US did stop supporting Ukraine for 9 past months and you know what happened? Russia gained a couple of villages and a town and lost thousands of heavy weapons. Economic benefit from that is laughable - it's all destroyed and mined out - Russkiy Mir. \n\n\nThe problem for Russia is that it is now starting to run out of Soviet stocks and they have nowhere to turn for help. \n\n\nWell, except buying Chinese golf carts - lol good luck capturing Kyiv with that.\n\n\n> So you're point about russia never getting anymore territory is not only moot, but probably false imo. \n\n\nIt's \"your\", not \"you're\". I think you meant \"any more\", not \"anymore\". \n\n\nAnd I don't think you understand the meaning of what I wrote since you've ignoring the whole point I made about the loss of nordstream/european gas exports income being so huge (and irreplaceable - as we've seen China recently snub Putler) that capturing the whole Ukraine wouldn't make up just for that. \n\n\nRussia is toast. It's a corpse, like USSR in thr 80ies, they just don't know it yet. \n\n\nHave a good day, I suppose! ",
            "Russia's currently losing ground. Not gaining it. There's currently hundreds of Russian soldiers trapped in Vovchansk :).",
            "Pow interview is biased",
            "I literally linked you a source showing (in the 2nd paragraph of the article) that it was done again in March of this year.  I don't think Puck has a soft (or hard) paywall, but if it does let me know and I can paste the article.\n\nI know you're not shilling because I looked at your recent posts before bothering to reply.  That said, I'm still at a bit of a loss as to why you seem to have an axe to grind on this issue.  No disrespect intended here, just confused and trying to understand.",
            "Democrats are 100% incapable of accepting any type of criticism of their leaders.",
            "That's just the surface, the US needed and had used a variant of conscription (\"the draft\") during World War 1, World War 2, Korean War and Vietnam War. Conscription is still in place BY LAWS on a contingency basis, all men between certain ages are required to register to the \"Selective Service System\".",
            "If you are a male US citizen 18+ you are highly likely to already have registered for the selective service (draft) as required by law. It just hasn't been invoked since the Vietnam war. WW3 breaks out and doesn't end pretty much immediately from one thing or another, the draft will be back in force, no doubt.",
            "And live in poverty in another country with nothing to your name, what a terrible life for your family. \n\nWhereas if you were not a coward, you could let your family leave, join the rest of your community in defending your land, and send your family your army pay.",
            "IF any country even takes you, and if there is even an escape route in the first place. Depending on where you are from and the political situation of the future, it is possible that no country will take you in. It is also possible that your country is surrounded so you have no escape route. What is also certain is that no one is going to house the entire population of another country, like the Allies weren't going to house the entire population of France. So again, if the majority can't leave anyway, the are only two choices: conscription or surrender.",
            "Russia has kept on very slowly gaining ground around Ocheretyne to be fair. They captured Novopokrovske a few days ago and Novooleksandrivka last week. Sokil is also almost captured too, and they recaptured Staromaiorske. Its just not something people focus on it seems, and its not hugely important anyway\n\nBut yea, since Ukraine has taken back land up in Kharkiv, I suppose we're about even the last couple weeks in total. Ukraines advance in Hlyboke/Vovchansk is very interesting since its the first kind of offensive attacks Ukraine has done since they liberated Klishchiivka in september last year. Im not counting small counter-attacks in Novomykhailivka for example where the goal was to mainly take back a trench or two. In Kharkiv we see attacks with the goal of taking back the entier town/village, and its an important step for Ukraine",
            "That's crazy bro I don't remember asking",
            "Isn’t every context of an interview inherently biased one way or another?",
            ">I literally linked you a source showing (in the 2nd paragraph of the article) that it was done again in March of this year.\n\nNo you didn't.  AFAIK what happened in March was money left over from another project that was redirected to Ukraine, it had nothing to do with the Pentagon adjusting the budjet on the aid sent to Ukraine.\n\n>I'm still at a bit of a loss as to why you seem to have an axe to grind on this issue.\n\nBecause for the 6 months or whatever that republicans held up aid, I was arguing that Biden should at least try to use emergency powers to redirect aid to Ukraine, and was repeatedly told he can't do that.  And that is what they are doing for Haiti, but AFAIK they didn't do it for Ukraine.\n\nSimilarly, I argued that if the Biden administration was really focused on supporting Ukraine then it would be redirecting production for things like ATACMS to Ukraine from countries that aren't at war, and was told that was impossible - [now today I see that is exactly what is finally being done ](https://www.washingtonpost.com/national-security/2024/06/20/ukraine-patriot-air-defense/) years into the war.",
            "I see",
            ">And live in poverty in another country with nothing to your name, what a terrible life for your family.\n\n if my first option is to flee the country clearly i can afford it, idk why you are making assumptions. \n\n>Whereas if you were not a coward, you could let your family leave, join the rest of your community in defending your land, and send your family your army pay.\n\nYou are speaking like the russian tv ads recruiting people for the war lol.",
            "Which is fair.\n\nI just think this narrative that Russia's some unstoppable juggernaut inevitably gaining ground is bullshit. The ground is basically even, and Russia is spending a lot for that.",
            "Don't be stupid - Russian tv ads are recruiting people to *invade* another country for the ego of a 60 year old man; not defend their own country where they live from murdering rapists.",
            "Defending your homeland (especially as a man) is a core part of the social contract of a European state.",
            "A big portion of the western youth know nothing about social contracts anymore. They whine all days on TikTok about military bad and too costly and how we should defund the military, AND at the same time plan to dip the moment the country is invaded lol."
        ]
    },
    "Weekly Current Conflicts (other than UA)": {
        "title": "Weekly Current Conflicts (other than UA)",
        "score": 14,
        "url": "https://www.reddit.com/r/CombatFootage/comments/1dlig3w/weekly_current_conflicts_other_than_ua/",
        "content": "This post is for discussion about current, ongoing conflicts around the world. Post photos, videos, articles, comments, questions or links about an ongoing war. This thread posts every Fri. at 5:00 PM, West Coast time.\n\nPlease keep direct discussion about Ukraine to the Ukraine discussion post. Previous discussion or content may be carried on into a new post. Please do not spam.\n\n[Wikimedia map of ongoing conflicts](https://upload.wikimedia.org/wikipedia/commons/d/d9/Ongoing_conflicts_around_the_world.svg)\n\n[Wiki list of ongoing armed conflicts](https://en.wikipedia.org/wiki/List_of_ongoing_armed_conflicts)\n\n[ACLED Conflict Index - Ranking violent conflict levels across the world](https://acleddata.com/acled-conflict-index-mid-year-update/#map)\n\n[AFLEC Conflict Index: Country Ranking](https://imgur.com/a/cg5QaGi)\n\nThe list below is ordered based off AFLEC's ranking.[¹](https://imgur.com/a/cg5QaGi) These are some resources on the first 15 countries. It's not meant to be an extensive list but for the sake of discussion some links are provided for each country. List will be updated periodically\n\nMyanmar\n\n* r/Myanmar\n* Myanmar Civil War wiki:  [https://en.wikipedia.org/wiki/Myanmar\\_civil\\_war\\_(2021%E2%80%93present)](https://en.wikipedia.org/wiki/Myanmar_civil_war_(2021%E2%80%93present))\n* [AP News, Myanmar](https://apnews.com/hub/myanmar)\n* [BBC News, Myanmar](https://www.bbc.com/news/topics/c302m85q5vzt)\n* [liveuamap, Myanmar](https://myanmar.liveuamap.com/)\n* r/CombatFootage subreddit search: [Myanmar](https://www.reddit.com/r/CombatFootage/search?q=Myanmar&restrict_sr=on&include_over_18=on&sort=top&t=all), [KNLA](https://www.reddit.com/r/CombatFootage/search?q=knla&restrict_sr=on&include_over_18=on&sort=top&t=all), [Anti-Junta](https://www.reddit.com/r/CombatFootage/search?q=anti-junta&restrict_sr=on&include_over_18=on&sort=top&t=all)\n\nSyria\n\n* r/Syria\n* r/syriancivilwar\n* [Syrian Civil War wiki](https://en.wikipedia.org/wiki/Syrian_civil_war)\n* [AP News, Syria](https://apnews.com/hub/syria)\n* [liveuamap, Syria](https://syria.liveuamap.com/)\n* r/CombatFootage subreddit search: [Syria](https://www.reddit.com/r/CombatFootage/search/?q=Syria&include_over_18=on&restrict_sr=on&t=year&sort=new)\n\nMexico\n\n* r/Mexico \\- r/mexico_politics \\- r/NarcoFootage\n* [Mexican Drug War wiki](https://en.wikipedia.org/wiki/Mexican_drug_war)\n* [AP News, Mexico](https://apnews.com/hub/mexico)\n* [liveuamap, Drugwar](https://drugwar.liveuamap.com/)\n\nUkraine\n\n* r/Ukraine \\- r/UkrainianConflict \\- r/UkraineWarVideoReport\n* [Russo-Ukrainian War wiki](https://en.wikipedia.org/wiki/Russo-Ukrainian_War)\n* [liveuamap](https://liveuamap.com/)\n* r/CombatFootage subreddit search: [UA Discussion Thread](https://www.reddit.com/r/CombatFootage/search?sort=new&restrict_sr=on&q=flair%3AUA%2BDiscussion), [CombatFootage/new/](https://www.reddit.com/r/CombatFootage/new/)\n\nNigeria\n\n* r/Nigeria\n* Nigeria wiki: [Communal and religious conflicts](https://en.wikipedia.org/wiki/Nigeria#Communal_and_religious_conflicts)\n* [Global conflict tracker, violent extremism in the sahel](https://www.cfr.org/global-conflict-tracker/conflict/violent-extremism-sahel)\n* [AP News, Nigeria](https://apnews.com/hub/nigeria)\n* [liveuamap, Nigeria](https://nigeria.liveuamap.com/)\n* r/CombatFootage subreddit search: [Boko Haram](https://www.reddit.com/r/CombatFootage/search/?q=boko+haram&include_over_18=on&restrict_sr=on&t=all&sort=new), [ISWAP](https://www.reddit.com/r/CombatFootage/search?q=iswap&restrict_sr=on&include_over_18=on&sort=new&t=all)\n\nBrazil\n\n* r/Brasil\n* [Crime in Brazil wiki](https://en.wikipedia.org/wiki/Crime_in_Brazil#Crime_dynamics)\n* [AP News, Brazil](https://apnews.com/hub/brazil)\n* [YouTube search, Brazil gangs](https://www.youtube.com/results?search_query=brazil+gangs&sp=EgIIBQ%253D%253D)\n\nYemen\n\n* r/Yemen \\- r/YemeniCrisis\n* Yemeni Civil War wiki: [https://en.wikipedia.org/wiki/Yemeni\\_civil\\_war\\_(2014%E2%80%93present)](https://en.wikipedia.org/wiki/Yemeni_civil_war_(2014%E2%80%93present))\n* [AP News, Yemen](https://apnews.com/hub/yemen)\n* [liveuamap, Yemen](https://yemen.liveuamap.com/)\n* r/CombatFootage subreddit search: [Yemen](https://www.reddit.com/r/CombatFootage/search?q=yemen&restrict_sr=on&include_over_18=on&sort=new&t=year)\n\nIraq\n\n* r/Iraq\n* Iraq wiki: [\"2018–present: Civil unrest, disfunctioning government\"](https://en.wikipedia.org/wiki/Iraq#2018%E2%80%93present:_Civil_unrest,_disfunctioning_government)\n* [AP News, Iraq](https://apnews.com/hub/iraq)\n* [BBC News, Iraq](https://www.bbc.com/news/topics/cvenzmgyljrt)\n* [liveuamap Iraq](https://iraq.liveuamap.com/)\n\nDemocratic Republic of Congo\n\n* r/Congo (DR Congo)\n* [Kivu Conflict wiki](https://en.wikipedia.org/wiki/Kivu_conflict)\n* [AP News, Democratic Republic of the Congo](https://apnews.com/hub/democratic-republic-of-the-congo)\n* [liveuamap,DR Congo ](https://drcongo.liveuamap.com/)\n* r/CombatFootage subreddit search: [Congo (DRC)](https://www.reddit.com/r/CombatFootage/search?q=congo&restrict_sr=on&include_over_18=on&sort=top&t=all)\n\nColombia\n\n* r/Colombia\n* [Colombia wiki](https://en.wikipedia.org/wiki/Colombian_conflict)\n* [AP News, Colombia](https://apnews.com/hub/colombia)\n* [BBC News, Colombia](https://www.bbc.com/news/topics/cywd23g04get)\n* r/CombatFootage subreddit search: [Colombia](https://www.reddit.com/r/CombatFootage/search?q=colombia&restrict_sr=on&include_over_18=on&sort=top&t=all)\n\nIsrael/Palestine\n\n* r/IsraelPalestine \\- r/Palestine \\- r/Israel\n* [Israeli-Palestinian Conlict wiki](https://en.wikipedia.org/wiki/Israeli%E2%80%93Palestinian_conflict)\n* [AP News, Israel-Palestine conflict](https://apnews.com/hub/israel-palestinian-conflict)\n* [liveuamap, Israel-Palestine](https://israelpalestine.liveuamap.com/)\n* r/CombatFootage subreddit search: [Palestinian](https://www.reddit.com/r/CombatFootage/search?q=palestinian&restrict_sr=on&include_over_18=on&sort=relevance&t=all), [Israeli](https://www.reddit.com/r/CombatFootage/search?q=israeli&restrict_sr=on&include_over_18=on&sort=relevance&t=all), [Fatah](https://www.reddit.com/r/CombatFootage/search?q=fatah&restrict_sr=on&include_over_18=on&sort=relevance&t=all), [Hamas](https://www.reddit.com/r/CombatFootage/search?q=hamas&restrict_sr=on&include_over_18=on&sort=relevance&t=all), [IDF](https://www.reddit.com/r/CombatFootage/search?q=idf&restrict_sr=on&include_over_18=on&sort=relevance&t=all)\n\nHaiti\n\n* r/Haiti\n* Haitian crisis wiki: [https://en.wikipedia.org/wiki/Haitian\\_crisis\\_(2018%E2%80%93present](https://en.wikipedia.org/wiki/Haitian_crisis_(2018%E2%80%93present))\n* [AP News, Haiti](https://apnews.com/hub/haiti)\n* [BBC News, Haiti](https://www.bbc.com/news/topics/c207p54m4jqt)\n* r/CombatFootage subreddit search: [Haiti](https://www.reddit.com/r/CombatFootage/search?q=haiti&restrict_sr=on&include_over_18=on&sort=relevance&t=all)\n* [YouTube, Haiti](https://www.youtube.com/results?search_query=haiti+)\n\nAfghanistan\n\n* r/Afghanistan\n* Afghanistan wiki: [\"Second Taliban Era\"](https://en.wikipedia.org/wiki/Afghanistan#Second_Taliban_era)\n* [AP News, Afghanistan](https://apnews.com/hub/afghanistan)\n* [BBC news, Aghanistan](https://www.bbc.com/news/topics/c8nq32jw5r5t)\n* [liveuamap, Afganistan](https://afghanistan.liveuamap.com/)\n* r/CombatFootage subreddit search: [Afghanistan](https://www.reddit.com/r/CombatFootage/search?q=afghanistan&restrict_sr=on&include_over_18=on&sort=new&t=year)\n\nBurkina Faso\n\n* r/BurkinaFaso\n* Burkina Faso wiki:[Violence in the Sahel region](https://en.wikipedia.org/wiki/Sahel#Instability_and_violence)\n* [AP News, Burkina Faso](https://apnews.com/hub/burkina-faso)\n* [BBC News, Burkina Faso](https://www.africanews.com/country/burkina-faso/)\n* [liveuamap, Sahel](https://sahel.liveuamap.com/)\n* r/CombatFootage subreddit search: [Burkina Faso](https://www.reddit.com/r/CombatFootage/search?q=burkina+faso&restrict_sr=on&include_over_18=on&sort=relevance&t=all)\n\nMali\n\n* r/Mali\n* [Mali War wiki](https://en.wikipedia.org/wiki/Mali_War)\n* [AP News, Mali](https://apnews.com/hub/mali)\n* [News24, Mali](https://www.news24.com/Tags/Places/mali)\n* [liveuamap, Sahel](https://sahel.liveuamap.com/)\n* r/CombatFootage subreddit search: [Mali](https://www.reddit.com/r/CombatFootage/search?q=mali&restrict_sr=on&include_over_18=on&sort=relevance&t=all)",
        "num_comments": 1,
        "comments": [
            "Please keep the [community guidelines](https://www.reddit.com/r/CombatFootage/wiki/rule1) in mind when using the comment section.\n\nPaging u/SaveVideo bot. \n\n___\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CombatFootage) if you have any questions or concerns.*"
        ]
    },
    "82mm mortar lands extremely close to Ukrainian troops": {
        "title": "82mm mortar lands extremely close to Ukrainian troops",
        "score": 1427,
        "url": "https://v.redd.it/sp7ppbga308d1",
        "content": "",
        "num_comments": 97,
        "comments": [
            "Please keep the [community guidelines](https://www.reddit.com/r/CombatFootage/wiki/rule1) in mind when using the comment section.\n\nPaging u/SaveVideo bot. \n\n___\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CombatFootage) if you have any questions or concerns.*",
            "Close to the front, every second outside a trench or shelter could be your last, it is precisely in the movement between one position to another that most casualties occur",
            "I conduct tons of interviews with participants of the Russo-Ukrainian war. Almost 700 to date. I upload some of the longer and more interesting stories and their footage to my YouTube channel. \n\nFeel free to check it out \n\nhttps://youtube.com/@battlesandbeerswarstories?si=XeTNpjWQpZDZJ_pq",
            "hey it's cool seeing you pop up in here, I'm a subscriber of your youtube channel it's great you've been documenting on the ground first hand accounts of the war. you and the war archive youtube channel are lifting the fog of war and providing more context to the combat/drone footage we see daily, the news reports are pretty sanitized almost like WW2 era news. \n\nI just recently finished your \"the first 150 days\" novel as well. i'm surprised no one really seems to know about that book because it's pretty good",
            "Praying that everyone got out safe",
            "Crazy running into you here, man. I’ve been following you on Instagram for a while! Well I guess it’s not that crazy if you think about it… it actually makes total sense lol",
            "Did the guy infront get hit?",
            "The guy in front on the right might’ve not made it",
            "Hope the guy in front of the explosion made it. He fell very awkwardly",
            "Man, that looked really small for an 82. I wonder if they’re using non-Russian mortar systems because I have a hard time believing that was a modern day 82.",
            "It's pretty notable how clean their trench is compared to the Russian trenches we see on this sub",
            "They for sure all got injured right there,  don’t know the severity of their injuries but I wouldn’t be surprised in one or two people died from that mortar",
            "The noise it makes before it hits the ground is crazy.",
            "Anyone know more context to this footage?",
            "So how many were KIA or WIA?",
            "And how would anyone know that was a \"82mm mortar\" ????",
            "The explosion was quite small akin to a drone dropped VOG-30",
            "luckily the fragmentation of Russian projectiles are worse than what the west produces.",
            "Going to and from positions is extremely dangerous 100%",
            "Every time they go ontop of the trench in these videos, my heart beat tends to raise… imagine irl man.. i feel what u commented",
            "One of the things they hammer to your head in basic training is to never have complacency or carelesness\n\nSaid this once in this sub and got heavily downvoted",
            ">I conduct tons of interviews with participants of the Russo-Ukrainian war. Almost 700 to date.\n\nAre you intending to publish those somewhere? As oral history? Articles? Books?",
            "Great channel! Finally someone who tries to cover the war from both sides.",
            "Thanks bro",
            "Just checked you out mate, love it. Subbed!",
            "You got a means for supporting? Post that!",
            "Hey man, love your work. Are you planning on uploading the audio from these to Spotify at any point?",
            "I subscribe to you on YT 🤘",
            "Subscribed",
            "I love your channel. My only complaint is there should be more uploads!",
            "take a backup of  your channel, either in peertube, vimeo, dailymotion or whichever platform is comfortable. Evil web is full of propaganda predators so dont any chances and keep up with your work!",
            "Thanks my friend. I try my best to show war for what it is, and to help people understand what it’s like to be there. A lot of the people who have stories in that book are dead now.",
            "Honestly I slowed it frame by frame and was surprised by how little shrapnel evidence I could find. Nothing hitting trees, no big dust ups, only the closest guy seems to get hit by the concussion hard enough to get knocked down. He potentially got shrapnel. Probably NK shells lol",
            "They’re already dead",
            "Consumers of media like this tend to congregate in specific areas on the internet! Haha thanks for the follow and for the support bro",
            "Possibly - probably - won’t know for sure until I interview the cameraman this weekend",
            "Maybe he didn't get hit but his ears might be ringing",
            "Tbh, I'm not sure how anyone knows it's an 82mm mortar, but if it is then given we've seen Russia reactivating tanks from the 1950s, it's very possible it's not a modern day 82.",
            "Dirty trenches are a direct consequence of poor discipline. FPV drone operators look for trash around trenches and tree strips because where you find trash, you find soldiers just standing around. Both sides are making an effort to keep their areas clean to avoid these encounters.",
            "Ludicrous statement",
            "In the trench isn't much better with the proliferation of drones.",
            "Neat",
            "I’ve published one book already about the first 150 days of the war - I’ve been interviewing at such a pace since then I haven’t had time to work on any other books",
            "Thanks man. I have my biases and beliefs but I try as hard as I can to keep it out of my work. I hope my content reflects that",
            "No problem man",
            "It's a very sandy area. You see it in the trench and those kinds of trees grow on sandy soil. The needles from the trees rot slowly and accumulate into a thick layer on top of the sand. This means the shell exploded so deep that nearly all fragments going outwards were stopped.",
            "I dont know about mortal shells but 152 mm soviet  shell produce a lot less shrapnel than you would expect compared to 155 mm nato shells \nSo I think it is just a difference in design rather than the shells being faulty",
            "They’re not Russian",
            "[lmao](https://www.reddit.com/r/rule34disney/s/UhKWfz0FIL)",
            "Nuh uh",
            "Looks like most of them probably took shrapnel.  It looks like you can see dust kicking off the legs of the guy being carried and the guy to his right when it hit. Also, the guy in front on the right dropped like a rock. Not at all like the one behind him who deliberately took cover.",
            "Let us know how they turned out. Best wishes to all involved.",
            "That 100% causes casualties. That was not a small explosion if they didn’t catch shrapnel the concussion messed them up.",
            "This is interesting to know. What else are drone operators looking for as identifiers for targets?",
            "> Both sides are making an effort to keep their areas clean\n\nI can count on 1 hand the number of clean Russian trenches I've seen on this sub or others.",
            "If Russian yes, If Ukrainian not so much? Are the Russians as effective with drones?",
            "There is no escaping bias. Admitting one has them is the first step to staying 100 miles ahead of most other people.",
            "The last thing you want is to leave a hole in documentation for historians. Catalogue everything",
            "thanks for this.",
            "Deleted the message lmao     \nWhat did it say?",
            "Yah huh",
            "Concussion isn’t really a concern, and shrapnel may as well be a roll of the dice. I wouldn’t be surprised if none of them got hit, or if all of them were injured. Shrapnel is mostly RNG.",
            "Agreed. This is an accurate statement. Sand might have gobbled up the shrapnel but the blast wave still hit them. They all have a really bad headache at the very least. The guy in the front took some serious concussive force to the face. Orbitals and frontal sinuses don’t protect the brain from a blast related concussion. \n\nYou’re getting downvoted for your previous comments.",
            "yes russians are effective with drones",
            "Underestimating your enemy is always bad idea",
            "> Are the Russians as effective with drones\n\nyes very.",
            "Make no mistake, both sides are getting fucked up by drones.",
            "Incredibly so.",
            "[read the rest of their comments on this post, but they were basically insulting this person’s appearance… check the sub though lol](https://www.reddit.com/r/rule34disney/s/NrocAxi9uW)",
            "Nuh uh x1000",
            "> Concussion isn’t really a concern\n\nconcussion force dissipates rapidly compared the range of shrapnel a la the inverse-square (inverse-cube) law, but it can still be pretty nasty when you're close enough to get hit.  couple of those dudes might just be close enough to get their bell rung pretty hard, assuming the fragments didn't mess them up worse. \n\n> and shrapnel may as well be a roll of the dice.\n\nmodern, reasonably well crafted munitions have a very predictable shrapnel pattern.  there are definitely factors that can save your ass, but given Soviet/Chinese 81mm rounds have a ~25m casualty causing radius, it's entirely likely that most or all of those guys (call it 4 of the 6) are casualties / 200.",
            ">Concussion isn’t really a concern,\n\nSaid no one ever",
            "\"Shrapnel is mostly RNG.\" good title for a sophisticated war computer game.",
            "Concussion is a major concern.\nI’m guessing you’re not a veteran. In Iraq I saw concussion make people blind and deaf",
            "Jesus fuck i lost half my living braincells from the post and its comments",
            "Yeah concussion can be nasty, if you’re close enough. But if you’re close enough for that, you’re probably already ground beef from the shrapnel anyways. Also depends on the explosive, if it’s thermobaric or something, that’s different. But in this scenario, I think 99% of the concern is with shrapnel.",
            "Said anyone who knows anything about explosives ever. I’d rather take concussive forces than straight up shrapnel any day of the week.",
            "Yeah and they’d be far worse off if they took shrapnel. Concussive forces ain’t shit compared to catching a chunk of metal, especially in an explosion this small. \n\nYou clearly don’t have to be brilliant to be a veteran.",
            "Well it’s real easy to stitch wounds. Obviously a lethal wound from shrapnel is not what that guy is talking about. But you can’t really heal from brain damage.",
            "They aren’t taking brain damage from a blast this small at that distance. Unless there’s shrapnel involved.",
            "Is that from your personal experience or medical expertise? Because the concussive force repeatedly on the brain causes brain damage.",
            "Yeah I’m not saying it doesn’t chief. I’m just saying that compared to taking a hot lump of shrapnel to the face, a simple concussive shock wave (in this particular scenario) is hardly a concern. \n\nIf you’re close enough and it’s the right kind of explosive, yeah, you can absolutely die from the concussive force alone. In this instance, they were not close enough and it’s not a thermobaric warhead or something crazy like that. It also appears most of the explosion happened under the soil surface, which is great news for the soldiers. \n\nAn explosive shockwave loses energy exponentially from its source, which is the whole reason they make the thing fragment (and turn into shrapnel). Without shrapnel, you have to be ridiculously close to the explosion source to be mortally injured."
        ]
    },
    "Accurate SPG-9 fire eliminates 2 Russian soldiers located at Orlova Street, Vovchansk, Kharkiv Region.": {
        "title": "Accurate SPG-9 fire eliminates 2 Russian soldiers located at Orlova Street, Vovchansk, Kharkiv Region.",
        "score": 294,
        "url": "https://v.redd.it/pdgd621pe28d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Please keep the [community guidelines](https://www.reddit.com/r/CombatFootage/wiki/rule1) in mind when using the comment section.\n\nPaging u/SaveVideo bot. \n\n___\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CombatFootage) if you have any questions or concerns.*",
            "They came, they saw, they died. No Lada sedan for them.",
            "BTW Ukraine [started producing 73mm rounds](https://x.com/PavelCiaian/status/1802819946252308541) used by SPG-9 (and BMP-1).",
            "Doubt that's an SPG9. Too big bada boom for it. Probably just regular artillery.",
            "What is that number 200 represents?",
            "No, but they sacrificed so that their families could have a Lada. Or a bucket each of carrots and onions. It seems to differ widely.",
            "300 is Russian (Soviet) code for injured, 200 is dead. More specifically cargo 300 and cargo 200 (needs to be transported).",
            "Got it, thank you!"
        ]
    },
    "Zala reconnaissance drone shot down in the Kharkiv region by the Strela 10 short range air defense. Crew belonging to the Anti-Aircraft Company of the 36th Marine Brigade": {
        "title": "Zala reconnaissance drone shot down in the Kharkiv region by the Strela 10 short range air defense. Crew belonging to the Anti-Aircraft Company of the 36th Marine Brigade",
        "score": 58,
        "url": "https://v.redd.it/rr0peslx148d1",
        "content": "Does anyone know the production rate for these observation drones?  The Russians really seem to be losing a pretty high amount of them this month",
        "num_comments": 10,
        "comments": [
            "Please keep the [community guidelines](https://www.reddit.com/r/CombatFootage/wiki/rule1) in mind when using the comment section.\n\nPaging u/SaveVideo bot. \n\n___\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CombatFootage) if you have any questions or concerns.*",
            "Blyat!",
            "Published June 21, 2024 on their Facebook page: \nhttps://www.facebook.com/share/dCduKtKscxMJCirk/?mibextid=qi2Omg",
            "Sci fi ass noises lol",
            "Exactly the reaction of the Russian operator",
            "The whining noise is caused by the missile gyroscope spinning up to operational speed.",
            "Looks like a StarWars sound",
            "Thanks that's really cool"
        ]
    }
}