{
    "thirsting over underage anime girls": {
        "title": "thirsting over underage anime girls",
        "score": 236,
        "url": "https://i.redd.it/8guqejfl618d1.jpeg",
        "content": "",
        "num_comments": 52,
        "comments": [
            "Was she wearing a bomb vest?!",
            "OPs first day on the internet",
            "Not to be that guy or anything but there’s nothing indicating the anime girl is underage because this image is based on the landlord from Smiling Friends… who’s very much not a minor",
            "Check that mf's computer",
            "He sorta looks like yandere dev…",
            "Won’t someone think about the anime characters!?   /s",
            "If I could make one request in anime, it would be that everyone is aged up 5 years. Things would be so much better if these High School freshmen were college Sophomores.",
            "What’s weirder, the dude thirsting over a very oversexualized drawing with an implied age, or the artist who made a sexualized drawing of a child?",
            "That hard drive is going to be incinerated clean.",
            "I don’t know if any of you guys dwelled in Japan but the material for adult and anime is very questionable and has often been.\nI believe it comes from the surface and socially of Japanese society that the person you say on the surface may not be the behavior they mirror in private.\nBecause their culture has always promoted and enforced a general look and demeanor while in public and some of the population find themselves wearing masks to survive.\nI do believe that that one guy was revealing too much and if an incident or misunderstanding occurs later on for him that same comment maybe used for confirmation of intent.",
            "Oh my god is this guy like an anime artist?? I swear this guy approached me and asked to draw me at a Best Buy, said he was an artist and when I checked his IG it was all hentai stuff 😭",
            "She's threatening to blow up the city unless he joins her in smoking weed, filling their bellies with diet soda, and playing Burnout Revenge for the PS2.",
            "Wait until they find out about [Rule 34](https://www.urbandictionary.com/define.php?term=Rule%2034)!\n\n\nMetaphysical question: why does Rule 34 not apply to itself?",
            "And isnt the anime girl also like, not wearing any pants?",
            "This is based off of“don’t toy with me, miss nagatoro”. She’s in high school.",
            "That’s Nagatoro. She’s a teenager. From a manga that often sexualizes her despite her being a child. Y’know, typical anime/manga stuff.",
            ">Not to be that guy or anything but there’s nothing indicating the anime girl is underage\n\nshe looks like a minor, and also is literally the character nagatoro from Don't toy with me, miss nagatoro, who is a child",
            "I've met YandereDev before... Genuinely awful person :/",
            "both",
            "The artist is both, so double whammy?",
            ".... Don't do drugs, kids.",
            "the whole plan costed her 750 THOUSAND dollars",
            "peee-ESSSH-toooo",
            "Some people have got to be such drama queens...",
            "This comment made me smile, friend",
            "The landlord wasn't wearing pants either",
            "oh",
            "Oh the classic \"don't toy with me, miss nagatoro\". Weird how everyone didn't immediately recognize that .",
            "Surely teenagers never talk, think, or do sexual things. Definitely not. That would be very unrealistic for teenagers.",
            "I DIDNT KNOW ABOUT THE ANIME IT WAS BASED OFF OF I THOUGHT THEY WERE OC 😭",
            "sorry you got downvoted for pointing out facts",
            "She's an anime character aka not real. Can you cry harder?",
            "She's an anime character aka not real. Can you cry harder?",
            "did you guys kiss",
            "Honestly, it’s all good. This series gets questionable real quick with the “bullying” nagatoro does. I like slice of life stuff sometimes, but yeah…lol",
            "I like how *that* was your response to me pointing out  how common it is with manga/anime to have grown adults drawing children in a sexualized manner.",
            "\"Teens engage in sexual conduct. So its okay to consume sexual content involving teens\" least pedophilic FFXIV player",
            "Just to fuck with you some more she’s 15/16 and the manga has some interesting panels.\n\nhttps://preview.redd.it/1kef2sw4m18d1.jpeg?width=1080&format=pjpg&auto=webp&s=6dbfd42da35e8658db70aab4789da713c241301b",
            "r/redditmoment",
            "i literally just pointed out that she's a child\n\n&#x200B;\n\nwhat crying is taking place\n\npedophiles are the fucking weirdest, man",
            "yeah this I’m not shocked about",
            "What the fuck is thag why does it look like hands thisbis making me severely uncomfortable",
            "\"it's Japan so it's alright 👍\"",
            "She's an anime character. Yall cant tell the diffrence between fiction and real life and then cry about the other side being pedos lmao. Almost deflecting",
            "You mean to say you're not.. **socked** about that, right?",
            "Not much of a senpai mate.",
            "But the character is a child...",
            "https://preview.redd.it/63tvb3prz28d1.jpeg?width=1170&format=pjpg&auto=webp&s=209b7c2d5ce843eb3acc95a6ab4223f55a2dbe5c",
            "https://preview.redd.it/lhtt7har338d1.jpeg?width=209&format=pjpg&auto=webp&s=6dcf9bccf4835d42169fa0ed4e9020a4678db707"
        ]
    },
    "\"Move halfway around the world so I can manage your OF\"": {
        "title": "\"Move halfway around the world so I can manage your OF\"",
        "score": 58,
        "url": "https://i.redd.it/tu4qjvi2y08d1.jpeg",
        "content": "\"Move 3000 miles away in my apartment and I'll manage your OF ;))))))\"\n\nThis guy's post history is always about \"to get a girl you gotta be a rich crypto bro and she's gonna share him with 4 other girls\". His whole post history is so cringe.",
        "num_comments": 13,
        "comments": [
            "I mean, what could go wrong? Name 47 things.\n\nYou can't.",
            "LA to Michigan is halfway round the world?\n\nr/ShitAmericansSay",
            "Of course an American would think 3600kms is halfway around the world",
            "He’s got it all planned out it really is the best thing for her.",
            "You gotta shoot your shot 🤡",
            "47 stabs",
            "Why always 47?",
            "Aktually, LA to Michigan is 1915 miles and the US is 2800 miles east to west, so it's actually more than half way, smarty pants.",
            "Ong, who cares? Shut the fuck up.",
            "\"How can I use this as an opportunity to dunk on Americans?\"\n\n-Every insufferable European on Reddit.",
            "Nah, stab nr 23 was quite alright. Not great, but alright.",
            "Cannot tell if you’re joking",
            "Other continents speak English and can hang shit on you just as well."
        ]
    },
    "I had to read this so you have to now": {
        "title": "I had to read this so you have to now",
        "score": 686,
        "url": "https://i.redd.it/r70si8ipir7d1.jpeg",
        "content": "",
        "num_comments": 106,
        "comments": [
            "Definitely written by some dude.",
            "https://preview.redd.it/n7bw21vlmu7d1.jpeg?width=720&format=pjpg&auto=webp&s=489498684987e87a77a46671c8aff60adbce15fc",
            "https://preview.redd.it/s2dpqr53nu7d1.jpeg?width=1290&format=pjpg&auto=webp&s=2336adc691cc114e3ce6bcd38e1a03c1dc8fbe96",
            "What a terrible day to have eyes.",
            "![gif](giphy|DBa308wq8XTMs|downsized)",
            "That. Is. Foul.",
            "That was definitely not how I expected that post to end",
            "I didn’t want this ice cream anyway..",
            "![gif](giphy|AAsj7jdrHjtp6)",
            "![gif](giphy|3o72F110wep22ahyj6|downsized)",
            "30% cringe, 100% gross.",
            "Well, see you tomorrow, Reddit. That’s enough for today.",
            "You do you girl. Smegma princess it is.",
            "Well, now I don't need to decide what to have for dinner.  I won't be eating again any time soon.",
            "Learning to read was a mistake.",
            "[🤮](https://giphy.com/clips/hamlet-dumb-and-dumber-grossed-out-gagging-ttx2jTW1ubblzFjwPr)",
            "I hate everything about this.",
            "![gif](giphy|VS3zCR5S6frDW)",
            "![gif](giphy|4baoNZ5Qo8dX2)",
            "![gif](giphy|VW1WrVuSeyI2dcmU0w|downsized)",
            "how can you have the wherewithal to initial-capitalize sentences but not to use periods?",
            "Probably the girlfriend of that dude who was asking if he was an asshole for saying his girlfriends breath stinks",
            "I wish I was illiterate.",
            "Take that back.",
            "How do you re-blur a picture once you un-blur it in the reddit app?",
            "I almost downvoted you for this!! This if true is disgusting why wouldn’t he shower and wash himself??",
            "....***yellow?***",
            "https://preview.redd.it/201le2cccx7d1.jpeg?width=1023&format=pjpg&auto=webp&s=63dd8b9fc5f5e5d419d3917a98751c920b99a468",
            "https://preview.redd.it/g7w8pbkpey7d1.jpeg?width=720&format=pjpg&auto=webp&s=1e71dea083adfe20995527f0de9c4ff40f3be79c",
            "https://preview.redd.it/j0t8fkmfsz7d1.jpeg?width=1004&format=pjpg&auto=webp&s=ae4b271bc785cfbe885fae2c4403f253df36decf",
            "![gif](giphy|l0HFiOE67Yq8okh5C|downsized)",
            "I mean, this isn’t cringe. It’s just fucking gross.  \nAnd I’m going to spend the rest of the day cursing my mum for teaching me how to read!!!",
            "Bro no chance that was actually written by a woman.",
            "No.",
            "They licks the what from his d?",
            "Omfg.... Am I all of a sudden happy being circumcised",
            "Yuck, yuck, barf",
            "I vomited a little.",
            "My brother in christ, I am sat here eating",
            "I don't agree with this friend ✅",
            "I don't agree with your friend",
            "This makes me want to have a second circumcision.",
            "https://preview.redd.it/gudn1effh18d1.jpeg?width=1170&format=pjpg&auto=webp&s=3a4f49e7897f7fca38cef43e33d57687d350b779",
            "I was eating 😭",
            "Yikes!",
            "I don't agree with your friend",
            "https://preview.redd.it/p6kay7f4vw7d1.jpeg?width=960&format=pjpg&auto=webp&s=37d6ec1390c6607d48eba696928475dc01a35abc",
            "Ahhh yes, the old acorn cheese.",
            "And off I go to have my eyes changed.",
            "His flight is extremely long…like a week I guess.",
            "Smegma alert",
            "As an appreciation for your content contributions to this community, you have been rewarded the following community currency rewards. \n\n 💱[Learn more about Community Currency!](https://www.reddit.com/r/communitycurrency/comments/1cz88xg/community_currency_empower_your_community/)💱\n\n😬 2440.00 [YIKES](https://reddit.com/r/cringepics)",
            "I only had to read it until I stopped, which was less than halfway in, so I win.",
            "https://preview.redd.it/ccwpwgjxsy7d1.jpeg?width=750&format=pjpg&auto=webp&s=19087c5e74ec4648bbffa849b8c994f654a26392",
            "https://preview.redd.it/vmirc2hyzy7d1.jpeg?width=1290&format=pjpg&auto=webp&s=348787ae6ae43580f846d5978ed6f3d26924b03f",
            "Wait, does this man not shower before his flight? Is a, say, 8 hour flight enough for that much buildup below the belt?? I figured it takes a couple of days or so before a man seriously has to consider showering.",
            "what was that meme/twitter thing going around for a while? none of those words are in the bible ?",
            "Real or not, who the fuck would tell their friends that? Is that a normal conversation topic?",
            "Cheesus.",
            "I *was* eating before I read this.",
            "Are we allowed to ask which sub this is? Because I feel pretty strongly about my vote against this practice.",
            "https://preview.redd.it/idiq6mhog08d1.jpeg?width=610&format=pjpg&auto=webp&s=4aac5c5487981d4f13adf5cfba64646f30882ea1",
            "![gif](giphy|11ahZZugJHrdLO)",
            "A guy wrote this as his little fantasy. Sounds like a high schooler. Gross.",
            "https://i.redd.it/p7dub8zjn18d1.gif",
            "You sir… are no gentleman",
            "Jesus. How long is the flight? I would have to skip several days worth of showers in order to get this rancid.",
            "Shouldn't the average uncircumcised male be able to take an airplane flight for a few hours and not grow dick cheese in that amount of time? This sounds more like gonorrhea or something???????????",
            "Do all uncircumcised men have this problem?",
            "Meh. \n\nFor the internet, this is very tame and vanilla.",
            "Also didn’t really happen.",
            "With a smegma kink?\n\nI didn't know it was a thing and I wish I didn't.",
            "https://preview.redd.it/pqjuo6a4cx7d1.jpeg?width=1290&format=pjpg&auto=webp&s=938a767dc9f9e569ef8657c1343eec9b163bae91",
            "r/eyebleach \nI need that now, maybe so do you",
            "!tip 100",
            "I saw the gif and thought he was gonna unzip his pants lmao",
            "Cheese on a cracker",
            "Smegma Princess! New band name, I call it!",
            "Queen Duckbutter.",
            "Maybe some cottage cheese?",
            ">how can you have the wherewithal to initial-capitalize sentences but not to use periods?\n\n\n\nH*",
            "Put your phone in the microwave and set it to nine minutes.",
            "Only the unhygienic ones who never clean their dick.",
            "No",
            "Well, obviously",
            "You don't think he loves his boyfriend's smegma? Bit of a pessimist.",
            "I'm pretty sure it qualifies as mental illness in this specific case.",
            "True story, I didn't know this was a thing until I dated one of the crazy hot ones (crazy like borderline personality disorder off her meds), and she let's this slip.. followed by \"Once you really know, you'll stop showering.\" ...needless to say, the relationship didn't last long enough for me to even consider trying that, but it admittedly ended for other reasons. (I would have crawled through sewers for that woman.)",
            "i don't want to google it can someone just give me a brief description of a smegma?",
            "I think it's rule 43.",
            "I’m sorry Jesus 😣",
            "Lmfao",
            "!tip 0.000000000000000000003 yikes",
            "Yaas !!",
            "Flan?",
            "Even my 11year old son has mastered keeping on top of personal hygiene. This is nasty on many levels.",
            "No one likes smegma",
            "Im so confused by this",
            "Dick cheese",
            "Cheesecake or Philly cheese on toast?\n\nI'm glad dinner was two hours ago honestly.",
            "glad i didn't google that. 🙃"
        ]
    },
    "🤮": {
        "title": "🤮",
        "score": 822,
        "url": "https://i.redd.it/nrxonod0aj7d1.jpeg",
        "content": "",
        "num_comments": 133,
        "comments": [
            "“I'm saying I did an ocular assessment of the situation, garnered that he was not a security risk and I cleared him for passage.”",
            "[https://www.tigerdroppings.com/rant/politics/nazi-radio-host-nick-fuentes-accidentally-streams-himself-watching-gay-porn/113399893/](https://www.tigerdroppings.com/rant/politics/nazi-radio-host-nick-fuentes-accidentally-streams-himself-watching-gay-porn/113399893/)\n\nhttps://preview.redd.it/894u8z45kl7d1.jpeg?width=2360&format=pjpg&auto=webp&s=8e0f6a70f03769eebffc0c61ea8fb35fbd968ae7\n\nEdit- Not that there’s anything wrong with that.   Unless you’re a dirty disgusting homophobe, like Nick.",
            "Looks like the All-Star team of school shooters.",
            "Dylan and the Klebolds.",
            "Who?",
            "I reckon if they all switched their clothes around at least one of them could have an outfit that fit",
            "I see five people that couldn't bust a nut in a whorehouse.",
            "Looks like a boy band that just released an “edgy” album.",
            "Glad they’re keeping his maidenhood safe.",
            "How convenient. I think you don't have to pay teenager the regular salary, right? Pretty clever.",
            "There isn't 100lbs of combined weight between all of them. They'll be securing their graves if they actually get into a fight",
            "![gif](giphy|fpDIo3Rjir1GE|downsized)",
            "Last dudes height is all in his neck",
            "![gif](giphy|26n6Gx9moCgs1pUuk)",
            "Who are these JC Penny twinks supposed to be stopping?",
            "I’m sure any wet paper bags they come across are quaking in their boots. It could win a fight with two or three of these guys, but four is a stretch.",
            "One dude rocking the “I masturbate in public trench coat”",
            "Jehova’s Witless",
            "That’s a weird way to spell harem",
            "\"bodyguards\" 😉 sure thing bud.",
            "These guys look like a 1980's synth pop band posing for their latest album.",
            "Is that Devo? Nobody in this pic has thrown a punch in their life",
            "I could beat the fuck out of every single one of them at the same time",
            "Look I'm a woman, I don't weigh much, and I still think my odds are pretty high in a fight.",
            "Lol. They look like extras in a Pet Shop Boys video.",
            "Why do I feel like I could cripple this entire detail by simply showing them a boob?",
            "Ocular pat down complete",
            "#***\"It's the smell...Mr. Anderson...the stink of it!\"***",
            "Crosspost to r/thesquadonpoint",
            "Mall Ninja Top Flight Security Services “When we Naruto run they won’t even see us.”",
            "I think my goldendoodle can take them all.",
            "Even got the it guy on lookout",
            "You know those posts on r/blunderyears of teens that had a pic of their ‘band’s album art before they attempted to write a song? Thats this.",
            "Why is his security The 1975?",
            "I'm pretty sure I could throw any of those security guys across the room without effort",
            "They look like a bad Depeche Mode cover band",
            "Tell a bunch of 15 year olds to dress like bodyguards....",
            "His security is 1980’s Depeche Mode?",
            "That team looks like they use mall weapons as defense.",
            "Neo, Neo, Neo and *The One*.",
            "They look like Depeche Mode and their friend, Geoff",
            "That guy in the trench coat better have an MP5 under there.",
            "These bodyguards are just wondering where their bus is",
            "If they're going for the Peaky Blinder's look, they missed the mark a touch",
            "$10 says they turn off the lights in Nick’s mom’s basement when they get back from whatever Klan rally he’s at and play Twister wearing only a slathering of butter because they’re all Sigma manly men",
            "But why male models?",
            "JP from Grandma's Boy is a member",
            "“Uniform? Just dress like a bodyguard!”\n\nAll four of these kids - “I hear you loud and clear”",
            "They look like wannabe Gestapo",
            "This looks like the cover on a Christian rock band.",
            "Looks like a Duran Duran tribute band",
            "Lines up perfectly with the new season of The Boys lmao",
            "A group of guys who have never met a piece of clothing that fits right",
            "How many scatter?",
            "Is that a Duran Duran cover band cover band?",
            "Looks like a shitty album cover from the 80's",
            "One spin kick would take em all out",
            "Somebody didn’t drink their milk",
            "\"Suri, play Baggy Trousers by Madness.\"\n\n![gif](giphy|7bjWqT9KNMAIU)",
            "Looks like a 4chan meetup to me",
            "Sioux Falls’ greatest The Killers tribute act!",
            "Looks like an Interpol cover band",
            "i hate how pricks like them ruined trench coats",
            "It’s just not that hard to buy a suit that fits.",
            "Security team from drama class",
            "As an appreciation for your content contributions to this community, you have been rewarded the following community currency rewards. \n\n 💱[Learn more about Community Currency!](https://www.reddit.com/r/communitycurrency/comments/1cz88xg/community_currency_empower_your_community/)💱\n\n😬 3475.00 [YIKES](https://reddit.com/r/cringepics)",
            "Isnt he that gay guy",
            "Looks like a boy band",
            "What Serbian boy-band is this?",
            "the dude on the left in sunglasses is gonna take over the marching band and lead them into a dead-end alley!",
            "Failed school shooters",
            "Looks like a 90’s boy band",
            "The Strokes",
            "It has haunted me daily knowing there is a non zero chance that dweebs like this are about to walk this country directly into fascism. Just the cringiest and most baby-brain people screeching their way to success",
            "He pays them in butterfly kisses.",
            "they look like a slightly inbred mix of the Smiths and New Order",
            "Waiting for JP from Grandma’s Boy to hide against a black wall with his leather duster like “How did they see me!?”",
            "Cameron Frye army.",
            "🤮",
            "If the whole lot jumped into the ocean naked….their dicks still wouldn’t get wet. One of my farts could disable the WHole crew. Anything more than harsh language is gonna cripple em for life.",
            "Looks like a batch of rejected and divorced dads",
            "Bruh who even is Nick Fuentes a literal nobody is breaking about his security",
            "Actual Badasses would be busy saving the world instead of working as security for someone.",
            "Ah ok cheers buddy",
            "isn't nick fuentes a csa?",
            "Who?",
            "What? Who? I’m assuming this is politics. Please keep politics out of this sub.",
            "These 'bodyguards' are closer to the kids Mac & Charlie beat up in that one epi than any IRL bodyguards",
            "How exactly do you view yourself, within the context of our group?",
            "You cleared him?!",
            "More like the F team",
            "I believe I can make out two possible pistols. At least one of them is almost certainly unarmed. I'd need a better look at the guy in the flowy trench coat to tell, but he looks unarmed as well. I'm kind of surprised tbh. These are right-wing folks after all.\n\nFor those that are wondering btw, guy on the right is printing on HIS left shoulder, and leather jacket guys is printing on HIS right hip.",
            "It's always sunny....mac and charlie",
            "Some asshole who made his own version of CPAC, because CPAC wasn't conservative enough. Basically full mask-off fascist, as opposed to those who sort of pretend not to be.",
            "Nazi POS that you’re better off not knowing, full stop.",
            "Nick Fuentes. He’s a civil rights icon and talk show host. Check him out on Rumble.",
            "Couldn't bust a nut at a peanut factory",
            "It’s their emo phase.",
            "It looks like a New Wave band from 1982.",
            "Connect four",
            "They are all absolutely packing firearms. Duster bro probably has a sub machine gun. These are the kinda edge lord nazi’s that are just LOOKING for an excuse to shoot somebody.",
            "My first thought too. Who let these dorks out of the Matrix?",
            "I came here to make a Grandma’s Boy reference too. I knewww someone would have seen it and beaten me. Well done.",
            "They're preventing (female) groupies for bothering the boss man.",
            "Their so pathetic, I think your odds of winning would actually increase the more of them there are!",
            "Hey! Devo is awesome! These clowns...not so much.",
            "Pretty sure the blond looking off to the left is a Master of the Sword, who has stayed at home perfecting his blade technique while you were out meeting “females” and having “normal human interactions”.",
            "I'm out of shape, and I walk with a cane. I think my chances are pretty good, and I'll give them the damn cane.",
            "I’m also a small woman, with twiggy wrists. Imagine if we got together! We could absolutely destroy these dorks.",
            "Are you serious? I just..... told you!",
            "Why would assume it politics?\n\nEspecially if you “what? Who?”  Don’t know who this is?",
            "Calm down, Nick.",
            "The sheriff of Paddy’s..",
            "I thought Mac cleared him!?",
            "No, you *should* know people like that. They have an influence on what others do and how others vote, and if you want to oppose people like him, knowing about them is the first step.",
            "Oh right, the dude who tried to deny he was watching gay porn even though there was a visible tab on his screen.",
            ">Check him out on Rumble.\n\n*How bout no*",
            "Why would anyone who isn’t an incel virgin do a thing like that?",
            "Correct, because they are legumes!",
            "Ha, yes,I repeat, they'll be securing their graves if they get into a fight. They are just as likely to get shot by someone if they escalate a situation into using guns.   \n  \nThey either keep it at the level of pushing/shoving/physical strikes, or since even they know they probably can't fight, they can be like that security guard meme and end up dead because guns were brandished.",
            "It’s just so perfect. Like right down to his personality and sense of self.",
            "I don’t know man, these guys look like they know Tekken.",
            "Oh forgot about that. His Twink Squad makes even more sense now.",
            "He’s known as the Rosa parks of the 2020s.",
            "Yeah. My fear is that they will skip the pushing/shoving and brandishing phase and just start shooting.",
            "The Ambiguously Gay Quartet",
            "That’s a lol or perhaps even a lmao.",
            "Genuinely can't tell if you're trolling.",
            "That's in the running for the funniest comment I've ever seen on Reddit.",
            "Who calls him that?",
            "I don't even know who he is but just from this post I'd say ROFLMAO is the best one for his comment",
            "I'm not sure it makes a difference"
        ]
    },
    "\"I have rizz\" (The Rizz)": {
        "title": "\"I have rizz\" (The Rizz)",
        "score": 0,
        "url": "https://www.reddit.com/gallery/1dl5t2q",
        "content": "Walmart Chris Pratt coming after your girl 😱",
        "num_comments": 6,
        "comments": [
            "New account and already reposting lol..",
            "Does making fun of what others look like distract you from your own insecurities?",
            "That guy has more rizz than anyone who’d  make fun of him."
        ]
    }
}