{
    "[Topic][Open] Open Discussion Thread — Anybody can post a general visualization question or start a fresh discussion!": {
        "title": "[Topic][Open] Open Discussion Thread — Anybody can post a general visualization question or start a fresh discussion!",
        "score": 0,
        "url": "https://www.reddit.com/r/dataisbeautiful/comments/1d5lerv/topicopen_open_discussion_thread_anybody_can_post/",
        "content": "Anybody can post a question related to data visualization or discussion in the monthly topical threads. **Meta questions are fine too,** but if you want a more direct line to the mods, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful.)\n\nIf you have a general question you need answered, or a discussion you'd like to start, feel free to make a top-level comment.\n\n**Beginners are encouraged to ask basic questions**, so please be patient responding to people who might not know as much as yourself.\n\n---\n\nTo view all Open Discussion threads, [click here](https://www.reddit.com/r/dataisbeautiful/search?q=author%3Aautomoderator+title%3A[Open]&sort=new&restrict_sr=on).\n\nTo view all topical threads, [click here](https://www.reddit.com/r/dataisbeautiful/search?q=author%3Aautomoderator+title%3A[Topic]&sort=new&restrict_sr=on).\n\n**Want to suggest a topic?** [Click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=[Topic]+Topic+Suggestion&message=I+have+a+topic+suggestion+for+the+monthly+threads:+).",
        "num_comments": 23,
        "comments": [
            "I just posted a 2-minute video of Hans Rosling explaining the data behind population growth using rolls of toiiet paper. I explained that I met him in 2013 when he came to the WHO in Geneva to deliver a talk and that he explained the data behind population growth using rolls of toilet paper. It was an excellent talk.\n\nThe moderators removed it and I am trying to understand why. As the post was taken down, I am asking my question here.\n\nFor reference, the video is at: [https://www.youtube.com/watch?v=dnmDc-oR9eA](https://www.youtube.com/watch?v=dnmDc-oR9eA)",
            "I have a little data set which I would like to make beautiful, and I would appreciate tips. \n\nThe data pool is about 100 items, each one being a date and numerical value from 0 to 9--if this goes well, I may break down the 0-9 values into finer granularities--I would like to set the date as an independent variable, and look at how the 0-9 value differ from a random baseline.\n\nBecause I fear this isn't going to be clear enough of an explanation for how the 0-9 value can differ from random baseline, my point is: assuming random numbers, any of the numbers from 0 to 9 would be equally likely to come up ; I would like to visualize how much more often (or less frequently) any given number comes up.\n\nAnd the thing about using the dates as an independent variable--I would like to see if the frequency of numbers coming up more often than random evolves over time.",
            "I spent hours trying to get insights from Tableau and PowerBI. The tools were too complex and not designed for marketing needs. Then I found Whatagraph. It was a relief! Whatagraph is built specifically for marketing performance monitoring and reporting. It's easy to use and gives me the insights I need to make informed decisions. I've been using Whatagraph for a while now, and it's saved me so much time and frustration.",
            "What are better ways to display US county-level (or equivalent sub-state government level) data? State data has this problem too but the variance in size between counties is much larger.\n\nI \\*hate\\* the use of US map to depict these data. The colossal counties in the western US overwhelm the small-but-far-more-populous counties east of the Mississippi. The eye is drawn to the wrong places - big areas, not the interesting data. Examples abound here and elsewhere online.\n\nA ranked list avoids the distortion-by-area, but those have the problem that there are thousands of counties, more than one duplicated name, and most aren't recognizably named (as the states and big cities are).\n\nI'm perplexed as to how best to make county-level data beautiful. Ideas?",
            "Hi, \n\nI am looking to export usage metrics that are more granular than \"you spent 20 minutes on instagram today\". What I really want is:\n\n- You opened your phone between 09:03-09:12.\n- [Bonus] You used instagram between 09:03-09:08, and youtube between 09:08-09:12.\n\n\nHere's what I've tried:\n\n- *Digital wellbeing* will not export data.\n\n- *Stayfree*, *ActionDash* &  *AppUsage - Manage/Track Usage* all give me aggregate usage (33 mins on instagram in the day, but not specific times).\n\n- *YourHour* in theory should do it but the button does not work and does not export anything.\n\n\n**I know the data exists, as all the above apps can display the data in-app. How can I export it?**",
            "Hopefully this question / comment is allowed here. \n\nI have noticed that I do not have a flair showcasing my number of submissions. Is this something I do manually? Thank you.",
            "I'm starting a personal project for my data analytics class where I am to develop a few novel questions that data can answer, then I'll spend the next 1-2 months centered around that topic/question. \n\nWhich of the following questions sound most intriguing to you and would make a good personal project? Or alternatively, what's a data-driven question you'd love to see answered? \n\n* *PokemonGO/Niantic*: Is player usage increasing or decreasing? How can we increase user retention and keep them engaged longer?\n* *Video Game Creators*: How does user spending differ between mobile and console games? How can we maximize profits based on this?\n* *Airlines*: What are the root causes of flight delays? How can we improve on-time performance in order to increase customer satisfaction?\n* *Hospitals/Doctor Office*: Can we use patient data to detect early signs of chronic diseases? What types of preventative measures can we create?\n* *Travel Agency*: Can our travel booking data predict peak travel seasons to specific destinations? How can we adjust prices based on this data to maximize profits?\n* *Fitness App Developer*: Why aren't users sticking with their workout plans? How can we help users stay motivated and achieve their fitness goals?\n* *Health/Fitness*: How does sleep quality impact my calorie expenditure?\n* *Local Governments*: Can we predict emerging religious movements or trends? How can we predict and prevent potential areas of conflict between different faiths?\n* *Local Governments*: How can social media alert us to potential public safety threats? Can we prevent these?\n* *Education and Employment*: What are the most in-demand skills for data analysts and data scientists? How can I best prepare myself for this career?\n* *University*: How can we predict our student's success? Can we create personalized learning strategies for the student?\n* *Music Streaming Service*: What are the emerging musical trends and artists that we should push/recommend to users?\n* *Environmental Science*: What are the safest/most dangerous days/times to be outside for individuals with asthma?",
            "Does anyone know where I can find a dataset of Student earning that have a breakdown by the university the student attended and the SAT score of the student, and income of the student parent ...\n\nAll i could find is :  \n1-average earning or earning range for a particular graduation year.  \n2-average or lowest SAT score for a particular graduation year.\n\nBasically I am trying to do an infographic showing the relative effect of multiple variable on futur Earning.  \nBut I need a dataset where each row have a value for each dimension not a simple summary for each dimension.\n\nDoes this dataset even exist?",
            "Can anybody recommend any digital books or sites that provide a ton of non-specific data diagrams and visualizations? Sorta like this sub but in an organized pdf or archive format.",
            "I have data that shows health status for 55 websites. It'll scale up to 100-200 at some point in the future. \n\nThe health status is either \"up\" or \"down.\" I'm happy to hear if there's a better name for it. \n\nBut I'm more interested in how to visualise the data over time. Let's say the time range is 3 hours. \n\nI tried using a line chart, but 55 lines blended together.\n\nI'm looking for a visualisation type that clearly shows each website health status over 3 hours on the same chart, and each service would have to be distinguished clearly. \n\nAny suggestions?",
            "I'm looking for this one post I saw years ago. It showed data describing how people interpret moidfies (e.g., extremely > very > fairly > quite...). It had a lot of words and each one was displayed as a distribution of ratings. I imagine it was motivated by some specific scholarly paper. Anybody got a clue?",
            "Would love some help with a visualization. I'm very interested in how I could present this information in something more compelling than a spreadsheet. My data is something like this:\n\n- There are a certain **total number of appointments** (at a hospital) in a certain period of time. Typically this is referenced as a whole number of appointments, but it's actually also 100% of the total.\n\n- Of those appointments, a certain number are **eligible for electronic check-in**. This represents a subset of the total number of appointments.\n\n- Of those, a certain number will be **successfully checked in electronically**. This represents a subset of the appointments that are eligible for electronic check-in. We often refer to this as a percentage, so \"45% of eligible appointments were checked in electronically\".\n\n- Of those, a certain number will **attempt to self-arrive electronically**. This represents a subset of the appointments that were successfully checked in electronically. We often refer to this as a percentage, so \"In 20% of the cases where the patient checked in electronically, they attempted to self-arrive electronically.\"\n\n- Of those, a certain number will **self-arrive successfully**. This represents a subset of the appointments where self-arrival was attempted. We often refer to this as a percentage, so \"In 40% of the cases where the patient attempted to self-arrive, they were successful.\"\n\nSo, I have this kind of nested set of things, and yet I can't quite figure out a compelling way to visualize this. We typically look at these things in terms of percentages, although it can be valuable to see the true values at times as well.\n\nIt's also important that I be able to visually compare this over time. For example, I'd like to be able to look at this data from June, and compare it to May.\n\nIf it matters, the core data is in Excel right now. I'm not using any fancy tools, if such exist.\n\nAny ideas would be greatly appreciated!\n\nThank you!",
            "I feel like an idiot asking this but can anyone identify the software used to create a lot of these job search charts? I want to use them for tracking my medication and symptoms (for myself not for publication) and I've been sent a few hate messages for asking how the charts are made. Please help?",
            "I have personal data on some fanfic writing I do. I'd like to organize the data into charts for hits, kudos, and chapter word length. I use Google a lot like Sheets for charts and data collecting. I was curious if anyone had any other data tools I could try, preferably for free.",
            "This is a very small sample to understand how a random variable changes over time. But, generally speaking, if 0-9 is continuous, you could use a kernel density plot and overlay different years (or have them side by side). If it’s ordinal or discrete, histogram or bar chart I guess.",
            "Is it a popular tool  for companies?",
            "Maybe like an upside down pyramid chart and for each row you could overlay two colours to show difference between may and June",
            "It actually isn't a random variable--I'm sure it will be plenty obvious once done ; in fact, I could show you the raw data, and you'd probably see it--definitely would, if you knew what you were looking for...\n\nOther than that--and thanks for the answer, mind you--I understood very little of that.\n\nIt could be histogram or bar chart... I was thinking of wrapping them around a point, 360° style, and maybe making one revolution per month (data spans about 18 months, so it would spin around a good bit.\n\nIt starts off pretty close to random, and ends up in a fairly obvious pattern--this is the sort of change which I am hoping to be able to capture in the evolution of the visualization: the idea behind wrapping it around a point is to contrast the early, more random period, against the later, more skewed period.\n\nThanks again for the response--one last thing, what (ideally free) programs do you recommend for me to have a go at this (I will NOT be learning python for the endeavour ;p )",
            "For tools - I’d personally use R and just ggplot2 or other extensions depending on complexity. If you don’t want to do that, I can’t help!\n\nThe rest of my response is about whether it’s continuous (I.E. you can get 8.51 and 8.78), ordinal (I.E. 1 is bigger than 2 is bigger than 3), or discrete (I.E. 1 is not bigger or smaller than 2, rather it’s a different category).",
            "So I don't think it is continuous... I think it is ordinal, given than it deals with integers from 0-9, and I think it could be discreet, if I choose to include another value which is contained in the data set--it is still the same number of  dates, I would just choose to look at more than a single integer from each entry ; this second value would be a different category, I think.\n\nAnyway, I'm sure I, too, will use R and ggplot2, once I figure out what most of those words mean.\n\nHave an updoot and my thanks!"
        ]
    },
    "[OC] The United States of Drug Use": {
        "title": "[OC] The United States of Drug Use",
        "score": 4868,
        "url": "https://www.reddit.com/gallery/1dl2pg6",
        "content": "",
        "num_comments": 686,
        "comments": [
            "You can tell the northeast is doing all the corporate stuff.",
            "Who in Missouri is getting prescription pills? I'm 99% sure it's either heroin or meth.",
            "Meth for New Mexico checks out",
            "Florida being relatively\"low\" on Total drug use is Hilarious... people literally plan vacations to Florida to stock up on pain killers.",
            "Not a chance PA isn't opioids or heroin. I grew up near the Kensington area of Philadelphia. It's maybe the worst open-air drug use/markets in the country. Cocaine?!? Yeah, right. Lol",
            "What exactly does 'usage' mean? Tried it once? Daily? Monthly?\n\nI'm not American and I don't think I've ever seen a meth user in my life other than on social media clips. If there's a state out there with 2.37% of the adult population hooked onto meth, that is... scary.",
            "The lack of hallucinogens in the south tracks. Makes me think of the Neo Nazi guy who microdosed lsd and realized his entire world view was fucking stupid. Maybe the south just needs more LSD",
            "West Virginia knows what it likes and that’s the hardest, cheapest shit. And lots of it. Fucking balls to the wall, burning the candle from both ends.\n\nThey need something else to do out there.",
            "Nevada's top is hallucinogens? There's no way. Meth by a long shot.",
            "This is either very old data or incorrect- NC has really low heroin use because it’s all fentanyl now. Unless the chart was including fentanyl in with heroin? \n\n(I work in overdose response/harm reduction in NC, so we follow this pretty closely)",
            "Strange that the Bible Belt hates hallucinogens so much",
            "I like that marijuana and alcohol aren’t drugs anymore…",
            "Never seen coke in Illinois, but I don't live in Chicago so who knows",
            "DC should be the deepest purple, although it might be because a lot of the money lives in Northern Virginia. I once saw professional looking guy do a bump off his BMW steering wheel at a fucking stoplight.",
            "When I worked retail sales in GA there was a lot of meth heads and heroine addicts. Moved to Louisiana and I was fucking shocked at the sheer amount of pilled up people just casually coming in. Like I'm talking 1 in 5 people were noticeably impaired.. I understand why drivers there were so much worse than Atlanta lmfao.\n\nAfter I moved out of Louisiana, a friend sent me a video of the first store I managed there. This dude slowly pulled in with his truck, then drove straight into the store lmfao. Fucked it ALLLLL up. Then he backs out and slowly drives away. Despite the video not having sound, I could definitely hear him saying \"ope\".",
            "living in Miami and seeing Florida so low on drug usage 🤯🤯🤯 \n\nbut then I remember Miami makes up 2% of the state population. And even all of Miami Dade county is still only 12%",
            "I wish more maps would stop using color as the sole way to convey information. As someone who is color blind, this map has 3 colors for me 🤷‍♂️",
            "Best states to be in, a helpful guide:\n\n1. Hallucinogen states\n2. Cocaine states\n3. New Mexico\n4. Heroin states\n\n\\*Impossibly large gap\\*\n\n5. Meth states\n\n6. Pain reliever states",
            "Gonna have to downvote because your map projections are not beautiful… They’re in fact wrong. Does the US not look stretched out to you?",
            "Illinois being coked out explains a lot of the driving on 294 that’s for sure",
            "Shocked to see Texas be the lowest on almost all the graphs. Although yea I guess growing up here outside of the frat bros I haven’t seen much drug use",
            "These statistics are HIGH-LY suspicious",
            "I dont understand why “most favored” drug isnt just the drug that is used the most. Using a relative comparison to the national average seems like a nonsense statistic.",
            "My takeaway from this graph is that CO is hands down the funnest place to party. Having grown up in a resort/ski town this in no one way surprises me. Out Cold was a documentary.",
            "Personally surprised that cocaine is still going that strong in much of the country. The overall supply trend in illicit drugs has been towards higher-potency drugs can be synthesized in enormous quantities from bulk industrial chemicals in cartel-operated labs (like fentanyl and methamphetamine) as opposed to drugs that ultimately depend on agricultural products (like heroin and cocaine.)",
            "Sources: \n\n[2021-2022 NSDUH Estimated Totals By State](https://www.samhsa.gov/data/report/2021-2022-nsduh-estimated-totals-state) for usage data\n\n[2022 ACS](https://data.census.gov/table?q=DP05) for population info\n\nData was put together in Excel, maps made in qGIS\n\nMost favored drug was determined by subtracting the national usage rate from the state’s usage rate for each drug, with whichever drug had the greatest increase from the national usage rate being the “favored” drug for that state. Least favored was determined by the greatest decrease from the national usage rate. The one exception to this is Florida, which used all 5 of the drugs/drug categories at rates lower than the national rates, so their most favored drug is the one with the smallest decrease from the national usage rate. Every other state had at least one drug they used at rates higher than the country as a whole.\n\nThis is my first post here and only the second thing I've ever worked on in qGIS, so I learned a lot doing it! \n\nAs a near lifelong Floridian, I was a bit surprised by the results for my home state, although it does make sense demographically. Other interesting takeaways to me were the cocaine/hallucinogen splits between the northeast and west coast, and how visible the difference is between the Protestant South and Louisiana when it comes to overall usage rate. Meth has much higher usage in rural states, and largely lacks a presence on the more overall urbanized east coast.",
            "I think the most favored drug in all states is either alcohol or nicotine...",
            "VT, RI, CO keeping it safe and sane, these are the mf'ers you want to chill with",
            "Trump country is meth country",
            "I'm pretty colorblind and would appreciate a patterned version of this.",
            "Whats the point of doing cocaine in Ohio?",
            "Michigan doesn't need prescription pain meds with the amount of weed we got over here",
            "I am colorblind, i can not tell cocaine and pain killers apart.\n\nSide note but i am a horrible pediatrician",
            "Using the same color for two of the drugs is just so fuckin’ stupid.",
            "Guarantee weed and alcohol are the true top choices. Pretty sus they weren’t included in the survey.",
            "I'm gonna take a guess here that marijuana and alcohol would've been every state if they were included on this map",
            "But folks who smoke weed have to imprisoned right? The war on drugs was one of the biggest blunders of the US government. People who are actually addicted to drugs need rehab, not jail. Throwing them in jail just minimizes any chance of getting a job and rebuilding their lives and dooms them to the habitual cycle of reoffending.",
            "If we included weed would it just be 1 in every state?",
            "As an Ohioan, I refuse to believe the #1 isn't meth, heroin, or pills. Maybe it's just the area I live in. I definitely believe the least used is hallucinogens though. Sure would be nice if it was the most used, people around here might mellow the fuck out for once.",
            "Resident of Massachusetts here. \nThis is no longer accurate. \n\nSource: the tweakers all over everywhere.",
            "You can tell this data is old because the entire map isn't Fentanyl. Even the existence of heroin on the map dates. You can't get heroin anymore, period.",
            "WARNING: Incoming old guy rant \n\nWho the hell has money to do all that cocaine? \n\nALSO: Get outta my yard!!!",
            "its funny, i moved from Arkansas to Arizona. and the meth-head jokes (problem) never changed.  this image confirms that its equally bad in both states",
            "This information cannot be actually true. People don't volunteer this kind of information accurately",
            "Never thought I'd say this but Texas is looking good.  I'm in New Mexico.  We do a lot of drugs and it shows. So many homeless here.",
            "I think it would be a more accurate picture if it were broken up to counties. I know in Illinois Cocaine might be big in Chicago but in the more rural areas Meth is what's popular.",
            "I’m NOT surprised that meth is the drug of choice in WVa",
            "Minnesota was totally infested with Oxy addicts.  At least it was ten years ago but I doubt it has changed that much",
            "I'm pretty surprised hallucinogens outpace heroin anywhere in NNE, it must not be by much.  Or how was the data collected?",
            "Huh guess I do the least favorite where I live (Deep South)",
            "Hallucinogen in the west is dominant and Heroin is in the east.",
            "Chicago must be really carrying the cocaine torch for Illinois. The Southern half of the state is loving meth.",
            "As a resident, Alabama should be yellow...",
            "Let's not lie our drug of choice in Wisconsin is beer and tons of it",
            "That’s pretty crazy that heroin is the #1 drug in Florida, I was a prosecutor in the beginning of my career for ~7 years in a major city in Florida and I think I can count on one hand the amount of heroin cases I saw, whether it was possession or trafficking. Tons of coke though.",
            "Bible Belt might be less bibley with more hallucinogenic substances",
            "I notice that alcohol isn't on the list as far as I know many more people drink themselves into obvlion then any of the drugs shown. \n\nOr should the title be illegal drug use?\n\nBut then with mushrooms being decriminalized does it still count as illegal?",
            "meth really is the best tho",
            "Louisiana is adding an 11th commandment; thou shalt fuckin' party.",
            "People are not reading the subtitle, this is not the most used drug by state. It’s the drug with the greatest ratio of the state’s use rate to the national use rate.",
            "Yea I’m going to call bullshit on how the information is gathered. Texas gave it away, we all know they love their nose beers",
            "How can Louisiana simultaneously have the most cocaine use but also cocaine is the least favored drug? Are that many people in LA doing drugs?",
            "I lived in NV until I was 22, can confirm we party hard. But I guess that's what NV is known for.",
            "There's no way all those countries on the southern border are doing actual prescription medication anymore. Might as well just change that category to fentanyl.",
            "Where are they getting all this data from lmao",
            "I do not trust this data at all",
            "Why are you leaving out weed?  It's still federally illegal.  Looking at the second-most popular kind of drug that 2% of people use and ignoring the first isn't showing a remotely accurate picture.",
            "While coke was literally on-tap in every bar, I’m so grateful meth was virtually impossible to get in NYC.",
            "More like\nThe United States of Corrupt Local Government",
            "I’m so happy weed isn’t on here",
            "Is this data from 1990 or from some online survey?! It's completely wrong. Oregon leads in pills, heroin and meth by truck loads. ",
            "Meth, pills and heroin. Goddamn, the confederate states are dumb as fuck.",
            "I'd expect opioids overwhelming most of USA but it doesn't look like that. What changed? Asking out of curiosty; I try to learn as much as I can about drug epidemics due to them being simply one of the scariest shit there ever is.",
            "Surprise ending: prescription pain relievers are #1 in seemingly all states.",
            "Explains the driving in CT, NY, and MA (also the roads)",
            "Hallucinations are that popular?  You rarely hear about them.",
            "This is inaccurate. Everyone in VT is smoking crack these days.",
            "I really appreciate that all of these maps were colored like MegaMan suit variants from the old NES games.",
            "The heroin map surprised me at first, then it made sense.",
            "Breaking bad got it right with new Mexico I guess big fans of meth",
            "[meth, we’re on it](https://www.nytimes.com/2019/11/18/us/south-dakota-meth.html)",
            "Maybe I don’t understand statistics, but how is the cocaine rate for California higher than their rate for any other drug, but cocaine is *not* their most favored drug?",
            "The Florida data seems like it has got to be wrong.",
            "Nevada clearly doesn’t have a least favorite",
            "New Mexico still ridden with meth thanks to Heisenberg",
            "Oregon’s least favorite drug is heroin? Go to Portland and tell me the hundreds of addicts on the street are nodding off because of… psychedelics? I really doubt.",
            "Lmao this can't be more wrong, just speaking from experience minnesota is fucking heavy with meth and opiates.",
            "It’s almost like you can see where the plug lives",
            "New Mexico favoring Meth is just funny",
            "Having lived in North Florida most of my life, I've never seen or heard of heroin here. Maybe it's all in South Florida but meth, coke, and weed are the biggest in Florida in my experience.\n\nI've got a friend in New England and they've said for years and years that heroin is the biggest thing in their area.",
            "Can we all just appreciate for a moment that they didn’t include THC in this graph?",
            "Surprised Idaho doesn’t have meth. That’s all you see around here is meth and heroin, not a ton of hallucinogenics",
            "We’ve got to get the south started on some hallucinogens. Might help with all the anger.",
            "Louisiana's least preferred drug is cocaine.\n\nThen go to the usage rate, and see it's near the top category.\n\nNOLA does allll the drugs (except meth, but the rest of the state picks up the slack there)",
            "Would be interested in this on a county level.",
            "Please use a map projection. It improves the cartography of the map greatly.",
            "Louisiana looks to be... not doing great.",
            "Can attest to North Carolina being full of heroin. The part of NC I grew up in is apparently the worst place in all of Western NC in regard to the number of Heroin Dens. Funnily enough the community was fantastic and you never really saw or heard anything about it unless there was a bust.",
            "Being from Florida I’m pretty sure The Village and key west is what sways us for cocaine💀. Because at least in Jacksonville, heroin and opiates are the main things I see",
            "There is zero chance this infographic is accurate.",
            "Heroin = fentanyl.  Prescription pain relievers = fentanyl.",
            "I feel like the first map should just be green. I love the PNW, too, but there are way more tweakers and people bent in half on fent than people chillin on psychs.",
            "This is really out of date.",
            "Drug capital of the world.",
            "Looks like I need to get my ass up to Oregon.",
            "I have a hard time believing that only 3.4/100 people in the US use illicit drugs",
            "Hmm. I’m on the wrong coast.",
            "Useless data, comparing individual substances with whole categories. Like where are opioids other than heroin?",
            "This one has to be old. We ain't got real heroin no more in Jersey. If we did I would be doing the shit.",
            "This map projection makes me feel like I'm on hallucinogens.",
            "Intherooms.com\n\n12step.org\n\nNana247.org",
            "I would like to see a study done of the UK!",
            "This is nonsense! PA loves the hallucinagens.  It's better than heroin, Henn, the booze AND the gin! ",
            "So my takeaway from this is that Louisiana hates coke the most but also uses it the most \n\nChecks out for them honestly",
            "I can only speak for Washington but they wish they had access still to prescriptions lol",
            "This is just helping me plan my next vacation.",
            "THATS why New York City moves so fast",
            "This is a lot lower than it actually is, especially in Texas.",
            "Colorblind guy here... \n\nI fucking give up.",
            "I'm guessing Marijuana was just not included in the calculations?",
            "I live in MA. Where's all this cocaine at?",
            "Since I'm color blind, I can't tell the difference between the colors used for hallucinogens and prescription pills :(",
            "So it looks like DC really is just hookers and drugs.",
            "All the cocaine in Illinois must be sucked up by Chicago.  Southern Illinois is pretty much powered by meth.",
            "Notice they mention heroin but not fentanyl... And seriously? Hallucinogens over meth or heroin or painkillers in Washington state? Gimme a break. As a former painkiller and h addict.. Who also knew many many meth addicts.. I don't know who made these charts.. But I beg to differ.",
            "Sub really fits, this is absolutely beautiful",
            "How do they know it’s heroin and not fentanyl?",
            "I can confirm this is correct for Montana. I hate pills. Seen so many people turn to meth up there. It’s methed up.",
            "Excludes alcohol and marijuana. 🙄",
            "I'm colorblind and the palette makes slides 1 and 2 unreadable",
            "I'm just wondering what's going on in Main...",
            "DC is definitely into PCP.",
            "Guess Seattle outweighs the most. I keep seeing fentanyl and heroine ODs here. Which then a real patient who needs pain meds are scared we will kill them with clean fentanyl.",
            "I'm very happy to be clean from drugs but, I'm not sure I could have done it if actual real heroin was available. I didn't want to die, just get high. With all the fentanyl going around, is there actually heroin on the streets anymore?",
            "Surprised that pot isn't on the list.",
            "Mr. White did his thing in New Mexico",
            "Where do people even find real heroin anymore?  (No, I'm not \"asking for a friend\"!)",
            "Maryland the only state adjacent to all drugs?",
            "Wisconsin doesn’t do many drugs because of all the beer(which is still a drug but not included in the chart)",
            "Check new mexico, Walter would be proud",
            "Confusion in colorblindness",
            "Western New York should just be a brown/grey color",
            "Im from Ohio and I can tell you that that fucker should be lit up like pride month on that first chart!",
            "Is this why Breaking Bad was set in New Mexico?",
            "Just a question - is it even valuable to split this up by state or region, as the first two maps really push, or are we just making patterns out of minor variations? It seems like there's far more variation in drug type usage than in state-to-state usage; e.g., the heroin usage in the most-heroin-using state is still far less than the prescription painkiller usage in the least-painkiller-using state.\n\nOne of my friends recently had a similar question about which disease you're most likely to contract in each state, and I suggested there might not be that much difference by geography. Just a thought",
            "“Good use or bad use of polling” moment here for me—I say it’s bad. Though this represents the delta between the average and the local, which I suppose has some value, I’m inclined to say it over-emphasizes a minor element when what really matters is the overall drug use rates per state. If that was represented I think cannabis, fentanyl, and methamphetamine would be well out ahead of hallucinogens for the Western states, for example. I think that’s a more relevant quantity to show.",
            "New Mexico being meth is just perfect",
            "Remove Seattle/King County from WA, would it change?",
            "Why is Nevada so dark when there’s nothing but desert out there",
            "Makes sense, here in Colorado the saying to a lot of stuff is ‘hey at least it’s not Meth’",
            "Florida is surprisingly low on the Meth chart",
            "Maryland being pain pills is funny it’s probably fent pressed pain pills",
            ">**I'm gonna turn Ohio pink!**   \n\nThere is a sentence I did not think I would say when I woke up this morning.",
            "Being a Chicagoan my whole life, can confirm we love ourselves some of that fishscale.",
            "Being from KY I had to look to see if it was meth. I’ve lived here my entire life and heard stories about it but have never seen it thankfully. However, throughout high school I was crushing hard on a girl, but it was always wrong place, wrong time. Many years later I find that she is transferring to my college and is single. I was single as well so we started our friendship back up. It usually became me, her, my best friend, and the girls roommate hanging out all the time. One New Years the ladies told us they are going to throw a party and to come over! Since we had to go to another party, we said we would stop by for sure. Mainly because I wanted to make a move, and apparently she wanted to as well. New Years comes and I’m beyond wasted with my best friend being the DD. We get to the party and it’s packed, but I’m having a great time due to being drunk as hell. I had to pee pretty bad and saw the roommate first and ask her where the bathroom was. I take the longest pee of my life and practicing what I would say to this girl. When I walk out of the bathroom my best friend grabs my arm and says “let’s get out of here”. Now he knows my plan and was for it and has never steered me wrong before, but I can’t help to feel mad at him as he drags me out of that house. We’re walking and I’m just quiet because I’m mad. He then tells me that he walked into the room of the girl I liked since there were a lot of people and found her smoking meth with some others. They all got busted that night and she was institutionalized. Dude is a real friend and actually my best man for my wedding. In a happy ending: the girl did get clean and ended up marrying this nice guy from my hometown. They have a few cute kids and she is doing well for herself.",
            "No wonder I can't find psychedelics in VA",
            "Interesting. Missing from this is prescription stimulant misusage. The shaded charts are a little hard to distinguish with the keys. Surprised hallucinogens could be least favored anywhere.",
            "Title doesn't work.  Just cause something diverges from average doesn't make it the \"favorite\" based on any dictionary I'm aware of.  I.e. if the average usage rate is 1% and the state is at 3% (3x the average), that doesn't make it the \"favorite\" drug in the state.  Something else might be at 56%, which could conceivably be below the national average but still the \"favorite\" for that state.\n\nyes, I am no fun at parties.",
            "NH is hallucinations? I mean I guess that tracks, I would have assumed heroin.",
            "Wow Colorado knows how to party",
            "This is not even remotely accurate",
            "Where is fentanyl in this list? Because that’s the big one in Oregon. Used to be meth but now fent is so much easier to get ahold of.",
            "It is absolutely unbelieveable that more people are using hallucinogens that cocaine.  So unbelievable that I don't believe this data",
            "H gang represent! H being #1 in the carolinas is surprising. for georgia, it's mostly an atlanta thing",
            "Me living in colorado still not having been able to enjoy trippy vibes",
            "The east coast talks a big game for a bunch of coked-out heroin junkies.",
            "Neat, my state is dark on every map! We are usually last in things",
            "I fucking love Louisiana is just dark on all maps lmao",
            "Can you use more shades of the same color next time?",
            "Hey Americans, which one is Miami? Do they still love coke?",
            "What happened to the cocaine cowboys of Miami?\n\nI see the West Coast likes its creativity.",
            "This stigma on hallucinogens is disappointing and really revealing about how selfish we are as a whole nation lol",
            "Good spread of charts that let me make the journey from \"Oh l, I thoughts we were mainly a heroin state\" to \"Oh we have a ton of heroin but we just have a shitton of cocaine\"",
            "The first two maps must be excluding marijuana.",
            "I can't explain it but this reinforces stereotypes about all of these states lmao",
            "Wisconsin is too drunk to use drugs, apparently.",
            "I wonder how this survey was conducted",
            "Jesus-- pretty sure the heroin up here in Maine is guaranteed laced with fentanyl.",
            "It’s funny that Wisconsin is pretty low on most of these… but if there was an alcohol map….",
            "i would group blue and orange as \"opioids\"",
            "So are opiates all categorized as prescription or heroin? Where's fent?",
            "Honestly, you can't blame Florida for saying 'anything weaker than heroin isn't going to make this bearable'",
            "They need to do a fentanyl map...",
            "Am I stupid, because I can’t find a source for the data.",
            "Well now I know where I'm booking my next vacation!",
            "Now do the same map on Lakeland, FL tell me what you get",
            "Numbers seem off.  If Washington State has one of the lowest pain meds drug usage, then why tf is it so hard to get them.  My mother was given the minimum because of all this, and she had a fractured shoulder blade, shoulder, and arm.  The Drs are not handing them out.  Maybe imported from Canada?",
            "Where I am in NC it is meth for days. I don't know where they are getting their data but Western North Carolina is flush with meth.",
            "Oklahoma is totally methed up.",
            "I can say virginia is wrong. Meth isn't least favored. I see nothing but methadone clinica around here. It's the main leading problem to crime as well",
            "Colorado isn’t the fittest state because they enjoy the outdoors, hiking, skiing and stuff….its the drugs",
            "Damn, it's almost on party lines too. Blue states seem to enjoy Cocaine and Hallucinogens, while Red states seem to enjoy Heroin, Meth and prescription drugs like Fentanyl.",
            "Would be interesting to see some seperate charts with weed tobacco and alcohol . Not exactly the same as illicit substances tho",
            "Nah, in PA it's definitely heroin.\n\nIn parts of Philly, they're even doing crazy new drugs that kills your skin.",
            "Grew up in PA and all we did was eat mushrooms and LSD…..",
            "This might explain why Florida is so insane if they do a shit load of heroin and no weed.",
            "So marijuana is hallucinogens ?",
            "Is THC liberated and not considered a drug or it's under hallucinogens?",
            "Nevada sure likes their drugs.",
            "Why doesn’t the first graph have marijuana? I would think that would be number 1 in all states.",
            "Will be interesting to overlay/compare the election results to these maps.",
            "This map sucks. Why use total state area? Should use cities or major metropolitan areas. Eastern PA and Western PA are completely different places. Much like \"where's the usage in Florida.\" Most Florida is old and retired but there are cities and metropolitan areas that are over run with drug use. This data is poorly visualized.",
            "Is Florida just not recording or sharing stats? This seems off",
            "Very strange way to present a map, but I guess opioids would paint it all more or less one color if not.",
            "No shot the most favored drug is heroin in GA. Born & raised in GA, have lived just about everywhere here & have only ever known about 1 heroin addict & she was outcasted at school for it no one knows wanted to be around her. Everyone did plenty of drugs in high school & college (in GA) & I was around serious drug users throughout that time. Drug of choice around GA was always LSD, shrooms, coke & molly, sometimes pills but meth & heroin have always been frowned upon here. You were a tweaker or a crackhead & nobody fucked with you if you did that shit",
            "This should just say “alcohol” across the whole country.",
            "As a colorblind person, these plots suck so much",
            "Really shocked that Heroin isn't the most popular for all states... When was this data taken???",
            "I'm kind of shocked at 3.4% overall.  Marijuana legalization is helping out a lot with that stat, but still seems pretty low with how big of an issue it seems to be in society.",
            "It’s true for Oklahoma and hallucinogens. Back when I was still in the game you could never find that shit around here and when you did it was crazy expensive compared to other places. You have no idea how many times some asshole was trying to sell acid for $20 a hit. No fucking way id ever pay that.",
            "DC getting hallucinations explains a lot of political things",
            "I'm a bit surprised texas isn't higher on hallucinating mushrooms given the prevalence of cows in the stage.",
            "Nice global datum distortion",
            "Louisiana needs to calm tf down",
            "Alcohol is the most used and acceptable drug",
            "This is pretty useless if it doesn’t include opiates like fentanyl. These stats from the 90’s?",
            "Weed isn't a drug--it's a plant",
            "It’s laughably absurd to suggest any state’s favorite drug category is hallucinogens, unless they’re considering marijuana an hallucinogen",
            "Really surprised NJ isn’t a cocaine state considering it’s the richest state in the US.",
            "As a colorblind person I can’t tell the difference between blue and purple and red and green. If they were different saturations and maybe you added a yellow in there it would make it a bit easier to decipher.",
            "Texas here working on that purple status.",
            "Is it good if my state had all the colors?? It is pride month!",
            "I'd like to congratulate drugs for having won the war on drugs.",
            "I'd like to see this data displayed by zip code. State lines don't show where the help is needed.",
            "Where does weed fit in here?",
            "Huh... I didn't realize the northeast was so cool.",
            "Wisconsin looks like a pretty low use state for all these. If they had a version for alcohol you’d understand what is preferred lol",
            "South Dakota's slogan of \"[Meth: We're On It](https://www.nbcnews.com/news/us-news/south-dakota-s-meth-we-re-it-campaign-funny-state-n1086071)\" is really proving itself true",
            "aint NO way PA is doing more blow than heroin",
            "Louisiana be checking in on everything.",
            "I actually don't believe that California is not a meth state.  people just assume that if someone does meth they look like a meth addict who's been living on the street. a lot of people do meth who do not look that way. And they're never going to answer that they do meth on any kind of survey.",
            "This was powerful. As a WV native who has dealt with substance abuse and it's ramifications for my entire adult life, seeing the stark difference in heroin usage between here and huge population centers with gigantic cities is absolutely sad.",
            "Do all these survey respondents actually still think they’re using heroin?",
            "Da fuck is going on with Louisiana? Chill over there 🤣",
            "Might want to watch the use of purple shades. The second to last color seems darkest to me which would make it seem the most extreme color, might be a scaling issue?",
            "From what year to what year? What are hallucinogens exactly? Is this data gathered from self-reported users?",
            "So Colorado is the ideal state",
            "Legalizing drugs and not prosecuting criminals anymore has worked out great. How many people are ODing in Singapore?",
            "My fellow Floridians... We have brought shame upon our ancestors.  Tighten up!",
            "South Carolina here, I'm shocked that we're tagged as heroin because the upstate at least is meth central",
            "Umm... Dude Meth is rampant in Colorado.",
            "Whoever said Colorado doesn't like meth has never been to Pueblo. Or to Colfax Avenue in Denver.",
            "Pretty accurate for Iowa. It’s awful around here.",
            "Can I now claim to be a minority?",
            "Elicit drug use map... Texas is looking suss as fuck.",
            "Colorado is a rectangle. I’m insulted",
            "I was expecting cannabis and alcohol to be top list. Wasn't ready for that.",
            "\"least favored\" could be some obscure chemical barely anyone has heard of so im assuming this only counts the 5 included drug classes?",
            "The categories are not useful.  \nMost of the options are opioids... Like does it matter if it's heroin or cocaine if their mechanism of action or result is the same? They are the same drug just have different delivery system.  \n\nAlso we need to add alcohol and nicotine use as well, and for some people I know caffeine is their drug of choice.  \n\nThe key idea is the dose makes the poison, and all substances when abused are drugs.",
            "Maryland isn't Heroin?  Stringer Bell lied to me man.",
            "my job tests for neither acid or psilocybin. LFG",
            "I'm sort of surprised that Texas is either the lowest in illicit drug use or among the lowest.  I guess it isn't counting weed, but still...   I say that as someone living here.",
            "My take: Nevada is a beast.",
            "No way METH isn’t #1 in Missouri",
            "I live in Idaho and I know a shit ton of people who do coke. I’m not a regular user and don’t go out looking for it so I don’t think this is a case of attracting people like me, and many of these people come from various socioeconomic backgrounds.",
            "Tbf Colorado loves some coke too (because we’re also doing all the corporate stuff, just not as much)\n\nWe just like acid and shrooms more",
            "Micro dosing hallucinogens is the new corporate drug.",
            "Would love to see this map by county. But it would be such a pain in the ass with the data.",
            "I have a friend in Vermont, he says when you live in Vermont you can either go hunting or do heroin. He preferred hunting",
            "It's not just that - the liberal west coasters are more likely to do halluciogens, and the red states are either low education so we're stupid enough to do meth or bad healthcare so pain meds are needed for all the ailments that should have been prevented",
            "And California because of Hollywood. Those people do a lot of coke. Like from the lighting guy to the director. Lots of coke.",
            "Chicago too!",
            "You'd be suprised at just how common illicit pain pill use is. For years doctors just gave them out like candy at the behest of the pharmaceutical companies. Although the data OP used could be skewed for a number of reasons, I would not be suprised to see it at number 1.",
            "Sacklers really did a number on Missouri. I remember we used to consistently have meth lab fires on the news.",
            "And why wouldn't Ohio, Kentucky, and West Virginia have either pills or Heroin? That's like the heart of pill mill country.",
            "I find it hard to believe that any state has more hallucinogenic or cocaine usage than heroin or meth. Same with prescription pills\n\nReally I find it hard to believe that any state has more drugs usage for anything other than heroin or meth\n\nI have a feeling this data underrepresented homeless people by a lot",
            "We had a whole TV show about it and everything!",
            "I laughed my ass off during Breaking Bad when I saw the shithole city my MIL used to live in on one of the distribution packages lol.",
            "They used to. Florida has mostly cracked down on that. Which has massively increased the meth use instead",
            "But if they buy to go use in their home state, then they wouldn't add to this graph for Florida much.",
            "Not anymore. Definitely back in the day. They cracked down so hard on that shit in Florida that it’s virtually impossible to get a prescription even if you need it.",
            "That hasn't been a thing since like 2013.",
            "Yeah, but its full of old and religious people. Usually drug users don't get old and retire.",
            "Florida has a very old population and also a lot of Latinos, both of whom use hard drugs at much lower rates than the national average.",
            "Takes me back to 1999, where we should probably demand a recount from Florida =D",
            "as florida man I question the data and reporting methods.",
            "nobody asked me or my friends in florida for this survey, our results skew differently.",
            "I don’t really see many drug attics in Florida. Nothing like the streets of Philly or Cali.\n\nEdit: addicts… I’m leaving it cause I love the comment below",
            "Not anymore, theyre cracking tf down on them. Stay the fuck out of Florida, its borderline impossible to find real RPs anymore",
            "This chart has nothing to do with quantity of drug use, but yeah I don’t believe for a second that scripts aren’t the main drug there",
            "Yeah and it's not as if the rest of Pennsyltucky would make up that cocaine usage to boost the stat.",
            "\"Determined by greatest difference in state usage rate as compared to national usage rate per drug\"",
            "Kensington, sounds fancy",
            "Yea, there's no way the answer isn't Fentanyl/Tranq for PA",
            "So for the \"illicit drug use other than marijuana\" map, it's people who've used any illicit drug (besides weed) within the last month. All of the drug specific ones are people who used that drug at least once within the last year. I'm not a huge fan of the differing time scales, but that's how the NSDUH breaks their data up and it was the source I wanted to work with.",
            "i’m an american and i see many meth users every day, it’s scary",
            "Idk it's clearly not helping Idaho",
            "You don't get that kinda realization from a micro dose but the south would certainly benefit if they took some shrooms or some other type of psychedelic.",
            "The south definitely needs more LSD.",
            "Louisiana too.",
            ">They need something else to do out there.\n\nNail on the head there. The two biggest factors that contribute to us having such a problem is A.)  there’s nothing to do so we’re bored and depressed, and B.) we’re so god damn poor that even if there was something to do, we couldn’t afford to do it.\n\nBeing here is fucking misery.",
            "I was a bit surprised with that one because opioids are truly devastating there",
            "As someone who lives about an hour from West Virginia, one of their favorite activities is bringing meth into Virginia from what I noticed.",
            "That's beautiful, what poem is it from?",
            "I think they are lumping MDMA in as a hallucinogen",
            "Read the subtitle of the graph.",
            "Yeah the metric is a comparison of a comparison. I think it’s very confusing and not particularly interesting",
            "Had the same though about California..",
            "If you go to Vegas without hallucinogens is it even worth it?",
            "I wonder if the data is based on \"drugs the user thought they were taking, not what they actually got\".",
            "Unironically, shrooms make you liberal.",
            "Makes a lot of sense, actually.",
            "They're not illicit drugs, at least not everywhere. Marijuana still is in many places and federally, but I also don't care for sweeping them under the rug just because they're used so much. Drug use shouldn't be normalized unless it's medically necessary. ",
            "I’m guessing Chicago turned the rest of Illinois from meth green to coke purple.",
            "Yeah I was surprised to see Illinois be coke. I've been all over this state, and it's always been heroin.",
            "Never seen it, but you can tell the users when in retail.",
            "DC is *riiiiiiight* at the upper threshold of the class it's in, so it's pretty close to being the darkest shade of purple. It's just not quite at the same level as Colorado and Vermont (who are at like 2900/100k and 3000/100k, respectively), and the NOVA factor like you said is probably why.",
            "Copying what I said above to someone else who's colorblind, but that's a very fair critique! I'm still very new to working with the software I made this in and getting the hang of getting symbols/patterns to render legibly at scale. I'll see what I can do about a patterned version.",
            "kind of love this. Why is the \\*Impossibly large gap\\* below heroin though? Is meth really that much more destructive?",
            "If I was to lump them and rate them:\n\n1) Hallucinogenic states\n2) Stimulant states\n\n3) Depressant states",
            "They use WGS 1984 (EPSG **4326**). It's the default if you've got lat/long data, but it looks gross. The top is unnervingly flat because lattitude is unmodified the y-axis and it is stretched east-west because longitude is the unmodified x-axis.\n\nYou want to use US National Atlas (EPSG 2163) so you get the nice curved northern border if you don't want your maps to look weird, or at least mercator (EPSG 3857) to avoid the weird stretchiness.\n\n[https://source.opennews.org/articles/choosing-right-map-projection/](https://source.opennews.org/articles/choosing-right-map-projection/)",
            "They honestly could rename the sub \"roast my data viz\"",
            "I’m in a GIS class now and this is the first thing I noticed!",
            "Texas looks way too low compared to the other states",
            "Because if I went by \"most used\" drug, then over half the states would be pain relievers and the rest of them would be hallucinogens since both those drugs have very high usage rates overall, and personally I don't think that's very interesting information. It also would feel a little redundant in the context of the other maps, where you can already see how high the rates are of each specific drug. West Virginia uses pain relievers the most of the drugs, but at a rate that doesn't differ *that* much from the rest of the country. Whereas they *do* use heroin at more than twice the rate of the U.S. as a whole. That's unique information that you can't make out from the usage rates alone, and that's something I wanted to look at.",
            "Odd they didn't include alcohol, because I know one state that would stick out like crazy if they included that.",
            "Coloradans may be high af, but at least it's not meth!",
            "Cause everyone loves cocaine and there isn’t a synthetic version that compares",
            "I don’t like this data.  It’s kind of irrelevant.  This whole map should be some deep opioid color, and this map is showing what the off-brand 2% of other drug users are doing.  Who cares?  We are in a serious epidemic.",
            "I’m surprised alcohol isn’t listed anywhere here?",
            "Florida having lower rates for all categories is a surprise. Even lower rates than Utah is a shock.",
            "That's a very fair critique! I'm still very new to working with the software I made this in and getting the hang of getting symbols/patterns to render legibly at scale. I'll see what I can do about a patterned version.",
            "Unless you have cocaine, then stay in my yard long enough to cut me out a line.",
            "I mean, the US Department of Health has been conducting the NSDUH for over 50 years now, I would hope they've gotten their methodology figured out by this point to get relatively accurate information.",
            "Oh trust me, I would *love* to be able to do this at the county level. I just also wanted to work with recent data, but for COVID reasons NSDUH hasn't had substate level data since their 2016-2018 survey period, and I feel like the landscape has changed too much on this topic from that time frame for that data to still be relevant.\n\n  \nAlso even their substate data isn't quite at the county level, looking at [the maps on here](https://www.samhsa.gov/data/sites/default/files/reports/rpt29373/NSDUHsubstateNationalMaps2018/NSDUHsubstateNationalMaps2018.pdf) it seems like rural counties tend to get lumped together into one region.",
            "They are - if you compare the last plot to the others, it shows prescription pain relievers are outcompeting every other drug listed in every state. The first plot is just showing something like “which drug is more standard deviations above the  national average” or something, which is sort of a weird thing to want to know imo.",
            "Colorado is hilarious. #1 in terms of cocaine use per capita, but prefer hallucinogenics.",
            "1st and only time I did coke was in Vail 🫡",
            "open AI being from SF 🤣\n\nIt's Chat GPT's excessive consumption of mushrooms! They've addled its brain and yellowed his chips!😌",
            "Should really be by county.  Cities are distorting this.  Much of rural New England and upstate NY have big opiate problems.",
            "County maps are so superior for the majority of data that gets posted on this sub",
            "lol I feel like that’s the right wing Vermont mentality. The left wing mentality is like either start a farmers market stand or a psychedelic hippy commune",
            "Why not both? A lil H&H",
            "Also, I'm a bit biased, but it seems odd to me that hallucinogens are in the same category of 'illicit drugs' as heroin. \n\nLSD and Psilocybin being lumped in with Ket and even PCP is a bit silly and I think could skew perceptions of where more help/resources might be needed.",
            "Poor education doesn't make you stupid. It makes you ignorant.",
            ">  bad healthcare so pain meds are needed for all the ailments that should have been prevented\n\nand less educated so more manual labour so more work related injuries",
            "i know a lot of people in missouri who's drug of choice is painkillers. The type is moms who wear simply southern shirts, its always them.",
            "Pretty much any person who has ever gone to the doctor with chronic pain issues has been offered prescriptions of a ridiculous number of painkillers. Bad knees and back pain suffered by blue collar workers has resulted in millions of opioid doses being prescribed.",
            "Im from eastern ky and it was pill country but they cracked down, they wont perscribe anything hardly. and now everyones on saboxone and meth just whatever to feel different",
            "A lot of people are casual drug users. Most people who enjoy mushrooms aren’t as noticeable as the homeless man shooting up in the park. Addicts make up a small portion of users, majority of drug users are not homeless. ",
            "Bravo Vince!",
            "According to this Florida is one of the least Meth states too though…",
            "Just like guns!\n\nAnd Covid deaths!",
            "What exactly do you think they do as time invariably marches on?",
            "What about drug basements though?",
            "Yk them Amish love the booger sugar /s",
            "Lol you’d think. But you couldn’t pay me to live there.",
            "But what if I only *lightly* use meth?",
            "That's a relief.",
            "The people who need it the most aren't the ones taking it.",
            "Well whatever it was lol. If it can cure Nazi brain rot we ought to pump it in all the water",
            "Louisiana is just on all the drugs",
            "Can't even fucking hike if you don't live somewhere with a state or national park. Just \"Posted: No Trespassing\" signs. \n\nI didn't start hiking until I moved to AKRON, where there are plenty of hiking trails.\n\nLet that sink in.",
            "besides forestry and mining (which is going to be less and less relevant)... what options are there for WV?\n\nSolar industry? Too cloudy and hilly.  \nWind energy? Maybe, but not very windy.  \nWhat other industries need cheap labor in the USA but not for work that needs to be in a specific area?",
            "NSDUH's definition for hallucinogen [is on page 235 of this PDF](https://www.samhsa.gov/data/sites/default/files/reports/rpt42729/2022-nsduh-method-summary-defs/2022-nsduh-method-summary-defs-110123.pdf) and specifically lists LSD, PCP, peyote, mescaline, psilocybin, MDMA, ketamine, DMT/AMT, and salvia",
            "I think so too. Otherwise, the numbers just wouldn't add up.",
            "EDC be skewing the results. /s",
            "Hallucinogen is likely defined by them as being any serotonergic drug.",
            "Well it is a hallucinogen so I'd hope so",
            "Yes but it contradicts the title",
            "So I could see that for a contaminant like xylazine, since lots of folks don’t know that’s in their supply. But at the needle exchange everyone knows they’re taking fentanyl. (This is for people who inject drugs- for people who snort drugs or consume stimulants this is less true). \n\nMy thought was either this is super old data, which is totally possible. Or since NSDUH is self report people are more willing to say heroin than other opioids?",
            "I believe you but im still curious why that is?",
            "I think for the purpose of this graph it makes sense. Otherwise nearly every if not every state would have marijuana as its preferred drug.",
            "I'm from downstate and idk. Everyone does coke out here (though heroin and opioids are a problem in some communities). Meth is below most people's dignity. Coke is the working man's drug. Pairs well with alcohol and won't turn you into a fiend. Drinking a few brews and crushing a couple nose beers is a lot of blue-collar people's ideal Saturday night.",
            "80% of the state lives in the Chicago Metro. The numbers in the rest of the state don't even matter. ",
            "Those numbers for Illicit Drugs in Vermont are way too low from my perspective. We've drastically cut funding for Burlington policy in the last couple years. I'm not shocked about the heroin rates though. You see people shooting up on Church Street.",
            "Totally and I wasn’t intending to call you or this map out specifically. It’s a common accessibility thing that many folks don’t even think of because…well, why would you unless your eyeballs are weird like mine! Haha",
            "I unsubbed but Reddit still forces it on me",
            "Texans likely underreport their use because, well, they're in texas",
            "That makes sense, but I think the title is still not optimal. I get “Drug usage with highest variation from mean usage” is a bit of a mouthful, but something like that would better capture your intent",
            "> West Virginia uses pain relievers the most of the drugs, but at a rate that doesn't differ that much from the rest of the country. Whereas they do use heroin at more than twice the rate of the U.S. as a whole. That's unique information that you can't make out from the usage rates alone, and that's something I wanted to look at.\n\n\nSurprised you used this as the reason though, because heroin isn't the most favored drug in WV on your map-- meth is.\n\nDid you just use the raw difference from national rate, or that difference as a % of national rate?\n\nIt looks like WV uses both meth and heroin at over twice the national rate but meth usage is an order of magnitude higher everywhere. So if you're just looking at the difference from the national rate, if WV's meth use rate is 2370 (2.3x national) and heroin is 985 (2.4x national), only meth is going to show up there. Just more people on it.\n\nBTW is fent in this data anywhere?\n\nETA: also love the username",
            "Yeah I'm with you Op, seems like a great way to look at it",
            "The fact that this graphic includes prescription pain killers but not weed though makes me not really confident in the data anyway. If it was just illegal drug use I can understand leaving out weed as its not all illegal, but prescription pain killers are included.",
            "great response 👍",
            "Um excuse me, I don't like being referred to as off-brand",
            "Also these days it’s all fentanyl not heroin",
            "lol the fact that nat avg script + h usage is less than nat avg coke + hallucinogen usage coupled with viz showing usage intensity by state tells you something about the focal points of the epidemic I think",
            "The NSDUH has data on alcohol usage, but it wasn't what I was focused on looking at with this project. I also think it's a bit unfair to compare usage rates of a legal substance that is more or less widely available for purchase to usage rates for substances that aren't either of those things (which is also partially why I didn't include marijuana, either, since the availability of it varies **widely** by state right now).",
            "I do appreciate what you've made here though. Honestly I would have thought it would all be meth.",
            "I think they’ve gotten pretty good at testing the sewage for it now.",
            "Denver is such a coke city that it's insane. I've never lived anywhere that people are so open about using it. It's just oddly acceptable here, even with the fentanyl crisis going in.",
            "Most cocaine use, thinnest state\n\n>!most eating disorders!<",
            "them hills got that snow, tho",
            "Wtf I love Vermont now?",
            "That's the city Vermont mentality. Left rural is start a *farm* or take acid and go skiing while listening to Grateful Dead.",
            "Ooooo I dunno about that. I get what you are saying but people need to be taught logic and how to reason or else they end up stupid and ignorant. Intelligence has at least some factor of nurture vs pure nature.",
            "it can be both",
            "As far as anecdotal evidence goes, I choose to believe this guy",
            "...die? How many street zombies do you see a day?",
            "Get prescribed everything they want so it doesn’t show up as “misuse of prescription pain killers”",
            "That’s the great thing about Florida. No basements.",
            "Your joke must be in the attic still because it went over their head.",
            "Sadly fluoride and chlorine break down lsd and Psilocybin. We've all had this idea at some point.",
            "I live there. It makes sense.",
            "About ten years or so ago our governor announced we would start fracking around here. He mentioned how it was gonna be a huge benefit to our state, bolstering our economy and bringing in new jobs. It ended up doing practically nothing for our economy and the majority of the jobs it created got snatched up by workers from out of state. And then to add insult to injury, all the out of state workers caused a booming demand for temporary housing, which caused rent prices to SKYROCKET throughout the whole state.\n\nThe only industry we really have going for us at this point is chemical manufacturing. It brings in money, but is completely destroying our environment (for reference look up the DuPont C8 scandal in the Mid-Ohio Valley). Other than that, your choices are work for local government and get paid scraps, get a degree and pay off student loans for the rest of your life, work in labor either in construction or mining and completely use up your body 15 years before you could POSSIBLY retire, or get a shitty retail/food service job, move in with two or three other roommates, split a cramped ass apartment and live paycheck to paycheck for the rest of your life. There really is no winning here, and I have no idea how anyone could begin to fix it. I feel like the rest of the country progressed while we stayed stagnant, and now we’re all suffering because now we’re 20 years behind everyone else and don’t know how to catch back up.",
            "Call centers.  But also a pretty miserable life, albeit much safer than forestry and mining.",
            "Sounds like my piss test after the big game.",
            "Nice. Except for salvia, there's nothing on that list I wouldn't like to do. No surprise at the west's results if MDMA is classified as a hallucinogen.",
            "No, it explains it. People in Nevada may use Meth, but they're not outliers in that regard.",
            "If you’ve ever taken a trip before you’d probably understand. But everyone I’ve spoken to that has including myself, feels an overwhelming sense of connectedness to your fellow people and the environment. Which goes against the current majority of the political right.",
            "It puts you in a state where you stop being your normal ego and can therefore reflect on that ego, and then making excuses for your behavior becomes a lot more difficult. \n\nThen you understand that just like how the way you behaved before was a product of your upbringing or genetics, which leads to realizing that it's the same with other people and their egos. And just like how you changed, other people can also change, making it very hard to have hatred for people.\n\nBasically, you become pretty liberal when you're constantly putting yourself in others' shoes.",
            "weather practice rain deliver coordinated attractive cheerful fertile automatic absurd\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Many people report an experience of altered consciousness, often described as a feeling of greater connection to the world, nature, and those around them. Others report religious experiences, like meeting God, suddenly understanding other religious viewpoints, etc. \n\nAnother aspect is a often a deeper reflection on self. \n\nI would imagine people with more conservative views either don't have positive experiences with these effects or actively avoid them because they don't like the influence on their viewpoints these effects might have.",
            "They can invoke strong feelings of empathy and caring for one's fellow man. Not exactly a Republican thing.",
            "I always love seeing Illinois in these charts with every state. Really, it should just say \"Chicago.\"\n\nI'm sure some other states are similarly polarized, but it's an interesting thing to see when you live in it. People's perception of the state you live in is not the same state that you actually live in.",
            "Absolutely.\n\nI'm in Chicago.  If you go to the bathroom at...\n\n- Paradise Pizza in Wicker Park\n- Federales in the West Loop\n- The Hangge-Uppe in Gold Coast \n\n..anytime after about 10-11pm, you will find someone doing a line on the sink counter.  But like typical midwesterners, they have always offered to share because they're super nice.\n\nWhich I decline, I'm a weed only guy.",
            "No worries, no offense taken or anything! I'm disabled so accessibility is near and dear to my heart and I knew that was something that might be an issue I'd need to work on for these.",
            "I just grabbed it as an easy example, since heroin has the lowest usage rates across the board of all the included drugs, high heroin use states are easy ones for me to point to as an example of why I chose to compare to national rates instead of just using raw per capitas. Wasn't paying as much attention to what the actual listed \"favored\" drug was and just went with numbers that popped out easy on my spreadsheet tbh\n\nI did raw difference from national rate. Honestly I just do these spreadsheets/maps when I'm bored at work and want something to pass the time, so I try to keep the numbers (and formulas) easier to deal with otherwise it's not as fun. I am a little curious how different the first two maps would look as difference as a %. Might play around with that later.\n\nI don't think fent is really showing up in their data. NSDUH has a separate table for data on opioid misuse (which I didn't map) that lumps together both heroin use and opioid prescription pain reliever misuse, and it includes a note stating \"estimates of opioid misuse do not include illegally made fentanyl\". I'm have a feeling most of the fentanyl used outside of legitimate medical contexts isn't being legally made, so it wouldn't be in their numbers.\n\nAnd last but not least, thank you very much! I'm rather fond of it myself.",
            "Got it thanks! Yeah makes sense, this more focused on illegal drugs",
            "Was blown away when I first moved to Denver and went to a social function for work where people were fairly openly using coke. Growing up in the Midwest, coke was very hush hush.",
            "Probably good for the high altitude like how they do in South America?",
            "Yeah Denver is a massive coke city, I remember first moving there in the late 00s early 10s, I was stunned to see how openly some people did bumps",
            "We must hang out with different crowds as I’ve never been around a ton of coke use, or maybe just oblivious too it",
            "Huh. I graduated DU years ago and while I was there the coke was *fucking terrible*. Unless you felt like getting a little high and then shitting your pants from all the baby laxative. If that was your jam then it was awesome",
            "Ah, so THAT'S why you're all so thin!  \n(Denver residents have a reputation for being fit, which is generally attributed to their love for outdoor activities like hiking, skiing, etc...)",
            "Rocky Mountain high.",
            "most judgemental about being overweight and best access to/culture around exercise.\n\nGreat for heart health, not always great for some people's mental health",
            "And right there is why I'm retiring to a farm in vermont.",
            "Sure, street zombies maybe. But most of the heavy drug users I’ve known tended to be upwardly mobile professionals.",
            "What? I love my basement.",
            "I love that this is a known hurdle to our end goal.",
            "Sadly I think WV fell victim to the resource curse.   \nCoal made money, so no incentive to invest in infrastructure or education.  \nThe fact that it is almost exclusively extremely forested and hilly does limit what industries will exist too.  \nAnd yeah, it sounds like just letting pollutors or otherwise unsavory industry operate there is one way the state gov't can bring in revenue, but it's not exactly great for the residents or long term.\n\nI haven't researched this topic in depth, just going from what I know and patterns that are common elsewhere, so I could be wrong.",
            "The title says 'Most Favoured' which should be literally the most favoured but the subtitle gives it a definition that is more along the lines of 'Favoured compared to other US states'",
            "100% or in other words hallucinogens make them see the ugly hateful people they really are so they avoid them.",
            "Not in Chicago.",
            "It's good for being outside in general. We call it Rails to Trails.",
            "I got married in Colorado and the night before our wedding my now wife got really sick from the altitude. Luckily, we'd brought a little Peruvian Marching Powder from Alabama. A little bump cured her right up.",
            "I remember grabbing brunch with friends at this cute little bistro in [ REDACTED ] on the patio next to a bustling sidewalk. At one point between the Mimosas and the Migas, my friends friend goes full Cruel Intentions and does a bump from her jade necklace in such a swift and nonchalant way that my staring at her was a bigger tell than anything she did. \n\nShe giggled, clicked her pendant again and reached across the table and said “here, lemme wipe your nose” and then without pausing, I sniffed a *“discreet”* bump off her knuckle in front of all of Denver and then took a sip of my Mimosa. She smiled and said “you should move here.” \n\n*“I should absolutely not move here but thank you.”*",
            "Spend more time hanging out in the bathrooms of bars and clubs.",
            "my stools are already looser than a nudist beach's dress code, I think that would cause me to truly never stop shitting again in my life.",
            "No joke, before I had my child my fitness routine was cocaine and EDM concerts. Throw a couple red rocks shows in there, I was never above 165 lol",
            "_Christmas Snow, now marijuana free._\n\n\nTegrity Farms",
            "For sure. I remember visiting Denver and Boulder. \n\nWalking around, I saw an overweight person and consciously noticed them. Which is weird because I'm from an area that certainly plenty of people who are heavier. But I really noticed this couple because I hadn't seen any others like them all day.  \n\nI'm sure this is self-serving too. Not only do these areas have less heavy people to start with. Heavier people may not move there, or may even move from there, because they stick out more.",
            "Yeah, and wealth is health in basically all aspects of life. There are even plenty of functioning alcoholics who are successful lawyers and doctors. Your average alcoholic is anything but pretty. The drug abusers you mention are the exception, but may still die relatively young from the abuse.",
            ">most of the heavy drug users I’ve known tended to be upwardly mobile professionals\n\nI’m assuming *you* are also an upwardly mobile professional, and that’s why you are associating with other upwardly mobile professionals who happen to be “heavy drug users”. I assure you that the average heavy drug user that is doing the drugs on this list (heroin, meth, painkillers, etc.) is not an upwardly mobile professional.",
            "The graveyard by me didn't bury people underground because of the water. It's weird down there.",
            "Let’s be honest, it’s your mom’s basement.",
            "If you read the entire title it explains that it refers to the one that's locally overrepresented, not necessarily the most common",
            "When u can’t be bothered to read a description or a subtitle",
            "I disagree. It really is more feeling connected towards everyone and everything. They make it much easier to put yourself in other people’s shoes, which leads to being more empathetic. You see the big picture more. \n\nYour description makes it sound like you all of the sudden realize people are ugly and mean. If anything, I emphasized with even the rude people more and realized they have experiences I’ll never understand that led them to how they are today. Which really just loops back to the empathizing lol",
            "It's hush hush because otherwise everyone descends upon you looking to do all your coke.  Two lines in they are asking for more of your drugs and think they can now decide when the next line of your drugs should be placed on the table.  Nothing less fun and aggravating than broke cokeheads who know one guy in the room has some.",
            "You sure it wasn't withdrawals? Coke when you're physically sick just doesn't seem fun.",
            "Basically identical to my first experience, like I’m on a patio talking to a guy over sandwiches and coffee and he pulls out a little bump dispenser and mid sentence does a bump as the waiter walks by and gestures if I want some, I shook my head and he just continued talking like nothing happened. I was mildly panicked bc it’s a busy restaurant during lunch, but no one batted an eye. \n\nAnd I’m from Colorado it’s common everywhere here, but not like Denver. I even lived in Miami and have never seen anything like how it is there.",
            "I'm good, thanks.",
            "lol I dunno if doing coke off a dirty sink counts as “out in the open”",
            "\"Do you know what happens to your body... without fiber?\"",
            "I moved to Denver from Wisconsin. Since 2021 I have lost over 50 pounds, and went from not running to running 20 to 30 miles a week…",
            "even still, almost a third of people are obese. Not just overweight. It truly is an epidemic in the USA",
            "William S Burroughs’ son Billy got cirrhosis of the liver at age 28. He never quite got over his dad killing his mom with a pistol in Mexico City in a drunken attempt to play William Tell when he was four.\n\nBy which I mean to say in extreme examples even symptoms expected late in life can happy in one’s twenties. I truly hate the phrase “never had a chance.” By age 28 Billy Burroughs had published two novels and was married. He sure seemed like a “functioning” academic sort. But no, his body crapped out on him due to sustained abuse.",
            "Yeah, that guy probably only knows professionals well enough to know about their drug use and is experiencing availability bias.",
            "Oh, l know. I spent half my life in Florida. Not going back.",
            "I think what he means is that some people are not in a place to face themselves. Psychedelics can be a wild ride if you aren’t ready to face every ugly aspect of your personality. \n\nIn fact, that’s the most common reason I get from people for not trying psychedelics, they just aren’t prepared to face themselves like that.",
            "I mean as someone who worked as a bouncer for two years I can assure you people are very not sneaky about doing coke at bars in Chicago lol\n\nAnd also just the number of times I've been offered some as a not very attractive 30 something white dude after sticking up a conversation with a stranger while out.",
            "Positive it wasn't. We'd only done it a few times months before this (and don't at all anymore) and hadn't touched it yet at that point in the trip. It was only a special occasion type thing.",
            "Depends on when you were in Miami. In the 90s you could test positive if you just handled cash in your job. People would do it anywhere.",
            "You weren't invited",
            "When everyone in your social circle does something, it's hard not to start doing it.",
            "That's the US rate. In Colorado it's 25%, and that's including everyone in eastern Colorado, which is basically in the Midwest.",
            "Yah this is what I was trying to say, thanks.",
            "Oh, that makes sense, apologies then"
        ]
    },
    "[OC] Measured vs Self Reported BMI Categories by Gender": {
        "title": "[OC] Measured vs Self Reported BMI Categories by Gender",
        "score": 335,
        "url": "https://i.redd.it/5skjpl0ig08d1.png",
        "content": "",
        "num_comments": 98,
        "comments": [
            "What population is this? \n\n\n\"The latest data indicate that 39.6 percent of U.S. adults are obese. (Another 31.6 percent are overweight and 7.7 percent are severely obese.)\"",
            "What's the error bar looks like for this data? I feel like this could plausibly just be statistically insignificant with the self reported difference being that narrow.",
            "It is data. But it's not that interesting.",
            "Breaking news: people know how much they weigh.",
            "This is not beautiful. It is certainly data",
            "Source: [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6210375/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6210375/)  \nTool: Python\n\nPopulation: The study involved 1500 college students across eight U.S. institutions who provided their height and weight via an electronic survey.\n\nNote: Sorry about the naming convention. The visuals reflect the naming convention in the data, which is only focused on BMI and does not consider situations where people might have a high BMI but are not obese, like highly built bodybuilders and such. Thanks for pointing this out in the comments.",
            "Why did you use relative % differences instead of absolute % differences?",
            "That's close. Probably a few rounding errors and that's it",
            "Scatterplot with the individual data might pull out the misreporting trends a bit more clearly",
            "I don’t think the differences between the self reporting justifies gender or weight split.",
            "Women in normal weight still see themselves as fat, men in normal weight think of themselves fitter than they are",
            "Human data is the least fun to work with",
            "So dudes are less likely to admit they are obese than women? That's surprising.",
            "I recently learned about corrected BMI measurement, that takes into account age and gender to provide a more accurate measure.\n\nhttps://www.smartbmicalculator.com/why-sbmic.html\n\nI was releaved to realize that, given my age (58), I was not actually overweight, but rather in the \"normal\" category, which fits somewhat my feeling regarding my health.",
            "can you do the entire distribution instead of classifications? I'd want to confirm the hypothesis that judgments get less accurate at the tails of true BMI.  also disaggregate by people who have body dysmorphia",
            "BMI is a terrible measure of anything. I hate that it's become popular as a measuring stick.",
            "BMI is no longer recognized as credible",
            "I just checked my BMI. I’m within 6 pounds of being underweight. Shit feels really bad. Gaining weight is hard with inflation.",
            "[deleted]",
            "This tracks.  Obesity is such an epidemic that half the population doesn't even know normal weight is",
            "I read some CrAzY shit about Obesity a few weeks ago and I can't find it anymore.  First, it appears to be a global problem?  Like Egypt is one of the fattest places on earth?  Moreover - veterinarians are reporting rampant obesity in pets - as well as zoo animals and Departments of Natural resources across the US are reporting obesity in animals in proximity of Humans (Like the deer are getting fat).  That means it might be something in the environment that is causing this.  My daughter is saying it's micro-plastics but I dont know how that could effect a deer....",
            "BMI is the worst measurement",
            "Why didn't they put the actual BMI numbers? I guarantee \"Normal Weight\" is a euphemism for \"1960s obese.\"",
            "Obese is such a bad term because it only considers BMI. If someone is 210 with only 10% body fat they are obese technically but no one would reasonably call them that colloquially.",
            "Image proving 'I'm not THAT fat' is a lie",
            "The study involved 1500 college students across eight U.S. institutions who provided their height and weight via an electronic survey. Added this also to the source comment\n\nSource: [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6210375/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6210375/)",
            "40% is crazy! They're eating like healthcare is free",
            "I love that I’m “overweight.” Me and the other 31% that just can’t seem to get under 6% body fat.",
            "Why would this type of study even have error bars? It's a one to one comparison between claimed weight to actual measured weight.   \nMaybe I'm just not getting it, but it feels like error bars wouldn't exist in this kind of study since the data is 100% accurate.",
            "I think it’s fascinating how the biggest gap is underweight women. Having dated multiple women with eating disorders, this rings true in a very scary way",
            "It’d be way more interesting if the delta was a lot bigger.",
            "I found it interesting that the overweight dudes\nare just like “oh yeah I’m fat as shit lol”",
            "You don't think it's interesting that women think they're underweight and men think they're overweight more than measured? \n\nI thought it was an interesting difference.",
            "The chart should indicate what population this is. Obviously it's not the general population with only 10% being obese, but it will confuse people.",
            "Measuring reported status in comparison to the actual in that category is a more interesting statistic. I don’t think op communicated this info clearly though.",
            "That's your prejudice, now look at the data.\n\nWomen are more likely to falsely claim to be normal weight than claiming to be fat.",
            "I think I will do that next. I have dataset in mind.",
            "Its not great, but its easier than taking weeks to get skin caliper measurements for 1500 people",
            "BMI works pretty good for population level statistics. It also generally under reports overfat people because \"skinnyfat\" individuals tend to slide by in the normal range despite having health risks and markers more aligned with overweight or obese people. It is possible to be overweight without being overfat but it's usually pretty obvious because it involves quite a lot of gym time or involves people that are very tall",
            "It definitely is, and is 95-99% accurate in predicting obesity.",
            "It's really not, it works for 99% of people and the people it doesn't work for are painfully obvious.",
            "Yeah if your BMI says you are just barely obese you can go take a shit and you are cured haha.",
            "Thats not what the data shows at all. The data shows that actually people are pretty accurate at what category they fall into, given the small delta change.",
            "I think that's likely because animals scavenge on really fattening food. People are also more sedentary nowadays (so no walks) and animals are a lot less likely to be outdoor pets these days so they're able to get fat much easier.",
            "I doubt it. The BMI cutoffs have been well defined and unchanged for a long time. Normal weight is 18.5 to 25, obese is 30+.  \n\nMore likely this is an unrepresentative sample. Most studies are performed on college students.",
            "If you look into the study, you'll see they tell you the actual numbers right at the start. Normal weight ends at 25 BMI.\n\n25 BMI is roughly 80kg if you're 180. Obese would be 98kg, so definitely numbers that fit.",
            "People who are actually obese outnumber bodybuilders 100-1. Low body-fat, high BMI individuals are a minor outlier.",
            "For about 99% of the population BMI is actually a decent tool to get a first grasp on things. If the BMI indicates obesity, go to a doctor and check up with them on whether health problems exist. \n\nIf you know you have a low body data percentage - 10% is extremely low and not very attainable for the general population without massive cutbacks - then you know you‘re not obese so why would you listen to BMI.",
            "The only people throwing off the BMI chart are highly developed powerlifters and other high strength athletes, aka people who are very obviously not obese. The amount of muscle required to achieve the kinda thing you're talking about isn't something people have accidentally. These are fairly extreme outliers.\n\nBMI is a useful measurement for pretty much everyone who isn't a highly developed athlete or amputee.",
            "The number of people at 10% body fat is so astronomically low that we use BMI in medicine to predict mortality, with amazing accuracy. The outliers with muscle mass that is *that* large is rare, and even rarer are the ones that can achieve it without exogenous hormones.",
            "Sorry about the naming convention. The visuals reflect the naming convention in the data, which is only focused on BMI and does not consider situations where people might have a high BMI but are not obese, like highly built bodybuilders and such. Thanks for pointing this out.",
            "So upper / middle class 20 year olds. Hence the less fatness (but still a lot to fatness). ",
            "Although you're limited by the data source, the presentation is problematic, because it doesn't reveal the direction and extent by which respondents are self-reporting in the wrong category.  A more informative summary would show a 4x4 cross-tabulation of the number of respondents who self-reported in each BMI category versus their actual BMI category.  This would give you a more complete picture of the true concordance; the bar plot you have shown here essentially only shows you the marginal frequencies.  Again, that's not your fault, but it is potentially misleading (as it suggests a greater concordance than might actually be the case).\n\nIn related news, what is going on in the Measured BMI categories in the first column of [Table 2](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6210375/table/ijerph-15-02216-t002/?report=objectonly)?",
            "I think I see the problem here: 'college student' + 'electronic survey'.  Yeah, what could possibly go wrong?",
            "There error bars are for the aggregated means, not the individual measurements.\n\nIf you measure 5 people’s height exactly, that doesn’t mean the average of those 5 people’s heights is exactly the average height of the population.",
            "I'm sorry but this is very very wrong. Error bars here would highlight the confidence in the mean or median of each sample, not the error of the individual measurements (that's another factor).\n\nIf you have very few measurements, say 5 people. The mean of that sample will be extremely statistically unlikely to represent the population mean. But if you take the mean for 1000 people (assuming random sampling), it's a lot more representative, and the confidence higher (error bars smaller).\n\nOf course, here we want to know if the difference in those sample means or medians are significant. Depending on if your data is one-to-one, as above, or if you're testing different sized samples, there are different statistical tests for this that affect the confidence. Please google \"statistical test decision tree\" for more info (can't link on phone right now).",
            "It is interesting that the delta isn't a lot bigger. I was expecting significant under-reporting and a gendered difference",
            "It would be interesting, but to me it looks like the differences are within margin of error. (haven't checked the study though)",
            "This is basically just asking people to weigh themselfs them write down the number.\n\n It's hardly a survey.",
            "Added.",
            "According to the number, the real underweight individuals in the first group are underreported by -14.5% of individuals who don’t think they’re underweight, but actually are.\n\nThat tells unequivocally that some women are already skinny and think their not.\n\nThe normal weight column is a bit trickier. But it tells that  far more women than men are  in normal weight, but have some dysphoria telling them they’re not in normal weight— maybe they think they are fat, maybe they think they are too skinny.\n\nConsidering the overweight columns, where women are less likely to admit they’re overweight, to analyze the normal weight column, we may assume they may self-deceit they’re too skinny when they’re actually normal weight. But considering the first columns, where they are underweight but don’t believe they are, there’s contradictory data that makes it hard to assert the overweight column reasoning behind the numbers.",
            "It’s fairly inaccurate if you’re, say, below 5’5” or above 6’2”, increasingly so the more extreme the height. Weight and height actually work better as [weight/height^2.5 or weight/height^3](https://www.medicalnewstoday.com/articles/265215#Authorities-still-promote-BMI) than it does with regular BMI’s squared power. That’s why there is a such thing as the new BMI to account for further from normal heights.\n\nPlus it’s inaccurate for many athletes and other people who purposefully put on muscle mass. The waist-to-height ratio is a better indicator in such cases.",
            "Oh yea.  After actually looking at it you right.  Ignore my stupidity ",
            "[deleted]",
            "Those super high muscle mass people are the only ones that significantly throw the measurement off, but BMI does not scale right for tall and short people. It will cause your BMI number to be a couple points high at, like, 6’3”, and a couple points low at 5’3”, with a normal body fat % compared to a 5’9” person. And it gets more inaccurate the taller and shorter you go. That’s not crazy significant but it’s enough to where I wonder why the new BMI or other scale corrected measurements aren’t used.",
            "A lot of them are obese honestly. They only appear not to be when they're flexing and sucking their gut in.",
            "Idk I don’t really work out and I’m 205lb and 16%.   \n\n\nI’m saying it’s a failure in the methodology because of course self reports will be off if there is a difference between the technical definition of obese and the colloquial definition.",
            "Just because it is predictive with some accuracy doesn’t mean that it is the best metric, just that it’s good enough to capture some effect.",
            "The survey is the self reported part of the data. Try to follow along.",
            "I think the only problem here is the college students. You mean the cohort making/buying and eating their own meals for the first time?",
            "I think for the general population the delta might be different. This study involved 1500 college students across eight U.S. institutions who provided their height and weight via an electronic survey.",
            "I also think expecting a gender difference is interesting. Why would we expect a gender difference? It’s an interesting question, rooted in our societal expectations of self-reflection, beauty standards, etc. Good sociology and gender theory research could be done there",
            "So wouldn't you expect them all to get it right? Or at least for the difference between self report and measure to be the same between sexes?",
            "Seems more likely that men round their height up and women round their height down.",
            "It's pretty hard to put on enough muscle mass to significantly throw off BMI by a large magnitude, putting on even 10 lbs of muscle mass is very significant and will make you pretty obviously well muscled if you aren't starting out as someone very skinny.",
            "Yeah, but both body fat and body muscle percentage are sliding scales and not just 0 or 10 percent or whatever. People claiming only body builders have too high indicated BMI ignore a decent chunk of people who fall between them and obese.",
            ">The waist-to-height ratio is a better indicator in such cases.\n\nI have never seen this used, but I imagine if this number approaches pi you are screwed haha.",
            "i gave you both though????? 80kg and 180cm? That's how you get a BMI of 25.",
            "Obesity is generally described as being over 25% bodyfat iirc which isn't that common among powerlifters or athletes other than throwers or superheavyweight powerlifters and weightlifters",
            "I mean that doesn't tell us anything without a height.",
            "> a failure in the methodology because of course self reports will be off \n\nThe whole point was that people wrote down what they think they weigh and then were actually weighed - in order to compare self-perception to reality.",
            "It’s one of the best metrics we have. Just like not every cigarette smoker gets cancer, BMI is a pretty damn good screening tool\n\nI’d like you to point me to a more simple, non invasive, and efficient tool at predicting all cause mortality. Because there isn’t one.",
            "Because 'self reported data' is always reliable....../s  \nAnd electronic polls are always reliable...../s\n\nAt least try to act like a scientist if you can't actually be one.",
            "the cohort for which the term “freshman 15” was invented",
            "I've never dropped weight faster than when I moved out of home. It was amazing.",
            "You mean the ones whose diets consist entirely of vodka and breakfast burritos? /s",
            "I would suggest no because 1. people's scales may not be well-calibrated, and 2. some people may even measure their height incorrectly, especially if doing it themselves.",
            "I would like confidence intervals on these. I dunno if i can extrapolate on the difference at all.",
            "It is one of the best metrics because medical practice requires easy heuristics, there haven’t been better criteria defined because there are very few people in medicine that think in a computational or mathematical way so we have crude tools like BMI implemented a century ago that still linger on. Of course there are better metrics, but too much resistance to change in things in medicine.\n\nThe majority of people that go into medicine will tell you that they hated math; it creates a general culture of closedness to new methods.",
            "Are you mental? The whole thing is about the difference between self reported data and actual measured data. It doesn’t matter how inaccurate or accurate the self reported data is.",
            "…that’s the whole point, the difference between the self reported weight and the measured weight is the whole point of the graph. that’s exactly what they were studying…\n\n(they did physically measure them in person after the survey, if you read the paper)",
            "I don't know what you're going on about, are we even looking at the same chart? It shows and allows you to compare the self-reported to the actual measured categorizations.",
            "It's unbelievable how stupid this comment is. There's like 20 words on the chart- which ones were too difficult for you to read? Maybe you got stuck on \"categories\"? Four whole syllables... when you come across big words like that, it can help to try and sound them out.",
            "I gained like 5lbs in 4 years of college but none of it was fat. Actually lost a little waist size. To be honest, most of my friends actually thinned out or bulked up. It's all what you make of it.",
            "I mean it does matter but it not being perfectly accurate is the point, yeah."
        ]
    },
    "[OC] Most winning metropolitan areas: 21st century, and all-time (MLB, NBA, NFL, NHL) ": {
        "title": "[OC] Most winning metropolitan areas: 21st century, and all-time (MLB, NBA, NFL, NHL) ",
        "score": 15,
        "url": "https://www.reddit.com/gallery/1dltqll",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Cambridge and Newton have to start carrying their weight.",
            "On a per franchise basis, Boston and Montreal crush NYC. Remember, New York and Los Angeles have two of everything.",
            "Could I ask what makes this data beautiful?",
            "The notes symbols along the right edge are flipped between Miami and Edmonton",
            "Detroit coming for that city of Champions mantra",
            "Detroit has Wings in 2002 & 2008 and Pistons in 2004.  No Lions or Tigers.  What is the 4th?",
            "Feel like MLS should count at this point, it’s basically on par with the NHL in terms of viewership",
            "The Montreal Canadians are doing some serious work standing up against those other cities",
            "Thank you for correctly tying the 5 Lakers titles to Minneapolis.  \n\nA note: Bloomington is a part of the Minneapolis-St. Paul metro area, it’s not usually added/singled out like that. So you could actually just take that out.  \n\nThough the Vikings and Twins played in Bloomington until 1983/4 (and the North Stars until they moved to Dallas), no Championships were ever won there, all of them were won in Minneapolis.",
            "San Antonio up here, with only the 1 major league sports team.\n\nThanks, Pop",
            "I believe Denver is 1 short. \n\n- Denver Broncos: 1 (2016)\n- Colorado Avalanche: 2 (2001, 2022)\n- Denver Nuggets: 1 (2023)",
            "Unpopular opinion: Pro sports would actually be interesting if the players had a five year residency requirement in the city they play for. As it is it’s just a group of mercenaries in one uniform against another.",
            "Source: multiple pages from [wikipedia.org](http://wikipedia.org) - Tools: Office 365",
            "Not sure how Patriots would fall into that Boston-Cambridge-Newton area.",
            "I've been saying this for years. Also, let's see Lowell win some fuckin' titles sometime, huh?",
            "NYC has 3 of some things (assuming this also includes the Islanders).",
            "Clearly it's the puck, and ball icons in the title.\n\nThis one is decent. The author has put some effort into presentation. \n\nI am critical of a lot of the charts posted here because it looks like they are just using the EXCEL default formating.",
            "Shoot, you're right. Thanks.",
            "...and you're right: +1 for Denver -1 for Detroit.",
            "used to",
            "So would international competition.",
            "College sports used to be more like this but now guys will go across the country more and more",
            "I do see your point, Foxborough is definitely further out there. Now I’m wondering how many other teams are located outside the metros listed here",
            "Hey they were close this year ",
            "3 baseball teams too if the all-time chart includes the dodgers and giants time in NYC"
        ]
    },
    "[OC] Most common cause of unnatural death by country for American citizens": {
        "title": "[OC] Most common cause of unnatural death by country for American citizens",
        "score": 379,
        "url": "https://i.redd.it/m7ncqoriay7d1.png",
        "content": "",
        "num_comments": 156,
        "comments": [
            "Those shades of green are really hard to tell apart.",
            "So the most common cause of unnatural death in ine of the driest countries on earth (Mali) is drowning?? Oh the irony",
            "This map got stranger the longer I looked at it.",
            "TIL Mongolia and Cambodia are American drug vacation destinations apparently.",
            "That's a fun correlation: the more Americans that commit suicide in your country, the safer the roads are.",
            "Source:  \n[https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=0#gid=0)  \nwhich is based on:  \n[https://travel.state.gov/content/travel/en/international-travel/while-abroad/death-abroad1/death-statistics.html](https://travel.state.gov/content/travel/en/international-travel/while-abroad/death-abroad1/death-statistics.html)\n\nTools:  \nPython for Google sheets [https://workspace.google.com/marketplace/app/neptyne\\_python\\_for\\_sheets/891309878867](https://workspace.google.com/marketplace/app/neptyne_python_for_sheets/891309878867)",
            "Me googling after seeing this map: \"Why are Americans coming to my country to commit suicide!?\" haha",
            "Mostly what you expect I would say:\n\n\\* Mali showing up for drowning is weird. And it happened in the capital, not some ferry on the Niger  \n\\* Mostly you'll die in traffic in countries with dangerous traffic, otherwise suicide mostly  \n\\* Except for a bunch of wet countries where you might drown  \n\\* And some obvious candidates for terrorism, though if you look at the source that is mostly military",
            "Btw, some \"suicide\" cases can still be flipped to homicide cases.",
            "Ah yes. All the colors of the rainbow. Red, orange, yellow, green, green, green, blue-green, blue, and..... Tan.\n\nR/dataishardtoread",
            "Suspect that the people in Mali who answered the question with \"Yeah, those people? They all drowned\" were having a joke at Americans' expense.",
            "Knowing basically nothing about Finland … I wonder why homicide is #1 in Finland but not in other nordic countries, or almost all of Europe for that matter. ",
            "data is beautiful, colors are hard.",
            "You really should:\n- fix the colors\n- state your source\n- state your timeframe",
            "So the take home message is that when Americans go to most of Western Europe or South America they lose the will to live?",
            "“Da! The traffic here is so awful,” says Putin.",
            "And now this:\n\n[https://www.bbc.com/news/articles/cx99z2k1wzro](https://www.bbc.com/news/articles/cx99z2k1wzro)",
            "This data is not beautiful.",
            "People drown in Mali? Jeebus.",
            "What's up with Mali that the leading cause is drowning? It's mostly desert and is landlocked!",
            "Mali and Mongolia, still scratching my head...",
            "Iceland, drowning? Who the hell is swimming in Iceland anyway, apart from Blue Lagoon? \n\nOr maybe it's drowning in lava?",
            "Why are all the colours so similar and why so much green and red pls i cannot see any of this",
            "Australia: Where all the animals, including yourself, are dangerous…to yourself…",
            "Does this include dual citizens?",
            "Mandatory r/PORTUGALCYKABLYAT",
            "Australian monsters aren't getting me I'll take myself out first!",
            "Why are Americans drowning in Mali?",
            "Every second post on r/AskAnAustralian is an American asking about how dangerous our wildlife is. Perhaps we should be concerned about why they are asking.",
            "Hey, I’d like to start by saying that this is great, and is a clear show of a LOT of effort in research and data analysis, and I love it! You clearly have a passion for the data half of this sub, and I’m excited to see what some more experience in the other produces. As someone who sees myself as the opposite (more design minded over research and data analysis), could I offer a few notes?",
            "Mali drowning is pretty interesting - feels like it might be an artifact",
            "Why are so many Americans dying in Mongolia due to drug use?",
            "Can't escape our car overlords",
            "What do you classify a situation in which a terrorist shoots down a plane and it floats derelict in the ocean for a few hours while passengers attempt row, but then it sinks in the ocean and all the passengers shoot themselves instead of drowning?",
            "Why is \"maritime\" accident top in a landlocked country??",
            "Well, at least I don’t have to worry about suicide in Mexico.",
            "Bad color scheme, interesting dataset.",
            "Drowning in NL, yeah that tracks I suppose.",
            "Drowning in Mali? Landlocked and half of the place is a desert.",
            "Note to self: never trust a Mongolian offering you drugs.",
            "The leading cause of unnatural death in the US is medical mistakes.",
            "There is a type of jellyfish only found in Australia that once stung makes you suicidal.",
            "As an Australian, this makes me incredibly sad 😔",
            "Seriously agree with traffic being such a factor in Russia 🗿🤯",
            "Somaliland separate from Somalia, lol. Maybe one day they'll get the recognition they deserve.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/pakistan] [X-post \\[OC\\] Most common cause of unnatural death by country for American citizens](https://www.reddit.com/r/pakistan/comments/1dlogyd/xpost_oc_most_common_cause_of_unnatural_death_by/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "What's up with the homicides in the Phillipines?",
            "For russia is should be “(own) terrorist actions”",
            "In Australia, Americans killed by drop-bear attacks are recorded as suicide.",
            "What about in the USA and do US citizens not visit Greenland or Antarctica?",
            " Netherlands has drowning as top cause. Interestingly most drowning deaths in the Netherlands are of tourists and immigrants. Practically all Dutch can swim really well because advanced swimming classes are practically mandatory and schools have swimming classes. We even learn to swim in heavy clothing.",
            "How the fuck do you drown in Mali",
            "Worldwide the homicide of tourists is quite rare, even in countries with a violence problem it usually doesn’t affect tourists, who often stay in safe locations or are purposefully spared by organised crime as killing tourists is a sure way to attract the attention of the government.\n\nFor a country to have the largest cause of death to be homicide, specially one that sees so many Americans like Mexico… what the fuck is happening in there?\n\n(Assuming the source is true, no source in the image).",
            "So a terrorist action is not a homicide?",
            "Mexico - what a hell-hole.",
            "Does Homicide count as natural in Brazil? They had so many murders, how many people kill themself there, that suicide is number 1?",
            "All the suicide countries are pretty nice places.  \n\nAlmost seems like Americans go there and think, “I have to go back to America.  Fuck that.”",
            "Not beautiful. Cant tell them apart",
            "I suppose that \"death due to talking too much shit\" would fall under homicide.",
            "Cause of accident: Terorrist Action. \nI would assume the American was the terorrist in Iraq, Syria, Afghanistan, Algeria, Burkina Faso. Why the f*** would you go in there unless you plan to terrorize the people of that country. They never once came en masse to give you a taste of how they lived in peace for 100s of years when there was no US.",
            "The Dutch, drowning?\n\nThat’s not right, I don’t feel confident about this",
            "My colour blind arse can't even tell which one the USA is.  Can someone help me out with what is the most common cause in the USA?",
            "You might as well add the Orange Drug-Related or red Terrorist Action color to USA with all the drugs and terrorist coming in our borders.",
            "Seriously! Why did OP use 4 shades of green‽ and the darkest one isn't even that saturated!",
            "This data is not beautiful",
            "Try browsing this sub while colorblind. It's a nightmare.",
            "I think they correspond with; \n\n\nAir accident green: DRC \n\n\nMaritime accident green: Mozambique  \n\n\nNatural Disaster green: Nepal ",
            "Also the orange is a different shade on the map as is on the key.\n\nEdit: Oh right, there are two shades of orange.",
            "Think how hard it was for Johnny Cash...\n\n[https://www.youtube.com/watch?v=E9U5N-TAnwQ](https://www.youtube.com/watch?v=E9U5N-TAnwQ)\n\n(His song about Ireland - 40 shades of green)",
            "This is a nightmare for the colorblind. ",
            "Are they green? I thought they were yellow.",
            "My PI would probably have an heart attack if he saw this type of colour use. But this is also a good learning experience.\n\nOP, a graph is a platform for conveying a point, describe a trend. The majority class should be a relatively unsaturated and light colour so the minority or details will not be drowned out. \n\nI also suggest avoiding psuedo-continous colour palettes for discrete classes. Those shades of green is disgusting and undistinguishable. If you must use similar colours, at least make it the same class (I.e. transportation related, crime related, force majeure). You could also reclassify them to reduce the colour use.",
            "Traffic and transportation are a \"natural\"  disasters now",
            "I go there for work sometimes, so weirdly I think I can explain this. Pretty much every American in Mali is embassy staff, and the embassy is right next to the Radisson, which has a nice pool and free-flowing booze.",
            "Weird, yeah! If you go to the spreadsheet:\n\n||\n||\n|2014-09-04|Bamako|Drowning|Mali|\n|2015-11-20|Hotel Radisson Blu - Bamako|Terrorist Action|Mali|\n|2016-01-05|Bamako|Drowning|Mali|\n|2017-08-17|Bamako|Veh. Accid-Auto|Mali|\n|2019-12-07|Bamako - Mali|Drowning|Mali|\n|2021-04-18|Bamako - Mali|Veh. Accid-Auto|Mali|\n|2021-08-29|Bamako - Mali|Homicide|Mali|\n\nIt is drowning and it isn't even the same event. All in Bamako though",
            "This is literally the first thing I noticed too lmao. Super bizarre.",
            "Drown in your own sweat.",
            "I saw a video on this, it has to do with flash floods. Dry river beds and sudden rainfall in dry areas.",
            "I don't know about Mongolia, but Cambodia certainly has some options",
            "I was wondering about that as well, particularly Mongolia.",
            "I wonder what's up with Finland...",
            "Norway has one of the best statistics in the world for traffic accidents. Probably because of all the american suicides. \n\n/s",
            "There's no way you could draw that conclusion without knowing numbers for all the causes.\n\nCould be 1,000 suicides in Spain and 999 traffic deaths, and  0 suicides in Portugal and 1 traffic death.\n\nWould that mean Spain has safer roads than Portugal? No, it would not.",
            "Shitty take. It could be the exact same suicide rate for all of those countries for all we know.",
            "This data doesn't tell you anything about such a correlation. The opposite of what your saying could also be true as far as this map is concerned.",
            "Well, as a fraction of total deaths, but yeah. Somewhat surprised to see Brazil in that category. Traffic seems to be more dangerous there than in Chili\n\nSee: [https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=768687749#gid=768687749](https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=768687749#gid=768687749)",
            "American who was suicidal when he lived in Italy here. No matter where you are, there you are. Moving countries doesn't cure your mental health problems. \n\nHowever, I'm also an Irish citizen, so I'm pretty sure my death would have counted as an Irish citizens death instead of a US citizens death.",
            "I suspect some of the less touristy countries are almost random due to the tiny sample sizes. There probably only were a small number of American citizens who died in Mali during the time frame, and Mali does have rivers so even just one or two deaths could cause that color.",
            "I'm sure there's a good reason for it, but it's genuinely impressive that the Mali - a landlocked country - is highlighted for drownings.",
            "I suspect there is a relationship between suicide and the resident Vs tourist American population. You don't normally kill yourself on holiday.",
            "Doing some cursory research, it looks like large dugout canoes are a popular form of public transport for traversing the river in Bamako, and they semi-frequently capsize and cause drownings - sometimes dozens of people at a time. I’m guessing every few years there just happens to be an American included in one of the incidents.",
            "If it’s mostly military personnel dying at the hands of the people they’ve invaded and occupied, labeling their cause of death as “terrorism” seems very misleading at best.",
            "Also some suicides are misreported as traffic accidents.\n\nMost suicides don't leave a note so it's hard to be sure",
            "There were only 3 incidents in Finland in the 10 years the data spans, so probably just a coincidence",
            "the takeaway is that when dealing with really small sample sizes you really can't have any meaningful insights.",
            "I had to check that myself. It's insufficient data and a shitty conclusion. There's literally 3 deaths. One homicide, one suicide and one \"Other Accident\", and somehow that results in a majority for homicide.",
            "The only way I know how to state the source is by replying as a comment. But that comment then just dissapears in the discussion. You can find everything here:\n\n    https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=768687749#gid=768687749",
            "I was thinking they travel to do it, like a final migration pattern",
            "Well, the one time I almost committed suicide last time I was in Brazil but I have a dual citizenship (US/Brazil). Almost became a statistic on here lol",
            "My takeaway was \"Look both ways before crossing the street.\"",
            "It's common there for big waves to hit some rocky viewpoint and scoop up tourists, sweeping them out to sea",
            "One possible artifact may be from the fact that the data is per person, not per incident. So a single airplane crash or boat sinking may skew the results. Also for most countries the numbers are quite small.",
            "There aren't. If you look at the original data, there have been two in the last seven years.\n\nThis graphic is in desperate need of context.",
            "I can't find it, you sure the color matches exactly? It's like OP intended for the chart to be hard to read.",
            "Inside the US is just a different dataset. US citizens do visit Antarctica but I left out the \"other\" category which that all is. No data on greenland",
            "[https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=0#gid=0](https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=0#gid=0)\n\n1500 out of 8000 or so is homicide. Dying overseas is rare but if you do, homicide is definitely an option. As for Mexico, it does seem to happen",
            "In which countries USA killed the most people chart would be a shame though.",
            "It's not the Dutch drowning, it's Americans drowning in the Netherlands, particularly the Caribbean bits of the Netherlands",
            "Sorry, this is just for Americans outside of the country. So the US is grey, just like the countries for which the data is missing",
            "I think Nepal is the only one to be the darkest green. Makes sense with all the mountaineering in that country",
            "An interrobang in the wild!",
            "Fellow red/green colorblinder here….i always wonder why so many people use that color scheme, not just on here but in office documents too.  I guess to non colorblind folks those are two good contrasting colors?",
            "Is Denmark also maritime accident?",
            "What’s this spreadsheet everyone’s talking about?",
            "Guess learning to swim ranks low on priorities there.",
            "Oh, that doesn't even include this 2012 drowning of three US \"commandos\" in Mali\n\nhttps://www.washingtonpost.com/world/national-security/mysterious-fatal-crash-provides-rare-glimpse-of-us-commandos-in-mali/2012/07/08/gJQAGO71WW_story.html",
            "Re: Mongolia. I wonder if it counts alcohol in that.",
            "They just don’t like us.",
            "Not many Americans go there and die. Only one was homicide, but there were only three in total.",
            "Obviously it isn't a statistical conclusion, but it is fair assumption since road safety varies wildly.",
            "Yup, the map only shows that there's nowhere on earth where suicide and traffic are co-equal leading causes of death for Americans.  In every place either (1) more americans die by traffic; (2) more americans die by suicide; and/or (3) something other than traffic or suicide kills more americans than either traffic or suicide, even though they technically could be co-equal risks to americans.\n\nThis isn't really interesting, fun, or noteworthy.",
            "The Italian government would presumably consider you an Irish citizen, assuming you didn't have a permit of stay in your American passport. The American embassy would have still considered you an American. No reason you can't be double counted.",
            "Hah yeah I reckoned. Hope you‘re doing better now tho!",
            "Yeah, true. It is 3 out of 6: [https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=768687749#gid=768687749](https://docs.google.com/spreadsheets/d/1LJ0X748ngm0MNkRBl7IFjiPyyCTKFv6PnUGdYP1R9r8/edit?gid=768687749#gid=768687749)",
            "And enough go swimming in the frigid waters of Iceland. Or are they drowning in heated spas?",
            "If you don't live near water you might not be as likely to be taught how to swim from a young age, so the times you are near water you are more likely to drown.",
            "Ah - it’s not always bad to be statistically insignificant!",
            "I meant in the picture. Add timeframe in title and maybe at the bottom \"Source: US State Department - Bureau of Consular Affairs\". Better coloring and then you're golden. Anyways, thought it was interesting. Cheers bro",
            "Agree on the colors though",
            "The ones who got lost on their way to Florida.",
            "That makes sense. In a foreign country it is less likely that someone they know would interfere with the plans, and it is less likely that loved ones would find the body in an unpleasant way. It's sad, but not that hard to believe. \n\nWhat this dada actually shows is that those countries are so safe, that you'd only die unnaturally if you really want to.",
            "Glad you're still here",
            "the beaches have huge \"don't pass this point\" signs but I guess people ignore them",
            "That is true, but as it happens, not the case for Mali; it's 3 different drowning incidents",
            "Oh you're right, it's probably the \"natural disaster\" color and being Nepal that makes far more sense.\n\nMaritime looks like Mozambique where it's possible",
            "Thank you for the clarification 👍",
            "Oh, then it makes sense, thanks!",
            "It's weird to call that a natural disaster",
            "I think that's suicide like most of the surrounding countries, Denmark is just so small and narrow that all of the pixels in it are part of the transition between the black outline and the yellow interior.",
            "Yes, according to the spread sheet that OP linked to, Denmark is maritime accident as well, which makes sense considering all the water. Many tourists don't know how to behave around the ocean, so each year many rescue missions are started e.g. because they float around on water air mattresses without noticing that they are pulled further and further from shore. Sadly, some drown.",
            "OP added it in a top level comment.",
            "But these are American citizens so not clear whether they grew up in Mali or were simply on holiday.",
            "Someone lied about a free bucket.",
            "Did you read my comment?",
            "Don't miss out on diving.",
            "OK but these are American citizens, so the likelihood of living near water growing up is about the same no matter where they died. ",
            "Since we only talk about American citizens, the statistic will in nearly all countries have no statistical significance.",
            "Ah I see. Yes. Next time",
            "Avalanches maybe?",
            "Actually, Northern Ireland looks yellower and is smaller, but OP released a spreadsheet and Denmark is indeed maritime accident",
            "Yeah ok I admit I skimmed over it. That said your example is only makes sense for countries with very low numbers of American tourists. I stand by the fact that it's a fair assumption to make."
        ]
    }
}