{
    "Laberfaden am Samstag": {
        "title": "Laberfaden am Samstag",
        "score": 0,
        "url": "https://www.reddit.com/r/de/comments/1dlqblm/laberfaden_am_samstag/",
        "content": "PSA:  \n\nWer sich in Zukunft allgemeine Rudelguckfäden zu anderen Sportarten/Events wünscht, darf uns gerne eine [Modmail](https://new.reddit.com/message/compose?to=/r/de) zukommen lassen. Ein öffentlich zugänglichen Livestream ist allerdings notwendig.",
        "num_comments": 17,
        "comments": [
            "Klapp' die Antworten auf diesen Kommentar auf, um zu den Stickies der letzten 7 Tage zu kommen.",
            "Ich werde morgen mein neues \"Ehrenamt\" antreten.\n\nWas ich mache? Ich unterstütze eine lokale Katzenrettungsorganisation indem ich die Tiere, die gerade im Katzendorf behaust werden, beschmuse und bespiele. \n\nIch bin bereit. Fast mein Leben lang habe ich mich darauf vorbereitet.",
            "Wohnung anschauen und hoffen, dass wir einen guten Eindruck hinterlassen. Danach Geburtstag von einem Freund feiern. Wetter sieht nicht so nach Park aus, aber wir schauen mal. Morgen ist dann D&D.\n\nWünschte ich hätte mehr Zeit mich durch Shadow of the Erdtree zu sterben",
            "Ich am Freitag: Wie wäre es mal mit einem neuen Buch\n\nIch am Samstag: Doch wieder Herr der Ringe",
            "Gartenarbeit fällt aus, heute bleibe ich auf dem Sofa.\n\nGestern hat es mich plötzlich im Rücken gestochen und es hört nicht auf, ich werde alt.",
            "Brüderchen hat heute Geburtstag und heute Nachmittag zum Grillen und danach zum Spieleabend eingeladen. Leider hat fast jeder abgesagt aber ich geh auf jeden Fall hin. Bin noch am Überlegen ob ich den Kuchen doch noch backe - habe nur den Rhabarber gekauft. Aber der geht mir sonst kaputt... der Kuchen wäre aber dann etwas viel. Naja, vielleicht kann ich mich gleich noch aufraffen. Irgendwie kommt er ja schon weg. \n\nTeamevent am Donnerstag war ganz cool, wir waren in einem Kletterwald. Trotz Höhenangst hab ich mich wenigstens auf die leichten Hindernisse gewagt. Und Zipline macht einfach am meisten Spaß! Ein bisschen Muskelkater hab ich zwar aber es hält sich in Grenzen und dank Allergietabletten hab ich auch nichts von den vielen Mücken gemerkt, die einen da fast aufgefressen haben. \n\nMorgen mache ich dann nichts, je nach Wetter eventuell einen Spaziergang. Und am Montag hab ich Massage, den Termin konnte ich zum Glück da hin verschieben. Ansonsten lese ich endlich mal wieder etwas mehr und komme wieder mit Malazan voran (bin noch in Buch 7).",
            "Auf Reise zurück vom Firmenevent. Diesmal nicht durch die ganze Republik, wie die vergangenen Jahre.\n\n\nZu Hause wartet dann noch das Zimmer, das ich seit dem Auszug meiner ukrainischen Mitbewohner renoviere. Ist zum Glück überschaubar, aber neuer Boden wird etwas teurer. (Haben nicht die Ukrainer kaputt gemacht, ist nur alt und wollte ich ohnehin austauschen)",
            "Mein Körper will mich momentan auch verarschen ey. Erst hab ich mir den Magen verstimmt, weil ich Pepperoni gegessen hab, die nicht einmal besonders scharf waren, dann hab ich mir ein paar Tage später den Rücken verrenkt als ich mir ein Brot geschmiert hab und jetzt hab ich mir gestern bei nem Spaziergang nen Muskel im Fuß gezerrt. Ich habs ja schon verstanden, dass ich bald 32 werde. :(",
            "Mit Kind im Schwimmbad gewesen, damit das Seepferdchen nicht umsonst war. Auf dem Heimweg hat sie dann eine Powernap gehalten. \n\nMein Mann ist pünktlich zu den Ferien krank. Quod est demonstrandum.\n\nHeute Nachmittag chillen im Garten. Endlich Sonne.",
            "Wollte meine long distance Freundin gestern eigentlich nur mach Hause fahren, jetzt bin ich immer noch hier. Nachher lerne ich die beste Freundin kennen und heute Abend eventuell zu den Großeltern.\n\nHabe natürlich weder Klamotten zum wechseln dabei noch meinen Kulturbeutel. Notfall Parfum im Auto muss dienen...",
            "die gesellschaft dankt dir für dein opfer 🫡",
            "Viel Glück! Meine Schwester hat zuletzt auch eine Wohnung gefunden, die mit Glück dann auch eine dauerhafte Option für nach der Ausbildung bleibt",
            "So, Kuchen ist gebacken! Das riecht so gut. Rhabarberkuchen mit Baiser. Nur das Baiser ist nicht ganz so optimal geworden aber egal. Geschenk ist auch verpackt. Dann dusche ich mal und gammel noch ein bisschen bevor ich losfahre.",
            "Danke! Ich hoffe mal das Beste. Irgendwann muss es ja mal klappen",
            "> Rhabarberkuchen mit Baiser\n\nWo war die Feier nochmal? Ü\n\nViel Spaß!",
            "Na bei meinem Bruder im Garten! ;)\n\nDankeschön! :)"
        ]
    },
    "Freilassing: Autofahrer erfasst Ersthelfer absichtlich mit Kleintransporter": {
        "title": "Freilassing: Autofahrer erfasst Ersthelfer absichtlich mit Kleintransporter",
        "score": 303,
        "url": "https://www.spiegel.de/panorama/freilassing-autofahrer-erfasst-ersthelfer-absichtlich-mit-kleintransporter-a-4007f55d-bc6e-440e-bab6-4d578888ffee",
        "content": "",
        "num_comments": 170,
        "comments": [
            "Führerschein bitte einziehen und eine lebenslängliche Sperre verhängen. So jemand darf nie wieder das Privileg genießen dürfen, ein Fahrzeug zu führen.",
            "Was haben wir falsch gemacht, dass jeder denkt seine Zeit wäre 10000 mal wichtiger als die seiner Mitmenschen? Manchmal passieren Dinge, manchmal muss man was negatives in Kauf nehmen weils einfach nötig ist.",
            "Jemand der sein Fahrzeug als Waffe einsetzt sollte nie wieder hinter dem Steuer von einem sitzen dürfen.",
            "Nur wegen gefährlichen Eingriffs in den Straßenverkehr ermitteln? Das grenzt ja schon an versuchtem Mord.",
            "Hoffentlich ist der Ortsname nicht Programm",
            "Notwehr, der 34 Jährige dachte bestimmt des is nen Klimakleber, das is in Bayern ja kein Problem wenn man da drüber fährt.",
            "Den sollte man ins Gefängnis sperren und nie mehr freilassing.\n\n  \nSchon gut, ich geh ja schon.",
            "Gut wie sicher langsam das Framing wandelt. Nicht das Auto erfasst mehr den Ersthelfer, der Autofahrer isses.",
            "[removed]",
            "Jedes mal wenn ich so etwas lese denke ich mir wie verrückt man sein muss um so eine GTA Nummer durchzuziehen?  \nDie meisten sind so langweilig wie ich, woher kriegt ihr plötzlich die Eier so was in die Tat umzusetzen?",
            "In meiner Region wurde letztes Jahr eine Erzieherin von einer Autofahrerin mit Absicht touchiert als diese mit denn Kindern aus ihrem Kindergarten auf einem Feldweg unterwegs war. Weil sie nicht nicht schnell genug Platz machte. Vor ein paar Tagen das Urteil: Geldstrafe und das war´s.",
            "Hab zuerst Freilassung gelesen und war doppelt empört",
            "Wir verrohen jeden Tag ein Stückchen mehr, bis Gewalt irgendwann in Gegengewalt umschlägt.",
            "Oh mann, ich wünsche mir echt die Regionalzeitungs-Regel zurück.",
            "ADAC Verkehrsrechtsschutz regelt, der Fahrer wird erst einmal gar nichts müssen und nach jahrelangen Verfahren durch mehrere Instanzen \n\n- stand die Sonne so, dass der Fahrer den Ersthelfer unmöglich sehen konnte \n- hat sich der Ersthelfer sicherlich unklar artikuliert \n- ist ja nichts schlimmes passiert (der Ersthelfer lebt ja noch)\n- hat sich der Autofahrer sicherlich bisher nichts zu Schulden kommen lassen\n- ist der Autofahrer sicherlich gaaaanz dringend auf seinen Führerschein angewiesen\n\nVielleicht gibt es eine minimale Geldauflage.",
            "Ich dachte, wenn man jemanden mithilfe einer Waffe angeht, die es möglich macht, dass das Opfer stirbt, ist das mindestens gefährliche Körperverletzung.\nIch hoffe, der Irre darf nie wieder autofahren, und ich hoffe, dass der Ersthelfer sich einen Anwalt nimmt um ihn auch zivilrechtlich richtig auszuquetschen.",
            "...und wird damit davonkommen. Solche Wesen gehören weggesperrt.",
            "Was ist nurvaus Deutschland geworden, warum hassen hier plötzlich alle Autofahrer? /s",
            "Ich Idiotin dachte zuerst, \"Freilassing\" wäre ein Begriff um das Verhalten zu beschrieben (ähnlich zu Fahrerflucht als Begriff) und habe viel zu lange versucht, Sinn darin zu finden, warum gerade dieses Wort... Schlafmangel ftw lol",
            "In 2 Jahren: \"100€, auf Bewährung. Dann is dat Ding aba auch jut bezahlt.\"",
            "> Polizeibeamte nahmen den 34-Jährigen mit auf die Wache. Gegen ihn werde nun unter anderem wegen gefährlichen Eingriffs in den Straßenverkehr ermittelt. \n\nWie kann absichtliches Anfahren und Mitschleifen kein Mordverdacht sein? Oder zumindest versuchter Totschlag?\n\nZumindest in meinem nicht-juristischen Wortverständnis wurde da doch locker in Kauf genommen, den Ersthelfer zu ermorden?",
            "Ich verstehe und unterstütze ja das generelle Ansinnen des (deutschen) Rechtsstaats, Resozialisierung vor Strafen zu stellen, aber solche Leute kommen echt zu glimpflich davon. Ich bezweifel dass das eine Anklage wegen versuchtem Mordes werden würde und von besonderer Schwere der Schuld oder Sicherheitsverwahrung braucht man glaube ich nicht mal träumen.",
            "Erfahrungsgemäß wird die Staatsanwaltschaft absolut keinen Fehler erkennen und die Schuld wo anders suchen, tiefstehende Sonne z.B. \nDer arme Fahrer muss doch sein Recht auf Weiterfahrt durchsetzen dürfen, das Kind hat sicherlich nicht einmal Steuern gezahlt und sowieso. \n\nDer hat seinen Führerschein schneller zurück als er „Rücksicht im Straßenverkehr“ sagen kann, leider.",
            "Wenn dss die Polizei macht sagt niemand wss",
            "Versuchter Mord sollte dann das Strafmaß lauten",
            "Wie kann man so doof sein.",
            "Also, versuchter Mord oder was?",
            "Freilass**i**ng - ich habe Freilassung gelesen...was den Blutdruck geändert hat. Die Titel ist doch mit absicht so...",
            "Definitiv nicht geeignet ein Fahrzeug zu führen",
            "Um ne MPU kommt der Mann sicher nicht rum, wenigstens etwas",
            "Zitat aus dem Text\n\n>Polizeibeamte nahmen den 34-Jährigen mit auf die Wache. Gegen ihn werde nun unter anderem wegen gefährlichen Eingriffs in den Straßenverkehr ermittelt. Er musste seinen Führerschein abgeben.",
            "So jemanden sollte man einsperren und nie wieder Freilassing.",
            "Allein, dass zur Debatte steht, dass das nicht so ist, ist völliger Wahnsinn. Der Typ hat den möglichen Tod eines Menschen gezielt in Kauf genommen, weil... er nicht die Straße entlang fahren konnte, die er wollte. Weil ein Kind angefahren wurde. In einer gerechten Welt ist der permanente Entzug des Führerscheins gerade mal der erste Schritt..",
            "Es ist vor allem so traurig, dass erst etwas passieren muss, bis mal auf solche Aggrotypen im Straßenverkehr reagiert wird. Hätte er ihn nicht getroffen, sondern nur, wenn auch mehrfach, versucht, ihn umzufahren, dann kann ich mir den Inhalt des Artikels schon vorstellen:\n\n- Nur Streit zwischen zwei Verkehrsteilnehmern\n\n- kein öffentliches Interesse\n\n- Verfahren eingestellt, Bußgeldstelle informiert\n\n- Bußgeldstelle einigt sich dann mit dem Fahrer auf irgendeinen Bums, der 20€ Verwarngeld kostet oder \"Ich bin nicht gefahren\" -> Verfahren eingestellt",
            "Sowas ist mindestens versuchter Totschlag und der Fahrer sollte in den Knast.\n\nBis zu 15 Jahre knast sind da drin. Und die sollte er auch bekommen. Wer Einsatzkräftet/Ersthelfer töten will ist eine Gefahr für die Allgemeinheit.",
            "Lebenslanger Führerscheinentzug bei solchem Verhalten (fucking versuchter Mord/Todschlag aus niedrigsten Beweggründen!) wäre wirklich mehr als angebracht, aber in Autohirnland Deutschland wohl leider unvorstellbar, weil \"unzumutbar\".. das Leben des armen Täters wäre nicht mehr lebenswert ohne Auto, die Strafe schlimmer als Vogelfreiheit und Verbannung vor die Stadtmauern im Mittelalter.. deshalb darf er sein Mordgerät weiter handhaben..",
            "Und 15 Jahre Gefängnis noch oben drauf.",
            "Ich habe das Gefühl, dass das erst seit einigen Jahren so enorm zugenommen hat. Viele vermuten dahinter auch die Corona-Zeit mit den Querdenkern, wo die Leute gemerkt haben, dass sie keine Konsequenzen für Arschloch sein und Egoismus zu fürchten haben",
            "Denke sobald Geld = Zeit und Geld > Mitmenschen",
            "Gibt dazu Studien. Die Kurzfassung: Das Auto anonymisiert und isoliert uns von den anderen Teilnehmern. \n\nAls Fussgänger passieren uns auch ständig Dinge: anrempeln, im Weg stehen, drängeln, usw. Viele der Situationen werden aber einfach durch Kommunikation, Gestik, Mimik entschärft. Und - es gibt Zeugen, die unangemessenes Verhalten sofort sanktionieren könnten (Vergleiche: Im Auto den Mittelfinger zeigen vs in der Fussgänger Zone)",
            "Beim Autofahren denken viel zu viele einfach \"ich muss da durch, der wird schon Platz machen\", null Gedanken an Konsequenzen, oder daran, dass die anderen Verkehrsteilnehmer auch Menschen sind. Eine Autofahrerin hat mal frontal auf mich zugehalten, obwohl ich auf dem Bürgersteig stand, weil sie lieber in Kauf nehmen wollte einen Passanten zu treffen, als mit ihrem Spiegel an ein parkendes Auto auf der anderen Seite zu kommen. Obwohl da noch ein knapper halber Meter Platz war.",
            "> jeder\n\nEs gibt in Deutschland ~60.000.000 Autofahrer (und der hier war nicht mal aus Deutschland). Der Sub und ein Teil der Medien hat sich nur darauf eingeschossen und berichtet über alles was irgendwie in die Richtung \"Autofahrer dreht durch\" geht. Am Ende geht's hier um einen Vorfall mit 2 Leichtverletzten, zu dem es keinerlei journalistische Quelle gibt, nur einen Polizeibericht.\n\nDann kann jeder die immergleichen Kommentare (\"Macht nix, mit dem Auto darfst du in Deutschland ja alles\", \"Dem passiert nix aber wenn ich kiffe...\") abgeben und wir warten auf morgen, bis wieder in irgendeinem Polizeibericht aus Deutschland irgendwas mit'm Auto passiert ist und das gleiche Spiel von neuem losgeht. \n\nDas Spiel kannst du mit quasi jedem Thema spielen, was glaubst du, wie im AfD-Millieu das Gefühl entsteht, dass Deutschland von einer Flüchtlingsgewaltwelle überrollt wird? In dem jeder belanglose Lokalvorfall auf bundesweit relevantes Niveau gepusht wird.\n\n Deutschland ist groß, hier passiert jeden Tag irgendwas.",
            "Aber ich muss da jetzt durch!",
            "Maximaler Fokus auf Individualismus in kapitalistischen Systemen.",
            "Pandemie. Katalysator kombiniert mit mainchatacter-media und einer politik, die zeigt, dass man von ihr nichts mehr erwarten kann als jens-spahn-gedächtnis-Korruption (cdu). ",
            "Naja das zauberwort ist unter anderem. Erstmal das vorwerfen was sicher geht und dann je nach notwendigkeit die klage erweitern. Und evtl wird das ganze in traunstein verhandelt. Die haben den ruf das sie sehr streng sind.",
            "> Gegen ihn werde nun **unter anderem** wegen gefährlichen Eingriffs in den Straßenverkehr ermittelt\n\nWo nimmst du das „nur“ her? ",
            "Autoabsolution, wir sind immer noch in Deutschland.",
            "Den erwarten 1-10 Jahre. Nicht alles ist gleich Mord.",
            "Absolut. Und nachdem man einen Riesenbohei darum gemacht hat doch bitte Raser als Mörder verurteilen zu können (obwohl es dafür quasi keine Grundlage gab) ist das umso absurder",
            "In einem Staat, in dem du bei 30km/h innerorts zu Schnell ca. 180 Euro und einen Punkt bekommst (und erst ein Fahrverbot nach mehrmaligen verstößen afaik...\n\nWUNDERT dich das?",
            "Was sich hinter dem \"unter anderem\" versteckt wissen wohl nur die Spiegel-Journalisten.",
            "Nicht in Deutschland. Hier haben Autos mehr Rechte als Menschen.",
            "Hoffentlich kommt er nach Einsperring",
            "Ins Gefängnis einsperring sollte man den!",
            "[removed]",
            "Schwingt da etwa Bewunderung mit?",
            "Ich kann das alles nicht mehr. Solche Leute gehören weggesperrt. Deutschland ist da echt zu lasch unterwegs...",
            "Jo, nimmt echt n bissl überhand, wenn man sucht findet man sone Meldung jeden Tag.",
            "gibt es die nicht mehr? Deswegen ist so viel belangloser Scheiß hier mittlerweile?",
            "Du kennst doch so Städte, wo man weil Lebenszeit verbracht hat, weil man da immer den Anschlusszog verpasst? Minden/Westfalen, Stadtroda etc. Sowas ist Freilassing. Was ich da schon gestanden habe wie mein Vater Jahre vor mir",
            "Ok, also \n1. Mord braucht ein Mordmerkmal\n2. Strafmaß beschreibt die Höhe und Art einer Strafe nicht den Titel der verletzten Norm.\n3. Das Wort \"lauten\" findet weder auf das Wort Strafmaß noch das Wort Mord so Anwendung.",
            "Und Hochverrat!",
            "Der Titel vom Artikel selbst ist anders aber in der Webadresse steht er so.",
            "Jo klar ich fahr 5 tage nachdem kiffen auto hab 1.5ng und krieg nh größere strafe",
            "Wundert mich irgendwie, dass er nicht wegen versuchten Mord angezeigt wurde. Er hat ja in Kaufgenommen, den Ersthelfer tödlich zu verletzen",
            "r/wütendeshochwähli",
            "more Einsperring, less Freilassing",
            "Diese Woche erst passiert: mein Arbeitskollege (6 Monate vor der Rente) kommt jeden Tag mit dem Rad zur Arbeit. Der fährt sich Langstrecken über mehrere hundert km/Tag als „Urlaub“. Der ist nicht langsam unterwegs sondern hat gute 30-40km als Geschwindigkeit im Straßenverkehr.\n\nInnerhalb des Ortes hat ihn ein Autofahrer morgens wild hupend, auf der Gegenspur überholt und beinahe eine Mutter mit Kind auf dem Gehweg erfasst die dort gerade zum Bäcker unterwegs war.\nDer Autofahrer fuhr dann mit weit über 50km/h weiter - in der 30er Zone.\n\nSolchen Leuten gehört einfach der Führerschein abgenommen weil sie offensichtlich nicht die Reife dafür besitzen, ein KFZ zu führen.",
            "Ich nehme mal an, dass das nichts mit „Autohirnland“ zu tun hat, sondern das wir meines Wissens in Deutschland keine endgültigen Strafen verhängen. Selbst bei Mord hat man ja die Möglichkeit, irgendwann wieder in Freiheit zu kommen.",
            "> fucking versuchter Mord/Todschlag aus niedrigsten Beweggründen!\n\nDann begründe mal bitte, warum der Täter einen Tötungsvorsatz hatte, ohne lediglich auf die objektiv (potenziell) lebensgefährliche Handlung abzustellen; das alleine reicht nämlich nicht aus. Scheinst ja offensichtlich mehr zu wissen als Polizei und Staatsanwaltschaft. \n\n> wohl leider unvorstellbar, weil \"unzumutbar\"\n\nNe, das ist unvorstellbar weil keine Grundlage dafür besteht, jetzt zu entscheiden dass er nie wieder einen Führerschein machen darf. Wer sagt denn, dass er in 30 Jahren nicht ein völlig normaler und vernünftiger Kerl geworden ist? Mördern wird ja auch nicht von Anfang an und für immer die Freiheit entzogen, weil man nicht weiß ob sie in 30 Jahren nicht vielleicht wieder normal und sozialisiert geworden sind. Also warum sollte das beim Führerschein anders sein? ",
            "Ja, ich bin grundsätzlich kein Fan von Gewalt aber manchmal habe ich das Gefühl, dass sich viele Leute zu sicher fühlen weil sie wissen, dass sie nicht aufs Maul bekommen egal was sie machen...",
            "> seit einigen Jahren\n\nDazu kommt dass mittlerweile jeder kleine Vorfall in den Medien landet und von Algorithmen hoch gepusht wird. Wenn so etwas früher vorgefallen ist dann war das maximal abends in den Lokalnachrichten auf dem Senderplatz 153.",
            "Ich denke das hat schon eher begonnen und schaukelt sich seit Jahrzehnten immer weiter hoch. Gerade im Straßenverkehr hat man auch vor Corona schon häufig \"wenn der das ungestraft machen kann, mach ich das halt auch\" beobachten können. Irgendwann hat es vermutlich den kritischen Punkt erreicht, an dem es für einen selbst plötzlich spürbar wird.",
            "Ich glaube so richtig Fahrt aufgenommen hat das, als vor 6 Jahren TikTok populär wurde.",
            "Mit solchen Wahrnehmungen wäre ich vorsichtig, kann auch an der erhöhten Sensibilität und Berichterstattung liegen.\n\nDie Kriminalstatistik zeigt eindeutig nach unten",
            "\"Viele vermuten\" ist ein wunderschönes Beispiel wie man einer unbelegten Behauptung versucht irgendeine Art von Gewicht beizumessen.\n\nHast du wenigstens eine Statstik die zeigen würde, dass es überhaupt eine Zunahme gibt? Die meisten vergessen bei sowas nämlich gerne, dass wir heute deutlich mehr Nachrichten erhalten als früher. Das erklärt, woher das Gefühl kommt, es gäbe von bestimmten Straftaten oder Verhaltensweisen immer mehr, obwohl die entsprechenden Statistiken das nicht belegen.\n\nGanz nebenbei: Egoistisch zu sein ohne die Konsequenzen dessen zu sehen und jemanden mutwillig mit dem Auto umfahren sind zwei verschiedene Dinge. Für letzteres braucht es ein wenig mehr als \"Ist mir egal was mit anderen passiert\".",
            "Selten sowas egoistisches und zugleich menschenverachtendes gehört.",
            ">Was haben wir falsch gemacht, dass jeder denkt seine Zeit wäre 10000 mal wichtiger als die seiner Mitmenschen?\n\nIn diesem Fall war ihm seine Zeit (ein paar Minuten warten, damit ein Kind gefahrlos gerettet werden kann) wichtiger als das fucking Restleben seines Opfers.\n\nEigentlich sollte so jemand für den Rest seines Lebens in Sicherheitsverwahrung weggesperrt werden, damit er niemandem mehr gefährdlich werden kann..\n\nStattdessen wird er eine kurze Haftstrafe erhalten, und danach den Führerschein leicht wieder bekommen. Er wird wieder auf den Rest der Menschheit losgelassen, genauso bekloppt und genauso \"bewaffnet\" wie zuvor..",
            "Dass es anonymisiert muss aber nicht zur Folge haben, dass man sich im Verkehr ohne Rücksicht verhält. Allein das hierzulande eigentlich recht vorbildlich funktionierende Durchlassen von Rettungswagen (im Vergleich zu einigen anderen Ländern) zeigt doch, dass der Verkehrsteilnehmer zu einer positiven Schwarm-Kooperation fähig ist. Und man muss es ja auch mal sagen: die Mehrzahl der Autofahrer verhält sich rücksichtsvoll - es sind aber leider die wenigen dummen Egomanen, die uns auffallen und uns lange im Gedächtnis bleiben, während man sich an diejenigen, die einem zum Beispiel das Einfädeln aktiv ermöglichen oder auch mal auf ihre Vorfahrt verzichten um einen in der Rush Hour schon lange Wartenden reinzulassen, nur kurz erinnert.",
            "> Gibt dazu Studien\n\nKönntest du ein paar davon verlinken? Das Thema klingt interessant.",
            "r/rentnerfahrenindinge",
            "Traunstein? Sehr hübsch, dann wartet die JVA Bernau auf ihn:\n\nhttps://de.wikipedia.org/wiki/Justizvollzugsanstalt_Bernau\n\nHatte einmal eine Führung dort, das ist echt nicht schön dort. Und ich meine nicht die spezielle Isolationszelle sondern die ganz normalen Zellen.",
            "Passt besser zum eigenen Narrativ.",
            "Wenn du in Deutschland jemanden töten möchtest, mach es mit dem Auto.",
            "Aber es ist sehr verwerflich also muss das auch Mord sein./s\n\nGanz ehrlich, ich finde auch, dass Autofahrer in Deutschland häufig noch mit zu geringen Strafen davon kommen, wenn sie scheiße bauen. Aber das unter wirklich jedem fucking thread zu dem Thema \"Mord, Mord, Kriegsverbrechen, Hochverrat und nochmal Mord\" steht ist halt wirklich anstrengend.",
            "Oder die ermittelnde Polizei.",
            "[removed]",
            "Ich verstehe, was Caterpillar meint. Nicht Bewunderung, aber Verwunderung, wie es kommt, das ein Normalo-Spacken plötzlich solche Motivation entwickelt.\n\nWelche unterschwellige Wut muss man mit sich rumschleppen?",
            "Die Tat ist abscheulich. Aber es geht wohl eher darum, dass es \"Mut\" braucht, soziale Grenzen zu überschreiten.\n\n\nAllerdings sollte man festhalten, dass zwischen \"Mut\" und \"Idiotie\" oft nur eine seeehr dünne Linie verläuft.",
            "Auf jeden Fall eine saftige Geldstrafe und denn Lappen weg, sowie eine Pflichtnachschulung. Es ist schon ein Unterschied ob ich aus Unachtsamkeit oder weil einfach Pech jemanden anfahre oder mit voller Absicht.",
            "Ja, es ist ein Graus. Jeden Tag diese Ragebait-lokalgeschichten ohne irgendeinen informationellen Mehrwert, mit den vollkommen vorhersehbaren Kommentarspalten.",
            "Also mindestens Verbrechen gegen die Menschlichkeit",
            "> nh größere strafe\n\nJunge.",
            "Nee du kriegst, wenn’s das erste mal war, nen Bußgeldbescheid über 500 EUR und Fahrverbot, während ihn ne MPU und das hier erwartet: https://www.gesetze-im-internet.de/stgb/__315b.html",
            "Wie Kiffer Echt alles zu nem Kifferthema machen müssen, ist das größte Argument gegen die Legalisierung.",
            "das wäre dann eher versuchter Totschlag, wenn es sowas gibt.",
            "Welches Mordmerkmal siehst du erfüllt?",
            "Dazu braucht es mehr als eine rein objektiv lebensgefährliche Handlung. Alleine der Umstand, dass objektiv Lebensgefahr bestand, reicht also nicht aus um einen Tötungsvorsatz anzunehmen. Und alleine anhand der uns bekannten Umstände ist es sehr schwer zu argumentieren, dass ein Tötungsvorsatz vorliegt. ",
            "Wie kann es sein, dass der Autofahrer auf der Gegenspur gefahren ist und trotzdem beinahe Fußgänger auf dem Gehweg erwischt hat? ",
            "Hmm, aber wie ist das dann beim Waffenschein? Kann ich den auch wieder bekommen, selbst wenn ich jemanden mit einer Schusswaffe ermordet habe?",
            "Mit 30 Jahren Führerscheinentzug für solche Täter wäre ich auch bereits zufrieden.",
            "Wie Mike Thyson mal gesagt hat: \"Social media made y'all way too comfortable with disrespecting people and not getting punched in the face for it.\"",
            "Das Problem hierbei ist leider: Den Scheiß, den diese Leerdenker seit Covid verbreiten, ist von der Meinungsfreiheit gedeckt. Haust du einem von denen - verdientermaßen - für den Dreck, den sie da verzapfen, auf die Schnauze, heult er rum und du kassierst eine Anzeige wegen Körperverletzung.",
            "This.....\nEs gab schon immer Stress, Gewalt etc... nur hat man halt nicht jeden Vorfall ausm kleinsten Kaff gehört",
            "Boomer - die bei sowas gefühlt immer am Start sind - haben TikTok erst viel später entdeckt.\n\nWie sollte TikTok denn da irgendwie was mit zu tun haben?",
            "Mann könnte auch einfach mal nach der aktuellen Kriminalstatistik des BKA googeln und feststellen, dass genau das Gegenteil der Fall ist.",
            "Ich glaube nicht, dass es überhaupt eine Haftstrafe geben wird.",
            "Also den Führerschein sollte man für sowas schon verlieren. Wenn man mit großen, gefährlichen Maschinen emotional umgeht und damit sein Umfeld gefährdet, dann ist das nichts für einen.",
            "Damit es trotzdem die Totschlag bzw Mord Verurteilung gibt? \n\nEdit: wer downvoted, kann ja gerne mal einen Fall posten, bei dem jemand einen anderen mit einem Auto töten *wollte* und nicht wegen eines vorsätzlichen Tötungsdelikts verurteilt wurde. ",
            "Wenn ich billigend in Kauf nehme, dass der unter die Räder eines über 2 Tonnen schweren Gefährts kommen kann, dann geht das schon grob in die Richtung.",
            "[removed]",
            "[removed]",
            "Ich glaube jeder von uns kennt Situationen, in denen man unter Stress steht, dazu vielleicht noch hungrig ist, usw.\n\nVielleicht wenn sich genug dieser Faktoren aufsummieren?",
            "DaS iSt MoRd",
            "Was soll \"nh\" überhaupt heißen?",
            "wütender kontrollverlust.",
            "Eine --> 'ne --> nh",
            "Das ist heute so aber vor 3 Jahren noch ganz anders. Und wenn das aus der Perspektive sieht denkt man da nochmal anders drüber nach",
            "Echt ey, was fällt den Leuten ein, aktuell relevante Geschehnisse mit anderen ins Verhältnis zu setzen. Frechheit.",
            "Gibt es:\n\n\"Der versuchte Totschlag meint dabei eine kriminelle Handlung, wobei der Täter versucht, einen anderen Menschen zu töten, allerdings die Tat nicht vollendet wird und der Tod des anderen nicht eintritt.\"",
            "mind. die gleichen die beim Ku'damm raser erfuellt waren.",
            "Gemeingefährliche mittel oder niedere Beweggründe?",
            "Sonstige niedrige Beweggründe",
            "Mord wird es wahrscheinlich nicht sein, aber der Fahrer hat den tot eines Menschen billigend in Kauf genommen. (er hat ihn mit einem tonnenschweren Fahrzeug angefahren und mitgeschliffen) \n\nDas begründet einen Tötungsvorsatz und könnte somit als versuchter Totschlag gewertet werden. (leider wird er wohl mit weniger davon kommen)",
            "Niedere Beweggründe.",
            "Nun, das Talent liegt hier beim Fahrer.",
            "Bin natürlich kein Jurist, aber [hier](https://www.gesetze-im-internet.de/waffg_2002/BJNR397010002.html) verstehe ich §5 (1) so, dass es eine Verjährungsfrist gibt. Es ist also wieder möglich.",
            "Ok, welches mordmerkmal ist da erfüllt?",
            "Das sind zwei völlig verschiedene Dinge.\n\nFür Mord brauchst du Vorsatz, ja. Das brauchst du aber grundsätzlich, für jede Straftat. Da hört es also auch schon auf \"grob in die Richtung\" zu gehen.",
            "[removed]",
            "[removed]",
            "Machst Du hier versteckte Snickers Werbung?\n\nAußerdem: \"Was haben sie zu dem Sachverhalt zu sagen?\" \"Tschuligom, hatte Hunger.\"",
            "ne",
            "Nach hitler oder so",
            "\"hier korrekten Artikel einfügen\"",
            "Angeblich \"ne\". Aber das ist einfach eine idiotische Darstellung.",
            "Aber NH ist doch 'nhaar' ich mein wer spricht denn den Buchstaben H wie ein 'he' aus das ist doch vollkommen idiotisch. Habt ihr im Kindergarten nicht den Alphabetsong gesungen",
            "Was?",
            "Jo, bei iwas-was-mit-Cannabis und Fahren hat man immer sofort den Führerscheinentzug und die MPU bekommen.",
            "Nun ja in diesem Fall sollte es ja sogar noch ernster gewertet werden als beim kudamm.. am kudamm der hat es durch sein rasen in Kauf genommen das er jemanden verletzen könnte. Dieser hier hat jemanden ganz konkret angefahren.",
            "Ein gemeingefährliches Mittel muss wirklich gemeingefährlich sein - Bombe oder so. Irgendwas was viele treffen kann.",
            "Das Mordmerkmal der niedrigen Beweggründe ist kein Auffangtatbestandsmerkmal, wenn sonst nichts zutrifft.",
            "Hass oder Wut? Ne Tötung in Kauf nehmen muss ja nicht zwangsweise unter Mord laufen. Versuchter Totschlag ginge ja auch",
            "Und selbst der Vorsatz liegt hier bei den uns bekannten Infos nicht auf der Hand, weil wir so circa gar nichts wissen. Wir wissen ja nichtmal ob der Täter komplett durchgetreten hat und 50kmh gefahren ist oder Schrittgeschwindigkeit. ",
            "[removed]",
            "Arabische Einflüsse würde ich vermuten.\n\nWie bei so viel in der heutigen Jugendsprache...",
            "Benutze es selbst nicht und bin mir daher nicht 100% sicher, jedoch ist es das, was ich am ehesten für richtig halte",
            "\\*Wh?",
            "ja sehe ich genauso.",
            "Bleiben trotzdem die niederen Beweggründe",
            "Ein Auto kann viele treffen.",
            "Die Sandsäcke an den Weihnachtsmärkten implizieren, dass Fahrzeuge durchaus in dieser Kategorie betrachtet werden.",
            "Hättest dir wenigstens die Mühe machen können nachzuschauen, dass das tatsächlich mordmerkmale sind, die du hier aufführst.",
            "Die könnten in der Tat erfüllt sein. Aber vorher muss man Tötungsvorsatz nachweisen. Der liegt natürlich nahe, die Abgrenzung da ist aber schwierig. Da reichen mir die Infos aus dem Artikel noch nicht.",
            "Wenn ich auf nur eine Person zufahre, dann kann ich auch nur eine Person treffen. ",
            "Der Täter darf die Wirkung auf eine Vielzahl von Menschen nicht in der Hand haben, das hat er bei einem Auto. \n\nJede Tatwaffe kann viele treffen, das macht sie noch nicht unkontrolliert gemeingefährlich",
            "Der Täter darf die Wirkung auf eine Vielzahl von Menschen nicht in der Hand haben, das hat er bei einem Auto.",
            ">das hat er bei einem Auto\n\nAb einem gewissen Punkt hast du das nicht mehr in der Hand. Und ja, es gab schon Urteile, in denen das Auto als gemeingefährliches Mittel betrachtet wurde.",
            ">das hat er bei einem Auto...\n\n... sehr schnell nicht mehr.\n\nFTFY",
            "Im konkreten Fall aber durchaus. Er raste ja nicht in eine Menschenmenge."
        ]
    },
    "\"Der Frust ist groß\": Standort Deutschland fällt ins globale Mittelfeld zurück": {
        "title": "\"Der Frust ist groß\": Standort Deutschland fällt ins globale Mittelfeld zurück",
        "score": 128,
        "url": "https://www.derstandard.at/story/3000000225275/der-frust-ist-gross-standort-deutschland-faellt-ins-globale-mittelfeld-zurueck",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Könnten wir Bürokratie exportieren?",
            "Habe den Artikel nicht gelesen, schließe mich aber den Upwählis im Thread an, dass das alles persönlich auf Lindners Befehl passiert und wir nur doch endlich den Kommunismus brauchen.",
            "Das ist alles halb so wild. \n\nUnser Wirtschaftsexperte hätte gesagt: Der Standort Deutschland ist nicht unattraktiv sondern nur nicht mehr beliebt.",
            "Ich gebe weiterhin dem Finanzminister aus der FDP eine große Teilschuld an der Situation. Wer sich immer nur hinstellt und sagt \"geht nicht\" \"zu teuer\" \"wer soll das bezahlen\", obwohl andere Minister und Regierungsparteien zig Ideen haben, um die Wirtschaft zu retten, zeigt eindeutig, wie wenig Ahnung er von der Finanzwelt und Wirtschaft hat. Wir brauchen Investitionen und neue Schulden, um diese Krise zu überwinden und Deutschlands Stand in der Weltwirtschaft zu stabilisieren",
            "Mit der Entscheidung des ersten Bundes-Kabinetts Merz für den Wiedereinstieg in die Kernenergie wird das alles in Ordnung kommen /s",
            "Ja, irgendwie war das doch eines der Dinger von der FDP, sich um die Bürokratie zu kümmern? Entweder ist mir das entfallen oder ich höre davon einfach nichts (mehr). Bürokratieverringerung ist einer der Ansätze, wo man am ehesten Unterstützung bekommen könnte politisch.\n\nEine schöne Analogie ist ja immer der Verkehr. Jeder noch so unbedeutende Kleinscheiß ist geregelt, aber selbst den lokalen Verwaltungen ist es mittlerweile einfach \"zu viel\", was dann in kreative Schilderkompositionen endet beispielsweise. Wenn selbst die Lokalregierung Probleme kriegt... hmmja.\n\nAllerdings hoffe ich, dass die Leute aus der Wirtschaft auch ein paar Finger intern herumgezeigt werden. Man kann ja immer bunt, dramatisch auf die Politik zeigen, aber es wäre auch schon zu wissen, was ihre Lösungswege sind? Wenn ich an deutsche Konzerne denke, dann sind die viel zu träge, konservativ, etc. Da ist auch Luft nach oben.",
            "schon geschehen. Mit Troika und EU haben wir das erfolgreich in die europäischen Saftnationen exportiert die weniger davon hatten als uns lieb war. Und dafür liebt uns ganz Europa. Keiner versteht wie es ohne deutsche Bürokratie mal gegangen ist. ",
            "Vergiss nicht, dass Grüne und SPD eigentlich \"einen richtig guten Job machen\", aber das noch nicht gut genug kommunizieren.",
            "Kann man nicht wissen, denn der wurde noch nie richtig ausprobiert.",
            "Endlich mal ein vernünftiger Kommentar",
            "> Habe den Artikel nicht gelesen\n\nDas wird standardmäßig angenommen, muss man also nicht extra dazuschreiben",
            "Die DDR war besser",
            "Es werden im Artikel 4 große Punkte angesprochen:\n\n1. Bürokratie: gut, da könnte auch die FDP noch mehr machen (einige Dinge werden ja aber noch erarbeitet), aber da sehe ich nicht, wo Lindner irgendwas in die Richtung verhindert hat? Es kommt halt von allen Seiten zu wenig in diese Richtung. \n\n2. Hohe Energiepreise: was hat Lindner hier verhindert? \n\n3. Hohe Steuern: Dass Lindner hier derjenige ist, der blockiert, kannst du nicht ernsthaft vertreten. \n\n4. Strafzölle: Lindner ist gegen die Strafzölle. Ebenso auch Habeck (obwohl er sie aktuell in China verteidigt/verteidigen muss) und Scholz. Teile der SPD wollen aber zumindest Strafzölle auf Produkte von Temu & Co. \n\nDas was Lindner primär verhindert hat bzw. versucht hat zu verhindern sind soziale Projekte. Ich sehe jetzt nicht, wie das irgendwas mit den angesprochenen Problemen zu tun hat. ",
            "Ja, du hast recht, aber geht nicht! \n\n- MfG Christian",
            "Ah ja der Finanzminister der sich an geltenes Recht hält ist schuld und nicht etwa die Partei die die Schuldenbremse verabschiedet hat in Regierungsverantwortung und jetzt wieder Milliarden für die Rentner durchsetzt \n\nMuss man wissen \n\n  \nWir brauchen dringend echte Reformen und langfristige Pläne die über eine letzte Party für die Boomer und nach mir die Sinnflut hinaus gehen. Wenn wir die Zuschüsse für die Rente streichen und Schulden aufnehmen hätten wir 100 Milliarden für Steuerentlastungen und Geld für Investitionen \n\nwas stattdessen passieren wird wenn die Schuldenbremse weg ist: Mehr Geld für die Rente, weil Respekt und so",
            "Es gibt genug Geld, man müsste es nur anders verteilen.\n\nDas \"Wir nehmen jetzt Geld für die Zukunft auf und zahlen es später dann zurück\" hat leider nie funktioniert. \nSonst währen wir ja jetzt nicht in der Situation, in der wir sind.",
            "Und was hat das mit dem Artikel zu tun? ",
            "Lindner und die CDU sins verantwortlich\n\n\n\n\nLinder weil er ums Verrecken nix ausgeben will und die CDU, weil sie mitten in Krisen die ohnehin knappen Kassen kleiner klagt",
            "Vorallem weil er derjenige wäre, der am lautesten nach Investitionen schreien würde, wenn er in der Opposition wäre.\n\nAber wäre hätte wissen können, daß regieren so schwer ist? /s",
            "Jeder weiß, wer Wachstum und Wettbewerbsfähigkeit will, der darf auf keinen Fall investieren. Wirtschaft durchgespielt der CL.",
            "Die FDP koaliert mit zwei Parteien, die große Fans von staatlicher Kontrolle, semi-planwirtschaft und Umverteilung in diverse Richtungen sind. Für diese Unterfangen braucht man nicht weniger Bürokratie, sondern mehr...irgendwer muss ja das Register der neuen Empfänger für X pflegen, den Hersteller von \"grünem Stahl\" kontrollieren usw..",
            "Gibt auch immer wieder Dinge, wo die FDP sich für Politik einsetzt, die zu mehr Bürokratie führt. Die Gängelung von Bürgergeldempfängern zum Beispiel. Oder die Schuldenbremse und die daraus in gewissem Maße resultierende Unterbesetzung von Ämtern und Kommunen",
            "Tatsächlich können andere Länder die EU-Verordnungen auch mit recht wenig Bürokratie umsetzen. Uns zwingt auch keiner, alles immer siebzehnfach (Bund und je Bundesland) zu implementieren. Trotzdem machen wir es irgendwie viel zu gerne",
            "Griechenland, wo Milch und Honig floss und wir Deutschen haben es kaputt gemacht.",
            "Diese eine gelbe 10% Partei aber, an der muss es liegen!",
            "Ehm nein?!",
            "Du hast nicht verstanden dass wir hier auf Reddit sind. Die Lösung liegt darin, dass wir 100 Milliarden Schulden machen, damit 300000 neue Sozialwohnungen in der Oberlausitz bauen und damit das Wirtschaftswachstum ankurbeln. Die Wohnungen werden dann Fachkräfte anziehen und die lassen wir dann mit noch mal 10 Milliarden Euro Elektroflugtaxis bauen. Das nennt man nachfrageorientierte Angebotspolitk, was übrigens daher kommt, dass man hinterher immer nachfragen muss warum der Plan nicht so aufgegangen ist, wie gedacht. Wie toll das ist, sieht man bspw. anhand Chinas Geisterstädten (bspw. Ordos ) mit denen man in China seit Jahren an einer Immobilienkrise vorbeischlittert. Völliger Schwachsinn denkst du jetzt? Nee, alles halb so wild. Staatsgeld ist nicht wirklich Geld, Schulden haben keine Auswirkung auf irgendwas und wenn Robert Habeck und Annalena Baerbock noch fünf Mal Klartext mit den Chinesen geredet haben, dann kommt die Wirtschaft auch wieder in Schwung. Ganz sicher.",
            "Der neue glaube an trickle down economics. Wenn man nur genügend Schuldgeld in Konzerne leitet landet das angeblich beim normalen Arbeiter und kurbelt die Wirtschaft an. ",
            "Hohe Energiepreise hat Lindner nicht lindern wollen.\n\n-> Habeck wollte einen Brückenstrompreis\n(Gibt’s nicht, zu teuer, angeblich)\n\n-> Habeck wollte Tenet kaufen um Nord-Süd Trassenbau zu beschleunigen um Redispatch-Kosten schneller zu senken\n(Linder sagt Nö, obwohl es nichtmal unter Schuldenbremse fallen würde)\n\n-> Allgemein hätten Netzentgelt und Netzauabaukosten die aktuell der Bürger trägt, entweder gesenkt oder vom Bund übernommen werden (je nach EU Regeln)\n\n-> Lindner wollte die Fördertöpfe für Umbau gering halten, waren innerhalb von wenigen Stunden komplett leer.\n\n-> Imo jedes Haus muss gedämmt werden, egal wann WP rein kommt. Heißt weniger Energieverbrauch, ergo höhere Verfügbarkeit für Industrie. Könnte bürokratiearm gestaltet werden, braucht aber Geld. (KFW Standards komplett überzogen, KFW Zinsen aktuell auch)\n\n\nSteuersenkungen kann Lindner auch nicht mit der Schuldenbremse durchziehen. \nDas Land hat einen Investitionsstau ihv ~700 Mrd. Eher 1 Billion bis es so weit ist. Der Staat kann Leistungen gar nicht so weit reduzieren um nennenswerte Geldsummen damit frei zu bekommen um ZUSÄTZLICH zu diesem Invest-Stau auch noch die Bürger zu entlasten. \n\n\nZudem könnte man es auch einfach nur gerechter verteilen. Aktuell zahlt die höchste prozentuale Abgabenlast die Mittel bis Unterschicht. Arbeit lohnt sich nicht, Erben und Kapitalerträge lohnen sich. Bei jedem  Euro über 70000 gehen beim Arbeiter erstmal 45% a den Staat. Wenn ich Millionär bin und für 7% am Aktienmarkt anlege, ist bei 70k immer noch 26% Kapitalertragssteuer. \nVereinfachte Rechnung: \nEine Million im ACWI zu ~7% angelegt sind nach Steuern knapp 52k im Jahr. \nArbeiter mit 70k nimmt 43k nach Steuern nach Hause. \nUnd dazu muss man sagen; die “Millionäre” sind in dem Sinne noch nicht das Problem. Die wirkliche Ungerechtigkeit beginnt so ab 10 Mio. \n\n\nLindner könnte auf einen Schlag den Arbeitnehmerpauschalbetrag (Werbungskosten) von 1000€ auf 3k€ erhöhen, heißt; Millionen von Mitbürgern müssen keine Steuererklärung mehr machen und haben mehr Geld in der Tasche. Die freien Stellen bei den Finanzämtern können sich dann um große Unternehmen kümmern, die gerne Milliarden am Fiskus vorbeitragen.\n\n\nHat Lindner wirklich Schuld an Allem? Nein. Natürlich nicht. Er hat sich aber leider auf eine “1 Programm” wenn nicht sogar “Eine Position” Partei reduziert. Und das noch mit einer Position, die uns wirtschaftlich schadet.",
            "Die Schuldenbremse ist bei weitem nicht das einzige Gesetz, dass durch sie geltendes Recht an vielen anderen Stellen gebrochen wird interessiert ihre Verfechter leider kaum.",
            "> an geltendes Recht hält\n\nund\n\n> Zuschüsse für die Rente streichen\n\nWenn du ein sofortiges, vollständiges und/oder ersatzloses streichen der Zuschüsse meinst kannst du nicht beides haben.\n\n> Schulden aufnehmen\n\nGeht ja nicht, weil sich der Finanzminister an geltendes Recht hält & auch keinen Willen zur Änderungen an der Schuldenbremse zeigt.\n\nIch bin auch großer Fan davon, ganz viel am Rentensystem zu ändern, aber ganz so einfach ist der Haushalt dann doch nicht aufzulösen.",
            "Das Problem ist nicht, dass er sich an die Schuldenbremse hält, sondern ihr größter Verfechter ist. Die Schuldenbremse mit \"Ja, vielleicht wird das Geld ja falsch ausgegeben\" zu begründen, ist auch eine schwierige Argumentation. Sowas gehört ganz sicher nicht ins Grundgesetz.",
            "Wenn dann ist das Bundesverfassungsgericht schuld, weil sie die Schuldenbremse so strikt ausgelegt haben.",
            "Lindner ist zu kritisieren, weil er an offensichtlich falschen und gut widerlegten Thesen festhält (e-fuels, trickle down, etc), nicht dafür, dass er nicht mehr Geld bewilligt als was der Haushaltsplan vorsieht.",
            "Und zwingt keiner von außen, außer das Grundgesetz und der darin verankerte Föderalismus.\n\nEs gibt so ein paar Themen, die mich persönlich betreffen, wo weniger Föderalismus und Bürokratie eine ganz interessante Veränderung bedeuten würden. Der Föderalismus in Deutschland ist aber historisch gewachsen und sehr, sehr alt.",
            "Natürlich ist GR größtenteils selbst am der Misere Schuld.\n\n\nNicht aber an der längsten Rezession der Nachkriegszeit.  \nDeutsches Spardiktakt, Privatisierung (=billiger Verkauf an deutsche und andere Unternehmen) etc haben das Wunder vollbracht.  \nUnd die Folgen sieht man in den kommenden Jahren endlich auch in Deutschland.",
            "Hey, eine 6,x% Partei hat in zwei Jahren den Ausstieg aus der Kernenergie durchgekommen, da muss eine 10% Partei in drei Jahren viel mehr erreicht haben.",
            "Hä? Schießbefehl und militarisierter Überwachungsstaat zeugen von Wirtschaftlichkeit! Ein Land das Teenager über eine gesperrte Grenze entführt um Anerkennung zu erpressen ist ein besseres Land als ein alternder wirtschaftsgigant im Herzen von Europa.",
            "> Wenn du ein sofortiges, vollständiges und/oder ersatzloses streichen der Zuschüsse meinst kannst du nicht beides haben.\n\nStimmt natürlich. Man kann es aber auch fortlaufend machen. Die Rente nach 45 Beitragsjahren ab 2025 abzuschaffen wäre kein Problem (oder ggf etwas später, keine Ahnung wie lange da so die antragsfristen etc sind). Das spart natürlich nicht direkt die vollen ~13 Milliarden ein, nach 2-3 Jahren sollte man aber so weit sein. ",
            "Und um es noch mal hinzuzufügen: nur Artikel 1 ~~bis~~ und 20 des GG sind von der Ewigkeitsklausel (Artikel 79 Absatz 3) betroffen. Artikel 109 GG könnte man also ändern, wenn man wollte. Der Wille ist aber nicht gegeben.",
            "Die Sparpolitik gibt es schon lange in Deutschland und die Folgen kann man täglich sehen, wenn man will.\n\nIch empfehle mal einen Blick in Deutschlands Schulen.",
            "Die Troika hat daran nicht viel gemacht, ohne wäre die Wirtschaft auch zusammengebrochen da die andere Möglichkeit der Austritt gewesen wäre. Außerdem sieht man außerhalb von Athen sehr gut was das große Problem war, Korruption und Bürokratie. Angefangene Gebäude ohne Ende nur um Subventionen einzustreichen, Steuerhinterziehung in jedem Laden, Renten obwohl der eigentliche Bezieher lange tot war, nicht nachhaltige Modelle wie Massentourismus. Das sind nicht die deutschen Schuld sondern die Unfähigkeit der Regierungen zu Reformen.",
            "...und das mit dem freien Markt wird sich eh nie wirklich durchsetzen.",
            "Aber es gab bessere Kinderbetreuung in der DDR!1!!!!!11!1!!",
            "> könnte man also ändern\n\nWo ist die 2/3 Mehrheit dafür im Bundestag? Sagen wir mal Chrisi würde es endlich einsehen. Trotzdem werden viele FDPler und vermutlich auch Seeheimer SPDler dann von der Linie von Lindner abweichen und AfD, BSW und CDU würden zugerne die Ampel brennen sehen das diese nie dafür stimmen würden.",
            "Lies Bitte nochmal Artikel 79 Absatz 3.  UND ist das Schlüsselwort.",
            "Lies dir den Art. 79 (3) bitte noch einmal durch. ",
            "Man sieht ja was man davon hat!\n\nDas hätt's mit dem Hoenecker nicht gegeben...",
            "Du hast natürlich Recht, ist korrigiert. Ändert nichts daran, dass man 109 ändern könnte."
        ]
    },
    "Hessen trödelt bei Anerkennung von Heilberuflern – Fachkräfte wandern ab": {
        "title": "Hessen trödelt bei Anerkennung von Heilberuflern – Fachkräfte wandern ab",
        "score": 146,
        "url": "https://www.fr.de/rhein-main/landespolitik/hessen-heilberufen-droht-die-arbeitslosigkeit-93144082.html",
        "content": "",
        "num_comments": 37,
        "comments": [
            "\"Trödeln\" ist hier auch eine leichte Untertreibung. Ich kenne ausländische Ärzte die alle Unterlagen eingereicht haben, alle Prüfungen bestanden haben und eine Jobzusage haben aber seit > 6 Monaten auf eine Berufserlaubnis warten. Das ganze Verfahren für die Anerkennung der Approbation dauert gerne mal über 2 Jahre. Der Flaschenhals ist nicht die eigentliche Prüfung der Abschlüsse (die wird von der Landesärztekammer gemacht) sondern die schlichte Bearbeitung der Anträge.",
            "Ich dachte erst, es ginge um Heilpraktiker. Darüber wäre ich happy gewesen, aber so… =\\",
            "tja, und so wird das Land mit Vollgas gegen die Wand gefahren.",
            "Jedes Mal wenn ich Land höre, höre ich Behörden. Wenn ich Behörden höre denke ich automatisch an Passierschein A38. Wenn ich dann noch von Freunden mitbekomme, dass Datenhaltung in Excel gleich Digitalisierung ist, dann kann man den Laden hier eigentlich direkt zu machen.",
            "heißt das, dass die anderen Bundesländer diese Leute haben kann?",
            "Bei Homöopathen würde ich das Trödeln jetzt persönlich nicht verurteilen.",
            "0.01% wandern deswegen ab\n\nIst im Signal to noise nicht mehr unterscheidbar",
            "Und die Ursache ist leider mit an Sicherheit grenzender Wahrscheinlichkeit \"Bürokratieabbau\" in Form von Stellenabbau für entsprechende SachbearbeiterInnen.",
            "Ich kann hier nur exemplarisch für die Darmstädter Ausländerbehörde sprechen, und das auch nicht als direkt Betroffene Person (die Ehre gebührt dem Einwohnermeldeamt, bei dem ich nun mit anderthalb Jahren abgelaufenen Perso weiter vergeblich hoffe, einen Termin zu ergattern), aber was da läuft, präziser absolut gar überhaupt nicht läuft, entbehrt jeglicher Konzepte, die sich in der deutschen Sprache ohne übermäßigen Gebrauch herber Kraftausdrücke darstellen ließen. Auf onlineterminvergabe wird auf der Behördenwebsite zwar hingewiesen, aber ähnlich wie beim Einwohnermeldeamt werden diese Termine scheinbar nicht freigeschaltet. In der Konsequenz muss man als Betroffener teilweise um 03:00 Uhr an Sprechstundentagen am zentralen Platz aufschlagen und sich einreihen, um die Hoffnung zu haben, eine Wartenummer zu ziehen, die am entsprechenden Tag noch bearbeitet wird. Falls die feinen Damen- und Herrschaften das nicht mehr am selben Tag abarbeiten können, verfällt die Wartenummer selbstverständlich.\n\nWir sind eine, naja, irgendwie große Universitätsstadt und bilden entsprechend viele Leute mit nicht-EU Pass aus. Wenn die Leute aber Bock haben, hier ihre Abschlüsse umzusetzen, an ihre Praktika anzuknüpfen oder ihren hier geknüpften Beziehungen eine Perspektive zu geben, glänzt die Behörde flächendeckend mit *Furzgeräusche durch angespannte Lippen und teilweise ausgestreckte Zunge*. Das ist kein Forumquirk, sondern die ehrlichste Einschätzung, die diese Beobachtung über gut fünf Jahre zulässt. Denn wie anfangs angeführt, für die konzentrierte Gleichgültigkeit gehen die sprachlichen Konzepte einfach aus.\n\nIch kenne mindestens ein paar, das sich vor Plan verehelicht hat, weil die Gammelkacke nicht mehr tragbar war und zu einem zeitweisen Aufenthaltsverlust einer der beiden geführt hat. Die zuvor zugesagte Stelle hier war in Folge selbstverständlich auch weg. Dass in jeder Industrie über Fachkräftemangel geplärrt wird, aber unser unfähiger Behördenapparat die hier ausgebildeten Leute nicht einmal mit einer fortfolgenden Aufenthaltserlaubnis ausstatten kann, ist hahnebüchend. Wir haben kein Integrations- sondern ein integrierungsproblem! Zuckmayer hatte mit den behördlichen Missständen, die im Hauptmann von Köpenick dargestellt recht und wir nehmen schulterzuckend hin, dass lediglich der Lifehack mit der Offiziersuniform ausgebessert wurde.",
            "Und dann können in guter deutscher \"Wir führen Scheindebatten, um Lösungen zu vermeiden\"-Tradition wieder alle nach Bürokratieabbau schreien.\n\nDenn mal darüber zu reden, dass einfach nicht genug Personal da ist (vergleiche angestellte im öffentlichen Dienst im Verhältnis zur Bevölkerung in anderen Ländern), widerspricht ja dem Narrativ.",
            "Wenn der gleiche Bearbeiter für die Anträge, auch die, von den Flüchtlingen machen muss, dann weißt du, wieso die Wartezeit so lange ist. In unserem Kreis werden alle Anträge erst bearbeitet, nachdem die Ukrainischen bearbeitet worden sind.",
            "Dann wäre ja nicht die Rede von Fachkräften...",
            "Ja das dachte ich auch erst… das hätt ich sogar gut gefunden.",
            "Und dabei wichtig zu erwähnen, dass es nicht immer \"Mangel an Arbeitskräften bei den Behörden ist\", sondern oftmals die Prozesse scheinbar so extra kompliziert sind, dass sie sehr viele Arbeitskräfte binden und finanzieren. Systeme haben die Eigenschaft, zu wachsen...",
            "Eintragung einer Galeere? Da müssen Sie zum Hafen!",
            "Fun fact  hessen hat kein einheitlich  e akten systeme.....  ich weiß von drei unterschiedlichen...\n\n\nDa zu hatte ich das A38 letzten mit dem Arbeitsamt  für Förderung  des arbeits platz.....  habe mal die arbeit zeit die dafür drauf genagen sein muss x Mindestlohn   und sind schon bei 800 plus euro. Und alle beteiligen  bekommen als mindelohn. \n\nEs geht um kosten  von 120 euro im jahr",
            "Arbeite zwar nicht in einer Behörde, aber ich füttere größtenteils exceltabellen, was dem Land dann als Digitalisierung verkauft und von diesem gefördert wird...",
            "Sind schon deutlich mehr und \"Abwanderung\" heißt hier nicht primär Ausland sondern anderes Bundesland.",
            "Jedes Jahr verlassen 1 Millionen Menschen Deutschland darunter 70% Ausländer. Der brain drain hat bereits begonnen und der Aufschwung der AFD und die Ausländerfeindliche Stimmung in der Gesellschaft wird ihn weiter beschleunigen.",
            "Das sind dann aber auch Ketten Effekte... Die erzählen Freunden, Verwandten, Kollegen und im Internet wie Scheisse es ist",
            "Eher andersrum.\n\nDer derzeitige und auch frühere Bürokratieabbau funktioniert so, dass man ganz viele neue höhere Stellen schafft, die den Bürokratieabbau managen sollen.\n\nGibt dann am Ende also die alten Stellen mit mehr Aufwand und die neuen Stellen, die denen Vorgaben machen.\n\nDas Spiel wiederholt man alle paar Jahre und dann ist man in dem Bürokratie-Irrenhaus, dass wir uns geschaffen haben.",
            "Dafür reichte es, keine neuen Stellen zu schaffen. Der Antel ausländischer Ärzte hat sich seit der Ärzteschwemme mehr als verfünffacht, in absoluten Zahlen noch mehr. Da reicht es einfach nicht zu expandieren.",
            "Sowas wie das hier:\n\nhttps://www.reddit.com/r/Darmstadt/comments/1dlrnys/darmstadt_ausländerbehörde/\n\ndas geht einfach nicht. Die Darmstädter Ausländerbehörde ist ja auch schon seit Jahren berüchtigt.  Es ändert sich einfach nicht, einfach unglaublich frustrierend.",
            ">Wenn der gleiche Bearbeiter für die Anträge, auch die, von den Flüchtlingen machen muss, dann weißt du, wieso die Wartezeit so lange ist.\n\nZitat den ich irgendwo mal gelesen habe: \"Du glaubst die Ausländerbehörde ist schlecht aber das HLfGP ist der Endgegner.\"\n\nDas ist ja das eigentlich erschütternde. Die Ausländer die beim HLfGP landen sind oft schon durch die Ausländerbehörden durch. Das HLfGP hat nicht direkt was mit Asyl o.ä. zu tun. Es beschäftigt sich u.a. mit der Anerkennung von Abschlüssen im Gesundheitsbereich. Also damit Ausländer die wir explizit wollen die Arbeit in Berufen zu ermöglichen die explizit gebraucht werden. Wenn nicht mal das gelingt dann sehe ich sehr schwarz.",
            "Wenn das BaWü gewesen wäre vielleicht schon...",
            "Als Heilpraktiker ist man keine Fachkraft, das liegt jetzt aber nicht an dem woran sofort alle denken, sondern daran, dass in Fachkraft das Wort Fach steckt, was ja irgendwie eine Schublade ist und als Heilpraktiker lässt man sich “Individualist” nicht in Schubladen stecken.",
            "Ja die Prozesse sind ein großes Problem. Ich hab mein Auto online abgemeldet. Der Prozess verlangt aber anscheinend einen Eingriff eines MA. Klasse, bin ich dann ohne gültige Plakette herum gegurkt, zu den einzelnen Behörden, zu denen ich dann durfte.",
            "Der Mangel besteht ja sehr oft auch darin, dass man zwar in den letzten Jahrzehnten konstant immer mehr Personal aufgebaut hat, aber der Bürokratische Wahnsinn im Verhältnis deutlich mehr geworden ist. Dann hat die Behörde vielleicht zwar 50% mehr Personal als vor 20 Jahren, aber trotzdem doppelt so viel \"Arbeit\".",
            "Und dabei wichtig zu erwähnen, dass es nicht immer \"Mangel an Arbeitskräften bei den Behörden ist\"\n\nNicht immer, aber oft genug. Aber statt das zu ändern schreien dann wieder alle nach Bürokratieabbau... was in Fällen einfacher Anträge, für die nur einfach nicht das Personal vorhanden ist, eigentlich immer die übliche Tarnung für Abschaffung von minimaler Regelungen, damit Privatunternehmen unkontrollierter arbeiten können, ist.",
            "Ohja… ich sag nur Elterngeldantrag „online“. Wenn man die zig Seiten online ausgefüllt hat heisst es: druck den Kram aus, schmeiß ein paar Kilo Gehaltsnahweise dazu, die man ausdrucken darf, weil ja schon digital, und schick den Kram per Post, besser gesagt per Spedition. Es regt einfach nur auf…",
            "Sag mir bitte, dass du sie jetzt automatisch füttern lässt und so, wie der eine Typ vor einiger Zeit, du eigentlich nur zockst in der Zeit 😂",
            "Dafür brauchst du Freunde? Die Medien in Detuschland tun doch seit einigen Jahren ununterbrochen nichts anderes.",
            "Als jemand der auch in der Bürokratie arbeitet möchte ich noch den nächsten Schritt vorstellen: Sachbearbeiter Stellen werden dann gestrichen, da man sparen muss und die neue unnötige Aufsichtsbehörde ist ja sooo wichtig",
            "Naja so ganz hat der Kommentar über dir nicht unrecht. Besonders die FDP und manche CDU-Verbände (aber auch andere Parteien, da nur weniger häufig) sprechen gerne von Bürokratieabbau, wenn sie eigentlich nur Stellen streichen.\nWar ja bei der Kindergrundsicherung auf Bundesebene ähnlich. Da wurde von „unnötiger Bürokratie“ gesprochen, als es um die bis zu 5.000 neuen Stellen ging, die die Kindergrundsicherung bringen würde. Dass das System tatsächlich weniger Papierkram bedeuten würde, die neue Behörde Aufgaben mehrere anderer Behörden übernehmen würde, gerade auf kommunaler Ebene weniger Bürokratie zu machen wäre und vor allem mehrere Sozialleistungen in einem Antrag gebündelt wären und damit ganz konkret Bürokratieabbau entstehen würde, wurde völlig ignoriert.\n\nViel zu oft wird Bürokratie an der Menge der Abgestellten gemessen anstatt in der Menge an Anträgen und ihrer Bearbeitungsdauer.",
            "Das Problem ist, dass alle Darmstädter Behörden seit Jahren eklatant beschissen laufen, die Ausländerbehörde aber als eine Stelle, die in einer Universitätsstadt, in der junge ausländische Lernende deutsche Abschlüsse erlangen, die aber nicht nutzen dürfen, weil irgendwas zwischen Unwillen und Unfähigkeit den Papierkram, den die um hier leben, lernen und/oder arbeiten zu dürfen ums verrecken nicht auf die Kette bekommt, ganz besonders hervorragt.\n\n\nEs kann mir niemand erzählen, dass hinter dem versiegen von Haushaltsmitteln aus der Bildung und dem einlaufen von Steuereinnahmen durch hier geleistete da nicht künstlich eine Barrikade aufgebaut wird. Da kann nichts anderes als politischer Wille hinter stecken.",
            "Als Freiburger tut das so weh, weil es wahr ist.",
            "Oh Mann.. mein Hirn hat Freibürger raus gemacht und mein erster Gedanke war: \"Ist das sowas wie ein Reichsbürger?\""
        ]
    },
    "AfD-Landrat muss Fragen beantworten - Der SPIEGEL siegt gegen Sesselmann": {
        "title": "AfD-Landrat muss Fragen beantworten - Der SPIEGEL siegt gegen Sesselmann",
        "score": 118,
        "url": "https://www.spiegel.de/politik/deutschland/robert-sesselmann-der-spiegel-siegt-vor-gericht-gegen-afd-landrat-a-a339657d-4c99-48a7-bb59-ddd7616ce508?sara_ref=re-so-app-sh",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Haha, was sie in dem anderen Artikel geschrieben haben ist ein guter Brenn:\n\n> Er wollte Verhandlungen mit Putin, die Grenze schließen und raus aus dem Euro. In der Praxis scheitert Robert Sesselmann, erster AfD-Landrat Deutschlands, schon an einer Natursteinmauer.",
            "> Der Mann, der im Wahlkampf eine »verlässliche und geradlinige Politik zugunsten der Bürger« versprochen hatte, verweist in Bürgergesprächen kleinlaut an das zuständige Landesamt, an den Rechnungshof, auf leere Kassen oder einfach auf die da oben.\n\nIst halt typisch Totalitarismus. Erst wenn **alles** von \"uns\" beherrscht wird, können wir wirklich was machen.",
            ">Der Beschluss ist noch nicht rechtskräftig, eine Beschwerde an das Thüringer Oberverwaltungsgericht ist möglich.\n\nSo ganz stimmt der Titel (noch) nicht.",
            "Link zum Artikel den der Spiegel im April über [Sesselmanns Arbeit trotz dessen spärlicher Auskünfte geschrieben hat](https://archive.ph/T0cny).",
            "Halt typischer AfD-Schwätzer, der an der Realität scheitert.",
            "WO IST DIE MÜNZE HERR SESSELMANN??",
            "„Was hat der Landrat getan, um kriminelle Asylbewerber abzuschieben?“\n\nIst aber auch etwas frech vom Spiegel. Der Spiegel weiß ganz genau, dass ein Landrat da rechtlich überhaupt nichts machen kann bzw darf. Abschiebefragen werden von Bund und Land geregelt. Wie quasi alles in der Asylpolitik, was die Gemeinden in Deutschland ja so aufregt, weil sie nichts entscheiden aber viel bezahlen müssen. \n\nDie Frage ist offensichtlich so gedacht, dass der AfD-Typ nur „nichts“ antworten kann, was der Spiegel dann gerne so präsentiert hätte.\n\nGanz generell sollte man sich vergegenwärtigen, dass Landräte/Bürgermeister inzwischen quasi kaum eigene Politik machen können. Die Finanzen der Gemeinden in Deutschland sind inzwischen teils so katastrophal, dass man einfach nur noch die sog. Pflichtaufgaben machen kann (die eine Gemeinde machen muss). Wirklich Gestaltungsspielraum hat man nicht. Ist eher ein Verwalterjob.",
            "Und es ist seitdem nicht besser geworden:\n\n>Vor knapp einem Jahr wurde Robert Sesselmann zum ersten AfD-Landrat Deutschlands. Gefordert hatte er viel: den Euro abschaffen, Grenzen schließen, die Kliniken vor Ort erhalten. Doch Erfolge sind rar, stattdessen sind die Straßen marode, Schulen schließen und es gibt finanzielle Engpässe. Eine herbe Enttäuschung für viele Bürger.\n\nhttps://www.focus.de/politik/deutschland/sesselmann_id_260070274.html",
            "Ich muss im hier aber insofern Recht geben, dass eine Kontrolle des Gelddruckers, wofür du in der Bundesregierung sitzen musst, durchaus einen massiven Unterschied machen würde.\n\nWobei es auch Untersuchungen gab, dass die AfD ihren ganzen Kram gar nicht durchsetzen kann, weil sie viel zu sehr sparen würde, da sie panisch Angst vor Schulden hat.",
            "Er ist vielleicht nicht rechtskräftig, aber zumindest recht kräftig ",
            "Die Mehrheit ist leider schnell und einfach beeinflusst man sieht es an den EU wahlen.",
            "Er wollte auch den Euro abschaffen und kann darüber als Landrat nicht entscheiden...",
            "Nein ist nicht frech vom Spiegel, sondern von dem lieben Hr. Sesselmann, der ja komplett Wahlkampf mit dem Thema gemacht hat. Wenn er das verspricht, dann muss man ihm auch daran nehmen. Wenn der AfD-Idiot meint, leichten Wahlkampf machen zu können, weil er nur auf Themen geht, die gar nicht seine Kompetenz sind... Dann hätte er damit keinen Wahlkampf machen sollen. Es ist absolut in Ordnung, ihn auf seine eigens gesteckten und groß rumposaunten Themen anzusprechen. ",
            "Bezieht sich übrigens auf das hier:\n\n\nSesselmann versprach die sofortige Abschiebung »krimineller und abgelehnter Asylbewerber«. Denn, so stand es in einem Flyer zur Stichwahl im Juni 2023: »Wir sind nicht das Weltsozialamt!«",
            "Ach was, hör auf. Die AfD erzählt populistischen quatsch?",
            "Naja dad weiß man aber halt vorher\n\nDass selbst auf unterstem Level Wahlkampf mit europäischer Außenpolitik oder Spritreisen gemacht wird und die Leute echt drauf reinfallen weil sie keine Ahnung von den Kompetenzen des jeweiligen Amts haben ist einfach nur stumpf",
            "> weil sie viel zu sehr sparen würde, da sie panisch Angst vor Schulden hat.  \n  \nGlaubst du wirklich, dass diese Angst die ersten 5 Minuten an der Macht überleben würde?",
            "Hat er echt behauptet, als Landrat den Euro abschaffen zu wollen? Ist ja fast schizophren.",
            "Du hast da schon Recht, ich kannte die Hintergrundgeschichte bezüglich Wahlkampf vom Landrat nicht.",
            "Verstehe. Da hat der Mann mehr versprochen, als er als Landrat rechtlich an Kompetenz hat.",
            "Naja bei der AfD kann man grundsätzlich fragen, ob überhaupt irgendwas aus ihrem Wahlprogramm die ersten 5 Minuten an der Macht überleben würde...",
            "Der hat versprochen was seine potentiellen Wähler hören wollen. Nicht was er umsetzen kann."
        ]
    }
}