{
    "8.0.2 | Bugfix Patch": {
        "title": "8.0.2 | Bugfix Patch",
        "score": 553,
        "url": "https://www.reddit.com/r/deadbydaylight/comments/1djkhi5/802_bugfix_patch/",
        "content": "https://preview.redd.it/v685ipg1cj7d1.png?width=1000&format=png&auto=webp&s=1b83fa0a1288930290a9916b5d22a73df9f69bb0\n\n# Content\n\n# Environment/Maps\n\n* In the Forgotten Ruins Map, at least 4 hooks will now always be available in the dungeon section of the map.\n* In the Forgotten Ruins Map, Passage locations have been adjusted to avoid being directly beside vaults and pallets.\n* Passage interaction time has been extended by 0.15 seconds for Survivors and shortened by 0.25 seconds for Killers.\n\nhttps://preview.redd.it/9si6jwkjcj7d1.png?width=1000&format=png&auto=webp&s=34d6b57f0e3069863b162a110efdad59243c25dc\n\n# Characters\n\n**The Lich**\n\n* Increased Mage Hand pallet lifting time from 0.35 seconds to 0.5 seconds.\n* Increased the volume on Flight of the Damned skeleton spawn to give better awareness to Survivors.\n* Addon Ring of Telekinesis: Activating Mage Hand on an Upward pallet increases your general vault Speed by 10% for the next 8 seconds.\n* Addon Vorpal Sword: Increasing time to break pallet from 2.2 seconds to 3.2 seconds.\n\nhttps://preview.redd.it/ij0pknclcj7d1.png?width=1000&format=png&auto=webp&s=6c0065f465bfd76829b9cb364e496c41ba6f5f30\n\n# Bug Fixes\n\n# Anniversary\n\n* Fixed an issue that caused some VFXs to appear late when a Player that was far away approaches the location where they appeared\n* Cancelling an Invitation Pillar interaction no longer causes the gold glitter VFX to linger and fail to respawn the scroll atop the Pillar.\n* The Dancing Marionettes no longer clip with the ceilings of the Underground Complex.\n* Survivor's pools of blood no longer disappear very rapidly after the effect of the \"Quiet Mode\" ability is over\n\n# Archives\n\n* Fixed an issue where progress could not be made with some iterations of the Bronze Age challenge.\n* Fixed an issue where multiple recent Tomes were using the same cover color in the Compendium screen of The Archives.\n\n# Characters\n\n* Fixed an issue where the Lich's hand teleports away from the survivor for a frame at the end of the assimilate animation.\n* Fixed an issue where the The Lich can be seen entering the Passage during the selection animation.\n* Fixed an issue that caused a few Killers' motion trail VFX to not play correctly.\n* The Lich's Spell Indicator VFX no longer becomes distorted when players change the First Person FOV while Full Screen/Windowed Full Screen on an Ultra Wide Monitor\n* The Hand of Vecna's Locker Smoke VFX no longer appears before the locker doors open when Survivors fast-exit a destination locker after teleporting\n* Survivors no longer obtain items from The Lich's chest in the dying state\n* It is no longer possible for a Survivor to teleport into the locked room on Temple of Purgation with the Hand of Vecna\n* The assimilated Hand of Vecna no longer jitters and becomes desynced with the Survivors arm when moving\n* The animation of The Lich's chest can no longer be skipped if the Survivor presses the interaction button while the animation is playing.\n* Fixed an issue where the Blight might not enter the fatigue state after destroying a wall or pallet with a rushed attack.\n\n# Environment/Maps\n\n* Fixed an issue in Garden of Joy where a Survivor could climb on the rock on the edge of the map\n* Fixed an issue in the Temple of Purgation where content of the map could block the collision of the Killers only\n* Fixed an issue in Lery's Hospital where the Killer could not pick up a Survivor that was crawling against a blocker\n* Fixed an issue in the Forgotten Ruins where a placeholder tile would appear in the environment\n* Fixed an issue in Decimated Borgo where a blocker would prevent the Killer from passing\n* Fixed an issue in Lery's Hospital where a Survivor on hook would prevent the Killer from navigating\n* Fixed an issue in Toba Landing where the Survivors could run on the railing of the stairs\n* Survivors entering a Passage at the same time no longer get stuck\n* Entry into a Passage is no longer cancelled when Victor Pounces on a Survivor entering a Passage\n* Survivors no longer get stuck in the Killer's collision when a Killer waits for Survivors at a Passage's exit.\n* The camera no longer gets stuck on the Spectator's POV when the in-match Survivor uses the Passage while the Spectator was being mori'd\n\n# Perks\n\n* Illusions spawned by the Mirrored Illusion perk now correctly despawn when the Killer walks through it\n* The Mirrored Illusion perk no longer charges when an Illusion is already active.\n* The Dark Arrogance perk's bonus vault effect no longer incorrectly applies to other Killer abilities.\n\n# Misc\n\n* Medkits now fully deplete when self-healing to 100% with no add-ons\n* Fixed an issue that caused the Entity window blocking effects not to block a window that was just unblocked after 3 consecutive rushed vaults\n* Survivors no longer get stuck in the hooked state when the killer is interrupted",
        "num_comments": 473,
        "comments": [
            "**You can report bugs encountered in this patch using the following thread:**\n\n[Bug Reports & Tech Support: Update 8.0.2 | Bugfix Patch](https://www.reddit.com/r/deadbydaylight/comments/1djkvbj/bug_reports_tech_support_update_802_bugfix_patch/)",
            "That med kit change is going to make the deplete a med kit challenges slightly more complicated.",
            "Any word on remote hooking/flashlight save bugs being fixed?\n\nhttps://preview.redd.it/irlaibaarj7d1.jpeg?width=3840&format=pjpg&auto=webp&s=b1bae43a360b901193e35a849bc4ee09a197c905\n\nI was remote hooked as killer was blinded and it sent me into limbo unable to interact or be interacted with. Had to leave match and take DC penalty. Happened a few times between last night and this morning.",
            "Hooks and Portals have been fixed.  \nWhat about Gates and Pallets upstairs? That part of the map is unbereable for survivors .",
            "Most excited for the hooks change in the dungeon. Damn near impossible to hook if they go down in the main hallways.",
            ">Mirrored Illusion perk no longer charges when an illusion is already active\n\nBro WHY??? What is wrong with you guys it’s already dogshit.",
            "so that weird bug where if you make a save for someone you end up being hooked immediately instead isn’t fixed. very good!",
            "There's no way they didn't miss a bug pass on the Blight right? Please tell me it's fixed and just not in the notes.\n\nEDIT: Blessed Be",
            "Idk if this is just in console but about 40% of the time I either kick a gen, hook a survivor, or break a pallet, I get kicked from the match and it says that the server cannot be connected to",
            ">Fixed an issue in Garden of Joy where a Survivor could climb on the rock on the edge of the map\n\nDidn't know this was still in the game. Wasn't the map killswitched or something to fix this bug a while ago?",
            "Has there been any word on Bubba's bug where he enters the wall break animation when chainsaw sweeping through an already broken breakable wall? It has been happening to me very frequently on the most recent patch.\n\nThere's also the tantrum bug where he gains tantrum meter way too quickly and tantrums immediately upon charging chainsaw.\n\nHope those can get fixed soon.",
            ">Increased the volume on Flight of the Damned skeleton spawn to give better awareness to Survivors.\n\nSo this is the Flight of the Damned \"nerf\" the community was dreading?",
            "They didn’t even fix the the event with sadako when you play her during the event the ring is literally in her face and you can’t see shit",
            "was the problem with DS affecting each killer differently fixed?",
            "Did you fix the flashlight save into the hook + survivor stuck to killer glitch",
            "why are we making victor unable to stop survs going through portals but not making victor be able to go through portals?!?!? same with knight with guards",
            "Xbox still has fps drops and I see nothing on here about it. Sad",
            "There's a bug with Legion. If you equip a mask other than the one from the new cosmetic set, susies voice is the one from Frank.",
            "* The Mirrored Illusion perk no longer charges when an Illusion is already active.\n\nnoooooooooo my haha funny perk \n\nNo fix for the remote hook randomly hooking other survivors? Hasn't happened to me but I've seen it posted a few times on the sub.",
            "What was Datk Arrogance applying to that it shouldn't? Just legion?",
            "Is That Pallet In Forgotten Ruins™ (you know the one) still there? If so, at this point I'm expecting them to just keep it as is.",
            ">Medkits no longer fully deplete when self-healing to 100% with no add-ons\n\nWas this change done for Syringes/Antiemostatic agents? Or was it done because of mangled?",
            "Nice of you to nerf the portals & the dungeon on the ruins map but not address the fact that you only have 4 terrible pallets above ground...",
            "\"The Dark Arrogance perk's bonus vault effect no longer incorrectly applies to other Killer abilities.\"\n\nHalf of Legion's power is \"vault fast\". Why is it no longer okay for vault speed increasing perks to work with Frenzy?  They worked with Frenzy just fine for ages, and part of it is that you have to sacrifice a perk slot that could have been used on slowdown or aura or basically anything else in order to get the increased vault speed. In most cases, it was just fun to use as many vault speed perks together as a build, for the sake of having the zoomies all over the place. Which again, isn't overly powerful as the most Legion can do during Frenzy is deep wound unless they've managed to get 4 Frenzy hits prior which is already a very uncommon event when playing against competent survivors on larger maps.",
            "THEY FUCKING NERFED MIRRORED ILLUSION WHAT THE FUCK?!",
            "What's the expected result for the medkit change? \n\nDidn't it already consume 100% charges if you didn't hit a great skill check?\n\nIf I heal my 10% remaining with a full medkit, will it deplete completely too?",
            "Did they fix that one pllet on Forgotten Ruins that can just be walked past?",
            "DS still not fixed, Blight's breaking pallets with no cd not fixed/Blight is not getting killswitched \n\n*sigh*",
            "So glad they fixed the colour of the past compendium books, I was worried",
            "With the vault removal by portal in dungeon, please at least add more pallets or something upstairs to compensate for that to make the map more balanced in both areas. Upstairs is barren/unsafe",
            "Are they just gonna keep ignoring the ds bug? On killers like huntress it's 1 second only and sometimes on all killers your animation can bug out causing you to not be able to vault",
            "> Increased the volume on Flight of the Damned skeleton spawn to give better awareness to Survivors.\n\nUnless I'm missing something on how skeleton spawns work, this seems like it's missing the mark. The issue is that skeletons are tangible instantly and can be spawned inside of a survivor with no counter. Making them louder is not gonna stop that.",
            "Can y'all please add pallets to the new map?? There are literally no loops and like 3 pallets up stairs",
            "https://preview.redd.it/zfzhh976ij7d1.png?width=432&format=pjpg&auto=webp&s=a2435e6f33d674373029322c7ed394c08f58f3e5\n\n>Addon Ring of Telekinesis: Activating Mage Hand on an Upward pallet increases your general vault Speed by 10% for the next 8 seconds.",
            "Why nerf the sword? It was fine where it was.",
            ">Fixed an issue in Toba Landing where the Survivors could run on the railing of the stairs\n\nI KNEW THIS WAS POSSIBLE!\nall the times i tried and i maybe got it once or twice. Now it's perma gone but i knew it was a thing lol",
            " \n\n* *Fixed an issue where multiple recent Tomes were using the same cover color in the Compendium screen of The Archives.*  \n\n\nThe only thing here that mattered.",
            "How are people genuinely calling flight volume a broken nerf or anything. Anyone with a headset already hears and knows. This just helps people who are hard of hearing or use a TV for noise. I swear, yall whine and complain over the dumbest shit.",
            "So... No DS and Blight fix/killswitch? Also no mention of the bug where survivors can get hooked while trying to rescue someone being hooked from distance?\n\n\nLook I get the rescue bug might be hard to fix but you have a killswitch for a reason",
            "Cool that they added hooks to the bottom floor. Wish they would have done something about the 4 gen on the top floor, or the gates that touch each other, or the blight not getting fatigued by breaking pallets.\n\n\nEdit: They fixed the blight bug at least. The rest still stands, guess I'll just keep dying on the new map.",
            "Oh thank the lord!! Mirror illusion nerfs, BHVR NEVER fails to impress.",
            "Any plans to fix hit detection? It's been bugged for a year now, and has gotten incredibly noticeable since the Unreal 5 update?\n\nIn addition, any plans to fix Onryo's passive phasing?",
            "**There's an infinite loop on the Clown/Chapel map** with two interior windows spawning in a straight line with a mere distance of 8 meters from each other. Even if you break all the doors you cannot catch up. Now if survivors use their invitations they can entirely cut off the killer by blocking the vault itself so it's pretty much impossible to chase survivors through the mainbuilding in the current state.",
            "\"The Mirrored Illusion perk no longer charges when an Illusion is already active.\"\n\nWay to make an already bad perk worse.  \nWhat the actual heck is this change? LOL",
            "why do you hate survivors?",
            "When is the update going to be on the game ?",
            "That first part of the Misc section seems like a secret, much appreciated buff to Weave Attunement 👀",
            "Any word on the scratch marks bug? Ever since the engine change, scratch marks spawns have been weirdly spaced apart and often glitchy, like everyone has Lightweight. It's making tracking more difficult.",
            "Can you guys fix the big black circles under all the characters for switch players. You can see all the wraith and Sadako’s coming a mile away when they’re invisible lol, plus you can see who’s hiding in lockers.",
            "So more hooks in the dungeon and you moved the portal to the side of the window and didnt add one on the other side and also didnt add any pallets/tiles to the top. Does this make Forgotten Ruins the most killer sided map in the game? At least with Grave of Glenvale there is pallets and those window loops.",
            "The good window in the dungeon was closed... damn.",
            "Not fixed :\n\nBubba has 3 second tantrum threshold which makes engraving and deep rauke impossible to play.\n\nPig and Ghostface has wrong Carry Animations. The run like on crack without agitation.\n\nPig has third person right arm animation. Her right arm always going right when you turning right.\n\nPig has a lock on when she wipe her weapon.\n\nNurse is bugged. Which gives me motion sickness. Her Fatique is bugged. and has a inbuild decrease fov.\n\nAnd you doesnt fixed the DS Bug.\n\n  \nIn the Forgotten Ruins Map, at least 4 hooks will now always be available in the dungeon section of the map.\n\nI will never understand your balance or game designer choice. when you creating such dungeon and give before only 2 hooks or whatever. no wonder that everyone running in a area where the killer cant hooking someone.",
            "Is DS still bugged? Getting hit by DS is much longer than 4 seconds (feels like 6?) on some killers. While enduring makes it like 2 seconds on others?",
            "Drop cross progression please bro",
            "Why would you nerf the iridescent addon? That was too much, you always do too much when nerfing killers. And giving the ring a useless niche use? All of this a month after people bought the DLC. You did it again BHVR, like with Ash, Wesker and many others. Nerfs come really fast but fixes for killers? You took years to fix blight and remove MadeForThis even when you people knew it was stupid. I feel stupid for buying something that you people later RUIN. Next time I'll wait for the nerfs before even THINKING about buying shit\n\nEdit: When will you fix Decisive strike?? The stun is not consistent and is FAR longer than 4 seconds....",
            "Still no fix for the bp loss?",
            "Maybe now Mage Hand will no longer be a free hit finally.",
            "Still no word on the Huntress hatchets not dealing damage or the inertia bug on her.\n\nIt's been 2 months.",
            "Vecna still playable, thanks 🙏🏿",
            "Not sure you needed to shorten time for Killers to take the passage, just increase the time it took for a survivor to take it but at the same time the numbers are small enough it should be fine.  \n\n\n\"Bugfix\" nerf to an already weak perk. IMO you could just make Mirrored Illusion/Blast Mine/Wire Tap/Chemical Trap work on tokens instead (repairing 50% of a gen grants a token, spend a token to install the \"trap\") and it wouldn't really hurt anything. \n\n\nI don't expect any changes to event mechanics since its a temporary gamemode tbh. The bugs and balance are very scuffed but it'll only be around for another few weeks so I can see them thinking \"why bother?\", which is kind of fair I guess. I'll just avoid playing it since the 150% bonus probably isn't worth my sanity.\n\n\nEDIT: LoPro Blight confirmed fixed in comments, hallelujah.",
            "So they making new map who is killer sided much more killer sided. Awesome adjustmenet. What about the gates that is impossible to open in 1v1 situation, what about camping gen in upper part of the map. The killer has no interest going to dungeon, he can camp gens above the ground and easliy win",
            "So the most killer sided map in the game gets a buff to be even more killer sided, but they can't fix a pellet that's floating in the air? Lmao",
            "Did they fix the one top side pallet that wasn't really a pallet? The one the killer could just walk right around and smack you  if dropped at all. \n\nForgotten Ruins needs a pass through on the top side, hell, take a couple of pallets from the dungeon area and put them up top, balance it to be a bit more equal. Makes the dungeon more bearable for killers, and top side 4 gen is no longer a completely hopeless situation for survivors.",
            "At last, no more cluelessly walking around the dungeon with a survivor on my shoulder",
            "Now all that’s left is fixing the exit gates on that map",
            "They buffed killer on Forgotten Realms? The devs really are brain dead.",
            "So the Toba Landing stairs are fixed, but no note on the outer RPD stairs?",
            "Is the nurse fatigue bug fixed??? Hopefully it is",
            "Is the Chemical Trap bug going to be fixed and not cause the Blue Screen effect after the pallet breaks?",
            "Can we get another xp boost please",
            "still no fix for the rift doctor crashing games. I bought the rift just for him and now I can’t even play as or against him :(",
            "The blight fatigue buff happened to me yesterday, i was thinking i found a new tech lol",
            "Any chance the Intermittence bug affecting Onryo will get looked at in the close future?",
            "Did this fix rose marigolds broken arms? She looks scary lol",
            "i like the medkit one cause it fckd my ocd btw some survs skirts are bugging when will it be fixed?",
            "can you please fix the pigs knife cosmetic animations ? i paid for them i want to use them :(",
            "fix alessa gillespies skirt it is ALWAYS bugged out",
            "When will the update be on x box?",
            "What does the Dark Arrogance change mean?\n\n>The Dark Arrogance perk's bonus vault effect no longer incorrectly applies to other Killer abilities.",
            "What about decisive strike ??? Is it fixed",
            "Why was the sword nerfed?",
            "Wait… Archives having the same color in the compendium was a bug? I’m glad, that bugged me really hard.",
            ">Fixed an issue with the blight not entering the fatigue state when destroying walls and pallets\n\nAh, but didn't fix the occasional double syringe after doing so. Very cool!",
            "did they fix the ui with vecna where his spells stay on the screen after using them?",
            "So *that* pallet on Forgotten Ruins is intended and not a bug? All I can do is chuckle at that. Truly BHVR logic at play.",
            "Please fix Pig’s visual bugs in the lobbies and matches! She still is not holding her RBTs in the killer selection screen, and her normally animated weapons are not animated :(",
            "Still no fix for the Grim Embrace + Driver's License interaction. We reported this bug months ago.",
            "Still no fixes to the Blight having double fatigue duration and animation?",
            "What about the bug where DS doesn’t stun killers for the expected time? It’s completely useless since they get back so fast from the stun, it’s not 4s as it should be",
            "It saddens me that Dark Arrogance doesn’t stack with other killer abilities, gives me less reason to make interesting builds",
            "I don't know if this one has been made aware of, but there was a particular locker on Yamaoka Estate that bugged out when teleported to with Dredge. I got physically stuck in one of the exterior lockers of main building and couldn't move until I used my power to teleport to a different locker and then get out. It happened multiple times.",
            "Wasn’t the time to break pallet already 3 seconds on the add on",
            "Has the Trickster bug where he can randomly cause flashing lights on the survivors' screen been fixed? I really want to play the killer but I want to avoid causing any risk to anyone.",
            "When is the skull merchant going to be deleted?",
            "No mention of fixing frame drop issues on console or loading times? It’s genuinely horrible playing console with how little our issues are looked at.",
            "Soooo...... Streetwise will no longer extend the lifespan of medkits then?",
            "Is this live now?",
            "Absolutely awful patch for Vecna (The Lich) players.\n\nRing of Telekinesis goes straight to trash. It wasn’t a nerf it was a murder.\n\nTogether with Vorpal Sword nerf Vecna loses his pallet game and mage hand becomes useless.",
            "Will the bug that has switched Jane and Ash in the character menu ever be fixed? As a proud Jane main, I go to click to play Jane and muscle memory has me selecting Ash. It’s the least impactful bug ever, but I’m sure Ash and Jane mains are both annoyed lol.",
            "Even more reasons not to play survivor.\n\nDid the devs forget they have another player base? Not just killers?",
            "It would be nice if I didn’t get disconnected from every game since the event came out",
            "why would you nerf mirrored illusion? its not great already lmao",
            "Are there any plans on fixing The Knight? He’s been held back by bugs for quite a while now",
            "Nurse fatigue fixed? 😪",
            "He is the funniest killer in the game and not just for me, but for a large part of the community, you should take more care of the licenses.",
            "and I still see many shortcomings in the assassin, among them the cooldown between skills, if or if you have to rely on some object that reduces the cooldown.",
            "wha about the wiggle progress not working or disappearing when someone takes a hit ?",
            "1300 (minus 95) employees and this is what we get and are left with. What an embarassing company.",
            "The DND map still has a bug where people can get stuck in a portal. It happened to me last night, and happened multiple times to my partner over the last week. Please kill switch this map.",
            "I am happy to see that Hux will be more accessible for players who are willing to try him out. It is one of the most enjoyable killers to play as!",
            "Wesker has a bug, that keeps you stuck while one of his chests for a couple seconds. The bar gets full, but the survivor doesn’t move and it gets stuck in the animation.",
            ">Increased the volume on Flight of the Damned skeleton spawn to give better awareness to Survivors.\n\nI have no idea why BHVR thought making FotD even easier to dodge was a good idea. It's already trivial to avoid.",
            "The bloody rewards challenges are still broken (you get more than enough bp at the end of the game, and you get the golden finish challenge on the right side but as soon as the scoreboard is seen the challenge will be reset and only some bps are counted).",
            "YOU DID NOT FIX \"Survivors no longer get stuck in the hooked state when the killer is interrupted\" YOU GET A FLASHLIGHT SAVE IT HOOKS SOMEONE ELSE AND IT BUGS THE SURVIVOR ON THE KILLERS GRASP \n\nFIX\n\nYOUR\n\nGAME",
            "I’m still rubberbanding :/",
            "Dear behaviour can you tell me why do I get 50+ cakes on characters with low prestige (that I don’t play) and max 30 cakes per prestige on characters with higher prestige? I’m not gonna play chucky ever again. I have 100 cakes. I grinded on Nea and Claudette for few days I have 100 cakes each about 5 prestiges. Chunky - two. Bubba two 100 cakes as well",
            "I love the part where it's been 4 months of Sadako's intermittent invisibility being completely broken and desynchronized",
            "Niceeee, now let’s work on hit boxes and taking a hit while stunning the killer! And PLEASE FOR THE LOVE OF FOG PLEASE DO SOMETHING ABOUT FREDDY!! HE IS TOO ICONIC OF A HORROR CHARACTER TO JUST SHRUG OFF FOG DAMMIT!!! \n -With love, JoeyRigatoni",
            "Ok cool but I keep getting this random dc every few games where it says  'Disconnected, Dedicated server is not responding' and the entire match ends. I had some internet dropping bullshit going on a couple weeks back and got a new router, but this shows everyone with a dc symbol and I seem to have no connectivity issues. This isn't me right? Are their servers actually this fucking bad right now because this is getting ridiculous, how is keeping your bloodpoints when you get dced not in the game yet????",
            "how about you fix your trash servers dcing and me as the KILLER GETTING PUNISHED FOR IT??? literally winning a game and the server disconnects or a salty survivor leaves but because of dedicated servers we all get disconnect but I get the dc penalty??????? this has been happening for a while now bhvr is so incompetent its unbelievable",
            "Is this out now or is this upcoming?",
            "Im so glad they made vecna's worst addon even worse xDD",
            "So... Vorpal sword buff then? Unexpected but I'll take it.",
            "„•Medkits now fully deplete when self-healing to 100% with no add-ons“\n\njust bc I dont understand how they phrased it (and english is also not my main language):\nIf I was healed to 99% from another survivor and then use my fully charged medkit to heal to 100% will the medkit loose all charges?",
            "I am a mix of relieved, annoyed and confused by those **Vecna changes**\n\n>Increased Mage Hand pallet lifting time from 0.35 seconds to 0.5 seconds.\n\nOk not *that* bad, but I was also using **Telekinetic Ring** which is also gutted (see below). Probably will need to readjust to aim at **blocking pallets now**, but it definitely will no longer result in free hits every time now. Which is fair, unless it is now completely useless, which would suck because it was my favorite power to use.\n\n>Increased the volume on Flight of the Damned skeleton spawn to give better awareness to Survivors.\n\nI didn't think survivors needed this effect to be *easier* to dodge honestly. Ignoring fully clueless survivors outliers, even from outside line of sight or at longer range, it only gets a hit when the Survivor is **mid-animation** which required precise timing and prediction or after they dodge by crouching but I use it with a **timing that it gives me an M1**, which also requires timing and prediction, it is not *as free* as it looks. Even behind walls or at longer range, I *never* get a hit anymore with this power except with those 2 situations. Even the **insta cast from the initial hitbox** if used at just the right range is clearly not working as much as it did *just last week*, survivors have adapted as I knew they would. And if they can see it, they won't even crouch and sidestep it and not even lose distance. Not saying the spell is bad or useless, but if anything I could see it getting a small buff to those hitboxes or reducing the cone spread.\n\nIt is really odd to me that of all the things this power could be changed to, volume is what they went for, I can't imagine a single survivor will find it useful.\n\n>Addon Ring of Telekinesis: Activating Mage Hand on an Upward pallet increases your general vault Speed by 10% for the next 8 seconds.\n\nHorrible, absolutely trash, I *hate* it when any devs do that in any game. And I find it weird to tie a vault buff from an interaction with a pallet, with a duration probably too short that it would often apply and most definitely too low so that it makes a difference. Went from arguably the best add-on, at least in common+yellow, to maybe the worst? What I *hoped* they would do is **remove the activation speed to add to the duration instead**. Because that way you remove the free hits from the current activation speed (which *had* to change), but you can trap/fool survivors thinking they can make another loop and redrop the pallet, and +1 or +2 seconds would surprised them and you get a not-free hit. *And then* they'd had to **figure out I run this add-on and adapt**, which is positive overall to the game and what you should always aim for add-ons to do, **reward game knowledge with counterplay and avoid inescapable situations**.\n\nI said it before ever since **Vecna** was announced and since the PTB, he is my favorite design in the game, I'm a veteran D&D player and am emotionally attached to his more than any other IP in the game, and **I'll try to main him even if he becomes the worst killer in the game**. As long as he remains *fun* at least, which admittedly is correlated to his performance but not as much as it would for some other Killer mains.",
            "Why did mage hand need a nerf?",
            "Is Susie's voice still bugged in her new cosmetic?",
            "Bummer 😝 I liked that Mirrored Illusion can be recharged, while an illusion is already active.\n\n\nI thought that was part of the perk, not a bug 😅",
            "Mage hand nerf and ring nerf are huge",
            "Vecna base kit changes seem unnecessary but he’s strong enough already that I’m not gonna fight over such a small nerf.\n\nRest looks good to me",
            "I see the changes to the lich as completely unfair, then you change the ring item which is totally useless, next time I will think about whether to buy a licensed assassin because you always do the same thing, in my opinion it did not deserve any change, which is Sad thing is that just by crouching you avoid one of his abilities, and I see the change to the hand as totally unnecessary, when the survivors have items in their chests to counteract it.",
            "Hold on, I don’t know if I’m reading this right but did flight of the damned get nerfed? Why? From what I’ve seen it was only good when you spawned it in a survivors face.",
            "I feel like its a tad bit much nerfing both mage hands addon and the basekit\n\nDon't get me wrong I dont think he'll be like, too weak nor or anything but if the issue was \"Vecna lifts pallets too fast with telekinesis ring\" then just nerf the ring? basekit honestly was fine all things considered, pallets were a mindgame similar to huntress only instead of hatchets he had a cooldown on a single use mage hand, it wasnt impossible to outplay",
            "Vecna got nerfed so  hard 💀💀 I’m honestly shocked you somehow thought to nerf skeletons of the damned.  when it’s ridiculously easy to counter vecna is literally a mid tier killer maybe even lower that ring add on is now completely useless. By the time you use mage hand survivors can just either loop around and drop pallet or just find another loop. Yikes…",
            "how about they take out insta hook",
            "Lich was already balanced this nerf was made to cater to whiny survivors who are unable tp change their play style depending on the killer",
            "Thanks for fixing dark arrogance bug. It was so unfair and game breaking. Totally didn't add more harmless dynamic to killers who could use it.",
            "Why the fuck did we nerf flight of the damned literally fucking no one was complaining about that. mage hand nerfs are fine though",
            "Unnecessary Nerf on Vecna‘s Iri Addon and overnerfing Mage Hand, pick the Base or the Addon but not both at the same time",
            "Well at least the abusable passages have been tweaked by BHVR. Trying to catch a semi-competent survivor in those damnable infinites was miserable. I once had a Scooby Doo-esque chase with a survivor who was the last man standing through them until I finally caught them.",
            "* \"Medkits no longer fully deplete when self-healing to 100% with no add-ons\"\n\nThis is the stupidest change I have read in a changelog. Unless this phrase means THIS issue is being fixed. But, if you are causing it \"now\" (although it was happening before) on purpose... I don't have an adjective.",
            "Addon Ring of Telekinesis: Activating Mage Hand on an Upward pallet increases your general vault\nSpeed by 10% for the next 8 seconds.\n\nAs someone who is a diehard believer in bamboozle on vecna I am absolutely all about this. For needing an extra .15 seconds to lift a pallet I will gladly take this trade.",
            "Nerfing vecna for what? Of course you listened to people are dogshit at the game and have problems with dealing with him. Anyone who had a problem with his flight of the damned or mage hand was straight dogshit and you listened to them. Now he’s straight terrible as a killer.",
            "Well it was a fun while it lasted Vecna bro's. Another Killer nerfed into the ground.",
            "Nerfed Vecna into the ground. Can I get a refund?",
            "Literally Vecna is just getting worse. From a killer standpoint he was good not overpowered, not too weak. From a survivor standpoint he was really fun to go against, nothing difficult just gotta learn to counter him.\n\nNow what’s the point, 3/4 of his perks are too weak.",
            "So…is the insta tech gone? Ig the volume changes make it easier to react to?",
            "This was awesome I love playing this game 😍",
            "What a fucking joke. Vecna's Mage hand didnt need that huge a nerf but just like every other new killer they just had to nerf him and make him garbage.",
            "vecna didnt need to be nerfed. he is useless now. i bet survivor mains are happy because they dont want to use their brain.",
            "lil love tap when healing a teammate never hurt anyone haha",
            "Thanks for pointing this out! We have updated the patch notes for clarity. \n\n>Medkits now fully deplete when self-healing to 100% with no add-ons",
            "I was trying to figure out what the reason for that was and I think it’s because of Weave Atunement? Seems like a half assed nerf for that perk and i’m not sure that was the way to go about it",
            "I run syringes for those.",
            "i had a teammate blind the killer successfully and he didn’t drop me when i was being carried i was astonished (is this a perk?)",
            "I had this happen to me, but the Leon was stuck in front of my screen. It was hilarious, but really terrible as well.",
            "happened twice today, as both sides. seen it multiple times in other people's games too, and everytime some random person gets hooked instead of the person who was supposed to be remote hooked. Then the person who was supposed to be hooked is bugged out and has to dc",
            "Hey I think I was the killer from this match! What was the Hux’s name if you remember? I remember getting blinded right when I hooked someone and it bugged out on this exact map with the cold snap skin on too.",
            "I was remote hooked, and after being unhooked I could not be healed or use items.",
            "That’s killswitch worthy",
            "Yeah, those gates are terrible",
            "unfrotunetly the behavior dont care about survivors, its always about killers :/",
            "The Remote hook made it a smidgen more bearable",
            "I used to love this with built to last :)",
            "BHVR Try Not to Make An Already Niche Perk Dogshit Challenge (Impossible)",
            "Right? It's gimmicky at best, it won't waste more than 5 seconds of the killer's time.",
            "perk consistency is my guess blast mine used to be like this everyone hated the change too, the devs are sticking to the stance of if the perk is active you can't earn another charge of it until its done being used.\n\nI think they should just give the perk 2 charges max and make it a token based to avoid this issue.",
            "Probably to make it more consistent with other perks of those kinds it's still an unnecessary change though. It should be like flashbang",
            "Man, Im a killer main and I hate this perk, but this change makes no sense at all.",
            "Because that's also how perks like Blast Mine, Wire Tap, Trail of Torment, etc work and I imagine it was to make them all behave consistently.\n\nHow many Killers genuinely have fallen for the illusion?",
            "I was thinking this myself like it doesn’t really do anything It’s a fun meme perk like bardic inspiration. Correct me if I’m wrong but doesn’t flash bang recharge once you’ve crafted one? If so that’s literally a stun/blind perk with huge value and yet it remains untouched.",
            "It’s because the other “unlock a deployable thing when you do a 50% generator fix” perks do not charge up if there’s an active thing. They really like consistency.",
            "This perk genuinely needs a complete rework, it’s just not worth it even for the funny, it needs to have a recall button and a way to tell they fell for it",
            "I imagine it's to keep it in line with perks like Blast Mine and Wiretap, which do the same.",
            "That change and the Flight of the Damned change are both so unnecessary",
            "don’t forget the version where you beamer-save someone and a third person gets teleported to a hook where they can’t be unhooked🙃",
            "is that actually a bug? i thought it was just killers hacking the game lol",
            "It's like they dont want survivors to have fun.",
            "Just wanted to assure you that this was fixed in this Hotfix, but did not get a patch note. Thanks for letting us know!",
            "between the bug and the instabreak invitations, must be even easier 4ks for the dev's favorite right now.",
            "Also nurse has a fatigue bug that reverted it to an older version which was 3 seconds instead of 2 so now ig we both at a loss",
            "Inb4 they say its a feature 🥴",
            "This happens when unhooking and repairing gens in survivor side also",
            "server issue. I had a random dc like a half hour before you posted that on pc.",
            "UPDATE: I’m playing after the patch now and at this point it’s unplayable. I get kicked out of every match. It has happened 3 times in a row",
            "Which console? Im on ps5 and ive yet to come across this issue playing killer or survivor",
            "They say many things are fixed but in reality it doesnt fixed.",
            "Bubba main here. Confirming these bugs are a problem.",
            "in the next anniversary he got the fix. even now he is bugged. threshold is 3 seconds instead 5 sekunds. chilis give him penalty. and his acceralation is bugged. look on old pre ptb bubba. he got always instant the full speed. since twins release he had slightly delay before he reach the maximum speed.",
            "As a person who has ears, this isn’t much.",
            "Ikr? That barely changes anything",
            "Yeah I really expected them to patch out insta tech or whatever the hell it's called. That trick alone takes flight from an F tier dogshit nearly useless spell to basically a guaranteed hit if you know the spacing",
            "It's more about how instead of buffing it, since it's complete dog shit, they nerfed it at all",
            "I may be downvoted but i feel the \"insta tech\" is deserved, the cool down for flight of the damned is still long,  requiere some awerness to make it work , and even before this change some survivors still can dodge these if they try to  predict it, also if you know Vecna still has FoD and is going to use it against you, is best to force it in corners so you can dodge the \"insta tech\" and not in windows or in front of pallets when is not possible\n\nWith this change it just give more room to actually predict it, instead of nerfing the whole thing and make it no possible, so i found that fine........buuuuut i guess if everyone still complain they may be nerfing this so i don't know, if they survivor side want this maybe they just need to bitch a little more",
            "I guess so, but what was the reason for the audio increase?",
            "I was hoping for a fix on the fotd 100% hit tech thing.",
            "I don't really understand this change. It seemed loud enough already?.",
            "Idk why they did this tbh its alredy loud. It's Nice they didnt ruin this alredy pretty bad spell",
            ">  the community was dreading?\n\nKillers, say it correctly. The people pissing and moaning was killer mains. Its nothing new but it is annoying.",
            "That sounds funny asf ngl",
            "I have never seen this wtf lol",
            "I have played dozens of Sadako games in the event and yet to see this?",
            "nope! was just playing Legion and it happened to me (unintentionally). felt rlly bad so I let everyone go (minus the person stuck on me, sadly).",
            "It probably would cause a bug",
            "It says entry is no longer cancelled. Maybe Victor will go through on the survivor's back?",
            "Switch also has FPS drops",
            "Haddonfield is unplayable",
            "fun fact : in the last patch they said it was fixed when you selecting the new cosmetic set. :D",
            "Ohhh okay. That explains why I still hear frank breath with frsty eyes mask on lol",
            "Susie trans confirmed?",
            "Imagine nerfing mirrored illusion? It does practically nothing",
            "Remote hooking is annoying but it's def not as frustrating as the pallet break one lol. That said it's an event. idt they ever changed or buff/nerfed something in an event. Unless it was genuinely game breaking haha",
            "I believe it specifically applies to Legion's Feral Frenzy and Wesker's Virulent Bound. As far as I'm aware, it still stacks with Tier 3 Myers, so you can still make a mega vault build with him.",
            "They'd better leave the \"Hope\" pallet. It's not even in a good spot, so it is no different than having nothing. But it's hilarious.",
            "Almost feels like it was done as a quiet nerf to Weave Attunement more than anything.",
            "I think that was a typo and they fixed it.",
            "tbf hitting a great skill check already did that, unnecessary change when they could’ve changed weave attunement (likely reason for it)",
            "I don't get the change. Does this mean that they reverted the medkit nerf from last year?",
            "If medkits truly have 33% decreased efficiency (and not 33.(3) recurring) when self-healing it means you only get to use 67% of its charges. 67% of 24 is 16.08, so it makes sense that there should still be .08 charges left after a full self-heal (with no great skill checks).",
            "What gets me Killer never even has to step foot in the dungeon to when the game there, just hold his gens up above. I also wish they would have rather fixed how dark the map is.",
            "I was honestly waiting for this to be fixed. I just knew they wouldn't let it go unnoticed for long. They adamantly refuse to let Legion have *anything*.",
            "I don't think it's because of legion, but rather weaker and chucky (If scamper actually counts)",
            "Indeed, before the patch, when I used a medkit to heal myself, it was depleted.\n\nSo, I don't understand this change.\n\nFor me, there is not a difference.",
            "The fixed blight, it's just not in the patchnotes for some reason",
            "They said in the comments that they fixed it, it’s just not in the patch notes.",
            "It's not supposed to nerf. More help people counter who are hard of hearing or use TV audio or something.",
            "You can still crouch. I think its half a second time to react. Even in situations where the surv is animation locked, its still mind gameable",
            "FotD doesn't need a nerf",
            "Yeah, this is the worst possible change. I was hoping for something else, but this isn't it.\n\nI can't even imagine running this addon now. I doubt the 10% gets the additional distance for a hit at any time.",
            "Lmao it's so dogshit haha",
            "I'm so glad I can vault faster in the next 8 seconds for all those window vaults that are right next to a dropped pallet. It's so strong. Can't wait for my free hits with this.\n\nSeriously, though. This an absolutely awful change. I get that the haste effect was a little busted, but this new change just feels like they didn't know what to do with the add-on.\n\nIn all honesty, I feel like removing the haste effect on the add-on combined with the nerf to mage hand is just overkill. Maybe dropping the haste to 3% instead of changing the biff completely would have been a far better adjustment.",
            "If I am lifting up a pallet, why do I need extra vault speed",
            "At 10% it's pretty worthless w/o perks but if it was higher I could actually see it being useful to shut down something like shack window in a cheeky way.",
            "A dev played against a vecna with it and lost.",
            "I'd say it's a buff. It was already too slow if you were chasing behind the survivor, the addoniis good if you are chasing the survivor into the pallet. Breaking it blocks it, so you can trap them and hit them. A longer breaking time means more time that it stays blocked.",
            "They saw that one post today/yesterday and were like \"damn. they kinda got a point\" lol",
            "I have not seen one person saying this. You're getting angry at the wind.",
            "Blight was fixed",
            "Also interested in any progress made for this bug. It's been a problem for months now.",
            "Boohoo wahhhhh",
            "It's already there.",
            "It is indeed the most killer sided map now.",
            "I’m sorry but I don’t think that takes a week or two to make.",
            "I really don’t think they should have nerfed anything with Lich. Instead they should have made him better imo.",
            "it was never free hit. you could drop pallet again",
            "Yeah, he's fine. Just a slight nerf to Mage Hand (which I think wasn't warranted). But now he has another absolute shit addon, so that sucks.",
            "It sounds like they removed the near infinite in the basement and fixed the hooks down there to make sure you can always hook, so theres no reason the killer should avoid going there like the plague now. \n\nUp top it is probably still pallet starved and those gates are the worst, transforming it from being killer sided if the killer plans to 3 gen up top and survivor if he's chasing, to probably just being killer sided.\n\nI'm glad I got all the new achievements already.",
            "dungeon side is terribly survivor sided wtf are you on about",
            "4 is still not many. A single sabo/breakdown can make that area unusable. Being able to bring carried survivors through the portals would fix the issue.\n\nEdit: This is still a good change.",
            "should be live now",
            "It won't let legion or Wesker vault fsster",
            "It means it doesn't take effect with Legion's or Wesker's fast vaulting abilities (and whichever other fast vaulting killer I may have forgotten).\n\nNot sure if it also applies for Singularity or Shadow Dance Wraith.",
            "Maybe the placeholder tile in the bug fixes is that one?",
            "The same thing happened to me on Mount Ormond",
            "will be fixed in the next anniversary stream.\n\nits not a gamebreaking bug. /s",
            ">Addon Vorpal Sword: Increasing time to break pallet from 2.2 seconds to 3.2 seconds.\n\nIt's a nerf.\n\n&#x200B;\n\n Addon Vorpal Sword: Increasing time to break pallet from 2.2 seconds to 3.2 seconds. \n\n&#x200B;\n\nTakes 1 second longer for a pallet to be broken.\n\n&#x200B;\n\nWith no perks/addons a pallet takes 2.34 seconds to break.",
            "... you didn't self-heal, you got healed for 99% and finished it...\n\nNo, they're literally saying the number of medkit charges are the same as the charges it takes to fully heal with no additional addons/perks affecting it.",
            "Because it was a free hit at every loop unless you get lucky.",
            "That got fixed in the last update.",
            "How is a volume increase a nerf that you are acutally upset about LMAO",
            "It's the noise it makes when summoned I believe. So it's easier for people who are hard of hearing or use like a TV instead of headphones too hear it and counter. It's not so much a nerf as it is a qol for people who have that handicap or issue.",
            "Because people who are dogshit at the game was complaining about it.",
            "He was never mid tier lmao mage hand was a free hit in most cases",
            "Brother, any decent survivor would already hear when you're using the army of the damned. And the pallet hold was updated by 0.15 seconds, that is not a big deal by any means.",
            "he isn't mid tier lol",
            "The ring addon was also useless previously.\n\nWith some testing I've discovered that it was a debuff to lift the pallet that fast, because survivors were able to drop it before you were able to swing with your M1.\n\nHowever, with this change to 0.5 seconds the previous ring of lifting faster the pallet wouldn't have been half bad ngl",
            "Holy shit. Calm your horses buddy boy. It’s not that big of a change with the Skeletons. Mage Hand usually was a guaranteed hit and it needed to be needed badly. Take a breather.",
            "He will be fine, I think you’re over reacting, the skeletons were easy to counter yes but if you didn’t have perfect timing taking the time to crouch usually zones you from your next pallet/vault etc",
            "Calm the heck down bro. Vecna is still a string killer. The skeleton nerf... Did you even read it? All it does is allow people who are hard of hearing or use TV audio too counter. That's it. It's fine. The hand needed something as it was a free hit in 99% of circumstances. You'll be fine. Relax.",
            "Yeah I don’t get why they nerfed his skeletons, so strange",
            "Legion is gonna feel so much worse now...",
            "It's now a little bit louder, OH NO",
            "eh.... I'm a firm believer in bamboozle in shack, but this means that shack is still in play. As it is right now, vecna with bamboozle wins shack 100% of the time if you play it right -- this is nice, but this means that shack is still uncertain now.",
            "Killer has literally 70% Killrate on [nightlight.gg](http://nightlight.gg) and you act like 0.15 seconds increase on magehand \"nerf him into the ground\" are you okay bro?",
            "Lmaooo that's cap. If this nerfed vecna too the ground for you. Then that's a skill issue. He's still strong.",
            "pro tip = never buy new killers because they will %100 get nerfed into ground",
            "Instant tech should still work, the sound might help to signal to counter it. People will have to play with it to tell.",
            "This nerf means you lose about half a meter of distance. It won't matter if you're using the ability correctly.",
            "Will you ever bring back the info tab on characters? Been waiting months for the fix. I bought the new chapter and had to go to the shop to read the lore and the perks...",
            "Was the remote hook bug fixed? If you saved someone (with a pallet flashlight etc) being remote hooked you’d get hooked instead of that person and that survivor would be stuck on the killer for the remainder of the game even after end game collapse",
            "So if I'm half healed and finish myself off with a medkit, will it fully deplete?",
            "What about if you hit great skill checks? Still fully depletes?",
            "Bring back buckle up please. Give the endurance to the guy picking up",
            "you gonna kill vecna just like alien ( barely see alien anymore ) vecna is already weaaaak",
            "I personally used built to last with a med kit so you could get the ones requiring 3+ done in one game.",
            "If you blind too early, the animation is not yet complete in the killer Won't drop you. As I understand this is a feature, not a bug and it's not new",
            "I don’t but with how rarely I’ve ever seen hux and that cosmetic I have to assume you were probably the killer here. I ended up closing my game so didn’t look at the names",
            "I hope you are joking and you aren't just victim complexing because bhvr does both for killers and survivors. Imma just say nerf to both regression perks with no compensation for other niche perks.",
            "This isn't a survivor problem, just a game problem. What are you yapping about?",
            "Lol, I'd argue the opposite, especially since there's 4x the survivors in relation to killers, so keeping survivors happy makes more sense",
            "Womp womp",
            "Shame you’re gonna have to adapt",
            "I will never understand why they nerf perks that are already borderline useless 😭😭",
            "I wish the illusion would play the repair animation and noises so at least there’s a chance they swing at it giving you time to get away or to troll them with it",
            "5 seconds is a lot tho. but nah it wont waste even 3 seconds of the killer's time",
            "Hey, let me laugh at them whiff the swing, kick a blast mine and then head on them on the follow up. That shit stacks. \n\nNo it's a total meme but I love it all the same.",
            "Ye it's just worse blast mine, and of the two i would really rather have blast mine be unplayable",
            "I'm a killer main and I love this perk. The change is dumb",
            "I've been running a Blast Mine + Wiretap + Mirrored Illusion + Red Herring build and they fall for it all the time lol",
            "BHVR getting ready to nerf flashbang and make it so I cannot charge the perk again until the one I craft is used",
            "It does. You can also drop a flash bang on the ground to create more.",
            "It’s gotta be spaghetti code",
            "Which is also stupid that they’re all 50% of a generator. Because they’re not all of equal strength.\n\nNot to mention flashbang let’s huge charge another one once you activate the perk. so why can’t mirror image?",
            "I can understand the code being confused because the killer, downed survivor and flash saver are all interacting. But why the hell would it hook a survivor who is not even participating in any way in the killer grabbing the downed survivor????",
            "I even have a video of it and it’s funny",
            "Yes its happened to me twice as killer. Both times I was pallet stunned whilst spamming remote hook after pickup. Instantly hooks the previous survivor you hooked and the one you just picked up is then perma carried until EGC times out + a few additional minutes",
            "Thank you for the active communication, it's a great sign and really does make a huge difference",
            "Thanks so much for the clarification!",
            "I was wondering what was going on with nurse...",
            "Xbox; it’s happened over 10 times to me at this point and their is nothing wrong with my internet connection",
            "Yeah, not being able to hold the chainsaw for even a second extra feels mega bad.",
            "As someone who jumped on this tech the day Hens displayed it, I can say it felt top tier the first few days and is already getting less and less hits every day since.\n\nDon't get me wrong it is a great use of the power, but it is not *guaranteed*.\n\nAs for the volume \"nerf\", yeah it is absolutely irrelevant.",
            "if they remove the insta tech, at least they should give something to compensate, this is way too underwhelming ability (yes I know it can force crouch, but along with mage hand nerf + this one being almost useless, and the huge cd, other killers can do much much more with their powers)",
            "What’s the insta tech?",
            "It's fine as is, it's supposed to be used for zoning or through walls",
            "Yeah spawning them on top of survivors on vaults, pallets and through walls for a guaranteed hit is complete dogshit, we need our abilities to play the game for us as well.",
            "Accessibility",
            "Victor will, he basically functions as a status effect when he’s latched to a survivor. \n\nVictor doesn’t go through portals because he’s a killer power, and other powers can’t pass through like huntress hatchets, nemesis Zombies, and everything else\n\nFunctionally though, Victor runs at 150 and had a ranged attack with a very short charge up. You’ll have no problem hitting a survivor before they enter a portal.",
            "Switch always has FPS drops :(",
            "i thought it was just me😂 everytime i went in a house id be there for an hour bc im lagging so bad",
            "i think they were just trying to increase continuity between this perk and other perks that charge after 50% gen completion.",
            "[deleted]",
            "Didn’t mention nerfing or buffing anything. I’m talking about the bug where the killer is carrying Survivor A, but somehow Survivor B gets remote hooked instead. I think it only happens when someone is trying for a save?",
            "Cool. As long as it still stacks with bamboozle and Superior Anatomy. I've been having a ton of fun with that killer vault speed build.",
            "Nope.\n\nhttps://preview.redd.it/ddb5w0ifdk7d1.png?width=1053&format=pjpg&auto=webp&s=0b47740cdaad18349d3bf6b287768d66001707aa",
            "Oh. You're probably right ![img](emote|t5_3cb2g|2067)",
            "Who runs weave without franklins though lol",
            "if you heal yourself with a medkit with no addons, you still have a tiny bit of juice in it? it doesn't drop because of weave attunement lol",
            "Honestly the more I think about it, it might be a buff. When i’ve used that perk I noticed that survivors healing with a medkit will go to the edges of the map to heal, and dropping it there kind of gives you no value. Now if you run Franklins + Weave (which why would you not) you get a lot more value",
            "no. a medkit takes nearly all of it. not it leaves a smidgen of a bit left i suppose. Maybe enough so if you miss a skill check, the medkit isnt lost without addons.",
            "I think it just means that when you fully heal yourself with a med kit, you still have a tiny sliver left instead of it being fully depleted. That lets you use insta heals and stuff which is nice",
            "Why the downvotes? It's a genuine question lol, explain it to me instead",
            "I still want to be able to see blood stains while in Frenzy. I don't care about losing scratch marks, but blood stains should be visible. Losing them was just part of their reactionary over-nerf from back when original Legion was destroying the game. I think they're at a comfortable enough power level that they can have bloodstain visibility during Frenzy. As a treat.",
            "It's possible to make things affected differently for killers. It still works fine when Myers is in Tier 3, but they actively chose to include Legion in the nerf. Legion also currently has a bug where they have no hitbox after a vault so the survivor can wait until Legion vaults a pallet or window and then can vault through Legion before they have the ability to turn around. Legion mains are eating good lately. If they like the taste of Nerf.",
            "The ring sped up the pick up speed of pallets. You’re thinking of the green boots. Also that haste effect does nothing. You’re stuck in the animation from start to finish. You get a quarter or half a meter at best with it. Which can help in very specific situations but overall is useless in a majority of situations.",
            "Worse than that, you aren't lifting the pallet, it's when you hold one that is still up.",
            "I suppose it's like the difference between carifix vs Jailer for pallets. Both have used",
            "Then you aren't looking at all. There were people saying \"how can they nerf flight of the skeleton\" and stuff. Without understanding what it actually means or anything. Either they deleted it or they were downvoted lol",
            "Sick",
            "With low enough ping it was a maybe, I could never do it with 45-50 ping.",
            "Vecna feels like this. They pull this knee jerk shit with Dracula I uninstall",
            "There’s plenty of reason to avoid going down there. If you manage to get a 3-gen on the top of the map with virtually zero pallets or loops, you win. Combine that with the gates, and you only need one person dead by then to basically win the match.\n\nThe logic that players won’t take advantage of changes like this just won’t happen. There’s a reason BHVR hasn’t added more base gen regression or further increased gen times, despite killers saying they’d swap their gen perks for more ‘fun’ perks. Every time they’ve made a base kit change, it’s just added to the pile of quad slowdown.",
            "You can straight up win without even entering thr dungeon lol. And it's not incredibly survivor sided, it just has good tiles and once you break a few pallets there are only 2 good windows left to work with",
            "Survivors gotta do 5 gens to escape and you have 3-4 upstairs always. You never go to the dungeon as a killer lol.",
            "It's not game breaking, but a bug is still a bug",
            "Yes, but you want to chase survivors into the pallet. When you break it it blocks them from vaulting it so they get trapped for a bit. Now they'll get blocked for longer.\n\nIt was already too slow to be useful when they dropped it in your face.",
            "thats what I said?\nIm just confused of how they phrased it.\nso they mean when you selfheal from 0 - 100\n\ngetting downvoted for asking questions, welcome to r/deadbydaylight",
            "Just checked, it's still giving Frank's voice.",
            "Relax, the commenter was clearly just asking for clarification. Calm down.",
            "I’m not upset about it dude, I’m just confused, idk what made you think I was upset",
            "Ohhhh okay",
            "So they already could easily counter it so they made it even easier to counter: where is the logic in that?",
            "Lol I've been messing around with Vecna secret memeing with him. My favorite bit has been getting pallet stunned, lifting the pallet, and seeing which survivors knew to immediately drop it to stun me again.",
            "So the Survivor got punished for a making a mistake? That sounds like FotD was fine then.",
            "calling a volume incrase a nerf is crazy when we are talking about something that's mostly visual anyways",
            "God forbid we have small fun things that cause no problems",
            "I agree that the nerf is not too bad really but like, using stats to show how \"strong the killer is\" makes no sense\n\n-killer is still new and people dont know how to play vs, as he's very complicated to counter as a whole for new players(new mechanics with chests and a lot of multiple powers)\n\n-stats showed how pig/pinhead/sadako get insane high killrates, yet they're B tier at best",
            "That's just because I'm so good with him ![gif](emote|free_emotes_pack|sunglasses)",
            "Thats because he was a new killer and survivors are still figuring out his gameplay, every new killer is going to have a higher count",
            "i suppose we'll have to see. It is arguably the least fun part of Vecna's kit but its pretty much the only time Flight of the Damned does damage because it is so easy to react to otherwise.",
            "I agree. It was so smooth reading character bios before but now its a chore. Same with checking individual cosmetics on characters in the store. Before it was just pressing one button to go to the next or previous characters cosmetics. Now its go back, select character then select cosmetic piece category again. The main pages of the store with the collections and bundles are really nice though.",
            "Still can't even see the perks on console.",
            "That was an intended change",
            "Had this too xD Thought it was a hacker holding me hostage",
            "Wait that is… insane lmao. I was seeing videos of it but didn’t realize what was happening til now 😭",
            "I had this happen too but in a different way. Just played a match as Oni and while I was carrying a survivor, the moment I pressed remote hook, last gen got finished (which disables event powers) and a different survivor got hooked instead and they died. Meanwhile the survivor I was carrying was stuck on me until EGC ended.",
            "Close! A full heal will deplete it. If you only use half the charges, it still has half the charges. ![img](emote|t5_3cb2g|2066)",
            "Nah it'll be half empty,  they mean charge wise  beginning to full would empty it",
            "Imagine calling one of the strongest killers in the game weak lmaooo. Vecna is so powerful.",
            "Very efficient! How does it impact your gameplay that trial?",
            "that’s the thing they had already carried me a fair distance and i was already almost out of the wiggle anyways. that’s good to know though thank you",
            "In my case it’s not that at all. It’s the remote hook animation being broken when they’re blinded at the same time. I’m at a 12 min dc penalty after this morning because it happened a third time in 24 hours and I’ve had to dc each time.",
            "2 days ago I was playing wraith I had iron grasp on and a sable wiggled out of my grasp after 4 seconds. No ds, no blind, no nothing she just hopped my shoulder",
            "Damn I’m sorry that happened to you though! Crazy this is my 3rd time being on this Reddit by someone else by random chance!",
            "[deleted]",
            "Why do you think so? It's already a contender for the most killer sided map in the game with how horrible the tiles are outdoos, how easy it is for the killer to force a 3 gen and how close the exits are to each other and despite all of that they just buffed the map by a ton for the killers, yet we still have stuff like a floating pallet and exits being glued to each other. It's pretty clear they are prioritising killer mains with this patch.",
            "Just weak attempts at balancing for high level play. It seems they're having a really hard time balancing for anything 5000 hours and above.",
            "Don't worry, last night I got so confused by an illusion I swung at it, and nothing happened and I was like ??? irl and then swung at it again. I hope the survivor got to see lol",
            "Honestly not even 2 seconds any time I’m killer and I see it. It’s too obvious that it’s not real. The illusion effects shouldn’t be visible by the killer and if the killer hits it. It gives all survivor (or at least the survivors who made the illusion) aura reading on the killer for a few seconds.",
            "Right, but my point is that it didn't need any nerf.",
            "That’s true I forgot about that, people will sometimes farm them and pass them out like gifts lol.",
            "The community is incredible and asks the best questions! ![img](emote|t5_3cb2g|2066)",
            "They ignored posts about any problem that isn't fixed, this isn't communication, it's fixing mistakes in trying to communicate a patch note.",
            "Got it added to the patch notes. We really appreciate you letting us know. \n\n>Fixed an issue where the Blight might not enter the fatigue state after destroying a wall or pallet with a rushed attack.",
            "Oh I agree. Instatech is way too strong but without it flight of the damned is probably the single worst killer ability in the game",
            ">through walls\n\nHonestly, like 48 hours after Vecna was released that stopped working virtually completely, but unlike using it for zoning you don't even have a shot at closing in and getting an M1. \n\nThat power is for zoning + catch up + M1 or to punish a vault you predicted, both applications have counterplays.\n\nThen there is the insta tech using the initial hitbox, which is good but already I can see survivors catching on and avoiding it more and more.",
            "If that is the reason it would need a more visual indication. The sound is pretty loud when the skellys shoot out.",
            "The difference between Victor and other killer powers is that he's a player controlled character. There's no excuse for him not being able to use the portal. Knight summons are also meant to pass through palettes and windows, so they should be able to chase through teleports as well instead of being completely negated.",
            "I’ve noticed that when playing dredge for the first time \n\nThe FPS drops were worse than a shooter",
            "Any area where you enter a building or \"basement\" (temple of purgation, the new map etc. )where the dynamic lighting changes dramatically the game freaks out 😭",
            "That's boring. All of those perks do completely different things. They do not need similar constraints.",
            "Like maybe stalking killers waste 1-2 extra seconds?",
            "Had it happen to a Steve. Steve took two hook states in one killing him while I’m stuck on the killer’s shoulder. Super confused how it happened considering the killer put me down, downed steve, hooked him, then picked me up, and I got stuck permanently wiggling.",
            "I'm sure it's fine as long as you don't play Legion. They made Bamboozle's vault speed increase not apply to Frenzy for that either. I'm not sure about Superior Anatomy, but I'm sure they'll go for that and Fired Up until they make sure that the killer whose power is running and vaulting fast, can't vault faster than other killers. That would just be unfair to other killers because they'd feel slower than a Feral Vault. When every other killer can have a vault build and vault faster than Feral Vault, then the game will be truly fair and we will live in a utopia.",
            "Yeah, just probably a continuation of the \"Bug Fixes\" for killer powers activating Bamboozle/Superior. I get not wanting them to burn Superior Anatomy, since it's timed, but the change to Bamboozle is bad.",
            "Nice, thanks, I thought they made it so it consumed the same amount of charges as when you heal someone else.",
            "That sounds good, I was worried that they made it so it consumed the same amount of charges as when you heal someone else.",
            "That's because Myers' and singularity vaults are not special vault abilities. They're just normal vaults, but with a speed modifier.\n\n\nThat being said it's stupid as fuck that killers with vault abilities can't have synergy with these perks. It wouldn't be busted or anything. Especially for legion. They deleted a thread about it on the official forums and it's just..... So stupid.",
            "Oh, that makes more sense. My brain honestly couldn't comprehend why that would even be changed, haha. I blame being sick.",
            "The fact there was only 2 hooks in the dungeon was straight up stupid, and portals are extremely strong",
            "Yes, they obviously mean if you self-heal from 0-100. They don't have a magic switch that deletes your medkit once you heal to 100.",
            "Apparently it's not entirely fixed, for some reason the voice is tied to the mask.",
            "Maybe people calling a volume increase a nerf should calm down",
            "> flight of the damned get nerfed? Why?",
            "They’re just making it a lil easier to see coming, it’s really not that big of a deal, keep in mind most survivors are just not good at this game vecna will be fine and dandy",
            "I mean it is technically a nerf, it probably won’t be a big one though",
            "It's made legion so fun these last couple of days 😭",
            "Only because they are not \"strong\" on paper doesn't automatically mean they cant perform well on average in public games.",
            "If the minor change to magehand impacts you THAT much i dare to slightly doubt that",
            "No, they said it was a visual UI bug that needed to be fixed in the upcoming hotfix, but nothing happened after the Unknown release. There are already other posta in reddit and the official forum.",
            "The first time it happened to me too I honestly thought the killer was hacking till I saw on Reddit it happening to others too 😂",
            "I'm guessing this is excluding Streetwise?",
            "What about great Skillchecks?",
            "This for sure. High mobility. High anti loop mechanics. High information gather. All in his base kit. Vecna might take a minute to get used to, but he is insanely strong when you learn him.",
            "I play with a group of friends so we escape 90% of the time. And we know each others challenges and play around it.\n\nHave fun in solo queue tho lol",
            "4 seconds is technically possible with 1 drop from boilover, and flip flop. Even moreso with breakout from an ally. Barring those, wiggle off cheats do happen. I've definitely faced them before.",
            "My guy just throwing in buzzwords",
            "The killers dread the map, they don't get inside the dungeon because of how strong it is, so if you manage to finish a couple generators upstairs they won't be able to defend the rest. I do agree that the exit gates are busted and should be farther apart.",
            "The illusion effect isn't visible until the killer is very close. That was addressed in the last \"bug fix\".",
            "Nah 2 seconds is too much it will only waste 1 second",
            "My biggest problem is I never know if the killer actually fell for it",
            "Agreed. I figured it had something goofy going on with it since it seemed to have the pre nerf blast mine effect.",
            "Nerf pig ![img](emote|t5_3cb2g|2213)",
            "Will you take a look at the gates on Vecna map? They are like 3 meters away from each other",
            "I'll be honest, I think the only really damning (heh) trait of Flight of the Damned is its cooldown. I think if a low cooldown Flight of the Damned was the primary chase ability of a killer with a decent map pressure power (A bit like UVX on unknown), I think they would be really good since Flight of the Damned if used right, even without instant tech, is very fast at catching animations and forcing survivors to do awkward moves, whilst being very low committal outside of the vecna cooldown compared to other killer projectiles which slow you down way more.",
            "Going to be honest, I personally don't find insta tech too strong, but I also don't think FoTD is weak without it either.",
            "It what world is it too strong? It's on a cooldown, requires precise spacing, and can be avoided by crouching early when you see the windup animation. Obviously it's difficult through walls but it's not uncounterable.",
            "Dream pallets",
            "Its better than nothing, for the hard of hearing.",
            "It works with Myers because he just gets vault speed, legion isnt just a vault speed buff.",
            "Its not that obvoius when it comes to dbd",
            "Interesting. Thanks for the info.",
            "There are 0 hints of anger there. I imagine you just crumble to dust when witnessing actual emotion.",
            "That doesn’t mean I’m upset, I’m just confused dude.",
            "It was already easy to see it coming. It's a dog shit power that's easily dodged by anyone with two brain cells. \n\nI play against good survivors. No idea what you're talking about.",
            "Did you actually notice a difference when vaulting in Legion's power?",
            "Thats not what im saying tho. Hell i'd consider Vecna a high A tier killer or mid A aprox.\n\nIm saying to not just take the data(specially on nightlight) at face value, we critizice the devs for doing just that, looking at data in a vacuum\n\nThe exact same data that shows Vecna having a 70% killrate is also showing Skull merchant having a higher killrate than him, and a very close killrate to Pig and Sadako, followed by Twins\n\nAnd then on the lowest end you have Singularity followed by Knight and Artist, 3 killers that whatever your opinions are, weak wont be one\n\nVecna is new, has a complicated kit, and punishes people not interacting with its new chest/item mechanic well enough, him having a higher killrate will be the norm",
            "People treat any nerf to a killer as i 'nerfed into the ground'",
            "> they said it was a visual UI bug\n\nThey said the same thing about things that were NOT bugs...",
            "I thought it was on purpose with the store change omg 💀",
            "Good to know now :D I played wraith that time and went around cloaked with kate 'flying' on my shoulder and had a good laugh with the team",
            "This. I'm ass at killer and still managed adept in 2 matches. Thought I was good until I then proceeded to get absolutely stomped going for Knight adept 😂",
            "That's what I got so far, too; no idea why you get downvoted but I imagine it is because of a 4x suvivor main majority",
            "I got some fun value out of it recently. I was up on the gallows on dead dawg and huntress was up on the saloon balcony. I had an illusion of myself repairing the gen with my back towards her while I repaired on the other side out of site. She tried to snipe me three times before giving up.",
            ">The community is incredible\n\n![img](emote|t5_3cb2g|2070)",
            "Thank you; we can let the team know!",
            ">It what world is it too strong\n\nAny hit that is nigh upon guaranteed just for pressing a button is bad imo. Every 38 seconds (34 or even less with addons), vecna gets a free health state. On top of mage hand, being a 115 killer, having a catchup tool, etc. It makes his regular counterplay (or really any counterplay) unsafe.\n\n>can be avoided by crouching early when you see the windup animation\n\nWhich vecna can fake or even skip altogether with *another* tech that allows you to throw out a spell without the casting animation. Even in the best circumstances (without skipping the animation), this requires you to: have line of sight of Vecna, be actively looking at him, immediately differentiate between multiple different casting animations, avoid any animation locks such as vaulting a window or dropping a pallet, hope that he doesn't fake it for distance, then crouch for more than half a second as he catches up. If any of those don't happen, free hit. And even then, if vecna makes enough distance, he can still get an m1 off.\n\nThe counterplay is far too specific, far too difficult, and far too inconsistent for an ability that is not only pretty easy to use, but is also on a killer who has 3 other abilities.\n\nThere needs to be a happy medium with flight otherwise it'll be miserable for one side or the other depending on vecna's knowledge of the tech. The spacing really isn't that hard to judge once you get it down; I only played vecna for a few days and I was already hitting instatechs like 75% of the time",
            "It IS uncounterable if the killer is smart enough to use it when theyre very close, usually through a wall or directly on the other side of a thin loop. That's what they mean when they call it an \"insta tech\", even if you crouch the millisecond you hear it activate you're still getting hit, it basically hits you immediately on spawn.",
            "I would argue that dream pallets get value more often than flight of the damned does. Unless survivor comms are literally comp level, then someone is falling for them at least a few times during a match, which gets you a hit. Before I figured out instatech was a thing, I got maybe an average of 0.75 injuries with flight per match. 1 being *generous*",
            "Dream pallets should be basekit with snares",
            "While I'm not fully disagreeing with you, when have they ever made a change that is THAT badly designed that 1% of a heal wipes your whole item?",
            "Who asked for your opinion? I ImAgInE YoU are the smartass nobody likes at school.",
            "Yes, very much so.",
            "I guess so. I didn't even say that it was good for survivors, for what I've seen both groups dislike it.",
            "no problem :P Also , pretty please would you mind putting on your whiteboard the plan to take a look at Nemesis's addons and give them a little shakeup? :3",
            "It's all about the mindgames with the hand and the skeletons, saying it's a guaranteed hit upon using the power isn't fair because the counterplay happens before that.",
            "Same person that asked specifically for your opinion.",
            "Fair enough. Figured their vault was more than fast enough in power.",
            "Yes I know. Which is why I listed all of the things you have to do simultaneously *before* he casts flight. If any single one of them isn't done within a split second then you're getting hit unless the killer fucks up. \n\nDon't have line of sight? You get hit because you can't react to the cast. Or you path super strangely as a preventative measure and risk vecna gaining enough distance for an m1. You don't know the 4 stances well enough to tell them apart at a glance and immediately react? You get hit. You move your camera off Vecna so that you can path correctly through a loop? If he casts, you get hit. Vault a window, drop or vault a pallet? If he casts, you get hit. React correctly and precrouch? He can just let go of m2, gain distance, and m1 you down like pyramid head.\n\nIt's a frankly ludicrous amount of things you have to do to even have a chance of counterplaying *one* of Vecna's spells. If it were a 50/50 sort of thing I wouldn't mind. But it's very much not",
            "But that's all just things you have to learn to play against the killer. I don't think it's that different from learning to play against other killers with similar powers.",
            "It's different in the ways that matter. I'll use pyramid head as an example since it's the closest thing to flight of the damned. In addition to the things you do for flight (line of sight, visual cue (which is longer and easier to discern than vecna's), avoiding animation locks, etc.), you *also* get a gigantic sound cue when he puts his sword in the ground that can very easily be heard anywhere within range of punishment, *and* a visual cue when he fires that is actually properly reactable even through walls. And even still, pyramid head is one of the stronger killers in the game. Flight of the damned has neither of those things if instatech is taken into account\n\nEven if you learn the counters to instatech, they're not consistent enough to be a reliable defense against the power. If the vecna player knows the distance, then he's getting a hit the vast majority of the time because of all the ways he can remove that counterplay. Pyramid head is A tier yet still has loads more counterplay than one of vecna's four powers. Yes, the cooldown makes it less of a win button than it would be otherwise, but anything with that little interaction just isn't a good thing imo."
        ]
    },
    "Developer Update | June 2024": {
        "title": "Developer Update | June 2024",
        "score": 2198,
        "url": "https://www.reddit.com/r/deadbydaylight/comments/1dkc94v/developer_update_june_2024/",
        "content": "https://preview.redd.it/ahwt25j5dq7d1.png?width=1920&format=png&auto=webp&s=6068136e208c923a3a0288562a4f55a3f1461c7f\n\nThe 8.1.0 Update approaches! Read on as we divulge all the major changes making their way to the game, including updates to Killers, Perk changes, quality of life improvements and more.\n\nhttps://preview.redd.it/evc6ogo9dq7d1.png?width=1280&format=png&auto=webp&s=c465ad9267afce9faac66af52fa4fe2b95875cbf\n\n* \\[NEW\\] Added ability to manually swap between guards.\n\n*Dev note: Each guard has a specialty, so we’ve added the ability to choose the right guard for each situation. This will provide a nice boost in power and quality of life.*\n\n* \\[NEW\\] Patrol paths must be at least 10 meters in length.\n* \\[NEW\\] Added a multiplier to guard hunt time based on path length. Longer paths increase hunt time up to a maximum 1.5x the normal duration.\n* \\[NEW\\] When The Knight is within 8 meters of his guard, the guard’s hunt timer depletes 3x faster.\n\n*Dev note: Dropping a guard at your feet in a loop is often the best choice but leaves little counterplay for the Survivor. We’ve added incentives for longer paths and improved counterplay when someone is being chased by both The Knight and his guard at the same time.*\n\n* \\[CHANGE\\] Reduced The Carnifex’s hunt time to 12 seconds (was 24 seconds).\n* \\[CHANGE\\] Increased The Jailer’s hunt time to 24 seconds (was 12 seconds).\n* \\[CHANGE\\] Reduced The Carnifex’s banner spawn time to 5 seconds (was 10 seconds).\n* \\[CHANGE\\] Increased The Jailer’s banner spawn time to 10 seconds (was 5 seconds).\n\n*Dev note: The Carnifex was previously the best at both breaking things and keeping Survivors occupied, making him the best choice for multiple scenarios. We’ve swapped these hunt times (and their associated banner spawn times) around, making The Jailer the specialist for patrolling and chasing the longest.*\n\n* \\[CHANGE\\] Decreased The Carnifex’s breaking time to 1.8 seconds (was 2 seconds).\n* \\[CHANGE\\] Decreased The Assassin’s breaking time to 5 seconds (was 6 seconds).\n* \\[CHANGE\\] Decreased The Jailer’s breaking time to 5 seconds (was 6 seconds).\n* \\[CHANGE\\] Increased The Carnifex’s detection range to 10 meters (was 8 meters).\n* \\[CHANGE\\] Increased The Assassin’s detection range to 10 meters (was 8 meters).\n* \\[CHANGE\\] Increased The Jailer’s detection range to 16 meters (was 14 meters).\n* \\[CHANGE\\] Updated various Add-Ons.\n\n*Dev note: Map of the Realm and Pillaged Mead were fan-favorite Add-Ons, so we have incorporated some of their effects into the base kit. We’ve reviewed many of The Knight’s Add-Ons to bring the strongest and weakest Add-Ons closer together.*\n\nhttps://preview.redd.it/ij2hk0kcdq7d1.png?width=1280&format=png&auto=webp&s=7776b0d3efe6678f065d3cd587a506122c94f1eb\n\n* \\[NEW\\] Taking control of a Biopod will now cause it to aim at the nearest Survivor within line of sight.\n* \\[NEW\\] After 0.25 seconds, targeting progress now decays over the next 0.5 seconds.\n* \\[CHANGE\\] When controlling a Biopod, Survivor now only glow if they can be targeted.\n* \\[CHANGE\\] Decreased Biopod targeting cooldown after Sipstreaming a Survivor to 3 seconds (was 3.5 seconds).\n* \\[CHANGE\\] Improved UI when using Biopods and when shooting with the Killer.\n\n*Dev note: The Singularity can be hard to learn but deadly when mastered, so we’ve made some adjustments to make targeting Survivors with Biopods easier. These changes won’t have a significant effect on those who have already mastered The Singularity.*\n\n* \\[NEW\\] Added the ability to destroy the currently controlled Biopod.\n* \\[CHANGE\\] The Killer can now hear audio by default when controlling a Biopod.\n\n*Dev note: Some quality of life improvements! Biopods now have audio without needing an Add-On, and you can now destroy a Biopod from a distance as long as it is not disabled.*\n\n* \\[NEW\\] The Killer now receives Killer Instinct when a Survivor is Slipstreamed.\n* \\[CHANGE\\] The last controlled Biopod has its aura revealed in yellow for 10 seconds (was 5 seconds).\n\n*Dev note: Switching between Biopods and The Singularity can be disorienting, so we’ve made some changes to help players get their bearings and find targets.*\n\n* \\[NEW\\] The Singularity gains 3% Haste while in Overclock mode.\n* \\[REMOVED\\] Overclock’s duration no longer scales with the number of Slipstreamed Survivors.\n* \\[CHANGE\\] Increased Overclock’s base duration to 5.7 seconds (was 4.7 seconds).\n* \\[CHANGE\\] Stuns caused by Perks (such as Head On, Blast Mine) during Overclock mode will now cause Overheat.\n\n*Dev note: The Soma Family Photo Add-On was much loved, so we’ve added part of its effect to the base kit. To simplify Overclock, we have removed the scaling duration and bumped up the time to 5.7 seconds.*\n\n* \\[NEW\\] Added an aim assist effect to shooting a Slipstreamed Survivor.\n* \\[CHANGE\\] Increased an aim assist when creating a Biopods.\n\n*Dev note: When attempting to teleport to a Survivor or place a Biopod, a slight change could cause your shot to miss or become an invalid spot for a Biopod, causing it to do nothing. We have improved the aim assist to linger slightly longer on the last valid place or Slipstreamed Survivor.*\n\n* \\[NEW\\] Passive EMP printing at Supply Cases is now limited to 97%. The remaining progress must be done manually by a Survivor.\n* \\[NEW\\] Supply Cases that have reached the passive printing limit now have their auras revealed in yellow.\n* \\[NEW\\] Disabled Biopods will pulse shortly before they are reactivated.\n* \\[CHANGE\\] Decreased the aura reading range of Supply Cases to 28 meters (was 32 meters).\n* \\[CHANGE\\] Increased range of EMPs to 10 meters (was 8 meters).\n* \\[CHANGE\\] Decrease immunity to Slipstream after using an EMP to 0.35 seconds (was 2 seconds).\n\n*Dev note: EMPs are an essential tool to playing against The Singularity, but they can be too plentiful at times, making it hard for The Killer to use their Power. Survivors will now need to spend a little more time to acquire EMPs, and they won’t be protected from further Slipstreams after using one. We’ve added new VFX to Biopods to let Survivors know when a pod that has been disabled is about to reactivate.*\n\n* \\[CHANGE\\] Reduced the time it takes to switch back to The Singularity to 0.5 seconds (was 1 second).\n* \\[CHANGE\\] Reduced the time it takes to switch back to The Singularity when near a hooked Survivor to 1.5 seconds (was 5 seconds).\n\n*Dev note: Since the introduction of the Anti-Facecamp system, this penalty became a little redundant as staying near a hooked Survivor now carries its own risks. We’ve reduced this penalty, though accessing Biopods next to a hooked Survivor still may not be ideal. We have also reduced the base wake-up time to make swapping back to The Singularity feel more responsive.*\n\n* \\[CHANGE\\] Updated various Add-Ons.\n\n*Dev note: We have review The Singularity’s Add-Ons, giving some new effects and balance tweaks to others.*\n\nhttps://preview.redd.it/z2kro3zfdq7d1.png?width=1280&format=png&auto=webp&s=8d0deb185b862d605d806024b682558766cd4c1d\n\n* \\[CHANGE\\] Increased aura reveal duration to 6/7/8 seconds (was 3/4/5 seconds).\n\n*Dev note: With a longer duration, it will be easier to take advantage of the aura reveal and allow this Perk to be used more aggressively in a chase.*\n\nhttps://preview.redd.it/75g93wqidq7d1.png?width=1280&format=png&auto=webp&s=dc7c15dbe5214380594b592823bb2f2a0b87f0d7\n\n* \\[CHANGE\\] Reduced cooldown to 60/45/30 seconds (was 60/50/40 seconds).\n\n*Dev note: I’m All Ears can be very useful, but currently has a fairly long cooldown. We have reduced the cooldown so the Perk comes into play more often.*\n\nhttps://preview.redd.it/1mu7oqzkdq7d1.png?width=1280&format=png&auto=webp&s=8973b76957d04ff4434d6f3785331f10f2c1c22e\n\n* \\[CHANGE\\] Reduced cooldown to 60/45/30 seconds (was 80/70/60 seconds).\n\n*Dev note: Trail of Torment similarly has a long cooldown. We have reduced this as well to allow its effect to happen more often.*\n\nhttps://preview.redd.it/m866f62ndq7d1.png?width=1280&format=png&auto=webp&s=5bf90435b29a977f1c353d442d8c0989d6722741\n\n* \\[CHANGE\\] Reduced cooldown to 60/50/40 seconds (was 120/100/80 seconds).\n\n*Dev note: Oppression had a very long cooldown, so we have cut it in half.*\n\nhttps://preview.redd.it/hufizz5pdq7d1.png?width=1280&format=png&auto=webp&s=1052827484f3b71c6a2fcbc007eef160bd743e94\n\n* \\[CHANGE\\] Reduced cooldown to 60/50/40 seconds (was 120/100/80 seconds).\n\n*Dev note: This is not a copying and pasting error, we’ve done the exact same thing for Dragon’s Grip!*\n\nhttps://preview.redd.it/yr10oq1rdq7d1.png?width=1280&format=png&auto=webp&s=2bb0bab7fc88bac9f0ce77273c3807303f471b80\n\n* \\[CHANGE\\] Increased duration to 40/50/60 seconds (was 20/25/30 seconds).\n\n*Dev note: Getting Machine Learning to active can be tricky, so we’ve extended its duration to help the Killer get value out of it when it does.*\n\nhttps://preview.redd.it/6ba0l7wsdq7d1.png?width=1280&format=png&auto=webp&s=700a2e40bca61f484aed240ab5bf6f0dfaf97a2a\n\n* \\[CHANGE\\] Decreased starting skill check penalty to -15% (was -25%).\n\n*Dev note: Autodidact can become very strong (with some luck) later in the match, but the large penalty often means it’ll do more harm than good. We’ve toned down this penalty to make it a little more consistent and improve its strength once you’ve built up your tokens.*\n\nhttps://preview.redd.it/5ct797sydq7d1.png?width=1280&format=png&auto=webp&s=ecf68f5ee3843678c0f8d862dec2b631dd70064a\n\n* \\[CHANGE\\] Increased healing speed bonus to 30% (was 10%).\n\n*Dev note: Empathic Connection is great for showing injured Survivors where you are, but the healing speed bonus is a bit low. We have increased the speed at which you heal others to 30%.*\n\nhttps://preview.redd.it/sa8m3co0eq7d1.png?width=1280&format=png&auto=webp&s=09b2a0669ccba6b4157051a7d40b9546bb625ab3\n\n* \\[CHANGE\\] Grunts of pain are reduced by 80/90/100% (was 25/50/75%).\n\n*Dev note: Iron Will already makes Survivors fairly quiet, but even the slightest noise can give away your position. We have increased the effects of the Perk and reduced the gap between tiers to make lower tiers more useful.*\n\nhttps://preview.redd.it/d0b9bv73eq7d1.png?width=1280&format=png&auto=webp&s=5deafe20d4f92250703b27ee36da3afe3d52ac61\n\n* \\[CHANGE\\] Increased healing granted after being unhooked to 50/60/70% (was 40/45/50%).\n\n*Dev note: Resurgence is currently a little weak, and since it can only activate twice per match, we have increased the healing it grants.*\n\nhttps://preview.redd.it/gbcyfc55eq7d1.png?width=1280&format=png&auto=webp&s=1522031ee2184c4e9fec2274e8fe43e618cf4006\n\n* \\[CHANGE\\] Increased healing conversion rate to 50/60/70% (was 40/45/50%).\n\n*Dev note: Solidarity can be a little tricky to use, requiring you to be injured and find another injured Survivor to heal. We have increased the conversion rate to make it even more impactful when it comes into play.*\n\nhttps://preview.redd.it/xpkdjf77eq7d1.png?width=1280&format=png&auto=webp&s=ff9012438f94e7a0fa642028107bec028bdbde67\n\n* \\[CHANGE\\] Increased duration of Haste and pools of blood hiding to 20/25/30 seconds (was 4/6/8 seconds).\n\n*Dev note: Babysitter’s duration was low, causing it to not provide much value before it ran out. We have extended its duration significantly to make it more impactful.*\n\nhttps://preview.redd.it/u3fu9i79eq7d1.png?width=1280&format=png&auto=webp&s=8c9251754c178d2946bfa7c4bd82bb9cc7deb632\n\n* \\[NEW\\] Hooks that a Survivor has been sacrificed on will repair themselves after 60 seconds.\n\n*Dev note: With hooks remaining permanently broken, it could create some deadzones where it was impossible to get a Survivor to a hook before they could wiggle free. Now when a Survivor is sacrificed on a hook, it will automatically be repaired after 60 seconds.*\n\nhttps://preview.redd.it/j7ko9gmbeq7d1.png?width=1280&format=png&auto=webp&s=d6769b9d4badf62fe1256b8bc893d81ff7fa3462\n\n* \\[NEW\\] Added layout variations to Yamaoka Estate maps.\n* \\[NEW\\] Added layout variations to the Mount Ormond Resort map.\n\n*Dev note: We have added new possible layouts for each of these three maps. While the layout of these variants are different, they’ll include the same iconic features (landmarks, decorations, etc.) and are a similar size to the originals.*\n\nUntil next time…\n\nThe Dead by Daylight team",
        "num_comments": 1819,
        "comments": [
            "#OTHER NEWS:\n\n##[**8.0.2 | Bugfix Patch**](https://www.reddit.com/r/deadbydaylight/comments/1djkhi5/802_bugfix_patch/)\n\n##[**8th Anniversary Event Thread**](https://www.reddit.com/r/deadbydaylight/comments/1df1x15/8th_anniversary_event_thread/)\n\n##[**#IntoTheRainbow2024**](https://www.reddit.com/r/deadbydaylight/comments/1despby/intotherainbow2024/)",
            "https://preview.redd.it/4hc8qr8uhq7d1.jpeg?width=629&format=pjpg&auto=webp&s=6c6a7890cc4806ddd3880650311216df29556693",
            "\\* Knight changes that encourage players to not use their guards solely for loops while still buffing a decent number of his stats.\n\n\\* Huge Singularity changes that make EMPs less annoying and overall just better.\n\n\\* Reducing so many unnecessarily long cooldowns or short active periods for perks.\n\n\\* Iron Will is back.\n\n\\* Sacrificed Hooks autorespawning to prevent deadzones.\n\n&#x200B;\n\nhttps://preview.redd.it/pcr4cy51lq7d1.jpeg?width=640&format=pjpg&auto=webp&s=d40a41e2045ada82be27fe125a9292f90ab6b0d4",
            "Holy shit the 5 Singularity mains (including me) eating good",
            "Iron Will buffed oh today is a good day to be a jeff main",
            "Finally I can play Rebecca without the killer hearing my grunts of pain from across the map!!!",
            "Finally the oppression buff it always needed!!",
            "Autodidact!! Incredible news",
            "If someone told me that they would end up changing the Singularity because many people thought he was “trash” and frustrating to play, I would expect them to completely ruin the killer to cater to those players, which would make diehard Singularity mains sad because we know how strong he is and love his gameplay loop. \n\nThese changes are not that. Nothing but quality of life to iron out all the little unnecessary details about his kit. Good changes.",
            "https://preview.redd.it/urxzdtr6vq7d1.png?width=1080&format=pjpg&auto=webp&s=6daad79387c3005385d70198cbdac43bd3dc1425\n\nIncredible update fr",
            "IRON WILL IS BACK BABYYYYYY🎉🎉🎉🎉🎉🎉",
            "The babysitter buff is actually an insane anti tunnel now. 30 seconds of f haste and aura reading!",
            "How big and meaningful are the changes to knight?\n\nThe manual selection seems huge imo.",
            "God damnit Behavior, I woke up wanting to come on here to bitch and moan not be surprised and happy 😡",
            "Knight and Hux changes at the same time make me beyond happy. While one of them has a less than stellar reputation, I love both to bits so seeing them receiving love is just so nice.",
            "MY AUTODIDACT/EMPATHIC/SOLIDARITY BUILD IS SOBBING TEARS OF JOY WE’RE SO BACK",
            "Unrelated question. \n\nAny update on all the tests being made (available only for parts of the community)? Hiding prestiges in pre-game lobby, different UI placement for perks, etc.\n\nIt feels like they have been happening for an eternity now. Hiding prestiges in pre-match lobby would be most welcome in live environment.",
            "Oh yeah, Iron Will is back",
            "Off the record and DS move aside, there's a new anti-tunnel king in town! It's an insane buff, but that's 100% a good change, since babysitter can't really be used aggressively (like hit tanks with otr, grab plays with ds)\n\nAlso, YOU can give your silly solo queue teammates anti-tunnel now whether they want to or not!\n\nBuff borrowed time (the perk) to 20secs next?",
            "Holy shit what an update\n\nSo many awful perks now actually useful (oppression, solidarity, emp connection!!!)\n\nSingularity changes look good as someone who spent a lot of time on singularity, emp changes thank GOD\n\nKnight changes are interesting, being able to choose what guard to use seems to me like people are just going to spam carnifex on pallets for free hits?\n\nAlso why are we adding more layout variations to maps… devs want all survivors to dedicate a perk slot to Windows of Opportunity",
            "Some really nice changes in here.\n\nBasekit additions for Knight and Lary. Perk cooldowns brought up-to-date. Hook respawn which I assume this will respawn Scourge Hooks...\n\nThat's massive. Absolute W.\n\nLooks great.",
            "IRON WILL IS BACK ON THE MENU BABY!",
            "Singularity Buffs and Hook Respawn massive W",
            "Had to wake my brother up since he mains singularity. He was very excited",
            "I've been a fan of the Botany/Empathic combo, it's great in solo queue. Now it'll heal at +80%? Could go overboard with Desperate Measures, maybe even CoH or WMI. Pick them up at lightning speed with WGLF hahahaha\n\nBotany Connection go *brrrt*",
            "singularity will never receive nerfs because it wasn’t designed to harm the crew.",
            ">Patrol paths must be at least 10 meters in length.\n\nAm I reading it wrong or does that mean pressing M2 at loop and immediately letting off won't work anymore?\n\nIf yes then hell yeah. Now only SM left to ~~butcher~~ fix!",
            "Singularity is gonna be kinda insane now.",
            "Gonna have to play with knight to feel this change, cause the guards on their own arent good at securing the hit, so really not sure how useful they will be if they go away 3 times faster. Base kit map of realms is amazing though.\n\nHope they fixed the bug where you can stun the knights little green orb while he is in the power.",
            "FINALLY some Knight and Singularity changes, especially the latter has been in a godawful state since an entire year. I'm not so sure how the Knight changes will pan out - his guards are already awful at hitting survivors, this will make them even worse - but the Singularity changes are definitely a much needed buff.",
            "Singularity bros...\n\nhttps://preview.redd.it/gjzogadx0r7d1.png?width=1080&format=pjpg&auto=webp&s=6599ea2e835d3700be66ecad6ae328feeace262e",
            "Iron willl is back!!!! Yeah baby!!!!\n\nAs a survivor main, I hate that hook now respawn after death, but I can't deny that it's an healthy move for the game. \n\nI like most of the change except empatic connection.... Isn't now just a better botany knowledge?",
            "All these changes and no ones mentioning Dragon's Grip. I don't think anyone realizes how cruel that's going to be on Wraith.",
            "LET US SEE OUR TEAMS PERKS FFS",
            "Looks like I can finally go back to playing Bill, Ash, and Jeff comfortably again. An autodidact buff kinda scares me because it makes me paranoid thinking that people will start crying for a nerf.",
            "All this and we still can't get swamp reworks...\n\nEdit: I got temp banned so I can't reply to stuff, but I'm not being ungrateful. These are mostly all great changes that should've happened a couple years ago. It's just a bit frustrating to see new map after new map, new realm after new realm, new variation of existing map/realm etc and we're still just waiting on the swamp rework. Once it's done then they can release all the terrible maps they want, but it's just like whyyyyyy just do it it's been like 4 years since the overhaul project was started and at least a couple since the last rework",
            "These perk changes are an overall W! I love seeing lesser used perks get buffed! (Iron Will going back to 100% was a surprise!) Keep it up!\n\nChanging guards at-will for Knight made me think the next patch note was going to be about The Nightmare having the same ability with snares/pallets, but perhaps another day...\n\nAlso, is chasing someone at the same time with your guard a dead strat now? Being within 8 meters of your guard chasing someone can make them disappear within less than 4 seconds (Carnifex and Assassin)? Am I reading that correctly???\n\nALSO DEATH-HOOK RESPAWNS?!?!?!?!?!?! FINALLY!!!",
            "As a fellow knight main.\n\nDont know if i like it or not.\n\n- No antiloop. Ok i get this one, but is weaker.\n\n- If pincer attack, depletes 3 times faster. Weaker.\n\n- If no pincer attack, free flag.\n\nBut half map of the realm and can choose guards. \n\nOn paper doesnt seems fair to me. Will try it out.\n\nAt least full map of the realm, way better addons and hope for bug fixes to compensate.",
            "I was about to get mad at the Knight getting buffs until I read the last change with the guard's meter depleting faster when he's next to it. I like that change a lot.",
            "I'm really hoping they did something to make Knight's guards actually viable in chases if they're seriously going to make it so the player can't even be near a hunt as it's happening. \n\nIf not, then his changes are just straight up nerfs to an already struggling killer. Anytime I play him, I love setting long patrols and trying to catch people off-guard - but it never works, and typically the guard is just good to try and corral a survivor towards you... Which you can't do anymore since their hunt timer depletes too fast when close, apparently.\n\nI mean, it's literally child's play to kite the guards near windows and mess up their pathing so bad they're never going to catch you. Without the Knight nearby to make use of the guard's distraction, he's probably never going to get any hits on survivors while making use of his power. These changes to the hunt timer just don't seem very well thought out with all of his bugs / quirks in mind. Everything else is fine, but the hunt timer thing really needs to revert for the Knight to stay playable and actually have fun interacting with his guards.",
            "As a Knight player I'm somewhat skeptical about these changes.\n\nI think they have a good idea,but they need to make call to arms base kit, Imo otherwise this seems like it's just a nerf.\n\nI'm fine with nerfing the guaranteed M1 in loops,but they need to buff the patrol/cutting survivors off playstyle more otherwise he has very little in chase.\n\nThe meter depleting when close to 8 meters thing also seems overkill; like why am I supposed to get punished if I get closer to the survivor who I want to hit who also got detected by my power? Idk.",
            "Words cannot describe how happy I am about that Iron Will buff",
            "IRON WILL MY LOVE \n\nI MISSED YOU",
            "While some of the knight buffs are cool (base kit addons), the change that the guard timer depletes when knight is near completely guts him? Am I wrong that the Knight is going to be even weaker now?",
            "As someone who has played this game for so long and been through its highs and lows… PLEASE keep giving us patches like this.\n\nI usually don’t comment on these things but this change is so good I am hoping my voice can somehow be heard, even if it’s in a large crowd and gets drowned in new. I just want to say something. BHVR, we love this. Please, please, *please* keep giving us more of this. This is the best set of patch notes in a while, and while it’s still good in isolation, this game would be even more dynamic and interesting if you keep rolling out changes like these that keeps the outdated/useless stuff viable.",
            "Oooo a lot of buffs and new map variants! This will be interesting! Cant want to see.",
            "Iron Will buff?! YES!!!",
            "Damn, that new Partner Program is making a huge difference, I see\n\nThis is absolutely fantastic, and I really do think that more people will buy these chapters now\n\nAny updates on Skull Merchant?",
            "Love babysitter, iron will and all perk changes!!!",
            "Babysitter insane buff. Never taking it off now, basically. Thats such a good perk.",
            "Okay Scott, you can come out now. The joke is only funny once.",
            "This is amazing, but can we also get the bonus bloodpoint gain functionality to prove thyself? I’m finding it hard to max objective out of all of the categories",
            "Were eating good this patch!\n\nhttps://preview.redd.it/qtrla2125r7d1.png?width=257&format=png&auto=webp&s=b080a489afefe1bdb7adbb9063f3c95149d57f1f",
            "Very interesting they buffed Iron Will back to 100%. The fact Adrenaline, a perk that most people would say was perfectly balanced, could receive the nerf hammer but Iron Will gets buffed back to original numbers puzzles me.\n\nKnight changes *seem* good but those changes are something I need to see in action. Right now Knight is miserable/boring to play against. These changes do seem to address those issues but its hard to fully know til you play against him.\n\nSingularity changes are nice but its a little bit concerning. Players who know how to play him can already control the game/chases to a insane degree. These changes will make that oppression even stronger as it irons out a lot of issues this killer had. It will help the low end of Singularity users but it will make the top end way too strong. This is the one change I'm weary on and I fear its going to be Billy 2.0 in terms of being blatantly OP.",
            "When Is It going to be release?",
            "Calling hook respawn a minor update is interesting",
            "https://preview.redd.it/8hkq54aops7d1.jpeg?width=680&format=pjpg&auto=webp&s=1c45cd643ce5fd3fd106ecea95fe38b4ede07db1",
            "Can you please make singularity less loud. Can’t hear anything around me when I’m playing as him",
            "Old iron will is back",
            "complaining about the hook respawns is so weird, this is almost never going to affect wiggling out cause if a killer knows they can't reach hook you're just gonna get bled out, which this update should hopefully fix or at least make less common",
            "Isnt that a knight nerf?",
            "ATTENTION HUX MAINS, SINGULARITY GOT BUFFED AND WE ARE SO BACK!!!!\n\nhttps://preview.redd.it/b9xq1qa51r7d1.jpeg?width=1170&format=pjpg&auto=webp&s=dd0e8931a8bdc646dad8c774f8c7aca76d428f55",
            "I'm genuinely worried about dragon's grip in 3gen scenarios now...",
            "These Knight changes are genuinely mind-boggling.\n\n So they completely remove his ability to use his power at a loop AND his ability to work in tandem with his guards. So what does he like. Do now? Like genuinely what is Knight supposed to use his power for? Guard snipes aren't an efficient way to play him since guards aren't a threat on their own, and a forced 10m path will give survivors plenty of distance any time you use your power in chase",
            "> [NEW] Hooks that a Survivor has been sacrificed on will repair themselves after 60 seconds.\n\nOMG AFTER ALL THOSE YEARS. Finally I won't have to slug survivors or get slugged myself because of no hooks nearby! They could even reduce the time to 30 seconds to be honest to reduce the annoyance of slugging all survivors that died in the same spot.",
            "Now that the Knight can't \"Artist Cosplay\" at loops AND that 3x faster duration if knight/guard are chasing the same target, can he see scratch marks while putting the path? And use his power closer to walls and similar things?, that would be great.",
            "Am I dreaming? Is this real?",
            "This is a great update, could we get that iron will buff on no mither too 🥺",
            ">\\[NEW\\] Patrol paths must be at least 10 meters in length.\n\nDoes this mean that the Knight can no longer place the Carnifex down to insta break the pallet in a chase??",
            "Dogshit perks buffed across the board, Knight forced more towards patrols instead of press m2 at loop, Singularity omegabuffed.\n\n\nAbsolutely blessed patch, no notes.",
            "Still think its funny some of these perks even have a cooldown, especially oppression.",
            "Wonder how baby sitter on someone with otr gonna look. That be a pretty insane anti tunnel combo lol",
            "Pleasantly surprised to finally see positive changes to struggling killers/perks rather than sweeping nerfs that put them in the struggling category along with the rest. Especially since it's the first time I feel like killers were actually listened to. Assuming it doesn't get reverted. :)\n\nIt will be time to put empathy back in my builds for a good week before I give up after the nth survivor leading the killer to me.\n\nIron Will will be OP as shit though. Fat fingered the buff button as always when it comes to survivors.  \nOn the bright side, now I'll be able to play Bill.",
            "SINGULARITY MAINS!\n\n![gif](giphy|s7AqdrrbvZFFFpcUo9|downsized)",
            "This is not happening left dead in the dirt yet again. Fun changes overall though!",
            "Oddly enough, I don't really like the hook respawn mechanic being added. When playing killer I felt like I had to be fairly strategic on where I hooked survivors, and got rewarded for good gameplay later on. \n\n\nI guess SWFS could abuse it too easily so it's still a good change, but one that I'm a bit sad about. Oh well, probably healthier for the game anyways",
            "I haven't played in like 6 months but these notes make me want to come back and buy Singularity\n\nAny bp boosts rn?\n\nhttps://preview.redd.it/nz6ycel0er7d1.jpeg?width=1225&format=pjpg&auto=webp&s=c854ef83db431bf1570365884928f01a2949c165",
            "Buff Better Than New.",
            "Cross progression?",
            "IRON WILL IS BACK, BABY",
            "Make solidarity 100% you cowards. Resurgence & solidarity also still gets countered by hemorrhage making it near useless.\n\nThe knight changes sound like a net nerf, but we will need to see the addons.\n\nAutodidact is not strictly a buff, because larger penalty meant more time to get skillchecks. Once again bhvr fails to identify the true problem.\n\nThe hook timer at an astounding *60 seconds* seems way too low. It was the killers version of 3-genning. Skill issue if they fail to plan. And just a few days ago you added more hooks to the underground of Forgotten Ruins, presumably for this exact issue.\n\nDespite all that I’m glad to have iron will back and interested to play Singularity buffs",
            "Hook respawns yay!!!! Finally!",
            "Since it isn't mentioned either way, can we assume Iron Will is going to retain the \"no in effect while Exhausted\" effect?",
            "You killed the knight,  he needed his AI guards to not be useless not nerfing them.",
            "They reprogrammed Singularity to harm the crew.",
            "the fact that they call Iron Will buff back to 100%, making it S tier again, a 'minor change', shows that the devs have zero clue what the actual f they are doing.\n\nOn the other hand, the other changes seem pretty decent, but I could think that a reduced cooldown on perks like dragons grip could get a little annoying. We'll see.",
            "IRON WILL MY LOVE",
            "Now please give pyramid head a look into his addons and maybe a power overhaul. He desperately needs one",
            "WE'RE MAKING IT OFF OF DVARKA DEEPWOOD WITH THIS ONE",
            "When I first seen the knight change to have guards change like Vecna spells I had to double check if it was a troll post. Thank you for looking at all the underrated perks and buffing Larry and knight.",
            "Holy fuck they remembered Knight exists, I'm actually gonna have a main again after leaving him for a year due to all the bugs and having 1 addon slot.",
            "I'd unironically call that knight adjustments a nerf. Now if youre at a pallet gym or short pallet - **you have no power**. You're Tier 2 Myers with no +vaultspeed. The second the surv sees/hears him drop his sword (using power), they just bolt away and they're free, since he now needs to spend a decent amount of time in it at minimum before he can get out. Yeah the standard play was kinda dumb but Knight wasn't even a strong killer...\n\nChoosing which guard to use is nice but doesn't offset that big of a nerf. The other guard buffs are meaningless as their pathing and AI are garbage, nobody is getting hit by a guard - Its the fact that they forced the survivor into a path so YOU could hit them, but you can't use them in chase anymore so... what's the point? The only guard-hit possible is if you were to snipe someone with the Assassin, but if youre sniping at range they can just grab the banner themselves, again the chase AI is garbage (iirc Otz or Henz has a vid where they run them in a circle within 5m for the entire hunt)\n\nAll he needed was choosing which guard, basekit Map of Realm (which they did 50% of, decent I guess), and bugfixes. The 10m minimum cast is a bigger nerf than any of those buffs combined (as again, most are useless).",
            "OMH BHVR LISTENED🥹. THE WEAKER PERKS GOT BUFFED AND THE FUN CHASE PERKS DID TOO. WE EATING TONIGHT BOIS",
            "I don’t think people get what this does to singularity, he’s going to be top tier now, those god singularity players are going to be unstoppable now man, also the perk buffs were all good imo, the babysitter change was great, might use that now…also the empathetic connection in a healing/team aura ready build was already really good, this makes it insane now, been using empathetic connection, empathy, botany knowledge and windows of opportunity and especially in solo q it is god tier, better than any anti tunnel build I’ve used",
            "Some changes worry me. hmmmm, most of the changes hurt soloQ",
            "As a certified Knight main I'm gonna say this if my bois are going to get longer hunt time based on distance  shouldn't banner spawns be adjusted to spawn a little later?\n\nLike I like going for longer range hunts myself but  either  they are getting ran for full duration or banner in 5.\n\nSpeaking of which there's no mention of any improved pathing so ppl may not even run to banner just run the gaurd for full hunt time length. Which would put the Knight in a very awkward situation of chase ppl actually doing objectives as m1 killer or fuck off to other side of map.  Where hunted guy is probably running the bois.\n\n\nAt the end of the day longer hunt times don't mean shit If jailer and carni are still 102% tbh.\n\nI don't mind adding counterplay and giving qol but I think a lot more tweaks. Need to be made of the reward of increased hunt time is to be added.\n\nManually being able to cancel a gaurd.\n\nPatrol path range requirement only being nesscary for hunt. Gaurd order  should be able performed at any length imo (I will trade being able to cancel pallet vaults\n\nJailer and carni need to be 106 at the least.\n\n\nAlso I dont think you thought about that this but you can kinda circumvent the requirement for patrol path if you just let the ball get stunned which is automatically gonna summon the homie in theory so unless you plan on making homie just not summon and Knight still get hit as a damm glowing ball yeah maybe remove da ball stun. \n\nEverything else looks cool love the buffs especially to some weaker perks. But theese Knight tweaks cooked for minute on paper til you think about thwm at least who knows what it'll be like in ptb but longer hunt times Generally screw you over unless it's assasin. But yeah I really don't the like the idea of someone going 'it's OK guys it's max length jailer  I'm going to run him for the full length since he's only 102% and he will last 36 seconds so enjoy 36 seconds of man With sword.",
            "God this is gooood!",
            "Yes,! Making a bunch of perks better!!!",
            "DRAGON’S GRIP!!!!!",
            "Wow these changes are great. Super impressed!",
            "SINGULARITY IS GETTING ATTENTION ITS HAPPENING",
            "Singularity buff LETS GO!!!",
            "Huge W!!\n\nTysm for buffing rarely used perks, this was very needed! \n\nVery happy to see the change to hooks as well and am excited to test the changes for Knight and Singu!\n\nThis is the right direction to move toward!",
            "Wow. Empathic Connection is now a decently good healing perk. With the only drawback of team mates sandbagging you!\n\nSeriously, back then it was only good for Solo Q. As in give information of injured survivors where you are. And getting sandbagged.  The healing speed was an added bonus. \n\nNow there's actually some value to it. Not sure where the new Autodidact is, but Empathic Connection might be sitting between Desperate Measures and Botany. Or might be on par with Desperate Measures. \n\n(Yes, Desperate Measures is my favourite healing perk.)",
            "Damnnn W changes. As the one Babysitter user I'm eating GOOD",
            "I'm so happy to see Iron Will returned to full strength.",
            "Jesus fucking christ that's a massive buff for singularity. It's a lot of little buffs all rolled into one, but I can see this making him a very very strong killer, even moreso than he is already. Guess it all depends on how impactful the overclock mode duration changes are\n\nI'm happy to see him get love, even if I personally think this is too strong of a buff for him",
            "THEY ACTUALLY BUFFED LOW AND MID TIER PERKS FOR ONCE LETS FUCKING GOOO",
            "The autodidact buff is insane. I got that perk a lot during chaos shuffle and loved it! But the -25% start was a tough pill.\n\n\nBut can we talk about the hook regen change?",
            "Finally what we’ve been wanting, buffs to lesser perks instead of constant nerfs to meta. Good perks to start with too!\n\nThis is a great start and looking forward to seeing other perks get their turn. ❤️",
            "https://preview.redd.it/gum71ufewq7d1.jpeg?width=460&format=pjpg&auto=webp&s=c5d8ef9e104d98b9ad43135ebde640a4fb3d9c9e\n\nSINGULARITY BUFF, MY DREAMS ARE COMING TRUE‼️‼️‼️",
            "I want 2 killers vs 8 survivors",
            "iron will comeback holy shit",
            "AUTODIDACT?! SOLIDARITY? EMPATHIC CONNECTION??\n\n**HEALING META** JUST CAME ONLINE BABY!",
            "YOOO OG IRON WILL BACK BABY.",
            "OG IRON WILL OG IRON WILL HOLY SHIT NOT A DRILL",
            "KINGHT REWORK! FINALLY!  \nKnight main here! I think it is pretty good but... just one thing to say:\n\nDev note: Map of the Realm and **Pillaged Mead** were fan-favorite Add-Ons, so we have incorporated some of their effects into the base kit. We’ve reviewed many of The Knight’s Add-Ons to bring the strongest and weakest Add-Ons closer together.\n\nPillaged mead? WHEN?\n\nBreaking speed was fine, pillaged meat was a useless addon that has a very minor but negative effect.  \nWhatever...  \nThe nerf in the short patrols id fine because in chase now you have infinite carnifex....\n\nNOW ENDURING 100% META ON KNIGHT!",
            "SINGULARITY BROS RISE UP",
            "Great Singularity change from a Singularity main, so excited!\n\n\nAs you may know the Knight is super buggy, does this Knight change also include bug fixes for him?",
            "Knight just need one more thing: A key button to instantly call back a guard while patrolling instead m1 them.",
            "Is this update releasing next week?",
            "Oppression is now a meta perk, 100%.\n\nI already really liked it on killers with built-in game delay, where gens are more likely to be left uncompleted (Pig, Pinhead etc), now its fucking amazing.",
            "I wish the Knight had a hotkey to have a guard break a pallet without going into the path setting mode, make it so you cant be stunned while setting a path, or allow you to enter pathing mode when close to a wall(its too restrictive and clunky). But these changes seem nice, hopefully the reworked addons bring some build variety.\n\nThe perk changes are all great! Especially the cooldown reductions! This should be the standard for a small patch, buff some numbers on a handful of weaker perks to shake things up a bit without needing to do massive reworks.",
            "I like this! Resurgence change is especially good for me, and the hooks respawning after sacrifices is a good change too.",
            "OLD IRON WILL BACK BABY",
            "AUTODIDACT BUFF RAHH",
            "Knight changes? Singularity changes? Hooks respawning after sacrifices? Actually buffing lesser used perks to make them really good picks?\nClearly I'm dreaming and this is another fake Scott Jund patch",
            "I like this update.",
            "Damn let them cook what a fucking good patch holy shit.\nMy concern is about control gameplay. Even though i really like seeing knights it really makes me think about any other co trol gameplay that we had i  the pass...... like skull merchant....\nNever the less it is a fucking good patch.",
            "What does the \"Targeting progress now decays\" mean? I don't play a lot of singularity, so I don't know if it means like after you shoot from your camera, you can shoot again quicker?",
            "I really feel like the Deathslinger changes were not enough previous main patch. They are nice, but they are not really felt in game or make a significant impact. I may be biased as a slinger main, but the cowboy still needs some buffs.",
            "As an Oppression fan,\n\nYEAH BABY, WOOOOOO",
            ">Decreased Biopod targeting cooldown after **Sipstreaming** a survivor to 3 seconds\n\n![gif](giphy|xUySTrbCFX1h4B8kmc)\n\n*Mmm yes, delicious juice*\n\nSeriously though, meatball is fucking back on the menu",
            "Dragon's grip and Oppression aren't dog shit! Woo-hoo!!!!",
            "This is one of the best QOL they've ever put out.\n\nAnd I mean that sincerely.",
            "BHVR, any chance to make knight’s guards do 5%+ per kick?  It was initially 3% as an incentive to use them to kick gens but now its outdated.",
            "Holy shit resurgence buff didn't expect that.\n\nBeen on my build ever since Jill released and I thought it was pretty good already. Glad to get even more value out of it",
            "Wonderful changes!\n\nNext let’s buff mirrored illusion! (Please! It’s so cool but rarely useful, as killer I always recognize it as an illusion. Half a gen to create one is asking a bit much for the payoff.)",
            "Now buff septic touch",
            "FELLOW LARRY MAINS WE ARE EATING A FEAST MADE FOR KINGS",
            "Anything to make Solo Que playable? If not yay.",
            "more and more killer buffs. awesome.",
            "Glad to see some changes to non meta perks",
            "Babysitter is going to make campers livid! Pair it with Yui's perk and it's the strongest anti-tunnel combination to boot.",
            "I'm glad to see my boy Hux getting some love, but I'm a bit worried about this change:\n\n*  \\[CHANGE\\] Reduced the time it takes to switch back to The Singularity when near a hooked Survivor to 1.5 seconds (was 5 seconds).",
            "These are some of the best changes in literal years. Now I just gotta wait for cross progression.",
            "https://preview.redd.it/5wwh8s8zds7d1.jpeg?width=750&format=pjpg&auto=webp&s=fc222842c0313736a7ab104651960d48b7effa4f\n\nSingularity players getting revived after this patch\n\n(Finally I can go back)",
            "Ok, I need to grind for singularity now he’s on offer anyway, but him getting a partial rework is nice- I think",
            "HOLY SHIT SINGULARITY MAINS ARE FEASTING TODAY",
            "Guys, this is exactly what you should be doing! Instead of just nerfing and then later re-buffing the same perks each update, buff some underused ones!",
            "# NOW\n\n# WE GONNA EAT",
            "Buffing obscure lesser used perks, oh my god they’re listening to us",
            "can we talk about why alot of players get the  “disconnected from host” errors and the player gets punished for it",
            "I'm not a spirit spammer, but this iron will looks really unbalanced. It leaves no counterplay at all, which really detracts from the players skill. Hearing iron will Ada was very very hard even at 75%. Idk this doesn't seem like a good game design to me, but I'll not really suffer from it so whatever.",
            "I wish there was an option to turn down chase music. Got tinnitus and the only way to hear any other sound is to turn the volume way up...",
            "Great. Another killer centric update. Survivor escape rate just dropped to 1%. Thanks for all the crying, killer mains, you're destroying the game",
            "I basically have no complaints with the changes at all except for I'm scared Knight will be undertuned, but that can easily be modified before this goes live. One of the best patch note drops I can ever remember from bhvr.",
            "I'm not super sold on such a heavy penalty on pincer-attacking with Knight, but it's great to see him get QoL overall, ESPECIALLY Map of the Realm no longer being absolutely mandatory. It'd also be REALLY nice to be able to deploy Guards for actions the way Anniversary pallet breaks work now, especially with the new trail limit.\n\nSingularity is FEASTING out here! It's nice to see the 200 IQ required to play him well being rewarded.\n\nMost of the perk changes are great, but IW being close to full power kind of scares me, and Empathic Connection + Botany may become problematic. I'm definitely using new Autodidact + Solidarity, though.\n\nBabysitter is going to be terrifying if people can just use their endurance for protection hits and shoot away at the speed of sound.\n\nThe hook change is a HUGE relief, especially with the new healing buffs. Being forced to slug is never fun, and it would be encouraged by a situation where picking slugged teammates up only takes an instant. \n\nReally great update overall, hoping things keep going well.\n\nEdit: Forgot IW still has a deactivation condition, so it shouldn't be game-breaking. It will be Blendettes' best friend though.",
            "This sounds awesome, finaly some big Perk updates And Singularity got a whole full day cooked meal changes.\n\nHowever Knight changes sounds like a Giant Nerf tho.",
            "iron will / distortion rats now post buff\n\n![gif](giphy|3rgXBqQT75uvb1V8Os)",
            "Dare I say it, an actual W update? I don't see many, if any, issues with most of these changes.\n\nHooks finally respawn on sacrifice! THANK YOU. No more survivors running to deadzones and teabagging cause they're unhookable. Wish it was slightly shorter but I'll take it.",
            "Iron Will is back!! Yay 🥰",
            "Holy shit, thanks a ton for not only addressing common frustrations about some Killers but also finally taking time to buff underused perks. I appreciate that a lot!",
            "40 second cooldown on Oppression? That'll live up to the name",
            "\"HUXLEE UNITS ACROSS THE BOARD, WE ARE ALL PLEASED.\"\n\n-HUX-A7-19",
            "Do we have an ETA on when this goes live?",
            "WOW MY MAINS BEING BUFFED \n\nall i need now is a freddy rework",
            "Man I like the iron Will change but I was already struggling to track survivors in recent times😭",
            "That's some really insane stuff, hyped for the Update.\n\nBut please, now that everyone gets their prestige level boosted through the 8Y event, just PLEASE hide the Survivor prestige from the Killer before the game starts P L E A S E.",
            "Ws across the board. Only concern is the Knight patrol length minimum, but I liked that playstyle more anyway. Hopefully this also comes with AI and placement fixes.\n\nThose Singularity changes got me needing to fan off. Mm mm mm.",
            "Idk how i feel about Knight since i recently declared him my main, guess ill find out later. These seem like really good and well needed changes otherwise, though",
            "iron will is back",
            "Autodidact supremacy!!! Iron Will baby!!!",
            "Bhvr cooked hard this update",
            ">\\[NEW\\] Hooks that a Survivor has been sacrificed on will repair themselves after 60 seconds.  \n>  \n>*Dev note: With hooks remaining permanently broken, it could create some deadzones where it was impossible to get a Survivor to a hook before they could wiggle free. Now when a Survivor is sacrificed on a hook, it will automatically be repaired after 60 seconds.*\n\nI haven't wiggled off in over a year. Really? And none yall are talking about this in any of the comments?",
            "I absolutely hate the hook respawn fix after a sacrifice. It did leave a zone yes but honestly it never feels like the killer is more than a few yards away from a hook at any point so having a spot to try and lead them to when you are running out of places to go was a last ditch. Now thats gone too. Great",
            "ALL 5 HUX MAINS LIKE ME ARE EATING GOOD",
            "Great changes, but please are there any plans at changing Skull Merchant? She’s the only problematic killer left now.",
            "And still no changes to Skull Merchant...",
            "> [NEW] Hooks that a Survivor has been sacrificed on will repair themselves after 60 seconds.\n\n> Dev note: With hooks remaining permanently broken, it could create some deadzones where it was impossible to get a Survivor to a hook before they could wiggle free. Now when a Survivor is sacrificed on a hook, it will automatically be repaired after 60 seconds.\n\nReally not a fan of this. Hook being permanently destroyed on Sacrifice was one of the very few benefit of losing a player in a trial. Deadzone was the only edge we could get by being downed after a player has been sacrified.\n\nIt'll only encourage slugging if someone is downed next to a hooked person dying.\n\nSurvivors were always blamed when they accidentally 3-gened themselves, so why should killers not be given the same drawbacks of poor hook management?",
            "Iron Will, we are so back",
            "Omfg, as someone who plays with resurgence and solidarity combo, this buff is just so nice",
            "IRON WILL WE'RE BACK BABY!!!!! \n======================\n\nDBD ONCE AGAIN FEATURES HIDE AND SEEK!\n_________________",
            "https://preview.redd.it/nj5o8dhenq7d1.jpeg?width=484&format=pjpg&auto=webp&s=bdbb0fc36a0024d1de53fb6e82dbd70ab6ebbf94\n\nFr.",
            "THEY'RE FINALLY LISTENING TO US!!\n\nIt's a great day to be a DBD player. I'm so excited for this game's future. Man I can't wait.",
            "I was just complaining about the 80s cooldown on Dragon's Grip yesterday. So weird that it's getting changed.",
            "Knight changes are going to have to see how they'll play. This no doubt makes him weaker, and longer patrols aren't necessarily a \\*good thing\\* (this means if no successful detection, far longer until you have your power back). This and losing his only anti-loop will make him significantly weaker, but feel healthier to play against. \n\nHe'll always have access to carnifex during chase though so I'm assuming the new method to play him will be as a pallet shredder, with the new counterplay being to greed pallets as long as possible or, now, going back to a 3 gen strat as Oppression is back on the menu. \n\nWe'll definitely have to see how it plays out though.",
            "I do think if guards as a whole aren’t being tinkered with on their pathing and ai this is just dumpstering knight by fixing the frustrating things survivors deal with without fixing any of the frustrating things the knight player deals with. \n\nIf you can’t break anything within 10m (still unsure at this time) you’ll be spending a long time in your power drawing lines. Basically a worse singularity, you’ll be rooted and using your power often but either not near as much payoff as Singularity. Coordinated survivors will have a much easier time denying your power by grabbing flags or good survivors can just deny your power indefinitely by gaming the bad rng of guard pathing. \n\nThis is a step in the right direction of adjusting boring loop denying killers but seems to not fix any of the actual pain points knight players constantly bring up apart from basekit addons. Bugs, bad guard pathing/ai, general jank in how your power works are still going to be there.",
            "Knight is going to be worthless now unless they buff the speed or AI of the guards still. He is a M1 with a slight distraction for one other Survivor with this patch lol Not that I liked playing or playing against him but I would rather not own a useless character lol\n\nGuess we’ll just have to wait and see!",
            "They absolutely gutted the knight.  The only good part of his power was quickly denying loops and instantly breaking pallets.\n\nSo what did they do?  Made it so he can't deny loops or quickly break pallets.",
            "+ SCORGE HOOK GOT INDIRECTLY BUFFED LETS GOOOOOO",
            "https://preview.redd.it/82g6pcvsoq7d1.jpeg?width=323&format=pjpg&auto=webp&s=bb517764c3a485bf8959e556a60557ca529f034d",
            "https://preview.redd.it/hji8nnnh5r7d1.jpeg?width=1169&format=pjpg&auto=webp&s=84438558a57c93b5cd53e054e944eb11b575fa5c\n\nWe are consuming adequate organic matter",
            "We eating a full 5 course meal with this holy.",
            "Reading Soma Family Photo being basekit made me tear up a little I’m ngl",
            "Bout to be way more than 5. Singularity's \"problem\" was never strength, just that it took more effort to play him than any other killer. Removing all the pain points means he's about to be top 5 for people who bother to put the time in",
            "THE JEANS WILL BE OURS!\n\nIn all seriousness I became a singularity mean super recently so this is incredible news for me!",
            "We are so fucking back oh my god.",
            "chat its happening",
            "Knight dies so Singularity can live. I’ll take that trade.",
            "I fell to my knees in a walmart parking lot. My fav killer to play",
            "There will be far more Singularity mains now",
            "RAHHHHH WE EATING THE WHOLE BUFFET WITH THIS IEHSJSHSVSHDHSJSJDBJDSJKAKWJAAHQhqxqlyadlyfshcluaclhaclhcahculachqclhcb albcalhxalyfahc",
            "HUX WINNIN",
            "i think this is my favourite part of it since he's a cool killer but can just struggle a lit bit with some stuff",
            "Mmmm chowing down on that biomass",
            "It wasn't programmed to receive buffs....\n\n(But we're glad it got them!)",
            "6 actually because I am a new one who joined in anniversary (he's my first prestige 6 character)",
            "As an Ash main, I'm struggling to write this through my tears of joy",
            "Fellow jeff main, were eating good this patch 🫡",
            "Iron Will is back baby!",
            "https://preview.redd.it/o1z2myr8vr7d1.jpeg?width=1170&format=pjpg&auto=webp&s=7f770b13fb1416f0780dc90544cc6a886c0ded67",
            "Makes one wonder why they nerfed it in the first place…\n\nSpine chill revert when? That perk was actually used before a pointless nerf as well lol",
            "rebecca is one of the quietest users of current iron will its just her hit sound: https://youtu.be/HHRcwxPvVHQ?si=lisxhW-nHD4-zXRJ",
            "Finally I can play Claire without aliens on Pluto hearing my grunts of pain.",
            "No, I promise I won't tunnel Rebecca's just don't take away the sound",
            "maybe I can finally go back to playing Jill. She is wayyyyyy too loud.",
            "You still can't be exhausted",
            "LETS FUCKING GOOO",
            "My surveillance builds are going to feel so zoomy after this buff to oppression, I'm excited. :O",
            "Same with Dragon's Grip. Maybe it will actually be useful now instead of just a perk you slap onto Perma-T3 Myers when a challenge requires you to get Exposed hits with it.",
            "Does this perk even need a cooldown to begin with? Especially since the kick limit was added?",
            "No other changes matter, autodidact is now the best perk in the game!!!!",
            "It will still be bad. The problem with this perk always was the inconsistensy in the skillchecks. Although it's good news that they ar looking at it.",
            "Still kinda wish it applied to self heals as well, but yes, this is a big improvement!",
            "AUTODIDACT/SOLIDARITY ENJOYERS LINE ME EATING SO GOOD RN",
            "I recently played nothing but Singularity for 2 weeks bc I never liked him but I wanted to learn him \n\nThis update is wild bc it’s seemingly addressing every pain point I had with him",
            "I can finally return to Hux without being fucking sick after 3 games let's gooo",
            "Right? The haste on overclock and the near hook wake-up time are gonna be really satisfying changes to experience.",
            "https://preview.redd.it/doe6zm5uyq7d1.jpeg?width=1125&format=pjpg&auto=webp&s=7b65d503cf170b3629ecff8332dfada454cab893\n\nThey cooked so fucking hard with these changes. Easy aim, aim assist, and reduced wake up times are gonna feel amazing. Not even mentioning all the other huge improvements",
            "Same, I honestly love these changes. Singularity is hard, but so much of it comes from unnecessarily janky parts of using his kit and how it interacts with the environment. Shooting at a survivor and not registering because invisible hitbox or something made me put the killer away. Here's hoping for more consistency in gameplay!",
            "I picked him up because of how unique he seemed and I like mildly mastering every killer’s unique abilities but I put him down because of all the clunkiness. This is addressing almost all the issues I had with him",
            "Now Jeff and Ash mains can play the game without being heard from 30 meters away!!!",
            "YEAH BABY 🥳🎉🎉🎉 HANDS DOWN BEST CHANGE THIS YEAR 💃",
            "Still doesn't work while exhausted 😔 but I'll take this!",
            "Man, I just bought Spirit too... Lmao",
            "It doesn't say the aura reading got extended, only the haste and no blood pools",
            "I’m interested to play a unhooking build now, maybe deliverance, babysitter, we’ll make it and BT, could be pretty nice",
            "The perk is divided in two parts, one for the personal aura reading and another for hiding pools/scratch marks + haste. They are only making 30 seconds for the haste and hiding pools/scratch marks, and not the aura reading.\n\nI could be reading it wrong though.",
            "This is basically new borrowed time, im so excited!",
            "Surprised I had to come this far down to find this comment. Babysitter just became a legit *strong* perk. And I’m very glad to see that, because hopefully that will help make tunneling more realistic for solo queue players to counter.",
            "Pretty big, the drop-guard-at-loop playstyle is a lot harder now and two-tapping a survivor with Guard + Knight may become near impossible. Manual Selection is a huge boon otoh",
            "Mostly QOL and buffs, only nerf is to braindead plopping of guard on tiles to zone out to promote more mindful pathing, overall W, gotta see new addons for full picture tho",
            "I think ya'll not reading it right. You cant use the power in chases anymore to block loops or break stuff. Also, you cant run together with guards or they will deplete.\nIts a straight nerfs, he is an M1 in chases now 😅",
            "Why did they have to gigabuff like 20 non meta perks 😡 (this is exactly what players were begging for)",
            "I formally grant you permission to gripe to your heart's content. Live your truth Mr. Gobble🐔",
            "Both are my favorite killers in theory, but they are too frustrating to play currently. Very excited about these changes.",
            "Except that I feel as though the knight changes will just make him weaker overall",
            "its nerfed if you heal 20% faster with empathetic connection you have less chances to get skill checks before you fully heal the survivor.\n\nyeah end game when you max stacks its just better but the chances you get those lucky skill checks early game to max out tokens is just going to be less now.",
            "I'd love to hear more about this too. My husband is/was in the A/B testing for some lobby UI changes and I have to admit I've been envious.",
            "Honestly yeah, would love hidden prestiges, I get so intimidated as a killer when I load into a high prestige lobby, and as a survivor, if I'm with high prestiges, you just get killers dodging (and I feel self conscious about how trash I am at the game XD)\n\nETA: I'm loving all of these changes though! Even the ones that are bad for me seem like they'll be good for the game :3",
            "Really hoping the prestige one goes through. Even at my highest being 10 I'd still use it just so it's not assumed only high prestiges do it.",
            "See this is exactly what we need. Buffing other perks instead of nerfing strong ones. It's the buffing that creates a new meta and oh boy, oh boy, I will surely run the new Autodidact and Empathetic connection",
            "You're forgetting that he has to be at least 10m away from the pallet to use the Guard.",
            "I'm all for new map variety.",
            ">Also why are we adding more layout variations to maps… devs want all survivors to dedicate a perk slot to Windows of Opportunity\n\nBecause people want f'n variety in the game and it's cool to play on different maps or variations?",
            "I think they’re just changing the placement of all the tiles, the actual pallet/windows are going to be pretty predictable still. As long as you survey where you’re at you should be fine without windows.",
            "[deleted]",
            "It’s not new tiles. It’s from other maps only",
            "Prehaps they can give each guard like a 15 second cooldown so you can't spam break orders",
            "You dont need windows. Just get good",
            "I got 400 hours and I still run that perk, it’s actually god tier man",
            "My only feedback are the two perks solidarity and ressurgance. If the killer has any form of hemorrhage, you get next to no value out of them.",
            "As a Singularity player, I’m having a great time for sure. I took a long ass break because he wasn’t the best nowadays and I was focusing on Alien and Vecna, but I’m definitely going back to play him when this comes out.",
            "Fellow botany connection enjoyer 🫱🏼‍🫲🏽 We are eating good this patch",
            "I stopped using empathic connection because everyone only uses it to bring the killer to me",
            "Correct. \n\nThis and Map of Realm basekit are both excellent changes.",
            "Knight is basically dead now, you just run away whenever he sends out a guard until it loses you, and if he attempts to chase you with it the patrol ends super fast. These changes sound terrible, he's just a timewasting killer rather than a chase killer now.",
            "Yeah I believe this is correct and compensated for with the increased hunt duration. Looks like they want to have guards either used for specific actions (breaking) or long distance engagements.",
            "I’m really hoping so because it’s like you’re basically playing against an AI when knight is the killer",
            "Man I just bought the dark souls looking knight skin. Now it seems like he is gonna feel horrible to play",
            "It'd be fine if they fixed the slew of bugs the knight possesses. However I truly doubt that ever happens.",
            "Nah, just not a free win against 99% of singularities",
            "Nah, Singularity is good but a bit clunky. These are QOL changes, although I wasn't expecting the semi-basekit Soma Photo, even though every Hux main I know has been begging for it. This just makes him easier to use and feel less like you have to play chess to get a hit when Huntress just throws an axe.",
            "Botany applies to yourself as well. It can be paired with Self-care or Sable's healing perk.   \n  \n Empathetic is only Altruistic healing.",
            "Botany applies when healing yourself with perks like Strength in Shadows or Self Care while empathetic connection on works when healing others.",
            "Botany is 50% and can apply to yourself, while empathetic is 30% and applied to only others so no. It's not better than botany knowledge for the average survivor.",
            "No more running to corner far from hooks makes me happy 🥴",
            "I'll admit, at first I was not happy about the hook respawn as a survivor main,  but like it took not even 30 seconds of actually thinking about it to realize how healthy of a move it was so it really doesn't bother me.  It's a good move and makes sense.",
            "Before hook respawn, what mostly happened was that survivors needed to be bleed out for 4 minutes instead of just hooking. This is a good healthly change for the game.",
            "Nah, this is a fair change. Having to be slugged to death because you died in the wrong spot was so annoying.\n\nEmpathic Connection still only works on other survivors. Part of what makes Botany Knowledge great is its synergy with self-healing perks like Self-Care and Strength in Shadows. SiS/BK is actually a massively underrated solo queue combo IMO.",
            "I'm a little surprised about how short that hook respawn is. Feel like it should be increased to at least 120 seconds.",
            "Nah, run that with empathy and botany and you are a healing machine bruv",
            "A potential expose every 40 seconds still isn't overpowered, it just makes it actually usable now instead of every 80 seconds.",
            "Realistically, the only thing that a nerf would entail is going to 20 or 25 again instead of 15. I'd see 20 a lot easier since this change was based around 25 being underused. Ultimately, though, I think autodidact is only marginally more useful than some other perks like botany and will continue to slip under the radar aside from the 12 autodidact users as I feel many people have bad memories of old autodidact and won't be fully willing to use it too soon.",
            "They did say they wanted to standardize survivor sounds so once that us in, IW won't be annabsolute nesseccity!",
            "Variants are done by level designers by reusing the existing tiles, while Swamp would need a complete art pass. One does not cancel out the other.",
            "Yeah but Im not gonna shoot the chef because he didnt give me cake after making me a 5 course meal",
            "This is a major win, give it time",
            "it feels like years since they said they'll rework it in an upcoming update 😭 just remove the ugly ass map atp",
            "I'm assuming it's coming with a new chapter that will use the swamp as it's realm. Hopefully it's castlevania",
            "It will come someday, slow and steady",
            "I have a hunch that the swamps will get a rework when project T (the dead by daylight related shooter) comes out with the story taking place at the backwater swamps.",
            "I actually like the swamp maps. They just need some work on the gens spawns so you don't get those horrible 4 gens.",
            "Devs already cooked this patch, don’t worry about your dessert and finish your dinner while its hot.",
            "Honestly they should get rid of the flag if they aren't gonna buff the movement speed of guards. Then they can treat the guards like m1 killers that can still be looped for a certain duration.",
            "Yeah idk how to feel about these changes, the QOL stuff with add-ons and summon swap is great and long overdue, but now I feel like it'll be even harder to actually get hits with your guards since you can't herd survivors towards a guard if they drop 3x faster.",
            "Not only depleting faster, guards can't be placed point blank at loop and the banner pop earlier.\n\nLooping a knight is now definitely possible and even a good idea if he fail his summon.",
            "And he can't plop down a guard right in front of him at a loop anymore.",
            "Honestly I'm a bit worried the hunt meter depleting that fast will basically make it impossible to hit the banner for the haste & endurance",
            "I hate it\n\nhttps://preview.redd.it/3skgzr3o0r7d1.jpeg?width=1200&format=pjpg&auto=webp&s=8b31d21cd08b18ba5bf99c256a06de22a345b2ab\n\nThe pincer attacks and double tap were my favorite part. It was hilarious.",
            ">if they're seriously going to make it so the player can't even be near a hunt as it's happening. \n\nYeah that's the only change I'm very strongly against. Like what is the point? Why should the knight player get punished for trying to use his power effectively? Weird choice",
            "I'm a survivor main, and I agree. Everyone is focusing on the choosing of guards which yeah cool, but this feels like such a nerf. I agree with like everything you said, I rlly hope they do walk back the timer thing. Him playing off his guards is like his whole point.",
            "its ridiculous and obvious they never play their own game.\n\neverytime they do a rework they fuck over the killer.",
            "With the changes to knight, I can see SM being tweaked later down the line. Looks like they want to move away from the brain dead gameplay of just dropping your power at every loop, which is great.",
            "With the condition of not being exhausted. Did seem like a double whammy overnerf at the time.",
            "I started bringing the 3-gen survivor perk, and I'm never going back",
            "yep the only way to get hits with knight was to zone someone out, with the guard. the guards are soooo stupid they will never be able to hit most survivors. \n\ni'm fine with trying to use him with a 10 meter path but they need to get rid of the 3x timer when you are close to a guard. you will never ever catch anyone. this def will reduce him to a m1 killer with a time wasting idiot power.",
            "Yeah, I understand that the hook breaking after a sacrifice is to prevent the killer from holding a single area, but it's only ever worked against me when survivors are aware they can destroy active hooks and then be in a safe zone. 1 min is fine, though.",
            "I dont think so.\n\nDestroying stuff counted as an \"Order\" and not as a patrol. So he can still instabreak pallets, but he wont be able to push you into a deadzone with his guards anymore.",
            "key word on *Patrol paths*, they can still do orders within 10m\n\nalthough who knows its BHVR I wouldnt put it past them to do something that dumb of restricting that",
            "Yeah but all those times survivors all go to the same corner to go down and use unbreakable/soul guard/flip flop/etc. bc there was only one hook in that whole 25% the map is finally getting helped. It’s definitely healthier, and makes it a slight buff to scourge hooks which is great because there’s really only one good one anyway. And this makes your killer games faster since you don’t have to wait for them to bleed out and same for your survivor matches bc your teammates aren’t being stupid and accomplishing nothing but wasting people’s times running to the same corner.",
            "We are currently at the start of week 2 into the anniversary event! Base +50% bp on both sides, survivors have had an additional +100% on them since the start of the event (event seems killer sided tbh). On top of bringing the event item for +108% bloodpoints per, I walk out of matches sometimes with over 100k bloodpoints",
            "This is the biggest QoL change for killers in this update.",
            "Yeah, its crazy. On one side it will invite more people to actually give him a shot. But as a dedicated Singularity enjoyer i would easily rank him at high A...almost low S tier, but that depends if the QoL changes really work as advertised.\n\nBut soma photo turning into a slightly weaker basekit ability opens up the possibility of so many strong addon and perk combinations \n\nCrew manifest with lethal = 10 second aura reading after slipstreaming someone. Insanely strong value MID chase, just as an example.   \nWe eating good",
            "Always does",
            "> shouldn't banner spawns be adjusted to spawn a little later\n\nthis entirely. all the other buffs are meaningless, and so the Knight is just left with the big nerf of 10m minimum. Sniping people is useless because they can just grab the banner themselves. Great, just wasted 5/10s of their time... what a win as the killer when it took me equal time to do so.\n\nits going to PTB first so surely this will be showcased and brought apparent, and some other things changed to live. The IDEA of the changes are cool, but don't work right now.",
            "so you can't immediately cast your guards while chasing a survivor ? if so, then knight gonna be horrible, guards already slow asf, if survivors just run in a srraight line, they can't get them.",
            "Imma be honest it just sound like they giga nerfed knight, Map of the realm base kit is nice and all, but overall it looks like a nerf lol",
            "I'm sure we'll get it eventually",
            "IW is still disabled while exhausted if I'm interpreting correctly, which makes for an interesting tradeoff of \"do I want to use my Lithe and get to a new tile or is Iron Will giving me a great advantage at this loop already?\"",
            "it's more like a kick a minute since the chances the killer is ready to kick a gen at the end of the cooldown *every time* is pretty slim",
            "That really just means that every 40 or so seconds you'll get a bnp/ds/overcharge skill check, which isn't horrible, but I think the cooldown might need to be a bit longer.",
            "Most likely next Tuesday. There's been rumors of new content being added on the 25th.",
            "I’m very skeptical. He’s definitely gonna be less spamming guards at loops to force survivors to leave. But also they might have just made every single pallet unsafe if he can spam Carnifex whenever he wants",
            "I started playing in 2020 and I miss when you actually had a chance to wiggle off. To wiggle off nowadays you need a sabo teammate and even that doesn't guarantee the wiggle off since hooks pretty close.",
            "I'm guessing changing her is gonna be more difficult because her kit is pretty much just a mess of random stuff mashed together. For Knight the base-kit buffs were kinda obvious and the most frustrating thing to play against him was \"easier\" to change.",
            "They have to address her eventually. \n\nI personally would like them to turn her power into pure info that is very strong and consistent, while also giving some haste to survivors that get a claw trap. None of this current hindered, broken, injured stuff. It just makes her way too oppressive.",
            "We can only hope to make her more interactive. Definitely the right direction with the knight",
            "[deleted]",
            "Only change I wish had also been made would have been adding the Solidarity icon to people's HUD if you're healing them with Solidarity on. Otherwise, all of this is fantastic.",
            "What do you mean finally? Behaviour has been CONSISTENTLY knocking it out of the park for well over a year now. Can we please drop this \"devs bad\" thing?",
            "I've feel like for so long I've been talking about how Opression would actually be a really viable option if they just slashed the CD in half and here we are. This patch is so fucking good.",
            "I can finally play my \"dragon grip/overcharge/oppression/trail of torment\" build so much more consistent and I love it",
            "Dude, I was also talking about Solidarity (just overall Jane's perks) and wondering what it needed to get people to use it more.\n\nBHVR getting access to our private conversations confirmed.",
            "You manifested the change",
            "I wasn't able to tell when it was working or when it was on cool down because both were so long",
            "I hit p100 singularity yesterday and then the patch notes drop a few hours later lmao",
            "My issue as a Knight main is that, while the macro focused playstyle is way more fun, the banner spawns taking only 5 seconds makes it very difficult to apply any pressure with the guards.  \n\nThe changes essentially makes it so Carnifex is usable in chases purely to break pallets, and Jailer is usable to harass survivors on far away gens for 10 seconds before they loop back to the banner. My only question thus becomes, where does the Assassin fit in? 5 second banner spawn means you can't use him to harass survivors, and his increased pressure in a chase due to higher move speed can't be taken advantage of anymore since he'll just despawn after 4 seconds now...\n\nIf they want Knight to be a purely macro focused killer they need to increase the spawn time for banners across the board.",
            "The 10 meter minimun distance, keep that in mind. You won't be breaking that pallet in front of you unless someone predroped it a mile away. That minimum distance is gonna feel clunky as hell i promise",
            "Holy shit I didn't notice that 10m requirement. Yeah, this is unfortunately just a total nuking of a low B-tier killer at best because survivors didn't like him. He'll be low C now if even that.",
            "The *patrol path* has a 10 meter requirement. You arent getting a patrol when you break something. So I see no reason to expect that you lose the ability to smash pallets with carnifex mid-chase.\n\nPersonally I wish they didnt speed up the pallet smashing of a regular guard though. There's a trick I like to shoot for with killer shack and other god pallets where you can set a non-carnifex guard to breaking the pallet and block its use by the survivor.S o if you bamboozle the window or hit a god pallet you can trap a survivor into getting hit. But it requires setting up in the first place.",
            "Honestly that single change with the Knight requiring 10m is my only complaint with this patch.  His Anti-Loop was annoying sure but not oppressively so since smart Survivors that paid attention could spot him setting it up and abandon the loop well before he finished the animation in the first place.  As it is now The Knight basically becomes Trapper during Chase, except Worse cause at least Trapper could push you into a trapped loop.  In the  time it takes Knight to draw out that 10m line Survivors will easily just see him and run a mile away, making his kit only useful for Anti-Gen strats.. and didn't we literally just do several waves of patches trying to heavily discourage that playstyle?\n\nI just don't know, this feels alarmingly bad for what was already a pretty mid and enjoyable Killer. If they really don't want  Knight to Anti-Loop they're better off just reworking him entirely cause that was the only good thing he had left.\n\n  \nEDIT: I will say on an unrelated note that I'm also cautiously worried about the Empathic Connection buff. I was already running a \"Medic\" build with it (Empathy/Empathic Connection/Botany Knowledge/Aftercare) and getting heals off pretty quick.. an additional 20% healing Speed may tip these builds into absurd territory, especially if they add in a Circle of Healing to the mix.",
            "It sounds maybe like you can still break? Considering break is a different input and it specifies Patrick paths? Hopefully that’s the case anyway",
            "Imo Carnifex and Jailer speed could maybe be upped to 107%. They're actually pathetically non-lethal",
            "you can still use carnifex to insta break pallets. You just cant insta-drop a guard on a loop to *patrol*",
            "Bro we're so back \n*",
            "Went a little weak at the knees and had to fan myself like a fancy Southern lady",
            "This alone will make me play him more. If I dont have the addon, it feels so bad and its a purple so not super common :(",
            "I wonder if they'll turn it into a +2% haste for the same 5% when using the add-on",
            "Why the heck would you buy Ash with real money not to hear Bruce Campbell constantly screaming and groaning? I run scene partner permanently on him cause his screams crack me up",
            "As a bill main, i think I could die from how hard they cooked, this meal is too good",
            "When he says \"the breathing is extremely loud and you can clearly hear it from this far away\" and I can't hear a single sound no matter how many times I rewind I start to understand what a disadvantage I'm at by playing on speakers",
            "I don’t believe u",
            "I can finally use Oppression + Surveillance wholesale! On survivor I use an Autodidact + Empathic Connection too. My builds are gonna be eating so good.",
            "With new solidarity, too! It's going to be hot as fuck!",
            "Always was 😎",
            "The healing builds are gonna go crazy",
            "i swear to god the perk lowers ur chances to get a skill check. when im healing a surv basekit i get flooded by skillchecks , but when i bring autodidact i can count the healing skill check on my fingers if i cut 4 of them off each hand",
            "Autodidact works always 60% of the time.",
            "EXACTLY THIS IS AMAZING",
            "He isn’t even bad. But he is just so technical most people want something easier. That’s why good Sing mains are absolute monsters specially programmed to harm the crew.",
            "After playing him for the first time during the event on console the 3 Games Part is too real. The Players aren't even toxic which I appreciate but damn sometimes it's really unsatisfying to play him especially when you try your best but you just can't manage to get the perfect angle or well you are just too slow with turning your cam to get them",
            "I can finally play Steve without having to listen to his atrocious voice acting all game again!\n\n(PLEASE BHVR REACH OUT TO JOE KEERY I’M ON MY KNEES)",
            "I really like this actually because it a) incentivizes people to branch out from exhaustion perks and b) it makes the choice to use an exhaustion perk have more consequences/outcomes",
            "Haven't used exhaustion perks in months 😎",
            "Honestly? This is the perfect setup, it now forces decisions while making Iron Will useful again!",
            "Honestly this is a super fair compromise I feel. Old Iron Will was giga strong, new Iron Will is absolutely useless.",
            "I never run exhaustion perks anyway so I’m thrilled! xD",
            "I think that’s fair tbh",
            "My Steve build will be eating nice. Babysitter, Aftercare, Second Chance, We'll make it.",
            "Imo kinda niche for everyone but high MMR. Maybe I am just lucky but I barely experienced tunneling in matches.",
            "That’s totally fine, the aura read is the far less important part of it (to be buffed).",
            "Curious what they’re gonna do with like half of his addons now, cuz besides map of the realm they’ve also effectively removed all the double up guard options",
            "Honestly? Good on both parts of the dropping guards at loops and two tapping survivors. \n\nBoth playstyles are incredibly boring to play as and against. \n\nIt will definitely make him weaker, but it will get rid of the most brain dead knight playstyles in the game which is good.\n\nTwo tapping will still be a thing, but will require more effort. Which is fine. An effective insta down should require effort.",
            "Biggest nerf is to his pincering.",
            "Wasn’t that pretty much his only play style 😭😭😭",
            "I'm a Knight main, and honestly, this is how I play because it feels like the only way to play him effectively. I don't play toxic or anything, but his guards were always so useful to place wherever I wanted, regardless of the distance. Now that they're changing that ability, I really don't know if I'll keep playing as him. I used to main Hag, but they ruined her with the trap change, and now they're about to do the same to Knight. I'm not sure if I'm ready to adapt to a new gameplay style for him. Being forced to use the 10m range is going to make him a lot weaker, but I guess that's the point.",
            "Yeah, it will depend on how they do his power. Will guards share a cooldown? Will they have separate cooldowns? It could be kind of strong to spam Assassin or Carnifex, but it would feel worse to have them be separate cooldowns.\n\n I'm guessing the \"X guard twice in a row\" addons will be changes to small CD reductions, but who knows.",
            "I'm guessing breaking stuff can still be done point blank because it's not creating a patrol route. Removing Carnifex insta-pallet breaks would be rough.",
            "The fact that you can't work with your guards now and just have to hope the dog shit AI gets them is fucking dreadful\n\nActually brain dead change that just encourages you to leave everything up to BHVR's garbage AI",
            "yeah I know there’s definitely some anti synergy going on- the fourth slot is flexible so I might just slot in Deadline to see how effective it is",
            "My Healing Meta just came online.  \nEmpathic + We'll Make it + Botany",
            "Nah man some perks do need to be nerfed. Ultimate weapon is a great example of a perk that was way too strong on launch. It didn't need to be nerfed into the dirt like they did, but it was way too fucking strong. \n\nSome things are just too strong and need to be brought down to earth otherwise they create an outlier and get way overused since they are so strong.",
            "I'm a big fan of Empathetic Connection (I run it with Autodidact and We'll make it), but I stopped running it because maybe like 1 random teammate out of 10 would actually understand why they see my aura and that they should let me heal them. So I switched it to Empathy... The heal buff is nice but the teammates' lack of game sense still hinder the perk a bit. Guess I'll put it back in the build when I play with friends lol they know how it works",
            "This bit is a bit unclear. Can you still order the guard to break things without having to set a 10m path?",
            "I think you can use your power to break pallets at a closer range, you just can't bring them out to patrol and chase survivors",
            "But is that in play for the orders? I read it as just patrols?",
            "Breaking is not considered a patrol path. So you will still be able to insta break walls, gens and pallets.",
            "Just from first glance I thought maybe they are going to do it like vecna where each guard has its own cooldown + the cooldown you get after you place one guard but idk if that’s the case",
            "That definitely should be looked at!! Reason #1 I never run those perks even if I’m running a meme build.\n\nTo be fair though I have been seeing less sloppy butcher and hemorrhage stuff since the rework",
            "Hope to see you out there. I love going against him but I see the damn Twins more than him.",
            "I cant wait to give him a try again. I've barely played him since last anniversary because he just felt... off.",
            "I am so excited!!!\n\nI just hope they also fix the bugs of being unable to summon a guard too close to a wall, being able to be stunned while drawing a path, and not bring able to give orders to break if you get too close.",
            "Well…. Half of Map is basekit. It’s 2m when the addon is 4m.\n\nKnowing BHVR they are gonna nerf the addon to 2m now too",
            "95% of his power usage is going to be Carnifex to insta-break pallets now.  \nI'm not even upset because I feel like this killer is unsalvageable without a complete rework.",
            "You were getting free wins against them? I've never surived to one, so frustrating to play against",
            "Oh, thanks for the precision",
            "Can they stack? I like to play Survivors with their own perk, plus one other, and I'm think of replacing Bite the Bullet with this, since it would let injured Survivors just come to me if I'm on a priority gen and don't ant to drop it to go to them.",
            "I feel like SiS/BK is so slept on for solo queue. Sure, you have to run to the basement, but on smaller maps that's easy to do and you get a 120% speed self-heal. Killers rarely think to check there either since usually it's removed from critical gens.",
            "Yeah, it does take away some strategies from survivors, but that doesn't have to be a bad thing. Also 60 seconds is good enough to not enable snowballing, overall very healthy change.",
            "Chances are you'd get bled out after two minutes of being in a dead zone",
            "Good to know me and my friend are 2 of the 12 users XD",
            "That was years ago and i dont think we have heard anything on it sense. I wouldn’t hold my breath for that change.",
            "Hold on, let them cook",
            "Let's settle in the middle and make it so hatch spawns on Swamp maps aren't almost exclusively around the edges. They're the only map that happens on and it's always been a little weird.",
            "If hawkins isnt getting removed, nothing will, unless it breaks the game.",
            "Castlevania's not getting a new map unfortunately ://",
            "you wont need to worry about that now because knight will literally never be used now, this is a complete butchering of his kit",
            "Straight up the main appeal (and point) of the killer was working in tandem with your guards, and now you're... not supposed to do that. What is this killer's gameplan now? Hold W and M1?",
            "Honestly the changes don't seem criminal aside from the 8 meters shit.\n\nFingers crossed for the add ons",
            "deja vu is so good im glad people are starting to use it",
            "it's a straight buff. You don't have to think  about where to hook the survivors anymore, and survivors now can't choose  to die near certain hook to create deadzones.",
            "I knew this day would come. They only look at stats. Singularity was fine he is just very hard to play.\nThey didn't give him some slight buffs they giga buffed him too.\n\nGood for us singularity players ,but going against this as survivor is going to suck quite a bit",
            "For sure, all I think he actually needed was the soma base kit and the cams to be fixed a bit but man I agree, I think he’s actually better than spirit when play to his full potential, just very hard to hit that level, I wouldn’t say he is better than nurse or blight but man his power now is gonna be a bit silly",
            "nope, as said, minimum 10 meters path to spawn them which is a horrible idea",
            "It’s not even Map basekit. It’s only half the value. And knowing BHVR they will need the addon to 2m as well, making the change redundant",
            "Turns out sabo buffs were just smoke and mirrors.",
            "They didn't mentioned her for 8.1.0 patch, and the 8.2.0 patch will be a new chapter. New chapters never have major killer rebalances. \n\nIt means that the closest possible patch for any Skull Merchant changes is 8.3.0, which will be released around 6 months from now on. So she will be in her current state for at least 6 months more. Honestly, this is just depressing.",
            "No ya! You're completely right! They've been doing absolutely amazing, I'm so proud of them!\n\nBut they seemed so tone deaf for so long that I think a lot of us needed some *consistent* listening to us for us to finally be feel heard, ya know?\n\nAnd let's be real, despite the absolutely amazing job they've been doing, we still have plenty of room for improvement",
            "Year 8 has been the greatest year in dbds history. Reading these changes my jaw dropped, I was so happy, it feels like they’re buffing unviable/underpowered  perks so they can nerf problematic ones and I’m happy about that. Also theyve just made a full course meal for Singu mains. Can I be upset that my main (the legion) is actively Losing synergy with a lot of perks, and they aren’t doing much about it? sure, but Im not gonna let that change the fact that the creative team has been doing incredible lately, BHVRs decisions are a different story, but the devs Themselves? amazing. it feels weird when a problem arises one day, there’s a patch the next day, and everyone goes ”oh…no fix for the new problem… typical…” and it’s like, guys I’m glad you’re letting them know, I wanna play a good game, but I think they might be working on it. You can’t expect a fix the next day, chances are this patch was being worked on before the problem even existed. They need to come up with a solution, it’s not like, “oh sorry, that deadzone was intentional, we had a totally healthy thing there but we decided at the last moment the new map needed something else”. No, clearly they need to replace it with something different. There’s no, fix bug, button that they can press, they need to actively work on the game, and i’m not saying they haven’t taken too long before, and I’m especially not saying fixes should take forever, but give them more than a day!",
            "Don't bother. BHVR could implement 10 good changes but as soon as they do 1 thing part of the community dislikes, all the previous 10 is like it never happened. Besides, its not like the community suggests good things the majority of the time anyway so the devs are compeltely right for ignoring bad suggestions. \n\nPersonally with all the QOL implemented since 2016 I couldn't care less about balance oriented patches (for better or for worse). The DBD experience outside of win/lose matches has improved so much new players have no idea.",
            "For real. Lol when I came back it’s like a completely diff game. And I mean that in a good way. It’s exciting and engaging to me again. \n\nHow anyone has complaints now? Beyond me. They must be HD2 fans 🤣.",
            "Yup, a couple of the other gen perks would be strong if you didn't have to wait 2-3 gens to use them again. This is going to be huge for perk variety!",
            "Mfw Opression actually becomes an opressive perk:\n\nhttps://i.redd.it/h7zaq4xonr7d1.gif",
            "I'm going to simultaneously love and hate playing against that build lmao",
            "I actually have no clue what Solidarity does, which tells me all I need to know about how badly it needed adjustment.\n\nAlso, if they keep making changes that people are begging for, then they can have all of my chat transcripts. I welcome it.",
            "Now just let them give Chucky's dash scamper an angle adjustment after using it and I'll be happy.",
            "Personally, if these changes go through I don't see myself ever selecting the Assassin on purpose.",
            "I believe its 10 meter distance for *patrol* not to command. \n\nThe wording is pretty nebulous in the dev notes, so unless they clarify we’ll have to wait and swe.",
            "I mean, I get it, I play a few different killers and knight will probably go from gathering dust to just in the trash altogether for me. Killers like knight and SM make me roll my eyes when I play survivor because their optimal playstyle is just exhausting. \n\nI’m annoyed SM got a rework from being a boring yet effective 3 gen killer to a boring yet even more effective than knight as a hold w killer that can still 3 gen. \n\nKnight needs some serious love beyond some bare minimum basekit addons.",
            "https://preview.redd.it/e1yb13cxnq7d1.png?width=640&format=pjpg&auto=webp&s=91e40f6482c66855810cdc5547db707da1fa6168",
            "Shit got me giggling into my pillow and kicking my feet",
            "All of the changes are going to be great for him tbh, definitely gonna lower his skill floor\n\nWords cannot express how excited I am right now",
            "Massively based",
            "You're fine. One of my friend plays with *sound off and spotify on*. I try to weasle my way out of playing with her because she gets grabbed from gens by killers who *shouldn't be able to just do that*. It's rough enough with our massive skill gap, but her constantly getting grabbed or surprised because she didn't hear the killer coming is really trying me lol.",
            "Average solo q survivor",
            "come on I'm a Wesker Main would I lie?",
            "Aha I'm looking forward to the Empathic buff too! I run it all the time as it is, after this it's just going to get *silly*. xD",
            "Im so happy, I was used to run both of these perks! im eating so well",
            "Learning Sing was really hard for me but now that I'm good with him, I can quite easily steam role teams that have no idea what to do. I love every change they're making with him, awesome work",
            "Do not try. To replace. The seal Steve.",
            "Steve is the best voice acting in the game. you tripping",
            "Vecna's crow perk go brrr",
            "Well they're still gonna use exhaustion, they're just gonna use dead hard instead of the others since you use dh when you're about to die anyways, meaning you get full value out iron will until you would have otherwise died.",
            "There are many killer perks and add-ons that cause exhaustion too, not just a survivor bringing an exhaustion perk.",
            "Iron Will was actually surprisingly good and slept on during the Made for This era, it paired together with it really well.",
            "I would love if the hooked person was the one who got the aura reading too, so they can avoid the killer and it would be perfect",
            "Two tapping is literally the most satisfying thing about playing knight. If the survivor lets it happen they've fucked up majorly.",
            "Oh yeah, I play Knight and definitely think these are deserved changes. It also helps that I usually go for snipes instead of anti-loop.\n\nMethinks Knight is going to require a lot more M1 focus but with a better time pushing survivors off objectives and effectively chasing two survivors at once. With Jailer, if my math is right, you can have him chase a survivor for up to 36 seconds!\n\nSurvivors will need to figure out pathing and play for the Banner a lot more than they do right now, which will be good considering the Knight can't chase alongside his guards as much. That 36 seconds Jailer chase will drop to 12 if they are too close.",
            "Yeah, he’s honestly not great at much else lol. He’s gonna be more 3 Gen heavy with these changes",
            "*Hopefully* other buffs will let him move to something else, and if that doesn't pan out future buffs will have to, just hopefully without making him a three gen machine in the process lmao",
            ">Being forced to use the 10m range is going to make him a lot weaker, but I guess that's the point.\n\nMid tier killer falls even further",
            "> It could be kind of strong to spam Assassin or Carnifex\n\nSurvivors today: Oh my gosh, Knight is SO boring! He just drops guards at loops and gets me every time! Yuck, anti-loop killer!\n\nSurvivors tomorrow: Oh my gosh, Knight is SO boring! He just drops Carnifex at every pallet and walks right through! Yuck, anti-loop killer!\n\nKnight is now even more one-dimensional than before. This is the worst outcome for both sides; he will be neither more fun to play as, nor against. The only thing that will change is how people complain.",
            "Yeah, there is no reason they would make you have to go 10m to order guards, just needs an 8m path to drop for patrol.",
            "That’s the one part I don’t understand. I thought the whole purpose was to work with your Guard to chase and down the survivor.",
            "Try Empathy instead of Empathic. Information instead of speed (that nerfs Autodidact).",
            "Pretty sure OP is aware of this and is just commenting on the common trend of defaulting to nerfing rather than buffing, which usually results in less variety.",
            "I've been running empathic and autodidact for ages now and from my experience, if the killer is leaving people injured for whatever reason and they still don't come to me for healing ever (usually to self care), then the match is probably hopeless anyways due to general inexperience on both sides (I'm dogshit at survivor so new players are a common sight).\n\nBut that's not why I run the combo. I run it for that 1/10 game where people are juking the killer or taking hits for each other and they come straight to me for that sweet, sweet 4 second heal.",
            "Ordering guards and dropping them in place are different inputs, as I recall, so my instinct says they just locked the guard drop button until 10m of path have been made, but guard orders will remain their own separate thing.",
            "Nope, the path *has* to be minimum of 10m, afaik.",
            "I mean we hope so please",
            "I've started running Gift of Pain alongside Pain Res lately instead of Pop just because of the anti-healing power and bonus slowdown if they commit to the heal.",
            "You're absolutely right. I really hope so too!\n\nI hope these changes make Knight less frustrating to both play as and against.",
            "Yeah if they don't fix that, using guards to break pallets will be dead. I don't want to have to path a long way back to the pallet because I was 0.5m too close to it.",
            "Map of the Re...\n\nHopefully it's enough to mean I'm not forced to run it every game. They probably will nerf the addon though yeah. I'd rather they made it all basekit and reworked the addon.",
            "One of my friends is too, so that's 3, I'm sure we can find the other 9 somewhere around. But my \"people won't like it still\" mainly comes from DBD content creators being a lil salty seeing it sometimes, causing people in games to be a lil salty seeing it, and then it becomes the SM effect, where people didn't like old skull merchant and even when updated their preconceived notions remain.",
            "totem spawns as well. every game at least 2 spawn around the edges.\n\nLooking for hexes or hatch on swamp is a nightmare.",
            "Agreed I don’t get how people aren’t seeing this. Yes he was boring to play against but he was solid. You will see almost no Knights now unless they are just going to three gen.",
            "Basically. He's going to be extremely easy to loop now. 90% of the time survivors just outrun the guards and you never get a hit. Now he has to go 10 meters to place a guard and the guards chase meter tanks when you're near it?? And the banner spawns faster????? I mean it's pretty much pointless to even use a guard for any means of chasing. You can still break shit and kick gens from a distance I guess.......... At least their detection meter is bigger.",
            "A pass on more of those basekit perks to bring them closer to the level of Deja Vu would go a long way towards making the game much better. It used to be the most garbage perk in the game and now it's incredible",
            "You can't plan much when everyone keeps running to the same corner.",
            "Theres no \"hook deadzone\" theres just \"you will lay here for 4 minutes ,like it or not\"\n\nIt's a 100% healthy and needed change to combat anti-game strategies and unnecessary bleedouts.",
            "and the hooks spawns anyway are always right next to eachother its very rare to get value out of a depleted hook",
            "holy shit xD if this update go thro  knight will be literally the worst killer of the game, finally someone takes freddy's place",
            "Damnn, rip knight honestly.",
            "There's always room for improvement and I think this is a step in the right direction, this is the first major update that didn't nerf anything as far as I can remember",
            "Whenever you heal other survivors, you also get healed, 50% of the amount you heal them for (so if you heal someone from injured to healthy, you'd get half a bar of heal progress. If they had something like resurgence trigger and were already 50% healed and you did the other half, you'd get 25%, etc\n\nNow it's being upped to 70%",
            "Mased?",
            "Does she not use visual heart beat? Quite a few of my friends play survivor with music in our discord but we all use visual heart beat so it’s never a problem. If she’s still getting grabbed with that on I’d say she’s just bad 😆",
            "…Wasn’t Wesker revealed to be an incredibly strong liar and essentially the biggest double agent in gaming history?",
            "Stevegull",
            "Which is great counterplay to a good perk",
            "It’s actually better for the unhooker to have it, and here’s why: the main thing that would cause babysitter to *not* be successful at keeping killer from tunneling, is if the *unhooker* follows the person they just unhooked to heal them and killer follows their tracks. It doesn’t matter that the unhooked person is stealthy if they’re followed by someone who isn’t. It is the unhooker that actually needs the information to know whether they should follow and heal, or just fuck off to avoid taking killer straight back to the unhooked person. Giving the aura read to the unhooked person would make this perk basically worthless in solo queue, which is where it’s most needed.",
            "Basically the only fun way to play the killer, so his already small playerbase is just gonna shrink more",
            "I don't trust them lol.\nBut i really hope you are right",
            "That's exactly how I see it. But already the \"my pallet isn't safe\" complaints are starting, calling it a \"free hit\". Yikes.",
            "Yeah, I never cared for \"drop guard at loop\", so I'm happy because the changes mean less complaining, plus I can drop Map and play around with the other addons.\n\nI was never expecting to be able to select guards, though. I wonder if they \"borrowed\" the Vecna tech to keep separate things on cooldown or if it will just be an overall cooldown.",
            "> Knight less frustrating to both play as\n\nI think this is going to do the opposite, unfortunately.",
            "Is that why I can never find the damn things there? \n\nI need to run Counterforce or Maps more often, I guess.",
            "Losing the ability to force close loops with guards like that is a good thing. But some other aspects of the knights changes are really awful. I guess they wanted to make it nearly impossible to get double-hits when someones being chased by a guard? If they wanted to do that I dont know why survivors dont get a second or two of endurance if hit by a guard while healthy.",
            "FACE MY MACE! MACE TO THE FAAAACE!",
            "I'm not sure, but my suspicion is that she doesn't.",
            "He also keeps a picture of Rebecca in athletic wear at his desk",
            "See you're confused with the non canon movies, Wesker is actually a great guy very trustworthy just ask Jill..",
            "Yep. they are a nightmare to find. Maps help for sure. Small game does as well.",
            "Survivors have enough endurance tools imo. They should've left the guards alone. I'm fine with the change of not being able to just drop a guard at your feet. Because as much as I love knight, as survivor there isnt much you can do when you get chased by a guard and the knight in one small loop. There isn't much counterplay to that. I don't understand why they butchered the chase timers and made the banner spawn faster?????? Even as survivor, as much as I play knight, I understand if the knight isn't chasing me with the guard, and it some instances even when he is chasing me with a guard..... I can do a fucking loopty loop around something and double right back and pick up the banner and get away for free... So now it spawns even faster and the knight gets punished for chasing with his guard to prevent the banner pick up?? Wtf is the point of using your guards for chasing?????? Any survivors that have any understanding of how knight works are going to walk all over him now... It's kinda shitty to be honest.",
            "![gif](giphy|JaNtIG4UnKzD2)",
            "https://i.redd.it/uts2b8escr7d1.gif"
        ]
    },
    "Who needs Deadhard when you have Power Armor": {
        "title": "Who needs Deadhard when you have Power Armor",
        "score": 3780,
        "url": "https://v.redd.it/3hxzy4y1vy7d1",
        "content": "Credit: JDspirit for the map ",
        "num_comments": 150,
        "comments": [
            "As a Nemesis main, I'd run right at it. I wanna wrestle it!",
            "God nothing is funnier than extremely specific bloodpoint awards.",
            "Don't tempt them. Bethesda has been on a roll with Fallout collabs lately. ![img](emote|t5_3cb2g|2213)",
            "Aw Poor Legion.\n\nDo it again.",
            "Meg got absolutely rolled; body block be gone!",
            "Brotherhood of Steel tormenting Legion in another universe. Good, good.",
            "Nemesis and Wesker mains have been waiting for this day for thousands of years. \n\n***They get to reach the next phase of their bossfight.***",
            "Don't worry, guys. It's a little OP right now, but they'll nerf it within the next 4 years to be an Exhaustion perk.",
            "I love that it's sable, and the second Mikaela is in danger she takes off",
            "imagine nemesis getting his hands on some power armor",
            "Dude this makes me want a deathclaw killer.",
            "Patrolling the Entity’s Realm almost makes you wish for a nuclear winter",
            "still cant believe BHVR actually jsut mad3e armor that makes survivors invulnerable, and some survivors are saying its actually balanced just cause you gain broken for 60 seconds when it dies. bhvr please killswitch the power armor. also allowing survivors to break breakable walls was a terrible idea, it opens up infinties. go dim so fucking tired of going against it",
            "I deadass thought that was Sassy the Sasquatch when Susie was kicking the pallet.",
            "Next patch :\n\n[NEW] - The Legion now has access to the Tony Mask",
            "Okay this is cool",
            "How the heck do you get that?!",
            "Definitely gonna be reported for downing Meg Thomas...",
            "Why does that power armor look so smooth though 🤌",
            "The fallout crossover looks promising.",
            "This is the type of content I love to see on here. Fantastic shitpost OP. ",
            "It’s a,most midnight and I had to do a double take there, it looked realistic for a split second and I thought (wait a min, there’s no fallout collab!)",
            "so these are aniamtions right? how do you get the UI to work like that or enough assets to recreate the scenes?",
            "Probably the most satisfying video I've ever seen on here! Thank you OP!",
            "Still really weak against cool killers 😭💀😭\nAnd not meta at all",
            "Believe me, if this was in the game there would still be people still dying as survivor and calling for buffs to the armor lmao",
            "Please delete this before BHVR sees and decides to actually add it",
            "FOR DEMOCRACY!!",
            "Dont worry, the upcoming 40k chapter should be able to counter this",
            "What the fuck. I took a 2 month break.",
            "Proof the sole survivor is coming to DBD",
            "How the hell was this even made?",
            "I want to see a sequel to this where the player pans the camera to slowly reveal Frank Horrigan, a one-sided tussle ensues, and ends with Frank tearing the power armor in half, with the Survivor still inside.\n\nFrank is possibly the best option as a Killer from Fallout; the Fallout fandom wants him back, but he logistically can't be resurrected or replicated, the Entity's Realm would be the best place for his return. I'd make the Power Armor a trial item, but it'll never match up to Frank, just keep him busy and he'd get a specific mori for power armor just like Vecna does for Eye/Hand holders.",
            "And now, the whiny killer mains will complain, might as well start on the hook since they get every little survivor thing nerfed. This aror is already easily counterable, but they refuse to learn",
            "Just make sure they don’t hit below the chest plate",
            "Good video, lol. If they were to ever do a Fallout DLC tho I'd imagine for the survivor it'd just be a Vault Dweller or maybe one of Bethesda's companions from 3, 4, or New Vegas. With the Killer probably being either a Feral Ghoul or a Deathclaw. \n\nWould be pretty awesome if Deathslinger got a Ghoul skin, or even THE Ghoul, Cooper Howard, from the TV Show.",
            "Wtf 😂😂 now if the killer was a deathclaw still be fucked in a power armor",
            "Meg, no!",
            "When did they add fortnite to dbd?",
            "This is just KK and TDSM 🗿",
            "Most accurate example of what it's like to play vs swf on the internet lmao",
            "What tha",
            "God I hope this is real 🤣",
            "Meg getting deleted in the doorway. Wrong time wrong place",
            "\"knocking Susie onto the ground\"",
            "What did the Legion turn into at the end?",
            "Fucking bulldozed the Meg 😂🤣🤣🤣",
            "That's fine, just give killers a fatman.",
            "Lol this is hella funny",
            "i love this. currently my 3 games atm are DbD, Fo4 and F76",
            "u/savevideo",
            "How I wanted my Skull Merchant matches to go😭💀:",
            "tutorial?",
            "That poor Meg LOL",
            "I'm sorry, wtf is goin on? This edit is dope.",
            "does..does meg even deserve that..?nvm i guess she did",
            "Now ram the Legion lol.",
            "Ride's over mutie, time to die",
            "How do people do this??",
            "Man why you gotta do my girl Susie like that ;-;\n\nJokes aside, I love this, lmao. It's amazing",
            "An enclave killer would be the bomb. get frank horrigan now please",
            "Wtf",
            "What the hell",
            "Me seeing a single raider trying to kill me with a lead pipe:",
            "This reminds me of those ads for mobile games that don't exist.",
            "Bethesda will do everything but give us es6",
            "THERES NO WAY , whaaaaaaaat, is this a real thing or is a mod ??",
            "u/savevideo",
            "Wow this is wat Dbd would look like if it was made in last 3 years?",
            "This makes me want a fallout chapter with a deathclaw as the killer",
            "Thats the kind of teabag i like as a killer",
            "Is that a real item???",
            "I would bust if we could fight the killer",
            "deathclaw cosmetic for demodog when?",
            "Should've punched Tryks too",
            "And survivor players would still call the game killer sided",
            "So cheating",
            "Wait im confused. What is this?",
            "I now need a death battle of nemesis vs whatever is the strongest power armor and weaponry, I mean nemi would probably win but It'd still be cool",
            "Would be cool to have Xeno fight with a power loader",
            "Same here dude",
            "\"Save your best friend\" only got better after I realized Meg was only downed for being in the way",
            "Feral Ghoul Reaver Blight when?",
            "Yea I am not liking the Cyberpunk x Fallout collab.\n\n\n2024 sucks.",
            "Eh, their Call of Duty collab was such a waste of potential.",
            "That chapter better have a Mama Murphy survivor and Deathclaw killer",
            "Xbox really be marketing the shit out of that franchise. Gonna be even worse when TES6/TES TV show comes out",
            "How'd you get that emoji",
            "A ghoul survivor would be welcomed.",
            "Ave, true to the entity.",
            "Wesker: Armor? Please Chris, we both know you don't need that.\n\nChris(in power armor): It's a handicap to give you a chance. \\*punches boulder\\*",
            "Nemesis grins wildly and charges in to fight Jill in her new Power Armor. For once, he doesn't need to hold back. In anime-style Japanese (with English subtitles), we can hear Nemesis's thoughts.\n\n\"This feeling! This rush! After all this time...I had forgotten what I real fight is like! My muscles tense! My adrenaline pumps! Show me what my strength is really for!!!\"",
            "You mean \"fixed to work as intended\"",
            "he would be like frank horrigan from fallout 2 minus the ability to speak normally and laser weapons",
            "How about a Ghoul Survivor to go with it?",
            "Part of me would want the killer to be a super mutant but that’s only cause I desperately want an Orc in the game lol Deathclaw would be iconic tho",
            "Her name is Skull Merchant. Lol",
            "So a demogorgon skin",
            "Unironically I think a deathclaw killer would be similar to legion\n\nIts main power would be pretty much legions rush, but it only takes 3 hits to get to the down instead of legions 4, and the animation is goring the survivor.\n\nIf it's a fallout 3/NV deathclaw then it could have a baby deathclaw that it can summon to do tasks for it, similar to knights guards, the difference is instead of a time limit or a flag, or summoning wherever you sent it. It'll come from the closest locker and either do the task you gave, or patrol the area nearby, chasing the first survivor it finds. It'll act kinda like a zombie where it's not much of an actual deterrent, but you can kill it with a pallet or head on. The difference is a flashlight blind or a loud noise like a flashbang (even if it doesn't blind) or failing a skill check will scare it and send it back, which means a viable defense is also blast mine on the generator to prevent it from successfully damaging it. \n\n\nAnything else I should add or would a legion X knight deathclaw be too strong?",
            "Damn, you beat me to it.",
            "KEK",
            "It's a rare item you can get from chests, 1 in a million.",
            "I manually place the icons in video edit",
            "Blender",
            "🧂",
            "CG animation",
            "No, it’s a parody video from a YouTuber called JuliusZ. He posted the [Power Armour in DBD video a few hours ago.](https://youtu.be/7-3wdKotlds?si=aUZBpImdNS8amYrf)",
            "yea",
            "[removed]",
            "Fallout power armor",
            "Me too…",
            "nemi vs frank Horrigan",
            "Would he tho? If both cant use weapons, then Nemi is just a fleshy power armor.",
            "Nemisis slams, dbd nemesis idk maybe would lose",
            "Nemesis VS spacemarines. Bio-weapon VS gene-warrior.",
            "That would actually go hard",
            "Couldn't it be huntress instead. Then he can throw his meat chunks",
            "The.... What?",
            "Omg, I read that as CyberTRUCK x Fallout. At least it doesn't suck that bad, right?",
            "I've seen the skins and... why do they all look so scrawny in the Vaultsuits.",
            "Her perks are named Jet, Psycho, and The Sight",
            "Is that an attempt at...humor?\n\n\nStop wasting time. Return to the Fog at once and bring me the Platinum Toolbox.",
            "The one thing that always surprised me about the Resident Evil franchise, the power scaling.",
            "Que \"You Say Run\" here",
            "How about a ghoul survivor AND a Lucy legendary skin from the show",
            "Wait for real? I thought it was some kind of modding or DBD models in another game.",
            "How do you rip map data from DBD?",
            "Yep that’s me, my Reddit handle is different haha",
            "Its a joke dude. No need to take it so seriously",
            "Me three",
            "\"Time to die, Mutie\"\n\"STARS!\"",
            "Frank would eat Nem alive doe.\n\nIf Nem is Goku that makes Frank Beerus.",
            "Ye but he mutates from damage so it would have to be total cell destruction for him to entirely die I think",
            "You have not played re3 😭",
            "It’s because both take place in 2077 is all",
            "Yes! And they just copied their military style head onto a vault suit. It doesn't look right. And they could've at least given us power armor skin for the juggernaut. It's easily one of the worst CoD collabs",
            "because they wont allow thicc",
            "I think you mean Jet, Also Jet, and Overdose",
            "Perfection",
            "but another match requires our help, ill mark it on your map.",
            "I thought the same, but i saw a comment by OP saying it was made in blender so its not actually in game",
            "No I'm not being serious lol.",
            "You don’t, as far as I am aware of you have to manually build it",
            "Imo it depends on who’s in the armour at that point. I can see some of the Fallout protagonists being able to win- maybe even a couple of the wasteland badasses if they’re willing to wear the armour. But most people would probably lose- they just wouldn’t be able to keep up.",
            "Even if you've rebuilt an entire map, you clearly used a lot of geometry from the game.",
            "Raul could do it",
            "I'm just entirely guessing here but I think they just recorded normal game animations and map separately and then put in the animations of the power armour model on top of it.  I don't think they fully rendered the map and props themselves other than the power armour which was just put on top of what was recorded.  I could be totally wrong here but it just seems like what is most likely.",
            "Everything in this video is in the same 3D scene.\n\n* You can't have that 3rd person camera angle in-game.\n* Legion's red stain is just a spotlight.\n* Everything has multiple shadows. That is because there are multiple light sources above the school. Not how it works in game. \n\nThat's why i am agitated by OP's response - they're telling me you can't rip map data when they clearly did so. The scene entirely consists of exported game geometry. And layout of the scene is pretty accurate to the game. Hats off to OP if it was rebuilt with such accuracy by hand though, but why didn't they just say so."
        ]
    },
    "My, unfortunately, DBD addicted brain sees the game everywhere": {
        "title": "My, unfortunately, DBD addicted brain sees the game everywhere",
        "score": 757,
        "url": "https://v.redd.it/nbnyfddqo08d1",
        "content": "How was my Star Rail looping",
        "num_comments": 37,
        "comments": [
            "Looped his sorry ass (I fuck up those billboards every time they run up to me)",
            "I was playing an Assassin's Creed game the other day and I had to chase someone and tackle them. He looped me. I was like \"This guy plays Dead by Daylight - he's fucking looping me!\"",
            "Hmm...Nemesis's tentacle could definitely reach over that.",
            "IDK if you play Genshin Impact but a few months ago they had an event that was baisically a match of dead by daylight with simplified rules.",
            "We need more funny posts like this",
            "Those shitass billboards deserve being looped for 2 minutes straight while 3 gens get popped",
            "man I gotta play this game 😭",
            "Me in Disney Dreamlight Valley being tunneled by Goofy",
            "Damn..no Pallet? alright WHO DROP THE PALLET?",
            "My first thought was that you were doing the Wesker run 😭 the brainrot is real",
            "I deathslingered that billboard with boothill",
            "The other day I looped a mofo on Ghost of Tsushima and he even fell for a mindgame, swinging in the wall 🤣",
            "I got double a firefly!",
            "Man I love these goofy lil ad boards. I want one lol.",
            "I got killed by a wolf in Tomb Raider after missing a dodge and shouted “I pressed dead hard!”",
            "On DBD I get fucked my sweaty survivors, on HSR I get fucked cause I can't get Firefly. Same game.",
            "When you're having a sibling fight and start looping each other:",
            "Luckily we can fight them back with a robot nuke from the sky or throwing a za warudo bomb unlike dbd smh",
            "Glad to see there's quite a lot of people playing both HSR and DbD",
            "u/SaveVideo",
            "Lmao i played this game for like 3 weeks. Personally not a fan of gachas, but the waifus are great though. Still simp for March 7th.",
            "Yall would love classic black ops 1 zombies",
            "This guy gets it 🤝",
            "that was a nice spin on windtrace\n\nbut yeah their inspiration couldn’t have been any more obvious lol",
            "Nah, I got tired of Genshin a long time ago and moved on to Wuthering Waves",
            "Not going to lie I personally found that one to be extremely frustrating.",
            "Thank you, I wasn’t sure how this would be taken lmfao",
            "Star Rail is actually really fire, I enjoy it a lot",
            "I hope you're ready to play the game with the most yapping ever lol. But it's worth it, the story is pretty good. Gameplay's a lot of fun too.",
            "Elaborate please XD",
            "Chinese companies have already ripped off DBD before given how Identity V exists (yes ik behaviour helped them make it but its still a Chinese knockoff).",
            "they are literally the same.",
            "Was extremely caught off guard by an HSR video on here. I'm definitely getting a kick out of it",
            "Really big fan of this post ngl",
            "I really really dont want to do those quests, how long were they? The one where you got harmony TB was like 10 hours alone I heard? And now they made more quests for Firefly release too? Like god fuck I hate that levels, chests, and Harmony TB eidolons are locked behind 15 hours of yap.",
            "Stick with the knockoff, since that’s the actual term for it (as much as it pains me to say, Identity V is indeed an official BHVR-endorsed knockoff)",
            "I'm sorry thats just false. When you play Wuthering Waves, Genshin just feels terrible to play. Infinite Stamina, all of the movement and super jump techs you can do, running up walls instead of slowly climbing, lootmapper given in early game instead of needing individual compasses per region to show you ONE CHEST, bosses that actually are hard, an important system that makes going around the world after the first time actually valuable etc."
        ]
    },
    "I made a screech cobbler": {
        "title": "I made a screech cobbler",
        "score": 175,
        "url": "https://www.reddit.com/gallery/1dlqr7a",
        "content": "Finger made from marzipan, with eyeballs similar, but dipped in white chocolate. I used food colouring to draw the eyes and finger grime. Despite my culinary skills, it actually tasted good!",
        "num_comments": 22,
        "comments": [
            "Nice! Did it taste good?",
            "That finger is concerningly realistic, and I mean that in the best way possible. You did amazingly with this!",
            "That’s gnarly! I love it",
            "Spooky food is the best food. Keep at it and stay spooky.",
            "This is so sweet! Love this. How was it?",
            "Clown approves",
            "This is amazing!",
            "How quickly were you tunneled out after making it?",
            "Dead by daylight should make a official cookbook",
            "Lost my appetite",
            "This is pretty cool! But I must ask, is it a cobbler?",
            "It did! my cooking ability is questionable at best, so i was pleasantly surprised at how tasty it was :)",
            "thanks!",
            "It was very tasty! It was peach and strawberry",
            "EHEHEHEHEHHH",
            "What were the finger and eyes made from, and was it the only twins main in the game?",
            "They were marzipan and i coated the eyeballs in white chocolate. The grime and pupils were done using food colouring\n\noh and also i found a cheap pack of cupcake eye decorations which i sprinkled in the fruit bit",
            "Nice :) any plans to do the old foods as well?",
            "Just realised I was dumb and didn't read the full post, excuse me for that.",
            "i think i will, i had a lot of fun with this! I know of the terrormisu, but that's the only other one i know of, as I only started playing dbd last month",
            "not at all! i do that embarrassingly often myself xD",
            "I would have to check but I think the rest were just cakes"
        ]
    }
}