{
    "Digital Nomads Monthly Megathread - June 2024": {
        "title": "Digital Nomads Monthly Megathread - June 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/digitalnomad/comments/1d5fd63/digital_nomads_monthly_megathread_june_2024/",
        "content": "Hey r/digitalnomad\n\nThis thread is for chatting about being a DN. This includes the news about travel and visas, where people are living, commonly asked questions, as well as a general free chat throughout the week.\n\nExample topics include:\n\n* Regularly asked questions such as \"What jobs do you do?\" \n* Where you are currently living and where you are heading next\n* Questions about DN visas or Tax clarifications\n* What gear you like to travel with\n* Updates on the COVID-19 situation in different countries\n* Best places to go out to eat or drink wherever you are\n* General questions that you feel do not require an entire thread\n\nPlease be civil and keep things SFW.\n\nSelf promotion of DN related events, blogs, activities, and news is allowed from regular contributors so long as it is related to being a Digital Nomad and not spammy.\n\nIf there is something you'd like to see here please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FDigitalNomad) and let us know.",
        "num_comments": 75,
        "comments": [
            "Still waiting on the requirements for the new DTV (Destination Thailand Visa) which is supposed to be a DN visa in one of the categories… 180 days, multiple entry, 5 years validity, minimum 20 years of age, 500k baht proof of funds, one extension for 180 days. Thats all what we officialy now as of now.",
            "**tldr; looking for a city to live that is “health focused”, has warm weather, good gyms, fresh food**\n\nI’m doing my own head in by overanalysing and overthinking, so Reddit plz help.\n\nI am fully remote, flexible hours and have the finances to go anywhere in the world.\n\nI currently live in Sydney, Australia so the lifestyle is good. But I want to be elsewhere for a while but I’m not looking to find somewhere “better” than home— just different. I’ve done a lot of solo travel, and lived in Thailand for about 6 months. I’m familiar with moving around/visas/remote work/etc.\n\nHelp me figure out which Country and City to try as my first destination in July or August. I’d like to stay a month, and possibly extend as I’m really looking to make somewhere home for a little bit.\n\nCriteria:\n- access to groceries / quality fresh fruits, vegetables, meats\n- good gyms or fitness communities\n- nature / greenery / water (side note: I like to run so the preference would be in areas that allow me to run near/around nature rather than a concrete jungle)\n- warm weather (I can’t handle the cold)\n\n- bonus: as above access to more nature for weekend activities\n- bonus: nice cafes, coffee spots to explore and possibly work from\n- random: would like to learn Spanish but it’s not a super high priority so I can go elsewhere and make that something I commit to later\n- other: I love health / wellness so being able to be near health food stores, spas, saunas and that type of thing would be awesome but not a deal breaker\n- other: preferable not to visit a country right in the middle of their worst weather or tourist peak season\n\nI’m a female in my late 20s, not into partying, and don’t really drink.\n\nI know I’m picky.. thoughts? :]",
            "Hey, what are places to find Digital Nomad jobs for software engineers?",
            "I have no idea why but I'm seeing a lot of Digital Nomads, in Argentina.",
            "I am writing my master's thesis on digital nomads. I have already analyzed a lot of materials and see interesting apspekts of your life. I am looking for people who would like to answer some questions. I am looking for people who have already been nomads for some time as well as those who have just started. I would appreciate your help",
            "I’ve read in several places that UK nationals can work remotely for a UK company for up to 90 days without a visa in both Brazil and Ecuador. And if they want to stay longer, then they need to apply for a digital nomad visa. It seems too good to be true! Has anyone from the UK done this? Have you had any issues with it?",
            "Once the DTV is finalized, Im gonna head back to Thailand. My working hours would be 7pm-1am; not ideal, but not terrible.\n\n  \nCould I get some some recommendations for places to chill in Thailand for 6 months? I’ve recently quit drinking, so Bangkok is a no for me. I previously did this schedule on Koh Phangan and it worked ok. Never made it to the other islands or up north to Chiang Mai.",
            "**Subject: EU Citizen Living in Greece with Foreign Dividends as Main Income - Tax Question**\n\nHi everyone,\n\nI'm a 40M EU citizen currently working remotely for a US company. I bill them through a limited company I set up in a UAE free zone, bringing in roughly €120,000 per year. I'm planning to relocate to Greece and live off dividends paid by my UAE company to minimize taxes.\n\nI understand that as a non-resident for the first 6 months, I'll only pay a 5% tax on my foreign dividends.\n\n**My question:** After 6 months and becoming a Greek tax resident, will these foreign dividends still be taxed at 5%, or will they be considered personal income and taxed under the regular progressive system (up to 44%)?\n\nI know a tax professional could give the most accurate answer, but I was hoping someone on this subreddit might have experience with a similar situation.\n\nThanks in advance!",
            "**US Citizen looking to move to Czechia**\n\nI’m interested in a digital nomad visa to live in Czechia. I haven’t seen any clear answers online. I’ve seen things about trade licenses. \n\nI’m wondering if any US citizens have a digital nomad visa and live in Czechia. \n\nAny tips or steps?",
            "tldr;   Will my work, which is based in Utah, USA have to change anything on their end if I leave the country?\n\nI'm gearing up to finally get out there as a DN, its been a dream of mine since, well, before there was even a term for it heh. But there's something I want to double check. I read the wiki about taxes but didn't see an answer to my specific concern.\n\nSo my work doesn't care if I work from a different country. If when I file my taxes I don't file a Utah state return. Does that change anything for the paperwork on my employers end? like do they have to say that to Utah or federal that I'm working from elsewhere?",
            "I’ll throw another question out there: Does anyone know good rental website (besides booking/agora/airbnb) if I want to stay max out my 3 months in Japan? I’ve seen Oakhouse as an option.",
            "I just created a new platform where DN can easily find and book apartments below 600€/month. In addition you can see a wifi test result before booking in order to avoid bad surprises. I really hope that this is something useful for the community : [Budget Nomad House](https://budgetnomad.house/)",
            "Evening all,\n\nIn the very early stages of looking into this, so apologies for any obvious questions!\n\nQuick low down on my current situation...\n\nLooking to move from the dump that is the UK to Spain with my partner/wife through the Digital Nomad visa!\n\nOwned a successful Ecom Business in the UK (with 2 other people) for the last 10 years (most of goods are actually produced in Spain incidentally - more on that later). All of the work I do on the business is done remotely...most of the time I work from home although I do employ approx 20 people in warehouse/office roles. If we move I will continue to work on the business 100% (not looking for new work in Spain).\n\nI'm wondering whether first I can apply for a Digital Nomad visa given the above?\n\nIf yes, I'd like to know how the whole income tax system works.  \nI currently earn just over £100k per year. Breakdown:\n\n* £12,570 (minimum Salary threshold)\n* Plus approx £90k dividend\n* Plus £60k pension\n* The above has been the same for the last 5 years\n\nI've read something about the \"Beckham Law\" where you can be taxed at a preferential rate of 24% for 5 years. Would I be eligible for that? Or is that only if you move to Spain and work for a company within the country?\n\nAs I mentioned, the majority of the products we sell in the UK are made in Spain. I am involved in the purchasing arm, so I'm in daily contact already with our Spanish partners. I have also considered setting up a similar ecommerce site in Spain doing the same thing, I'm not sure whether that would help my case with the Beckham Law part.\n\nAnyway, that's it for now. Questions/tips/advice highly appreciated!\n\nThanks",
            "new here, so what jobs do you do?  \nare you self employed or employee?",
            "  \n**What do you struggle with the most when you think about getting out of the traditional in-person 9-5 work environment to achieve geographical freedom?**  \n  \nI am currently conducting research on **how people who are unsatisfied and unfulfilled with their 9-5 traditional jobs and looking for a way out of it could be better supported to achieve more freedom** - to travel or to just have more freedom with their time.  \n  \nI would really appreciate some honest opinions on your challenges, fears, desires, and goals regarding working online and achieving geographical freedom.  \n  \nPs: for context, I am a 30-year-old female from Brazil and now I am DN in Canada.  \nI've been a DN for 6 years but in the beginning, I had no idea of how many possibilities there and there was no really good information about it. Or how to choose the best option for my profile/personality.",
            "Seeking tax advice: for starters, I'm a Canadian citizen. However, I have been living in Europe for the past 8ish years going back and forth between studying and working. Recently I have been living in Italy where I just completed a PhD and following that I was offered a temporary, remote contractor position by a UK-based organization. I want to take advantage of the situation and enjoy the digital nomad life in Asia but I have no idea how I would go about paying taxes. I cut ties with Canada long ago and no longer pay taxes there and I will have spent less than 183 days in Italy so technically I wouldn't be considered a tax resident here either. I'm not planning on staying more than half a year in any one country for the foreseeable future, so would I actually need to pay taxes anywhere? Any advice or recommendations for an international tax advisor are greatly appreciated! TIA!",
            "Hi all, happy to join the community :-) I'm planning to transition to a full-time digital nomad lifestyle around the beginning of next year, and I'm looking for some advice on my first base to call home for a month or so. I've done a bunch of research already and it seems like Mexico would be a good choice, especially since I speak some basic Spanish and the weather should be pretty good around January. But does anyone here have recommendations for a good location in Mexico for a first-time DN?\n\nAside from the weather and other obvious considerations like connectivity, some other factors that are important to me are:\n\n* Laid back/easy-going, i.e., not too busy, fast-paced, or crowded\n* Friendly people\n* Close to nature\n* Easy to meet people like locals, travelers, and other DNs\n* Relatively low rent and cost-of-living\n\nIn general, I prefer small towns to big cities, so I probably wouldn't go for somewhere like Mexico City. The two places that seem most promising so far are Oaxaca (city) and Playa del Carmen, but I'm also open to other suggestions. Which of these do you think would be the best fit based on my situation and preferences?",
            "Any **Australians** successfully received a **Digital Nomad Visa for Spain**?? Any resources would be incredibly helpful!",
            "One way for the average person to make the digital nomad lifestyle possible is to work a lot of overtime when you are in the US but then go on three-month vacations at a time.\n\nThe money you make from overtime pays for the months you are on vacation since PTO will run out.",
            "\n\nAnyone looking to teach and hire someone for Digital Marketing?\n\nTo note, I have no experience but I am a dedicated worker and once I start devoting to a project I expect myself to finish it and do it nicely. 25 year old male, from the US. Background in landscaping and outdoor work, good with people. Preferring not to go back to college to learn marketing\n\nLike I said, not much experience but I am willing to learn and work! Anyone out there need someone on their team? I would like to get started on something, learn new skills, and pull in some online cash flow.\n\nAny tips, feedback, advice is great",
            "Hi everyone! I've been thinking a lot lately about how much tech influences our lives as digital nomads. Do you ever feel like it's not just helping us, but actually steering our choices or behaviors? For example, I often find myself picking travel spots based on WiFi quality or digital nomad hubs I find on apps. I've also noticed that my daily routines are shaped by productivity tools and social media.\n\nIf you've had moments like these, I'd love to hear your stories and thoughts. Welcome to discuss together!",
            "![gif](giphy|QZyBvNVaMbIZ9yadec)\n\nWhat it feels like waiting for more details about the DTV",
            "Integrity Legal Thailand made a few videos throwing cold water all over it. We’ll see.",
            "You should try out Valencia, Spain in the fall. It's gorgeous, super walkable, great bike lanes/bike rental system, and my absolute favorite huge park that winds through the whole city - perfect for running. Plenty of gyms, had no issues finding good groceries, warm, great food scene, good cafes, chill energy. Near the beach - I have a friend who plays a ton of beach volleyball there. Out of all my cities I've nomaded in, this is one of the most long term liveable ones I've experienced.",
            "I'm just gearing up for my own adventure so don't have any first hand experience. but you it sounds like you might like costa rica. or you could look at some different \"blue zones\" maybe",
            "Rio de Janeiro",
            "You already know the answer is Bali. Alternatives, Spain/Portugal.",
            "Don't underestimate [Freelancer.com](http://Freelancer.com) I work on there for video editing but there are jobs for everything. I have a girlfriend who is a civil engineer and regularly lands gigs on there! \n\nJust save yourself a headache and put in parameters like minimum \"per project\" cost to avoid spammers.",
            "**Remote Jobs:**\n\n* [HN Monthly Hiring Threads](https://news.ycombinator.com/submitted?id=whoishiring)\n* [Remotive](https://remotive.io)\n* [We Work Remotely](https://weworkremotely.com/)\n* [Remote | OK](https://remoteok.com/)\n* [SkipTheDrive](https://www.skipthedrive.com)\n* [WellFound](https://wellfound.com/)\n* [FlexJobs](https://www.flexjobs.com/)\n\n**Remote Freelance Boards:**\n\n* [Toptal](https://www.toptal.com/)\n* [Braintrust](https://www.usebraintrust.com/join-engineer)\n* [UpWork](https://www.upwork.com/)\n* [Freelancer](https://www.freelancer.com/)",
            "You don't? Milei is basically every Libertarian's wet dream currently. Until the dust settles and everyone sees what a sham his policies are, expect to see more economic migrants moving to Argentina.",
            "I have a feeling that will be a huge DN spot in a few years",
            "Agreed! Did you see the documentary on Netflix, \"Illusions for Sale\"? I was surprised that was based in Cordoba. \n\nI heart Argentina and Uruguay but they are really nothing like the rest of South America. I hope that BsAs doesn't go the way of Mexico City. It's heartbreaking to see digital nomads ruin a local economy.",
            "I am interested, pm me",
            "I'll do it. Send me a message.",
            "It's more like you arrive on a tourist visa then apply for the DN visa if it makes sense. As long as you're not taking a local's job, and not boasting about it, you're fine to work online. A quick question to an AI give you this:\n\nFor detailed information about Ecuador’s Digital Nomad Visa, also known as the “Rentista for Remote Work” visa, you can visit the official Ecuador Travel website (https://ecuador.travel/en/nomad-visa/) provided by the Ministry of Tourism of Ecuador. This page offers comprehensive guidance on the application process, requirements, and benefits of the visa.\n\nKey requirements for the visa include:\n\n\t•\tProof of a foreign income of at least three times Ecuador’s minimum salary (approximately $1,275 per month).\n\n\t•\tA valid passport with at least six months of validity.\n\n\t•\tA clean criminal record.\n\n\t•\tHealth insurance covering your stay in Ecuador.\n\nThe application process involves gathering necessary documents, filling out an online application form through Ecuador’s virtual consulate, and attending an interview with the consulate. The entire process may take two to four months ￼ ￼.",
            "I lived in Chiang Rai in 2011 and it was gorgeous. Mountainous and convenient in terms of everyday needs. Small enough to get around if I remember correctly. Chiang Mai would be nice too.",
            "Imho if you want to stay in Greece, just do it for no more than 180 days per year.   \nThe last thing you want is the Greek tax (private) corporation ΑΑΔΕ, get hold of your finances and access to your bank accounts. \n\nIf you become tax resident of Greece, expect to pay the full amount of tax of all your earnings worldwide. Also Greece has prospective income taxes. eg if you have a car is classed as income and up to an amount is added to your tax return. (called τεκμήριο). If you have enough assets, you might find paying taxes for more than your actual annual income!!!! \n\nIn addition if your income is through a legal entity (limited company etc) you are looking for upfront tax +80% for \"next year earnings\" against that company. In addition to the normal taxes. \n\nThat's why I would advice against becoming tax resident of Greece. Nice country to be 180 days per year, but that's all.",
            "How did you sell your expertise to someone with purchasing power at a US company? ",
            "If you're seeking international tax advice oriented toward HNW DNs, checkout this channel: [https://www.youtube.com/@OffshoreCitizen/videos](https://www.youtube.com/@OffshoreCitizen/videos) \n\nI've been watching his videos for years.  IMO he's competent & trustworthy.",
            "Hiya, the trade license is a requirement only if you're a freelancer. Mind you, this visa is only for IT professionals, whether employed or freelancers.   \nWe have a free, step-by-step guide on the Czech DN Visa on our website (wandra.io) if you want to look into it :)",
            "Companies withhold tax based on the state the employee is in.\n\nYou're asking very different questions in the beginning and end. There likely isn't an answer in the wiki because there's something ambiguous and/or illegal involved.",
            "At the cheaper end of the scale it's mainly Sakura house and Oakhouse that do share hosue and very small 1DKs. Note, Oakhouse have one or two premium apartments like the one in Daikanyama:\n\n[https://www.sakura-house.com/](https://www.sakura-house.com/)  \n[https://www.oakhouse.jp/eng/](https://www.oakhouse.jp/eng/)\n\nOtherwise you can get more premium newer mansions with agents like TM21:\n\n[https://eng.tm21.co.jp/](https://eng.tm21.co.jp/)\n\nYou also have airbnb but rarely see good prices. \n\nLarge scale co-living is also becoming a thing in Japan. Do a google search there are a few companies with modern large buildings that do small rooms with shared kitchens etc. Some even have cocktail bars etc.",
            "You're looking for [https://www.reddit.com/r/digitalnomad/wiki/digital-nomad-jobs](https://www.reddit.com/r/digitalnomad/wiki/digital-nomad-jobs)",
            "Curious, do you stay in Italy over 90 days? Or do you bounce around shorter than that?  How do you handle residency visas?  I know this doesn't answer your questions at all, but I'm trying to figure this all out for myself as well.",
            "This works really well. Especially if you are in healthcare and work contracts.",
            "For sure I can relate to some of that, for me I go to places that arent too rural, ofc they have to have the wifi quality but I look fo rplaces that have a good balance between urban life and the beach because it is not to healthy for us to work 24/7 lol so it's important to be in a place where we could have both good urban life (wifi, city activities, etc) plus the relaxation portion as well. I.e. places like philippines, thailand, etc.",
            "Oh thank you!! This is a great answer. That sounds like exactly what I’m looking for. I love the idea of going in fall — not summer. I definitely want to avoid the masses of crowds in summer in Spain",
            "I'm also preparing for my first DN experience later this year, and have Costa Rica (or maybe Nicaragua) at the top of my list",
            "Ah yes. Good call. I’ll read more about it! Where are you heading for your next adventure?",
            "Have you been before? What really stood out to you there?",
            "As a Brazilian, I would just advise anyone to be careful your your belongings and yourself. Violence is no joke and they can sniff your foreign blood from km away. Brazil is absolutely beautiful just be on guard, protect your things not leave them unattended or easy for pickpockets, and especially don't walk in dangerous neighborhoods or alone at night in empty streets - worse if you are a woman.",
            "Haha damn. I was hoping that wouldn’t be true.\n\nHave you been recently? I’m too deep in reading how Bali (Ubud specifically) is overrun, too crowded, too many Australia’s, busy, bad etc, on reddit. So now I don’t know what to believe.",
            "Yes you freaks, come to portugal cuz clearly we're all good. Specially since all of you mean Portugal -> lisbon and exclusively lisbon, house affordability is certainly perfect for the locals nowadays!",
            "Reminds me of when I was back in the states and sat in on a local board meeting. Folks were complaining about industrial power lines being installed as they ruined their view and decreased their property value. Being an outsider I kept my mouth shut and shook my head.\n\nDespite this being a rural middle of nowhere town, they had a battery factory being built that was going to hire thousands with wages better than anything else in town. A town, that by all means should be dead; was growing. The locals hated it and couldn’t recognize the influx of money/jobs is going to raise their housing prices ten fold. \n\nYes, DNs raise rent in specific neighbors in a handful cities. Yes, an influx of foreigners is going change the culture of said neighborhood. Yes, there are going to be people that don’t integrate.\n\nWhen we look at the big picture, we see countries, en mass, making digital nomad visas. We see cities in wealthy countries paying remote workers to move to them. We have countries that were otherwise dead now having bright futures.\n\nYou can be a digital nomad and still benefit the communities you live in.",
            "It would be ideal but I have children so swapping countries does not work for me, can't pull them from school mid year",
            "ok thanks! the phrasing is different because I'm not sure how to ask the question I have haha. I was in sort of rush writing that as well.   \nSo if my company is still withholding my taxes as though I were a utah resident but then come tax time i was not a Utah. Will that create complications for them or me?   \nI'm trying to figure out if they need to change anything on their end to accommodate me leaving the state.",
            "thanks",
            "Yes, I was in Italy for just over 3 years so I had a residence permit during that time. But my permit expired and I decided to leave instead of renewing it. After speaking to tax advisors, I won't be considered a tax resident in Italy this year since I'll spend less than 183 days in the country plus I'm leaving my apartment and unsubscribing from the Anagrafe (the admin who deals with domicile/residency stuff).",
            "It's not quite as buzzy of a destination as Barcelona or Sevilla, so it seems to dodge the worst of it. I lived in the Rusafa neighborhood in June, and only felt the crowds when I made my way to the center of downtown. But it gets H O T mid summer and I think Sept and Oct would be absolutely gorgeous there.",
            "cool! where are you starting from?",
            "I'm not sure yet, I'll be leaving in November or December so I still have some time to mull things over. Almost certainly some where in Latin America. I want to get good at Spanish and be able to enjoy the sun year around; the short days during winter here really wear me down. Other than that so long as I have somewhere quiet and comfortable to work with reliable internet I'll be good.   \n\n\nThis'll be my first digital nomad adventure so I'm quite excited about it!\n\ngot any tips?",
            "Yes, I went for this past New Year's. I'd say it checks off all your boxes. I remember driving by the beaches after a sunrise hike and people were packing the beaches already running, playing futbol/beach volleyball at 5 am. I'd never seen so many fit people in my life. The beach life definitely motivates people to look good. The city is right in the middle of the jungle so nature is everywhere.",
            "Happy people are outside doing things, not inside on the internet. The few that are here aren't going to waste time pushing back against the \"Bali bad\" stereotype. \n\nI was in Canngu last Aug/Sep and will be returning this year. I never went on an adventure, constantly walked along congested roads, and worked US hours (9pm-4am). I had what many consider a \"horrible time\" but I enjoyed it because it provided when I wanted. An outstanding gym/spa, productive cowork, and professional remote worker community.\n\nIf I were you, I'd look into the niches. For example, one gym will be majority influencers where your follower count matters. Another gym will be spa like with open minded people happy to chat with anyone. This plays out for yoga centers, coworks, meetups, etc. Read recent reviews, look for in depth content, and ask in local groups to get a feel for the \"vibe\".",
            "I'm sorry that I offended you, that wasn't my intention. I read your original comment but now that I see you edited, I can see I bothered you. Again, I apologize. \n\nI strive to be a DN that absolutely benefits any community I am a part of, I feel wholeheartedly that thoughtful people can help a local economy without damaging it. I pray that I am on the right \"team\" as it were. \n\nBut Mexico City is by all measures, one of the sad cases. It has become inhospitable both economically and culturally to the locals. Americans in particular but all the tourists there have done a great injustice to the people and the culture. As DNs it should be a case study in how not to act. I sincerely hope that no other city has that experience but in this case I was talking about how I wish BsAs doesn't go the way Mexico City has. \n\nI don't wish to go down this rabbit hole with you but can I offer that maybe the townspeople in your story were not upset about the economics but something else that came along with the battery factory. You wrote, \"The locals hated it and couldn’t recognize the influx of money/jobs is going to raise their housing prices ten fold.\" Maybe there was something else afoot? I have no idea I wasn't there but lots of factories come into communities and they bring dangerous conditions. A battery factory could cause massive fires (over 1000 fires in Australia this year alone from battery plants, I remember one in the news in Illinois), batteries can cause major chemical sewage - which if unregulated could cause all sorts of horrible health concerns. Especially in a situation where you have a poor area (one that you said would otherwise be dead) getting a big factory means the local government will bend over backwards and maybe let things slide they shouldn't. I wasn't in the meeting, I don't know what plant you are speaking of, but I see your point. Some people can't see the forest for the trees. I don't think Digital Nomads are bad, or else I wouldn't be one for the past 6 years. I was pointing out a very specific case.",
            "Yeah children are issue. But since mine aren't dependant any more, can do it.",
            "Okay awesome, thank you I appreciate that info. Yeah I think I’ll look to go around September, that seems to make the most sense given I really don’t need to be in Europe in the middle of peak tourist season. I’ll check out the Rufasa neighbourhood too. Thank you 🙏🏼",
            "Oh cool, well that’s an exciting adventure to begin!\n\nI think the biggest thing I learnt through digital nomading was that I can’t replace my actual “life” with travel. The same rules (so to speak) still apply as if you were at home. \n\nHave your daily life — routines, habits, the things you want to work on and accomplish, the boring aspects we all want to run away from in our home towns. \n\nThen you have “travel” — the parts of life that get to be moments of excitement, amazement, awe, adventure, novelty, etc. But those moments are simply moments of your daily life, they add to your life, they are not your entire life.\n\nTrying to blend these two together too much and not respecting the need to have both pillars, is where I got a bit confused on my first digital nomad adventure.\n\nI really thought I wouldn’t need structure, or routine and I’d be constantly having cool, exciting experiences, exploring — as I was working. But that wore away very quickly and I was confused why I wasn’t having fun, and instead I was just tired and a bit burnt out.\n\nUntil I started to realise the point of being able to work remotely is to *enable* more travel and adventure— enable more opportunities to experience culture, food, awe that I can’t access as often at home. And in reverse— the travel aspect nurtures my need to have a base of stability, routine. So that I can recharge, focus, debrief, nourish myself and allow travel to be the novelty that it is. \n\nHopefully that makes sense haha. Didn’t mean for this comment to get so long, but wanted to share (probably more as a reminder for myself tbh lol).\n\nMaybe this will not resonate with you, it was just something I had to learn! Have the best time, and stay safe. You’re going to experience so much cool stuff!",
            "Oh awesome! That’s really cool. It actually sounds a bit like Sydney (where I’m from), so certainly sounds like a good option.\n\nAny neighbourhoods/areas that you enjoyed?",
            "It’s tough. Despite us being a lesser demographic than immigrant “expats” and far less than tourists, we’re the ones taking all the hate. \n\nTourist there for a week using English to order tacos? No, that’s a digital nomad not integrating.\n\nExpat with a handle on the real estate market buying up multiple properties? No, that’s a digital nomad raising rent prices.\n\nLocal opens a business to cater to new demand? No, that’s a digital nomad gentrifying the neighborhood.\n\nTourists are too transient and bring too much money. Immigrants are there long term and have influence. Locals are happy for the new business and don’t care to get caught in the cross fire. Digital nomads are therfore the perfect scapegoat.",
            "hmmmmm yeah that makes total sense! I could fall into that trap for sure, especially at first. I'm sure they're be a lot of weird stuff in terms of lifestyle and routine that I had not even considered. But honestly I'm even excited for that part because right now I am sooooooo bored with life haha",
            "I get you haha. You’ll figure it all out as you go. Just remember to have fun and don’t sweat the small stuff haha",
            "Sound advice no matter the circumstance! :)"
        ]
    },
    "Want to make a post? Read this first!": {
        "title": "Want to make a post? Read this first!",
        "score": 75,
        "url": "https://www.reddit.com/r/digitalnomad/comments/vpcdi2/want_to_make_a_post_read_this_first/",
        "content": "#Read the [WIKI](https://www.reddit.com/r/digitalnomad/wiki/index) before posting\n\n9 times out of 10 it will have the answers you are looking for. \n\n## Where is my post?\n\n**Why isn't my post showing up?**\n\nIf you are new to reddit, posting with a new account, or posting with an account that has not been widely used your post will be flagged as it either looks like spam, or is highly likely to be an FAQ covered in the wiki above. We ask that you please spend some time searching through existing posts, reviewing the [wiki](https://www.reddit.com/r/digitalnomad/wiki/) or participating in the sub to build up enough karma to post. You can also post a comment in the Monthly Megathread pinned to the top of the sub. \n\n**I am not new to reddit but post still isn't showing up, why not?**\n\nDue to the volume of posts we get on a few very specific subjects we will often remove or not-approve certain posts on certain topics that have been recently discussed. Here are some common questions that get posted at least 5 times a day:\n\n* [Jobs](https://www.reddit.com/r/digitalnomad/wiki/digital-nomad-jobs) : What job should I get / what do you all do / are there any XYZ nomads / what should I study / how do I get started\n\n* [Health Insurance related questions](https://www.reddit.com/r/digitalnomad/wiki/health)\n\n* [VPNs](https://www.reddit.com/r/digitalnomad/wiki/vpn) : How do I hide my location from my employer \n\n* [FEIE](https://www.reddit.com/r/digitalnomad/wiki/feie) and also [US taxes](https://www.reddit.com/r/digitalnomad/comments/4tck9u/the_ultimate_tax_and_money_guide_for_digital/) \n\n## My post wasn't related to any of those things, why isn't it showing up?\n\n**Does your post violate our rules on self promotion?**\n\nOK, here’s the deal. We understand that for many of us, entrepreneurship and digital nomad are concepts that go hand in hand. Many of us here are working towards booting up great products, and some working towards products that cater directly to the DN community. But, this sub is not a community full of potential people to market to with your posts.\n\nYour product may be great, brilliant, and what every DN needs but never knew it, but if that’s true then it’ll be talked about by the community once it’s known - through other channels. In this sub, we frequently get spam and does the entire community a disservice. Users get annoyed, the community starts to weaken, the moderators get overly aggressive, posts that should be OK end up automatically in the spam filter. These things are not good for anyone.\n\n**Here’s some No No’s:**\n\n* Absolutely no surveys. Surveys will be removed without mercy.\n\n* No requests for interviews, or people to talk to on your blog/book/podcast/etc.\n\n* Anything about illegal activities. You’ll be awarded a ban, and maybe then some.\n\n* No asking for “please review/try my…”. There are many other subs for just that.\n\n* Looking for Work type posts. See the Jobs wiki if you are looking for work\n\n* Job postings. If you have a job that you are trying to hire for please post it in the Weekly Discussion Threads. \n\n* Fund my kickstarter! Nope. Not even for your “friend”.\n\n* Any “opportunity” to become a partner / investor. We can’t tell this from a scam, so it’ll be treated like a scam.\n\n* No direct links to products using an affiliate ID. If you’re caught, you’ll be punished.\n\n* Posting to software/apps/web sites/etc, with \"PM me for access\". If it's not public, it's not welcome.\n\n* Posting software/apps/etc that aren't complete and ready to use. This isn't a user interest collection sub.\n\n\n**Here’s some highly discouraged things:**\n\n* Linking to your youtube channel - We do allow people to share youtube videos if they are relevant and if they come from users who are active in the community and provide valuable content such as trip reports. If you want to share your youtube content please message the mods first for approval. \n\n* Linking to your own blog - We allow you to share your blog as a link in a self post if the primary content of the blog post is also included in the self post and the link is more of a \"Click here to learn more\". \n\n* Top X lists without detailed reviews for each item. We don't hate lists but these posts are rarely useful. Instead of posting a link, post the content of the list in a self post for discussion. \n\n* \"Where should I go\" posts : Check out the Trip Reports for Inspiration. If you still want advice be very specific about what you are looking for, and be sure to include important information like your nationality and budget/ \n\n## LAPTOP PICS / LOCATION PICS\n\nThis gets its own section because it is somewhat controversial. If you are posting a pretty picture of somewhere you are, you MUST fill out either a [trip report](https://www.reddit.com/r/digitalnomad/search?sort=new&restrict_sr=on&q=flair%3ATrip%2BReport) or answer the automod questions about the place. Anyone found dumping pictures without giving in depth information about the location will have their post removed. \n\n\n## Suggestions\n\nIf your post still isn't showing up and you think it should, [message the moderators first](https://www.reddit.com/message/compose?to=%2Fr%2Fdigitalnomad) and be sure to include the word \"peanut\" in the message title so we know you read this.\n\nHave a product you want to inform us about? Buy an ad on reddit to target this (and other) related subs. You’ll get the exposure you want, without the community backlash. It’s good for reddit as a whole too!\n\nWant to talk about a product or service that’s not yours, but you really like? Try linking to a third party, impartial review from a known trusted source. If you wrote it, avoid affiliate links in the article and be sure to mention any relevant disclosures if you are involved with creating the product or marketing it.\n\nWant to link to your site about your experience with something? Great! We encourage that, but focus on the content not how many visitors might join your mailing list. If you truly were writing content for the greater good, put it on medium.com.\n\nInstead of a Top 10 list, which has just a picture and some basic stats: Write a detailed comparison of just two places. With real meaty content, data and stories.\n\nHave a coupon for a product? Actually, that might be good. But unless it’s a high ticket item like a car or laptop, 5% off won’t cut it. The coupon must have more value to the community than for the person that posted it.\n\nThanks!\n\n- The moderation team",
        "num_comments": 1,
        "comments": []
    },
    "Barcelona's radical ban on all AirBnb / short-term rentals. Will this be the norm for other cities to follow?": {
        "title": "Barcelona's radical ban on all AirBnb / short-term rentals. Will this be the norm for other cities to follow?",
        "score": 426,
        "url": "https://www.reddit.com/r/digitalnomad/comments/1dl9ko3/barcelonas_radical_ban_on_all_airbnb_shortterm/",
        "content": "[Screenshot \\/ Article from Forbes](https://preview.redd.it/mf9ukwjbly7d1.png?width=1185&format=png&auto=webp&s=9ddb8f0d9828212c484137471b3aff3c8d040c48)\n\nJun 21, 2024,\n\nThe mayor of Barcelona, Jaume Collboni, has today announced a controversial and drastic move to get rid of all short-term apartment rentals for tourists by 2028.\n\n# Rising living costs in Barcelona\n\nThe boom in short-term rental apartments in Barcelona has caused a significant increase in living costs in the Catalan capital. Many residents are unable to afford an apartment after rents have risen by close to 70% in the past 10 years, while the cost of buying a home has increased by almost 40%, Collboni said at a City Council meeting on 21 June, adding that access to housing has become a driver of inequality, particularly for young people. This has led the local government to take drastic measures to guarantee access to housing in the city, the mayor of Barcelona continued.\n\n\"We cannot permit that the majority of young people who wish to leave home also have to leave Barcelona,\" said Collboni, [according to leading Spanish newspaper El Pais](https://elpais.com/espana/catalunya/2024-06-21/barcelona-eliminara-los-pisos-turisticos-de-la-ciudad-en-cinco-anos.html).\n\nThe issue of overtourism has been a growing concern in Barcelona in recent years.\n\n# Spain, the second most-visited country in the world\n\nSpain is one of the [most-visited countries in the world](https://www.statista.com/statistics/261726/countries-ranked-by-number-of-international-tourist-arrivals/). According to a report published by Statista in June 2024, the country’s visitor numbers are second only to those of France, having received more than 85 million international tourists in 2023, a higher number than the pre-pandemic record of 83 million in 2019. Meanwhile, Catalonia, with its capital city Barcelona, was [the region of Spain that received the most international tourists in 2023](https://www.statista.com/statistics/447801/foreign-tourists-visiting-spain-by-destination-region/).\n\nIn recent years it has become increasingly tricky to obtain permission for short-term apartment rentals in Barcelona. Since 2012, a tourist licence has been required in order to legally rent out an apartment defined as a “Vivienda de Uso Turístico” (home for tourism use) in Barcelona for a duration of fewer than 31 days. Last year, the rules were tightened with licenses being limited to a maximum of ten tourist apartments per 100 inhabitants. In addition, the city put an end to permanent licenses for tourist apartments, instead forcing them to be renewed every five years. The local government has also been redoubling its efforts to hunt down and shutter illegal tourist rentals.\n\nBarcelona's Gothic Quarter gets especially crowded during the busy the summer season.\n\n# The war against illegal tourist apartments\n\nThese measures have resulted in the shutting down of 9,700 illegal tourist rentals since 2016, while almost 3,500 apartments have been converted back into housing for local residents.\n\nToday’s move is the most drastic to date, one that the leading Barcelona-based daily newspaper [La Vanguardia predicts will result in a \"bloody judicial war\"](https://www.lavanguardia.com/local/barcelona/20240621/9749899/barcelona-eliminara-todos-pisos-turisticos.html). If Mayor Collboni gets his way, the City Council will eliminate the 10,101 licensed tourist apartments currently in the city no later than November 2028. His move, which has left the tourism sector stunned, is expected to be opposed by various players, not least the employers’ association of Barcelona's tourist apartments, and will likely result in a drawn-out legal battle.\n\nMeanwhile, vacation rental platform Airbnb, which hosts a considerable number of Barcelona’s short-term rental listings, has not yet made an official [statement.Barcelona](http://statement.Barcelona) Announces Plan To Ban Tourist Rental Apartments By 2028\n\n[Isabelle Kliger](https://www.forbes.com/sites/isabellekliger/)\n\nAnnouncement came early this afternoon via El Pais: [https://elpais.com/espana/catalunya/2024-06-21/barcelona-eliminara-los-pisos-turisticos-de-la-ciudad-en-cinco-anos.html](https://elpais.com/espana/catalunya/2024-06-21/barcelona-eliminara-los-pisos-turisticos-de-la-ciudad-en-cinco-anos.html)",
        "num_comments": 248,
        "comments": [
            "I agree that Barcelona is over touristed.\n\nHowever, I wonder if there is any city in the world that hasn’t experienced a 70% increase in rent and 40% increase in housing prices over the last 10 years?",
            "As far as I know nothing new in Barcelona. And others will definitely follow them.",
            "Can’t blame them, I can compare how Barcelona was 25 years ago and how it is now. Same goes for cities like Amsterdam",
            "I'm from Barcelona, and unfortunately, politicians in Spain and Catalonia love making all kinds of promises. It gets them votes, and no one ever holds them accountable, so why wouldn't they do it?\n\n\nI wish they would implement it, the housing situation is terrible in Barcelona. Almost all of my friends had to leave the city. \n\n\nBut nothing will happen, that's guaranteed. Otherwise, they would have chosen a date before the end of the current mayor's term, not after. By 2028, there will be a new mayor, and there will be as many Airbnbs as there are now, or more.",
            "Homes need to be homes and not playgrounds for people from richer countries.",
            "I really hope so. Specifically Barcelona has been suffering a lot, but it is the duty of our policy makers to ensure a social contract is fulfilled. Unfortunately this generation has been suffering to access reasonable living units. Even as digital nomads we live on a society. The interest of the collectivity needs to be ensured, and part of it relies on securing affordable living expenses. ",
            "Already happened in Vancouver this year. \n\nhttps://vancouver.citynews.ca/2024/05/01/bc-short-term-rental-new-rules/",
            "I hope so",
            "We can only hope, and keep our fingers crossed that ride sharing and food delivery will be next.",
            "I hope so. Short term rentals are horrible for the housing market",
            "Radical ban? There's nothing radical about this, especially when its only gonna happen in 4 years.",
            "Many have tried and many will try but not all cities can or are willing to enforce a ban. ",
            "Hope so. Every country needs to tax the fuck out of it outright ban residences that are 2nd homes, company owned, and short term rentals.",
            "Medellín is starting to close illegal listings. And the majority of paisas want Airbnb banned",
            "I bet he owns a hotel. It's not like Barcelona doesn't want tourists, they want tourists. They just want tourists to stay in hotels. \n\nParis hotels are crying with under 30% bookings this year, even the Olympics isn't helping. While Airbnb's go like hot pockets. Is it reasonable to ask for $200/night for a place to sleep?",
            "I am a long term AirBnb user and am now looking for alternatives.  \n\nHotels are not attractive because I like to be able to cook while I vacation (it’s part of the fun for me) and lounging in a suite is much more enjoyable than a hotel bedroom.\n\nHowever, I feel tremendously guilty for the havoc this innovation has created for rental housing everywhere.  My own kids struggle to find affordable rental apartments in their cities, forcing them into very low quality apartments as high prices or to move to other cities that are more affordable but lack the employment opportunities of big cities.\n\nI see the problem as one of investors (big and small) buying property purely for income potential, rather than renting out their own home.  AirBnb didn’t create that problem, though their platform certainly made it easy to do. \n\nHuman behavior often serves the interests of the self with disregard for others.  And when this runs amok, government needs to set new rules to check it.\n\nSo, I will try not to contribute to the problem anymore. It’s a matter of personal integrity.",
            "I love Airbnbs in general because I feel more like a resident rather than a tourist in a hotel.\n\nThat being said, I do see the damage these short term rentals create in terms of housing and fully support this. I think we’ll still be fine in terms of the nomad life, because in general, we stay more than 31 days.",
            "One can only hope so. Airbnb is absolute cancer and anyone who rents one contributes to locals' increasing hostility towards nomads.",
            "I sure hope so!",
            "Hopefully.",
            "Hopefully",
            "this will likely happen across most of Western Europe. That part of the world is old and is difficult to build new projects amongst the old in many cases. Affordable housing is an issue in the developed world right now. I would expect Portugal, Ireland and Italy to follow this path soon.",
            "Good",
            "Based.",
            "I hope so! Airbnb has ruined the housing market globally. Good riddance",
            "Not as drastic but yes, every major city will try to regulate it, an they should.",
            "I really hope that Lisbon will follow suit. Being a smaller city than Barcelona it has 20.000! short term rentals and most young Portuguese that I know have to leave the city or move into the sketchy suburbs. Decent living is a basic right and should be put on top of people leisure or investment gains",
            "Please… get them the hell out of Toronto. Give me a fleeting chance to buy a stupid condo.",
            "Total bans never *really* work. There has to be a better middle ground, whatever that may be. \n\nI am against a total free for all when it comes to Airbnb, as I’ve seen many locals pushed out. But, a total ban on tourist apartments is also not the way.",
            "Whats considered “short term”? When I travel, I stay at an Airbnb for 2 to 6 weeks at a time.",
            "yes, yes.  all cities should ban Airbnb AND corporate ownership.  everyone should start with 3 times property taxes for Airbnb and corporate ownerships.",
            "I sure hope it becomes the norm. Especially, in the USA and Mexico.",
            "Great News",
            "Hopefully it does become the norm and other cities follow.",
            "Hopefully",
            "I use Airbnb because there are few other options for short term stays that have actual workspaces for two people, but this is neither surprising nor unjustified. If Airbnb refuses to self-regulate, and continues to take a maximalist position against any regulation, the end result will be the most drastic regulations possible eventually having the majority support of populations in cities and towns where Airbnb has had a negative impact.",
            "My sister and BIL own properties at the beach. They just have one as short term for me, friends and the open market because they like having long term housing for the locals. They did just convert one more to medium term like traveling nurses which is great fun for someone. \n\nI usually stay and work longer term in Airbnbs so I think they are a good thing.",
            "Same as in thailand. short term rental is officialy illegal and airbnb is pretty dead besides places with hotel licenses or people illegaly offering.",
            "I hope so",
            "Brother wait, I’m going the with airbnb in september.Do your thing after my trip bro",
            "Well, 2 questions remain unanswered... Why wait until 2028? And what happened to social housing planning... The government has a duty to build affordable decent homes ( you know affordable by low revenue people terms, not by king Juan Carlos ) and why this 4 years slack... I'm all for letting the dust settle but 4 years for someone who is struggling to make end meet seems like a eternity ",
            "If Barcelona is anything like my city the problem is not really the short term rentals but the digital nomads that come live here with a higher buying power than us but most importantly the hundreds of vacant houses in the city.\n\nI'd love to see my government do something about that instead of short term rentals. I understand that monthly prices being controlled can go a bit to the communist route but I don't see any other option.",
            "Most likely it'll just be regulated. Anyone making money off people staying in their places will need a license or something, and be subject to many of the same requirements as small BnBs or mini-hotels. There will still be some supply, but most people will find it too onerous to be effectively having to run a small business with all the paperwork.",
            "They shut down 9,700 illegal tourist rentals, and 3,500 were converted back to housing. \n\nWhat happened to the other 6,200 apartments? Did they evaporate?",
            "Hopefully!",
            "I’m currently traveling in a region that’s seen a 1000% population increase over the last 100 years. Seems to me that a 2-3% temporary increase in housing stock is a drop in the bucket.  And it’s not the tourists who are the problem.\n\nI wonder what the population increase of Barcelona has been over the last 50-100 years, relative to available housing stock? \n\nAt the end of the day this seems like demagoguery and xenophobia. In Europe, it’s always the foreigners who cause the problems.",
            "Yes tourism takes dwellings that would otherwise be available for locals but tourists on average spend four times as much money on food and entertainment.  Next year there will be cries about restaurants and shops having to close down.  This is an emotional decision IMHO and not well thought out.",
            "Just build more housing. Jesus Christ.",
            "2027: Barcelona passes a law banning restaurants and coffee shops from laying off workers who aren’t needed due to a decrease in tourists",
            "Better go now I guess",
            "Scratch Barcelona off my list",
            "Whats the definition of short term? What about 1-2 month rentals?",
            "why not set airbnb on dying provinces only so it gets revived and more businesses will open?\n\nlet the hotels accomodate tourists in popular areas",
            "Good get the fuck put my city but corrupt in that it is the year he is up for reelection",
            "Right move but I wish hotels filled the gap, specifically the need for accommodation with a kitchen.",
            "So they banned hotels then?",
            "Barcelona over touristed for 3 reasons Gaudi, El Raval and Sala Baghdad",
            "I think it's weird that the government tells me how I can rent my property, but apperantly that's an unpopular opinion.",
            "So Barcelona is experiencing TOO much tourism? Not too bad of a problem to have...  \n  \nI don't think more cities will follow unless they seriously think excessive tourism is damaging.\n\nEdit: Removed my statement about long term accommodations stepping in because the truth hurts.",
            "Almost certainly. It won't do anything, but with the current state of European politics there's an urgent need for a scapegoat for the cost of living crisis and Airbnb owners are both widely hated and not politically organized. ",
            "This policy will fail miserably and they will revert it in no time",
            "While Airbnb et al. aren't the sole cause of the global housing crisis, they have certainly contributed to it. So while banning short-term rentals won't solve the problem, it will certainly help.\n\nIn Barcelona's case, freeing up ~10k homes for locals will certainly increase vacancy.",
            "Cities that have actually built housing (e.g., Austin and Minneapolis).",
            "Yeah it's basically everywhere in the west. If it isnt tourists getting charged high for rents, then it's ordinary people also getting charged for rent.\n\nIt's just greed, whether a tourists or a citizen oays rent landlords WILL charge as much as possible for rent and all for an unproductive asset.\n\nIt's horrible everywhere. Reed greed greed",
            "But that’s kinda the point though, this isn’t a Barcelona-specific problem but it still is a massive problem, they’re just one of the few actually doing something about it. \n\nPersonally I think it’s a bit much - I think allowing Colivings and hostels are fine for example, and Airbnb’s where the host is living in the home should also be fine - but honestly I respect it. If more cities did this, maybe I’d be less inclined to move around like I do and actually settle in my original country",
            "It exacerbates both when the % of available housing is artificially reduced in a deliberate and legitimate way. It's happening in every city. Airbnb wasn't as prevalent 15-20 years ago, and nor was it as common for someone to purchase a second property knowing the cost of ownership to themselves personally is only tied to how often they're not renting it out.",
            "Good point. I was raised (and own property in) Brisbane Australia - there are some analogies to be made between Brisbane (host of the 2032 Olympics) and Barcelona (which, as I understand it, leveraged the 1992 Games to become the global destination it is today).\n\nSo like BCN pre-1992, Brisbane is still very much a secondary city for tourism and business in Australia. A house I bought there in 2013 is up 140% in that time, and rents are in a crisis up at least 70% in that time. I’ve looked into AirBNBing that property (always good to know one’s options) and it wouldn’t come close to being better - nowhere near enough demand.\n\nI don’t doubt it’s impacting some tourist hotspots (like central Barcelona) far more than cities that are less popular (like Brisbane); but it’s a long bow to suggest that kind of price growth can be ‘blamed’ on short-term rentals.",
            "...you can't legislate against supply and demand - see the USSR...",
            "Barcelona is following other cities. NYC was the first major city. But many Florida cities have banned short term rentals since before air bnb existed.",
            "Same w/ Bali. Gentrification so extreme/prices are so high that Indonesians can barely afford it",
            "Politicians who make false promises is a global sickness lol",
            "Vancouver is famous for having strict rules and no enforcement. A huge portion of the housing stock is illegal suites as it is. Time will tell if Barcelona is going to enforce these rules",
            "And is the housing crisis lessening as a result?",
            "how did it play out for them",
            "Yes, as Prince Philip once quipped, “Tourism is a form of national prostitution”. \n\n90% of tourists are gormlessly wandering around tacky souvenir shops, and shoddy overpriced tourist restaurants, hoping for an authentic cultural experience, and returning home with a bunch of gaudy photos of the gormless, desecrating the memory of the great Catalan architect.\n\nIt’s such an energy intensive activity too, contributing to the death of this beautiful planet. Not to mention destroying communities worldwide. \n\nQueen Elizabeth may have disapproved of Philips quips, but the man certainly touched a raw nerve. \n\nEdit: digital nomads have no sense of humour.",
            "Do you have a citation for \"the majority of paisas want Airbnb banned\" \n\nFor some reason, in Colombia, a lot of people like to speak for all Colombians.  I might be totally wrong though, of course. I'm not an expert in Colombia.\n\nFor some reason people like to blame the gringos/tourists for the problems in Colombia but they're a minority.",
            "Yeh, the problem with hotels is they are so inflexible and expensive.  I want the space and facilities of an apartment, end of.",
            "Yep. Follow the money and you will always get to the truth of the matter.  Time after time I see Airbnbs become the scapegoat for issues that existed before they were even a thing.  \n\n#1. What's the zoning for the city of Barcelona and l how much of it is allowed to be apartments that are over say five stories in height?\n\n#2.  Does the Mayor actually have ties in anyway to the hotels of the city and if so then there is a clear conflict of interest here that just shouldn't be allowed. \n\n#3. How much of this is the hotels lobbying against Airbnbs in particular instead of multinationals buying up property they don't intend on occupying themselves?",
            "Or hostels",
            "I'm in the same boat. I don't sleep very well, I work remotely and I travel with my girlfriend. for those reasons it's really important to have a separate bedroom and living room/working area. \n\nhotel suites will work for me but it's pretty hard to search for them and also check the reviews for positive internet mentions. it's doable and I do do it but being prohibitively difficult makes it harder for me to find what I'm looking for. \n\nso I fall back on airbnb's. Even though I know it's only a matter of time until some host screws me over and Airbnb does nothing about it. \n\nI support this ban and any future bans. It may reduce my options and if so I'll just roll with the punches as they come. \n\nI'm also going to try and come up with a better methodology for searching for hotel suites with good internet.",
            "> However, I feel tremendously guilty for the havoc this innovation has created for rental housing everywhere.\n\nPlease. The cities themselves created this problem in the first place by actively preventing adequate housing being built. Now they need a scapegoat. It won't help.",
            ">I think we’ll still be fine in terms of the nomad life, because in general, we stay more than 31 days.\n\nWhat do you mean by this? Where are you going to stay for more than 31 days if AirBnB is illegal?",
            "Kinda a regressive attitude. Short term rentals respond to a market demand and are reasonable for people's primary dwelling when they're out of town. What isn't reasonable is when businesses buy up a bunch of real estate to leave vacant all year because they can make a profit by renting it like a hotel for a few months in the summer. The problem is once again corporate greed taking advantage.",
            "So give me a solution, I can’t rent short term but I also can’t rent long term because no Spanish paycheque",
            "What is an alternative you use?",
            "It doesn't matter where demand comes from. No part of the world should be closed off to anyone. This is a supply problem -- \\*not\\* a demand problem.",
            "I think there’s a real difference between a mom-and-pop putting a single flat on AirBNB and like companies who have multiple listings and are essentially running an illegal hotel chain. With the mom-and-pops, at least the money is going to a local (probably)",
            "Have you ever used Airbnb?",
            "Where do nomads stay for 1-3 months at a time then?",
            "> One can only hope so. Airbnb is absolute cancer and anyone who rents one contributes to locals' increasing hostility towards nomads.\n\nWe should all stay in hotels instead, so a developer can demolish local low income housing and build a larger hotel on that land, right?",
            "This may be mostly true, but I resent the idea that it is OUR fault for that. It’s the fault of the governments/cities/countries that allow for it to happen, not ours for simply making the best of the situation we have. \n\nI try to not use Airbnbs, I much prefer coliving, but it’s not always an option. If a government bans it and I therefore can’t do another trip there (as may be the case in Vancouver, for example) I will not be upset, because it is the right thing to do. I wish it were implemented everywhere in truth, because if it was I might be less inclined to choose this lifestyle, one which I enjoy but certainly has flaws!",
            "Lol I basically said the same thing and then some dude claiming to be an expert because he lives in the area tried to argue and now blocked me. All his posts are deleted/removed.",
            "Seems to have worked pretty well in Berlin.",
            "Why?",
            "I’ve asked that question to a couple of realtors and they’ve all said anything under 6 months.",
            "That's short term. \n\n6 months to a year or more is long term. And it really does effect the prices and and rich folks who can afford the astronomical prices.\n\nI said at an AirBNB in London in Bloomsbury that was once all rental flats. A person/company bought the building and turned it all into AirBNBs that cost more a night then the monthly rent was before.",
            "Where?",
            "You can't build anything taller than La Sagrada Família",
            "this is the common reply but, this is not the answer.\n\n when new units are built they're often on the expensive side. they are often bought by either real estate investment funds or they are bought to use as airbnbs. it's like trying to put out a fire by throwing more gasoline on it.",
            "jaja, yes, hopefully this current world wide economic situation will ease",
            "Great.",
            "👍🏽",
            "Byeeeeee!",
            "Glad I didn't intend on going anyway",
            "You are missing the point. It’s become comepltely unaffordable for locals to live in many places in Spain. \n\nValencia suspended all new licenses for tourist rentals for a year recently. Good.",
            "Do we have any case studies on this yet globally? Short term rentals have been heavily regulated or banned in many major cities but it just seems like a drop in the bucket for a solution. The housing crisis seems to be largely unaffected.\n\nThese laws are politically popular but also distract from other issues.",
            "I agree with the measure, but how much will ~10k more homes will realistically help in a city with over one and a half million people?",
            "Airbnb is an easy target \n\nI’m willing to bet some sort of underground/work around will take the place of Airbnb. Or more regulation/business licenses. Sort of in the spirit youth hostels",
            "It won’t make any impact. Tons of people inherited properties and kept them as investments. Others bought investment properties. They all utilized Airbnbs to find short term renters. \n\nAny city that banned “Airbnb” just had those owners route their properties through local rental agencies or post in whatever local groups/forums. All this does is make the process more inconvenient rather than solving any issues.  The prices and management fees almost always remain the same. \n\nIt’s akin to people complaining “immigrants are taking our jobs so ban immigration” rather than attacking the root causes. Dumb.",
            "Why didn't they build those needed units ten years ago?",
            ">they have certainly contributed to it\n\nI still wonder if that's really the case. At least from my perspective staying in them for the last 5 years.\n\nMost are smaller individuals, I avoid corporate owned ones. Most I could rent monthly for the same price as any comparable living situation. Sure, many have to put their shit in storage, but it's still a place to live and it's nice not having to worry about utilities/repairs. \n\n90% or so have just been individuals trying to make some extra money which has been the same for way longer than airbnb's.",
            "Isn't Austin still crazy expensive though?",
            "Barcelone also did.",
            "As much as possible, yes. But the ceiling for how much people can pay is much lower for long-term rental than for holiday short-term rental.",
            "[removed]",
            "Comparing Brisbane and Barcelona is like apples and oranges",
            "Irrelevant: The USSR's problems had nothing to do with economics. The US was waging an economic war against them with the help of its Gulf Allies by manipulating oil prices at a point in which the USSR's state revenue relied too much on oil.\n\nAnd there are regulations here in Spain to manage supply and demand. They work very well. If you enforce a regulation, it works. If you leave it 'to the market', it does what Airbnb does. Or that rent-maximizing SaaS service is doing in the US right now.",
            "They actively are in california.  People don’t want new homes built to prop up their home prices, and now the state is fighting against the cities who don’t want to build enough housing.",
            "Same in las Vegas, nv",
            "The stricter rules just came into effect so the change is still happening.  It’s not instantaneous lmao.  But anecdotally there’s way more rental units on the market, tons of horribly furnished places (old airbnbs) at ridiculous prices sitting and not being rented.  Eventually they’ll accept reality and the prices will drop.  It takes time for the delusion to subside.",
            "It didn’t do anything. Less than 10% of what they estimated returned to the market. A lot of hosts, such as myself, rent second units and don’t want to do long term. So now they stay empty. I’m not going to sell half of my house.\n\n\nAirbnbs are not the one who causes the housing crisis, homeless, cost of living, etc. and banning them only hurts the local economy because you’re banning tourists from spending locally.\n\n\nIn Vancouver shortly after they banned, they had a Taylor Swift concert and everyone complained there were no hotel rooms available normally, let alone with Taylor Swift there. Hotel rooms were going for over $1,500 A NIGHT due to demand.\n\n\nNo, banning STRs didn’t help at all.",
            "Of course! It puts a lot of units back on the market. Vancouver is still one of the most expensive rents in the world, that ain't changing.",
            "A lot more residential housing, a lot less corporations buying up residential units to use as unregulated hotels. How else?",
            "I suspect you think you’re more intelligent than you are",
            "You’d prefer more gorm?",
            "There have been a lot of news articles about it. Just google it in Spanish",
            "Why wouldn't they? In any given city the beneficiaries of Airbnb are a tiny minority, and local renters (adversely affected by Airbnb) are a much bigger group.",
            "I travel a lot in Europe and air bnb is often the same price or even more expensive for the same level of service. It may be different elsewhere, but here it's not as cheap as it was a few years ago.",
            "Isn't it crazy that hotels would rather sit empty than lower their room price? They WILL make money. If anything, I see more hotels turning into \"luxury\" and \"boutique\" hotels, getting investments for renovations,  or just getting sold to poor (rich) bastards who are probably presented with fake numbers.",
            "Hostels have this. Communal kitchen, location outside of tourist corridors, etc",
            "I mean NYC set the precedent here and you know the hotel bosses played a big role.",
            "To be fair, Barcelona doesn't have much spare space lying around to build on, the mountains limit it greatly.",
            "i think he meant the traditional way of renting an apartment?",
            "Short term rentals are pretty terrible for local economies when they’re not regulated properly. Most high tourist areas have increased taxes for hotels and other businesses that primarily serve the tourism market. Most airbnbs avoid those additional taxes in top of anything owned by non local residents or businesses which means non of the revenue earned is benefiting the city or community. A lot of cities in Florida banned short term rentals. If you go and get a permit you can have leases down to 90 days but most have laws that say any lease under 12 months must include the hotel and/tourism taxes.",
            "Not really, the problem is regulation not keeping up with capitalism, if you regulate it and make it only slightly more profitable than long term renting it it wouldn’t be such a problem",
            "Exactly",
            "[deleted]",
            "Not defending the ban, but nobody is closing off Barcelona if it gets banned. Hotels will be available. So will hostels",
            "You think people didn’t travel before AirBnB?  This is tfw hottest of takes.",
            "From Google, the law is 31 days or under is short-term, over that is long-term.\n\n>It is the main home and effective residence of the holder who is given rooms in exchange for financial consideration and for a stay of 31 days or less. The owner must reside and share the home with the guests for the duration of the stay.\n\nhttps://empresa.gencat.cat/ca/treb_ambits_actuacio/turisme/emo_canal_intern/normativa/disposicions-generals/preguntes-frequents-llars-compartides/\n\n>Sí que es permeten i se seguiran permetent els lloguers d’habitacions de més de 31 dies per a ús habitual o de llarga durada com els que es fan habitualment a estudiants o treballadors temporals\n\nhttps://ajuntament.barcelona.cat/premsa/2021/08/04/barcelona-mantindra-la-prohibicio-del-lloguer-dhabitacions-turistiques/\n\n>If you only want to rent your accommodation to the same guest for a period of time of more than 31 consecutive nights, the touristic regulations will not be applicable, and you will not have to submit a self-statement or prior communication or obtain the registration number in the Touristic Registry of Catalonia.\n\nhttps://www.airbnb.com/help/article/2265\n\nThese are older sources, but I don't think they are changing the definition of short vs long-term here, what they are doing is not issuing any more licenses and phasing out all existing licenses for short-term accomodation.",
            "Oh damn, I should do that",
            "In Barcelona",
            "Up. There are hardly any high rises in Barcelona.",
            "Here is an example of a situation in which grammar is vitally important.\n\nYou \\*may not\\* build anything taller than La Sagrada Familia.\n\nHowever, you unequivocally \\*can\\* build many, many things taller than La Sagrada Familia.\n\nThat's the entire problem here.",
            "Lol. All research says the opposite. Or just look at Tokyo FFS.\n\nTypical NIMBY talking points.",
            "The pickpockets will miss you",
            "Ignorance, or in this case stupidity, is bliss, I guess…",
            "Like anywhere in the world",
            "No I understand the point… I’m saying it’s a bit of a privileged problem that doesn’t really exist in many places. So I’m answering the title’s question saying no I don’t think a lot more countries will do this.",
            "Good point. City populations are growing throughout the world, and any vacancies will be consumed by the newcomers. It’s a bigger trend and while regulations on short term rentals are needed, they won’t solve the issue.",
            "The ones I've seen point at supply restriction issues such as over-regulation which makes it difficult to develop new housing as well as excessive taxes and overly strict zoning laws.\n\nThe regions studied were US cities, Spanish, and Portuguese cities, as well as Germanic European cities (my catch-all term for Scandis, NL and DE).\n\nI'll see if I kept these studies downloaded, though they're fairly easy to find by just smashing some keywords into Google.",
            "I don't know if there's been published studies on it yet, but Palm Springs, CA saw pretty significant declines in sale prices after their STR regulations went into place (which are nowhere near as strict as these)",
            "A lot actually. There are probably ~400k dwellings in Barcelona, so freeing up ~10k is adding ~2.5% to the rental supply. A 2.5% increase in rental vacancy is *huge.* I've heard the government here in Canada say that >3% rental vacancy is healthy, resulting in stable rents. In my city right now, it's ~1%. If your rental listing has triple the competition, then you can't afford to jack up the price on a crappy unit. Of course, many landlords would be forced to sell, putting downward pressure on prices, so new owner-occupiers would stand to benefit.\n\nCompare the effort required to enact this policy to building 10k units in an already-developed city. This is a no-brainer that only hurts housing scalpers.\n\nIt's low-hanging fruit. In combination with other policies, it could really help.",
            "Plenty. Lots of people are having to live further out and suffer the cost and time of a lengthy commute. Wages are generally pretty poor here in Spain so 10k homes will definitely make a difference to well over 10k people.",
            "Most of those people already have accomodation, the 10k homes would go to whoever is looking currently, which would be a much smaller number.",
            "This sub is full of angry, priceout of the housing market Canadians, which I can understand... but Airbnb is also banned in Quebec and we have the same issues here.",
            "Thank you for putting this in perspective.\n\nAir BnB is not the predominant reason rent is going up…poor government policies are.",
            "A lot. ",
            "I've been traveling for months on end the last two years (going on the road again next month) and I think hostels are the most sustainable option for mass tourism.\n\nThink about it. It's the old \"cars vs. mass transit\" argument. The tourists aren't going away anytime soon. Better to fit 30-120 of them in a singular locale than for them to take up an apartment building's worth of space.",
            "They already existed, they were turned into airbnbs",
            "Many times in cities the units are built and immediately turned into rentals",
            "build where?",
            "No\n\n[https://www.kut.org/austin/2024-06-13/austin-texas-rent-prices-falling-2024](https://www.kut.org/austin/2024-06-13/austin-texas-rent-prices-falling-2024)\n\n[https://www.austinmonitor.com/stories/2024/02/austin-apartments-boomed-and-rents-went-down-now-some-builders-are-dismantling-the-cranes/](https://www.austinmonitor.com/stories/2024/02/austin-apartments-boomed-and-rents-went-down-now-some-builders-are-dismantling-the-cranes/)",
            "No [https://www.caixabankresearch.com/en/sector-analysis/real-estate/what-big-data-reveal-about-spains-supply-new-housing-and-demographic](https://www.caixabankresearch.com/en/sector-analysis/real-estate/what-big-data-reveal-about-spains-supply-new-housing-and-demographic)",
            "Well, yes, but long term rental is inelastic demand, while short term is elastic.\n\nIf I can't afford to eat out on vacation because my sleeping place costs so much, I'm not going on vacation. But the average person will spend every bit of their money (plus other people's money, if they have access) on rent+food if they can't find it cheaper.\n\nvacation: price goes up, demand goes down.\n\nbasic necessities: price goes up, demand stays the same, unless price exceeds available funds.",
            "I'm literally saying the opposite actually, I acknowledge that my lifestyle (and the businesses that support it) are not necessarily the best for the average person in the cities I visit, or people who are unable or doesn't want to do it. Therefore, I am willing to accept things that benefit society at the expense of me, even if it would significantly inconvenience me. Sounds like you don't feel the same way, that's your right",
            "Remember that I’m comparing Brisbane 2024 with Barcelona 1984, definitely not today.\n\nMy home city has things to learn from the Barcelona experience, especially if it does mean an acceleration of housing / tourist accommodation demand post-Olympics.",
            "Does Vegas allow it with permits and added taxes? Or is it banned altogether? NYC set a limit on the number of permits and then started being really slow to issue them. I never heard much about it after that. Other than a lot of empty apartments got put up for sale and bought up by investors.",
            "I dont know people are still complaining about housing prices in Vancouver so not sure it did anything",
            "We’ve just found the new Sherlock Holmes",
            "I rest my case.",
            "Because of that sweet sweet tourist money!  Tourists don't just spend this on AirBNB... they spend it on food, partying, etc.",
            "100% this, in a lot of popular regions hotels are less expensive then airbnb",
            "Wasn't my experience in Romania or Hungary last month, but yes, definitely my experience in Spain.",
            "Travel with a group and it’s wayyyyy cheaper than any hotels split among 2-3 couples.",
            "Actually no, AirBnBs are more expensive in most cities now except if you have a family of four or more. There are actually basic hotels like Motel One and Premier Inn in good locations that are cheaper than any Airbnbs.\n\nPlus I don't have to clean my room, make my bed or clean up before I leave. I can see if a large family or group of friends is going to stay in a place for a week or so. But two people can stay cheaper at a hotel and I love having the bed made and the room and bathroom clean when I come back from sightseeing.",
            "Traditional way of renting to me means 6-12 month minimum lease unfurnished, usually not available to tourosts, I don't see how that is compatible with a nomadic lifestyle. I feel like OP knows something that I don't (I've never been to Spain).",
            "So you’re renting an apartment for only 30 days that is also furnished? Is it an Airbnb?",
            "100% And it encourages the hospitality industry to buy up residential real estate. Not great for the locals.",
            "Most of Airbnb in Bcn are from families that hold that apartment for years.",
            "Shouldn't the goal be to make it slightly *less* profitable than long term renting?",
            "No",
            "Ah gotcha!",
            "Have you been? It's full.",
            "Does the bedrock support high rises without displacement?",
            "Genuine question, not trying to be argumentative: do you have citations for \"all research\"?",
            "Ignorance that everywhere else isn’t experiencing unaffordable housing too lol",
            "Yup",
            ">I’m saying it’s a bit of a privileged problem that doesn’t really exist in many places\n\nIts a problem that exists anywhere there is a significant amount of tourism. And that amount is proportional to the size of the location. Big cities like Barcelona can handle millions of tourists every year and then hit the breaking point (like it just did). Small fishing towns across the Mediterranean hit that breaking point in a single year when they become a tourist hotspot without even millions coming in.\n\nBasically its a matter of the locals' rights vs the foreigners'. And the former trumps the latter.\n\n>But the economy...\n\nTourism doesn't do sh\\*t for the average local. Various small shops and local businesses that cater to tourists make a lot of money. But they don't hire hundreds of locals and create jobs. Even without plagues like Airbnb local housing gets hit as more hotels are built and buildings are turned to hotels by those who profit from tourism. All the local shops and services up their prices. The end result always ends up being the actual locals getting priced out of not only housing but even the actual cost of living all the way to groceries and daily items they need. That's why they hate tourism and tourists, and they are right.",
            "Palm Springs is a resort / vacation / retirement town in the middle of the desert with little permanent population. To the extent airbnbs hit the market they just become other vacation homes empty half the year or places for retirees moving from the cities. Not really a great example.",
            "Yes, it's definitely a good move.\n I hope this is followed with some Policy around hotels, either through a cap on price hiking or a plan to create more hotels to accommodate the displacement, at the same time you want to still attract tourists",
            "It'll be nice in the first year when there are more vacancies. Then, they'll be rented to new tenants, and if they don't keep building new housing, it'll quickly be back to low vacancy, except without all the tourism fueling the economy.",
            "Barcelona isn't exactly NIMBY land. It is one of the most densely populated cities in the developed world. \n\nGranted, I am not super familiar with Barcelona housing policies, but I really doubt it has the same history of blocking housing that North American cities have.",
            "Yes, poor government policies like allowing airBNB to fuck up local housing markets. ",
            "Oh ok I don't agree with that at all",
            "A lot of foreigners, especially Americans, seem to think that there is unlimited building space in the Mediterranean countries just like how there is in the US in most of the states. They arent aware that merely Texas is bigger than the **entire Western Europe** or at least half of it **-** and with a lot of wide open spaces compared to the mountainous areas that occupy half of Western Europe. And also totally clueless about how the Mediterranean countries are basically a few coastal areas and deltas that rivers created, with the rest being hills and mountains that are very difficult to build on.",
            "Yes. Barcelona not only builds housing but also it allocates 30% of it to social housing.\n\n[https://en.ara.cat/business/developers-build-150-social-flats-year-in-barcelona-thanks-to-new-regulations\\_1\\_3999726.html](https://en.ara.cat/business/developers-build-150-social-flats-year-in-barcelona-thanks-to-new-regulations_1_3999726.html)",
            "Unless you’re visiting towns of 50 villagers or landing in cities and buying up blocks of real estate- then with absolute certainty I can assure you that you are not making an impact on the local economies or to the average person. \n\nTraveling existed prior to digital nomadism. Vacation rentals existed before airbnbs. These moronic laws to ban marketplaces don’t change that. If cities like Barcelona remove every single vacation rental and give it to a deserving local, all that will do is drive up demand for hotels. Owners of apartment buildings may not sell it to a hotel for $1M, will they for $10M/$20M? Yeah they will in a heartbeat irrelevant of what happens to their fellow locals. \n\nSo now rather than someone local renting out their second property, it will be Hilton corp channeling profits back home and taking up the exact same amount of real estate bringing us back to square one.",
            "Huge immigration is fuelling insane property increases",
            "Nobody cares anymore about olympics...with so many sport events world wide there will be no impact anymore or mid to long term increas. Australia is too far a way while barcelona is an hour flight from many other european countries and has therefore had a huge increase of tourism inflow. There was a whole concept of tourism promotio ,infrastructure, which increased quality of life...things that with nowadays event don t hapoen anymore and the sport venues are the most important things...if any...",
            "I think it might be different. Barcelona has 400 million people at 3hours (or less) flight. \nHow I miss the pre-olimpics city. I mean...Sydney is a world-class city, but being \"so far\" avoided it to become Paris or Barcelona. Lucky you. ",
            "NYC is a total ban. You can apply for a use variance but you’ll never get it. \n\nThey solved affordability issues in NYC.",
            "Ignorance to the situation and myopic attention to single variables is the whim of the mind controlled.",
            "It's hard enough to find someone to go on a trip, so to go with a whole group seems very complicated to me haha. But it sure is cheaper!",
            "> Plus I don't have to clean my room, make my bed or clean up before I leave.\n\nDon't have to do that on Airbnb either, that's what the cleaning fee is for. If the host is asking you to do that, despite it not being specified in the listing, then just don't lol.",
            "No, it’s more hassle and higher risk, unless they really don’t give a shit about tourism of course, but then just ban them completely",
            "No city is ever full. Have you ever been to Tokyo or Hong Kong?",
            "You \\*really\\* shouldn't need research to understand basic econ 101. People understand supply and demand when it comes to cars and Playstations, but suddenly when it comes to housing all logic and rationality goes out the fucking window. This is \\*literally\\* econ 101.\n\nThat said, here are three articles that directly address the bullshit NIMBY nonsense talking points r/branshifter is espousing. \n\n[https://www.noahpinion.blog/p/market-rate-housing-will-make-your](https://www.noahpinion.blog/p/market-rate-housing-will-make-your)\n\n[https://www.vox.com/22524829/wall-street-housing-market-blackrock-bubble](https://www.vox.com/22524829/wall-street-housing-market-blackrock-bubble)\n\n[https://www.theatlantic.com/ideas/archive/2022/11/us-housing-supply-shortage-crisis-2022/672240/](https://www.theatlantic.com/ideas/archive/2022/11/us-housing-supply-shortage-crisis-2022/672240/)",
            "This is a world wide problem, not unique to Spain. Just go look at the housing issues in the US.",
            "Major businesses that are hiring hundreds of people aren't sticking their factories or offices in the middle of tourist cities, so your point about taking housing from people who work in the area is wrong. It's benefitting the tourist economy.\n\nHere's some reading for you: [https://aicasia.org/dispelling-the-myth-between-short-term-rentals-and-the-housing-crisis/](https://aicasia.org/dispelling-the-myth-between-short-term-rentals-and-the-housing-crisis/)",
            "I'm back in SF after about a decade. I was living in Denver and while that's far from perfect it's like SF hasn't built a single house since I left.\n\nStill the same housing problems.  Arguably it's much worse now!",
            "Check your geography facts. Texas is slightly bigger than the Iberian Peninsula.",
            "The Spanish live on top of each other",
            "They ain't building shit in America either.",
            ">They arent aware that merely Texas is bigger than the entire Western Europe. \n\nI mean it isn't actually bigger. Texas is a little under 700,000 sq km. There's differing definitions of Western Europe but they always include France which is about 550,000 sq km. Add in whatever other countries you include in Western Europe and it'll be larger than Texas. But it's still suprising it's in the same general balllark!",
            "Immigration is one current factor in the Brisbane housing market, absolutely. As with pointing at Airbnb, wicked problems can’t be reduced to single factors.",
            "What? Housing prices are near record highs in NYC.",
            "k",
            "Where people live in 15 square meter apartments? In terms of higher buildings you need specific bedrock for that.",
            "So, first, I feel like anything with .blog doesn't generally strike me as a citation for \"all research,\" but at least the author does go into a number of studies/papers/reviews later on.  I can't say much about whether any of those are peer-reviewed or what even that much means practically speaking (I know what the concept is, just not how one can actually track it or whatever).\n\nI think the bigger issue is the perspective dissonance.  People like braneshifter (and myself, for that matter), are often coming from a stance of lower income/affordable housing options for the working class, who don't have the bargaining power Noah talks about in the middle of the article (hey landlord, I'm thinking about going over there), as well as looking at ways to address the homelessness issues.  I don't want to get into those issues cuz fuck if I know what to do with those either.\n\nBut the issue for working class people is that the middle class perspective of allowing the free market to nudge things over time just...doesn't look effective.  What we see are our rents going up and new developments rising that are so laughably far outside our means, while we can't find units in our price range because our income isn't moving anywhere.\n\nBut.  \nI *think* - and am not sure - that the \"logic and rationality\" changing around the housing market is that it's a slightly different animal.  Noah talks about cars and people owning civics, and then a lambo coming in.  But that analogy fails in housing market where instead of everyone owning a civic, you have a couple companies who are buying cars and then charging other people to rent them and drive them, costing them more than if they actually owned the car themselves.  This means that the civics that aren't owned can actually be sold for *higher*, right?  Like, let's say the civic costs 26k; paid off over 26 months at 1k per month.  Stupid numbers but simple.  Now, some rich person has bought 30% of the civics in the city and is charging people 1100/month to drive them.  No one actually wants to rent the civics, but if they can't afford to buy it, they're kinda stuck.  So we look at the civics that aren't owned.  Anyone selling a civic knows that the standard is 1100/month, so they can get a good market share by selling them for 1050/month to those who can afford them.\n\nHousing doesn't apply supply and demand the same way because it's a case where someone else can *own* the widget while the person *using* it still does.  You can't have that with a Playstation, by and large; leasing cars is a somewhat niche approach, I think, though I could be wrong on that (and a lot of things really).\n\nSo, let's move forward to the lambos.  Ignoring that, in all likelihood, the person who owns 30% of the civics probably owns 8% of the Lambos or something as well.  The person who owns some of the civics can see that Lambos are going for, say, 2200/month.  Clearly, there are people driving civics who could afford lambos but aren't doing so.  So, even though they're renting the civics for 1100, they know that *at least some* civics could be rented for 1200.  or 1400.  And when someone stops renting one of their civics to get a lambo, they raise the price.\n\nI was renting an apartment a few years ago.  The rent kept moving up because it was admittedly fairly low to begin with, but I think there are limits on how much you can raise rent in a given period?  Idk.  But when I moved out because I couldn't afford that place anymore, the place then went *way* up.  That's not the market adjusting things lower because there are market-rate developments coming in (and there are - like I said before, there's always new developments coming up in my town that are >400k).\n\nIf someone is upgrading from 1500 to 2100, that's leaving a 1500 open.  Assuming that 1500 actually stays at 1500, the point Noah is making/referencing/citing is that someone will leave a 1200 to go to the 1500, leaving a 1200 for someone who previously didn't have it.  \n\nAnd my question is...why not start with the 1200s?  And if the only reason is that no one would build it because it isn't profitable, then you start falling into the basic difference in thought between \"the big-scale society > the individual\" and the converse.  I personally don't believe that profit motive is a healthy way to address many things in society, even as I can acknowledge that greater \"market freedom\" can often raise standard of living across the board.  It just doesn't look to me like that approach is working too well for the growing homelessness problem and the declining ability of many people to even hope to afford their own home someday.  Econ 101 assumes a certain equivalence of purchasing power and information, as well as a simplicity of producer and consumer.  None of that's true in Housing.",
            "Yes, that's literally what I just said.   \n  \nHousing is unaffordable mostly because inflation is out of control and interest rates are much higher, which makes house payments unaffordable. Airbnb is a very *small* part of the pressure being put on affordable housing.",
            ">Major businesses that are hiring hundreds of people aren't sticking their factories or offices in the middle of tourist cities\n\nI grew up in a major tourist spot and also worked in tourism, and there is abso-fking-lutely no case of any major business that hires hundreds of people outside the city somewhere as tourism picks up in a locale. The processes and organization structures of even the tourism agencies are greatly optimized, and an increase in tourism does not lead to significant proportional employment outside the region either.\n\nThe local businesses don't get sh\\*t from tourism apart from a few tourist-oriented shops that can actually sell to tourists. But *everybody* raises their prices.\n\n>so your point about taking housing from people who work in the area is wrong\n\nDon't make grandstanding statements on things you don't know about. Anywhere tourism became significant, hotels got more zoning in urban planning, and in the long run, the existing local housing was taken over by tourist-oriented businesses or outright rich foreigners buying them up and gentrifying the locals. This is the case in Venice, Barcelona, Valencia, and in every single popular spot across the Mediterranean.\n\n>Here's some reading for you\n\nNonsensical lobbyist article. Akin to posting an article from a defense think tank saying how war is good for the economy in a debate about defense spending. Here's an article that is from this actual reality we live in:\n\n[https://www.thestar.com.my/lifestyle/travel/2023/10/09/fed-up-with-mass-tourism-barcelona-locals-say-039tourists-go-home039](https://www.thestar.com.my/lifestyle/travel/2023/10/09/fed-up-with-mass-tourism-barcelona-locals-say-039tourists-go-home039)",
            "[https://i.imgur.com/TOBWOD2.jpeg](https://i.imgur.com/TOBWOD2.jpeg)\n\nIt doesnt look that small to me. Half of Western Europe at the least.",
            "Everybody in the Mediterranean does. Go check what building density is there in Greek cities or the rest of the Eastern Mediterranean. They are forests of concrete for lack of space.\n\nNow Airbnb, golden visaer rich foreigners, investment funds and digital nomads are flooding these already crowded cities and destroying the local communities.",
            "Yes. That baffles the mind. Texas is basically wide open spaces. Almost the entire Midwest too. The mountainous zones in the East of California are less mountainous than the average Western European mountain zones. Yet, despite SO much space, new housing gets scarcely built.\n\nThis can be only due to the real estate industry and investment funds preventing it from happening to keep the profits high. Its evil. As simple as that.",
            "Half of Western Europe to be exact. The argument not only still stands, but it evaluates to the same when considering that half of Western Europe is basically uninhabitable mountains whereas Texas has wide, wide open spaces. And a lot of other Midwestern states too. It baffles the mind of non-Americans how Americans can have housing shortage in such an environment.",
            "It was sarcasm.",
            "Sure, but that's not the case in Barca. The reason Barca is low rise is because regulations disallow any building taller than Sagrada.",
            "Much of Macau is built on land reclaimed from the ocean and its full of high rise apartments. You don’t need “specific bedrock”. You need to prioritize housing.",
            "\\[Repeat after me: building any new homes reduces housing costs for all\\](https://www.ft.com/content/86836af4-6b52-49e8-a8f0-8aec6181dbc5)\n\nI honestly really respect that you actually read the article and had a thoughtful response; however, you're still wrong and are doing an excellent job illustrating how people understand supply and demand until it comes to housing, which is addressed in the above article. Once housing is involved suddenly everyone decides the rules of supply and demand no longer apply - all logic and rationality goes out the window. However, the rules do apply because \\*of course they apply\\*; it's still econ 101: it doesn't matter if the good is purchased or rented, demand is demand. \n\nHere's a study from Sweden that shows new building creates moving chains that quickly benefits poor people: \\[Does new housing for the rich benefit the poor? On trickle-down effects of new homes}(https://file.notion.so/f/f/f51b7b22-cd59-4bfd-85b0-cfbd4be402c0/3920909a-bcec-44f5-b778-7340a6547020/Filtering\\_Paper\\_230528.pdf?id=83f07d98-6948-4fa2-8eaa-448b71d84e5f&table=block&spaceId=f51b7b22-cd59-4bfd-85b0-cfbd4be402c0&expirationTimestamp=1719122400000&signature=T08owRL3zdyf5mr3N8PAT00-A9NSzdBpTUOdtMgRn8U&downloadName=Filtering+Paper+230528.pdf)\n\nAnd here's a \\[study\\](https://www.sciencedirect.com/science/article/abs/pii/S0094119021000656#:\\~:text=Constructing%20a%20new%20market%2Drate%20building%20that%20houses%20100%20people%20ultimately%20leads%2045%20to%2070%20people%20to%20move%20out%20of%20below%2Dmedian%20income%20neighborhoods) from the US that finds: Constructing a new market-rate building that houses 100 people ultimately leads 45 to 70 people to move out of below-median income neighborhoods\n\n>It just doesn't look to me like that approach is working too well for the growing homelessness problem and the declining ability of many people to even hope to afford their own home someday.\n\nThis is an insane statement. How could an approach that isn't being done possibly work? That makes no sense. For your information, 30% of homeless in the United States live in California. In fact, there are more homeless in Los Angeles than in Texas and Florida \\*combined\\*, so it's not the weather. So what is it? It's because California has the most unaffordable housing in the country. Why? Because it has egregious zoning restrictions and a crushing supply crunch. \n\nTokyo is the largest metro in the entire world but has affordable housing. Why? Because it builds and builds and builds. Tokyo shows that market solutions do work, and work on the largest scale possible. No other solution has shown to work on any scale even remotely close to Tokyo.",
            "Not in touristy cities here in Spain. It’s a combination of things, including investment properties being vacant, inflation, and tourist rentals. Interest rates are low in Spain.",
            "Agreed. This was an issue that existed way before airbnbs were ever a thing.\n\nHow much building has been done in the city to densify residential areas to accommodate more residents?",
            "Your opinions are the same as everyone else who misunderstands this topic. You place all the blame on short term housing and not actual zoning laws. Until people understand the root cause of the problem, nothing will change.",
            "Greece only has tourism, don't fvck that up, Germany won't help",
            "I think you have a fundamental misunderstanding of geology. Hard rock types can be found in the ocean. What does land reclamation have anything to do with it?",
            "Interest rates are rising in Europe which is why everyone is in a race to buy property... And when supply is low and demand is high I think we know what happens. The issue is when people point the finger at short term rentals as the easy out without using their brain.",
            "Reddit is in group think mode. They aren’t ready for alternative comments.",
            ">Your opinions are the same as everyone else who misunderstands this topic\n\nIts extremely arrogant to tell the people who *actually live in* the affected locations, leaving aside those who actually *worked* in tourism, that they 'dont understand' what tourism does, but you, the random foreigner on the internet, does, because \"reasons\".\n\n**The root cause of the problem is richer foreigners inundating popular spots and choking the locals out of their communities.** That's it. From Japan to Venice to Spain, everywhere this is the case and people are taking action. Bullsh\\*tting and lecturing the foreigners wont change reality. So save that sh\\*t. Sheeshh...",
            "Greece has other things than tourism. Or rather, had - until Germany unloaded bailing out the sunken private German banks on Greek taxpayers' shoulders and then forced them to privatize their national assets in return for lending the loan to bail out the sunken German banks.\n\nRegardless, the livelihoods of the locals are more important than tourist industry's earnings.",
            "Because piles are used that don’t actually go to bedrock. The friction from the silt holds the structure in place. When building on reclaimed land they don’t go all the way to bedrock…….",
            "Just because you live there doesn’t mean you understand what’s happening.\n\nYou don’t fight tourism (and this money flowing into an economy) by stopping tourism. You modify zoning laws to accommodation everyone. There will be some instances of people being priced out. We call this gentrification, and it’s not ALWAYS a bad thing. Economics is much more complex than “oh this thing is hurting some lower income people, let’s just stop it”.",
            "It's arrogant to think that simply living in a place makes one a expert on the economic problems that place faces.",
            "lol, so Greece took on way too much debt, lived above its means for decades (civil servants used to retire at 54!), yet somehow it's Germany's fault. If anything, Greece was bailed out.",
            ">Just because you live there doesn’t mean you understand what’s happening\n\nSuuure. Instead, it does mean that you, a random foreigner who enjoys the benefit of gentrifying the locals, does.\n\nI lived in multiple countries that had many regions gentrified by tourism and worked in tourism industry. So save that bullsh\\*t. You absolutely have fewer references to talk on such a topic, leaving aside that you don't even provide any logical argument that can actually be verified other than holistic economic lecturing.\n\n>You don’t fight tourism (and this money flowing into an economy) by stopping tourism. You modify zoning laws to accommodation everyone\n\nThat's *dumb*. **There is no scenario in which even a city like Venice will be able to accommodate dozens of millions of tourists in a year, leaving aside a random small fishing village, regardless of how you 'zone'.** There is a carrying capacity for everything, from regions to cities and to countries. You sound like an American - think that there is endless space that can just be 'zoned'.\n\n>Economics is much more complex than “oh this thing is hurting some lower income people, let’s just stop it”.\n\nIts not:\n\n>There will be some instances of people being priced out. We call this gentrification, and it’s not ALWAYS a bad thing\n\n**If a bad thing is happening, you stop it. Like, how we did with slavery or child labor. Lack of workers' rights.** We don't go around doing holistic economic lecturing as if magical beliefs will fix things. 'Economics' did not fix child labor, it did not fix slavery, it did not fix workers' rights. We legislated or regulated them - **just like how the countries and cities/zones affected by overtourism or rich foreigners are doing now.**\n\n[**https://www.reuters.com/markets/europe/portugal-ends-golden-visas-curtails-airbnb-rentals-address-housing-crisis-2023-02-16/**](https://www.reuters.com/markets/europe/portugal-ends-golden-visas-curtails-airbnb-rentals-address-housing-crisis-2023-02-16/)\n\nNobody outside the US will be dumb enough to believe 'economics' lecturing and allow you to gentrify them - as you can judge from the references.",
            "No. Its arrogant to think that those who don't know about some place can lecture the locals and tell them that what they **see** happening with their own eyes is not happening. I didn't even mention the experience in the tourism sector angle - which was magically missing from your retort, for some reason. What you people are saying is basically\"\n\n\"Be dumb enough to believe us and blame someone else so that we can continue to gentrify the hell out of you\"\n\nThe earlier cited article is where that ends up. The Angloamerican public may be conducive to such 'lecturing', but the rest of the world calls a spade a spade."
        ]
    },
    "Freshest, healthiest food in EU? COVID fucked my stomach. Looking for a place to heal.": {
        "title": "Freshest, healthiest food in EU? COVID fucked my stomach. Looking for a place to heal.",
        "score": 4,
        "url": "https://www.reddit.com/r/digitalnomad/comments/1dlsx67/freshest_healthiest_food_in_eu_covid_fucked_my/",
        "content": "Where in the EU would you go for the freshest highest quality, vegetables, smoothies, market halls/farmers markets, cold-pressed green juices, organic salads, vegetarian buffets etc?  All that hippie shit. Ideally healthy fresh food via food delivery apps too as I'm tired of cooking.\n\n**REASON**\n\nLong story short — Covid fucked up my stomach. It took a year to recover.\n\nThen another Covid fucked me again, back to square one.\n\nDoctors and nutritionists told me this is common with COVID, as it fucks up the gut microbiome.\n\nThe silver lining is that this has forced me to prioritize health and healthy food because the difference between McDonald's VS home-cooked fresh vegetables is a difference between feeling like shit for weeks, or feeling almost OK and slowly getting better.\n\nWeird question! Haha, but yeah, looking forward to any tips. Thanks in advance 🙏",
        "num_comments": 24,
        "comments": [
            "Any kind of Mediterranean food should be healthier compared to what people eats in other parts of the Europe. And looking how long citizens of Japan live - seafood specifically.",
            "I healed my gut by incorporating loads of leafy greens, kale, spinach etc into my diet. Also kefir, apples, oatmeal, blueberries. And cut out all processed food.",
            "South West Spain, Greece, Southern Italy. Turkey and Morocco also great options outside of the EU.",
            "I really enjoyed the food in Poland. The agricultural sector there is still mostly smallish family farms and you can get excellent quality food cheap. Locally sourced fruits, vegetables, honey, meat products like sausages and smoked bacon are amazing. The rye bread in the bakeries is second only to france imo. Poland is also super safe. Good medical care is not expensive. Oh….and the women are crazy hot too lol",
            "Try some sourkraut and fermented foods to start.",
            "Greece.",
            "London. The UK has higher food safety standards, better regulation of organic/pesticide free status, and almost all the fruit/veg you buy is the top grade.\n\nYou'll pay more for food, but it's almost guaranteed to be safe and exactly what it says it is.\n\nMediterranean countries have great food, but most have far worse regulation and control over what's sold.\n\nLondon has a really massive range of food both in terms of culture and in terms of basic to premium. If you want an apple you can trace to the tree it was grown from, then it's available, and delivered to your door.\n\nMost of the places people are recommending have far more chance of contamination, even if the food is objectively fresher and often nicer.",
            "You can eat healthy food anywhere. The keys are: stay out of restaurants, don't eat boxed/prepared food, learn to cook. \n\nYour best bet is finding someone's grandmother and learning from her.",
            "Look at bpc-157, no medical advice of course but the pills/nasal sprays have been incredible in my experience healing stomach issues.",
            "How about you drink yakult.",
            "You've been fucked up long before coNvid came about",
            "Yeah, I've been thinking of Cyprus non-dom program anyway. Not sure how's the food probably pretty fresh. At least in TikTok people hype it up lol. So that could be something to look into to get two birds with one flight",
            "Thanks! Any specific cities you'd recommend?",
            "Thanks! Any specific cities or places? Maybe look into the 3 biggest cities..?\n\nI've been thinking of Poland, I Googled something like \"best EU vegetarian reddit\" (I'm not vegetarian, but ATM it seems to help my situation) and the most upvoted was Warsaw which was really interesting.\n\nThe smallish family farms sound exactly what I'm after, definitely more nutrient dense than some billion-dollar-monsanto type stuff.",
            "Yeah, 100% 👆",
            "I will – thanks! If you wanna share anything more about it and how it's helped, I'm all ears (eyes..?)",
            "Thank you for this helpful comment on finding best food in the EU 🙏",
            "Southern Italy beats Spain if you will eat out often. Both will be great for produce but restaurants are way better with fresh food in Italy, particularly in the day to day, cheaper options.",
            "In Spain it nakes no difference really, as long as you stay away from tourist areas. Granada, Valencia, Asturias, Madrid, Segovia, Girona...",
            "Warsaw is pbly a good bet if you like a bigger city vibe and something international. If you like a mid size city and more Polish vibe id recommend Krakow and Wroclaw (both are college/student towns) and Gdansk is also really nice. Its a coastal city on the Baltic Sea.",
            "Warsaw is a good option. You have plenty of international restaurants and activities as well as the traditional Polish food. Even the small convenience stores have fresh vegetables fruits and breads in them. You’ll find a lot less processed foods and less pre-made meals the further east you get in Europe. \n\nWithout the war I’d tell you to come to Lviv. Almost every restaurant besides McDonald’s and Dominos are cooking from scratch. There’s barely any frozen or canned food beyond vegetables unless you really go looking for it.",
            "Feel free to dm but genuinely it helped with a variety of stomach issues.  Read up on it a bit.  It’s a naturally occurring gastric peptide. Unfortunately it’s become a bit controversial over the last few months but in terms of the supplements I’ve taken in my experience it has helped tremendously with a variety of injuries as well as stomach problems.",
            "Thanks! I really appreciate this kind of detailed advice!\n\nWhat do you think is the reason for better restaurants in Italy? Also, any specific cities or places?",
            "Culture, tradition. Spanish cuisine involves lots of fried food, lots of canned food, lots of salt. Italy is way more into fresh ingredients and produce.\n\nPuglia is my favorite part of Italy, cities like Bari, Brindisi or Lecce would be my suggestion; although Palermo or Catania in Sicily might be better if you want a more socially active lifestyle as there are way more expats and nomads."
        ]
    },
    "Digital nomad accommodation pet friendly in Europe ? ": {
        "title": "Digital nomad accommodation pet friendly in Europe ? ",
        "score": 2,
        "url": "https://www.reddit.com/r/digitalnomad/comments/1dlv7sh/digital_nomad_accommodation_pet_friendly_in_europe/",
        "content": "Hello everyone, \n\nI am planing on working remotely in August and I am searching for suggestions of accommodation that would allow me to bring my small dog. \n\nI would prefer a hotel or non-party hostel with a great wifi connection to meet people rather than airbnb.\n\nTotally flexible in terms of location as long as it’s in Europe (not France because I live there).\n\nThanks a lot in advance curious to hear your recommendations! ",
        "num_comments": 2,
        "comments": [
            "Booking services allow to use advanced search and look for dogs friendly places. Have you tried most popular of them?\n\nI think you'll be more happy with sharing a standalone house.",
            "I am planning my first nomad trip with my little dog in Spain later this year and I have just been looking at booking.com with the pet filter enabled."
        ]
    }
}