{
    "The International 2024 Closed Qualifiers: Southeast Asia & Western Europe - June 22 Matches": {
        "title": "The International 2024 Closed Qualifiers: Southeast Asia & Western Europe - June 22 Matches",
        "score": 11,
        "url": "https://www.reddit.com/r/DotA2/comments/1dllvyd/the_international_2024_closed_qualifiers/",
        "content": "#[The International 2024 Closed Qualifiers](https://liquipedia.net/commons/images/f/fe/The_International_2024.jpg)\n\n\n###The International 2024: Southeast Asia Closed Qualifier\n\n\n**Coverage**: \n\n[Liquipedia](https://liquipedia.net/dota2/The_International/2024/Southeast_Asia) |\n[Joindota](https://www.joindota.com/coverages/32866-the-international-2024) |\n[GosuGamers](https://www.gosugamers.net/dota2/tournaments/60972-the-international-2024) |\n[Dotabuff](https://www.dotabuff.com/esports/leagues/16840)\n\n**Streams**:    \nEN: \n[Twitch](https://www.twitch.tv/PGL_Dota2En2) | \n[Youtube](https://www.youtube.com/pgl/live) \n   \n\nID| Team | vs | Team |  Cntdwn (SGT) | PT | EDT | GMT | CET | AEDT \n:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:\nLB3a | [Execration](/logo-execration) | vs | Team Prism | [12:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1200&p0=236&font=cursive&csz=1) | 21:00 | 0:00 | 4:00 | 6:00 | 14:00\nLB3b | Bleed Esports | vs | [TNC Predator](/logo-tnc) | [15:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1500&p0=122&font=cursive&csz=1) | 0:00 | 3:00 | 7:00 | 9:00 | 17:00 \nUBF | Aurora | vs | [Talon](/logo-talon) | [22:00](https://www.timeanddate.com/countdown/generic?iso=20240622T2200&p0=122&font=cursive&csz=1) | 3:00 | 6:00 | 10:00 | 12:00 | 20:00 \n\n___\n\n###The International 2024: Western Europe Closed Qualifier\n\n\n**Coverage**: \n\n[Liquipedia](https://liquipedia.net/dota2/The_International/2024/Western_Europe) |\n[Joindota](https://www.joindota.com/coverages/32866-the-international-2024) |\n[GosuGamers](https://www.gosugamers.net/dota2/tournaments/60972-the-international-2024) |\n[Dotabuff](https://www.dotabuff.com/esports/leagues/16842)\n\n**Streams**:    \nEN: \n[Twitch](https://www.twitch.tv/PGL_Dota2En2) | \n[Youtube](https://www.youtube.com/pgl/live) \n   \n\nID | Team | vs | Team | Cntdwn (CEST) | PDT | EDT | GMT | SGT | AET  \n:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:\nLB3a | [OG](/logo-og) | vs | NAVI Junior | [10:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1000&p0=37&font=cursive&csz=1) | 1:00 | 4:00 | 8:00 | 16:00 | 18:00 \nLB3b | [Team Secret](/logo-secret) | vs | PSG Quest | [13:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1300&p0=37&font=cursive&csz=1) | 4:00 | 7:00 | 11:00 | 19:00 | 21:00 \nUBF | [Tundra Esports](/logo-tundra) | vs | [Entity](/logo-entity) | [16:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1600&p0=37&font=cursive&csz=1) | 7:00 | 10:00 | 14:00 | 22:00 | 0:00 \n\n___\n\n\nCountdown times are in local time. All times are subject to change based on the length of matches and delays.  \nOther match discussions: [/r/dota2 on Discord](https://discord.com/invite/rdota2)",
        "num_comments": 749,
        "comments": [
            "\"Honey, what should we name him? I was thinking maybe Sebastien Jr?\"    \n\n\"No.\"    \n\n\"He will be named Navi Jr.\"",
            "This Navi Jr team has an average age of 17 years old. The rest of WEU teams are over 22 years old average.",
            "This TI already won't have OG, SR, Nigma, AR, BLR, VP, and probably wont have Secret. Wow, what a change of pro scene landscape in last 2 years.",
            "Looks like Ceb gave motivational speech in the hospital, his wife did a birth speedrun and now he can play (bonus: twitter drama for day).\n\nTruly Winston Wolf of Dota with the difference that he also creates problems that he needs to solve afterwards: so - superior.",
            "I didn't want to call out BZM for throwing on purpose, but it's starting to look really fuckin' bad. 6 unforced deaths this game.",
            "Talon squad Filipino, malaysian and indonesian the true SEA toxicity squad to Ti.",
            "I just want to say Niku is only 15 years old and looks pretty dang good.",
            "Good guy OG gets eliminated so that Ceb can spend time with his family.",
            "Can't believe we might just see TNC again at TI lol",
            "NaVi should just promote this team to main roster even if they don't make it. They're clearly better than the current main roster.",
            "Happy for Talon's players. At least with TI they won't have to worry about the org pocketing all of the money they won.",
            "\"after an absolute slutfest\" - mlpdota 2024",
            "Mikoto made the difference, Talon look like a completely different team",
            "TNC is Baaack!",
            "OH BABY WE ARE SO BACK",
            "Tnc the team without salary proving the doubters wrong.",
            "Navi Jr some good lads making sure Ceb stays home with his newborn.",
            "Timado is underestimated within OG; they almost always prioritize giving BZM a good lane, sacrificing Timado as if they don't trust him. But of the whole team, timado has proven to be the most consistent and level-headed. Honestly, he was the only one on OG who deserved to qualify. I hope he finds a team that will truly value him. My boy Tomato deserves his redemption",
            "mikoto looked so happy lol",
            "I don't blame John at all but I think it's clear who he was rooting for this game lol",
            "My flair is still alive!",
            "Kuku really knows how to command a team.",
            "23 v 5 Pinoys incoming",
            "[looks like ceb is playing](https://x.com/OGesports/status/1804416401484005607)",
            "RUN. u/Agent_47H is gonna BLOW",
            "Navi is back, TnC is back, what year is this?",
            "grats talon! hope they doing well at TI with mikoto.",
            "HOLY SHIT TALON LFG!!! I hope we see a TNC vs Aurora tomorrow that would be so hype",
            "youre great exe (and if you made it till the end, totally deserves it)\n\nbut for the sake of viewership rating\n\nWE NEED THAT KUKU VS 23 SHOW",
            "\"Daddy why did you miss my birth?\"    \n\n\"I had to get eliminated by Navi Junior son\"",
            "They ought to ban this Yowe zeus already.",
            "jing crucial hook shot is simply chefs kiss",
            "TNC is on a momentum right now.",
            "syndereN has been losing his sanity these past few days over BZM lmao",
            "I was skeptical about Bzm's performance yesterday but he still does game throwing moves today even with Ceb. This might mark the end of his career at OG.",
            "WS lowkey one of the best offlaners in the scene. He never seems to have a bad game, even when losing.",
            "pieliedie TI coach. Pog",
            "WS and Ponyo is the best rookie player in SEA this season.",
            "What a spicy turn of event. Talon qualified before Aurora. And they have to face Execration or Kuku lmao",
            "Absolutely villain behaviour from Quest to eliminate team bald, Nigma and now potentially Secret. Like let me cheer for a team this TI",
            "Damn those 2 instahexes really broke bleed lmao",
            "Ceb: \"My ~~son~~ wife will understand\"",
            "Ceb winning a fast lane ticket for the hospital's nursery",
            "bzm is so getting kicked, dude single handily throws game.",
            "Ceb with the dad energy letting kids fulfill their dreams <3",
            "Mikoto is .... right???",
            "Let's go Mikoto!!",
            "MIKOTO DID ITTTTTT",
            "Surely Talon org will pay their players right, surely",
            "Since all the big teams are out, I am willing to throw a mini TI at my basement for them. \n\nI will provide beers and Sausages what y’all chipping in to make it happen??",
            "First year without TI attendance, that's sad for puppey.\n\nSecond year without kicking crystallis, that's on you bud. Well deserved.",
            "chat was right, zeal was actually useless\n\nbut what was that weaver damage, what a disgusting hero",
            "alright ceb time to start your dad disciplining skills on bzm today, good practice for the future.\n\nalso ceb looks like shit",
            "EZ no more drama",
            "Bzm probably had the biggest player drop-off in the last 2 years.",
            "mikoto going hammm",
            "Imagine if Aurora failed to qualify to TI.",
            "23Savage be like:\nDown to lower bracket: Sad\nChance to defeat full-pinoy roster: Happy",
            "If you're going to make an All-Filipino team, make sure you start by getting Kuku. Man just knows how to make a team great.",
            "HOW COULD PGL DO THIS?",
            "If Quest eliminate secret, we will have that only one out of the 20 remaining players in the WEU qualifiers is actually from WEU (Topson). Rest is all EEU and MENA players, pretty crazy (and Whitemon from SEA)",
            "Well it's official, there will be at least a peenoy at TI",
            "Ceb: \"This game is a win in my book\".",
            "Credits where it's due tho, young Na'Vi played super well. That black hole steal that closed the game was a thing of beauty. OG is just petrified with pressure and disjointed. Not enough against the momentum of the young guns with nothing to lose, we've seen that story many times.",
            "fuck yea letsgo talon!",
            "Secret to join the airport trio 🏃",
            "NAVI ACTUALLY DID IT. Wow and what is so impressive is how good, calm and composed they played for such a young inexperienced roster. Well fucking played, gl next games!\n\nAnd for OG, no comments - this was really really bad, some decisions and deaths they had simply have no place in tier 1 Dota.",
            "The moment that OG picked pango it’s over, What’s BZM winrate on pango btw",
            "It looks like they have lot of issues internally .. I think Ari has taken over the drafting .. i don't know what role misha is serving now. i expect them to disband after riyadh.\n\nOG should put more effort in fixing technical & game-play discipline issues inside the team, rather than making movies on players who is yet to qualify for TI ...",
            "Think this might be the end of Misha-bzm era OG, could see them picking up a promising stack or something",
            "Lmao what tf I just tuned in to dota for the first time since last TI and now clock can play football with his cogs",
            "You know your team is fucked up if Tomado is your best core...",
            "waitaminute,\n\nif talon 2-0 aurora...\n\nit means mikoto/talon won? (not that they have any drama....but still)",
            "why would mikoto go back to talon if its true that the org still haven't given their players the riyadh prize money from last year?",
            "Puppey wants to share a ride with Ceb and Kuro to the retirement home :)",
            "PSG confidence on  all time high after beating the powerhouse Team Bald",
            "Puppey/Ceb analyst combo at TI? \\#hype",
            "Now check Talon management twitter lol, gonna be spicy",
            "Puppey, Ceb and Kuro walk into a retirement home...",
            "It's sad to see how hard Timado tried until the end, but it's almost impossible when your mid has questionable plays all the damn time. I feel sad for CEB and Ari too, but BZM destroyed the team's hopes",
            "these low life bettors are just casually throwing \"Fixed match\" Allegations whenever they lose a bet huh? 🤭🤣",
            "Deserved Loss",
            "hope timado finds a better team or og builds the team around him. \n\nDude is fucking skilled and caught up in nw even if lost lanes.",
            "ceb is playing, rip navi kindergarden...",
            "Yowe zeus is NASTY",
            "LMAO bzm just rolling outside of the base and dying",
            "Bzm just doesn't stand the pressure, trying to play like prime Sumail and crippling his team every time. Painful to watch.",
            "Different day, same BZM.",
            "BZM again throwing games, ridiculous",
            "B KEKW M. What an absolute clown. SEA bettors should investigate his performance",
            "Navi Jr: Go home and be a family man",
            "Lmao saving BB for next game.",
            "all this only to be eliminated by navij",
            "nigma funeral yesterday, og and secret funeral today....",
            "Very strange Enigma ban from OG. It almost seems like they banned it so they cannot pick it themselves. lol",
            "Bzm the ultimate balancer, I'm having fun watching them throw because of Bzm",
            "ceb fake cam?",
            "Navi Jr to Navi dota 2 main roster next season",
            "BZM needs a break man, 2 games same shit.",
            "BZM is so baffling to me. What happened to him? Feels like he's pressured to make plays all the time.",
            "that series didn’t even feel close tbh",
            "Sometimes I wonder if OG just confuse themselves because they can't understand each other while they're playing.",
            "It seems like the rest of OG players just want to let Ceb have time with his family.",
            "WS is a beast on offlane",
            "Scenes if 23 first loses to the org that didn't pay him then one of fhe guaranteed 5 man Pinoy teams in the LB finals.",
            "Wow Navi jr smacked og nice",
            "gg no class",
            "Chyuan was the weak link lol",
            "Another day of giving \"Signature\" hero to Crystallis in high stake game just to have zero impact anyway",
            "OG needs a new roaster post TI. not qualifying 2 years in a row aint it.",
            "I kinda expect the downvotes, and yeah all the old guard is shit rn, but competitive dota just doesn't even feel the same anymore.",
            "Very disappointing for Secret yesterday, hope.they can comeback against Quest",
            "Looks like Ceb hasn't slept at all.",
            "Misery and DJ send their regards",
            "Ceb became a Dad but why is bzm playing like he just gave birth??",
            "BZM should hit that uninstall button",
            "fking daze on rubick is peak fy rubick shit\n\nhe did some amazing pplays yesterday",
            "go to hospital CEB\n\nleave dota",
            "What an incredible way to end the game. Holy moly.",
            "Honestly cant tell what drugs bzm and wisper are on.",
            "Idk seems like OG needs to learn if you can't pick Enigma if you don't cover off the rubick with a ban. Same shit happened vs Entity yesterday.",
            "One of the worst games by BZM",
            "omg og. 1st picking enigma doesnt get them anywhere",
            "sub in Ceb's kid for BZM",
            "It might be time to hang it up Ceb. This is a kid's game.",
            ">That was a Leeroy Jenkins moment from BZM\n\nlmao",
            "NAVI! *clap**clap**clap* NAVI! *clap**clap**clap* NAVI! ",
            "I hope Navi Jr make it, they're fun to watch",
            "team that bootcamping actually doing better than the one who didnt... what a suprise KEKL",
            "BZM threw the last 4 games, the worst performance by a professional dota player, his initiation decisions were illogical and out of position.",
            "How did BZM went from best most consistent player in team to this,what the hell happened this season?",
            "PIELIEDIE LETS FKING GO TOO",
            "OG lost to Na'Vi Jr. What year is this?!\n\nOn the SEA side of things, >!Execration vs TnC tomorrow, can't wait for the Pinoy DotA rambulan!!<",
            "Secret have an impressive ability to fail almost every move they make.",
            "Classic SEA late game",
            "EEU carry winning with a carry Venge. What is it, 2016?",
            "23 not dancing",
            "Guessing the post TI shuffle this year will be extremely spicy.  \nOG, Nigma and Secret probably need to do some introspection.  \nAlso, I don't see Shopify surviving.",
            "Sneyking and Fly about to be the only old school players at TI.",
            "PLD's Talon qualified from upper over Aurora? :o SEA delivers that spice, looking good Talon, and glhf at TI.",
            "Carry diff",
            "Why would you go 4 in like that into the rosh pit?",
            "I don’t really have anything against OG players but there’s something amusing about that org missing TI two years in a row",
            "Visa Major for Akashi 👀",
            "Remember 1Win qualified for TI, be sure Ceb is already letting PGL know OG is ready if 1Win doesn't get (or is late) with visas. OGbros don't fret, drama making poopster is never truly out, have hope!",
            "I think it's only fair that OG is allowed to redo this series with a stand-in. PGL's incompetence is causing Ceb to be clearly distracted from all the drama and his baby. It is ridiculous that PGL forced OG to play like garbage",
            "BZM is playing like he is jealous of Ceb's newborn and tries to get some attention by throwing endlessly.",
            "Sunsfan/Synderen I doubt you read this but linkens on Enigma does nothing vs Rubick since the Bkb change you can  just press fade Bolt/telekinesis and it procs the linkens even in BKB. Like theoritically it can help of course but its not as big of a protection as BKB Linkens was before",
            "Ceb, I think your boy BZM want to leave your team...",
            "How do you go from a 13K networth lead pushing top to losing the game in 2 mins?!",
            "notail really scam us to think that ceb is actually 4head chess player.... i blame notail.",
            "BZM used to have 80% something winrate with Pango when Ammar was there. Now he's the worst pango player in t1/t2 scene",
            "Do you think OG should've taken the disqualification to keep their dignity?",
            "the absolute scenes when Ammar and DM are at TI, and the org that kicked them isn't. LMAO.",
            "From being poached by T Spirit after they won TI to playing like this…the fuck happened to BZM",
            "Daze is such a good Rubick player",
            "CHECK KHIS FKING PC  \nIS THIS FY ON RUIBICLK\n\nHOLY FK dazeeeeeeeee",
            "Lmao OG rampaged by baby Na'vi, it's so over",
            "That Rubick play is so disgusting. Commended!",
            "Great rubick plays are always joy to watch",
            "OG is cooked. Some of these moves and plays can't be explained. The fuck?!",
            "Just disband",
            "OG and not buying back on your carry at the right time - name a more iconic combo",
            "baby NAVI teaching OG a lesson or two",
            "Damn, NAVIJ are doing it!",
            "BZM is either hit or miss. Can't rely on him at big moments. Bro is goofy.",
            "Thats rough Bzm...",
            "Ladies and Gentleman... BZM!",
            "OG.Miracle soon.",
            "BZM got caught again lol wtf",
            "Imagine if Ceb did the classic Zoom  covid trick and left",
            "That's a fucking hilarious throw",
            "What was the point of drafting Rubick this game the q out of plasma field theres no spells for him to steal except cent stun and glimpse",
            "TNC looking good.",
            "Well this game is over. Ursa is the only one with good networth, and there's just no way Crystallis can carry his team alone.",
            "Crazy how Quest is playing as 5 all the time.",
            "wtf talon doin oh my goddddd",
            "quest draft is so good. and classic secret with the dog shit draft",
            "No hopes. Horrendous plays. Fuck Kordan so passive",
            "Ceb should've just ditched this team and be with his wife tsk",
            "My sincere reaction upon waking up and seeing OG got 0-2'd with Ceb playing: xD",
            "How many iteration of team secret with crystallis as core until puppey realize that there are many younger and better players out there",
            "cant wait for the crystallis defenders to come out again after the 42069th time he played like dogshit on \"his best hero\"",
            "Secret getting eliminated by the same team from the last TI qualifiers lol.",
            "Now officially, the top 4 of the Western (!) Europe qualifier are all predominantly EEU teams. What has this scene turned into?",
            "secret as a team just lost their... idk passion to play? Crystallis just can't carry anything",
            "If dota allowed for a roster with subs, like most other sports and even CS2, the whole stand-in thing would be a non-issue.",
            "It seems Ari is useless without his hero puddle (Hoodwink, Tiny).  \nWisper is not present this game.  \nBzm is just doing Taiga things.  \nCeb is regretting his choices to play rather than look at his child's newborn face",
            "Interesting how OG looked more likely to qualify yesterday(barring the huge throw at the end) when they actually had a real pos 5, who could ward the map effectively and the map wasnt actually dark the whole game. All I saw this series was endless smoke gank fails and the map being dark for 90% of the game.",
            "Nigma not playing today?",
            "Sad ending. Hope Ceb can have quality time with the family now . Scared for secret now. Quest beat them last year.",
            "Yesterday if Wisper didn't waste 2nd BH on storm, OG woulda won game 3, and now they lost to Navi Jr.",
            "why didnt puppey take mikoto when he is free agent months. instead he get this kordon guy...",
            "Okay NGL 23 Morph is hands down the best, just a few misplays, but should've done those plays earlier before megas. GG Talon!",
            "does synd and any of the redditors understand rubick can proc linkens through bkb with his q or w? \n\nLinkens wont do shit to stop bh steals, stop yapping about linkens protecting him.",
            "Is this really WEU qualifiers? If PSG wins series, then from 4 teams only 1 guy will be real WEU player, 16 from CIS, 1 SEA, 2 MENA.",
            "Lucky OG made it to Riyadh on points because of the rules",
            "Og needs a complete roster shuffle. All 5 players are individually talented, but it just ain't working as 5 together on og. Let all 5 players go, let them join any other organisation they wanna and then just rebuild the roster from scratch. Otherwise OG is gonna end up like shopify, secret and nigma.\n\nTo get eliminated by navi Jr.? Even if og won 2-1, that's not how you are gonna win TI against xg, falcons, gg or any other t1 team lol. Teams like xg and falcons would have just rocked navi Jr. To the moon and back.\n\n\n\n\n\nUnless navi Jr. Actually makes it to ti and goes on to win TI as an underdog Cinderella story lol",
            "Ceb will play, we will see PGL at court when he gets his divorce over this.",
            "Did Taiga replace BZM wtf?",
            "This OG roster seems pretty done, most likely a full revamp after TI, bzm to Shopify or some shit",
            "no BZM really can't be for real, last seconds of his ult, rolls up on level 6 disruptor\n\nabsolutely NO ONE could have predicted what will happen afterwards",
            "this navijr is better than the senior one...",
            "Bruh that mikoto saves",
            "Navi Jr mid is 15 years old damn",
            "all of the old guard dropping like flies. OG, Nigma, ex-EG. Secret probably next. The new era is well and truly here.",
            "What an upgrade by Talon to sign Mikoto before TI.  They should have sign  him before Riyadh.",
            "WS is great at his best with these map-control heroes. It's not only that he \"makes space\", but that he takes space + vision aggressively for his other players. He's not limited to just playing the map control heroes as aura-pushers either.",
            "Imagine not getting dq'ed but still eliminated 2-O\n\nBzm it's time to pack up (oh wait, they are playing from home).  \nCeb cam looked frozen or he was just in despair",
            "Talon usually shows up against Aurora, and Mikoto for that matter man looks like he needs to prove something",
            "At this point TI for washed up teams would generate more viewers than actual TI is going to.",
            "How many times can 1 player throw a game with stupid plays, what is emo doing",
            "Surprised Na'VI JR didn't tip BZM. I would've done that in an instant lol.",
            "uh wtf timado",
            "What was Timado tryna do with saving that BB.",
            "Bzm are good on two spirits. Storm and Ember.",
            "b z EE m",
            "OG lost the juice",
            "Holy smokes that Rubick player in NaviJ is a steal.",
            "Can they stop picking enigma without banning Rubick first ?\nThey got some nice black holes that rubick stole and used to change the outcome of the fights, ultimately winning the game for NaVi. If they had banned it, they would have won 100%",
            "yeah I’m thinking it’s disband time",
            "WHY BZM WHY",
            "yesterday nigma, today og and secret?",
            "Wisper really like his Radiance huh? Radiance on Doom, Pango. He probably will buy Radiance on Enigma too if he ever get a chance",
            "Pretty disappointing season unless we do well on Ridyadh which I doubt. Not sure how this team will rebuild barring a complete overhaul.",
            "OG completely tilted, it's ogre.",
            "It's over, see you at Riyadh OG",
            "OG taking fight 4v5 (after BZM is dead) and losing fight 2 times",
            "I really don't get why OG wanted to fight 4v5 I get ulties were down but",
            "wtf are OG doing?",
            "Very poor plays from OG. Trying to fight 4v5 twice.",
            "Wow navi jr BABY",
            "Na'vi is back??",
            "Aurora doesnt even bother dewarding inside their base. Spirit breaker charging supports and Beastmaster blink in randomly, shouldn’t they suspect Talon had vision?",
            "morph doin work",
            "23gate or gated.",
            "Yeah let me split push with aegis against SB, some of the plays that Secret make are just mind boggling sometimes",
            "I need an Aurora vs TNC tomorrow for the toxicity lol",
            "Sigh Crystallis as always a non factor in every single fight no matter the hero, no matter the opponent, no matter the net worth",
            "Secret always to the strangest, most discombobulated fights imaginable any time they're playing a good team.",
            "wait wtf did puppey lasso",
            "Dukalis heard reddit talking shit about SB aghanim.",
            "so this ti i m only supporting falcons and XG \n\nno nigma for many years , no secret from two years , no somnus this year , no fy \n\n:(",
            "Lmao wtf was that rosh move",
            "no matter what i will always watch puppey kuro miracle sumail team games \n\nbut it hurts every time \n\nmaybe  its time to let it go ?   \ntake the coaching path . Let the kids press buttoms",
            "I think all Old guards is at the end of tunnel guys. Truly the end of era FeelsBadMan",
            "Secret should change their 4....or mid....or offlane...or coach....or their 4. I don't see any other problem",
            "Truly End of an Era. No Secret No OG No Nigma No Rtz at TI. RIP Legends",
            "Honestly this current Secret roster is meh, at least get Satanic for carry",
            "chrystalul - out  \nnande - in",
            "left hia wife to get 2-0 😭",
            "nigma and og should merge together to create a new washed team called niggo",
            "we might have to start the talk about puppey in the same way we talk about ceb and kuro.... the dude is washed up too",
            "CRIT WAS RIGHTTTTT BABY",
            "The trash has been taken.",
            "Ceb's wife: \"Was it worth it? \"",
            "BZM and Wisper played really bad both the games tbh\n\nTimado tried his best",
            "Without Jerax and Topson, OG are back to what they were - Overrated Garbage",
            "Time to rewatch yet another True Sight for OG fans maybe with some tweeting shit to pgl every now and then",
            "Og Just announced ceb will be playing",
            "Even if OG win this 2-1 it'll still be incredibly hard to beat Tundra/Entity for the second place",
            "can someone post crit twitter post when he praised navi junior 6 months ago \n\ntwitter is banned here",
            "Topson gets away with unreasonable, suicidal stuff, but BZM really is not Topson and shouldn't try to play like he is.",
            "PGL's fault, NAVI's fault. LET US WIN",
            "Deserved",
            "23 cabbage kekw",
            "well at least the 23adage still rings true: only one pinoy per team",
            "15k gold swing after a fight + rosh, I love modern Dota",
            "Feel bad for Timado, but not the rest of OG. They got blasted in this series for long-term problems OG have had for a while, and failed to address. \n\nHe honestly has the hardest job in the team because he always seems to give up pick or lane priority to help an Ari/Wisper/BZM who don't consistently deliver.",
            "Secret losing to the 3rd best MENA team now, this is just as bad as Mouz.",
            "Damn, feel bad for Timado. Guy played his heart out, I don't know what the hell OG was doing this series, it looked like a shitty pub stack.",
            "Thank fucking god the suffering is over. I love OG, but good riddance.   \nWith the performance lately from OG, its just sad watching them struggle against Tier 3 teams and just losing to Tier 2 teams.",
            "Keep timado, wisper and ari. Get a 5 and new mid. Bzm wants to go",
            "I am so happy OG will play and in full roster. I want to watch them lose fair and square and miss TI with no excuses. Lets go NaVi kids!",
            "THE CIS region domination. This is like the CIS golden age in dota 2. A lot of talented young players. Welcome to the golden age of CIS dota 2.",
            "Wisper is too damn inconsistent. BZM is just straight up win for the enemy team, Ari, I have to say has had some decent games but he doesnt quite match up to the level of a tier 1 pos 4 at present, and Ceb should go back to coaching and kick that fraud Misha from this team. Building around Timado is the best recourse from this disaster of a season, although it might take another humbling at Riyadh for that to begin.",
            "Kicked ammar 2 years ago, didnt qualify to two year ti back to back\n\ncoincidence ? i think not",
            "tbh bzm never looked the same since ammar left\n\nammar made bzm shine alot \n\nbe it in drafts or be it in chaotic fights \n\nbut this bzm isnt the same bzm we saw in first year of og",
            "I dunno why they opted for Poloson over Dj for this Bleed iteration if they wanted to get Se as pos5 anyway. But I don't think even Dj can salvage this team. The current form of Jackky is very bad compared to his Boom days. You can see that Emo is really trying to carry this team while Zeal is invisible half the time and Jackky is busy throwing their leads.",
            "LET'S GO NAVI!! ",
            "can't spell throw without SEA",
            "NO OG NICE ONE!",
            "Get rid of this bottling roster. Everyone except Timado should be booted out of this team after this season. none of the other 4 deserve to stay after this disaster of a season.",
            "Nigma on UB?",
            "Ceb really ditched his son's birth so he can watch BZM throw multiple times lol",
            "I'm not sure why people are blaming BZM here, Morph needed to BB otherwise they lose and he didn't until it was over, what was he exactly waiting for?\n\nThere was no way they can delay the push until he respawns, should have just clicked it and Navi would just back off.\n\nInstead we got BZM trying to delay the push and die which was stupid as well.",
            "OG one game away from being officially downgraded to top 7/8 WEU, roughly on par with the likes of Nigma and Secret. Hard to see a recovery from there.",
            "this OG didnt even bother to bootcamping bro.... smh",
            "Yeah taiga sends his regards.",
            "Ceb ruined his marriage for this? Kappa",
            "0-5 before the horn, perfectly encapsulates SEA dota.",
            "I've tried quite a lot of this Ench aghs and its just not good against good players, they just send their creeps in a different direction and it just does nothing, its actually a lot better when your own team has the creeps, cause it buffs your own creeps too and its just a nice long range bkb piercing root and if you have ally creeps, its usually 4 seconds+",
            "Not securing rosh after a teamwipe sure is something.",
            "Just extend the game and let jacky throw, he always throws no mattee the advantage",
            "Not related to the pro games. But is Pango weak in lane vs Batrider? BZM Pango getting wrecked by Wispsrs mid Batrider. Got to be embarrassing as a mid to lose to your teams offlaner",
            "Has Wisper played anything else than Enigma recently? Feel like they pick it for him every match",
            "This Na'Vi team is really entertaining to watch, even if not always for the right reasons",
            "bzm playing with \"taiga mode\" = ON",
            "Dunno why teams keep picking this Earth Spirit hero.  \nRemember people trying it out to \"counterpick\" Sniper mid last patch only to get demolished.  \nHero is so damn underwhelming.",
            "Support carrying the whole game once again",
            "WAOW",
            "ok this is a shit draft by og already",
            "Bzm pango 🫣\n\nBut ceb phoenix is 🍾",
            "The only player who can keep bzm under control is in shopify now",
            "Not sure if Troll is enough damage to kill the triple beefy cores of NaVi.",
            "AEO doom vs single target doom \n\nwcyd",
            "OG might win this game if Whisper would just stop feeding.",
            "OG HAH",
            "[deleted]",
            "Missed opportunity for SON ray comment synd",
            "Net worth of every hero and their position counterpart being nearly equal is funny to see",
            "see og winning the war, had something important to do for a while and come back to see bzm died",
            "Secret strategy just isn’t good enough. 5 players are just pushing lanes.\n\nWe never see secret hit a timing or critical mass as a team. Maybe one or two players pop off and they win. Puppey as a captain is just not capable of leading a tier 1 team",
            "Hmmm SF first pick",
            "Nice 322",
            "This spell cast sf is always so underwhelming",
            "stay down old man",
            "puppey call in 2024 lmaooo",
            "Yamich must be laughing his ass off now.",
            "Secret's changes for this off-season. kick kordan, kick boom, kick shishak, keep crystallis",
            "No OG,Secret,Nigma,VP,LGD and Arteezy in the TI this year .. What's happening?",
            "This secret failure this season is on Puppey. Man is so stubborn not to replace Crystallis. The only reason why he didn’t replace Crystallis because he thought he can get the creepwave core roster but since they are not winning and no budget to buy out the contract and last but not the least Crystallis is the worst carry in Secret history (Worst than MP). That’s why they announce the roster late and they only get midone and boom because they couldn’t get the players that they wanted to play with.",
            "What's up with the toxicity towards older pro players? From what started with Kuro, has now become targeted to any older player. Just so confused why people are constantly demanding retirements and wishing the downfall of these players?",
            "Secret time to rebuild the team please",
            "yes, reminds me of the old VP prodigy roster where their youngest player, Save was 18/19",
            "2 years ago, SR, BLR, AR didn't exist and Nigma and VP didn't go to TI either.",
            "Not so many SEA countries play DotA anymore, Vietnam used to be but LoL killed their scene, Thailand is like only 23ravage, it's just Indonesia, Philippine left.",
            "I think we also need to give some credit to pieliedie, i feel like they play way better after he joined",
            "wtf really?",
            "Mikoto was creating so much distraction in the back. Gave akashi the space to kill ancient",
            "The Rise of the Phoenix baby!!!",
            "kuku doing it since 2016 \n\nkicking favourites",
            "no contract no salary just play xd",
            "Hes an official talon content creator after all",
            "I mean the dude's pinoy",
            "He is signed by Talon.",
            "I mean it's mikoto vs talon, it's always spicy content",
            "Too bad for me, even if they qualify to TI you can't get new flairs anymore.",
            "BRO HIS ULT IS OFF COOLDOWN RESET GUYS RESET",
            "Secret is ba..?",
            "exe vs tnc - destroying hopes and dreams for all pinoy TI",
            "Whoops",
            "Jing and Kokz played so well",
            "He's gone to Shopify lol",
            "And he's only 18, dude is the future of SEA",
            "ex-Team Bald.PieLieDie \n\nTeam Bald TI13 Dream Lives on FeelsStrongMan",
            "Ws a standout offlaner for sure",
            "23 did mention in aurora vlog that they are only afraid of Ws from talon",
            "On the bright side quest could have eliminated pg too",
            "hex + instant delete ursa",
            "Yow Eee in his Zone ☺️",
            "He want it for quite a while now",
            "Its in riyadh where they got screwed afaik, TI winnings are directly to players.",
            "I believe if it TI or Valve event, Valve pays directly to players? or at least org wont risk get banned by Valve",
            "That's what you get when you're a waever with\n\nAghs shard + Geminite attacks + Daedalus + Desolator + Amplify damage + Slardar Ult against team with no armor item...",
            "And loses against 5 pinoy team will be hilarious",
            "Blacklist doesn't know how to build a dota team. They prioritized getting the big names instead of putting a foundation by having a captain first. Still, I don't think even Kuku can lead BLR with Gabbi on the team. Kuku works on TNC because they have trust on Kuku's vision and leadership. BLR with Kuku will have ego clashes.",
            "People been memeing kuku from getting kicked from BLR but the guy knows how to build a team and doing a good job as Pos 5. His team doesn’t even have salary from TNC",
            "WEU dominance is actually just EU salary dominance",
            "Something something rules",
            "Pretty funny when people still think WEU is still the top of the top, their best bet right now is Gaimin Gladiators",
            "Navi played out of their mind but we can't ignore the fact that Bzm threw so hard with many questionable solo deaths.",
            "dazeeeee the new fy",
            "wait what, how did Talon won, I was watching OG Navi game",
            "OG pick up Navi Junior stack and rinse repeat the last 2 years xD.",
            "Navi jr for example 🤣😅",
            "I guess it's better than rotting without any team",
            "Throw in Kuro there too for some hot 6k MMR takes.",
            "add kuroky there and that is real hype.",
            "Ari has been pretty underwhelming as well. Not feeding like Bzm did, but he didn't seem to be doing a lot of good plays.",
            "The team played way better yesterday with the exception of bzm on those 2 void spirit games. They also lost so quickly in a similar fashion yesterday because of bzm's decision-making. Timado with aegis and bzm proceeded to dive enemies alone. In addition to that, the drafts were also quite bad today.",
            "Bettors are the scums of the earth.",
            "it's just one guy. has been doing it since SEA quals began",
            "Every play is a 322 if you lose a bet.",
            "4 games",
            "Maybe no Yuragi has affected him. They were friends right",
            "Two days in a row he completely shits the bed.",
            "what's the context of this? I kinda know 23 said it but to whom",
            "could be worse I guess. You could be Nigma and not qualify for 3 years in a row with majority of the roster involved in all 3 of those qualifiers.",
            "Alright grandpa, time to get you to bed. \n\n\nBut same, looking at your favourite players became washed up, players similar with your age becoming veterans or washed up doesn't feel good.",
            "Just hope they at least get to top 3",
            "In Crystalman we trust",
            "Depends if puppey gets his comfort pick and not some random skywrath that felt like non hero",
            "Depends if puppey gets his comfort pick and not some random skywrath that felt like non hero",
            "OG really gotta stop picking him heroes where he can throw himself into death",
            "We said that yesterday too...",
            "I'm sure we all know who's only going to get replace in Nigma lol\n\nIn OG, They just need a new coach and IGL, since CEB is going to retire.\n\nSecret just need to go full EEU roster. Since Puppey speaks Slavic language and there are no rules about which region to join no matter what's your majority of your roster.. There's a lot of young talents in CIS right now. Even the tier 2 teams you can find a lot of great players over there. It's just Puppey doesn't want to deal with Visa issues which is the common problem for all the Russian players that's going to play in international lan.",
            "Nigma got mad money and some pull, OG got mad pull and some money. on the other hands tho, secret....",
            "if saksa wants to play, him and saber are gonna be top free agents",
            "Miposhka is and old school player",
            "which is the case in >90% of Secret losses",
            "I think he got a visa for Schengen already, it was just delayed last time",
            "it's time for another team to take their slot because of visa issues kekw",
            "Not only they bent the rules to allow them a stand-in for day 1 but they also allowed the obviously fake cam feed to go on during these games.",
            "I can't different if this is sarcasm or actually braindead comment.",
            "Ahahahhahah",
            "True, there's no way to itemize against rubick as enigma now. Have to counter with other hero picks and plays",
            "I guess they just way underestimated the fire power that Navi Junior's heroes were capable of doing to their towers. Timado had buyback. I'm not sure why he was holding it onto it.",
            "and if that wasnt enough, he has had that fraud Misha coaching this team for 2+ years.",
            "same with Yuragi and Terrorblade. He used to have sub 83% WR on that hero and now he has 48% WR on that hero in pro games, with the vast majority of his losses coming from his time at OG.",
            "Faking ceb cam is extremely undignified.",
            "he is holding navi on his back",
            "Quest is such a villain",
            "Most subs doesnt want to be sub, how many player rather plays for lesser team rather than being benched. Save- was 'subs' on VP yet he rather sitting on his contract not doing anything.",
            "Prize pools would have to be shared with them, and talent would be dwindled.\n\nMaybe if after the qualifier team were set you could sign on official stand-ins with the loser teams.",
            "Secret don’t have liquid money to throw.",
            "I was wondering about this yesterday as well. He kept saying how Rubick's team has no Linken break apart from Spell Steal and that's why it's so good but like... all of Rubick's spells break Linken.",
            "Afaik 3 of your players just need to physically be in the region while playing. Nationality has no bearing here.",
            "There's no MENA qualifier, it was just piled into WEU. Also the orgs are free to have players from any region, so I'm not sure what your point is.",
            "Arent the MENA countries under the weu in valve terminology?\n\nBut Yeah",
            "Thats what we call WEU BLOODBATH!",
            "again through very good fortune at 1win's expense. If they dont finish 4th or above at Riyadh (which I dont think is happening based on these recent performances), this has been an absolute disaster of a season, and calls for mass roster changes.",
            "The last time Talon won against Aurora was in 2023, before lorenof joined Aurora.",
            "He really want those tips",
            "Channeling his best Ana vs Liquid impression",
            "As long as they stick with Misha as their coach they dont have any ambition to be more than a meme team",
            "HOLD..\n\nEdit: Nvm\n\nEdit2: It is so over",
            "Pos 4 is obviously a problem, time to change another pos 4 again.\n\nCant understand why Puppey is so loyal to Crystallis after so much underwhelming performance.",
            "She's going to bring this up in every argument in the future.",
            "it's ok, his son will understand",
            "Throw secret in there",
            "1. Miracle\n2. Sumail\n3. Ceb\n4. Kuroky\n5. Puppey\nBatChest",
            "https://x.com/Cr1tdota/status/1770221625989881921 context",
            "3rd?? Who even is 2nd",
            "who's the second best MENA team?",
            "absolutely, He is the only one who has consistently shown up time after time this season, and he only started after 50% of the season was done. The other 4 should be ashamed of their performances this season.",
            "Dont forget Misha please.",
            "Rofl you got me at first half",
            "You just said the same thing three times",
            "My guy, you need to go outside and touch grass. This obsessive OG posting cannot be healthy for you. A couple posts a day is fine, but like 10 in a matter of minutes seems excessive. I promise we understand your message the first time.",
            "And ammar didnt win anything the first year with nigma and psg. Only when they made a new Falcons.\n\nThe point is tiring. Ammar was good but it was a bad match.\n\n5 years ago people had written if sneyking as another NA casuality and now he is a ti winner on the strongest team",
            "Also didn't win anything after kicking Ammar (won 2 major tournaments with him)",
            "Everything went downhill after ammar left, taiga issue, misha chu ceb shuffling for pos 5, DM disaster cause bad fit, yuragi inconsistent, now bzm's bad performance.",
            "You are still on the Ammar grievance? There's a very real chance sticking with that roster would still have led OG to this road except its Ammar in wisper's seat. Dota is funny like that. ",
            "Bzm was pretty great in their second year, pre TI 2023.",
            "Bro is never the same after that math exam",
            "There is something with young players and pressure growing over time in teams like OG that are expected to deliver regularly and fail to do so. Yuragi too was better and more creative before completely crumbling last year. The whole OG roster has been revamped around bzm and wouldn't you know it he now acts like their liability in important games.",
            "Bleed seems to have some shady shit as well with the reports that misery and dj are looking for a lawyer.",
            "UB is for bitches",
            "Not for the last death but for the half dozen useless deaths that came previously I guess",
            "Mid Earth Spirit is just one of those heroes that looks totally out of place when it doesn't work out. But you're right, none of the OG cores played this game well.",
            "At least they go to Riyad and occasionally go to tournaments.  Not that level yet",
            "yeah, they should have rented the whole delivery ward.",
            "Had 2 games worth of fun when it first came out running Ench + Enigma with a friend. Eidolons multiplying reaaaally quickly was asight to behold.",
            "Wait it pierces bkb? Then it should be used like a single target Overgrowth",
            "Yeah he's not capable. In fact none of the weu teams are capable bcos they will choke to spirit in the end",
            "Did you expect me to write all player names? It's obviously not just about orgs but also about big names, fan favorites and current expected results (be it by orgs or individual players) in general, and bunch of 'em failing to qualify for TIs.",
            "Malaysia too, but a lot of them play for CN",
            "how can you not give credit to ti9 groupstage MVP",
            "Yeah, his born in 2009.",
            "Basically azure ray last year lol",
            "Might as well go to Nigma tbh, same thing even easier life.",
            "At this point, I doubt he can even replace Yopaj.",
            "The mvp of the ti9 groupstage PIELIEDIE",
            "Team Bald, Nigma, Secret, OG in a row. Imagine that",
            "Yeah ego clashes. Even since its first iteration. Eyyou after getting kicked said there's \"too many brains\" in the team. I will always say, BLR wont go to TI with Tims. He always think he's the better support in his team. He even took the being the captainship from the start. But that man only excel when there is an respectable pos 5 playing with him. That's why TNC won the major before because he still kinda respect March back then, also that's why Boom qualified because he respects skem leadership. I will bet my life that if ever Tims create his own stack in the future (like Kuku), he will never get a good run at qualifying.",
            "Oh no we can't, it's downright suspicious. Tilted doesn't even begin to describe it.",
            "actually good teamfight and draft.",
            "yeaah, i just noticed it too.. i thought there were more of them 🤣",
            "I think it's aimed at Talon the org",
            "It’s for Talon’s CEO I think. There’s some money dispute",
            "Not sure what tournament it is, but 23 said “No Class” after beating Talon, but he then followed up that he’s referring to the org not the players.",
            "to the talon org because they allegedly haven't given the prize money for riyadh last year which is weird because mikoto came back to talon",
            "Im sure they aint getting past OG/Navi Junior even if they beat Quest.",
            "top 3 for what only top 2 invited",
            "Problem is that he isnt looking good on stable heroes like DK either. At this point he is just an Invoker one trick pony.",
            "RIP Fbz. Maybe they get Saberlight or something like that. Dunno what constellation of players can 4v5 though.\n\nNot sure about OG, feels like maybe they're crumbling. Especially if they bomb in Riyadh. If they do good or mid there maybe the other members of the squad survives.\n\nI think Secret just needs to rebuild entirely.",
            "Kind of. He didn't play his first LAN until 2016 so I consider him newer than players who made it some of the first few TIs.",
            "i think it was uk visa not eu visa",
            "and he left the team to go on forever vacation lmao....",
            "Thats mainly becuase chuyan would get stomped in the mid",
            "First thing that came to my mind. Ana holding BB on Spectre",
            "Nevermind, they still have bzm",
            "waitaminute~♪",
            "Sad of OG",
            "We don't even comprehend how much we need this team to happen. Imagine something like this becomes reality, I'd BatChest like there's no tomorrow. How do we include Rtz for NA boys tho? Rtz in and someone to coach spot? xD",
            "somehow , kuroky still make it into the team pog",
            "1. Nigma\n2. Falcons\n3. Quest \n\nWeird that I have to state the obvious",
            "Real and selfrespecting 'hatewatchers' don't want to see them out on technicalities, I'd be mad and blueballed if they got DQ'd. I want to be entertained with their inexcusable suffering losing in Dota, not outside of Dota. xD",
            "ammar got top 4 in bali major with quest that year\n\nthen he got kicked cause of contract but he would have qualified to ti that year with quest cause they qualified with malik anways\n\nhis only bad time was in nigma . \n\nfking ironic is that his brood ( zoo hero ) was scary in bali",
            "I may have heard that Jacky hasn't received his full salary yet..\nI think it's also the main reasons why dj and misery leaves.\n\nBut im not sure, there's no concrete evidence yet and only the casters in Filipino channel are the one mentioning it so yeaah..",
            "they basically did the handshake contract with the owner of tnc kekw",
            "as offlaner",
            "Bcos that may be the best they can do",
            "Based and hatewaterpilled",
            "I see. Thanks for this tidbit. That stinks then."
        ]
    },
    "OG Denied request to use standin for TI quals. ": {
        "title": "OG Denied request to use standin for TI quals. ",
        "score": 479,
        "url": "https://i.redd.it/iaccyskge28d1.png",
        "content": "",
        "num_comments": 120,
        "comments": [
            "This is some pretty important context that was missing from the other threads.",
            "OG \"go one season without causing drama over rules\" challenge",
            "Can someone explain to me why the issue with a standin is so controversial? Fresh to the pro scene of dotes. Was there a big controversy before wuth teams changing rosters mid tourneys?",
            "I mean Boom changed 1 or 2 players and they were forced to play open quals despite being 2nd or 3rd best team in SA.\n\nOG could have done the same..",
            "yeah its for CLOSED QUALIFIER  \nif they change the roster ,they have to play OPEN QUALIFIER",
            "I wonder if this is because the request for a standin was after the roster locks? DOTA 2 tourny + drama + og, name a more iconic trio.",
            "Feel like this sort of thing has been an issue in esports for years. There’s always going to be sickness, visa issues and family emergencies. Unless teams are going to start keeping reserves on the payroll, can’t they relax the stand-in rules across the board? Is the concern that teams are gaining an advantage by playing with a stand-in?",
            "Ceb in the lobby, all this OG drama for nothing",
            "So OG should make a new team without their captain 1 month before TI qualifiers because that person “may” miss 1 or 2 games because he is about to become a dad? Wow! Most fair rules ever",
            "I would suggest the poster review the title more carefully to 'OG claimed to be denied the request to use standin'.",
            "They can very well opt to play oq like 1000 other teams",
            "The answer is, to me, misleading. What qualifiers were they denied ? Closed ? Open ?  \nWeeks before they started meaning ? Before announcements, before the teams lineup was finalized ? \n\nVolontarly misleading stuff like that to make your side sound better is... unprofessional when sending poo at a TO.   \nDo better.",
            "Isnt unfair for the stand in though? - if they did qualify but the stand in wont play in the TI",
            "Okay so, not a dad nor a dota pro player, maybe either of the two can chime in. But wouldn't you just want to spend time with your wife and child? Like even if OG qualifies, Ceb would have to spend a quite some time scrimming and playing the main event, right after his child is born.",
            "Don't hospitals in France have internet? /s",
            "Swap OG for 1win, then call it even. They robbed 1win off a tournament slot earlier this year because of the rulebook too. Rule for thee not for me.",
            "yikes dude, your tourney rules are above someone’s child being born. that’s kinda ass.",
            "I actually think the rule SHOULD be changed mid tournament but it should be changed to be harsher. \n\nCeb should be tarred and feathered, n0tail should be shackled in irons, and the other members of OG should receive 80 lashes if he does not show up for the game.",
            "The issue is that if they compete from the open qualifier with a stand-in and then win it, they could use stand in closed qualifier with lesser match restrictions, but since they are invited to closed qualifiers and choose to play closed qualifiers directly, they were not allowed to use a stand-in and only from the pressure from org and pgl did they allow a single match stand-in. Tbh I don't think they were gonna qualify either way to TI and just wanted some traction along the lines we could have it didn't happen that way or what.\n\n\nThey could have gone through open qualifiers with Ceb itself but since they came through closed qualifiers they would have been able to use more substitutes in closed qualifiers. You can't have it both ways.",
            "Looks like their only option was Open Qualifiers, which ironically they used to win TI",
            "lol OG trash team with trash players.",
            "I think teams should be allowed to substitute for a limited time at any time. Regardless of the reasons. It will bring fresh blood into the scene and it decreases the risk of pro players burning out. In football, I believe the standard rules are 1) the sub/standin can't play qualifiers for other teams, and 2) standin's have to registered before the qualifiers start. It's working pretty well in other sports.",
            "honestly bzm deserve the L for being so arrogant to slacks telling him fkoff for wishing him happy birthday. karma served )",
            "And OG making it more vague by not specifically stating whether the rejection was for Open Qualifiers or Closed. And I can say that it is the latter.",
            "There is nothing missing. You can register with a standin, you just compete from the Open qualifier.",
            "not really, it's in the rules to not have standin, they either play with ceb or someone else entirely for the entire tourney uincluding TI",
            "(IMPOSSIBLE)",
            "Normally stand-ins are allowed for one reason or another (eg. sick, visa problems, etc). There are many tournaments where people suddenly switched 1 player during the tournament. For example, a year ago GH subbed in for Boxi in Team Liquid, I forgot which tournament tho. \n\nPGL's rule is strictly no stand-in (afaik), which is controversial coz you can't use a back-up for emergencies. They say it's precisely to prevent team roster changes mid tourney (to gain an advantage I suppose).",
            "Yes, but that would have meant Ceb not being able to play at TI. Basically OG wanted to play with their actual roster and were hoping the birth wouldn't cause issue for the 5 or so days the qualifier actually was ongoing.\n\nJust shitty timing for such an important life event. Personally I get both sides, and feel like medical emergencies should qualify for letting a stand-in play. That is said as someone who knows how important it is to be at the birth to support the mother and also doesn't think that we should encourage penalising people for having a life outside of the game",
            "?? No we’re OG - the kings of main character syndrome so we’re just going to take the risk and then pretend we’re treated unfairly ",
            "Trying to cheat the system then use their fanbase to force pgl to submit .",
            "Completely different situation \n\nOG didn't change players, they had an emergency",
            "Then Ceb wouldn't be able to play at TI. If they were to be allowed to play the open and closed qualifier with a standin and then Ceb could re-join I don't think they would have an issue",
            "They’re talking about a stand in. Not a replacement.",
            "But that would mean elite OG had to play some plebs in OQs. Can't have that. Let's just ignore the issue and hope rules won't be enforced properly because we OG. And if they try to enforce them, we'll use our influence over dota2 public scene to create drama and outrage trying to pressure PGL to break the rules for us anyway!",
            "That also means they play for 1 spot instead of 2, for some unknown reasons.",
            "This is them trying to bend the rules, not like ceb wife unexpectedly get pregnant a month ago. If we believe this story then they conveniently wait for everything to closed and only then try to aproach pgl. Assuming if they are talking about open qualifier",
            "Playing with a stand in doesn't necessarily meant an advantage straight up, more so if the stand in being called just days beforehand. The draft would be different, play call would be different and so on.\n\nBut even with that in mind, some team do gain success with some amazing stand in like, liquid with saberlight. And I don't think payroll cut is any important for teams depend on the tournament, like TI qualifier. I think, PGL just afraid with seeing a lot of good name is free for stand in, so the rules added.",
            "Well it certainly is for nothing if this absolute pos policy gets changed in the future. Every major team sport has substitute players, dota should be no different.",
            "BZM threw so Ceb could be with his baby   \nWHAT A PLAY",
            "Bzm did all the 322 work so ceb can be with his son. Friendship so goated",
            "Like it or not, those are the rules, and they were cognizant of the rules months ago. Obviously the rule is garbage but PGL needs to stick to their guns this year and make a change for next year otherwise other teams will ask for special treatment too. Sucks for OG but that's life.",
            "+, i thought og is the one who refused to at first glance",
            "But then Ceb would not be able to play at TI if they qualify. Roster change is not the same as stand in.",
            "standin would get paid instead of watching from sideline and it isnt like he would sign without knowing terms and conditions. and most importantly it gives him exposure",
            "yep, where was this holier than thou statement when they benefitted lol. OG are just entitled brats",
            "Doesn't matter, you can't play with a standin, you have to permanently change your team (well at least until TI)",
            "The bigger issue is how many people just assume that OG fucked up showing their biased hateful and spiteful stances, portraying it as \"objective discussion\". \n\nTurns out PGL are shit, what a surprise.",
            "Then it is not a stand-in but a roster change which is a different matter?",
            "You can't play the qualifiers with a standin and then the main event with your actual roster. That's what the tweet is about.",
            "No, you can't.",
            "Harder than No Damage Randomizer Run in Elden Ring",
            "Thanks! Definitely seems a little weird to force them out of competition just because of a singular player needing a standin. I can understand their worry for someone just switching out a roster but, idk, something like that would be pretty snakey obvious maybe? If PGL are the only ones being this strict it seems a little wild to me. Figured something like this would have been a product of someone previously switching majority of their roster before.",
            "Re: shitty timing for an important life event.\n\nWelcome to life with kids.",
            "I mean if he wanted to support the mother he wouldn't spend the immediate weeks and months after childbirth to prepare for TI.",
            "Medical emergency for wife, ceb doesn't need to be there, he just wants to be there, it's different, and this tournament has a rulebook that is agreed upon by orgs and players when signing up. Not good when you agreed, then tell the organizers to change it in the middle of the tournament.",
            "If we want compare sports and e sports we should treat players similar. They are multimilioners from which you expect to play. Life emergency is tough thats true but you unlikely to see professionals sport players quitting team if whenewer they are needed despite private life. Maybe opinion is harsh but this is the way I See it. Ceb is not holy cow",
            "And what about the other 4 people on the team who would love to have a shot at TI? Fuck them because if Ceb can’t be there none of them can be there?\n\nCeb will have a newborn at home. If it’s really this important to him he should step aside and let his team compete with a standin. As a father with a few kids if my own I couldn’t imagine trying to grind games and scrims with a newborn at home.",
            "Why would they allow something worse but forbid the mild version of it?",
            "They were obviously afraid that Bald would elim them in the OQ",
            "Didn't OG win TI starting from OQs?",
            "rosters were locked before closed qualifier dates were announced though weren't they? They normally are. \n\nYou can't predict when these things will happen 9 months in advance dude",
            "oh no. anyway",
            "Fair point. Still though I think it is still unfair as basically the stand in is playing to qualify for the biggest tournament yet somehow they wont play in it if they do qualify. I think PGL would allow them to compete if they changed CEb and not just a standin",
            "PGL was rightfully one of the most hated TOs for years, they dont magically change. The majority of the viewership begged Valve to never award them any official tournament again.",
            "No, PGL is in the right here, 2 teams in SA had also their invites revoked because of roster changes, but did go through Opens.\n\n  \nAt this point it's sadly clear that OG are trying as hard as they can to manipulate the narrative. They technically didn't lie, but they forget to mention \"Closed Qual\" because it wouldn't look as bad as they want it to look.",
            "How so? Ofc if a team changes roster regardless of reason they should go through open qualifiers, as the direct invite was based on the performance of the previous 5 players, not 4+1.. and just make it 3 teams going from open to closed best for all parties involved",
            "OG did fuck up, their request was against the rules from the start. They didn't ask to play with a different roster (which would be fine if they did before the lock), they asked to play with a stand-in which is not allowed.\n\nLiterally nothing changed from yesterday's statement, the only bias there is the people that wanted OG to have a different treatment from the rest.",
            "any team can go through opens. what r u on about",
            "So they could? Or could not?  \nWhat are the rules about this specific element?",
            "Amen to this! They are a blessing, but geez does timing suck sometimes when things happen 😂",
            "I think there's an important consideration that esports is now old enough for players to have children.  All major sports leagues have rules for parental leave: time for these TOs to develop specific policies, too.",
            "Username checks out",
            "Man you're a shitty person. If your wife is going through something like this you should be there for her. That's nothing to do with OG and everything to do with being a decent person. You're not one.",
            "I'm hoping that you have no kids yet and just oblivious to what the whole having a child situation encompasses for the father.",
            ">Life emergency is tough thats true but you unlikely to see professionals sport players quitting team if whenewer they are needed despite private life\n\nMate I don't know what sport you watch but yes you do. People have missed births due to their careers not because they couldn't leave, but because they're competitive psychos. You absolutely can and have seen players leave when their mum is sick, dies, births, weddings etc.",
            "You can have replacement and go through open qualis as theoretically different team. You can't have standin and then play with the original roster.",
            "Nah, they just didn't want extra trouble. Now they continue to play with seb after their pressure move didn't work. I guess dota more important than baby after all?\n\nWhat a bunch of sissies.",
            "They did for TI8",
            "But OG admit on their post that they are predict this is will happen 1 months ago when initial detail of TI qualifier is released. They saw there would be potential clash with the due date. They could use another player to replace Ceb before the roster lock on June 3. Open qualifier started on June 5.",
            "Yeah quite impossible 😂😂😂",
            "Either just play or suffer the consequences which what he picked the latter.",
            "Based on OG's statement, they knew about the rules in May and the roster lock was early June so they did have time before the lock.",
            "It’s not unfair because no one is forcing the standin to play. They either agree with the terms and play or don’t. It would be completely unfair if you held a gun to the standin’s head to play for the team.",
            "Clearly OG's fault for accepting to play a tournament organized by PGL, knowing full well how bad they are!!!!",
            "Og aren't changing the roster for gaining an advantage, one of them is having a baby, that's clearly a totally different reason than changing your roster due to performance.",
            "Not with a standin.",
            "The team that plays quals must play TI. OG as an org could have played with a stand in but Ceb would not be able to re-join the team at TI.",
            "I have no idea what I'm talking about but yeah, maybe!",
            "In a normal team sport a backup would take over for a game, not essentially a free agent who isn't part of the team.\n\nMost similar to this would be something like a tennis tournament. If someone can't play that day of the tournament, they forfeit.",
            "Ok OG fanboy.",
            "hundreds of people cant change their schedule for one guy who potentially may have a baby during a 4 day window.",
            "They'll never be in that position, so they won't need to worry about it.",
            "Yes he absolutely should be there. Not just for his wife but for himself to see his own child. That said, Og is going to have to face the consequences of that.",
            "Nah, if I sign an agreement, I'd read it, and if I know that the birth day of my child clashes with the said terms of agreement I'd walk away beforehand, not holding 4 other people off their chance of getting to TI. Not signed it then complain and ask for lenience, or do it before I signed the agreement.",
            "NBA playoffs, sabonis missed a game for his babys birth this year for example.",
            "People’s jobs are more important than Ceb’s baby yes ",
            "How do you play TI qualifier without going through PGL? Dumb take here.",
            "no not a stand in. they have to play without ceb and with a new pos 5.",
            "You need to play with the \"standin\" throughout. People did it in SA, the kicked a player on Boom.",
            "Does taking a stand at the very begining would have force them to drop their spot and go through open-qualifiers?",
            "It is just about letting them play with one willing stand-in for a couple of days lol it will not impact anyone else",
            "i'd argue that calling a chance to play at ti \"more important than a baby\" is a wild statement but go on",
            "Also OGs well being more important than spirit of fair competition, since they tried to weasel their way out of playing by the rules. Didn't work, so it turned out that seb *can* play after all.",
            "Sarcasm mate",
            ">no not a stand in.\n\nOK so I'm right and you're wrong. Just to be clear.",
            "That's called a roster change.",
            "I don't think making a fuss about rules would itself be grounds for DQ. You'd hope not anyway!",
            "Replacing Ceb before 3rd of June would keep their direct invite. Replacing Ceb after 3rd of June would lose them the slot (having to play Open qualifier). Stand-ins are not allowed to play multiple days in any situation.\n\nOG decided to go with the 3rd option.",
            "I know it would be better if there was a standin but it has been abused and orgs and players lie, and it is also unfair for the opposing team, as they would have to change their strategy and prep time.",
            "You ought to learn how to read before you reply \n\nIt’s not ceb’s show, all teams prepare all year for this event. For all of these people the tournament is far more important than ceb’s baby. In fact, I’d argue not a single one of them give any shits about his baby \n\nPeople miss out on their kid’s birth for far less amounts of money",
            "Yep. Classic og",
            "Ok my bad. You can take mine as sarcasm as well mate.",
            "Thank you very much for the explanantions.",
            "Most teams would prefer to play against a stand-in that hasn't practiced as much with the team rather than the main roster. Also, it is very easy to proof and hard to lie about the birth of your child",
            "Lol. Sure.",
            "i mean for other cases, not just for Cebs. someone will cite medical emergency and ask for exceptions"
        ]
    },
    "Sneyking's Full Statement on PGL's Decision About OG": {
        "title": "Sneyking's Full Statement on PGL's Decision About OG",
        "score": 629,
        "url": "https://www.reddit.com/r/DotA2/comments/1dlmvta/sneykings_full_statement_on_pgls_decision_about_og/",
        "content": "The situation between \n@OGesports\n and \n@pglesports\n where OG is presented a disqualification from the \n@dota2ti\n quals if \n@Ceb\n is not able to play tomorrow is justified and should not be changed. \n\nOG sees that the rules do not allow for stand-ins for this tournament and understands that there is a chance that Ceb's wife will be giving birth during this tournament which would create a scheduling conflict. In which, they had asked the tournament organizer beforehand for an exception for Ceb's special case in case of his absence. In which PGL responded with an One Day Stand In exception for the team. You can argue whether this was sufficient or not for this special case as probably more stand in time should be allowed. However, no other team competing in this tournament has had this exception made for them as far as I know. \n\nChoices were given in advance for OG to play with a stand-in in Open Qualifiers or take a chance with Ceb for the Closed Qualifiers. OG has to own up to their OWN decision on bearing the consequences as OG fully understands the gravity of the situation and decided to compete with Ceb as a part of its 5 man roster anyways. \n\nFast forward to now, that this foreseen possible scenario has come to be with the birthing of the child in conflict with the competition. In which I want to congratulate Ceb for his child and commend him for prioritizing this special moment over playing the qualifier. However, OG is only now publicly voicing the problem of the inflexible rules of the stand-in situation after the fact. \n\nWhile I do agree that the rules do not allow for stand-ins is silly as emergencies do happen and stand ins should be allowed in the event of an emergency. However, the time to change such said rule is not now. It should be done before the tournament has started or after the tournament has concluded for the competitive integrity of the tournament. If rules are allowed to be changed in the middle of the tournament at the whimsical of a team's wishes, what would be the point of having rules? As all teams and players should play on equal footing and be treated the same. That is what gives meaning to competition. \n\nI would applaud OG if they were to stand up for this problem before or after the tournament. But the fact that only now OG is publicly bringing up this issue while facing the possibility of being disqualified by PGL is an attempt to strongarm and pressure PGL with its vast fan base into complying to the wishes of OG and allowing further exceptions to be made for the team. Competitive integrity should not be compromised for a team that has already been granted unfair leniency due to the given circumstance. \n\nIn the future, I hope that tournament organizers who do not allow for stand ins to change their rules to be more lenient so that these extraordinary circumstances can be covered.\n\n---\n\nSource: [Sneyking X](https://x.com/SneykingGaming/status/1804357316550234470)",
        "num_comments": 357,
        "comments": [
            "OG should be disqualified and the rule should be changed for next year, it's that simple, isn't it?",
            "Ceb should be dqed for putting nigma in lower bracket. it's all cebs fault my king's got eliminated",
            "I think that the rulebook for these situations is downright stupid and close to inhuman.\n\nI also think they should have raised this concern publicly before, because obviously PGL is too fucking stupid to change the rulebook when they were approached about this months ago.",
            "the rules are dumb but changing the rules mid tournament is smh",
            "I mean, ceb had sex on september. Most dota players never had sex at all. He should pay.",
            "“an attempt to strongarm and pressure PGL with its vast fan base into complying to the wishes of OG and allowing further exceptions to be made for the team”\n\nThat is exactly what they are trying to do. Thanks Sneyking for saying it outloud. Really shameful for such a big team to mobilize their rabid fanbase like this.",
            "Only 1 TI after all",
            "Agreed. Absolutely do not like how OG always try to sic their fan base onto organisers or other teams when the rules don’t favour them.",
            "Good statement.\n\nCeb should take control and give birth himself so he can play in the qualifiers.",
            "I don't agree with Sneyking that this is OG's fault for not speaking up now. Namely because it's not an easily foreseen circumstance that the wife of one of your players will go into labour during the competition. Why does he characterise it as an OG powerplay when he agrees that it's not a good rule fundamentally? Is the onus not on each team to have failed to give critical feedback on this rule beforehand?",
            "Amazing take by Sneyking. Definitely, the PGL's ruling is super idiotic, but the moment to criticize rules is before or after tournaments. Who knows what sacrifices players from other teams and regions did to comply with the no stand in rules to just have them changed mid tournament",
            "Man people were mad at me for saying exactly this lmao\n\nIt's a fair request but mid tournament the rules need to be locked or the whole thing is just a circus. I wanted to know about this before the games got started.\n\nOG made a bet and got burned. PGL should not be held accountable for this, but absolutely need to change the rules for the future. Like a pre designated sub who cannot play for any other roster and is entitled to a share of prize pool or something. Or hire designated subs if they want to see if there's a way Ana or someone else can jump in for any team if needed. Idk what's best but there's possibilities \n\nReasonable take from Sney, I'll be honest the TI9 OG run got me into Dota but they have a really bad habit of being short sighted and then siccing their fans on TO's to get their way which pisses me off. They were fine quietly qualifying to Riyadh because 1Win was 6 hours late with visas on the weekend, but not cool with the TO rules when they made a mistake",
            "Fair take. Dumb rule, but it would be unfair to change it now. It’s really that simple.\n\nAlso, to all the people saying “that’s not how real life works,” you’re delusional. Stop comparing your 9-5s to an elite Dota tournament. There are many sports/competitions that don’t allow for substitutes. And those that do normally come from a pre-determined/pre-selected pool. It’s absolutely the case that teams get fcked over when injuries happen—that’s life",
            "Can’t even go to your child’s birth. Damm! Promoting next level addiction",
            "As far as I am concerned we are all just humans trying to live out sometimes painful stressful existence and we should all be understanding compassionate and helpful keeping priorities straight so if a man gotta go be with a new baby being born that’s just something that should be met with love",
            "OG had always had a case of main character syndrome.\n\nThey had so much noise made for ppd coaching case.\nSo much drama for EG rivalry.\nOpenly abusing in games.\nLosing their mind over secret tweets.\nAnd then they have victim card up somehow.\nBunch of neck beards.\n\nStopped being an OG fan after TI9 disband.",
            "Sneyking stating facts.",
            "We were denied the option to participate to the Qualifiers with a standin despite requesting it weeks before they started.",
            "It's a stupid rule, but it doesn't make OG look good that they are complaining about it just now.\n\nQuestion is, did they contact Valve to try to get the rule changed?",
            "This boils down to should rules able to bent in extraordinary cirumstances. To which clearly the answer is yes. (Just look at extreme cases)\n\nIs this case extreme enough? No I don't think so. Should there be a rule change after? Yes definetly. Every woman will agree that this shouldn't be a thing.",
            "I fully agree. Rules can be bad and stupid but we cannot set precedency for breaking it.",
            "If you agree that the rule shouldn't be in place, then there's no reason to follow through with the ruling at all, other than spite. \"However, no other team competing in this tournament has had this exception made for them as far as I know.\" Has any other team been disqualified for needing a stand-in due to an emergency yet? Pretty sure they haven't, just because the rule hasn't had to be used, it doesn't mean that OG are seeking preferential treatment.\n\nIt's disappointing to see so many people eager to point fingers at OG instead of PGL. Because yet again, PGL's poor management of a tournament is going to be affecting both the players and people who want to watch it, they're a complete joke of a TO, who have already allowed match fixers to play in the SEA qualifiers (and we got some dodgy games because of it) and have for some reason decided on a ruleset that I don't think I have ever seen applied to any other team esport.",
            "This “Dumb rule but unfair to change in the middle of the tournament” is a very bad take. Rules such as these are only a means to protect players against arbitrary kicks and induce fairness in competitions. These rules shouldn’t become ends in itself. As things stand, OG only is weakened with a sub and they’re literally playing without their brain/captain/shotcaller. This condition to force ceb to play should be waived off and valve should step in. There are several principles at play in here, and these rules would be against any labour laws in any country. Just because dota players are degens doesnt mean we should rob Ceb off his once in a life moment. Hope better sense prevails",
            "Bad take. Also 24 hours is a joke. 48 minimum for child birth. Doesn't matter if it wasn't offered to other teams. Were you having a baby? Nope.\n\nThe point of having rules is so that you maintain competitive integrity. But also rules aren't always perfect and don't always accommodate for every possible scenario so its up to us, as humans, to judge the scenario as being worth having an exception made for it. In this scenario, its obviously morally correct to give them an exception, its a fucking baby. Get over it you dork. \"Ceb being gone for a qualifier match is ruining the competitive integrity of my dota tournament!!!!\" The only competitive integrity being lost here is OG's chances of winning a series, because they are using a stand-in instead of their typical player.\n\nSimple real life scenario where real people work real jobs in the real world. Security Operations has rules that define proper security across a company. Updated dependencies, safe network configurations, the use of VPNs, etc etc. Guess what? There exists these things called **exemptions** that people will file to the security team, explaining why they can't implement some security function, whether it blocks key functionality for the company, or an individual; and the security team can approve these.\n\nWow amazing, a rule was in place but someone had a reasonable point of why they couldn't follow the rule due to circumstances they can't control, so it was allowed to be broken because we are all human after all :)",
            "I disagreed with his first statement, but I agree now that he elaborated.",
            "OG is notorious for **manipulating and gaslighting** the media and press for preferential treatment. This was just one of many of their disrespectful and unfair attempts mid-tourney. The lack of integrity and competitive sportsmanship is truly disappointing.",
            "If you have a family emergency and couldnt enter the tournament, on top of that u knew the risk, just accept you fucked up your team ti and dont blame PGL. Welcome to play next year.",
            "fully agree with him on that. i had the exact same thought after OGs statement - they took the risk, they suffer the consequences of their actions.",
            "At this point og and og fans are just playing the victim card and trying to pressure PGL. Maybe next time just dont join the tournament if you dont like the rules",
            "Finally a sound opinion! I really didn't understand the bandwagon behind OG on this one.",
            "Not sure why Sneyking is talking. eSports should grow up. Ceb shouldn’t need an exception for the birth of his child.",
            "What an unnecessary load of absolute rubbish.",
            "A respective statement and one which I agree with",
            "[Sneyking RN](https://i.imgur.com/j0m65ze.png)",
            "Ceb playing = bad decision for his family and new kid.",
            "if ESL is the organizer, they would find a way to kick out 1win and replace it with OG",
            "Mature take from Sneyking, which I totally agree with",
            "Was og supposed to publicly talk about ceb’s wife potentially having a child around ti qualifiers months back? It’s a private matter, and anyone would rather not bring it up if possible to avoid it.\n\nI don’t understand how anyone would think that is reasonable",
            "Why not just allow standins? It’s almost always going to be worse for the team using standin anyway.",
            "Seen people say how this situation is on OG because they should have seen this coming. But the rules don't even allow standin if a truly unforeseeable accident/incident happens (Topson falling down the stairs example from other thread), which is completely fucking stupid. This entire thing is 100% PGL's fault.\n\nBeen rooting against OG since Monkey Business days, but I'm not gonna blame them at all for trying to bend the rules or pressure PGL. If this happens to your team a lot of people would be singing a different tune.\n\nPer the rules OG should still be disqualified, but criticizing them for trying to save their asses because of bullshit rules is a bit unfair considering how everyone would do the same when it happens to them, and the rules are a fucking joke. \n\nFuck PGL, you guys are clowns.",
            "Damn, there are some cynical people in here. Y'all need a hug. Here, have one 🫂",
            "I don’t understand this whole mentality of “rules are rules.” Rules exist and are amended all the time. Who cares if it’s the middle of a tournament? Professional careers and a huge personal life event are at stake. \n\nIt’s not like changing this rule would really affect any of the other teams in a tangible way in this qualifiers. If it can help a team play to their highest potential, regardless of who they are, shouldn’t we try to support them? This is the very essence of competition.\n\nEven so, OG are wrong to be so combative in their approach, but I think it’s fair to contest the ruling of this matter. I don’t see any downside of letting a team continue to play with a stand-in given such an emergency like this.",
            "Ceb is playing.. Just announced",
            "Yall saying rules are dumb but when it was first released no team decided to speak against it?",
            "Sneyking is trying so hard to be ppd except he doesn’t has charisma and the salt.",
            "\"Its stupid and should be changed but not now because rules are rules...\"\n\nSo he is saying please change it because it could affect me, but now it doesnt so whatever.\n\nCant really take the logic seriously. And why is he even taking a stance.",
            "I mean you know it is still a job and your profession. It's a 3 hour competition today and 6 hours the next day if they win the first series tomm which is actually a normal day job which can even go on for 7-8 hrs and he committed to it knowing his situation like sneyking said and the situation is really understandable but he needs to show up for the team they're depending on him it would be really bad and in a way be selfish if they really drop from the competition I think they performed really well so far and deserve to go to TI.",
            "There's nothing valid about this criticism at all lmao.\nSneyking is no lawyer nor PGL admin. He has no business even mentioning this issue. He should have waited for the qualifier to end before expressing himself.\nThe very sole reason he uttered any word on the topic is because Ceb is very unpopular (not to clearly say outright hated) by a large portion of the public.\nWould have it concerned literally any other player, everybody would legitimately appeal to PGL to let him rest on this extraordinary occurence. Because we're human beings and not hardcoded heartless robots.\n\nNo idea why Sneyking would chime in on this and risk the now well established dota karma to bite him in the ass before the two biggest events of the year.\nGood luck to him, may he not find himself in need of any rule exception in the future.\n\nProperly unbelievable. Again, anyone but Ceb concerned by this, this message would have rightfully come off as incredibly douchy and lawyeristic.",
            "Maybe it’s time to introduce 6/7 men Dota: 5 players + 1/2 on the bench. Players have a life, too, like any other job.",
            "I dont even like ceb or OG and still think this is stupid. Literally just let them play with the standin",
            "Do not get this take, it's clearly an unavoidable situation, just let them play with a standin Like it's not difficult, calm down and let them have a go.\n\nWho benefits? \nThe team, the viewers, the tournament, everybody.\n\nIf banned, who benefits?\nNobody\n\nSimple mate",
            "https://x.com/SneykingGaming/status/1804316210416488455\n\n\nWeird Take?🤷🏻\n\nThen why complain by posting an essay?😂\n\nHe could have just kept quiet and let PGL decide..",
            "Sneyking needs to chill the fuck out. He is not an authority on organising tournaments / qualifiers and their associated rulesets. He's a degenerate dota player weighing in for no good reason other than to placate his own ego. His post is nothing but pretentious wank.\n\nRules exist in our world, yes. But rules are almost always covered by discretionary exceptions or considerations. To act like they're words of god that must be followed to the letter even if it results in inequitable outcomes is nonsense. It's completely removed from reality. And only a fool would argue that.",
            "Why is it on pgl to make the rules? Isnt it a TI tournament, shouldnt valve be in play here?\n\nBesides that, why is Sneyking so invested in this? Did Ceb fuck his gf or something? But seriously its pretty apparent Sneyking does not like either OG or Ceb. There is no reason to be this invested over a team using a last minute sub because of a childbirth.",
            "Has falcons been losing scrims to OG or something? I don't see how or why sneyking needs to do what he is doing",
            "Mate they got bigger issues such as throwing matches for gambling that this BS",
            "I don't get why he cares so much in this particular case",
            "don't teams usually play worse with a stand-in? why would another team be worried about extended stand-in usage?\n\n\n\n\nPrevious TIs had sunstitutes registered for each team.",
            "LMAO this thread sounds like they never had a fucking child and it shows. Professional rules be goddamn when you can’t even be allowed to get paternity live which is basic right",
            ">I would applaud OG if they were to stand up for this problem before or after the tournament. \n\nSo he *still* did not read the statement",
            "I dont think og tweeted for their fans to ask for an exception but just letting people know, or atleast not the main reason, lets just hope ceb can make it",
            "Sneyqueen",
            "What a ridiculous and out of touch statement by Sneyking \n\n\"Whimsical of the team's wishes\"\n\n\"No other team competing in this tournament has had this exception made for them\" \n\nYeah, no kidding, Sneyking! What other team has had a player's wife giving literal birth to a player's child? \n\nWhat better time is there to change a silly rule that has no real place in the tournament other than to disqualify a hard-working team's efforts just because real life happens?\n\nHow exactly is the tournaments \"integrity\" being affected by admitting that a rule was not written with every scenario in mind and that things could be done in a better way? Especially when talking about the literal birth of a child. As if this is something that happens often.",
            "He's taking a pretty hardline stance on competitive integrity but I can kind of understand his point. I do think it's pretty slimy and fake that in the middle of a post basically shitting on an org that Ceb is a co-founder of, he throws in this weird insincere congrats. Feel like we see a lot of this in public figure media statements nowadays and it always feels gross",
            "It's not his first baby, he was fokkeng accidentally lot of girlfriends. And btw he must be there himself pull baby out of rosh pit?  \nMaybe he just hire standin for him in hospital",
            "The fact that a player now has to consider playing to keep their team in this tournament is IMMORAL. This is a profession for these players and no job should ever force this type of consideration on a person. The rules are wrong, so you change them. Not later, now. Competitive integrity is such a bullshit line of reasoning to go down because kicking a team for this is the EXACT lack of comeptitive integrity that should be avoided. Players should not have to choose between their jobs and families.",
            "Guys, it's not like they VAC or something ..they still have to beat navi.jr, secret/quest then tundra/entity at the loser bracket\n\nJust one stand-in (and they already lost) and you guys can't be forgiving for him being with his newborn for one match\n\nRules are rules, it's just a fucking game with barely 30k viewers. Also, since when sneyking the EE backup player became the voice of dota",
            "IMO people are focusing too much on whether PGL should create an exception favoring or not, and ignoring the fact that PGL allowed this to happened by having a shit rulebook. How hard can it be to have a rule stating that a player can be replaced in case of paternity, bereavement or proven medical issue? And why is this incompetent company allowed to organize TI qualis and TI itself?\n\nTo anyone thinking that the rules will be improved in the future: they won't and shit like this will keep happening.",
            "did ceb fuck his gf?",
            " Ceb just play the fucking game man. I work in a nicu and parents aren’t there 24/7. They will be in and out and do other things while babies in the hospital. I’m pretty sure you can step away and go home and pick up some take out and just queue up your 2 games and 2-0. Go back to the hospital. Within 3hrs",
            "I still think that rules are there to uphold competitive integrity, and this integrity is not breached because nobody gains an advantage here. Rules are rules but it’s good to remember their purpose.\n\nThats even how it is with the law, we decide on how the rules are to be applied one instance at a time. The reason we have judges is to apply the law on a specific circumstance, rather than just blindly follow how it’s written. And if it works for something so important as the law, I think it works for an esports tournament as well. \n\nYou even have this in car racing, the rule is you can’t cut the track, however if you have no other choice than to go off the track, you won’t get punished. At most you will be given a penalty which eliminates the advantage you gained. \n\nI think going forward every tournament should have a „rule“ which states that a team may be eligible to participate even if extraordinary circumstances force them into a position where a rule will have to be violated in order to play, as long as no competitive advantage is gained.",
            "Nobody gives a fuck when ukrainian players/teams cannot play for several reasons such as problems with electricity caused by Russia. The decision is obviously right",
            "Stand up for before? What the hell, this isn't a definitive issue that you can take to the council months in advance because you know it will happen.\n\n\nthis is a \"might occur\" depending on dates not known and should OG take it begging to the public masses and hope for enough pressure to change rules?\n\n\nNah, view it as a medical emergency (which it could become due to extra stress of the father not being present), show some ounce of humanity because you can and should and give cebdad 3 days with all the best wishes.",
            "To be fair, child birth is actually not that \"emergency\". It should be expected. That's why there's an estimate due date. I can understand if the child birth is 1 month earlier than the due date. I'm an OG fan but you can't blame PGL for this. Rules are rules. They allowed OG for 1 day stand-in. That should be flexible enough.",
            "The man wants to be present for the birth of his child. You're a seriously sick person if you have some kind of issue with that.",
            "[deleted]",
            "imagine you're Phelps and you request a standin when it's your turn for the 100metres singles because your wife gave birth.",
            "Means if a parent dies also cannot?",
            "fuck OG and their fans.",
            "This is exactly the time for the rule to change. In the statement they acknowledge that the rule is inflexible but then want to use this against OG. They say the rule should be changed but not until it’s affected someone for their benefit. This is not pragmatic and if they don’t change the rule now it would also be unfair on OG if they changed it after.",
            "It really is. It’s a bad policy and you change it, but not in the middle of the tournament/season. Especially because it was completely transparent how it was gonna be handled if OG chose to use Ceb, and that’s exactly how it’s being handled. It really does suck, but nothing about this has caught OG off guard",
            "Pretty sure Ceb is gonna play today, but its just sad",
            "yes but OG use their idiot fans to pressure PGL",
            "That's just stupid",
            "It is that simple. Rule dumb but cannot change dumb rule now. \n\nBut half the ppl in this thread cant seem to understand",
            "This is only an issue for OG because it happened to them. If any other player had the same circumstances, they would have the same sentiment as sneyking.",
            "It was never Kuro's mistake. All of them haters are wrong about my 🐐",
            "Should Valve have the teams redo their series in case it was a big fluke?\n\nNo disrespect to the other teams, I’m a firm believer that DQ-ed OG beating Nigma is a big fluke and robs Nigma of truly accomplishing what they are capable of.",
            "Pretty sure the reason it was not raised publicly is that both sides have more to lose from doing this and both hoped things would work out so there would be no rocking the boat.",
            "In some ways, the rules exist to protect players from being unceremoniously replaced with a 'standin'. \n\n\nAnd people who talk about veryfying such shit have no idea how much lying can happen. It's not feasible for orgs to sit and verify all these cases. \n\n\nOG should raise the issue. But the solution isn't as straight forward as, just allow more days.",
            "Similar situation with 1win team that qualified to ESL lan and got delayed visa and ESL gave them extra date 1 time, 1win only need 1 or 2 more working days because extra time in weekend when visa office not working and ESL said 'NO' then OG got invited to a LAN which they failed to qualify and then result in they got direct invite to Riyard (OG may fail to qualify to Riyard if they have to play qualifier in WEU, they failed many qualifiers this season).\n\nSo now same situation, PGL gave OG 2 options \"BEFORE The qualifier starts\" : you got 1 day stand-in or you change your roster and lose your direct invite to close TI WEU qualifier and play open TI WEU qualifier with how many roster changes you want. OG of course chose what they think better for them, keep close qualifier upper bracket spot (they already got advantage with a change of rule before qualifier starts but understandable because family is important and we are human, other team also wont complain about PGL gave them exception 1 day stand-in - This is already \"change of rule' favor for OG), OG agree and now when thing does not happen like OG thought (Ceb needs more than 1 day) OG who agree with 1 day stand-in favor for them suddenly change their mind and think this was not a 'Favor' for them at all, Favor for OG and their fans must be changing the rule 'Mid tournament' any time they want or its Inhuman...",
            "Alot of time, its also on the player too. Valve does meeting with teams every international. Why wasn't this ever brought up to allow a stand-in for the last 13 years? There was even a case with Fnatic and Era. Also, other players had babies. \n\nI'm guessing greed because I can imagine players didn't want to split winnings with another player who doesn't play",
            "I recall they have complained to PGL before about standins previously but they didn’t change the rules then and OG just got d/q was that when noOne was on the team",
            "Not that i disagree, but trying to slove issues behind closed doors is often way more efficient and creates way less animosity between the parties. They also kinda had to go public with it at this moment because it looks hella weird to just drop out this way.",
            "they did. they gave them 1 day. if u cant hack it then go through open quals and play with another 5",
            "The orgs should complain collectively against these rules before they accept them. \n\nIt is what it is now, work together to change them next year",
            "Subs are not a thing in dota. Not allowing standins for the most important moment in the entiere year doesn't sound \"downright stupid\" to me. It's not brilliant, but it shows a will to make better tournament competitivity wise.",
            "Lmfao INHUMAN\n\nWhat’s inhuman is playing pubs 10-3am while his wife is birthing his child \n\nOG fans are the worst",
            "No, its not. Rules are a means to an end and not an end in itself.",
            "The people blaming Ceb for his timing are socially inept. Trying for a baby can take months. Accidents can happen. Let a man cum in his wife without losing his job.",
            "i mean, i'm definitely not an OG fan and i still think this is dumb af pgl \"rules.\"",
            "Seems like OG tried to do it before the tournament but PGL being shitty with rules per usual OG go to the public to call out the shitty rules. They know well enough pgl wont change for this tournament but it will be talked about and the rules could change for next tournament.\n\nBut Yeah better to just keep everything status quo because fuck OG, they rigged ESL too btw",
            "That's the part that doesn't sit well with me, weaponising their fanbase. It's a shitty rule but it's still rules nonetheless.",
            "Almost as rabid as those who don't like them..",
            "I'm tired explaining to OG fan that tried to justified OG action. OG tried to give pressure to PGL to make it special exception for them and change the rule in the middle of the tournament. According to their statement on IG, they knew there will be potential clash with the baby due date, gambling playing with Ceb and won't replace it to another player. They also don't publicly raise this issue when they knew before that on may and choose to do this on the middle of the tournament. Now they give pressure on TO to make it special exception for them by using their huge fanbase.\n\nNote: if someone say \"but, the direct invited team can't make roster change\". Talon who are direct invited team change their midlaner on June 5. I don't know if OG misquoted the rule or not, but if talon can why OG can't?",
            "While I do love and sympathize with Ceb; the situation is definitely sucky for him. But he won’t be the first career professional to have to miss the birth of their child for work.\n\nAt least with the modern internet he can still support his wife with FaceTime calls and texting. Will not be the same and it sucks. But yeah",
            "Soon to be 2nd",
            "Funny nobody gave a fuck when 1win lose their spot when they were late to submit visa by 3 hours. People were shitting on 1win and calling them salty when they announced their official statement. OG happily accepts the rules when it favour them.",
            "The whole Cheater accusation began my team's deathspiral.\n\nI'm really happy to see others noticing and calling out OG:s abuse of public statements",
            "married a 2x TI winner and doesn't know how to share unit control smh",
            "It's reddit. Everyone's echoing what fucking ever popular at the present. \n\nOne day people mad that admin enforcing team pause limit, next day the same people mad that game was delayed too long and admins need to be more assertive.\n\nThe rule is bad, but it's been set, nothing can be done.\n\nGiving way to OG right now will only set bad precedent of how some big org could ask for special treatment.",
            "\"There are many sports/competitions that don’t allow for substitutes.\"  \nPlease name many team sports with 5+ players that doesn't allow substitutes apart from Dota",
            "Those arguing for subs don’t understand how underhanded these orgs are. Orgs from Western Europe may be more loyal to their players, but other regions don’t care as much especially since the prize money goes way further in those regions. Many teams would sign Ana or Topson just for the qualifiers if they were allowed to.",
            ">There are many sports/competitions that don’t allow for substitutes.\n\nWhich team sports exactly are you talking about?",
            "But then many players will abuse the new rule by having babies exactly during a tournament to replace themselves for 48 hours!!\n/s",
            "Did you read the post? They were explicitly given a choice and they chose the risky one. ",
            "in that case you just resign and let some other player have your spot. and everyone is genuinely happy for ya.",
            "Hell yeah, baby",
            "that's very nice and all, but one players time isn't more important than other players or staff. Why should Ceb be the exception? just because he is famous and has an army of fans?\n\nhow many other players have similar situations? do people working as staff at these events don't have their own personal issues or moments needing celebrating? Why should the world spin around Ceb and make exceptions for him?",
            "\"I actually feel offended when teams think they can beat us\" when they were getting trounced daily lmao",
            "Is birth of a child an emergency? Don't think its unexpected and such they should have officially had a stand-in for the open qualifiers as per PGL. \n\nThey were told what they could do well in advance, and chose not to. Thems are consequences.",
            "what do you mean against any labour laws.\n\nHe's allowed to have time off, they aren't forcing him to play in the qualifier.\n\nHe was afforded a one day stand-in, and if he didn't return, its completely fair, per the stupid rule, to suffer the consequences.\n\nIn the States, you have 3 months mat leave, if you decide to stay on it longer, you can get fired.",
            "Yeah, apparently France has 4 days of mandatory paternity leave after the birth of a child, but no idea where OG is based, there should still be paternity leave in EU, Would love for this to actually go to court so pro players would get some damn precendent for humane working conditions. If this situation happened in Euro's and some team was DQ'd for tis shit, there would be an unbelieveable shitstorm and riots.",
            "Better sense? On reddit? On a dota subreddit? In a thread against OG? Against Ceb? \n\nGLHF",
            "There wasn't this outrage when ESL followed rules and handed OG invite when 1win passed visa submissions deadline by 3 hours. Lots of pro players agreed when OG shouldn't earn ESL points that tournament. However,ESL play by rules allows OG to earn points. Did OG care when the rulebook favour them? \n\nPGL already changed rules abit in OG favour when they allowed standin for yesterday. By rulebook, they didn't allow sub even for one day. \n\nAs a result,  Aurora, IG, who were ahead of OG in Riyad points before that tour, needed to play in qualifier.",
            "Reminds me of when there was a power outage in the SEA region last year - like a fucking cyclone knocked the internet out and the teams have to forfeit. Does this make the competition better or fairer.\n\n100% agree with you - you can't make rules for everything and need to have some balance.",
            "Why do people consistently misinterpret the point? The point isn’t about the rules. Yes it is stupid and should be changed in the future. Key word: FUTURE. Why not now? Because the tournament already started, and OG already agreed to it by not making a fuss about it BEFORE the qualifiers and accepted participating the quals WITH Ceb knowing full well of the risk involved with him having a baby coming. They agreed to the rules, they prayed that Ceb’s baby doesn’t come at the worst timing, and now that it happened they cry about it? That’s the real problem.",
            "I'll ask you this one question, what if this situation was being faced by a not so popular team instead of OG. Would you or anyone have then called for an exception?",
            "Reasonability is off the table when OG and Ceb are involved.",
            "What a total pile of garbage. Man has baby so everyone has to bend backwards to accommodate him \n\nYour “simple life scenario” is also dumb af. This is a yearly tournament and playing Dota is their livelihood. Players put a lot of effort into it and it wouldn’t be fair for a team to be disqualified by OG playing with a standin miles better than Ceb. \n\nBringing a child into the world needs many sacrifices and this is just one of them ",
            "Your first take just says why it's crazy that they signed up with Ceb in the first place.",
            "The real joke is Ceb and OG choosing to act like asses instead of just skipping this tournament for Ceb.\n\nIf I'm having a child, I'm not going to do this kind of shitty gamble. And even more, I'd never try to bend the rules because a VERY FORSEEABLE EVENT happened.\n\nOG talked with PGL before the tournament. PGL was even lenient. OG still signed up with Ceb in the roster. And they cry only after they gamble failed? Such hypocrisy!",
            "Jesus christ. You're saying this same shit on twitter every 5 sec, give it a break. Sneyking has to call his CPO to make tweets and reddit comments like this lmao.",
            ">top of that u knew the risk\n\nthis is the biggest thing for me. like somebody else said, they gambled and lost. Is a baby an emergency, yes, but not the same kind of emergency like if somebodys family member suddenly dies or or is dying. They knew it was a possibility and still took the risk. They should have negotiated for more time or just not signed with ceb.",
            "Maybe don't register for tournament and screw over your teammates if you know there will be a situation where you won't be able to play for many days. They felt entitled, registered anyways and not that tournament orgs want to uphold the rules, OG are crying and using their fanbase to bend the rules for themselves.",
            "Lmao grow up how? Which fucking sport has a game postponed for a birth of a kid. In every other sport the game goes on and the player misses the game. The only problem here is not having bench players. Even counter strike has subs.",
            "rules are there, if it was to grow it should be changed after not mid tournament just to satisfy one team. OG went in knowing that if the baby comes during the tournament they can only use 1 sub for 1 day. they got it and now they want to use their fan base to try and pressure pgl to make it 2-3 days or how ever long they want",
            "OG is being very unprofessional. Not sure why you think it is PGL or esports that needs to grow up.",
            "[deleted]",
            "What with this stupid \"eSports should grow up\" nonsense LMAO. Esports players are sitting their ass and playing video games. That's why the rules are very different to other sports.",
            "It's not about allowing standins, it's about changing the rules mid tournament. If OG gets a second exception, what ground does PGL have if another popular team decides to throw their weight around? What if a coalition of teams want to change a rule mid tournament?\n\nThey're running a tournament and supposed to provide a fair and equally applied rulebook to all the players, and not just bend to the guys who have the most fans (and are willing to abuse that).",
            "It's dumb isn't it? Imagine if the NBA/NFL/EPL/ insert team sport here didn't allow for subs. If Tatum got injured mid game in the Finals the Mavs would want them to continue knowing how weak they were. \n\nI find it absurd that competitive integrity is affected if the team's captain is requiring a replacement.",
            "Because strawman specialist standin will come in and carry the game!! Or strawman \"player got replaced by standin and said nothing\"\n\nIn reality people just wanna lick the rulebook because they want to pretend theres some consistency in it and compare completely different scenarios.\n\nI bet they think the criminal codes they follow are insanely strict and precise as well and have no room for interpertation or ever any exceptions (kek)",
            "OG accepted the rules when they entered the tournament. Yes it's bullshit, but they signed for it.\n\nThe point is: it's too late. You don't bargain rules mid-tournament. It is ridiculous. It's even more idiotic because OG could clearly foresee this situation, and PGL has been lenient (they bent the rules to give 1 day to OG). Other teams didn't have this kind of favor.",
            "Yeah who cares if people strongarm the TO to overtake a big tourney with a life-changing prizepool? It's fair for everybody, am I right?\n\nOG agreed the rules. They discussed in May with PGL. They still chose to keep Ceb. Now they face the consequences of their gambles, that's all.\n\nIt wouldn't be fair to other teams to allow standins now.",
            "I don't think he's trying to be PPD. He's just voicing a perfectly logical opinion",
            "Sodium, atomic number 11, was first isolated by Peter Dager in 1807. A chemical component of salt, he named it Na in honor of the saltiest region on earth, North America.\n\nThere can be only one true lord of salt.",
            "You completely missed his point.",
            "Claiming it would be selfish to miss a dota game for the birth of his child is one of the all time most ridiculous things I've heard.",
            "He is one of the players at the tournament. He has absolutely all business mentioning this issue.",
            "Nobody wants it. You have to share the money with the bench. The benched guy also wants to play. Also, Dota has position. What if you bench a pos 5, but your pos 1 has a baby?",
            "I think most of the people on this sub overlooked that Orgs don't want to pay for benchwarmers that gets to play once every blue moon and players surely don't want to share their winnings with the subs.",
            "That's the problem with having a subreddit populated with children and people who rarely do things in the outside world. They don't see how many different threads are attached to one scenario except their own myopic hatred of a particular player or org. \n\nCeb not playing weakens OG. OG not playing weakens the qualifiers, loses viewers and revenue. Why does an organiser put forth a scenario in their tournaments which reduces the number of games played?!?!",
            "The simple logic to follow here is:\n\nIf even laws are subject to flexible interpretation and waiving by the enforcers (judges), then something as subjective as a tournaments rules also can and should be editable.\n\nIn this case the tournament organizer is the judge...simple as that. Follow the same rules of the consequences of the REAL world legal system. If a judge can decide to grant exemptions in situations as dire and serious as life ending judgments, I can assure the dota scene the world won't stop turning if the tournament organizer does the same.\n\nIt's a joke this conversation even needs to occur. It's a literal human being being brought into this world out of thin air. And a FIRST born at that.",
            "I don't understand why he feels such a burning need to make his thoughts known. It just seems weird honestly.",
            "Valve are outsourcing TI to PGL since at least 2016.",
            "why would sneyking like ceb lmao, ceb was talking shit about him for no reason before tundra won TI",
            "not the first time OG has pulled this. It'd be naive to think they have no hidden agenda lol",
            "I think the tone of the final paragraphs makes it clear that that was what OG was hoping for. Of course they're not going to explicitly say \"OG fans, go get the PGL staff.\"",
            "ure on something if u think they tweeted that tweet to not try and use their fanbase to pressure PGL to change the rules. if that was the case they can do it after getting disqualified then their fans can shit on pgl after",
            "Maybe just don't register ceb when you already knew this could've been a thing??? There's no point in crying when they have clearly taken a gamble and it did not pay off. \n\n\nThe integrity of the tournament will be affected if they make changes mid-tournament. Someone's wife giving birth is the same as not getting a visa in time. Neither are under your control and the TOs aren't obligated to bend over just because a team is big...",
            "When you neglected your job to a point where your family gets in the way of your job, you will have to choose between one of the two",
            "Imagine wishing horrible things on someone just because they don’t support your opinion? You are a HORRIBLE human being.",
            "If i was Phelps i would not be married. I would do all the illegal substances and jet around the world creating a harem of uber-swimmer babies equivalent to Genghis Khan's Mongolian dynasty where a few hundred years later 5% of the world population is related to me",
            "No bro. ItS iNn ThuH RuUUhHlEzZ",
            "Ain't no way he misses out on his first kid's birth",
            "#CEEEEEB",
            "Are you insane? Lol",
            "And sneyking now too I fear",
            "Yep, also redo bald series while we're at it. Actually, lets reseed this whole qualifier and start again.",
            "Definitely grounds for a do over while we're at it ceb should be investigated for allegedly using baby formula to boost his performance during games.",
            "Makes a lot of sense, yea.",
            "True true",
            "> And people who talk about verifying […]\n\nI suspect verifying that a public figure just became a dad shouldn’t be too hard",
            "Not to mention do you really expect players and teams to shittalk rules of a tournament and Tournament Organizer before they're a problem?",
            "The solution is to mandate that every team has 5 players + a sub in their registered roster for any tournament. There is no reason stand-ins have been allowed at most (all?) of the tournaments this year to a varying degree only for it do be disallowed here.",
            "Oh I assure you there is 0 serious team want to have a official stand-in in their team and it's not about greedy.\n\nWho would want to have a shitty sub player in their team who will only 2 or 3 games a year?",
            "That's old.g, div2 stack of ceb and topson. They have a lot of grievances against PGL but wcyd, the rules are there to protect players in the team and there's no exceptions in place for this current issue nor the issue they faced before. Teams need to start being attentive on rulebooks, because emergency happens and they can raise those potential issues before a tournament starts and a rulebook gets published ",
            "And who gets to make the exception?",
            "It’s not fair to other teams. The rules probably influenced how they built their roster and some might have avoided players with foreseeable absences during the season because they knew they could not afford to lose them during a major qualifier/tournament. Availability ist the most important ability. \n\nThe rules should be changed, but not in the middle of a tournament. OG went into this fully knowing that something like this might happen and now they’re complaining like little kids. It’s not mature and not fair towards other teams in the competition. Imagine if Dandelions needed a standin, do soy think we would even have this conversation or would they unceremoniously be disqualified?",
            "Creampies are against PGL rules",
            "Then why didn’t they make this statement before the tournament, immediately after pgl told them they wouldn’t change the rules?",
            "OG should have came out about this before the tournament, when it was still OK to change the rules.\n\nInstead they waited, hoping they will be lucky and won’t face this situation.",
            "Oh, that makes it OK then! They tried to do it the normal way, the decision was not favorable to them so now it's time to create public outrage and pressure TO to make a decision favorable to them!",
            "What's funny is Sneyking has to make this elaborate statement so his original comment doesn't seem to be personal.\nPeople have to hide their personal takes with flowery words of logic.",
            "Come back after 3 months",
            "If the only thing stopping your team from being in a death spiral is having a coach ingame then your team was never any good in the first place. \n\nThey took advantage of a loophole, the real cheating was the Furion skin bug.",
            "And then you get downvoted to hell cause you dont have a \"moral compass\". I dont blame ceb for choosing his kid but changing the rules mid tourney to favor one team isnt the way. Same OG that benefitted when 1win got disqualified and they took their spot",
            "That is an issue with how the sport is considered. RIght now, it is more like tennis doubles. If one person doesnt show up, ah tough luck you cant play. Ideally it should be like relay races or something where you can sub 1/2 players during the course of the tournament. Then the question comes, how much notice do you need to give to the TO/opposition, so that they can prepare accordingly? \n\n  \nI think (this is my opinion) till now, most of the teams didnt want to add the additional overhead of having a sixth player. It increases the preparation they have to do by a lot, since the sixth player can bring in new heroes/strats. It increases the operational costs. Anyway all these were supposed to be discussed in a teams\\` meeting with org/valve before or after the tournament. Preferrably when the rulebook is shared. Not when the rule book becomes inconvinient for you.",
            "So technically procycling, and it has happened that riders forfeited to go see their wife giving birth. But in cycling, a rider stepping out doesn't disqualify the whole team.",
            "Rowing",
            "Are there sports that would allow you to use a substitute that's not an official member of your team?",
            "Cricket",
            "Yes, I’m really going to waste my time defending your straw man. Lol. I especially like how you ignored literally the sentence after the section you quoted. 10/10\n\nName ANY team sport with 5+ players that lets you pick anyone as a substitute. Oh dang, KP got injured. I guess we can substitute Wemby right?",
            "You don't have to go to other regions \n\nFnatic.notail literally tried to use a standin to stealh replace a player that still wanted to play.",
            "Thats because there is no governing body to set rules about teams/tournaments. If we just rely on tournament organizers to just follow the few rules valve requires, we will always get wildly different rules from them because they are for better or worse independent actors.",
            "I think any time a dota player gets laid it’s a win for us all",
            "Thanks for the /s - your cutting Rick and Mortyesque wit would be lost on us peons otherwise",
            "They weren't allowed to have a stand-in for the whole quals so their other option was just to not play at all\n\nSource: [OGesports X](https://x.com/OGesports/status/1804392211125092634?t=O4mp414__do6h7GcZJETVg&s=19)",
            ">Is birth of a child an emergency?\n\nYES full stop. \n\n>Don't think its unexpected and such they should have officially had a stand-in for the open qualifiers as per PGL.\n\nThe birth of child seems to vary some but a 2-3 week window of when the birth happens seems to be the norm(not taking complications into account).",
            "Well they did somewhat strongarm Ceb into playing the qualifier, they requested to play without him significantly before the qualifier started to avoid this very situation and were refused.",
            "I mean at least in that case, it would make sense to outright forfeit/dq in that situation. They'd have zero clue of when the power lines would be able to get fixed, depending on which country and location they're from.\n\nIt's unfortunate, but not something they can avoid.",
            "You can have external power source back up and internet !!!!!!!!!!!!!!!!!!! You cannot control when someone dies or a baby is born",
            "They contacted pgl a long time ago and it didn't get sorted but might have up until a day or so ago. Valve has repeatedly told teams not to make a public fuss until they have to and making the fuss could have stopped pgl from changing their minds if they were going to. \n\nThis is the right time to be making it public",
            "There is no point being misinterpreted here. This viewpoint is an even worse take because you are admitting the exemption should be made and you are admitting there shouldn't be punishment in the future; but OG begrudgingly accepted terms given a limited time frame from an incompetent TO so lets throw morality out the window? Ya man, great argument.\n\n>Why not now?\n\nYa, exactly. Why not now? Why not make the exemption now, since your human morality can already see its the right thing to do?",
            "This should be an exception for EVERY TEAM. It's absolutely ridiculous that his livelihood and teammates livelihood is in jepordy because he decided to have a kid. The rules basically state that you shouldn't do anything to jeopardize your playing time when EVERYONE knows that's not how life works. If someone were to have a medically emergency and in return their team couldn't qualify because of it does that make any sense to you in the slightest?",
            "If this exact situation happens? Yes. Any team should get this exception.",
            "Yes, I would. I hate Ceb and OG in general.",
            "What an idiotic take! Kicking players for something that may or may not happen during a qualifier outside of said players control is not something the community should be encouraging. No wonder the Dota community is as toxic as it is.",
            "It’s kind of wild that you think teams should kick people if they are expecting a child during TI qualis. Fucking brainlet take. Pretty sure nobody would be suggesting any such thing if it weren’t Ceb. There would be endless outrage if it turned out that an org had done this to a fan favourite.",
            "The game isn't being postponed. Other sports have subs for parental leave.",
            "What are you talking about? This about OG being disqualified if Ceb can’t play. They have a sub. Yeah, every sport goes on if there is a family emergency. Thanks for making my point.",
            "If Ronaldo had to miss a game in the euros Portugal would play a different forward and he'd go back into the side when he's able to \n\nThey wouldn't disqualify Portugal from the tournament. That's the point. \n\n\nYou don't need a registered sub when you can get a stand in for a few games and be at a massive disadvantage.",
            "Wait who’s asking for the game to be postponed? Or did you just make up a boogeyman to argue with?",
            "More flexibile conditions might benefit one person today but other people tomorrow. See the long term.",
            "Its not to satisfy OG its to satisfy common sense.",
            "If you can't comprehend that rules are made for people and are not some kind of Absolute Law, then you shouldn't be discussion the issue either. \"Rules are rules\" is the most idiotic statement one could say, and yet",
            "The rules are bad and outdated. We shouldn’t even be having this conversation.",
            "During nazi Germany they had rules too.  \nGuess it's ok then since people were just following them.",
            "Other sports don’t move their finals if a player has a baby due.\n\nProfessional players either refrain from unprotected sex for a month which would align with their finals or they schedule a c section before the game. \n\nIf esports want to grow up then players need to make decisions for their family based on their career.",
            "Which rule are you changing? Allowing a sub? Does allowing a sub make OG better or worse? \n\nNo sport organiser should favor wanting walkovers and DQs. It is the dumbest fucking thing ever. They should want to make rules around allowing games to continue no matter what. How the fuck are you drawing eyes on the sport if you're DQing teams for something as stupid as substitutions? Do they not want the OG fanbase watching their streams? From a pure commercial point of view PGL seem like they're run by Kim Jong Un.",
            "Then what is the point? Rules are rules so thats it? Sounds like a pretty shitty way to run businesses but this is reddit so why did i bother",
            "Nope, he is corrent. Rules are only a means to an end and not an end in itself. They are here to protect the competitive integrity of the tournament and not punish ceb for having a baby. OG is only weakened without their shot caller, captain, motivator. So these rules serve no purpose here and only come across as inhuman.",
            "Lol ....U fail to see that it's his profession, but for U it's a game.. there's a difference. From your statement it's clear you don't see that way and it's not just any game it's TI qualifiers many lives and careers dependant here and also the biggest tournament of Dota. Would you say the same if Messi or CR7 were to miss world cup qualifiers?\n\nSneyking clearly states that it's not fair but he's highlighting that of should have come up with a solution beforehand but CEB has committed knowing well and he's playing don't think he missed his child's birth tho.",
            "He has no business mentioning this issue as a player, no. It would be warranted as an admin, or esports commenter at the very least, as this would be his job. But this is not and thank god never will be the job of competitors to comment about rules and other players situation. He should have talked with PGL directly if he had an issue with this, which I'm sure a lot of players respectfully did on their own part.\n\nHe has no business mentioning this publicly, needless to add that he obviously is wrong and rules are to be tempered with in the midst of extraordinary situations, and they have pretty much always been in dota and other competitive worlds.\n\nTo play with a standin on your qualifying games is nothing short of a handicap anyway. It's not like OG is getting a massive competitive edge because their pos5 misses two days and will be aboslutely exhausted for the last ones. It's outright ridiculous.",
            "Pay them if they play. I bet there are hundreds of people ready to do so.",
            "[deleted]",
            "Yep. It's perfectly fine to think OG don't deserve an exception; I'm sure many people do. The weird part is feeling the need to make a public \"statement\" when he is ignorant of the situation and clueless about tournament organisation. It reeks of ego and pretentiousness.",
            "That's not at all the same. It's not even comparable in the slightest.",
            "How has he neglected his job? He is literally a top level competitor. His job shouldn't be forcing that choice.",
            "Thank you for the kind words random nobody on the internet! I don't wish anything bad actually happen to anyone. It is a thought exercise. Enjoy your virtue-signaling, wanker.",
            "PGL and brains don’t work together.",
            "Walter White moment",
            "We never know. The mad man just a month ago was playing from 9-10 am to literally 3am in the night. Constant pubs. So yes ideally he shouldn't miss the baby but we don't know what he's gonna do",
            "can't he just watch the VODs",
            "[He didn't miss](https://twitter.com/OGesports/status/1804417675747094725?t=uAycfhmyrLOrTOivpZqY4w&s=19)",
            "well its his job, losts of ppl miss this omoments cuz of job",
            "The kid was born yesterday.",
            "https://x.com/OGesports/status/1804416401484005607",
            "Give the people what they want. Put Nigma against Team Bald on the first series.",
            "Unironically though, it do seemed unfair that everyone from open qualifiers started in loser's bracket.",
            "The issue isn’t this, but the fact that you can fake player having issues, while they don’t.\n\nWe had multiple cases of that’s happening. Damn, one team was disqualified from DPC in the past for **faking** medical documentation, claiming player was sick when he wasn’t.\n\nIt’s easier for PGL to verify in WEU/NA, but other 4 regions are a LOT more complicated.",
            "Unless you're asking for a paternity test or a doctor's note. Don't just buy everything you read online. \n\n\nI'm not saying anything about ceb here. But I've seen enough of the Internet to be skeptical about shit and people just blatantly lying for whatever reasons and going to extreme lengths. \n\n\nIf you've been lucky enough to not, bless you. But the world's not as straight forward as it comes across.",
            "The most straightforward solution is for coaches to stand-in for emergencies. They are mostly ex-pros and on the payroll already anyway",
            "You can do how F1 does with reserve drivers. Nominate one person that they can call up in case of an emergency. Could be their coach or even someone who is not in the tournament. Make sure there is sufficient time gap (24-48 hours) notice to the opposition team to ensure competitive integrity.",
            "Ya, most top level teams with commercials to their players would not want to use a stand-in. But, I can see a mid-level team that doesn’t speak English hire Ana or Topson as cores to “maximize” their chances to make TI.",
            ">Who would want to have a shitty sub player in their team who will only 2 or 3 games a year?\n\nI would almost guarantee you that any team would rather have a sub on payroll instead of having to forefeit entire tournaments incase of any kind of short term emergency.",
            "I mean other sports do this alrd. Your subs in a football team may be below average but it’s better than playing with only 10 men.",
            ">They have a lot of grievances against PGL but wcyd, the rules are there to protect players in the team and there's no exceptions in place for this current issue nor the issue they faced before.\n\nHaving to forfeit an entire years worth of work due to emergencies sure does seem to be a way of defending the players.",
            "It's funny cause Ammar said when he was a nobody in creepwave team\n\nThey needed one minute extra pause cause there was an emergency and admins said no\n\n\nSo if ceb gets an exception it will set a bad example. If you are famous you get exceptions if you aren't then f u",
            "Valve should ideally step in",
            ">Then why didn’t they make this statement before the tournament, immediately after pgl told them they wouldn’t change the rules?\n\nBecause resolving these kinds of issues privately seems to be way more effective and generates way less animosity towards the involved parties.",
            "They should have. No doubt. In the perfect world it should have been sorted between og/pgl/valve but they are all shitty in regards to communication",
            "Why do you think they would have changed the rules before the tournament when they contacted them prior to the deadline of June 3? \n\nPGL are notoriously shitty with rules, only reason it could change is because valve run ti and they could step in, but knowing valve they havent read the mail yet...",
            "They clearly didnt because they hoped they wouldnt have to or that pgl would realize giving then 1 day with a substitute is insane?",
            "Yeah. I don't get why he had to make this essay if he stood by his earlier words.",
            "!RemindMe 3 months",
            "That's what I mean... the entire (fake?) drama has overshadowed that they came second in the EU DPC before the updated rule, and smashed OG in a 2-0 a month or so before the TI after the rule\n\n(I remember that OG game because I made some lifelong enemies among the OG fans for the shit I posted in the game thread. 100% worth it haha)",
            "> to favor one team\n\nYou're saying that as if other teams would've used this privilege if they had the chance.\n\nOG using a stand-in would only mean they lose less than they otherwise would. Denying that would be right by the rules but in practice petty and opportunistic.",
            "\"Crews - In addition to the provisions of paragraph 2 a) of this Rule, in the case of illness of, or injury to, a member of a crew before the first heat, a substitution of that rower may be made in principle no later than one hour before the official start time of the race if a medical certificate is provided\"\n\nAccording to WorldRowingRules.",
            "There's not really any other sports where you cannot have any substitute on your roster.",
            "Allows for substitution if the players suffer concussion. Also allows a fielding substitute. Kohli literally went for his childbirth in the middle of a test match. Go read more",
            "What?? You can literally have a guy doing the running for you if you’re injured.",
            "Lol",
            "Thanks peon, ready for work",
            "lol...Ceb skipping coz of a child birth is fine. But a natural phenomenon where you cant physically play  due circumstances on which they have no control over is not fine?\n\nKeep in mind Ceb can actually play the game.\n\n\nOG and fans smg lol",
            "He isn’t admitting exemption should be made, he claims said rule needs to be changed for everyone (not just Ceb/OG). But either before or after the tournament, not in the middle of it.\n\nAgain OG could have came out with this issue to public BEFORE. They could have opted to play with standin for whole qualifier (like many other teams did in the past in similar cases) \n\nThey chose to bet on issue not happening, lost, and now actively trying to shift responsibility for their own actions.\n\n> Why not now\n\nBecause rules are not about subjective things like morality. They are to ensure everyone is treated equally and fair. Making an exception now will open the Pandora’s Box to all sorts of favoritism claims.",
            "Imo Just give og the exemption. Don't think they can beat tundra or entity again. No difference",
            "Redditors can't handle when people apply their moral compass consistently.",
            "People’s hatred for Ceb makes them have horrible inhumane takes. Fuck Ceb, he’s an asshole, this isn’t about him. He’s already won 2 TIs, to him this isn’t that life changing, but about about his 4 teammates? Getting punished just because his baby was born? I’m actually baffled people are trying to justify this as “haha rules are rules! Get fucked!”",
            "Other sports have subs in general. As in they have a fucking bench lmao.",
            "Don’t register if you know you are going to take leaves. OG & Ceb wants to have their cake and eat it too.",
            "ie change for next tournament. Not mid tournament when they already give them 1 day",
            "Then apeal for change of rules and talk about it publically BEFORE the tournament. They entered the tournament knowing the rules and agreed to 1 day stand in exception. Now that it wasn't enough they want to cry mid tournament and bend the rules.",
            "WHAT? Other sports have subs. Other sports give parental leave ALL THE TIME and players have a sub stand-in for them.",
            "Virgin detected. When grown ups try to have babies, most of the time it’s not that easy to get pregnant. You only have a 2-3 day window per month and sometimes women or men may have fertility issues and they might end up taking years to get pregnant. Maybe you should find housing outside of your mom’s basement before talking about adult matters.",
            "> OG is only weakened without their shot caller, captain, motivator.\n\nso now they not only have to excuse having a stand-in but they should also rate the team and their performance in order to do so?\n\nRank 1 stand-in? No. Rank 1000 stand-in? Yes",
            "I would absolutely say the same if Messi or Ronaldo were missing qualifiers. The birth of your child is a singular moment - what do you think Ceb would appreciate more in 30 years? Being there for a TI qualifier or being there for the birth of his kid?",
            "Competitors are absolutely allowed and should be allowed to ensure that the rules are followed by other competitors and judges. Otherwise it’s “however judge feels like today”.",
            "Ohhhhhhh boi, you're gonna be interested to know I actually do, considering I've been directly involved in over a handful of cases and judgments spanning a decade ;) . I absolutely do know what I'm talking about.\n\nAnd your entire paragraph just made my point. Every step of the way, discretion and judgment calls get made.",
            "> How has he neglected his job?\n\nBy failing to negotiate the rules before applying to a top level tournament and considering that he might've needed to drop out because of family matters, thus probably needing to register a standin?\n\n> His job shouldn't be forcing that choice.\n\nIt literally did\n\nToo bad",
            "That sentiment applies to most of this subreddit too.",
            "It's ok that was his second kid, nothing to see here",
            "Inb4 he sets up a pc and plays qualifiers from the hospital room",
            "It's not just about him\n\nThere are 4 other people who could have their lives significantly impacted by this. \n\nIf he participates, I'm guessing it isn't just because he's hungry for a 3rd TI.",
            "You can play Dota every day.\n\nThe birth of your child is a once in a lifetime thing.",
            "Not birth of child moments.",
            "Wow, what the actual f",
            "You mean the finals?",
            "It's fair, it's based on team performance throughout the year. Are you suggesting the balds should have taken the spot of OG or something?",
            "Notail himself as a part of Fnatic tried to change Era for TI a few years ago.",
            "Just like Xiao8 did during Covid TI?",
            "This is what I replied to in another thread. Most teams have at least a coach who's been a standin before, look at old OG and NIGMA who used their coach for official games. I did mentioned that every team sport has more than needed players as substitutes, injury or other commitments just come up, look at Ceb being a dad, VISA issues have been a problem since dota 2 started.",
            "And who will ensure that Valve makes good impartial decisions when they* put their own reputation on the line?\n\nAnd would TO be comfortable that all plans and decisions they make can be upended whenever by Valve?",
            "I don’t claim PGL would have listened and made the change (I don’t know), but that’s still more sensible and logical timing for them to make it public instead of now.",
            "While the rule itself is bad, there is nothing insane about TO enforcing rules of the tournament.\n\nIt should definitely be in your book as possibility",
            "It wasn't fake drama, there's no way any other teams would have done that. It was pretty poor form to not mention it in the team meeting about rule changes as well. \n\nIt was a shit thing to do. \n\nIt's not an alliance Vs OG thing, it's Alliance Vs sportsmanship. Not that anyone running alliance has ever cared about fairness.",
            "Ceb case is not injury to the member",
            "and those that do require that the substitute are official member of your team",
            "He went in the middle of a test series, not a match. Big difference",
            "that hasn't been legal for over a decade",
            ">He isn’t admitting exemption should be made, he claims said rule needs to be changed for everyone (not just Ceb/OG). But either before or after the tournament, not in the middle of it.\n\nAn exemption is not a rule change, no rules are changing in the middle of the tournament. Hope you understand this.\n\n>Again OG could have came out with this issue to public BEFORE. They could have opted to play with standin for whole qualifier (like many other teams did in the past in similar cases) \n\nThis isn't a public issue, therefore OG have no obligation to make it public and the morality around the exception doesn't hinge on them making it public at any given time.\n\n>They chose to bet on issue not happening, lost, and now actively trying to shift responsibility for their own actions.\n\n????????\n\n>Because rules are not about subjective things like morality. \n\nThey literally are. In fact, rules are defined based on our morality!\n\n>They are to ensure everyone is treated equally and fair. Making an exception now will open the Pandora’s Box to all sorts of favoritism claims.\n\nMaking an exception based on human judgment is a normal thing to do in the real world, something I've already explained in the original post. You could go back to read that if you'd like.",
            "If you go and look through all these comments you can identify which people can actually critically think without obvious bias clouding their judgement. Most people probably do agree there should be an exception but they hate OG so they want to see them suffer.",
            "I just wanna see OG lose without it being a technicality ;)",
            "Yes.",
            "Exactly! Even other Esports run with subs, why not Dota?",
            "Or, get this, do what every other professional sport and workplace does and provide a method for leave that doesn't force you to remain out of work for an entire year.",
            "It's child birth, it's not a solid prediction it could have been 3 weeks ago or a week after. Giving up the whole year and his team best chance for something unpredictable is rough. And to make pgl admins even clowny we have like 4 months until ti what does 2 days difference make to the 6 pro teams left.",
            "He might play, and that choice is being forced on him when he shouldn't be making that choice. That is immoral.",
            "See the comment you responded to",
            "Remind me the last time a player missed the superbowl because his wife was giving birth",
            "Like we all know a difficult situation, but does that mean the whole team gets dropped, Because of him? The tournament is structured in that way and yet he committed, Messi or Ronaldo might fly back as soon as possible but wouldn't miss a big match against a strong team..my dad wasn't there for mine or my brother's as he was in a different country working but he came a few days later when he got his leave approved. Sometimes things aren't gonna be that straightforward or easy as you think.",
            "Oh I misunderstood the intent of your reply to me. Apologies for that. Yes, I completely agree with you.",
            "\"Ceb.OG: Thanks Topias named my first born son after you for this free win\"",
            "TI doesn't matter to him but to the other 4 it's a huge chunk of their potential pay during the year.",
            "I'm sure shitty fathers miss childbirth moments for all sorts of worse reasons, I wouldn't judge Ceb one bit if he decides to play to keep his teams TI dreams alive.",
            "I think he is simply suggesting the original CQ format. Which seemed the most fair too. Round robin into playoffs. Top 1 seeder of round robin even gets a direct inv and don't have to go through the rest of the playoffs.",
            "No what a dumb assumption of my comment there is no need for replacing any team lol, I'm saying that everyone should start with equal footing during the qualifiers, back then they would start with round robin which included the OQ teams before the playoffs. It was this way before DPC and when DPC 1st started.\n\nLike also imagine your stupid take, so according to your logic everyone who got invited at TI should just start at Upper bracket as well because they \"performed well throughout the year\" and those who qualified from close qualifiers should just wait at the loser's bracket too lol. Like what?",
            "Also people are more likely to be on your side when you bring things up well before the rules are set in stone. The situation changes from trying to get preferential treatment to trying to get a sensible exception in place.",
            "What is the prisoners dilemma?\n\nThe rule is the rule, and you can assume that everyone knows it too. Do you self-sabotage because you disagree with it (which A did, rhey even made a formal complaint about it since they didn't even have a coach at the time) or assume that all teams will use every allowed means to win and match it?",
            "That's fair, but that was not the question. Rowing does allow for substitutes.\n\nEdit: Anyways, you prompted me to read more into the rules.\n\n'1. Crew changes (up to 50%) via the Late \nAthlete Replacement policy may be made \nusing Ap athletes or a “long list” athlete who \nhas had an accreditation request submitted, \nfor the following reasons: \na. Medical conditions preventing \nparticipation of an athlete \nb. Proven anti-doping violation \nc. Positive COVID-19 case \nd. Isolation or quarantine due to \nCOVID-19 infection \ne. Other exceptional reasons \nauthorised by the IOC \"\n\nCeb would fall under \"e\". Another point further illustrates what to happen when it's after the first heat (basically the same)\n\nAfter the first heat: \n1. Substitutions may be made only using Aa \nor Ap athletes and only for reasons \nspecified in the LAR: \ni. Medical conditions preventing \nparticipation of an athlete \nii. Proven anti-doping violation \niii. Positive COVID-19 case \niv. Isolation or quarantine due to \nCOVID-19 infection \nv. Other exceptional reasons \nauthorised by the IOC \n\nWith one exception:\nReplacement with an Ap athlete is a LAR \nand therefore permanent; the replaced \nrower is not allowed to re-enter the crew if \nbetter/recovered. \n\nSo if this was rowing, ceb would be able to exercise the \"V\" option with the understanding that in THIS competition he is not allowed to compete again. That is OG would be allowed to finish playing the closed quali and Ceb would return in TI if they were to qualify as that's a separate event.\n\n\nTL;DR - Cebs situation would not happen in Rowing. OG would continue to compete as normal.",
            "Which you cannot have in the closed qualifiers. The rules state only 5 players can be on the roster.",
            "> This isn’t a public issue, therefore OG have no obligation to make it public\n\nAnd they didn’t have it now either. But they chose to because they are trying to get public on their side. Which is not necessarily a bad thing, but if they wanted go public to pressure PGL into allowing standin to be used multiple times, they should have done this before the tournament. \n\n> Rules are defined based on our morality\n\nNo they are not. We are taking about tournament rules there. Not laws or religion rules. Tournament rules are based on ensuring tournament goes well, and every competitor is treated **equally**. Excluding one of teams from a rule is not equal treatment.",
            "Unironically totally fair.",
            "Then take a break and let OG register with a diff roster?",
            "Too bad\n\nGrow up and realize that life WILL give you uncomfortable choices that you WILL need to make",
            "And their renown, future sponsors, and contracts",
            "Makes formal complaint (no proof of that btw) and doesn't mention it to other teams - all of whom would have complained if they knew about it. \n\nDoesn't seem likely",
            "They may be able to play, but it looks like they're stuck playing with Notail as substitute and nobody else.",
            "Making it public has no relevance to the discussion, it literally has no effect on any argument other than confirming a bias.\n\nRules are moral my guy. What people consider fair is defined by our morals about what fairness is. Lol.",
            "It's a little hard to replace your captain and it has to be team for ti",
            "I am grown up. I have 4 children. You need to grow up and understand that forcing someone to choose between critical bonding moments with a newborn and the livelihood of their teammates is immoral.\n\nLife didn't give these choices. People did.",
            "Noxville tweeted it at the time. Read up the details of the drama if you are invested in it.\n\nAnd Alliance didn't function on the OG MO to go public and try to rally everyone to coerce a TO to change if you disagree. Is it really that much to expect teams to read their effing mails???",
            "That's fair. I'm not a Ceb fan or OG fan for that matter, but I did compete in T3/2 Esports before and the rulesets are so fucking shit if you want a life. I believe that being allowed a substitute in a team game/sport is a no-brainer",
            "> Rules are moral my guy\n\nOk, well then this rule is moral by your own definition? Why are you complaining?\n\nOr maybe it’s not and the thing is that rules are not about morality. There can be a rule about $100 entrance fee, what’s moral about that?\n\nAccording to the rules you can’t randomly have a toilet break mid-game, does it have something to do with morality?",
            "You certainly have numbers in your age, that doesn't mean you grown up\n\nIt's not cushy office bullshit job. It's an event that's planned *months* in advance, on which livelihood of a lot of people depends on\n\nAnd you couldn't plan it out, and now have to resort to whining about immorality of being forced (*by your own actions*, too, so it's *people* alright) into a tough choice?\n\nSorry for not letting you eat your cake and have it too",
            "They literally had a meeting every season to talk about rule changes so nobody missed anything and alliance didn't mention it despite it being a huge change. \n\nIt's not even a line in the email, it's buried in text. Literally everyone involved missed it.",
            "A grown up is telling me how to plan childbirth?",
            "No, some teams went public and mentioned that they knew about the rule too... and do you really think anyone would stick their head up after the public execution that A was given over it?\n\nThe only ones that I've seen mention the meeting are OG (amd it was just a whatsapp group), and that became something they brought up after it was revealed that they were pbviously in the wrong for not reading their mail. \n\nBesides Alliance WERE as transparent with it they could reaspnable by. They caused the drama by releasing a vlog that clearly and obviously included PPD. How can they still be tarred for being unsportsmanlike?",
            "Yes\n\nFour attempts and you still didn't get it"
        ]
    },
    "The Ceb drama shouldn’t even be drama": {
        "title": "The Ceb drama shouldn’t even be drama",
        "score": 234,
        "url": "https://www.reddit.com/r/DotA2/comments/1dlr0gq/the_ceb_drama_shouldnt_even_be_drama/",
        "content": "The fact that people are more offended by Ceb going to the birth of their child is a serious indicator of the nature of the current state of (some parts) of the community.\n\nIt’s hardly a shock to opposition that he’s returning to the team. And the fact people are saying he shouldn’t have gone to the birth of his child is insane. This game is not the number one priority, it is a GAME.. it’s honestly been so gross to watch people dismiss his wife and child so much.",
        "num_comments": 127,
        "comments": [
            "Almost everyone here agree that there should be some provision in the rules regarding substitutions and there is precedence from other esports on that.\n\nBut these are things bigger teams should come together and demand from the TO before the tournament starts, and in this manner will actually help smaller teams as well.\n\nThe way things stand smaller teams always get's screwed by strict interpretation of rules while bigger teams stay silent till something affects them because they know they can get away with things by creating enough outrage when the time comes. This is definitely something that needs to change.",
            "You can´t say it´s a game for him, it´s basically his day job - playing tournaments. But then again when you are about to become a father your boss doesn´t force you to come to work and there are always workarounds.\n\nAnyway, i agree with you. But mostly my thoughts go to Ceb, been reading (not sure if true as i didnt´t fallowed the news) he had issues before with his now wife because of him being away on tournaments and too involved. He definitely doesn´t need the stress all this drama generates, guy is going through one of the best moments in his life, should be allowed to do this peacefully.",
            "The fact that this bs is \"drama\"... To be fair I remember a similar situation with a football player (I think Liverpool, I remember Jürgen Klopp was the coach) where the player missed some quarterfinals or something. It was made into drama too ...",
            "Waiting for Ceb tweet",
            "[Check how this basketball coach reacted to similar question. ](https://youtu.be/G0a-Nr_vRjM?si=Ksw_owWfTXm3ULyi)",
            "I mean I think the sub rules should absolutely be changed, however OG has a long history of weaponizing their fanbase whenever a decision goes against them. And they don't act all high and mighty and morally superior when a shitty decision goes in their favor, which literally happened this year.",
            "Well the OG org is the one who made it a drama. It's because they want the dota 2 community talking about it that we're talking about it. \n\n\nI'll say that they have good reason to bring their situation to light because the rules are indeed silly, so hopefully it gets changed for future qualifiers. However, no one is at fault here. Things just turned out to not be in the favour of Ceb. Besides, it's the rest of the team that's more affected by this than Ceb himself. Dude's about to be a father and he's already won 2 TIs. ",
            "nah bro rules are there for a reason..ceb should 100% be there with his wife n child but life is not easy n fair and they already let them have a unregistered standin what more can u ask for?",
            "the worst take ive seen from people here was theyre blaming CEB for not planning for the qualifiers.\n\nIm actually baffled that people would say this but im not surprised considering majority of the people crying about it havent touched let alone talked to women",
            "Is it really a thing ? So far I have mostly saw people going about OG knowing there was a risk Ceb could not play but still registering with him.\n\nI didn't scour the entirety of reddit but I didn't see people complaining about Ceb being absent for child reasons.\n\nStrawman for karma",
            "Another deranged OG fan. people dont think dota > birth of his child. \n\nPeople think he should have skipped this qualifiers instead of bitching about the rules.",
            "So true. Again in this thread with people arguing he should have known months in advance. As if you plan your birth like date. Hint to you guys: unless it is a planned c-section you will not know your exact date in advance (and even then your child might cross your plans).\nI don’t see where Ceb considered a „paternity leave“ - he just wanted to be present at his child’s birth. All this outrage - also by pro players - shows a serious lack of maturity and understanding of what is truly important in life.\n\nCongrats Ceb. All the best to your wife, your kid and to you.",
            "Where are those people? I thought people are mad at OG because the rules is \"unprofessional\" to them but when the rules benefitted them (1win situation) they don't give a shit.",
            "Exactly...let ceb have his time. There will always be another TI. \n\n Idk why OG manager even let Ceb play despite the circumstances. Like they Didn't even know his wife was pregnant(to be fair me too until yesterday). Especially playing 15-20 pubs  a day as training with expectation of his child? Just get another player before TI qualifier.",
            ">it is a GAME.\n\n\nIt is a job, and plenty people in variety of industries and work lines miss their kids births because of their job. If you are a surgeon and you are in operation are you gonna stop the operation go see your kids birth? If you are trucker and you drive for months are you supposed not to be working for like a month so you wouldn't miss your kids birthday? And so on and so on. Ceb decided he will take priority of his personal life over his job, and that's okay, but he shouldn't cry when the consequences arrive",
            "Can’t believe some people think Ceb should leave the birth of his CHILD. Actually stop playing the game and touch grass.",
            "Almost nobody said that, stop making stuff up for drama. Really grinds my gears when someone does that.\n\nThe debate is whether the rules that are in place should be followed, or an exception made for events like the birth of a child. Nobody blamed Ceb.",
            "Strawmen somewhere else populist.\n\nAlmost nobody is against Ceb going to the birth of his child.",
            "From what ive read its mostly ogs fault its not like they would lose in the open qualifiers but they decided to use their brand name and fan base to force pgl",
            "it's his job",
            "The craziest thing about all this is that most of reddit thinks that orgs should be kicking members if they are expecting children during TI qualis.\n\n‘They could have gone through open qualis with a different player. It’s OG’s fault they knew the risks.’\n\nAbsolute insanity. And if any org did this to any player other than Ceb that org would be endlessly hated and shat upon - and rightfully\nSo. But of course it’s Ceb so reddit gotta reddit.",
            "I agree that the game shouldn't be his number one priority, but because of that, I think it's reasonable to conclude that he shouldn't have registered to play with the team for the June 3 deadline.\n\nNo one plans to 'potentially' take maternity or paternity leave in the real world a month before the birth - it's planned far, far in advance. As such, the 'he couldn't know exactly when' argument falls flat for me because if his wife had gone into labour next week, there's no doubt that he absolutely would have played. \n\nAs such, it's not really paternity leave in the honest sense of the concept - and that responsibility to decide on terms for his pat leave lies with OG, not PGL anyway.",
            "> it’s honestly been so gross to watch people dismiss his wife and child so much.\n\nNever doubt Dota 2 community in such cases. They can harass a pregnant woman after a slight mistake on a new job.",
            "I haven't seen many people say the things you claim at all, people are pretty much saying the rule should be changed in the future, but OG and Ceb knew the rules when they decided to play with him and now that it came back to bite them they are trying to use their influence to bully PGL into bending the rules for them after actually already doing it by allowing them a standin for one game.\n\nThe entitlement OG are showing is truly wild to me, they made no public statement about rules when 1Win were removed from ESL Birmingham for being late on visas. The rules of competitive events should be enforced as written, the teams know the rules in advance, if they can't follow them they shouldn't be in the tournament. If their solution to the problem is to take the risk and it blows up in their face they have to accept that instead of whining about it.\n\nWhen Alliance used a coach ingame which was allowed by the tournament rules of that tournament OG called them cheaters, now OG want to \"cheat\" the tournament rules by using standins when it isn't allowed, but that is ok? it is not, it is entitled crybaby behaviour.",
            "Nah, I’m with Sneyking on this one. Rules should be black and white. Creating an exception sets a bad precedent.\n\nAlthough yeah, the rules from the get go should have allowed stand ins for family emergencies. But, it’s not allowed, so rules are rules.",
            "I mean it's a game for 99.9% of us, yes. But for a pro player is a little bit more. Not saying one should prioritize work over family, but for someone like Ceb Dota is not a hobby.",
            ">And the fact people are saying he shouldn’t have gone to the birth of his child is insane.\n\nyou hear that everyone? if you disagree you're insane like mentally unstable and should be put in a strait jacket and lobotomized",
            "People miss their children's birth ever day for work, fuck off man. It's not a game lol.",
            "I was surprised by the amount of childish DotA player in this Reddit.\n\nLike we soldiers miss our child birth all the time, that means we're trashes ?",
            "Its OGs fault though - they could have replaced Ceb instead of gambling when his kid is being born. They made it a drama. They even say \"family emergency\" even if it is not",
            "Next we should definitely postpone OG's match when it's ceb's birthday 👍🥖",
            "It’s his job not a game you cretin ",
            "It is not a pub game, mate. It is a job for him. You are making the right point with a very bad explanation. \n\nEvery job should have a right to leave maternity leave, so yes, he could have been leaving. But as far as I saw in reddit they were rejected to start with standin and with better communication beforehand, it should be better outcome.\n\nIn some parts, I agree that tournament rules shouldn't be bent in the middle of the tournament. Tournaments always evolve on the next one because otherwise, everyone asks something and tries to change some rules. It should be fair to everyone. So I call this event as 'unfortunate' tbh.",
            "Rules without consequences are simply guidelines.",
            "Because most of the players commenting don't have or will never have a wife and kids so there is 0 empathy.",
            "Yes og should just withdraw I don't get it.",
            "Western people are just doing their things. Only them could break rules. Only their excuses are valid and important. Those people would cry for rules if it did happen to non-western people",
            "Ceb is a dude. You don't have to call him a \"they\".",
            "Trash team with trash players",
            "i dont disagree, but we are not talking about \"just a game\" but a job, specifically a (e)sport. Obviously wife and child should be above everything else, especially since money shouldn't an issue for Ceb, but it's stupid to treat the \"game\" like some late night pubs lmao",
            "Majority of dota players are virgins so it makes sense why they're so upset about him going to the birth of his kid.",
            "\"The community\" is mostly man-children, the thought of someone having sex repulses them and makes them feral.",
            "They hate a GigaChad winner",
            "I'm not filled in on the details but I'm sure Ceb is wrong somehow. Historically that's been the case",
            "OG shouldn’t get special treatment. Ceb can go play a game then go to see his kid, I don’t think it’s a big deal. Getting dq wouldn’t be fair to his teammates.",
            "I've never liked Ceb, I think he's a toxic dweeb. That being said this shit was blown way out of proportion.",
            "True true",
            "The phrase “it’s just a game” is such a weak mindset. You are ok with what happened, losing, imperfection of a craft. When you stop getting angry after losing, you’ve lost twice. \n\nThere’s always something to learn, and always room for improvement, never settle",
            "For you it's a game for others it's their job.\n\nImagine Messi or CR7, Lebron missing qualification match for same reason. This happens in all sports and in all jobs.",
            "What I belive in this matter is that it's his choice what de want to do . Whether he wants to stay with team or he wants to be with his family we should just respect his decision and move on. It should only affect to his team mates and his family. \nAnd better then that you guys can support me for my youtube channel which is about dota2 tournament highlights. I spend hours watching their matches and make highlights from it.\nLink - https://youtube.com/@dota2_nevermore?si=awXMI_X5ScoWunw3",
            "I think the tricky balance is in how you set the rules. Because in this case I think it's clear that Ceb going to the birth of his child should allow a sub, but writing the rule that allows that will be tricky to avoid it being abusable.\n\nLike, the rule clearly isn't going to be 'subs allowed if you're having a kid', it'll be a more general thing than that. And then we'll get the reverse of this where someone will sub out an under performing player and we'll get \"why is this allowed?!\" Posts instead.",
            "Most teams are amateurs. Remember the ppd coach draft debacle where people didnt read the tourney rules ",
            "I have my own business(which is a situation like Ceb, who is also an OG owner), and when you own the business is harden to just \"leave the job\" lile when you are just an employee.\n\nI see why Ceb decided to play after the rules thing came up...there may be sponsors, contract agreements or stuff like that that may relly on this qualy...so, as a business owner ypu can't just do something that you hurt your company.\n\nIs a tpugh situation, but not different to something that can happen on any business.",
            "It’s same as if he was a footballer and there was a world cup going on.",
            "I guarantee he is peaceful and happy with his family and not worried about screeching dota fans",
            "The difference here is a tournament is not your employer, you would have to have franchising with agreements from orgs and tournaments to have official substitution rules, but thats likely never going to happen to dota.",
            "Ok. So, football has mid-game substitutions and a coach on the field. We should allow mid-game subs as well and should put the coach in the same room as players for providing guidance. If you want to give an example from other sports, then apply that rule completely. Don't apply the concept selectively. \n\nAnd oh wait, wasn't it OG who complained about coaches in the game? I wonder....",
            "Aubameyang staying in his country due to his mothers sickness is also one of them.",
            "Am I the only one thinking if he can't fully enjoy the birth of his first kid without all this drama happening behind?",
            "Sadly as he said, some people need to have a child to understand the importance of this.",
            "Who is to blame then? The TO for not bending the rules for them? He participated in the tournament knowing that they would have problems. I feel bad for the rest of the team not ceb",
            "Why didn't Ceb get his wife pregnant earlier or later smh can't he use a calendar?",
            "didn't they have the same situation during DPC period when they're acquiring stand ins or some sort since their players have conflicting schedules and were not allowed then Ceb went to twitter to rant about a certain person because the rule didn't went to their favor.\n\nbut the fact they didn't do this when they asked for a stand in weeks ago and got denied seemed sus lol I mean they were mum when they replaced 1win when they're hours late for their visa.",
            "Just quit your job if your wife is pregnant. Truly a level take.",
            "I do think the rule is shitty, and it should be changed, it's just that OG brought the matter up when it affected them, they should've urged PGL to change it's rules before the tournament if they were already denied using stand-ins. This is just OG using their fanbase to bend PGL's rules when it affects them. Did they say something when 1win was denied entry to that tournament because they weren't able to acquire visas by the deadline that was given to them? If they change the rules now then the competitive integrity of the tournament is compromised",
            "While the due date is an estimate, it still doesn't excuse the fact that OG and Ceb were aware of the pregnancy and due date months before the qualifiers; sufficient time for the org to contact PGL to have a discussion on subs. They chose not to do so, that's 100% on OG.",
            "A couple of dudes in this thread saying exactly that",
            "It's the birth of his child. I know it's very unlikely someone with your mindset will produce offspring, but in the off chance you do, are you going to stay at work for your boss' peace of mind?",
            "I mean, due dates are a pretty fuzzy thing. Even excluding premature births, the window where the baby could arrive is like 5 weeks. That's a lot longer than paternity leave is in a lot of places, so whilst you plan for \"I'll be off for X time _around_ the birth\", you can't always block out 7 weeks of work time for 2 weeks of leave.",
            "“OG should have kicked Ceb for having a child” has got to be one of the most hilarious Reddit takes.",
            "Kid being born is a family emergency though? What do you classify it under",
            "No, there are exceptions to rules, and often times in sports and tournaments they handle it on a case-by-case basis. Ceb mentioned the potential for a conflict well in advance and the TO's made an exception\n\nThe TO's want to follow the spirit of the rule - this rule was made so people can't swap in and out to game the drafts or to shuffle to get a better team together mid tournament. Having to be there for your first child's birth does not in any way, shape, or form violate this spirit of the rule or why this rule was made in the first place.",
            "I mean, it's not like he's the one giving birth. You people acting like PGL asked him to abort or something /s",
            "Half the sub is 15-20 year olds. Of course they don\\`t have a wife.",
            "Many great players have missed games for these kinds of reasons.",
            "Yep, \"underperformer has \"suddenly\" fallen down the stairs so we had to conatct the nigma freelance agency and sumail has agreed to step in \"",
            "It doesn't seem that difficult. Here's a quick spit-balled ruling that could serve as a first draft;\n\n>PGL Tournaments allow for stand-ins in extenuating circumstances such as, but not limited to;\n\n>- Medical Emergencies\n\n>- Government Mandates\n\n>- Bereavement\n\n>- Paternity/Maternity Leave\n\n>- Other reasons as granted at PGL's discretion\n\nY'know, the basic worker protections that I would lay money that the PGL employees also have. Just require proof of the above (not hard) and disqualify teams who can't comply.",
            "One option implemented in some other esports and sports in general is that you are allowed a specific no. of pre-registered substitutes that can play at the discretion of the team. \n\nThere are pros and cons to this but at least reduces the kind of tricky subjective judgement otherwise required from the TO.\n\nI honestly don't know what the solution to this is, just that a discussion on it would be ideally held between the concerned parties before the tournament starts.",
            "maybe limit the number of games they could use a standin? \n\n1 game, no questions asked. You can use up to two standins. Anything else or after than, you're just shit out of luck.",
            "Imagine if someone asked UEFA to change their rules just because one of their teammates needed to be away for a few days.",
            "Is it always situation where there is someone need to be blamed?",
            "OG said that they asked PGL weeks in advance that if they could register the Qualifier with a stand-in instead of Ceb but got no for the answer.",
            "In France, you have the freedom not to attend your job in order to be there for your child's birth.\n\nIt's absolutely normal there to do this, and everyone understands it. It sucks because it disrupts the tourney, but in the end, there'll be many more to play, but seeing your child's birth, being there for your wife and to cut the umbilical cord, these things are a one time moment in your life, even if you get another kid, it'll be a completely different experience.",
            "guy has like 10M usd we really acting like he cant take a year off the pro scene?",
            "The few comments that do are all heavily downvoted. They're not what the drama is about.\n\nThe drama is about following rules vs having exceptions for exceptional situations. OG as an org was receiving blame but not Ceb specifically. The prevailing sentiment was very supportive of him and how difficult a choice this is.",
            "The thing is Ceb is the owner of the org, big difference. He definitely should focus on his baby first instead his work and replace his position to another player, Misha and notail is available.",
            "Yeah but OG talked to the PGL who clearly set the rule of 1 standin and still decided to gamble. They lost the gamble and that's on them.",
            "That's a valid point but - to me, at least - it adds more credence to the idea that he should have sat out this qualifier and TI.  \n\nHe made a different decision, and it's his decision to make, but the OP's framing is fairly dishonest.",
            "Yes. Baby happens and they had to adjust. The fairest thing is for the same 5 player who played in the qualifier to also play in the TI. OG is purposedly vague on their statements and keep spewing that PGL didnt allowed them to use a Standin when they could have instead replaced Ceb and not use a Standin. They have an idea on the possible time that the baby will born and they didnt adjust.",
            "Is it in this case? They have an idea that the baby will come and when it will come. If OG and Ceb are responsible, they should have replaced Ceb.",
            "u/knoxville explained it very well why things like these can't have case by case resolution because teams often and will, lie. \n\nThis isn't the only sport where such rules need to exist. \n\nIt is not fair for competitors who had to choose to go through OQ because the TO didn't think their 'emergency' was worth it. Because, in the end, we shouldn't depend on the TO's empathy for the tournaments integrity. \n\nI'd rather have a simple and clear rule set that allows for teams to stand-in. And let people use it how they need it to be used. \n\nJust to be clear, I have no issues with CEB going to attend the birth of his child, if anything, I've a lot of respect that he would choose that over playing a tournament that happens every year.",
            "... That's what I said",
            "But they had a registered sub",
            "Love and care can be expressed in many ways, save it for future and don't think that this day is the most important, remember to treat your kids better not just this day.\n\nI've seen a bunch of those who didn't miss this day, but in the end they treated their kids like shit, comparing their kids to neighboor's kids all days.",
            "TI qualifers mean almost every player is already competing.  Who is going to join a team as a sub on the small chance a players wife has a baby?",
            "It's already one day",
            "But this was the rule that pgl had set and followed.",
            "Imagine thinking you would need to when UEFA have clear rules allowing substitutions at various stages of the game/tournament/pre-tournament.",
            "Except footballers are allowed multiple subs for a team, and it's often that someone can't attend due to injury or accident or whatever. Being allowed one stand in for one day is crazy.",
            "Premier league, so I guess UEFA(?), changed the rules on jersey numbers, when Christiano Ronaldo returned to Manchester and wanted the 7, but the deadline had already passed. Trust me, for something as important as the birth of your child, any rule would be circumvented, in any job or sport.",
            "Except UEFA doesn't require the entire team to forfeit because one of their players can't attend. In fact, it's fairly common that players will be injured and have to miss.\n\nWhat even is this comparison?",
            "Exactly. It's a video game. I'd call a childbirth a force majeure to bend the rules and allow OG to play with a standin. I mean, they already did it for one day when they played with Immersion. There's no reason to find a scapegoat, just let them do it and move on.",
            "clearly it's Ceb? if you wanna be a responsible husband, dad and team captain you step aside and let someone else play so this situation wouldn't happen. he took the risk (the rules and comms were VERY CLEAR), and when it blew up on his face he threw his weight around like a petulant child",
            "Because they wanted to play with a standin in the closed qualifier lol. They intentionally omitted WHICH qualifier so mouth breather redditors can rally up in their defense ",
            "And when you get a no, you start to make a tantrum!!!! Worked every time for me when I was 2 xd",
            "No means no?",
            "OG is def responsible for not having a decent replacement. That does not mean having a baby isnt a family emergency",
            "u/knoxville what's the stats on players lying about pregnancy so they can get a sub to gain a competitive advantage?\n\nJokes aside this is *how* new clauses are made in rulings. The TO's look at the situation, gather evidence and facts, and make a determination that subbing in for 1 day is acceptable for paternal leave. \n\nSomething else like an illness might have a different clause, like using a sub but the old player can't rejoin the tournament\n\nSomething else like a sub is acceptable for VISA issues, but if the player gets a VISA they are permitted to play the rest of the tournament without the sub returning. Etc etc etc. \n\nReal life shit happens and we shouldn't treat rules as absolutes - we have to make a determination of what edge cases may arise and make a ruling that will set a precedent. If there's someone abusing the system, a new rule can be made for that too. Same thing happens in other sports like baseball - like how they ruled out little people from being able to compete due to the incredibly small box the pitcher would have to throw",
            ">will never have a wife and kids\n\nI see a difference.",
            " the \"sub\" in this case comes in the form of a pre-registered replacement for him. he should've sit this qual and TI out if he were actually acting responsible. I'm sure pro athletes don't go on world tour while their wife is expecting. same case here",
            "Ok i am totally confused what the issue is then? \n\nI was under the impression that there were no subs allowed at all, which is why this drama was going on.",
            "Happens every world cup with several nations. Unsure what was the point of bringing that up, when the fact is that players do quit when they can't attend for whatever reason.",
            "Ok. So, football has mid-game substitutions and a coach on the field. We should allow mid-game subs as well and should put the coach in the same room as players for providing guidance. If you want to give an example from other sports, then apply that rule completely. Not apply the concept selectively. \n\nAnd oh wait, wasn't it OG who complained about coaches in the game? I wonder.... \nWhat a clown you are!",
            "I'm not talking about the rule itself. The rule is dumb and I've always wanted teams to be allowed substitutes even in general, outside of extreme circumstances.\n\nBut Valve has always upheld that TI invites are given to players, not teams, so not allowing substitutes at a TI qualifier actually tracks with that policy. This is a policy that goes all the way back to when Fnatic.eu wanted to drop Era from their TI roster after the invites and had even played other tournaments without Era, but Valve maintained that Era has to play. Personally, I think every team should be allowed 1 sub and 1 coach/secondary sub, but that's just my opinion.\n\nMy issue with OG is that they already agreed to participate after the rules were laid out and are now trying to browbeat the TO into bending the rules for them, *again*.",
            "The comparison isn't the rule itself, it's that OG are asking PGL to bend the rules for them after the tournament has already started.\n\nLike, this is the equivalent of France asking their match vs the Netherlands be postponed for a few days because Mbappe broke his nose and needed a few days to check up.",
            "It means that Ceb tried to not participated in the Qualifier but doing so also meant his other teammates losing their slot in the Qualifier, which they had rightfully earned.",
            "\"don't have or will never have a wife and kids\"\n\nDid u somehow miss the part before \"or\"?\n\nEdit: In case u miss this too, \"or\" is different from \"and\"",
            "As I said in the other thread. How do they not have notail and even their coaches registered as subs?\n\nThis whole thing is just to get some drama.",
            "the way it read to me was they contacted PGL before the tournament and got a minor \"we can handwave one game\" brush off. OG said that's nice but we really need more but PGL hemed and hawed, because it's a bad look to say \"no, fuck your kid's birth.\" but because they didn't want to give a definitive \"go/no-go\" OG was stuck in limbo.",
            "That's not true. They would lose INVITE to closed qualifiers, they could've played open qualifiers without Ceb like BOOM team did when they changed players before qualifiers (their original roster was also INVITED but had to play opens, didn't make drama about it).",
            "erm the rule is that they can't be used. only 5 players (with no backup) per team. while you can argue it's a dumb rule (debatable) it's beside the point",
            "The rule was literally that they couldn’t use a sub. Wtf you on about?",
            "And in the same WEU qualifier we have Tundra with Ramzes stand-in. I didn't remember Tundra had to fight through Open qualifier.",
            "The text says \"standin\"",
            "Ramzes officially joined as a loan before imposed TI qualifiers roster lock deadline, big difference."
        ]
    },
    "When you gotta deal with your baby, PGL, and reddit crying together": {
        "title": "When you gotta deal with your baby, PGL, and reddit crying together",
        "score": 123,
        "url": "https://i.redd.it/2ttheydb438d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "We slay together, we lose together, we raise Ceb's kid together. . .",
            "Nobody has to ever deal with \"reddit crying\" unless they were a narcissist",
            "And Sneyking. And his other 'kids' i.e. the 4 other on his team. Ceb gonna grow those white hairs fast",
            "People expecting him to roll in like [Scorcher](https://www.youtube.com/watch?v=qIeTw7dX8bE)",
            "Well OG is the 2x  back to back pee in your eyes wiener but when your time can't perform you need to create drama to keep the hype going and i almost forgot time to rewatch the true sight.",
            "don't start cheap drama, and you don't have to deal with any of this. Navi Jr. stomps them soon enough, they'll cry some more like spoiled brats, but it will be forgotten really fast.",
            "and then lost the series anyways.",
            "Trash player from a trash team",
            "Timado: Make Ceb's baby together.",
            "You almost forgot? Damn bro step it up, a real OG fan wakes up to it 😔",
            "Damn this dude has some problems",
            "I mean, it's not like he's the one giving birth. You people acting like PGL asked him to abort or something /s",
            "As soon as they lose, i immediately played  Agaisnt all odss. Copium is a hard drugs.",
            "You got me there 😄",
            "True i have no idea how PGL is the bad guy here"
        ]
    }
}