{
    "The r/EASportsFC Daily Discussion Thread -- June 22, 2024": {
        "title": "The r/EASportsFC Daily Discussion Thread -- June 22, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/EASportsFC/comments/1dlt4rn/the_reasportsfc_daily_discussion_thread_june_22/",
        "content": "This thread is the place to go for the posts that crop up in /new that don't necessarily need a full thread for discussion, which include but are not limited to:\n\n* Subjective questions (such as \"Who is better, Player X or Player Y?\" or \"Which Chemstyle is best on PM R9?\")\n* Investment / Trading / Market posts\n* Sharing Squads / Asking for Suggestions\n* Other general gameplay discussion\n* Meta posts & Quick Questions\n\nJoin the conversation over on r/EASportsFC's Official Discord! [https://discord.gg/redditeasportsfc](https://discord.gg/redditeasportsfc)",
        "num_comments": 3,
        "comments": [
            "Why is it so hard to complete a WL in Asia, tonnes of no-loss glitchers/match under review hackers or bronze team coin farmers so the game doesnt count. Everyone always goes into the matchup/ping screen waits 30 seconds then quits. Yes im playing on PC so i cant just turn crossplay off.",
            "I am getting tired of the lag switch issue. Why is it so common for this game?",
            "When is a good time in the game cycle to blow coins on packs? Have about 2m and not really looking to buy any specific players."
        ]
    },
    "/r/EASportsFC: UT Champions Megathread": {
        "title": "/r/EASportsFC: UT Champions Megathread",
        "score": 2,
        "url": "https://www.reddit.com/r/EASportsFC/comments/1dl19la/reasportsfc_ut_champions_megathread/",
        "content": "Welcome to another edition of the UT Champions Megathread! This is the place to discuss everything and anything WL-related with other users.\n\nYour rage posts. Your squad building questions. Your triumphs. \n\n**Let's see where you're at or where you are headed!**\n\nContinue the Ultimate Team Champions discussion over on r/EASportsFC's Official Discord! [https://discord.gg/redditeasportsfc](https://discord.gg/redditeasportsfc)",
        "num_comments": 19,
        "comments": [
            "Does everyone just park the bus now? It’s getting very boring",
            "If anyone from EA reads this make the champions objective with 3-6 players from one nation in the future using a full squad is just long",
            "These rank V's red picks have been going hard these past few weeks. Lauren James , Theo , Rice and Valverde",
            "14 wins.\n\nHemp / Ferguson Picks.\n\nBacha, Stanway, Debinha\n\nNothing from packs. Games gone, no reason in playing anymore.",
            "6 games in a row where the opponent times out before starting a match ....\n\nWtf are you people doing start the fucking game",
            "Can someone recommend some solid tactics and formations to counter 4321? I'm at my wit's end seeing 4321 with the same combination of players every game. Yes, I know you have to attack with depth against it, but I'd love to hear what tactics are best suited for that. 352 is my usual go-to, but if I lose possession I'm in big trouble against the counter attack. 4231 seems to be fine defensively, but I feel like I can't break down 4321 when I have the ball.",
            "Don’t understand why they don’t update price ranges on players that go extinct because of the Argentina challenge. It can’t be that hard. I would actually like to try it but it’s impossible with the Argentinian defenders that I have in my club.",
            "I laugh at the shit some of u pussies whine. This game has so many issues that need to be fixed. Stop worrying about who you pack or price ranges or any fucking stupid shit you use to ignore the actual issues w this game.",
            "When does champs start?",
            "Always been this way post tots. Defensive stats are just so high at this point, that AI defending is cranked up to the max.",
            "I play 541. The three cbs in the centre counter their  three strikers. Your wingbacks let you play really wide which opens up their narrow formation. Just finished 14-6. Could’ve done better if I didn’t rush my games",
            "4-4-1-1",
            "There really isn’t one. It’s the best formation in the game. Best counter is switching to a 4321 lol",
            "Just started 12 mins ago",
            "The normal time before tots 8am on Friday morning new schedule now.",
            "Already did. ",
            "I’m playing later than I normally would. Probably time to quit. \n\nJust can’t see the fun in defending so deep.",
            "Do you play 541 all the time or just switch to it when encountering the 4321? What are your wingbacks set to?",
            "All the time really because 90% people are playing 4321. My wingbacks are H/H work rate and they’re on get forward and overlap."
        ]
    },
    "Women in FUT have been a huge success IMO!": {
        "title": "Women in FUT have been a huge success IMO!",
        "score": 13,
        "url": "https://www.reddit.com/r/EASportsFC/comments/1dlv7eq/women_in_fut_have_been_a_huge_success_imo/",
        "content": "Not only increasing the player base and special cards tremendously, but I have been able to create great links with my favourite players in surprising ways.\n\nBefore this inclusion by EA I could name maybe 10 active women players, now I know about 50 by name, their positions and teams.\n\nBut the best part for me is not having to grind to get Ronaldinho anymore as half my team have cool ponytail dynamics that look awesome during skill moves.\n\n",
        "num_comments": 11,
        "comments": [
            "The ponytail dynamics are top notch 😂😂😂😂 yeah idk why there were so many people outraged over it at first, I thought it was cool (and I’m a dude)",
            "I'd say so. After EA introduced them in NHL 22 or 23, I knew they'd make it work. IIRC, many didn't think that would work simply for the size difference and how much of a contact sport that is.",
            "100%, we got some incredibly fun cards and it increased awareness of women’s football like nothing else before, funnily enough.\n\nMfs were watching random Barcelona F games to track their Rolfo upgrades, I call it a success",
            "The only female player I somewhat enjoyed using was WW Putellas. Every other one I've tried just feels to small and weak, even the TOTS Smith that I packed.",
            "Never will use one dumb addition for me",
            "lol right!",
            "Ikr, Rolfo was the most popular player in this sub, during that time.",
            "Ader Hegerberg (I think I butchered the spelling) has been an absolute gem for me at striker!!! 😂😃😃\nWomen players are definitely alot of fun",
            "![gif](giphy|13A7YlLvYVDnmU)",
            "Yeah enjoy using 5 5 cards that abuse the game further proving your a ea shill when you never watched 5 minutes if womans football",
            "Is that somehow different than using a card like Ginola, who no one remembers except for his fifa card?"
        ]
    },
    "Please someone from Elite Div/ 15+ wins help, this game is bringing me mental illness ": {
        "title": "Please someone from Elite Div/ 15+ wins help, this game is bringing me mental illness ",
        "score": 10,
        "url": "https://www.reddit.com/r/EASportsFC/comments/1dltacq/please_someone_from_elite_div_15_wins_help_this/",
        "content": "I’m an average player, Div2, get 7 wins easily. \nI don’t understand what is going on with this game, and I’m sure that I miss something, because this isn’t normal. Examples:\n\nUsing 4321 formation, Balanced with Direct Passing, 67 depth,  my players stamina is gone by the 70’ minute. But using 100 depth and pressure on heavy touch don’t seem to consume stamina at all. Wtf?\n\nWhy can my opponent catch me from behind or any angle really and easily take the ball. What button combination do you use to actually tackle? I use R1 + Circle.\n\nHow can I get my players to press, why when I get the ball I am surrounded by opponents but when they get the ball my players go picnic?(even with 2nd man press)\n\nWhy do my opponents players perform gymnastics moves to intercept my passing lanes easily, and my players, placed perfectly, seem to ignore the ball, or, even if they touch it, it gets back to the opponent?\n\nWhy does my 97 rated keeper NEVER catch the ball? Always corners or badly placed rebounds?\n\nI’m willing to give 1 or 2 million coins if someone can help me out here, or in private.\n\nI’m not a headless chicken, I keep my back line in formation, is use R1 to trigger sprints and stuff like that, but I do not abuse mechanics, and don’t use Player Lock, Flick Volleys and other gimmicks.\n\nThanks.",
        "num_comments": 27,
        "comments": [
            "All that you just mentioned, it happens vice-versa, the sad thing is that we're all guilty of being oblivious to it and only notice and complain when it happens to us, so what I can say though is try not to let get to you, if you can tell that you're going to lose your head, take a breather, maybe chill off the game for a bit, relax coz yes the game can get really intense and frustrating at times. \n\nSo while I can't really give you the answers you were looking for, the one thing I can say is to help with your mental illness, don't let the game consume you like this, the calmer you are, the more relaxed you, the better you'll be at managing games rather than making rash challenges or getting frustrated by how your opponent did something. \n\nHope that helps in some way.",
            "Provocative post. Those things happen against us but also in our favour, but we simply ignore them when we win. The only thing I hate is those flick volleys and corners but it's just poor gamecode, keep in mind we had el tornado crosses spam in pro tournaments back in a day",
            "Honestly best thing I did recently was experiment with different formations rather than chase the meta 4321 and work out what works best for me and my playstyle and then find the best players to work with that formation. Will take some time to adapt but worth it and you will have more fun on the game",
            "That's just your perception. The game isn't coded speciifically against you and your opponents likely feel the same from time to time.\n\n\n\n1) it does make a difference but not massive. Relentless and relentless+ especially are fantastic playstyles and you can basically use a relentless+ player on full stamina for 120 mins on any pressing tactic. Midfielders under 94 stamina with no relentless will be done by 70\n\n\n\n2) I think bruiser helps with that behind tackle. But r1+O is just for strong tackle and has a slower animation you only really want to you use it front on.  If you are using advanced defending the seal out is best for that tackle.\n\n\n\n3) team press, constant pressure, 2nd man press, good manual defending and player switching \n\n\n\n4) intercept+ does get some good animations but otherwise you're passing too close to them. Pinged passing with a player with the playstyle is usually good at getting through. And although rare, Tiki taka+ gets through when it really shouldn't.\n\n\n\n5) mostly to do with the shot type you're facing if they are finessing far post and you move your keeper that way they catch it a little more often. But finesse and power shots often get you a corner.\n\n\n\n6) player lock isn't a gimmick. It's a good feature that finally gave us an answer to bad AI runs and is a good balance of requiring some skill and being rewarded. Very few players around 900+ skill rating just ignore it completely.",
            "My last opponent won 5-2 he scored from 2 cross play and 3 corners. His strikers are Drogba and of course 97 Haaland. And I have both CBs with Aerial+. Besides this, I Have all the same problems you just mentioned.",
            "This kind of stuff happens to everyone. It’s got nothing to do with how good or bad you are at the game, these things will still happen unfortunately. It’s mainly down to the game. Obviously there are a few things you can do to get yourself out of these situations. For instance, when you feel like your players are getting chased down by a defender and they are going to catch you, be ready for it. Slow down your player as they get closer to try and turn them as if they don’t let go of sprint they will go straight past you. If you’re near the touch line and don’t think it’s possible, try and win the throw so you keep the ball. The thing with all the things mentioned is, you will get these things happen in your favour as well in some games",
            "Best way to get better is to watch better players play.\n\nJohn sims on youtube has a lot of videos breaking down his gameplay and hes a top 200 player.",
            "My mindset is based around trying to minimize the “randomness” as much as possible. My personal biggest improvement from 11 to 14-16 wins and finally 18 wins this past weekend has been remaining patient on defense and trusting that I will eventually win the ball back with second man pressing. Defense was/is my biggest weakness by far, so this might not even be relevant to you. \nOther small details that have helped me minimize randomness include utilizing powershot+. That really helps me in those games where it feels like their keeper is saving everything, including finesses that I would regularly be scoring. Green timed finishes have also significant improved my conversion rate, particularly on finesses. \nTakes a few games to get comfy with these mechanics, but it’s very worth it. And somebody at your level is very capable at picking up these skills quickly. Best of luck to you going forward!",
            "Bro you're rockin the 4321 with direct passing, off course you're going to be vulnerable defensively. Your tactics relies on outscoring your op in the 1st half. Direct passing will drain your teams stamina, no wonder why you don't use other game mechanics, that tactic will spread out your players and drain their stamina.",
            "You're not average if you're div 2.\n\nAverage is div5-7.",
            "I’m sorry but this doesn’t make any sense. If it happens to all of us all the time, then why are there players with 20 wins? For sure there must be a skillset combined with a tactic that allows you to bypass the broken game mechanic.\n\nAlso, you are right about the nervousness, I think keeping a cool head even when the game is bollocks gives you a massive advantage",
            "It isn't even because of connection.",
            "If it happens to all of us, then why are there players with 20 wins all the time? \n\nI’m sure a great part of it is skill and calmness, but also tactics, specific button presses, D-Pad stuff all matter. Where should an average player like me focus to improve?",
            "Of course they also happen in my favour, but the proportion is terrible, and surely there are ways to enforce it happens and evade it. What’s the big secret here?",
            "I don’t think you can measure average vs non average players in Rivals. Anything below Elite is pretty much full casual since matchmaking is not tied to Divisions. Average is 11-14 wins in WL I’d say.",
            "Watch Harry Hesketh for example, he has a massive amount of games where he is down by 2/3 due to random crap happening, they are just simply too good at multitasking and seeing plays in advance that they can win somehow. Also they have best connection available and you need to consider their composure while playing",
            "There’s a lot of subtle user control that better players are doing on defense that folks won’t pick up on. Even something like the second man press, there’s a skill to getting the right players to press and picking the right player to user. Make sure you’re using the R1 double tap and hold  in order to man mark.",
            "There are a lot of factors but the ones you mentioned, it happened to everyone, the reason why so many people go 20 and 0 is that they don't lose their head and I'm being serious about that, it sounds dumb but trust me when I say, you can make a comeback just be keeping cool, obviously if you play to the meta it's easier, if you tend to do the sweaty stuff like cutbacks, crossing and so on, it's easier but that's all down to your playstyle, with tactics, you can't just rely on tactics, your personal playstyle still affects it, me personally, I have 2 setups, ones my more balanced 4321 and then my constant press setup when  I'm down or if it's a tight game but even then, I tweak them mid-game, like the width, the depth all depending on how my opponent is playing.\n\nWhat I'm trying to say is that there's only so far that tactics and setups or using glitchy mechanics can take you, even with all the cheese that happens in games, there is a huge tactical side to it, like knowing when to team press, use the offside, when to 2nd man press or use the double r1 to instead mark runs while you manually track their player, knowing which pass to make, when to make the extra pass or just go for goal, shots and shot types to take, all of those are stuff you just figure out and learn and even then, sometimes you just gotta accept that your opponent bested you. \n\nHopefully, that's helpful, it's a combination of a lot of things. My way of looking at how to improve is when I lose, I watch the game back to see where I made mistakes (obviously not every loss now but now and then)",
            "A lot of the time they switch the ball. If you show a willingness to switch, take your man with some skill moves and best the press consistently you’ll notice a lot of players switch up and be less aggressive on the defence. \n\nFor a lot of us, that simply isn’t possible but for your 20 win players that’s an average Tuesday.",
            "Start with your mentality.  You think the game is specifically out to favour your opponent and give them more stamina than you.  It honestly isn't we play the same game.",
            "“Specific button presses” is the skill in every video game ever made. People get 20 wins because they’re better players than you, not because the randomness “doesn’t happen to them”. Agreed with the other commenter, you need to assess your mentality. This game sucks but it isn’t against you specifically. \n\nIf it’s truly giving you mental distress, stop playing. No game is worth that.",
            "I would suggest just working on your overall gameplay, the meta changes every year but fundamentally if you have a good understanding of using skill moves and lb triggers as well as identifying space when attacking and good manual defending in terms of first isolating passing lanes then closing down the player with the ball and not overexposing when defending it will help your rank not only for the rest of this game but for future games.  You obviously still have to adapt to the meta in terms of finishing angles, effective skill moves and passing and defending options but if you work on identifying the areas of the game you're good at and figuring out a way to play that suits your skills it will benefit you a lot in the long term. Work on things like identifying versatile skill moves like mcgeady spin, stepovers or croquetas and practice them so that you can reliably execute them or for defending work on first positining your defender to block the most threatening and/or passing option depending on the context and then close down the attacker without overcommitting.\n\nThis game is broken and infuriating but youre benefitting at times from the exact issues youre mentioning you just dont notice them near as much when youre benefitting from them. I get 14+ wins in weekend league and have been in the elite division since the second week of the game. I dont use technical dribbling, none of my attackers are above 5'10, I dont playerlock or use most of the other 'gimmicks' you mention. If you're strugging to get past div 2 and 7 wins in weekend league its not the game targeting you and yes there is a tonne of ways this fifa to exploit broken mechanics and this is really tough to play against but to do better you need to just develop your overall gameplay by the sounds of it.",
            "That’s actually probably not true. If you’re wanting to get better at the game, you need to be fully honest with yourself about your games and how they play out because then you’ll be able to see stuff happening in game and think right that’s just the game or actually right that ones of me, then you can try and work on the things you can improve and you’ll also find that the things you’re already good at, you will become better at than you already are.",
            "Yes, Harry is probably the best person to watch when it comes to this kind of stuff, he scores all kinds of goals, you see him not lose his head, and keeps his composure, personally would like to see him back in the pro scene.",
            "One thing I will say is that a lot of us have spent an absurd amount of time on the game, which does help when you're looking to fine-tune certain mechanics, like for example player locking, it's not something you can just pick up and be a threat with, it comes with practice and then fine-tuning when to press, when not to press or fine-tuning your playstyles and knowing one pkaystyle doesn't always work and you need to be able to adapt midgame"
        ]
    },
    "New offside rule or did the ref give him advantage": {
        "title": "New offside rule or did the ref give him advantage",
        "score": 19,
        "url": "https://v.redd.it/nmfl8bxbr28d1",
        "content": "Opponent did a through lob that I think is offside (yellow advantage sign appeared) the play went on without an offside actually. Am I missing something here?",
        "num_comments": 13,
        "comments": [
            "Even in the offline modes there are bugs where a player in an offside position can score a “valid” goal. It’s due to EAs incompetence",
            "EA scriptwriters.",
            "the input for the pass was likely put in when the attacker was onside but the pass only happened when he moved offside. in these cases it is given as onside sometimes\n\nat least i think it's like that",
            "It gave advantage because you won the ball, you tried to pass it out (using the advantage) and it got intercepted. Would never happen irl but it's just how advantages are coded",
            " Can’t see the right backs position",
            "There is a bug with the foul advantage too. I am about to score lots of goals but ref whistle stop the attack and gives a foul instead of advantage",
            "![gif](giphy|Whpfk0Qdx8dEFDddsx|downsized)",
            "Yeah definitely something with the lag I don’t think would happen offline",
            "No its not like that, i do that all the time and then the game fucking delays the pass and puts my player offside, its actually annoying as fuck.",
            "Yesterday Neth vs Fra they cancelled a goal without the player even touch the ball this ball his player had it twice lol. I guess it should be basic to work properly",
            "Replay Camera angle is not that clear but check the grass lines, his attack is on the light green and all defenders are on the dark green grass.",
            "I’ve experienced this as well. It’s annoying",
            "Whoever got the advantage might have claimed the free kick (holding rt/2 and lt/2)\n\nBut yeah it's crappy how the advantage works on fc"
        ]
    }
}