{
    "Thank you Thursday! - June 20, 2024": {
        "title": "Thank you Thursday! - June 20, 2024",
        "score": 17,
        "url": "https://www.reddit.com/r/Entrepreneur/comments/1dk72fk/thank_you_thursday_june_20_2024/",
        "content": "**Your opportunity to thank the** /r/Entrepreneur **community by offering free stuff, contests, discounts, electronic courses, ebooks and the best deals you know of.** \n\nPlease consolidate such offers here!\n\nSince this thread can fill up quickly, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts.",
        "num_comments": 10,
        "comments": [
            "One of the best marketing books for SaaS, e-commerce, and agency entrepreneurs is now available. Learn how to drive 10,000 - 25,000 monthly visitors to your website to help you scale up your business.   \n  \n[Learn more here.  ](https://www.24hour.design/growth)",
            "I have a bunch of free resources for finances for businesses (ie. Financial Success Guides, Info on how to choose an entity type, CFO checklist, KPIs, etc.) - [https://www.moneymastery.work/free-tools-access](https://www.moneymastery.work/free-tools-access)\n\n\n\nI started a new podcast, Always and Never About Money, for both personal and business finances. It's free to listen to all episodes - [https://itsalwaysandneveraboutmoney.buzzsprout.com/share](https://itsalwaysandneveraboutmoney.buzzsprout.com/share)",
            "To thank the community - \n\n# I am hoping to be able to provide a place for anyone to make a business around the expertise bybuilding a scalable membership/course, and in return need feedback on how to further improve the software!\n\nHere's the link, you will get free access and get free business platform coaching - Go to this link and if it's open, there's spots available! \n\n[https://www.withme.so/reddit](https://www.withme.so/reddit)",
            "Discover the secrets to growing your social media presence with confidence and intuition. In this free ebook, you'll learn powerful tools and strategies to harness your inner wisdom and boost your online impact. As an intuitive business coach, I guide you through actionable steps to cultivate confidence, trust your instincts, and create authentic, engaging content that resonates with your audience. Start transforming your social media today\n\nSnag your free eBook here!\n\n[https://mailchi.mp/2531aacd6595/how-to-free-ebook](https://mailchi.mp/2531aacd6595/how-to-free-ebook)",
            "Fresh Kanban solution to improve your Flow and achieve better results. Complete board-building freedom, colors for any element, integrated Flow metrics and My Kanban view to see tasks from multiple projects.  \n[See the full decription here](https://teamhood.com/product/kanban-board/?utm_source=reddit&utm_medium=post&utm_campaign=kanban_2.0).",
            "Let me build your marketing funnel for free. \n\nI have some free time this next month and want to get some funnels built. You will get 30 ads to test, landing page, welcome sequence from emails and 4 Bi-weekly newsletters for your email list. \n\n  \nDM me if you are interested.",
            "Hi all, please check our SaaS out: [https://www.arbonum.com/](https://www.arbonum.com/)\n\nWe simplify managing international contractors. Our platform streamlines everything from onboarding and payroll to compliance and support. With us, you can focus on building your business, not international HR headaches. Currently, we've got about 15,000 teams worldwide using our platform to hire, manage, verify, and pay international contractors, remote workers, digital nomads, and freelancers.\n\nThank you",
            "Get Free Financial Advice & Execute Trades on Our Platform!\nHey r/entrepreneur!  Are you looking to grow your wealth through various financial avenues?  [LeadwayCapitalGroup.com](https://leadwaycapitalgroup.com) is a digital financial services provider that offers a free consultation when you visit our website to discuss your financial goals.\n\nWe offer a wide range of services to help you achieve your financial dreams, including:\n\nReal Estate: Buy or sell your next property seamlessly.\nTrading: Execute trades across various markets.\nCryptocurrency: Invest in the future of finance.\nLoans: Secure financing for your business or personal needs.\nAnd More!\nWe're a one-stop shop for all your financial needs!  Visit our website today for your free consultation and explore how Leadway Capital Group can help you take your finances to the next level!",
            "Hey everyone!\n\nIn the spirit of \"Thank you Thursday,\" I wanted to give back to this awesome community. I help non-technical founders build their MVPs, and I'm offering a free 30-minute consultation to anyone looking to bring their software idea to life. Whether you need advice on ideation, design, or development, I'm here to help. Just send me a DM to book a time.\n\nLet's build something great together!"
        ]
    },
    "What does my friend do for a living?": {
        "title": "What does my friend do for a living?",
        "score": 10,
        "url": "https://www.reddit.com/r/Entrepreneur/comments/1dlsrah/what_does_my_friend_do_for_a_living/",
        "content": "There's this guy that I used to hang out with, but I haven't in years.\n\nI see him posting on Facebook ALL THE TIME though. Every post he makes is about \"success\". He is a motivational quote machine.\n\nI see a lot of pictures of him wearing a suit on stage giving presentations too. I assume he's giving a motivational speech of some sort in these pictures.\n\nI once asked him what he actually did for a living, and he invited me to a group Zoom meeting where the rapper Fat Joe was the host. I thought it would be cool to meet Far Joe, but the Zoom meeting ended up having like 50 attendees. Fat Joe just kept talking about \"killing it in 2024\" and shit like that....but I don't actually know what it is these 50 people plan on doing.\n\nMy cousin's husband also does the same type of thing. He is always on stage giving motivational speeches, but to this day I don't know exactly what it is he does 🤷\n\nDoes anyone know what exactly this \"motivational speech\" business is?",
        "num_comments": 37,
        "comments": [
            "MLM schemes probably.",
            "Pyramid schemes never die",
            "Well maybe he does consults. \n\nMy husband and I use to do consults before my company got big. We use to teach others to do exact what we do, and at that time it was a cannabis \"green rush\" and many people wanted to learn but didn't know how. We would charge anywhere from 10k to 100k depending on grow size. (The 100k grow was a 5m dollar set up). \n\nBasically we just talk and we gave a packet that explained every single last step to go from start to profit LEGALLY and then kept contact for the first year to make sure they were making a profit. \n\n\nMaybe it's something like that. \n\n\n\nI know you are in the comments talking about scams with this sort of business but we made our clients 100 times what they gave us so our knowledge was extremely useful.",
            "Motivational speaker. Creating money out of others messed mindset. Giving them toxic positivity like drugs getting them hooked in.",
            "It’s some MLM bullshit",
            "When someone talks and you still don't know, yeah ...he's bullshitting. \n\nMotivational speaking is getting people excited enough to think they are accomplishing something when they have accomplished nothing. Some skill would be required. \n\nI once asked a typical motivation quote dipshit what he had accomplished after reading the snippet he had shared. He couldn't understand the question because he didn't consider action necessary -- just feeling. Berkshire Hathaway was inspired by the father of fundamental analysis Benjamin Graham. The word doesn't mean that anymore. \n\nTesla takes preorders. Those with an Elon Musk quote nailed to the wall ...not so inspired. Business the shit out of that, inspired and motivated online folk.",
            "Pyramid scheme 100%",
            "Sounds like they're selling 'motivation' without a real product or service behind it.",
            "100% an MLM. Probably one where the shitty \"product\" that is only there to keep the pyramid scheme within legal boundaries is some sort of investment, not a physical product.",
            "selling multi story pyramids or something",
            "I’m 69% certain it’s a “System for Success” business where they sell you on how to become successful",
            "First of all, he's trying to build an image of mysterious success, which clearly he's done well. You're interested. You're talking about him. You want to know what he does. \n\nThat's his step one to establish his personal brand. \n\nFrom here, he most likely does a bunch of things. Maybe he gives talks on success and personal improvement. Maybe he's a coach. Maybe he has a course. Maybe he sells used cars. Maybe he resells expensive watches. \n\nI think he'll never tell what he does, so he can maintain the image of mystery.",
            "Get rich scams get the scammers rich by taking money from the crowd. ",
            "He does motivational speaking and creates networking events in the process. He charges fees for admission or for access to core strategy networks. There’s work involved in pulling it all together. What is so hard to understand about this?",
            "Nice title - I will be borrowing this.",
            "Sounds like the old adage - those who can’t do, teach - or in this case - try to",
            "So you sat there for 50 minutes and still couldn’t figure out what was going on?",
            "Tell that to the Phaoroahs of Egypt. (teehehehe)",
            "Eminem should make a song about it [https://www.youtube.com/watch?v=7YAVn466YBc](https://www.youtube.com/watch?v=7YAVn466YBc)",
            "You can actually explain what you do though. This guy, on the other hand, has never been able to explain exactly what it is that he does.\n\nLike if you were to run an ad, there would be a clear headline explaining what I would get if I were to pay you.\n\nWith him, there is none of that. That is why I am wondering where the actual money exchanges hands in his business 🤷",
            "Are you still providing that service?",
            "\n\nI can say exactly what I do and exactly how I make money. I should be a motivational speaker, because I actually have evidence to prove that I do what I say.\n\nAnd I'm curious...not interested.\n\nMy toilet reddit thoughts led me to make this post. I am just genuinely curious where the actual money exchange takes place in this motivational business.",
            "You are a scammer too huh?",
            "Only proper answer really If have seen here.\n\nLook at what Tony robins has been doing for decades. People leave these motivational speaking events buzzing, they get in touch with feelings they might not know they could be capable of. All in all it’s the lowest step on the ladder of personal development but getting you out of bed/of the couch might be life changing for you. The style of comments I read here suggest once again that people trip their own leg by being terribly judgmental about what other people seem to be doing successfully.",
            "It was a legitimate question.",
            "Do you not understand the difference between 5 and 50? Maybe you need to revisit the 3rd grade. And no, I don't want to buy your course 😀",
            "So he hasn't said like one thing he does? Haha\n Not even I can teach you to be successful?",
            "Let me know when you can explain that motivational speaking = scamming. I’ll wait.",
            "Exactly, 100%. Some people’s superpower is motivating others. Motivation is a great thing.",
            "Yes, I know your question is an honest legitimate question (I should have made that clear - sorry) - it's just your title is very good and reusable.",
            "I dunno. When I asked him what he actually does, he just invited me to the Zoom meeting with Fat Joe. I couldn't sit through much more than 5 minutes of it though. Maybe they would've explained it there if I stuck around, but I couldn't get past the 10 minutes of motivation hype up in the beginning",
            "No, I don't want to buy your course.",
            "I should be a Karate teacher. I don't actually know karate though. I'm just really good at making people believe they are.",
            "So your friend maybe bought into Fat Joe's pyramid scheme? Okay yeah just did some research and yes he does do pyramid schemes and it started 9 years ago, however a few years ago he started pushing press against it by saying \"fat Joe thinks record companies are pyramid schemes\", he used the exact same words that people used about him.. very smart PR move on his part and probably why people are no listening to him now but weren't before",
            "Following this and just curious now for your take on the Green Rush - do you feel like it’s over saturated now?",
            "I got downvoted for my last reply 🤣\n\nI was just excited to meet Fat Joe because I had a CD of his when I was younger, but within 5 minutes I realized that I wouldn't actually be taking to him. It was a shitty 5 minutes 😞",
            "Awh that's aways a bummer when you meet an idol and they're just a disappointment"
        ]
    },
    "Made my second f***ing sale of $15k with my agency business": {
        "title": "Made my second f***ing sale of $15k with my agency business",
        "score": 528,
        "url": "https://www.reddit.com/r/Entrepreneur/comments/1dl2w9s/made_my_second_fing_sale_of_15k_with_my_agency/",
        "content": "A few months back, I quit my full-time software engineering job, where I was making $5k a month. \n\nI started my business to help founders build their products by partnering with them as a Tech Founder. After two months of getting everything on the road, I closed my first deal of $15k, where I am working with a founder who is building an AI-based A/B testing tool for websites, graphics, and sales copywriting. Today, I am closing my second deal of $15k more, where I will be helping a non-technical founder build Wedding Planner software. \n\nI am grateful to have made the decision, as I am on track to make more than my yearly salary within the next three months, as per my plan. \n\nNot a millionaire yet, but I will grow my business to a million dollars in the next year. Back to work; I will keep everyone posted here!\n\n",
        "num_comments": 137,
        "comments": [
            "Congrats! Enjoy those moments, they are the best, go out, have a drink. I missed out on the small wins with my business[(link)](https:\\/\\/moneymojo.beehiiv.com). Just a few questions.\n\nWhat's the lenght of the deals?\n\nHave you set-up a minimum retainer\n\nWhats your profit?\n\nHow big is your team?\n\nDon't feel pressured to answer, I am asking out of curiousity.",
            "Damn, that's amazing. Getting started is the hardest part. I'm a software developer myself. Thinking of starting an agency.\n\nI'm curious how did you get your 1st client to take a risk on you? Did you have testimonials or anything?",
            "Congrats on your new success. I’ve thought about doing this as I’m a dev myself. Do you have a set tech stack you work in?",
            "Leveraging the right tools and resources can significantly impact business growth. \n\nWhat have been the most valuable tools or resources you've relied on to scale your agency?",
            "What is the labor going to cost you?",
            "Huge congrats! That's the entrepreneurial spirit paying off!",
            "Way to kick butt.  Keep a close record of all your accomplishments and grow that portfolio.",
            "Congrats!",
            "Congrats! This is just the beginning.",
            "Why is a software engineering job earning only $60k/year?",
            "Big congrats man! I'm on the same journey myself. Started a small team 6 months ago, did 2 projects worth $7k. Currently on the lookout for the next challenge. I hope to learn a lot from your journey.",
            "That's amazing progress in a short time frame! Consistency in closing deals is key, and it seems like you're on the right path with your strategic partnerships. Leveraging resources like gotomarketnow could help you scale efficiently and expand your client base further. Keep up the momentum!",
            "Thank you for sharing.",
            "Congratulations! Looking forward for some updates :)",
            "Thats huge, Congrats man! \nHow are you selling this service? Is it 15k for the full mvp + ongoing retainer after the first version is done?",
            "Are you still looking for partnerships?",
            "I do conversion rate optimization, run about 400 a/b tests per year, would be very interested in your ai tool",
            "I will be a millionaire by next year as well. I invented a device that will change the meal delivery business. Got a product design firm ready to work with me. My prototype has been well tested with consistent positive results. It’s coming along.",
            "This is so inspiring, congrats! Would love to connect if you're looking for user research or service design expertise for these projects!",
            "Congrats. I see you are using React like myself, great choice. All the best",
            "Congratulations are in order!",
            "Share your failures too.",
            "Time to dance",
            "I do something similar but take a mix of equity and cash. If cash flow isn’t a problem it’s a way to see some upside. The downside is you have to be far more selective.",
            "Just FYI, if you approach this as a fractional CTO, you can probably make $10k - 15,000 per client per MONTH. A game changer for you.",
            "Congrats!!",
            "Thats incredible! Congratulations!",
            "Congrats!",
            "congrats! and good luck!",
            "Are you taking stock from the founders as compensation also or just cash?",
            "How long had you been a software engineer?",
            "Wow, congratulations! I'm currently trying to scale my business so I can quit my dev job and manage an agency full time. What would be some practical tips you could give to someone in order to find clients and market themselves",
            "Congrats! well deserved!",
            "Would love to join what you doing. Are you hiring by any chance?",
            "Congratulations!!🥳",
            "I’m in a very similar position——I quit my software engineering job nearly a month ago, and this is very inspiring to see. Did you have a portfolio available to win these clients over? If not, how did you do so?",
            "I need someone to help me with my project based on react. Would love to partner up",
            "Do you need investors? I am 23 from canada.lets do business together 🤷‍♂️ i can invest some money",
            "Congratulations! I am a full stack engineer doing freelance development at the moment, currently working on a contract with venture backed ed tech startup but still have extra hours I’d like to find an additional client to fill. I’d love to hear if you have any recommendations on how you’ve found success finding interest in your offer. Also I have received a couple inquiries for some larger jobs, bigger than I can take on at the moment. I would be happy to send them your way(since you have a team and could handle the bigger jobs) if you could keep me in mind for any extra work you might have come your way. Just thinking it might be mutually beneficial, anyways congratulations again, that’s a big accomplishment! Keep up the hustle",
            "Congrats on closing your second deal, Deepak! That's an impressive milestone, especially after making such a bold move from your full-time job. Helping founders build their products as a Tech Founder is a brilliant approach.\n\nI’m also on a similar journey, working with non-technical founders to bring their MVPs to life. It’s incredibly rewarding to see these ideas turn into real, functioning products.\n\nKeep pushing towards that million-dollar goal. You've got this!",
            "GGs, Hero",
            "Congrats! This is something I’m thinking about doing as well. Any tips on how you’re finding your first few clients?",
            "Congratulations 🎉🎉🎉🎉💯👌",
            "Congrats! Enjoy those moments, they are the best, go out, have a drink. I missed out on the small wins with my business[(link)](https:\\/\\/moneymojo.beehiiv.com). Just a few questions.\n\nWhat's the lenght of the deals?\n\nHave you set-up a minimum retainer\n\nWhats your profit?\n\nHow big is your team?\n\nDon't feel pressured to answer, I am asking out of curiousity.",
            "That's awesome. Congrats",
            "awesome !",
            "Have you ever wanted to be an influencer but don't feel good enough? With Generate Influencer, you can create your own AI-generated influencer and build your brand. Check it out! https://generateinfluencer.com",
            "Congratulation. This is the dream!\n\nI'm myself exploring this space however I am facing major issues trying to land a client. For now the service we provide is website design and development but my cold mails have 0% response rate. Indian clients are too frugal with money and I do not have any network abroad.\n\nHow should one go about in this case?",
            "I am a Software Developer if you need someone to jump on your team.\n\nPlease don't hesitate.\n\nI specialize in Frontend using Angular or React, but I also do backend development using Node(Nestjs).\n\nCongratulations man, more deals to close",
            "Congratulations! It's good to see business people reaching their goals and having this kind of spirit. Keep the fire burning.",
            "Congrats!This is amazing! Here in Internet Cafe Games, we also love to help business owners boost their revenues. If you are an internet business owner trying to increase your income or you want to setup an interesting new gaming system to attract more customers?\n\nWe introduce you Lady Luck, our newest and sexiest gaming system that is sure to attract your audience. Lady Luck is the future of online casinos, so spin, play, and win big! See it in action: [https://www.youtube.com/watch?v=WTTMZ\\_pOlXg](https://www.youtube.com/watch?v=WTTMZ_pOlXg)\n\n\n\nSign up today and let our ICG Sales Representative help you. Please contact us at: [https://www.internetcafe.games/contact-us](https://www.internetcafe.games/contact-us)",
            "Thanks a lot, yeah definitely small wins to enjoy and cherish for now.\n\n1. Each deals takes around 3 weeks to a month to close after the first contact as there are a lot of discussion about the final project work\n2. I haven’t setup a retainer but yeah each project is estimated to go for 3-4 months as we do the design, development, testing, etc everything.\n3. Tough question haha, but to estimate for now its 20-30% per project but this will grow as we build our product portfolio and adjust the pricing.\n4. Currently we are a team of 7 members including me\n\nI hope this answer all your queries :)",
            "Thanks a lot, definitely take a step it would lead to something fruitful if you are consistent.  \n\nI got my first client through Reddit, initially they hired us for just landing page but trusted us with our work, and signed the complete project contract. \n\nWe do have a testimonial from our first client, here it is “Deepak, the founder of LeanMVP, has played a key role in moving our project forward. I came across Deepak online and we decided to discuss my goals. Initially hesitant, I soon learned to trust Deepak and his capabilities. I was impressed with his skills, organization, and insightful suggestions. He always knew exactly what needed to be done and how to do it. His organizational skills and delivery quality are exceptional—he's always quick to respond and willing to hop on calls to get things right. Our software is still in development, but I will update this with further information soon.”",
            "Thanks a lot! For tech stack we use React and Flask, and have our expert team of designers who uses Figma and some design tools. What tech stack you use for development?",
            "Ok, I’ll be your first client!",
            "When I started, I mostly used Apollo to find leads, and cold emails and Reddit as a channel to search for clients.\n\nRight now, as we are growing, we use different tools like:\n\nLinear: Project Management \n\nQuickbooks: Payroll\n\nNotion: For project updates to be synced with the client\n \nSlack: This is for communication and exploring other marketing tools now.\n\nDo you have any other tool suggestions? I would be happy to check it out!",
            "So, right now I have a team of around 8. Few of them are consultant(AI team), and rest full time dev and designers, content creators. I am paying my dev $2k and designer $1.5k per month. I am based out of India so labor cost is bit low here for me to manage my team members.",
            "Thanks a lot; yeah, definitely, it's not an easy journey, though.",
            "Love this, definitely would try to follow!",
            "Thanks for your wishes! Do you plan on starting something similar down the road?",
            "Thanks a lot, definitely a lot to achieve ahead.",
            "I am based out of India, so earning this much in India is equivalent to $100k-$150k in US or other countries.",
            "Thanks a lot, I wish you all the best. Looking forward to at this point soon!",
            "Thanks a lot, yeah closing client consistently is the key here. I am planning to focus more on strategic sales and marketing side to get more leads, I hope that turns out to help fruitful.",
            "Thanks a lot, do you plan on starting something similar down the road?",
            "Thanks a lot, will keep here posted.",
            "Thanks a lot. So generally, the MVP budget comes out to be $15k for founders to start, but it can go up a bit if they need some more complex features in their MVP. Yeah, after the MVP version is done, the next one will be part of an ongoing retainer.",
            "Awesome, DM me please. I will connect with you the founder. We are launching the first version of this tool mid next month.",
            "Wooh, wish you all the best. I definitely hope you achieve your goals. Would love to have a talk about your product as what are you building. Can I DM you?",
            "Thanks a lot, definitely would love to have a talk! DM me please.",
            "Thanks a lot, yeah building apps with React is definitely a good choice.",
            "Haha, yeah! Thanks a lot :)",
            "There are failures in this journey when I started:\n1. I launched with subscription based pricing model, but got feedback it won’t work so moved go  project quote model\n2. Got a lot of backslash for the website copywriting as it was poor in the beginning so hired a copywriter to write everything \n3. Had some of the clients like 2 as of now who took the complete project plan but ghosted at the end\n4. And yeah a few more mistakes like hiring a outbound lead generation specialist, turns out to be that it has no outcome and the work is like a blackbox as no idea of what going on there",
            "Haha yeah for now, but a long way ahead still.",
            "Cool, how its going for you?\nYeah you can do in a mix of equity and cash, but yeah to be very selective about the projects you take for work.",
            "Thanks for this advice, I haven't thought of this, but yeah, let me think if I can make time commitments and have people get fractional CTOs for their companies.",
            "Thanks a lot!",
            "Thanks a lot :)",
            "Thanks a lot!",
            "Thanks a lot for your wishes!",
            "We don’t take stocks for now, just complete cash!",
            "I was not having a portfolio of projects for myself but yeah my LinkedIn profile was good enough yo build a bit of starting trust. And than they started with a small work of landing page, we shipped it perfectly and than it went to finalize the whole project with us.",
            "Definitely we have quite good expertise in React, as our main tech stack for the frontend side is React. Will DM you to discuss more!",
            "Thanks for your offer, though currently I am not looking for investment but let’s talk I can connect with you with some of the interested founders.",
            "Thanks a lot, that’s great to hear! I hope you are kicking off great on the project side as a freelancer and love the flexibility of work there.\n\nYeah definitely let’s talk, we can do some mutual partnership, as we have a team to work on the complete project so you can contribute to the same too as what would work BEST for you, rest with other stuffs we can help them.",
            "Thanks a lot, yeah it’s definitely a lot of fun to work with founders to build their ideas to life, as there are a lot of things which comes along the way like product research, features analysis and crafting a plan for perfect MVP for them.",
            "Thanks a lot, yeah being consistent and having patience paid off at the end!",
            "How much did you charge for landing page for the 1st customer & how long did it take? Not sure if you want it to be secret.",
            "I am curious. Funding your design team or maybe even other workers, did you save up enough to pay them or did you have some partnership with a few friends in the field and worked out a deal on that? The projects sound a lot of fun!",
            "Figma Balls",
            "How much was your initial investment? Do you have a website?",
            "Would love to have a talk with you to discuss more about what you are planning to build!",
            "Thinking of specializing in a niche, or keeping it broad?",
            "How do you differentiate yourself from other tech agencies out there?",
            "15k for the full app? Not bad. I've been having trouble finding these kinds of clients. Where are you getting them from?",
            "What company hired you?",
            "I'm going for my masters in cs in the usa, but I've always been interested in starting something of my own. Also I'm very much interested in the hotel industry. One person can like two different things right 😅.",
            "Hi, congratulations, excited to hear more. Why did you move away from the subscription model? And do you now charge an upfront portion to cover the ghosting?",
            "It’s all small victories with a few big highlights",
            "The funny thing is, I’m pretty sure I know who you made your second sale to.  Was it somebody from this forum from earlier? If it is, I hope you address any hardware problems he might have.",
            "Ok, I made about $150k off one that got acquired plus the upfront cash of $15k and only did about 5-7 days hands on code. That was quite good. Others I’ve yet to see pay off but I’ve only done 3 that way. \n\nI was previously a founder/ceo of a deeptech start up that got acquired so I do this part time to keep busy.",
            "Nice, thanks! I’d love to connect on LinkedIn, shoot me a DM",
            ">We do have a testimonial from our first client, here it is “Deepak, the founder of LeanMVP, has played a key role in moving our project forward. I came across Deepak online and we decided to discuss my goals. Initially hesitant, I soon learned to trust Deepak and his capabilities. I was impressed with his skills, organization, and insightful suggestions. He always knew exactly what needed to be done and how to do it. His organizational skills and delivery quality are exceptional—he's always quick to respond and willing to hop on calls to get things right. Our software is still in development, but I will update this with further information soon.”\n\nWe charged $1000-$1500 for a landing page which includes design and development both, which has an inbuilt form for early waitlist user signup.",
            "Great question! So, here’s the thing that as I am based out of India so dev and designer cost is bit low, and right now I am focused on building my project portfolio so not a quite big profit margin for me, but yeah moving forward this would improve, and the pricing would adjust accordingly a bit.",
            "My initial investment was not a lot, just around $2k till now. Yeah we have a website. You check check us at: https://leanmvp.co/",
            "Right now, we are specialized in a niche as our ICPs are: Non-technical founders who want to build MVP and early-stage startups. \n\nBut I want to get broad once we grow a bit. That's the plan.  Do you run an agency too?",
            "how about creating a market place for all the ai agencies and the clints",
            "The thing is that there’s not a big differentiator with   Tech agencies, only the differentiator can be the quality of services. I work quite closely with all of the founders, as help them with any questions they have to build a successful product.\n\nOur goal is not just to ship a perfect software but to make their product successful in the market.",
            "Why not? Specialization has ruined us. I like everything from software to physics to comedy to movies.\n\nBut that comes its own faults lol. You are always in learning mode then.",
            "Good luck for your masters!\n\nYeah definitely exploring different ideas in your free time is ideal. What sort of business you want to do in hotel industry? Like starting a restaurant, cafes or something else.",
            "Completely agree, small wins to celebrate for sure!",
            "Haha not sure, but it was not from this forum. As he reached out to me in DMs like 2-3 weeks ago, and we discussed the complete project before finalising it.",
            "That's huge, It's good to hear that all the deals were successful, as I think your past experience of being a CEO helps a lot in the project selection.\n\ntalk with you and see if there's a chance of a mutual partnership. We could share the development overhead, and you could be involved in the projects of multiple companies. Can I DM you?",
            "That's very cheap actually. There are just design agencies charging $4-5k/mo & have 1 person doing the whole thing lol.\n\nThey make over $100k/month or something. Idk how they manage that without overworking.",
            "Congrats man. In which subreddit you found your first client?",
            "That is interesting. I was thinking too from reading your post that starting something like an agency for tech or even marketing would require you to ensure you don't overwork yourself so hiring help would be essential eventually. I am not an expert, I'm still someone learning even what it may take to run a business but it does seem like you are on the right track. Build up that case where you are the company for the project someone has to the point where they cannot refuse you because it would be crazy to.",
            "Thank you, also what did you use to create your clients landing page? I am new to this and just trying to put the picture together. Sounds super interesting",
            "No, but i am picking up brains of various agencies founder ; i want to start ai agency ; what advice can you give? i have never done cold email before, does it still work ?",
            "Ideally a restaurant. I love good food.",
            "Who knows, either way good luck.",
            "Thanks for the kind words. I’m actually keen on flying solo for a while. My last start up was U.K./US based and I’m pretty burnt out from it. Now I just work at my own pace!",
            "Yeah we are actually a bit cost effective for founders so budget should not be a blocker for them to start with their product development.",
            "Thanks a lot, I don’t remember the subreddit exactly but I think it was in the SaaS or EntrepreneurRideAlong",
            "So the landing page designs were created by our design team in Figma, and than it was developed in React. We are doing one more updates to landing page soon as to add some of the products dashboard design which would be LIVE soon by early next week.",
            "Got that, AI agency has quite a good market these days based upon the evolution of GenAI. So, if you have experience in that start by buying some products so you have something to showcase to your clients.\n\nI tried cold emails, but till now I haven’t got any successful leads through it. I recently changed my strategy and have planned to launch next batch of cold emails starting next week. Will let you know how that went.",
            "I’m in tech sales and send hundreds of emails per week. I get maybe 1 prospect from emails every 2-3 weeks. Cold calling is king.",
            "Awesome! Even I love good food and exploring new cafes, restaurants and new cuisine around my place.",
            "Thanks again, i hope it would be definitely great if I got some leads from here around to help people looking for the same.",
            "What’s the general format of your cold emails (overall tone, personalization, etc)? Is that a pretty common conversion rate for tech sales cold emails?",
            "😁",
            "We are told to keep it very short and to the point. Yes you want to personalize the email some and tailor it for the prospect. I don’t know about other organizations but here, email just doesn’t convert like a cold call. I’m emailing directors of IT, CTOs, etc and I imagine they are constantly flooded with emails. Might have better luck with a different type of prospect."
        ]
    },
    "Neurodivergent entrepreneurs here?": {
        "title": "Neurodivergent entrepreneurs here?",
        "score": 5,
        "url": "https://www.reddit.com/r/Entrepreneur/comments/1dlu1g7/neurodivergent_entrepreneurs_here/",
        "content": "I’m wondering if there are any neurodivergent entrepreneurs here that have been able to find success despite their adhd, autism, etc.\n\nWhat did you do different, or any tricks to go around the problems of being neurodivergent and instead have it work to your benefit?\n",
        "num_comments": 16,
        "comments": [
            "Hi friend 😆 good question! The short answer for me is really doing what feels right.\n\nYour methods for achieving your goals are gonna be very unique to you. Read a lot. See what works. And apply it 😄 ",
            "Are you looking for excuses to use yours as a crutch?\n\nI read \" Pattern Seekers\" by Simon Baron Cohen, which changed stigma into strength.",
            "Neurodivergent or not, entrepreneurial mindset is using whatever you have as a strength. If you think you are a victim of something, you don’t gonna go THAT far.\n\nI’m Asperger, lots of disabilities in social life, but comes with many unique strengths. \n\nChange your mindset, don’t point out only your “weaknesses”. You don’t have weaknesses if you use it at the best.",
            "I'm autistic and found solo entrepreneurship helps me focus on my strengths!",
            "Bipolar here. Was able to manage the manic side to get loads done, whilst keeping the depressive side muted",
            "I never looked at my adhd as disability. Instead it helped me hyperfocus and connect patterns, calling it disability would be self harm. \n\nAlso as per my observation adhd thrives in chaos and entrepreneurship is all about turning chaos into system.",
            "Highly successful, autistic entrepreneur, here. Entrepreneurism was my best path to leveling up, and ultimately succeeding. After becoming successful as an entrepreneur, I’m actually now in an executive role working for someone else. But, I could have never gotten to the point, I am at now, if I had gone the traditional route.",
            "Is being Neurodivergent a new cool trend in business? I've seen this crop up on LinkedIn recently where people are now describing themselves as 'Neurodivergent Founder' or 'Neurodivergent Entrepreneur'.\n\nWhy is there a need to 'show off', for lack of a better term, that you are neurodivergent?\n\nPersonally the people I have seen do it are screaming out for attention and hoping to raise capital. Maybe they think investors will perceive them as gifted in some way. I think Elon going public with his Aspergers kick started this trend.",
            "I’m working with a therapist who specializes with neurodivergent people. I’m working through’ your brain is not broken’ now which is good so far. It just helps me to id and mitigate the downsides I guess you could say\n\nI was having issues staying focused at my 9-5 and just recently got diagnosed so started but without the support have always had success at work because I work hard and smart",
            "I have really bad adhd and my husband's adhd is so bad that as a child brain institutes studied him for a few years haha he is also autistic, he says I probably am too but i don't know, I'm for sure socially anxious and have adhd though which I suppose could mimic autism in some ways. \n\nI think it gives us an edge, our adhd is amazing for bouncing ideas off each other but also gives a lack of follow through so we are both on top of each other to help each other to get from point a to z. \n\n\nWhen I get a crazy adhd hyper focus I go with it and made it go with the current project. Hyper focus is great but can make things a little sloppy so I always go back and fine tune my plans after the fact",
            "Hi there,\n\nwhy would being neurodivergent be a disability? Like, that's offensive on multiple layers. You can be normal and successful. Look at highly successful individuals - they can be everything but the social norm. Problem of beeing neurodivergent? Why seek problems? Can't being neurodivergent be a real asset?\n\nLike isn't entrepreneurship all about being different? Doing it YOUR way?\n\nLike, let me repeat one more time... Normal is working a 9-5. Entrepreneurship diverges from the social norm.",
            "Quite the opposite. \n\nI’m looking to recognise what I’m good and bad at because of it, and then learning what works best for me.\n\nFor example, I know that I need to create artificial deadlines for myself to create some stress to get me into action. Or that I have a lot of trouble with starting and switching between tasks. \n\nI don’t see being neurodivergent as inherently bad and something to use as an excuse at all, but some methods others use don’t work for me and I want to learn from others like me and what they do to achieve success",
            "I love his Borat movie and Ali G character",
            "I’m aiming to recognise what my weaknesses are and to know how to make them work for me instead.\n\nI have adhd and level 1 autism. A strength for me would be hyperfocus, and a weakness would be difficulty starting and switching between tasks, and controlling what I focus on. \n\nAnd another thing is because of a natural lower dopamine level, nothing really feels enjoyable to me. \n\nNow with this specifically you can see it as “if nothing makes me feel happy I might as well do nothing.”\n\nor “if everything feels the same I might as well only do things that are beneficial.” \n\nThat’s an example of the type of mindset i have.\n\nI did feel like a victim when I was a lot younger, but now I want to learn from others who are like me and see how they do it",
            "I don’t know about it being a trend, I’m just looking to see how others handle the problems that come with it"
        ]
    },
    "Entrepreneurship": {
        "title": "Entrepreneurship",
        "score": 3,
        "url": "https://www.reddit.com/r/Entrepreneur/comments/1dlu90j/entrepreneurship/",
        "content": "Considering Entrepreneur is just the french word for business owner, or a person who starts a business. \n\nWhat does entrepreneur mean to you?",
        "num_comments": 1,
        "comments": [
            "It means challenger, Lisk taker for me"
        ]
    }
}