{
    "Kickoff to Pride Month! Engage in Vibrant Discussions, Win Amazing Prizes, and Celebrate LGBTQIA+ Spec Fic": {
        "title": "Kickoff to Pride Month! Engage in Vibrant Discussions, Win Amazing Prizes, and Celebrate LGBTQIA+ Spec Fic",
        "score": 269,
        "url": "https://www.reddit.com/r/Fantasy/comments/1d5r6ik/kickoff_to_pride_month_engage_in_vibrant/",
        "content": "[Pride Fantasy Banner featuring a colorful dragon and beautiful space ships!](https://preview.redd.it/3bgg2ootex3d1.png?width=1200&format=png&auto=webp&s=ed6f6d7751a51fac16aa62c4b9820865ead54500)\n\nHey everyone,\n\nHappy Pride Month! 🌈 I'm so excited to celebrate with you all and share our lineup of engaging and thought-provoking discussions. This month, we're shining a spotlight on the incredible diversity within speculative fiction in this sub. Whether you’ve been a fan for years or are just diving in, come explore a rich tapestry of narratives that uplift and celebrate LGBTQIA+ voices with us.\n\n# Pride Month Topics and Dates\n\n**Week 1: Diverse Narratives**\n\n* June 1 (Sat): Kickoff to Pride Month! Intro Post (that's this one!)\n* June 3 (Mon): [Gender Identity in Spec Fic: Memorable Characters and Stories](https://www.reddit.com/r/Fantasy/comments/1d781eg/pride_month_discussion_gender_identity_in_spec/)\n* June 5 (Wed): [Hidden Gems: Underrated LGBTQIA+ Spec Fic Books](https://www.reddit.com/r/Fantasy/comments/1d8w1ow/pride_month_discussion_hidden_gems_underrated/)\n* June 7 (Fri): [Horror with Heart: LGBTQIA+ Characters in Horror Fiction](https://www.reddit.com/r/Fantasy/comments/1dafqff/pride_month_discussion_horror_with_heart_lgbtqia/)\n\n**Week 2: Diverse Relationships in Fantasy**\n\n* June 10 (Mon): [Bisexual Characters in Spec Fic: Who Are Your Favorites?](https://www.reddit.com/r/Fantasy/comments/1dcr865/pride_month_discussion_bisexual_characters_in/)\n* June 12 (Wed): [Non-Binary & Trans Heroes in Spec Fic](https://www.reddit.com/r/Fantasy/comments/1deaz49/pride_post_discussion_nonbinary_trans_heroes_in/)\n* June 13 (Thur): BB Bookclub Midway Discussion: Dionysus in Wisconsin by E.H. Lupton\n* June 14 (Fri): [Ace / Aro Visibility and Recommendations](https://www.reddit.com/r/Fantasy/comments/1dfvw23/ace_aro_visibility_and_recommendations/)\n\n**Week 3: Deep Dives and Analyses**\n\n* June 17 (Mon): [Science Fiction: Queer Themes in Dystopian Worlds, Post-Apocalyptic Fiction, and World-Building](https://www.reddit.com/r/Fantasy/comments/1di8aio/pride_month_discussion_science_fiction_queer/)\n* June 19 (Wed): [Celebrating Queer Love Stories in Spec Fic](https://www.reddit.com/r/Fantasy/comments/1djpzom/pride_month_discussion_celebrating_queer_love/)\n* June 20 (Thur): [Intersectional Identities: BIPOC, Disabled, Neurodiverse, or Otherwise Marginalized Queer Narratives](https://old.reddit.com/r/Fantasy/comments/1dkcm2n/pride_month_discussion_intersectional_identities/) - hosted by /u/[ohmage\\_resistance](https://old.reddit.com/user/ohmage_resistance)\n* June 21 (Fri): [Queer Coding in Classic Fantasy & Reflecting on the Authors that Paved the Way](https://www.reddit.com/r/Fantasy/comments/1dl87ry/pride_month_discussion_queer_coding_in_classic/)\n\n**Week 4: Celebrating Representation**\n\n* June 24 (Mon): Spotlight on Queer Authors & Works: Who & What Are Your Favorites?\n* June 27 (Thur): BB Bookclub Final Discussion: Dionysus in Wisconsin by E.H. Lupton\n* June 28 (Fri): Personal Impact: How Has Queer Spec Fic Influenced You?\n* June 30 (Sun): Reflecting on Pride Month & Queer Futurism: What Do You Want to See? \\[And announcement of Giveaway Winner(s)\\]\n\n**Join Us!**\n\nWe encourage everyone to share their thoughts, favorite reads, and personal stories about how queer speculative fiction has impacted their lives. Discussions and posts will be made by your lovely BB Bookclub hosts \\[u/xenizondich23, u/eregis, and u/tiniestspoon\\]. All posts will be linked back to this mega thread so you can easily find the discussions again.\n\n**Giveaway Information**\n\nTo make this month even more special, I am hosting a giveaway! A handful of participants who actively join our discussions with insightful, respectful, and engaging comments will be randomly selected to win some exciting prizes. Your participation not only enriches our community but also brings visibility to the diverse and inclusive world of speculative fiction. Prizes will depend a bit on where you live, but I am willing to buy a few copies of queer spec fic books to ship, or to make some fun pride themed accessories (I knit, crochet, weave, sew, embroider, etc. and love making things). Final list of prizes to come.\n\nStay tuned for more posts, and let’s make this Pride Month a celebration of diversity, inclusion, and the power of stories to bring us together.\n\nHappy Pride Month! 🎉\n\nEDIT: Exciting things happening in the background! We have a new topic addressing intersectionality on June 20, and I've had a couple of people reach out to me to add to the prize pool! It'll probably take me a bit longer to sort out the giveaway now, but hey, we have a month! I'll make a comment with all the prizes and link it in this post when it's done!",
        "num_comments": 82,
        "comments": [
            "Happy Pride everyone! This series of posts is part of a user-run Pride event, with the mod's full support. This is a reminder that r/Fantasy is dedicated to being a warm, welcoming community and rule 1 always applies. Please be respectful and note that any homophobic comments will be removed and the mod team will take escalated action as needed. Thank you!",
            "This is SO much more than I expected to see on this sub for Pride, you guys are knocking it out of the park!",
            "Looks great!",
            "This looks great! I can't wait for all the great discussions (and losing control on my TBR pile!)",
            "Ahh, I've been so busy with, like, real life stuff but I'm so excited to see this wonderful slate of topics! Hopefully mid-next week I'll have time to reddit properly again in time for non-binary and trans and maybe I'll even have caught up with reading and be able to do the book discussion. Can't wait to go through the ones I've missed and once again expand the tbr!",
            "It took me a bit initially to find this post, as the posts in the series haven't been linking back to this index. I've been posting the index link for people in places, but a lot more would see it if the listed posts all had a link back.",
            "Dragon from the banner looks very cool. I'm looking forward to all the new book recs, thanks for organizing!",
            "I'm still learning to Reddit, even after how many years? So hopefully I can keep track of all this, but it looks like some interesting topics!",
            "Permission to cross post on r/QueerSFF  ?",
            "Thank you so much for doing this! I'm **so** excited for all of these discussions, but especially excited for the week 2 discussions! Shining a spot light on bisexual, NB, trans, and ace/aro characters is something I'm really looking forward to.",
            "Wow 🥹 This is so exciting. Thanks to all of the BB hosts for coming up with this great slate, and thanks to the mods for supporting it. I am really looking forward to the discussions, which all look fabulous and are so thoughtful too. I'm heading to my drafts to start putting together recs!  \n\n\nAs a queer person this makes me feel so welcome and supported here on r/fantasy 🥹 This is my favorite community and it means a lot to me.  \n\n\nThank you ❤️🧡💛💚💙💜🤎🖤",
            "Let's gooooo 💃 ",
            "Oh wow, this is really cool!  This looks like it has a lot of thought and effort put into it, and I really appreciate it.  Happy Pride!   Very excited for authors who paved the way in particular!",
            "I love all of this! Happy Pride, r/Fantasy!",
            "Looks like a lot of fun, I hope we can have this every year!",
            "So psyched!",
            "What a great lineup! Looking forward to some good discussions (and recommendations)",
            "Super exciting! Thank you very much for organizing this! <3",
            "Ooh looking forward to this. What stands out are the Horror with heart so I can plan my Sapphic horror month for October like I did last year. Also the Ace/Aero discussion is always a treat to see.",
            "I hope to do a Pride specific related post every day this month. I probably won't succeed but it won't be for lack of trying.",
            "This looks really cool, definitely looking forward to what people come up with in week 3!\n\nI know I'm going to not have access to my laptop on the 14th (or WiFi, but mobile data exists), so I'm thinking I should probably prepare something for ace/aro recommendations. Any hints for format? \n\nIf you do make stuff, I'd definitely love to see pictures (I knit and cross stitch, and am currently learning to spin (2nd attempt at making a skein went much better than 1st!)). And speaking of, the short story author K.A. Cook has a lot of basic little [pride cross stitch patterns](https://aroworlds.com/pride-patch-tutorials/patch-pattern-gallery/) for anyone interested. Very beginner friendly and there are tutorials on the website too.",
            "I've been doing all-queer spec fic Bingo Cards for going on five years now and I'm excited to do some recommending.",
            "This is the absolute best surprise! I can’t wait for some of these discussions. Really appreciate that this is probably quite a bit of effort for the BB team ❤️.\n\n(Petition to make that the permanent banner here pls)",
            "I’m excited to see what will be discussed and hopefully find some new books to check out. Love the banner, btw.",
            "I'm beyond stoked for these topics! I do wish that there was at least one focused on BIPOC queer authors, readers and narratives. But I look forward to seeing everyone include those into each of the topics.",
            "this sounds awesome!! can’t wait to get more book recs!",
            "Excited for this, I’m really looking forward to discover new authors and stories involving queer people",
            "What is BB Bookclub?\n\n(Please tell me it stands for Bisexual Blast, the new Slurpee flavour at 7-Eleven)",
            "What a great incentive, thanks for organising this! Looks like it'll be an exciting month for the sub, yay!!",
            "This is awesome!  Great idea.  I'm looking forward to some good recs to add to the endless tbr \n\n\n\n❤️🧡💛💚💙💜🏳️‍🌈🏳️‍⚧️\n\n\nHappy pride month to all the lgbtq+ friends out there.",
            "This looks like a lot of fun,I'll be here!",
            "Wow, this looks like a fantastic lineup of topics! Thanks for organizing this. ",
            "Nice ! Happy pride everyone ! I'm trying to only read LGBTQIA+ books this month but I'm kind of in a reading slump tbh",
            "Oh, this is exciting. Looking forward to the discussions and book recs!",
            "Oh this looks awesome! It's been such a joy to watch queer specfic sort of explode over the last ~10 years. Of course there was some before that but these days it feels like a veritable buffet of excellent books. My TBR list is 100+ books long and like 75% of those are some flavor of queer. Excited to dive into these threads over the last month and make my list even longer!",
            "i'm so excited!",
            "Ooo so many fun topics!",
            "so good. happy pride month!",
            "This sounds like so much fun!",
            "This sounds great! I have lots of queer indie book reccs to share, and I'm always looking for more.",
            "Looking forward to these posts! I’m aiming to read queer books all month so it would be great to get some extra recs!",
            "Happy Pride Month! I can't wait for these recs and discussions 😍",
            "Hi there! Based on your post, you might also be interested in our [2023 Top LGBTQA+](https://www.reddit.com/r/Fantasy/comments/18etlox/rfantasys_2023_top_lgbtqia_books_list/) Books list.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fantasy) if you have any questions or concerns.*",
            "So cool!",
            "Mods you guys are awesome!",
            "Hi there! Based on your post, you might also be interested in our [2023 Top LGBTQA+](https://www.reddit.com/r/Fantasy/comments/18etlox/rfantasys_2023_top_lgbtqia_books_list/) Books list.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fantasy) if you have any questions or concerns.*",
            "Hi there! Based on your post, you might also be interested in our [2023 Top LGBTQA+](https://www.reddit.com/r/Fantasy/comments/18etlox/rfantasys_2023_top_lgbtqia_books_list/) Books list.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fantasy) if you have any questions or concerns.*",
            "Hi there! Based on your post, you might also be interested in our [2023 Top LGBTQA+](https://www.reddit.com/r/Fantasy/comments/18etlox/rfantasys_2023_top_lgbtqia_books_list/) Books list.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fantasy) if you have any questions or concerns.*",
            "[removed]",
            "[removed]",
            "[removed]",
            "Ah I can do that! This post is stickied at the top of the sub for this month, so I figured it'd be very easy to find. However, you're right that a link back to the main index would be helpful. I'll get right on that. :)",
            "Yeah that dragon is so cool!! I love it. I don't know who made it but the mods were gracious enough to let me use the banner image.",
            "Yes please! Share away :)",
            "Yeah me too! I have a couple of authors in mind for that one but I'm hoping there's a few people here who can share stories of the 80s and 90s (or earlier) and which authors were making their mark. It was hard sorting all the topics into weeks since I want to discuss them all today! But this is better; gives us all some time to think about things and make great recommendation lists.",
            "That is a great theme! I've been exposed to so much more excellent horror in the last year. I was playing around with doing a bingo card just for horror but I'm not ready to read that much yet. I do hope you post about your reading in October then! I'll be looking forward to it. (And if you didn't join us in the BB Bookclub last October then you need to read The Spirit Bares its Teeth by Andrew Joseph White)!",
            "Ohhh Sapphic horror month sounds amazing",
            "That was my original goal too, but it is a lot of work!! If you manage it I'll be very impressed. And really happy. :) so many good book recommendations in your thread today already.",
            "Are you on Ravelry? If so, let's be friends! \n\nRight now for the format I have a list of recommended books and some discussion questions. Anything you'd like to contribute to the topic is welcome! \n\nAh those cross stitch patterns are great. :) I've also found a few really fun accessories to make (hats, mitts) that aren't overtly rainbow but still colorful that I'd love to share. \n\nI'm currently growing flax in my garden to hopefully spin into yarn later. It's a completely different kind of spinning, but if they Egyptians could hand spin it I'm willing to learn.",
            "I want you to know that I LOVE your bingo cards! I'm not sure if I've ever commented on your posts or bingo reviews, but I always upvote them and think it's awesome you've done so many years in a row of queer SFF bingo cards.",
            "Yeah I had topics for every day of the month, but we decided that that was just too much work. So, instead, I have put a  lot of bipoc recommendations strewn throughout all of the other various topics. There's not a specifically dedicated post, but I also didn't want to neglect other forms of diversity. \n\nYou are also welcome to make your own thread (or push /u/ct_phipps to make such a post on one of his planned daily pride posts)!",
            "Even if xenizondich23, eregis, and tiniestspoon don't feel up for it, I'm sure someone can make a post about BIPOC queer rep on one of the days nothing is planned for this.",
            "Haha, that's a great name! But it's not just for bisexuals. It stands for Beyond Binaries. [Here](https://www.reddit.com/r/Fantasy/comments/1c4r5dg/bb_bookclub_our_june_read_is_dionysus_in/) is our announcement for the June reading! Find a copy of the book and read along with us! We'd love to have you. You can always find the /r/fantasy book club links, upcoming book announcements, and any other information at the top most stickied thread in the subreddit (the Monthly Book Club Hub one).",
            "> some good recs to add to the endless tbr\n\nI have a lot! Too many, to be honest. A lot of the lists I've made have more well-known books (Left Hand of Darkness, Locked Tomb, The Starless Sea, just to name a few) but I also have a lot of more obscure ones! So I hope there's something in there for you as well :)",
            "Aww yeah! I won't be the only one recommending things! I hope to find a few new reads that I have yet to encounter as well. This bodes well.",
            "I'm looking forward to hearing all the reviews in the Personal Stories or the last post then! I hope you read some great ones.",
            "This comment has been removed as per **Rule 1**. r/Fantasy is dedicated to being a warm, welcoming, and inclusive community. Please take time to review our mission, values, and vision to ensure that your future conduct supports this at all times. Thank you. \n\nPlease contact us via [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FFantasy) with any follow-up questions.",
            "This comment has been removed as per **Rule 1**. r/Fantasy is dedicated to being a warm, welcoming, and inclusive community. Please take time to review our mission, values, and vision to ensure that your future conduct supports this at all times. Thank you. \n\nPlease contact us via [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FFantasy) with any follow-up questions.",
            "The dragon is a [canva asset](https://www.canva.com/icons/MAEmSJcXecE/) by [Anna Teerleva](https://www.canva.com/p/id/BADcfj-z90c/), looks like she has a few other super cutes ones too. The banner was made by u/eriophora, greatly improving an initial draft I made.",
            "Posted!\n\nI'm so excited, thank you for this!",
            "Thank you very much!\n\nEdit:\n\nOops, its against the rules to do so many planned posts. I will probably do some consolidated posts instead. Still, I am so excited to participate in all of these above!",
            "I AM on ravelry. Username same as here (I am useless at usernames). I don't have any friends on ravelry currently, and mostly use it to keep track of my stash/needles/projects (so many people want to know how long things took to knit! Can just look it up). I'm currently knitting a blanket just from stitch patterns, so not much interesting updates either.\n\nCool. If I'm organised, I will prepare something in a simple format, and be ready to respond to things.\n\nGrowing your own flax to spin is next level stuff! I won't say it hasn't crossed my mind to aquire an angora when I can finally have rabbits (I reject the dog/cat binary, rabbits forever), but that's not happening in the near future.",
            "Aww thanks! One of the most fun parts of it for me has definitely been discovering just how much queer spec fic there *is* out there.",
            "Absolutely. Just would have loved to see it be part of the semi-official celebration. Or an acknowledgement in the post or something.",
            "This is a good point. u/xenizondich23, would it be possible for ether me or beldaran1224 to make a guest post about BIPOC queer representation (or maybe intersectional queer representation if we want to be more broad and include things like disability neurodiversity, class, etc.) and have that added to the schedule in the post/be part of the series? I understand if not, I don't want to step on your toes, but I think this would be a really important topic to discuss explicitly and really focus on instead of just mentioning it as more of a sidenote in other discussions.\n\n~~Also, are you going to be using this post as a table of contents/directory/list of links so that people can easily find previous days' posts once they're up? Because that might be particularly helpful if posts get downvoted off the main page quickly. (If you don't want to do it, I can try to make a comment that contains the list of links as well.)~~\n\nEdit just realized that the post says all following posts will be linked back.",
            "It's very welcome! If you want to schedule a specific day for me to include on the list let me know which day and the title of your post and I'll be happy to add it.  You can send me a PM (not chat please) if you'd prefer.",
            "Hi, I have a different Pride post question I wanted to ask you, but couldn't PM you - would you mind PMing me instead so I can respond to it? If not I totally understand and can just ask here instead."
        ]
    },
    "r/Fantasy Megathread and Book Club Hub. Get your links here!": {
        "title": "r/Fantasy Megathread and Book Club Hub. Get your links here!",
        "score": 58,
        "url": "https://www.reddit.com/r/Fantasy/comments/1d79m9k/rfantasy_megathread_and_book_club_hub_get_your/",
        "content": "This is the Monthly Megathread for June. It's where the r/fantasy mod team links important things. It will always be stickied at the top of the subreddit. Please regularly check here for things like official movie and TV discussions, book club news, important subreddit announcements, etc.\n\nLast month's book club hub can be found [here](https://www.reddit.com/r/Fantasy/comments/1cjbngl/rfantasy_megathread_and_book_club_hub_get_your/)\n\n**Important Links**\n\nNew Here? Have a look at:\n\n* [Subreddit Rules](https://new.reddit.com/r/Fantasy/wiki/rules)\n* [A guide to our many lists & resources](https://www.reddit.com/r/Fantasy/comments/f4o9ym/where_do_you_find_new_books_a_guide_to_using/)\n* [Recommendation Guide](https://www.reddit.com/r/Fantasy/wiki/recommendations)\n* [ICYMI - r/ Fantasy originals](https://www.reddit.com/r/Fantasy/comments/ha2vqm/icymi_rfantasy_originals_the_2019_top_novels_poll/)\n\nYou might also be interested in our yearly [BOOK BINGO reading challenge.](https://www.reddit.com/r/Fantasy/w/bingo)\n\n**Special Threads & Megathreads**:\n\n* [Pride Month](https://www.reddit.com/r/Fantasy/comments/1d5r6ik/kickoff_to_pride_month_engage_in_vibrant/)\n* [2024 BOOK BINGO CHALLENGE](https://www.reddit.com/r/Fantasy/comments/1bt4iqf/official_rfantasy_2024_book_bingo_challenge/)\n* [2024 BINGO RECOMMENDATION THREAD](https://www.reddit.com/r/Fantasy/comments/1bt4km0/the_2024_rfantasy_bingo_recommendations_list/?utm_source=share&utm_medium=web2x&context=3)\n* [2023 Top LGBTQIA+ Books List](https://www.reddit.com/r/Fantasy/comments/18etlox/rfantasys_2023_top_lgbtqia_books_list/)\n* [2024 Top Standalone Books List](https://www.reddit.com/r/Fantasy/comments/1agicpw/rfantasys_2024_top_standalone_novel_poll_results/)\n* [2024 Top Podcasts Voting Thread](https://www.reddit.com/r/Fantasy/comments/1cfy7ra/rfantasys_top_podcasts_poll_voting_thread/)\n\n**Recurring Threads**:\n\n* [Daily Recommendation Requests and Simple Questions Thread](https://www.reddit.com/r/Fantasy/search?q=Daily%20Recommendation%20Requests%20and%20Simple%20Questions%20Thread&restrict_sr=1&t=day)\n* [Monday Show and Tell Thread](https://www.reddit.com/r/Fantasy/search?q=-%20Monday%20Show%20and%20Tell%20Thread&restrict_sr=1&t=week)\n* [Review Tuesday - Review what you're reading here!](https://www.reddit.com/r/Fantasy/search?q=Review%20Tuesday%20-%20Review%20what%20you%27re%20reading%20here!&restrict_sr=1&t=week)\n* [Writing Wednesday](https://www.reddit.com/r/Fantasy/search?q=Writing%20Wednesday&restrict_sr=1&t=week)\n* [Friday Social](https://www.reddit.com/r/Fantasy/search?q=%20Friday%20Social&restrict_sr=1&t=week)\n* [Dealer's Room: Self-Promo Sunday](https://www.reddit.com/r/Fantasy/search?q=Self-Promo%20Sunday&restrict_sr=1&t=week)\n* [Monthly Book Discussion](https://new.reddit.com/r/Fantasy/search/?q=%22r%2FFantasy%20monthly%20book%20discussion%20thread%22&restrict_sr=1&sr_nsfw=&t=month)\n\n**Book Club Hub - Book Clubs and Read-alongs**\n\nhttps://preview.redd.it/awq0njt42e4d1.png?width=1200&format=png&auto=webp&s=72ac31bf1d937091cea660dece542ad90f47a7f2\n\n**Goodreads Book of the Month**: Strange Beasts of China by Yan Ge\n\nRun by u/fanny_bertram and u/kjmichaels.\n\n* [Announcement](https://www.reddit.com/r/Fantasy/comments/1d2joe9/our_june_goodreads_book_of_the_month_is_strange/)\n* [Midway Discussion](https://www.reddit.com/r/Fantasy/comments/1dcmg43/goodreads_book_of_the_month_strange_beasts_of/)\n* Final Discussion: Jun 24th\n\n**Feminism in Fantasy**: A Study in Drowning by Ava Reid\n\nRun by u/xenizondich23, u/Nineteen_Adze, u/g_ann, and u/Moonlitgrey\n\n* [Announcement](https://www.reddit.com/r/Fantasy/comments/1bzgcmc/fif_book_club_our_june_read_is_a_study_in_drowning/)\n* [Midway Discussion](https://www.reddit.com/r/Fantasy/comments/1deepz3/fif_book_club_a_study_in_drowning_midway/)\n* Final Discussion: Jun 26th\n* [July - Chain-Gang All-Stars](https://www.reddit.com/r/Fantasy/comments/1cnxdw2/fif_book_club_our_july_read_is_chaingang_allstars/)\n\n**New Voices**: The Heretic's Guide to Homecoming by Sienna Tristen\n\nRun by u/HeLiBeb, u/Cassandra_Sanguine, and u/cubansombrero\n\n* [Announcement](https://www.reddit.com/r/Fantasy/comments/1d2ix9q/new_voices_book_club_in_june_well_be_reading_the/)\n* [Midway Discussion](https://www.reddit.com/r/Fantasy/comments/1ddecfc/new_voices_book_club_the_heretics_guide_to/)\n* Final Discussion: Jun 25th\n\n**Happily Ever After**: Returning in July!\n\nRun by u/HeLiBeB and u/thequeensownfool\n\n**Beyond Binaries**: Dionysus in Wisconsin by E.H. Lupton\n\nRun by u/xenizondich23, u/eregis, and u/tiniestspoon.\n\n* [Announcement](https://www.reddit.com/r/Fantasy/comments/1c4r5dg/bb_bookclub_our_june_read_is_dionysus_in/)\n* [Midway Discussion - Jun 13th](https://www.reddit.com/r/Fantasy/comments/1df7t3y/bb_bookclub_dionysus_in_wisconsin_by_eh_lupton/)\n* Final Discussion: Jun 27th\n\n**Resident Authors Book Club**: Thralls of a Tyrant God by Mars G. Everson\n\nRun by u/barb4ry1\n\n* [Announcement May-June](https://www.reddit.com/r/Fantasy/comments/1chqnua/bookclub_rab_poll_results_reading_list_for_may/)\n* Author Q&A\n* [Midway Discussion](https://www.reddit.com/r/Fantasy/comments/1dhch1h/bookclub_thralls_of_a_tyrant_god_by_mars_g/)\n* Final Discussion\n\n**Hugo Readalong**:\n\n* [Announcement & Schedule](https://www.reddit.com/r/Fantasy/comments/1bvlu9f/2024_hugo_readalong_announcement_and_schedule/)\n* Novella - Rose/House: [Jun 3rd](https://www.reddit.com/r/Fantasy/comments/1d74hra/2024_hugo_readalong_rosehouse_by_arkady_martine/)\n* Semiprozine - Escape Pod: Jun 6th\n* Novel - Starter Villain: Jun 10th\n* Novelette - I am AI & Introduction to the 2181 Overture, Second Edition: Jun 13th\n* Novella - Seeds of Mercury: Jun 17th\n* Semiprozine - FIYAH: Jun 20th\n* Novel - Translation State: Jun 24th\n* Short Story - Better Living Through Algorithms, Answerless Journey, Tasting the Future Delicacy Three Times: Jun 27th",
        "num_comments": 7,
        "comments": [
            "I'm currently reading Dionysus in Wisconsin by E.H. Lupton, and enjoying it for the most part! Looking forward to the discussion",
            "Any recommendations for series like game of thrones that isn't first law?",
            "Hi there! Based on your post, you might also be interested in our [2023 Top LGBTQA+](https://www.reddit.com/r/Fantasy/comments/18etlox/rfantasys_2023_top_lgbtqia_books_list/) Books list.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fantasy) if you have any questions or concerns.*",
            "[removed]",
            "Hi there, unfortunately this post has been removed under our [Promotional Content guidelines](https://www.reddit.com/r/Fantasy/wiki/rules/#wiki_2._promotional_content_.26amp.3B_karma_farming). Please feel free to [modmail](https://www.reddit.com/message/compose?to=/r/Fantasy) us if you have any questions."
        ]
    },
    "The anti-recommendation: what books / series should I skip?": {
        "title": "The anti-recommendation: what books / series should I skip?",
        "score": 23,
        "url": "https://www.reddit.com/r/Fantasy/comments/1dlsza8/the_antirecommendation_what_books_series_should_i/",
        "content": "We all have preferences and things that bother one person, others may love. The one trope / characterization that destroys a book for me is ‘the overly angsty / self doubting character’. \n\nTop of mind, the poppy war, the folk of the air, and book 5 of Harry Potter come to mind (though in HP, he’s more overconfident and it has negative repercussions and leads to the death of the only good thing going for Harry family wise, thus, I think worked out - just annoying as shit during). \n\nGoodreads is not always a good place to suss out these things, so let me lean on r/fantasy’s experience. What books should I avoid?\n\nAnd what tropes do you hate and seek to avoid?",
        "num_comments": 108,
        "comments": [
            "I feel like a lot of people aren't reading the post beyond the title and just mentioning a series they hate or otherwise do not want other people to read.\n\nI'd strongly recommend against reading the Farseer series since the MCs self doubt and angst is one of the most important aspects of it.",
            "There's a wholesome answer that every series has its audience.\n\nBut you should skip Swrd of Truth. Terry Goodkind doesn't deserve to steal anyone else's time",
            "Name of the wind. \nThe book is fantastic, and the second is great but nearly 20 years later there's no realistic hope of the third book. So the series is dead.",
            "Ready Player 2",
            "The Demon Cycle series by Peter V Brett. \n\nFantastic initial concept, with some great action at times, completely mired by a lot of incredibly troubling content and themes. \n\nThere isn't a single major female character that isn't sexually abused in one way or another. They're nearly all entirely defined by their sexual needs and desires and motivated by their rapes and abuse.\n\nThere's a really problematic Arabic inspired society. It is very caricaturish and features a lot of rape, particularly of little boys. \n\nEven outside of these issues, the series gets consistently worse as it goes on. \n\nIt sets up like it's going to be action packed, but becomes more chqracter driven. Which wouldn't be so bad if the characters were well written and defined. There's constant, baffling directions some of the characters take like the main character Arlen deciding to speak in a heavily accented dialect from book 3 onwards. \n\nThe flashbacks of books 2, 3 and 4 all tell the same story from different perspectives, with very little to no added interesting moments or details. \n\nThe final book and sequence felt like the author didn't really know how to end the series. It was like a poorly thought out video game sequence, with different levels and every new chapter had a new baddy to defeat with a new technique.",
            "Be wary of r/fantasy recs as well. People here tend to recommend a lot of more niche fantasy and character driven prose heavy reads, which are definitely very good but at the end of the day you should make the decision yourself based on whether a book seems interesting to you.\n\nThat being said please avoid Fourth Wing it is just pure garbage. It’s not even entertaining garbage, or even guilty pleasure garbage. It’s just bad in every aspect from beginning to end",
            "I usually have positive things to say about the Mage Errant series, but you'd probably hate the MC, even though he gets better after the first book - social anxiety, and also childhood trauma. Strong willpower though, and he overcomes a lot with the help of true friends, but it's particularly bad in the first book (also for reasons I can't reveal due to spoilers).   \nIt's a shame, but if you hate existing in such a character's headspace, it would ruin it for you.\n\nAs for me, I hate all the tropes that have to do with unnecessary lewdness and insertion of sex into the narrative and dynamics. I'm not against romance, but everything that has to do with an author's fetishes grosses me out immediately - you can usually tell because the energy and quality shifts into what you'd expect from porn (and that's basically what's happening: the author was just horny).",
            "i think it’s funny that nobody is giving actual anti-recommendations based off what you said, they’re just saying series they didn’t like lol. i’m not sure exactly what you mean by self doubting but rand from WoT is very angsty especially from like book 3-12. kell from shades of magic can be a bit on the angsty side as well.\n\nas far as tropes i don’t like, i’m not a big fan of the like super badass soldier guy who kills everyone. sometimes it can be cool, but other times it just becomes unrealistic and starts to be funny at best and annoying at worst for me personally. logen nine-fingers is an example i thought was done pretty well but guts from berserk (an otherwise well written character imo) just annoys me.",
            "In your case I would skip Farseer Trilogy by Robin Hobb,",
            "I agree about The Poppy War \n\nI might get some down votes for this but if you read one or two Discworld books and the humor doesn't get you, then you should skip the entire thing. If it doesn't make you laugh, it's a slog.\n\nI've read all the big series and I honestly suggest people skip The Wheel of Time. It's just too long. There are huge stretches where essentially nothing happens. Such a shame because the world building is great. It would have been a magnificent 6 book series",
            "None, some series are perfect for some people but boring and bad written or boring for others (example: i do not like Sanderson, but he is really loved in this group).\n\nMy advice: Just start the book, if you feel that it is not for you, do not finish it.\n\nDo not not start a book because someone else did not like it.\n\nAlso... we do not know what you like so we can anti-recommend books without knowing your taste.",
            "This thread is the epitome of this sub, there's always someone who hates what you like.",
            "Chris D-Lacey’s/Lancey’s dragon eye series(the ones with the dragon eyes on the covers). Absolutely horrible series. I mentioned it in another post but… ugh it was a waste of money",
            "The Black Company",
            "About 90% of the books recommended on this sub.",
            "Agree about Farseer. I love that trilogy but according to your post you wouldn't like it.\n\nAnother anti-rec: Stormlight Archive, there are two major characters (Kaladin and Shallan) you would find issue with.",
            "Because of the diverse nature of the likes of the people in this sub, if you got sincere answers from a large group of people you’d be told to skip most books (at least most of the 200 most relevant, popular books)",
            "Oh you should steer WELL clear of Robin Hobb. Although I'd argue she does character so well and with such complexity, that it might actually not upset you nearly as much as you'd expect. Also, if you are a romance person, stay as far away from *Winter's Orbit* as you can. The entire thing is based on crippling insecurity (and MY personal least favorite trope - see below).\n\n\nNow for some self-indulging.\n\nLeast favorite trope: poor communication. If your story only works because character A fails to communicate correctly/at all with character B, your story SUCKS. Get a better story.\n\n\nAnd because I too originally only read the title, and felt the need to vent, here is some bonus hate-content of series people should actually avoid:\n\n*The Second Apocalypse* series by Scott Bakker. Self-important edgelord misogyny masquerading as Deep Philosophy (tm), with the most unsatisfying \"fuck y'all\" ending of all time. I'm honestly upset at how disappointed the whole thing became over time, considering how masterfully written the early books were. But in the end, it just never amounts to anything past poser nihilism. There's a reason his publisher didn't want to touch any more books by him after the ending of *The Aspect Emperor* series, and it's not cause they weren't smart enough to appreciate his genius.\n\n*The Name of the Wind*. Also misogynistic (ask Marrie Brennan if you don't believe me: https://www.swantower.com/2015/02/04/the-absence-of-women/), but more than that - I'm sick of it being the gateway to fantasy for so many people who then get jaded about \"fantasy authors never finishing series\" as if Rothfuss isn't the outlieriest of outliers. That book had its time, and the series - its chance. Let's find new gateways into the genre and stop recommending this.",
            "For angsty and/or self-doubting, you will probably want to skip most of Robin Hobb.\n\nR. F. Kuang does not reduce the angsty characterization for *Babel*, so it's not going to float your boat either.\n\n  \nIf you are into SciFi, definitely give the Nick Seafort saga a pass. It's not only angsty self doubt, it's Calvinist angsty self-doubting self hate at the most obnoxious levels.",
            "The Assassin's Trilogy, of Robin Robb. It's is the WORST ending I've ever seen. The last book is the most boring thing I've ever read.",
            "Better for you to stay away from L. Lam's Dragonfall then, as Arcady struggles with a lot of doubt 😏\n\nFor me, it's the constant threat of sexual violence towards women especially, also minimal women in positions of power or even named (ember in the ashes.. just YIKES), racist stereotypes (TOO many to name ) and instalove/fated mates (unless i am specifically feeling like reading something quick and silly) also any female main character acting like not like the other girls (lila bard, poppy war's rin etc)",
            "One of few books I stopped and didn't finish n my life was first volume of Thomas Convenat series. A leper gets sent to another world where he is healthy. He then decides fantasy world obviously isn't real and rapes a woman because nothing he does matter. Threw the book at the wall",
            "I would avoid the stormlight archive. That WHOLE SERIES is about self doubt",
            "The Wheel of Time. It's only good if you like LOTR-style worlds so much it can overcome all the deficiencies. Jordan is below mediocre in characters, plot, dialogue, pacing, etc.",
            "Stormlight Archive. Needlessly long, poor pacing, and too focused on world building, characters are really shallow too.",
            "I read them a lot growing up but Piers Anthony got really creepy with the age of women in relationships.",
            "I couldn't get through Wheel of Time series. One of the last books Robert Jordan wrote was 100 pages of prologue and the remainder of the book except the ending was pretty much all about who was in the scene, what they were wearing and their mannerisms. I could have skipped everything between the prologue and the ending and IMO it would have made a better story. I never read any others after that. Shame, because I'd enjoyed every book before that.",
            "Morgan Rice books.\nAnything suggested by ads on your Kindle (if you have one)",
            "Avoid Vampire Earth.  It starts decent, tudges along for a bit, and then just sorta... ends.",
            "Kafka by the Shore. I had a literal “WTF” moment when I finished reading it.",
            "Dresden Files. A painful case of diminishing returns and ridiculous stakes in the books (up to 17 now) with few answers to questions that were set out in Book 1.",
            "Controversial opinion, but The Last Unicorn.\n\n\nThe book is good, but the animated movie was just IMHO one of those rare adaptations that are downright superior to the original. \n\n\nSo you get 99% of all the very best parts of the book if you watch that movie, plus some genuinely great animation, music by America and GREAT voice acting. And very little flesh got cut away with the actual fat, too.\n\n\n\nAside from, like, one song that's infamously bad, it's a genuinely glorious and lovely movie.",
            "I would recommend skipping The Prince of Nothing series by  R. Scott Bakker.  It is excellent but incredibly bleak.  Nihilistic to an almost self-parody level.",
            "If you have read Harry potter, The hunger games, Ender's Game, and seen the movie Total Recall, then skip Red Rising. Red Rising is just a blatant ripoff of them, and doesn't have a single original thought involved.",
            "Broken Earth, The First Law, The Hitchhiker's Guide to the Galaxy, The Earthsea Cycle - read a whole first book of each series and hated it. Also Red Rising, but I dropped the book after reading about a third of it. Author ruined everything with that idiotic unnatural power-up.",
            "[removed]",
            "Wheel of Time, Lord of the Rings, the Hobbit, Malazan Book of the Fallen, ASOIAF, Realm of the Elderlings, Stormlight Archive, First Law, Gentleman Bastards, Kingkiller Chronicles, Black Company, The Witcher, A Wizard of Earthsea, Dune, Harry Potter, Chronicles of Narnia, The Dark Tower, Discworld, anything by David Gemmell, Gene Wolfe, or Neil Gaiman.  \n\nLimit your horizons!",
            "Skip Mythago Wood by Robert Holdstock.\n\nThe first book is fine and the world has a very nice atmoshpere. However, every book in that series takes at least half to just set up and then to go to the woods, which is schematically always the same.\n\nAnd don't get me started on Lavondyss. Nothing happens the whole time, Talliss just endlessly walks in circles for her whole life and in the end, she transforms herself into tree and via time paradox, as a human watches her tree self fuck an oak. \n\nAlso may I please add that Harry Potter 5 is my favorite of the series by far? Lol",
            "Unfinished series. Just don’t read them as they are coming out and you won’t get burned.",
            "I am going to give you one that is pretty controversial. Skip the first law books. They aren't bad per se but they aren't necessarily good. There are some fun characters, but there is little to no plot. I kept on holding them off until I needed a good series because I thought it would hook me. I was so underwhelmed that I never finished the third book. \n\nI think there are better series with the funny grim dark characters with an actual plot. See Red rising...",
            "came here to say this.  i am a diehard fan of realm of the elderlings, but if op is really put off by mc's with strong self-doubt, they should avoid this series like the plague  🤣",
            "I agree on both counts. I really like Farseer, but it would drive OP nuts. (Similarly ANYTHING by Stephen Donaldson.)\n\nEveryone seems to be using this post as an airing of grievances, rather than as a (somewhat backwards) \"recommendation\" request.",
            ">  the Farseer series since the MCs self doubt and angst is one of the most important aspects of it.\n\nI read the assassin's apprentice and I feel like what I read was *totally* different from how everyone else describes this series. Is assassin's apprentice just kind of different, before the series has really found itself, or am I just not getting out of it what everyone else does?\n\nFitz's life doesn't seem *particularly* depressing-- I mean it's not great, but there are people who care about him and respect him, he's good at his job, he's got some betrayals in life but who doesn't?\n\nHe doesn't really doubt himself, he seems pretty confident in his abilities and does a good job\n\nand he's not really angsty. He has an occasional breakdown but it's shown to be a one-off outlier type thing\n\ndoes the series just take a new direction after this book or what?",
            "every time i see his name, i feel the bindings of fey law upon my soul, compelling me to point out that Terry Goodkind is ironically neither good nor kind.",
            "SoT is one of my fav series, but I KNEW as soon as I saw the thread title that it would be the top answer haha.",
            "What's wrong with it? I haven't heard really anything about it. Just bad writing?",
            "Part of me doubts that. The Black Company, for example, had its last release in 2000 but the last book (expanded into four) has recently been announced. There is some glimmer of hope.\n\n  \nHaving said that, Glen Cook never did any bullshit like asking fans for money for his charity on the promise of a chapter...and then not delivering. So I'm of two minds.\n\n  \nI refuse to start reading KKC until the conclusion is announced. I can't be dealing with an unfinished series (looking at you too George!)",
            "Rothfuss is just overrated AND he's a douche nozzle. I read both books, and while I wanted to like them, they were both such a complete waste of my time.",
            "I would personally argue that the second book is pretty bad anyway. Definitely not a recommend from me",
            "Man, I really saddens me to see this as one of the top rated comments. Understand why that is though. Pat really fucked his fanbase.",
            "It will come, he recently released another novella. He’s just a complete perfectionist",
            "Came here to say this, thank you",
            "I appreciate you. Now I just need Storygraph or goodreads to let me add a Do Not Read list.",
            "Amen. It's like the series changes main character in the middle. Or after the first book.",
            "Actually, I love this series. You may judge me for what it's worth, but if you brush the sexuall violence off, it is pretty fun.\n\n Was my first big fantasy, that may be why I like it so much lol.",
            "I dont understand why people have to hate things into oblivion. Fourth Wing was overhyped and not groundbreaking, but it's absolutely fine as a read if you want romance and fantasy and a lil dragon stuff. People shitting on every aspect of (especially popular) things aren't believable to me at all.",
            "Fourth Wing just follows different genre conventions than we’re used to, it’s a romance novel with a fantasy setting. It’s a very good romance novel and a much more fun read than a lot of the Serious Business fantasy I’ve slogged through. It’s like eating a bag of potato chips when you don’t feel like making dinner. Don’t expect it to be anything other than what it is, but it’s a good time if you’re into that kind of thing.",
            "Counterpoint: it is actually really silly fun and some of us enjoyed it immensely. Also, whether we like it or not, it doesn't fit OP's (non)recommendation request. The main character has many ridiculous traits, but self-doubt ain't one of them.",
            ">i think it’s funny that nobody is giving actual anti-recommendations based off what you said, they’re just saying series they didn’t like lol.\n\nAre you surprised?",
            "> I might get some down votes for this but if you read one or two Discworld books and the humor doesn't get you, then you should skip the entire thing. If it doesn't make you laugh, it's a slog.\n\nI'd say that doesn't apply to the first few books, as they're quite different to the rest",
            "They specifically stated what ruins a book for them and asked for \"anti-recommendations\" based on that. \n\nThey also acknowledge that what's bad for one person is perfect for another. Which is why the question is based around specific tropes/story types etc which turn some readers off. \n\nSome of us have to be very selective about the books we're willing to invest our time and money in. An \"anti-recommdation\" discussion like this could be very helpful in that respect. I don't think it's fair to just dismiss the post outright",
            "This is such a bummer. I’m on the second and I’m enjoying it even though the main character is kind of whiny.",
            "Agree. Got to the rape, set the book down and was done. The casual inhumanity of it was disturbing. Regret for rape as a redemption arc is just gross. 🤮",
            "If I wanted something similar to WOT,but wanted something that was shorter and had better characters,plot,pacing,etc, what would you recommend?",
            "How is it a LotR style world?",
            "Yeah +1.  The world building is nice, there’s a lot of diversity etc.\n\nBut man.. the story itself oooofff.  Way too many pages, some characters are just useless, the ending isn’t that epic.",
            "The books should have been edited in half. And good grief he wrote horrible women characters.  So unlikable.  The thinly veiled BDSM was amusing.",
            "That's Murakami, right? I loved 1Q84. Is Kafka too esoteric or something?",
            "> I avoid authors who seem to use writing as an outlet for their psychopathy.\n\n\nDo you know that GRRM has already written stories without gore or sex?",
            "Damn, mythago wood was next on my list. The reviews are staggering so I was excited - now I’m not sure!",
            "I don't think this is a bad suggestion for OP as there are quite a few angsty characters. \n\n\nI sort of agree with you on The First Law. I've read 8 of the 10 books and it is possibly my favourite series ever, but while I did like the first trilogy a lot, I didn't enjoy it anywhere near as much as the first standalone or the 2nd trilogy, which may be my fault for accidentally reading the series out of order but I don't think it matters much. I mostly recommend the first trilogy to friends and family as an introduction to the series so they know what's going on rather than recommending it outright.",
            "Hm after all the recommendations here I also tried getting into them a few times now but never made it far.",
            "The last line of the post opens the floor for their grievances.",
            "I can't say I exactly remember the specific mood towards every event but that's definitely the general attitude I held after finishing the entirety of the realm of the elderlings. \n\nAs for getting depressing, it definitely gets very depressing.",
            "There’s a term for when a person’s name is super accurate (like Charity being a really generous person) and another term for when a person’s name leads them in the complete opposite direction (like the name Chastity, lol).  I can’t recall what it is though",
            "Terry Badmean",
            "It hasn’t aged well and the deeper down the rabbit hole you go the worse it gets. I actually think 1 & 2 are okay but everything after is hot garbage",
            "Sword of Truth is like Lord of the Rings if Tolkien loved S&M and hated communism.  If you like kink in your traditional fantasy, the first book in the series isn't bad.",
            "Ayn Rand level of multi-page obiectivist monologues",
            "No need to read it, it goes like this.\n\nWalking > fighting > resting > Walking > fighting > resting >  bondage > fighting > mc shows he a genius > everyone claps",
            "I think it's less to do with the writing and more to do with the author Terry Goodkind, his surname does not reflect his character",
            "One of the titles is \"The Color of Her Panties\" and it is my understanding that the her in question is a child.\n\n\nEdit: Oops, wrong terrible series.",
            "Really? Cool. Although I would have to start from scratch, it's been probably 20 years that I read them. Don't even remember they were not finished.",
            "I agree. The whole fae thing is over-the-top neckbeard cringe.",
            "I was bored to tears with the first book",
            "The first one was great – no question. The second? Not so much. I didn’t even finish it, which is rare for me.",
            "Is this a joke comment?",
            "This wasn’t a new novella, it was a rerelease of the same previous one with a pretty new cover. Pat is fraud at this point.",
            "Librarything is really nice for that type of customization. \n\nI like that it has fields for private comments, reading dates that can be added to (for rereads), and customizable categories.",
            "Haha I like that idea - you could make a custom tag on StoryGraph for it though!",
            "It definitely starts off really well, but it takes a massive dive from the fourth book imo.",
            "I think the Fourth Wing haters are people who expected it to be the next Game of Thrones.  But 4th's target audience is romance fans, so a lot of people were caught off guard.",
            "Unsername checks out ;)",
            ">it is actually really silly fun and some of us enjoyed it immensely. \n\nI say the same thing about meth. And just like meth if you ignore the shitty side effects it to is really silly fun and some of us enjoy it aswell. Somthing can be both shit and be enjoyable. Fourth wing is a mid hate read that is at the end IS worth your time to read absolutely. BUT isn't recommendable. Romantacy is widely hated outside of this reddit and it just isn't somthing most people would read. And those that would would hate the blend and expect more of the romance and so it doesn't get read there. \n\nYou are looking at people who are are infinitely bored or people into the romantasy which aren't always interchangeably lmao.",
            "Yeah colour of magic etc aren’t representative of the rest of books. Which are all fantastic. Granny Weatherwax still my favourite fantasy character ever.",
            "Could you give please expand on why the later Discworld books are great?  I read the first book and said “this isn’t for me. “",
            "That's why i just give my advice. OP can follow it or dismiss it 😉",
            "Same",
            "Maybe esoteric? Or perhaps something was lost in translation? Or maybe I wasn’t smart enough to understand the symbolism of a character that looked like Johnnie Walker and chopped off the heads of cats. 🤷🏾‍♂️",
            "Did I mention any of those?  No, I specifically mentioned his magnum opus.\n\nOh, btw, when someone shows you who they are, believe them.",
            "Fair point.\n\nLet me reframe my own grievance as \"wouldn't it be nice if people actually responded to the recommendation request part of this and didn't just treat this as yet another 'what books u hate?!' post?\"",
            "that's xanth not sword of truth, I think?",
            "Terry Goodkind didn't write Xanth, Piers Anthony did.",
            "Well, now I have to read it.",
            ">Romantacy is widely hated outside of this reddit and it just isn't somthing most people would read\n\nRomantasy is incredibly popular, *particularly* not on this subreddit. It is selling like wildfire, whereas this sub prefers more classic dudebro-with-dragon vibes. (TBF, so do I.)\n\nI honestly don't care if people don't like romantasy. Or anything else. Like what you like, y'all. But the relentless \"4W is the source of all evil\" commentary on this sub is boring and has a strong \"girl books have cooties\" aura to it. I realize it takes a rare degree of subtlely, but we can dislike books without them also being the source of all evil.",
            "Romantasy is... What?\n\nMy guy it's the exact opposite. Romantasy is bigger than Fantasy right now. It's not even close. We're talking orders of magnitude. \n\nThis subreddit especially is a small, insular male-focused space that is absolutely not representative of the larger book market.",
            "> Did I mention any of those? No, I specifically mentioned his magnum opus.\n\nYou mentioned his writing, and he didn't just write ASOIAF.\n\n> Oh, btw, when someone shows you who they are, believe them.\n\nSaying that an author is secretly a psychopathic killer just because he wrote a fictional story with graphic murders is crazy lol",
            "wtf"
        ]
    },
    "Beating Hearts & Battle-Axes": {
        "title": "Beating Hearts & Battle-Axes",
        "score": 7,
        "url": "https://www.backerkit.com/c/projects/brackenbooks/beating-hearts-battle-axes?ref=Reddit",
        "content": "Hey I just saw this book that's blending romantasy with a Sword & Sorcery vibe. I really love the art but...what do you guys think about more kissing with your swordplay? Or more action with your romantasy?",
        "num_comments": 0,
        "comments": []
    },
    "Good old-fashioned Medieval European Fantasy released within the last five years?": {
        "title": "Good old-fashioned Medieval European Fantasy released within the last five years?",
        "score": 43,
        "url": "https://www.reddit.com/r/Fantasy/comments/1dll79h/good_oldfashioned_medieval_european_fantasy/",
        "content": "Knights, castles, jousts, princesses, etc\n\nI’m in the mood for something real basic and **real recent**. I need some recommendations for medieval European fantasy **that has been released within the past five years or so.** Can be self-pub or trad-pub. I’m an amateur writer myself and I want to see if anyone else is still pushing this sub-genre of fantasy these days.",
        "num_comments": 17,
        "comments": [
            "The Covenant of Steel trilogy by Anthony Ryan. It started in 2021 with The Pariah. It is a really good trilogy",
            "I really loved **The Bone Harp** by Victoria Goddard, which came out a few months ago.  It takes some broad liberties with Tolkien's story with some serial numbers and plotlines changed, and imagines if the grand hero (who in the case slayed the evil lord instead of throwing a ring in a volcano) returns back to the elflands.  He struggles with the trauma of his experience, with whether his family will only see him as the dealer of death he became, and with finding a love of music again.  \n\nIt was really, really good if you don't mind stories that are more driven by character than plot",
            "\"I'm Afraid You've Got Dragons\" perhaps?\n\nBy Peter S. Beagle, author of The Last Unicorn. Really recent, released last month. I enjoyed reading it, though the story was shorter than i would have liked.",
            "Between Two Fires By Christopher Buelman\n\nGunmetal Gods by Zamil Aktar \nThis has a distinctly Byzantine vs Turks feel which may or may not scratch your itch.",
            "The Faithful and the Fallen series by John Gwynne. Final book was published in 2016.",
            "I’m not sure what you mean by old fashioned but for recentish medieval Europe fantasy there’s a ton. Some that immediately come to mind\n\n- Gods of the Wyrdwood\n- Kithamar by Daniel Abraham\n- Empire of Vampire takes place in faux medieval  france\n- Rook and Rose feels pretty medieval Europe \n- Silent Gods by Justin Call",
            "There is the House Witch series, but it’s firmly on the cozy side of fantasy. However has castles, knights, princesses and all the rest.",
            "Prentice Ash (Rage of Lions-1) by Matt Baron has an enslaved ex-Templar Knight coming out of his chains for fighting out against an unexpected invasion by a sorcerous enemy army. Fighting a parallel battle is the young newly widowed Duchess Amelia who has to deal with treachery from her allies.\n\nWarrior's Ransom - Jeff Wheeler.",
            "On the lighter side, *Gwen and Art Are Not In Love* by Lex Croucher is a fun YA romcom set in vaguely Arthurian England. Very classically medieval setting.",
            "This sounds fantastic!",
            "Between Two Fires is from 2012, and while it's a fantastic book, it may not match what the OP wants.",
            "I’d check your math on that one but good series",
            "I don't think I'd call Gods of the Wyrdwood medieval *or* European.  I've seen someone else suggest that the \"clanless\" are suggestive of the Indian Dalits.  On top of that, the way that gender and family structures are understood is entirely different.  The important people in society seem to practice polygamy, taking multiple wives and husbands, and most families expect to have one child who is a trion (a non-binary person).  Lastly, the description of the wood and Ranya's web seem to draw from non-European influences.\n\nTechnologically, it's all over the place as well.  The villagers are wielding spears and longbows, but because of the ecology there are airships, which is more Victorian/WWI.  Then there are the \"Blooming Rooms\" whose description suggested something similar to the gas chambers of WWII but with plants and Cahan's description of how the Cowl works, which suggested that he had some understanding of chemistry/physics.\n\nIt's a great book, but it's probably not what OP is looking for.\n\nAs an aside, one reason I'm dating this later might be that Cahan's character reminded me of Rin from The Poppy War in terms of his upbringing, his struggles with the Cowl, and the contempt he shows for some of the other characters.  I think I've subconsciously decided that the two are set in roughly contemporaneous societies, even though the two are very different.",
            "> Rook and Rose feels pretty medieval Europe\n\nI love R&R but it has way more of a Renaissance feel than medieval, imo. There's no knights, no castles, no jousting, no princesses... There's masks and magic and vigilantes and secret identities and charming crime lords instead, so I absolutely recommend it in general but it might really not be what OP is looking for.",
            "I looked it up and saw a print date of 2020 before I recommended it. I went back and saw that the kindle edition was 2020 and the print is 2012. Leaving up because it is a fantastic book but I agree it doesn't quite meet what the OP is looking for.",
            "Just finished it this week, legit one of my favorite books of all time.  But yeah it was 2012",
            "It’s within the past five years *or so*. Took that little vague opportunity and ran with it."
        ]
    }
}