{
    "Remember the time when WinAmp was still a thing? These Final Fantasy skins were in my mind.": {
        "title": "Remember the time when WinAmp was still a thing? These Final Fantasy skins were in my mind.",
        "score": 291,
        "url": "https://i.redd.it/qionlmizz08d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "If what you mean is \"are you still using Winamp with skins\"? then the answer is yes.\n\nI have only used the Akane Tendo one since forever ago, though.",
            "It really whips the llama's ass!",
            "Was?\n\nWell, I'm still rockin' it.",
            "I still have Winamp on my computer because of the skins. I had VII, VIII, and X ones.",
            "I had that Vincent one, and a Sephiroth one with the fire.",
            "I still have Winamp installed on my PC - still whips the llama's ass",
            "Oh, oh, I need to download winamp again.",
            "I still use it it's great",
            "WinAmp is still amazing\n\ni found a very smooth dark [skin](https://skins.webamp.org/skin/c4cd9889f76c9fbe731ad8d6b27d5071/Diablo IV.wsz/)",
            "oh my the memories ... I miss the times when we could change the skins of the players to anything we like. My favourite was the ones with Squall holding the gunblade. Good times hearing Linkin park and good charlotte back then.",
            "I remember using the Aerith one.",
            "Yes!!  I used a FFX Suteki da ne one!",
            "I'm still using winamp. For me it's definitely not \"was a thing\" especially when you want to have your favorite music on your disk, not on some arbitral platform like youtube, spotify or whatever.",
            "Thank you for this blast from the past :') \n\nWinamp was the GOAT!",
            "Ohhh, this takes me back.\n\nI saw everyone here say \"I'm still using WinAmp\" and I was about to say, oh, next you'll tell me ICQ still exists. Then I checked and apparently it *does* but it's going away in four days. Wild.",
            "I’m pretty sure I had that Tifa one.",
            "Memories",
            "cring",
            "Like, Ranma 1/2 Akane Tendo?",
            "I have not used a skin for a while, but I still use winamp",
            "I’m too slow!",
            "Yeah, the sephiroth one with the fire made 14 year old me very happy!\n\nGood times.",
            "[https://www.angelfire.com/celeb2/aguilera/anime.html](https://www.angelfire.com/celeb2/aguilera/anime.html)\n\n  \nYup. It The one I use is the blue one on the top right.",
            "yes, it's the only one I ever used! No other matched it (until I switched to iTunes at 15)",
            "This being an Angelfire page is just as comforting to me as seeing discussion of Winamp skins in 2024.",
            "Thanks! If I used WinAmp I'd definitely download the orange one lol.",
            "lol omg I used the Akane Tendo one too! I can't believe that's still around. What a legacy..."
        ]
    },
    "FF Character Edition! Laguna and Terra win best battle theme and character theme respectively! Now onto 'Best Animal' - this is applicable to any specific animal companion or animal character, so it doesn't mean best FF animal breed. ": {
        "title": "FF Character Edition! Laguna and Terra win best battle theme and character theme respectively! Now onto 'Best Animal' - this is applicable to any specific animal companion or animal character, so it doesn't mean best FF animal breed. ",
        "score": 209,
        "url": "https://i.redd.it/jz7w3fg9008d1.png",
        "content": "",
        "num_comments": 255,
        "comments": [
            "Ze shoopuf!",
            "https://preview.redd.it/shrekumi908d1.jpeg?width=686&format=pjpg&auto=webp&s=0474d5ccb1a5e314b9354c2058b327963fb275c9",
            "Bobby Corwen!",
            "Moogles. Any. Just them in general.",
            "Interceptor.",
            "Alpha from 14, he's adorable, he's helpful, he's funny, he's a hard-working employee, and he's a walking, kweh-ing reference to the best FF spinoff series.\n\n&#x200B;\n\nhttps://preview.redd.it/k64tf44wh08d1.jpeg?width=750&format=pjpg&auto=webp&s=95346f245d3a86af24f73bc91fa55528ef7113b6",
            "I'm gonna go with Red XIII / Nanaki - I find his story quite compelling and the whole scene with Seto is an underrated tear-jerker imo.",
            "Best animal ===> Moombas",
            "Angelo.",
            "Boko (FFV - Bartz's chocobo / FFT - Wiegraf's chocobo)",
            "Torgal. He’s just the goodest boy!",
            "Going with Torgal on this one. I like red but calling him an animal companion feels off. Finding out that where torgal was staying while you eventually got back from being a slave was both sad and touching. Torgal is best boy.",
            "Mog from ffvi",
            "FF6 Mog!",
            "Red XIII / Nanaki for sure.",
            "Nanaki/ Red13",
            "Nanaki",
            "Nanaki",
            "Interceptor, the goodest boy",
            "Sazh’s chocobo!",
            "Gotta be Torgal. Seconded only by Angelo. They are best boy and girl respectively.",
            "Red XIII",
            "I gotta say mog from 6",
            "Boko :)",
            "https://preview.redd.it/hocoubgm718d1.png?width=445&format=png&auto=webp&s=a5de3619b7249eb1da171cd919121467630f19b6\n\nDo these little idiots count?",
            "As a joke, I submit Gau.",
            "Interceptor",
            "Torgal ! Best doggo ever",
            "Torgal, the bestest boy...My WOUNDS BOY! \nAnd also shoutout to my beautiful, strong girl Ambrosia 🩶😍",
            "Nanaki!",
            "Nanaki, *obviously*",
            "Nanaki 100%",
            "Torgal best boy",
            "Torgal.",
            "Torgal",
            "Torgal",
            "Torgal",
            "Red XIII - who wouldn't want a fire-lion friend? Plus he's the only quadrupedal playable party member to date.",
            "Torgol",
            "Gau FFVI",
            "Tonberry",
            "https://preview.redd.it/wgpplqgc218d1.jpeg?width=266&format=pjpg&auto=webp&s=539bb17f1d05b3a9381e18ad417bbdb1a71d48f2\n\nBoko - FFV",
            "Interceptor. Easy pick.",
            "The little baby chocobos that run the rest stops in FFVII Rebirth. Goddamn cutest video game animal I’ve ever seen",
            "Nanaki.",
            "That chicken in rebirth you spend ages luring home and then eat...",
            "Cait Sith. I expect Red XIII to win though, and he's great, too.",
            "Boko!",
            "Is there no best limit break? Or do you just not want Noctis to win anything :).",
            "Red 13",
            "Guys best friend, a beaver",
            "My real vote goes to Moogles in general. They are overrated, and I haven’t played FFVII og in forever, but I feel like, Nanaki’s race after thousands of years evolves into or evolves from Moogles. It could have been something else in the game towards the end.",
            "Damn, these images can use more pixels. I feel like I'm viewing them with my glasses off",
            "Y’all don’t respect Cait Sith the goat smh",
            "Angelo is literally a doggo suicide cannon. Hes indestructible!",
            "It won’t win,  but I’m going with Angelo from ff8 .\n\nHe was a good boy and he for some reason also let’s Rinoa fire him off her arms like a cannon in battle. All for treats. \n\nhttps://youtube.com/shorts/Wlrd0nYkhlI?si=5WJueFwsAMDKlxfP",
            "Mog - ff9",
            "Interceptor",
            "Torgal.",
            "interceptor, and theres nothing that will change my mind",
            "I know a lot is gonna say Red but hear me out.\n\nCan Red be shot like a cannon at his enemies? Can you ride him hrough the cosmos to destroy your enemies? Does Red heal and revive through sheer will alone? Does he sniff out things? No? \n\nThen vote for Angelo today.  The best doggo.",
            "Choco from IX",
            "https://preview.redd.it/diqmu3agc08d1.jpeg?width=1500&format=pjpg&auto=webp&s=629215f3c5a526018d3dcd7d277396e359f14226",
            "Ghido from 5\n\nEDIT: Next part is going to be so difficult 💀",
            "Freya Crescent is a beautiful rat",
            "Nanaki",
            "Someone said Alpha from FFXIV. He was only one day old when he met the MC, and has the best growth. Plus look at him, an adorable little chocobo wearing an engineering suit. Highly merchandisable as Jessie said, and if RL sales of his plush are anything, she’s right.",
            "Bobby Corwen!!!!",
            "Red 13/Nanaki",
            "Red XIII/Nanaki",
            "Chocobo. Shouldn't even be a contest.\n\nhttps://preview.redd.it/aa9cpegr218d1.jpeg?width=185&format=pjpg&auto=webp&s=a1da7a50aa0a8b050dcedb2cabeae58b85eae6ac",
            "Nanaki/Red XIII",
            "Nanaki",
            "Red XIII damnit",
            "Nanaki, put some respect on his name!",
            "FFXI - Wyvern companion on dragoon",
            "Interceptor or Gau for joke",
            "Boco from FF Tactics saved me so many times.",
            "Kimahri.",
            "Whatever Fran is.",
            "Best Boy Torgal!",
            "Interceptor",
            "Gotta give this one to Torgal. Sorry Nanaki, but frankly, Red does *not* feel like an animal companion. That’s just a dude.",
            "Torgal. Love Red XIII, but that adorable wolf stole my heart!!",
            "https://preview.redd.it/s9nwly5rg28d1.jpeg?width=577&format=pjpg&auto=webp&s=2bf20fc899497c45cc1d46fddb2589b46501ef7a\n\nReis is best animal companion. :D",
            "Interceptor for the serious category.\n\nFat Chocobo for the joke category.",
            "Torgal",
            "Torgal. Most loyal pet in the entire series. He saved Clive and Jill so many times as well",
            "Chocolina the baby chocobo in the 13 trilogy",
            "Red XIII",
            "TORGAL",
            "Angelo, everyone’s favorite Australian Shepherd / ballistic missile.",
            "how is cloud not the most overrated",
            "I'm throwing Mumba into the ring",
            "Khimari",
            "“Had I only learned to speak sooner I would have told you how much you meant to me. How much I cared”-Seto",
            "Torgel for me. Red is a close second",
            "Torgal",
            "Torgal for the win any day",
            "Torgal!",
            "Chocobo for the wiiiiiiiin",
            "Chocobo. There is no other answer",
            "Cactuars",
            "Imps and Frogs is another timeless classic that deserves to be on the list since your entire party can become them in a lot of main titles … or there just needs to be a best general enemies list for Cactuars, Tonberries, Imps, Frogs, & Marlboros ect.",
            "I love how there was a debate between two characters theme songs so the OP was like “FUCK IT” and added both of their songs to the list",
            "How did Mystic Quest’s battle music absolutely crush the last vote\n\nhttps://youtu.be/XZOQ8sLO-vU?si=UxHoSEknUQ7TiNxJ",
            "hard tie between cactuar and malboro",
            "Gau",
            "Its gotta be Red XIII.",
            "Rally-ho!",
            "That snake from the original ffvii - in the marshland - Cause i had been defeated by it so many times and i hate being chased by it when i dont have a chocobo. best animal cause its true to its nature - a terrifying prick.",
            "Cmon, obviously the Chocobos",
            "Interceptor. Just Interceptor.",
            "Nanaki/Red XIII",
            "Gotta be Red XIII",
            "Red XIII because it doubles as being true and funny because it would make him growl",
            "This poll is already shit. Zidane...really? Zack overrated?\nEmet Selch best villian?? 😆 Get some taste",
            "RED    ❌ III",
            "Angelo!",
            "Dang. I have to say Red XIII, Chocobos, or FF9 moogles. ",
            "Red XIII/Nanaki",
            "Its chocobos or kupos ??",
            "Angelo",
            "Moomba",
            "Red XIII 😍",
            "Red XIII",
            "Seto / amaros in general (they’re so cute :(()",
            "Red XIII",
            "Nanak or Torgal. The goodest bois",
            "Best animals imo are moogles or chocobo \n\nWe all know who hottest is going to be",
            "Angelo cannon",
            "Best romance......Squall and Rinoa\n\nBest Girl..........Tifa",
            "Id say Nanaki but rebirth completely butchered the character for me when they made his voice so youthful! But nanaki ridning a chocobo never gets old.",
            "Surely Chocobo should be the top answer here.\n\nI love them and wish they were real.",
            "I would say Carbancle but they don't appear much in the franchise. So I'm going to stick with Chocobos",
            "Clearly RedXIII is the best animal",
            "Red XIII",
            "Interceptor",
            "Red XIII",
            "I listen to Tina’s (Terra’s)  theme every day, I also listen to Man With The Machine Gun lots too",
            "Talking dog best friend Red XIII",
            "Interceptor or Red XIII for sure",
            "best weapon-> ruby weapon in second made me smirk :P",
            "Chocobo. Please, let me have this.",
            "Red XII or a chocobo",
            "Red",
            "Chocobos, the most iconic animal companions of FF.",
            "Wedge's cats.",
            "Chocobos!",
            "I know he's not going to win but my vote goes to Cait Sith, I know he's not exactly an animal, but Cloud and Barret call him \"cat\" a lot of times in both Rebirth and the original, so I think he counts.\n\nI always felt he was underrated, but it seems people like him a bit more after Rebirth released.\n\nI'm a bit early, but my favorite duo is Kain and Cecil from FF IV, they have such a great friendship and because both of them lost their families while they were young, and knew each other since kids, they always felt like brothers to me.",
            "You did NOT put Zack Fair in the 'overrated' box",
            "The Frocobo from XIII",
            "MANNNNNN I want to say Red so bad\n\nBut best boy Torgal wins it for me",
            "Angelo!",
            "Seto. The best feather dog in the series.",
            "Torgal 💕",
            "Best Sentient Animal: Red XIII.\n\nBest Non-Sentient Animal: Interceptor",
            "I asked my wife if she wanted to ride ze shoopuf...I didn't get laid that night",
            "Can I ride?",
            "I love the he way he rides Chocobos in rebirth it's so funny, and the more I see it, the more I believe it's intentional",
            "I love that they leaned into some goofy antics with him! This is what finalfantasy needs! Keeping that goofy lightheartedness.",
            "Can we please use Red in the shina gear for the pic?",
            "At first I was sad when I thought they wouldn't include this part, then I was beyond elated.",
            "It can’t be anything but Bobby Corwen.",
            "Except FF7R2 version. They're the stuff of nightmares.",
            "Hell yes\n\nhttps://preview.redd.it/76me6brp318d1.png?width=1080&format=pjpg&auto=webp&s=dda54c03b68e767728da7fc722c48fba8cd9b0e7",
            "Interceptor is such a badass he once tried to fight *a gigantic, blazing, magical flame* all by himself, to save a child. \n\n\nHe is just a dog. No magic. No sentience. Just a very good dog. ",
            "Yeah, if we're interpreting \"animal\" to exclude members of sentient animal races, then my vote would go to Interceptor.  Torgal is cool, too, but I think Interceptor still edges him out.",
            "Yes! Original badass ninja dog!",
            "This is the only answer. Best doggo in the series.",
            "Nothing better than this king randomly running into your battle for 900 damage.",
            "I came here to suggest Mog, but am now also voting best boy Interceptor, the number of play throughs I've had with that good doggo last hitting the train lol",
            "I love catching him travel the world with his buddy when I travel. \n\nOne time I was chasing a friend after 5.4 (forget where she was in the story other than. “Not there yet”) and saw him staring at where she was cuz it was that spot in Gyr Abania. I knew others caught them there, but still was spooky. “Oh, you’re there!” “Who?” “Never you mind” months later “you were talking about Alpha back then, weren’t you?”",
            "Red 13 is the only true answer to this. Best doggo!",
            "Maybe this is pedantic but is Red XIII an animal? He may have the appearance of one, sure, but he's a person. Would Kimahri or Migelo be considered animals and if not, is it just because they walk on two legs?",
            "He is the one that gets the best arc of the animals, mostly because the rest are more just animal companions.",
            "Definitely Nanaki",
            "Agreed whole heartedly.",
            "I mean for main characters it's a pretty short list. Red XIII has a great design and a good story to back it up.",
            "But does Nanaki even counts as an animal? He is a member of a sentiens species, shouldn't that technically disqualify him? Otherwise, where's the line? Technically all humans are animals, if we don't separate this category by sentience, then by what?",
            "I don’t think any other animal companion can even compete.",
            "I agree with the other guy, Nanaki should be disqualified on the grounds that he's a person not answering animal.\n\nIt's like the inverse of him not being allowed into the QB game.",
            "Moomba gang rise up!",
            "This is a type of creature and not a specific character so not eligible. I do like moombas.",
            "I wish they'd show up in a new FF again.",
            "Literally explodes himself into enemies like a good boi",
            "The goodest boy.",
            "MY WOUNDS BOY.",
            "Best, hands down. Red XIII shouldn't count because he's able to talk. So he's able to have so much more opportunity for character growth. \n\nTorgal, however is always awesome. Best wingman in any game. Doesn't talk. Doesn't have a story about hating his dad like an angsty teenager. Just kicks ass. Plus you can pet him.",
            "TORGAL IS BEST BOY 🥺💗",
            "For sure Torgal, there’s no comparison.",
            "A fine hound he is",
            "My wounds boy!",
            "Also mog from ffix. All mogs best mogs.",
            "OOOH yes, so many Moogles look cute and helpful and unassuming, and then there is Mog, ready to cut a bitch without hesitation",
            "Kupo kupooo",
            "Chocolina",
            "Frocobo is best bo",
            "Not unless you're naming a specific character",
            "I had to scroll all the way to the bottom to find another person who suggested Moomba?!?",
            "Technically, they are not animals, they are members of Shumi tribe, that assumed animalistic form.",
            "Lol he's only an animal in spirit",
            "Interceptor easily. Best badass doggo in FF.",
            "Cuter than them?\n\nhttps://preview.redd.it/zn3leptbi08d1.jpeg?width=258&format=pjpg&auto=webp&s=d97c24ec3b660a33a86a1a4ac023c38d144db0c0",
            "They are hideous tbh, so many better looking Baby Chocobo designs.",
            "https://preview.redd.it/4rkp0op2p28d1.jpeg?width=3840&format=pjpg&auto=webp&s=d77ce6d211e07b59f9fb4c34a35c21c6b7fd021c\n\nThey’re the best ☺️",
            "That was a shocking sidequest lol",
            "Pippily surely must be the tastiest animal",
            "Isn’t that a robot?",
            "Everyone knows it's Omnislash.",
            "I’m thinking of doing a bonus round with ‘best Cid’ and stuff so maybe I’ll include that",
            "Mog ffvi specifically if I have to choose.",
            "Yeah I’m doing this all on google docs so it’s kinda amateurish",
            "Cait Sith is a man made object.",
            "Angelo is the best girl.",
            "He eats strangers!",
            "Rebirth Cait Sith is on a different level of performance",
            "Cait Sith isn’t a real animal.",
            "You could be right I suppose. But I l tend to think anthropomorphic characters dont count as animals.",
            "Cos Zack is.",
            "Man, that cutscene brought the tears for me. It made me think of all my pets that passed away who hopefully felt the same way as Seto. Suddenly, I'm sensing that someone has been cutting those Thavnair onions. 🥺",
            "OP chose a winner for best battle theme (Man with the Machine Gun) and best character theme (Terra)",
            "Yeah that really hurt. He’s my fav character as well.",
            "I assume you mean XIV Seto (feather dog), and not VII (father dog)",
            "Shoopuf’s waiting!!",
            "All aboards!!",
            "It is intentional. The developers actually stated that they did it because it looked funny.",
            "Sooooo FFXIV MC? He's a joker after the 3rd expansion starts. His dialogue options getting sassier by the updates.",
            "Mangy koalas are not moogles",
            "Who is a good boy?\n\nSuch a badass",
            "Is he not a cat?",
            "Represent!",
            "Red XIII was also going to be my answer for this but you do raise a good question! I wouldn’t consider Freya an animal and she’s literally a rat, so why do I consider Red XIII one?",
            "That’s a very good point. Maybe I’ll split the category again like I did the previous one with one animal companion and one animal, if that makes sense?",
            "Yeah true",
            "Laguna! Laguna!",
            "Angelo is a girl actually",
            "I’m hurt, Torgal!",
            "Oh agreed! By far the worst in there just for the frustration of it. Sorry mate, someone walked behind you now follow the world's slowest chicken back to the start! Also, for some reason it is absolutely impossible to pick up said worlds slowest chicken 😂",
            "Let me live my fantasy",
            "Yes. Seto from ffxiv.",
            "I heard a Drunkard once attacked the shoopuf. Is that true?",
            "I love that they're leaning into the ridiculousness of putting Red into human contortions.",
            "I believe you but I don't like mmos so I'll never experience that.",
            "Some of the dwarf sidequest responses had me seriously lauging.\n\n\"Guess this is one of those situations where it doesn't matter what I say, huh?\"\n\n\"Right you are!\"",
            "He is said to be designed as a lion-wolf hybrid, so both, I guess?",
            "Ah the good ol’ Goofy/Pluto debate",
            "Then shouldn't it be Angela?",
            "Is true! Heard he only drinks shoopuf milk now!",
            "I mean, you can do the main story with NPC's now, so you can dodge most MMO'ness.",
            "Tbf out of all the MMOs out there FF14 is probably the best one for people who hate MMOs.",
            "Well at least just watch a YouTube edited stream so ucan experience the story. Since it's without a doubt the best story in the franchise",
            "Shouldn't Tidus also be pronounced Tidus?"
        ]
    },
    "FFXI deserves more love!": {
        "title": "FFXI deserves more love!",
        "score": 475,
        "url": "https://i.redd.it/y0ui4bba4y7d1.jpeg",
        "content": "Final Fantasy XI has 22 jobs, with the subjob system this means 484 different combinations.  \n  \nReady to play the job Summer? SMN can summon a serious number of traditional summons including:  \n-Ifrit.  \n-Shiva.  \n-Diabolos.  \n-Cait Sith.  \n-Alexander.  \n-Odin.  \n-Atomos.  \n-Siren.  \nand more!  \n  \nBlue Mage is a fully fledged job, with access to over 150 enemy spells, and a more than worthy party member in all content!  \n  \nHarness the defensive skills of a Rune Fencer to protect against magic, or the stalwart paladin whose expertise in physical defense.  \n  \nWith so many options available, the biggest limitation is your imagination. Get creative while solo, or find each different setup for the various enemies across the world!\n  \nPlay all available jobs on a single character!  ",
        "num_comments": 195,
        "comments": [
            "WAR/WHM, I don't know why I can't find a group!",
            "They should do a single player remake like DQ10. The game could benefit from modernisation in a lot of areas, it felt dated even after only a few years post-release, since WoW made so many streamlined improvements to the genre over Everquest that FFXI was slow to pick up on or never opted for. ",
            "At leas when I was playing, the vast majority of those job combos weren't viable.",
            "Best Blue Mage in the series.",
            "\"This post was made by the FFXI recluitment gang\"",
            "https://preview.redd.it/4maowxn99z7d1.jpeg?width=2252&format=pjpg&auto=webp&s=bd24518a6f8c613c98a5ae3f2a6e9a9581a6b7d1\n\nI haven't played xi in over 10 years but I still wake up to the anthem of sandoria. Or sometimes I wake up to jeuno.",
            "I mean... I love FFXI, but uh... every Job combination is not viable at all. Frankly most job combinations will get you ignored. You can do it solo with Trusts but that's not quite as fun, though also probably pretty required for a lot of it nowadays too.",
            "Yes, 484 *possible* combinations, but if you aren't using one of the 8 community-approved combinations and don't have BiS load-out, including a drop from a monster with a 6 hour window, 18 hour cool down, and 4% drop rate, you're trash and cannot join my party.\n\nLoved that game\n\nEdit to add: you needed *multiple loadouts* and a quick-change macro to maximize buff stats for different weapons skills. Damn, that community was insane.",
            "Did my time on this game, quit happily end of last year after playing since 04.",
            "In this economy?",
            "Criminally underrated game with one of the best soundtracks and the best world building and setting in the entire franchise.",
            "If ffxi ever got a ui update I would come back in a heartbeat, but last time I played it was still clunky as hell",
            "I love job+subjob systems.  It was incredibly fun in other Square Enix games and it was a whole lot of fun in Titan Quest as well.  Butt hurt Min/Maxers can go to hell and aren't fun to play with anyways.",
            "also saved the company from bankruptcy after Spirits Within flopped",
            "\"Be forced to wait full in game days to continue the story and, if you're lucky, until real world Japanese midnight!\n\n*You* can enjoy fun and challenging bosses, that require redoing an hour long process to rechallenge again.\n\nSign up now to surrender all your spare time!\"\n\nI joke, but damn the game makes you wait an in game day between missions a lot.",
            "My first real MMO. It was so damn hard, but I loved it!",
            "Actually been debating giving *FF11* a go at some point. How easy is it to run through solo, solely for story stuff?",
            "Ooohhhh it was good for sure ( played the Xbox 360 version years ago) unfortunately (when I played it ) being a game when I was saying **** for missing a ship and I literally had to wait in real time for the next one ehhhh. In short i didn't have much time then for playing it",
            "Many (most?) combinations are inviable. Any/BRD, any/GEO, any/pet jobs for example.",
            "I’d play it if it was still on console, unfortunately not all of us have a PC.",
            "I wouldn’t mind trying this out again. I played way back in the day. Getting back in feels daunting however with all the expansions.",
            "I remember right you could make the ultimate tank using ninja and thief combo",
            "SAM/DNC for soloing events during Wings of the Goddess. Good times.",
            "SAM/WAR, I can sub-tank and participate in multiple skill chains\n\nAny other people from the SweetSweetLove Linkshell around?",
            "I had fun with it back in 2009-2010 when I'd get prepaid cards for Christmas. I probably would have played much more if they had readily available game-time cards like WoW did. IIRC I got WHM to 30 for sure, and BLM, RDM, and WAR(i think?) close to 30... grinding in the dunes with randos. Unlocked expansion area that was a jungle, but then subscription ran out. I've played once or twice since then with the trusts and whatnot but never stuck.\n  \nIf it wasn't for Dawntrail coming out in just a week, I might have been inspired by your post to play again. Maybe some other time. I can work 60+ hours a week sometimes, so my gaming time is competitive.",
            "Redmage whitemage ahhhh refreshed",
            "Yes, while that is possible, in theory, of those 484 possible combinations, like 30 are viable.",
            "Once you figure out how to level and chain weapon skills to magic burst….Chefs kiss 😚",
            "484 combinations...maybe 5% of those are actually useful",
            "If there will be an bundle subscription XI + XIV",
            "2 decade old graphics and a UI/control scheme to match are really hard sells these days. I might be able to forgive the graphics if they controls and UI wasn't so atrocious",
            "I was a MNK, WHM, NIN from 2004ish until 2009ish. Part of one of the first groups to kill Absolute Virtue. Great game, but MMOs have sadly moved on to much quicker gratification models.\n\nA lack of horizontal progression (which made FFXI great) is why I finally gave up on FFXIV. They're just never gonna do it.",
            "I really wanted to like this game when I played it earlier this year, but practically everything about the game is incredibly dated and clunky.",
            "I played this on my 360 while playing WoW on PC, stuck with WoW. Wanted to try it in 2024 but for some reason my brain can’t comprehend installing it LOL.",
            "I wish I could play it on my ps5.",
            "I remember wanting for years to play this game when I was little, I finally get some money to play it but I could not for the life of me figure out how to create an account, or something to that extent. They made that shit soooo confusing.",
            "I've never played it. Would it still be a good game to pick up in 2024??",
            "I loved the game right up until 14 came out and I lost access to the account. Never went back to 11. I broke my authentication thing and at the time they were very unwilling to assist.",
            "Do the jobs feel significantly different from another? Like will going into a certain fight as Dragoon make it easier than doing it as Summoner? Are there unique mechanics beyond mostly just doing damage with different animations? Special damage types and elemental weaknesses?\n\nOne of my complaints with FFXIV (and why I decided to quit after 7 years of playing) was that all the jobs started to feel really samey.",
            "I went to try it but couldent figure out how to get passed the website boss to buy the game and make an account.",
            "I appreciate 11 for what it is from a distance, the interface and controls just put me off. \n\nPlenty of interesting playthroughs on YT for me to watch/rewatch at least!",
            "If you want the (mostly) classic experience check out HorizonXI, free-to-play Chains of Promathia era server that should be getting ToAU, eventually...",
            "In one hand I want play FF XI (thanks to DFFOO who warmed my interest), but in other hand I don't want to spend my time to another MMO routine",
            "I've been playing on a chains of promathia private server for a while now it's a blast! Can't get into the current retail version of the game though ",
            "It needs a single player remake. I want to get into 11 but it's so tough with how archaic and tedious it is. I love listening to the music though.",
            "I'm not paying £10 a month for a 20 year old game. If it goes the Guild Wars route and stops the fees, fine.",
            "Gave years of my life to FFXI. No time now with a family, but I still miss it.",
            "Genuine question as I haven't played it, can the sub job be the same as the main job? If not wouldn't that mean there are  462 combinations as there is one fewer choice for the second job?",
            "While I do enjoy FFXI I don't think pure number of combinations is a good metric for just about anything.",
            "I gave around 23,000 hours into this masterpiece.",
            "I've given it a try a few times even with the guys guide linked from the FFXI subreddit. It's just a painful chore to play as a newcomer in its current state. I can't even get a feel for the controls.     \nThe guide said to do these faction missions to get from level 1 to 5 and I didn't even have the patience to do those because they just take absolutely forever and the instructions for most of them is very unclear.\n\nThis was probably fantastic when the only alternative was EverQuest but now it's just an incredible slog straight out of the gate.   \n\nI understand you can basically hire NPCs to fill out your party, but getting to that point is just not enjoyable.   \n\nHaving played a bunch of MMOs including vanilla WoW and XIV ARR as well as Guid Wars 2, Rift and probably too many others to count, this one just doesn't give new players enough guidance to draw them in. I think only people gave been playing since the beginning would still be into it.  \n\nIt's a shame because I want wanted to like this game. I still want to like this game. I wish I could skip ahead to the first dungeon instead of spending weeks doing chores.",
            "I don't do mmos. I'm glad it's there for those who do",
            "How many are behind the paywall though?",
            "It’s why I can’t wait for the FF14 alliance raid all about FF11.",
            "484 job combinations....but back when I played?  People wouldn't let you into a *leveling party* if you were anything but 5% of them.  Let's not even TALK about end game content.\n\nThe combinations and mechanical possibilities were pretty amazing...but the learning curve was bloodthirsty and the community meta was pretty disdainful of anything that it didn't already love.",
            "I don't know anything about 11. But I am curious how the new raid in 14 is going to be considering it is based on 11",
            "Yeah but how many were viable options?",
            "But only the meta counts if you want to be successful",
            "Did I miss much by skipping this game? I simply didn't want to pay almost 10$ monthly for being even able to play this one, plus I'm not really fan of MMORPG genre in general.",
            "With 480 are utter trash and 4 others are really good ones",
            "I'd actually like if SE revived FF XI for Ps5.. would almost convince me to start back up.. sadly I don't see that happening anytime soon.. or ever for that matter",
            "I am it would've gotten more love if we could play the damn game",
            "Great game great memories. I hope they develop an offline version",
            "And if you are ready to play, https://www.catseyexi.com is pretty much the best server to play on for 75 era without having all your time wasted.",
            "I know I am fighting against windmills here, because this sub is nothing but a sad popularity contest. But no, no game \"deserves\" more or less love. Every game deserves exactly the audience that it has. Just because you \"love\" game X doesn't mean everyone else is wrong when they love something else.\n\nYou are entitled to your opinion. You are not entitled to everyone else agreeing with your opinion.",
            "its one of the better FFs, unfortunately people don't like it because its Quest-like and would rather have a shit WoW clone that holds your hand on everything.",
            "I believe they should drop the monthly charge by now and bring in more players.  They can afford it",
            "I played from NA start until they pushed cap above 75. Loved my tarutaru with Maats cap.",
            "Sadly the community went meta with things. \n\nLike /nin on 90% of jobs became the norm, after I quit I heard /dnc picked up. \n\nThat being said it still did offer superior choice compared to modern mmo's. You could run into two lv75 characters of the same class and even with the same subjob they could be completely different builds based on gear, food, race, and merit points. \n\nSo being jaded when playing XIV whenever FC mates would ask about FFXI I would usually explain it like this. In XI no one was special, which meant everyone was while in XIV Everyone's special meaning no one is.  \n(Means in XI, your just and adventurers so everyone is more free to be more unique with your play style and gear and in XIV your \"Warrior of Light, Slayer of Primals and master of the stoic nod\" and everyone is pigeonholed into the same identical play-style and gear). \n\nI've long stopped playing MMO's but if I had to go back to one of them... I'd probably go back to XI. Though I never understood why Square wouldn't make it so you could play XI with XIV's subscription, Especially since my understanding is this last expac has been draaaaged out because of the planned graphics overhaul (I still get stuff in my feed even though I don't play anymore). So why not give players something else to do in downtimes?",
            "Want to try it but don't want to pay a sub for another MMO. Especially one that I knew will take a while to get used to.",
            "I would play it if it would be free\n\nNot going to get a subscription for it",
            "Final fantasy XI is dead. All that truly remains is the skeleton of a once great beast that is inhabited by the ghost of players who have invested much and are unable to move on. I truly gave the game a second chance after 10 years away, and nothing remains of why I loved the game. Yeah, the game itself is better, but you either join the lost souls, or you see how lonely the game truly is.",
            "make it no subscription you'll cowards",
            "Which 2 classes would make something similar to SOLDIER?\n\nI always wished we could mix skills in FFXIV",
            "A 20 year old mmo that could die any day now is a rough sell",
            "22 jobs + ? Subjobs = 484, ? = 462 subjobs. That’s a lot of subjobs",
            "Brady Guide says it's legit.",
            "I played the beta of 11. There was a pretty infamous player that only played WAR/WHM. They got to 50, the cap. They had to carry around mana gear to swap to in order to get enough to cast Raise",
            "WAR/WHM would be a great option for missions!  \n  \nYou can use trusts anywhere almost!",
            "Oh buttersheep, how I missed thee",
            "I leveled as Drk/Rdm all the way to 30 during 75 cap. No regrets! lol",
            "LMAO",
            "I think the people who are praising it typically have been playing since it was live and are used to playing a game that feels like waking through clay.   \n\nI would be over the moon if it was adapted into a single player experience where you could jump right into the story quest instead of doing 20,000 tedious chores first.",
            "I personally would only care for a minor graphics update.  \n  \nFFXI now is a fully fleshed out proper RPG.  \n  \nI also feel FFXI in 2024 is the best version of the game.  \n  \nI love true deep engaging RPG’s.",
            "I want 11 but made into a Diablo/eqsque ARPG. 6 player co-op through the entire story with all the jobs. I imagine randomized loot and instead of just gear equipment slots, you would have specific gear for abilities and spells. Take gearswap and just make it part of the game.",
            "Nah. Not needed. The game is almost completely soloable as it is now. 11 is a blast to play. And if you get a good linkshell that is active it makes the game even more fun. I got all of the summons unlocked super early because I made a few friends who helped me through the grind and I solo as a summoner",
            "All jobs are viable in different fights.  \n  \nFFXI in 2024 is a fully fleshed out game.",
            "Best looking AF/Relic/Empy gear in the game.",
            "Nope. Just me.  \n  \nYou should give it a try. It’s a truly a traditional Final Fantasy game. Elemental wheel, and rideable airships and all.",
            "This is a problem RIFT had as well. You had 5 callings, each calling had 11 souls (mage had 12). You could mix up to 3 souls at a time, and allocate 76 points between them, up to 61 in a single soul. You could, if you wanted, mix a dps with a healer... but you'd be booted from parties if your dps was absolute dooty. If you wanted to raid, you probably only had 1-2 actually viable specs to choose from. For a game that was all about \"play how you want\", you in fact could not actually do that for serious content.",
            "You mean you never ran SMN/THF back in the day to sneak through extremely dodgy places like, let's say, the towers in Ru'Hmet? Not every combination was viable at all in combat, but it's cool that you could try weird shit at all to accomodate different or even really fringe situations like this.\n\nOne of XI's strengths is its flexibility and just how much players can actually do, how players can approach the world and how there were even so many ways to approach combat rather than mashing out a single specific rotation like every \"modern\" MMO.",
            "True my dream was Sam/smn and then i realized that wasnt viable at all, big sad.",
            "I played THF/WHM for story missions.  \n  \nWhen you’re solo just having fun you can play any combination you like.  \n  \nNo individual player does Odyssey Gaol/Aminon/Vagary all day every day.  \n  \nYou really can get creative and have fun.",
            "And people say the WoW community is toxic…",
            "Oh, you're still using Haubergeon? Go get a Hauberk and then try talking to me again.",
            "The hate I had finding out whm was useless in crawlers nest because I didn't have refresh.",
            "Yeah, that’s why I don’t get that advertisement of huge amount of options for anything in games with group content. It all won’t matter because of the meta.",
            "This cuts deep.  I wanted to play a tanky sword and shield Warrior right after launch.  \"NOPE!  Ninja is going to blink tank, and you need to get a 2h axe and be a Provoke puller and Trick Attack partner.\"",
            "I’d let you join my party. I’m not the only one either.  \n  \nPerhaps consider a different server than where this is happening?",
            "That is quite the journey!  \n  \nI started in 2012, picked it up full time around 2020. I’ve been having a blast. Clocking in over 7,000 hours and just finished my first mythic. Much more to go!  \n  \nI’m glad it’s still available for people like me.",
            "Yep, I live alone, in a 1 bedroom apartment, living off money I make working only 20 hours a week, and I pay 53$ a month for it.  \n  \nI enjoy having so much extra free time and not having to rely on others.",
            "And after FFXIV 1.0 flopped!    \n    \nFFXI was the most profitable Final Fantasy until November 2021!",
            "The chocobo quest alone was a weird time for me because I wouldn’t wait that long in real life time for any other game. But I did because I was just charmed by the whole experience.",
            "Thankfully there was plenty (and i mean plenty) to do between those times. The game took all the time you were willing to give it, literally.",
            "An in game day is at maximum 1 hour. If you’re lucky, 1 minute.  \n  \nYou can easily use the time to level one of those sub jobs! Or reforge equipment, or craft! Plenty of options in 2024.",
            "It’s better than ever in my opinion.",
            "I dabbled in it earlier this year.  You get something called Trusts (basically AI characters) that can carry you.  However I found that very boring as the Trusts would just do everything for you.  That combined with just about every aspect of the game feeling clunky and dated turned me off of it.",
            "FFXI is not restrictive.  \n  \nYou can play entirely with friends making use of level sync, including battle missions, or play solo making use with trusts.  \n  \nYou just might want to use your phone to pull up a guide.",
            "I was just using WAR/BRD in abyssea.",
            "Pace yourself, it’s worth it!",
            "60 hours a week sounds super rough.    \n    \nI am glad I don't have to work nearly as much. I work 20 hours a week, and thats enough to afford a 1 bedroom apartment, and everything I could really want in life just fine. I have 1 desktop 3 laptops to play FFXI and pay 53 dollars a month. I've only been working 20 hours a week for about 11+ years now. I really enjoy it.    \n    \nI haven't bought a house yet, or a brand new car, but its not too far way really. We'll see how things go for me.    \n    \nAs for you, play what you enjoy. FFXI can be pretty demanding so if XIV is your cup of tea, then its great you have something you can enjoy!",
            "This is definitely one of the times where viable is being… misunderstood. Viable isn’t “efficient” and “speed maximized.” \n\nViable is viable, it means you can do the content as whatever, it might just take longer. And FF11 probably isn’t heavily populated. If you have 5 people, having a 6th is better no matter what their gear or job is. Any damage they do is more than the empty slot. \n\nLook at FF14. If you’re in a dungeon and the tank drops, 2dps and a healer are viable. It’s a lot slower, but I’ve done bosses without a tank because it’s better than sitting around waiting.",
            "I haven’t heard of a single job that isn’t used in endgame fights.  \n  \nI’m using in abyssea right now:  \n  \nTHF with a great sword.  \nCOR/SCH.  \nNIN/SCH.  \nWAR/BRD.",
            "I can easily look past minor flaws to enjoy a unique and so glorious experience.  \n  \nEveryone is different though!",
            "Makes sense.  \n  \nI easily can look past the minor issues to enjoy the massive grand scale of it.  \n  \nTook me some time, I won’t pretend it didn’t, but totally worth it.",
            "If you're asking me? Most certainly!    \n    \nIf you enjoy traditional gaming such as:    \n-Elemental Wheel    \n-Unique Job traits and progression systems    \n-Player activity impact on the world    \n-High level of customization    \n-Extremely rare, hard to find items and equipment    \n-Ultimate grinds for the most Ultimate weapons    \n-Involved and interesting story telling    \n-plus much more.    \n    \nIf you hate:    \n-Old games    \n-Slightly clunky controls    \n-Slightly dated graphics    \netc.    \nYou might need to reconsider.",
            "You've clearly either not played the game in a while, or you never have. ",
            "Nothing wrong with that last line, because I’ve been outright harassed numerous times, and my reasoning for those opinions (of which I defended) are well established.  \n  \nThe first line though, FFXI is special in this case. I say most people never tried it, haven’t tried it in probably over a decade, and it’s a much better game now than it ever has been.  \n  \nThat line obviously is opinion, and some would say it was better in 2002, or 2004.  \n  \nPoint is, few have given it a try, and many know nothing about it.  \n  \nIf you believe everyone knows everything about FFXI (2024 version) and have decided rightfully based on said knowledge then I agree, but I don’t believe that is the case.  \n  \nPeople don’t need to play a game to judge it, but I believe you at least should have sensible knowledge about it.  \n  \nHence the educative post.",
            "What do they gain from more players if they’re not paying?",
            "The game is a fully fleshed out RPG Final Fantasy, with job masters which is a nod to FFV, you might want to consider trying again. It’s amazing.",
            "I pay 54 dollars a month for it. It’s worth every penny.  \n  \n(4 accounts plus one Mog wardrobe.)  \n  \nIt’s even 4 cents cheaper than FFXIV’s cheapest option.",
            "I just got into it and love it.  \n  \nI started in 2012, and didn’t get into it much. Around 2020 I started playing more full time. I play it daily now and just finished my first mythic last week. It’s great.\n  \nIt’s a fully fleshed out RPG Final Fantasy now.",
            "FFXI is at no risk of dying.  \n  \n\nI would say XI lasting 22 years is a testament that it refuses to die, not that it has a likelihood of such.  \n  \nAs for age, RuneScape is even older.  \n  \nI don’t personally really see much of a difference between a 11 year old MMO (FFXIV) and a 22 year old one, if age is actually that important.  \n  \nBut everyone has different tastes, I’m just sharing that it’s a massive game that has a lot to offer, so if that isn’t your thing, then that isn’t your thing.  \n  \nAge really is a small factor in the scheme of things. RuneScape is even older and also at no risk of dying as well.",
            "22 times 22 = 484 combinations",
            "Cool story. Almost seems magical lol. I've seen many old school ffxi player that says they really wanted to play in that extremely early era of lvl 50 cap which was jp only.",
            "I recall PLD gets Raise at 50 but Galka doesn't have sufficient MP since it's like 150 MP so they needed MP gear too.",
            "> They had to carry around mana gear to swap to in order to get enough to cast Raise\n\nSomething mere PLD wouldn't be able to do... WAR/WHM superiority!",
            "Yeah, you're right. I'm a huge fan of modern FFXI, and unless you're going for Sortie, Odyssey, or Master Trials, every job combination is viable for a lot of content. \n\nThe WAR/WHM is still a good meme though, lol.",
            "Is it worth picking up? As someone who has always wanted to try it FF14 just didn't click for me",
            "Fair enough. It's been, like, 20 years now anyway.",
            "Oh, I dis try it back in the day\n\nDidn't like It because of the interface tho",
            "Most games with these kind of options are like that. XI is probably one of the more generous ones in that you do have Trusts so going solo is an option, but at that point it kind of begs the question why you'd play an MMO over just... FFV, or FFT, or whatever which have a bunch of job options too.",
            "Most =/= all. Are there odd niche cases that might be useful? Sure. It's still not really a selling point if it's not generally applicable.",
            "I did BRD/BLM for most of the story. Constant walking speed + warp lol. I occasionally did… THF/BLM too for the +% movement speed boots too",
            "People can do stuff solo sure, that's why I said you can do it with Trusts. It just feels a bit disingenuous to act like all these job combinations are options.",
            "I’ve never run into this situation.  \n  \nMost people say “come whatever you like” or just suggest a job. I’ve never had someone demand anything.  \n  \nI play on Ragnarok, maybe this is only private servers or Asura? I have never even heard of this mentality so I don’t know where it’s coming from.",
            "[deleted]",
            "This guy gets it",
            "This was my experience back in 2002-2005ish. I know it's changed since",
            "Congrats on Mythic! Huge accomplishment!",
            "You pay 53 usd for ffxi monthly? Isnt the fee cheaper",
            "No, I mean how does someone find 22 jobs in this economy??",
            "Facts and it doesn't get enough credit for that. \n\nBesides, it also puts the fantasy in final fantasy. just look at the artifact armor sets for each playable job. getting each piece of armor was an adventure itself! simply the most immersive, teamwork MMO experience I've played (and i play FFXIV)",
            "And if I just want to do the story it's really annoying. Just constant interruption.\n\nThe game making you wait until Japanese midnight to get the ending of Chains of Promathia after beating the final boss is just awful.\n\nI'll be honest, I don't really enjoy the game and am just trying to get through the story so it makes forced delays like that all the more painful. I can see why people like the game, but I am very much not the kind of person it appeals to.",
            "Sweeeeeeeet. I just want to experience the story. Sod the higher up raids etc.",
            "For..? BRD was one of my main jobs and I can't figure one valid reason to bring /BRD, the subjob is just too weak to be useful: it's limited to just one very weak song (caps at 150 skill, can't use instruments so can't combine singing with wind or string skills, can't use songs+ gear). Chocobo Mazurka maybe?",
            "How to buy everything 😂",
            "Everything is kinda viable at 99 though",
            "I enjoy older games more than the newer ones. \n\nMy only drawback from getting the game is that it's a subscription on top of $130 USD for the game and dlc's.",
            "Well, your post isn't really educative when you \"forget\" about the insufferable UI and controls. Also, from what I've seen, the game lacks a lot of QoL that most MMO now have.\n\nI really wish I would have played it back in the day, but nowadays, it doesn't really feel worth the investment, both in time and money.",
            "Why do you have 4 accounts?",
            "It's an MMORPG emphasis on the massive multi-player component. More people are playing Elden Ring dlc, then currently play XI. Go in, do all the storyline, and get out before you get trapped and join the other ghost unable to move on from the carcass of the XI beast.",
            "‘+’ is ‘times’?",
            "yeah, beta was only the base game. The first expansion wasn't ever available for testing. But it was very far along in the patch cycle, as I believe Summoner was added pretty late into the 1.x patch cycle life, and it was available in beta.\n\nIt was pretty wild and cool thing to experience. I believe it was live for like 3 months or so? Early 2000s, so getting info from the internet and datamining just weren't a thing. We just had vague rumors and stuff from few people who could read japanese that were playing.\n\nIt took so long to level, there were only a handful of people that got 50. And among them there were just a couple that managed to get AF gear. The endgame was basically just trying to grind for AF, try and farm the BCs for refresh and I think... raise 2? I think only one person ever got Refresh in beta.  \nI don't think any of the level 50 NMs were killable, maybe the rams? It's been so long, I know we made good attempts at the rams, but I can't remember if we killed them. I don't think we ever killed Behemoth either, way too hard, and we were way too new.  \nThe final hours of the game had the GMs spawning NMs like King Behemoth and fighting them with players, and I believe the producer played with people during that.",
            "If you can install ffxi without being frustrated then it's the game for you. The install process is the perfect microcosm of the work, time, but also payoff the game has",
            "keep in mind this game is different than 14. it is more older style grindy which is up to each others preferences. while 14 is more single player focused despite is a MMO.",
            "Definitely! I haven't gotten very far in it, purely because I can't justify paying two MMO subs at once, but I've really liked what I did play. I love the atmosphere and music, and the gameplay is surprisingly fun once you get used to how it works.",
            "As someone who believes depth of classes to be one of the most important elements to FF, I would play XI with Trusts over FFV/FFT/etc because the itemization, class system, exploration, storylines, and overall experience is simply better to me. XI perfects the job system by making each class unique, while adding an extra layer by implementing the sub job system.\n\nIn my eyes, XI is the ultimate example of the franchise. Sadly, it’s just very, very dated.",
            "It’s not disingenuous.  \n  \nMany people use all kinds of combinations for the story missions, Abyssea, Nyzul, you name it.  \n  \nSure you can’t play some weird combinations in a select few endgame content but across the board people have been very creative in solo challenges.",
            "Asura is definitely meta or nothing, no matter what expansion or time period. If ya wanna play an odd job combo with suboptimal gear, you gotta have a group of friends to do stuff with or pay out the nose until you have the proper gear. I get the itch to return about once a year, but I always remember how rigid the community is.",
            "At the same time, who has the human capacity to balance 484 combinations of jobs? WoW struggles to even balance the 12 classes with 39 specializations in total.",
            "Every job is viable.  \n  \nFFXI designs fights where different jobs and sub jobs are better than others.  \n  \nOne fight you will want to bring a RUN, another you will want PLD.  \n  \nUnlike say FFXIV where every job is the same, and the hardest fights can be cleared without an entire role when only 3 roles are available. Now that is poor balancing in my book.  \n  \nFFXIV’s content, including Ultimate raids have been cleared numerous times with:  \n“Only healers”.  \n“No healers”.  \n“No tanks”.  \nEtc.  \n  \nWith how similar each job and role is, this shouldn’t be remotely possible. Especially considering they have been revamping jobs ever since A Realm Reborn was released. You would think by now they would have at least some semblance of balance.",
            "From playing FFXI.",
            "There are ways to circumvent that experience.  \n  \nSuch as doing a survival skill quest when waiting on a SoA.  \n  \nMy advice would be to consider a different approach. You should be enjoying your time playing a game, especially if you’re aware of something that bothers you.  \n  \nPerhaps try reading ahead to foresee a game day wait.  \n  \nIf you like I have a guide I’ve been working on that makes reading ahead and doing mission related activities between game day waits. I can link it if you’re interested. I think it’s ready for use. I plan to add it to the wikis when I get time.",
            "WAR can’t use certain dagger skills, and BRD can grant that access, as well as access to Mazurka and Foe Requiem for pulling at a distance.  \n  \nIt works just fine for me.  \n  \n(My party set up was THF/WAR, COR/SCH, NIN/SCH, WAR/BRD.)",
            "Square-Enix website is the place I prefer, you can buy it steam as well.",
            "Playing at just lvl99? I'm not sure there is any cutting edge endgame that can be done at just lvl 99. You've still got ilvl, mlvl, and jop points.\n\nThe majority of FFXI content can be done with almost any job combination, thanks to how flexible the combat system is. But then there is the new Master Trials that seem only theoretically possible with VERY specific strategies.",
            "So I can always have a party no matter what I do.  \n  \nI was in a party for Delve last night.  \n  \nA lot of people will join parties for certain pieces of content, but tend to solo others such as Abyssea. So I have my alts for Abyssea, and friends for Delve, Odyssey, etc.  \n  \n(Edited to clarify some content is typically solo’d but not always.)",
            "I’m enjoying it thanks.  \n  \nI’m glad you’re enjoying Elden ring!",
            "I’m confused.  \n  \nIt’s 22 jobs, and each can be a subjob.  \n  \nThis means it’s a total of 484 combinations between those 22 total jobs, and one being a subjob.  \n  \nMaybe it’s 22x21 is what you’re trying to say, so it’s actually 462.  \n  \nI guess WAR/Nothing is also a thing, so technically it is 484. You can be all 22 jobs without a subjob before unlocking it, and then again in Odyssey. ^_^. \n  \n(Edited to add “technically.”)",
            "I read it as “and”",
            "The true challenge mode version of that boss was installing it on PS2.",
            "Great analogy! Totally correct too!",
            "Well, I got time! I might give it a try to install",
            "I think XI does interesting things for sure. I think I’d prefer a FFV or FFT system as you can mix and match more though, whereas XI you can only do main and sub job, instead of grabbing pieces from three jobs or more.\n\nThat and uh… it costs a lot more money. :P Sadly that practicality is always going to matter.",
            "While I'm sure that people have done solo challenges of Beastmaster/Puppetmaster or whatever, for most people these aren't really viable options again. And it's especially not viable if you're playing with other people in a general sense, which is one of the big things that makes an MMO what it is. If you want to play by yourself there are a lot of games you can do challenges with that don't require a sub.",
            "I’m glad I am on Ragnarok it sounds like.  \n  \nI honestly had to turn down parties inviting me because they said I could come anything with any gear, and I didn’t want to feel useless lol.  \n  \nI also rarely run into issues where people won’t party up if we’re at the same camp.",
            "I haven't played 11, but I don't believe for a moment there isnt troll/non viable combos or BIS combos.\n\nAlso, your point on 14 is disingenuous. An older ultimate has been cleared like that a very, very few amount of times, and if im not mistaken, the no tank one took months from literally the top 0.01% of players. In every other case for the other 99.99%, you need all the classes. Sorry, but judging a games balance from a handful of challenge clears from the literal top 0.01% is idiotic.",
            "Even if you CAN clear ultimates with special parties like that realistically only the very top 1% of raiders are going to be able to do that and with specialised strategies. Your average John Fantasy with a static and two months of spare weekends isn't going to be able to pull that off.",
            "You seem to be talking about, at least, 3 different types of balancing. There is job balancing where, for example, no one will invite a Monk (for example) because DPS cap is lower than every other job. There's class balancing (which might more properly be called separation) where tanks have survivability but not DPS, DDs have DPS but not survivability, etc. Then there's content balancing. The reason ultimate raids can be cleared with irregular parties is because it's old content, jobs have changed, level.caps have increased, and they didn't adjust old content.",
            "whoosh",
            "https://www.clinical-partners.co.uk/for-adults/autism-and-aspergers/adult-autism-test",
            "Most of the time I don't just sit there, I do other things. I follow the quickstart guide. I just find it very tedious, especially since I'm almost done so the amount of other things to do has dwindled. I'm level capped and have finished through Wings of the Goddess.\n\nI just am not a fan of the old school game design. I appreciate your efforts to be helpful though.",
            "Oh I see, you 4-box. What are you farming in Abyssea?",
            "You’re getting off the point.  \n  \nThe point is you *can* create challenges for yourself.  \n  \nYou also *can* have a few approaches to different fights.  \n  \nConsider the DRK krakken club situation. Players got creative, and SE found it to be more powerful than intended and had to adjust it.  \n  \nPlayers constantly create different strategies and jobs to improve success rates. This is for party play and solo play.  \n  \nThe point is you can be creative, and it is an option, and people do make use of it.  \n  \nNo where did I say “all jobs and combinations are the most optimal option for every fight.”  \n  \nFFXI is about finding which jobs and sub jobs work best in which fights.",
            "I might have to consider a server transfer next time :) listening to the OST gives me nostalgia overload, and I do love how basically any job can become a god these days.",
            "… lol….  \n  \n2-Leaf Chloris Bud.  \n  \nMaking Verethragna.  \n  \n(This is the most involved Abyssea item I’ve done. I hope overall.)",
            "I'm not even talking about optimal though. I'm talking about viable for most people. And about it not being straight up inefficient in comparison to other examples. The amount that are actually realistically usable is closer to half that if not more. \n\nI'm also not saying there isn't a lot of variety. But it's not as wide as you're presenting it.",
            "I enjoy the options in FFXI, and have made enjoyable use with them.  \n  \nIf you enjoy sticking to a set of choices then that’s great.  \n  \nAt the end of the day, the options exist.  \n  \nThe individual can choose if they enjoy it or not.",
            "I am glad you have. But, again, it is wildly misleading. The average person is not going to enjoy Beastmaster/Puppetmaster. The average person is not going to enjoy White Mage/Dark Knight. Or any number of random combinations I can toss out there. Do the combinations exist? Yes. Can you beat most content with Trusts regardless of job combination? Yes. Is this fun? Probably not. Are these combinations you can do in parties regardless of context? Definitely not.",
            "I play my main, with 3 alts, and I wildly enjoy, and find this setup to work great for me.  \n  \nI use:  \nCOR/SCH  \nGEO/SCH  \nBRD/COR  \n  \nI rarely see this, and it is really a set up I enjoy.  \n  \nI’m sure once I start trying harder content, I will find more combinations I can try and be useful for certain content.  \n  \nThe options are there and people can and do find things that work for them.  \n  \nI also don’t use windower at all, and use 1 desktop and 3 laptops.  \n  \nNot everyone is the same, the point is FFXI has the options. People can and do get creative."
        ]
    },
    "Terra and Mog Tattoo to complete my FF thigh sleeve.": {
        "title": "Terra and Mog Tattoo to complete my FF thigh sleeve.",
        "score": 10,
        "url": "https://www.reddit.com/gallery/1dlt82u",
        "content": "15 hours in total across two days. Painful but worth it! The Yojimbo and Vivi + Red tattoos are a little over a year healed at this point. \n",
        "num_comments": 2,
        "comments": [
            "Wow, do you like FF or something?\n\nJk. Amazing tattoos!",
            "Those are awesome!"
        ]
    },
    "6 months after revealing plans to become 'aggressive in applying AI', Square Enix's president announces he's being careful in applying AI | PC Gamer": {
        "title": "6 months after revealing plans to become 'aggressive in applying AI', Square Enix's president announces he's being careful in applying AI | PC Gamer",
        "score": 218,
        "url": "https://www.pcgamer.com/gaming-industry/game-development/6-months-after-revealing-plans-to-become-aggressive-in-applying-ai-square-enix-s-president-announces-he-s-being-careful-in-applying-ai/",
        "content": "I don't know. It might be that I'm allergic to crypto bros but this dude is giving me all the wrong vibes.",
        "num_comments": 45,
        "comments": [
            ">  It might be that I'm allergic to crypto bros but this dude is giving me all the wrong vibes.\n\n\nI love some of SE's games, but their executives are boneheads. I mean, the NFT thing was announced *well* after they already crashed and were shown to be a scam. Glad to hear them pulling back on the AI craze, but them blindly jumping on that bandwagon without any research or familiarity with it still points to them being clueless.\n\n\nGranted, I think most executives at most companies are idiots mostly risen through nepotism and luck, but I might just be jaded.",
            "Tbf they used AI for the lip movements for different languages in FF7 rebirth and the result was amazing. That’s one good way to utilise AI to save tons of development time",
            "They used AI for the new KH upscaling, and it messed up a lot of textures. And this isn’t their first time… they tried to use it on chrono cross, and it absolutely ruined some backgrounds",
            "Square Enix's top brass just suck. They're SO unbelievably bad its a wonder how the company is still functioning. They just don't get it. Square Enix's games are successful in spite of its executives not because of it. Have you ever wondered why there's always reports that \\[insert Square Enix game\\] under delivered and was a disappointment to them? Its because their sales target numbers are STUPID. Like unrealistic and stupid. Like they think their games will do as good as Call of Duty and hit THAT level of mainstream, thats how many units they think they're gonna sell. Its impossible for the developers to hit those targets with the types of games they're making.\n\nBut yeah, the ultimate \"Square Enix execs are dumb\" story is definitely just selling off the ENTIRE Tomb Raider franchise to someone else and using that money to get into NFTs, after the NFT fad died down and people realized its worthlessness.",
            "Use of AI in shit like upscaling, mouth animations in sequels, etc that ASSISTS the process and doesn’t full on replace people is a fantastic thing. But… idk… I don’t trust square too much…",
            "So... everyone gets this is a song and dance for the investors, right?  Supporting AI, being careful with AI... it's just to appease the stockholders who probably don't even know what the damn acronym stands for.  \n\nOr we could just keep dooming, that's fun too.",
            "Just a reminder that big gaming companies only care about money and they're never on the gamer's side. The whole NFT/blockhain and AI debacle tells how out of touch SE is.",
            "AI is one of those new topics that EVERYONE is looking at implementing different things for. Initially everyone is gun-ho about it. There are Definitely uses for it across the board. However, if not careful, it can screw with a LOT of stuff in the wrong ways. It's not a \"magic hammer\" that can fix a lot of problems. Can it do a lot if implemented correctly? Sure. but again the correct part has to be looked at with research.",
            "SE's top dogs have been saying this stuff about every tech bro fad for years.",
            "Well yeah, most of the big people there consider themselves ARTIST ASS ARTISTS so I'm sure as soon as execs tried making them use ai for the art or writing, theyd probably freak. Plus just seeing the last six months of the majority of their fans begging them not to us ai and already dumping on them for it.",
            "For a little while it felt like the CEO was trying to hop on every tech trend. I think what Square Enix needs to focus on now is building and maintaining a core fanbase. They tried expanding into a more casual space and it failed.   \n\nI'm not an expert, but from my perspective I think that the best thing Square Enix can do to keep their business profitable is to scale back their flagship franchises to \"AA\" budget games and focus on the audience that has been playing and enjoying their games for years.   \n\nGetting back to the roots of what made them successful to begin with and listening to feedback from their most loyal fans is, I feel, the best approach to make sure their next few releases are successful.",
            "Yeah I just want to get the end of remake trilogy already before the idiots do something catastrophic.",
            "Had the past been slightly different people would have said they were fools to make a console MMO too.  You can't expect every bold move to come out ahead but it's proven far more beneficial for them to lead the way with new technology rather than chase what's popular.",
            "To be fair, square has a long history of jumping on trends or trying to do the next big thing, and it ultimately undermines their company about 80% of the time ",
            "Than I am jaded with you because I believe the culture of failing upwards is starting to catch up with us",
            "You're not jaded. And of course there are always exceptions to a rule, but you're definitely not far off.",
            "The only reason I even remotely give a shit about SE is because of Yoshi P and FFXIV. If not for that I probably would have dropped this company like I did Blizzard.",
            "To be fair, AI upscaling for ports is nothing new; that’s fairly old emulator technology.",
            "I mean you’re not wrong but all the shit ppl are talking about in this thread was set in motion well before Kiryu entered the picture, even the AI stuff. Dude joined the company and basically spent the next year working on production and org realignment while evaluating performance in projections that were determined before he joined the company. He hasn’t been around long enough for us to see the results of like 90% of anything he’s done.\n\nI’m still wary of him but Matsuda got all y’all messed up. Personally I think the fact that Kiryu signed off on so many dev team leads being promoted to the board is a very good thing; there are fewer suits involved in the decision making at Square than any point since like the early 2000s.",
            "They're honestly legendary dumb. Some of the swings they've taken over the years are just beyond ludicrous.\n\nSometimes there was even some artistical hubris fueling it, like with the Spirits Within movie. I can forgive those, they were trying to push the artistic and technical envelope at the very least.\n\nBut more often than not it's just pure, calculated greed.\n\nAnd they suck at maths.",
            "I think the ultimate Square Enix execs are dumb story is The Spirits Within. I think it's still to this day in the top 3 biggest bombs in movie history. It forced Sakaguchi out of the CEO role.",
            "As a die hard Tomb Raider fan it killed me when they sold to Embracer. It was sold for so little and embracer is such a scam of a company. Now it's in amazons grubby mits... I truly don't understand why they're so incapable of making good business decisions but I guess that's something plaguing the whole industry right now",
            ">Its because their sales target numbers are STUPID. Like unrealistic and stupid.\n\nTheir target numbers are calculated way before the game even enters development. Like, when calculating the budget and development time. If you get 100 million to develop a game then you need a certain number of sales to get it back and then extra to actually make money. So you have a number where you break even, a number where you'd say \"this is fine I guess\", a number where you'd call it a success and a number where you'd call it a huge success if it surpasses it.\n\nWhenever SE calls something a disappointment, it's because even the lower end numbers, which were needed to break even,  weren't reached. They aren't pulling these numbers out of their asses to get mad about.\n\n[Here's](https://gameworldobserver.com/2024/05/24/square-enix-final-fantasy-unrealistic-sales-targets-jacob-navok) an interesting article that talks about SE sales expectations and why they're actually pretty reasonable, given the circumstances.\n\nTo quote:\n>With 3 million copies of FFXVI sold (the latest figure disclosed by Square Enix), the company would have only made around $120 million according to these rough estimates. In reality, budgets of AAA games like this are likely higher than $100 million, so it is not that Square Enix’s expectations are unrealistic. These titles just don’t sell well enough for the amount of money that go into their production and marketing.\n\nSquares problem isn't \"high expectations\", it's high development costs + business deals that were made in the beginning/middle of the 2010s but that didn't take fruition until 2020, which was when the gaming landscape had already shifted a lot.",
            "Yeah I could have sworn we’ve been hearing about SE investing in this for like 3 years now, and the only thing that resulted in was a NFT game that only made like 8 million in profit last fiscal year as far as I’m aware.",
            "Thats where the meme SE killed this or that tech bro fad comes from. They get into it, supposedly at least, and they come into it years and years way too late when no one cares about it anymore and then the quietly bury that and find a new old one to talk about.",
            "They were not the first ones to make a console MMO, that would be Phantasy Star Online, and it did quite well in all it's iterations. Square Enix were very much hoping to make an equivalent game using their much more popular IP on a much more popular console.\n\nSo box they were not \"setting a trend\" by making a console MMO, they were improving on an already tested formula, much like Blizzard with WoW vs EverQuest.\n\nThis is not to disparage FFXI in any way though, FFXI was a fantastic MMO. But it wasn't a bolder a move as you might think since they already had a blueprint to follow.",
            "It shouldnt be this hard to do. Its like.. just do what you're good at! Square have this weird obsession with being super mainstream, like Call of Duty tier mainstream. They're always desperately chasing that mainstream audience instead of finding a niche and just being the best in that niche and having a dedicated fanbase. Sometimes their sales target numbers, for a company like Square is absolutely ridiculous.",
            "Tbf, if u make 10 mobile games, 9 die off and 1 is kinda populair, u’re still making bank",
            "After Reforged, I refused to give Blizzard any money. That burned me so bad for one of my favorite games ever. And frankly, *every* game they've done for over a decade has been a mess or bad for players since the Activision merger.\n\n\nSquare has plenty of games that I enjoy, but I'm a lot more suspicious of their big projects. Triangle Strategy was a blast, I like Dragon Quest, and most of the remasters are solid. But a new mainline FF or Kingdom Hearts I can't just blindly buy. I wait for reviews for their games and pass on some stuff, which I didn't use to.",
            "It's just filters with extra steps.",
            "> The Spirits Within. I think it's still to this day in the top 3 biggest bombs in movie history\n\n\nIt was a huge failure, absolutely, among top at the time. But nowadays it's way lower on the list. The Marvels, John Carter, and Lone Ranger were all absolutely monstrous disasters, even adjusting for inflation.\n\n\nNow Disney can handle bombs like that, they swing big and sometimes it's Endgame, sometimes it's The Marvels. While, like you point out, it devastated Square, completely changing the dynamic for the Enix merger and ruining careers.",
            "\nThat 120 million is the net profit, not the gross. That's what they made after covering costs and the wording there is very deceptive.\n\nThese targets, as mentioned in the article, are based off stock market ROI projections. A public company is obligated to grow as part of the stalkholder model, not just make profits. These targets are determined by what the company needs to do to make more than the previous year.\n\nYes, they expected to make more, and the boom of 2020 did give a false of industry growth. But the thing left unsaid is that these games are still very successful. The article also mentioned that FF16 will likely make it's targets eventually. \n\nYou might notice that Square Enix has prioritised industry trends that were predicted to have a short half life (live services, nft's etc). Their huge drop is stock market value is not due to these single player games.\n\nEvery failed game they published, like actually failed to make a profit like The Avengers, were part of this new direction. It's indicative of the growth model these companies are bound to. It's why every major publisher chase these trends despite single player games making plenty of money. It's also why  these huge companies are engaging in mass layoffs instead of cutting profits at the top so the bottom line remains in the black. \n\nSo please, don't defend them. There are nuances to this, but it all comes back to greed ultimately.",
            "Pattern recognition is seemingly a very difficult thing for most people.  Much easier to just work themselves up into a fury.",
            "PSO isn't really an MMO it's just an online ARPG, closer to Diablo than FFXI",
            "Yeah, they could be a super prestigious name if they just stuck to story-based RPGs and maybe a few spinoffs, but they've ruined their reputation by constantly chasing trends and fads and releasing shit games just to copy whatever made some other company money.",
            "They tasted that sweet mainstream audience in the late 90s and they never realized that opportunity is gone! ",
            "What sucks is that The Spirits Within could have been a decent sci-fi movie a lot of people would have enjoyed, and even gotten a bit more grace if it was subtitled and chalked up to \"lost in translation\"/niche Japan-centric stuff westerners wouldn't notice.\n\nAll they'd had to do was call it anything except for \"Final Fantasy.\"",
            "So by your definition Path of Exile, or Diablo 3 & 4, for that matter, are not MMOs?",
            "Problem is they spent *way* too much money on it to have it be a foreign language, subtitled film. Mainstream audiences have almost never shown up for that. There's a handful of successful examples that did well, but only because they had a tiny budget. Godzilla minus one, Pan's Labyrinth, etc were successes, but still made fat less than Spirits Within's  budget.\n\n\nI think Crouching Tiger Hidden Dragon is the only time a foreign language film hit actual block buster numbers. And that film is a masterpiece and was a lucky fluke for hitting that success. Everything else (like Demon Slayer or Spirited Away) was primarily shown dubbed, and/or were cheaper projects.\n\n\nI see no way for that film to have ever been a success unless they slashed the budget for it in half. 137mil, and in 2001, was a *huge*. For reference, it was more expensive than any of the top 5 films that year, Harry Potter, LotR, Monsters Inc, Shrek, Oceans 11. It was always doomed.",
            "I haven't played PoE to compare but D3 and D4 are not MMO status because they have smaller maps with less players on the screen at once.  Diablo 4 is much closer but top-down gameplay makes it a lot less practical to put hundreds of people in one area.",
            "none of those are mmos",
            "You have a rather narrow view of what constitutes an MMO, but ok.",
            "And Guild Wars 1? Not an MMO either?",
            "It mostly needs to meet the massive part, I would consider my definition rather broad compared to plenty of others.  PSO wasn't that big. You could only have 4 people in combat at once and all the content was instance based levels you just teleport to.  There's 9 dungeons and 3 classes total.  You see most the content really quickly and the game loop turns into repeating it over and over.\n\nThe game never really called itself an MMORPG either.   FFXI was advertised as an MMORPG.",
            "You've pretty much described Guild Wars 1 just now. Only groups of 4 people's instances worlds only being able to see everyone in the cities, etc. \n\nIs Guild Wars 1 also not an MMO?"
        ]
    }
}