{
    "New to r/Fitness? CLICK HERE FIRST!": {
        "title": "New to r/Fitness? CLICK HERE FIRST!",
        "score": 1878,
        "url": "https://www.reddit.com/r/Fitness/comments/rv4o9f/new_to_rfitness_click_here_first/",
        "content": "# Welcome to r/Fitness - Reddit's #1 Health and Fitness community!\n\nr/Fitness is a **self-help** community.  Before asking questions, you are expected to have made a good faith effort to find an answer on your own and show it by explaining where you looked, what you found, and why it wasn't enough.  We ask you to respect that the people answering your questions are volunteering their time, knowledge, and experience.\n\nTo help answer your questions, get you started, or help you continue on your fitness journey, we have complied a comprehensive Wiki and FAQ.  [**https://thefitness.wiki/**](https://thefitness.wiki/) is the result of community discussions on best practice, expert opinion, emerging science, and general know-how from those who have made fitness their lifestyle or profession.\n\n# The r/Fitness wiki is moderator funded, and this year we are asking for your help to make it community funded.\n\nDomain registration and hosting costs over $500 per year, but it is important to us to house this resource off-platform.  Why?  To keep it ad-free and prevent any undue sponsorship or marketing influence, to keep it organized, to ensure content and links to outside resources work regardless of app or browser, to enable proper search functionality, and to make sure it's available during site outages.  **If you'd like to contribute**, you can anonymously donate any amount via [an Amazon e-gift card](https://www.amazon.com/Amazon-1_US_Email-eGift-Card/dp/B004LLIKVU) to [purplespengler@gmail.com](mailto:purplespengler@gmail.com).  Donations will be closed once the hosting fees are reached, and we thank you for your consideration.\n\n# Resources - Check these for answers before posting a question!\n\n* [The r/Fitness Wiki and FAQ.](https://thefitness.wiki/)  Most questions that people come to r/Fitness with can be answered directly by the Wiki and FAQ or by applying the information found in it.  It will always be the best first place to look for answers.  Moderators or the community can help direct you to the right information if you have trouble finding it.\n* [Searching past threads.](https://www.reddit.com/r/Fitness/search?q=&restrict_sr=on&include_over_18=on&sort=relevance&t=all)  r/Fitness has over a decade of discussion threads that are very likely to have answers to your questions if our Wiki and FAQ does not.  Remember when searching that fitness and exercise are not fast moving topics, and even discussions that are several years old are going to be relevant today.\n* [Google.](https://www.google.com/)  Yes, really, or your preferred search engine.  Google excels at being a source of answers for common fitness and exercise questions including exercise alternatives or progressions, meal plan and food options, equipment or product reviews, and so on.\n* Yourself.  Many questions we see come down to a matter of personal preference or can be answered by \"it depends.\"  You should check in with yourself before asking the community to decide something for you.\n\n# The Rules\n\n[The rules for r/Fitness can be found here.](https://www.reddit.com/r/Fitness/wiki/rules)\n\nr/Fitness is a high traffic community that is heavily moderated to maintain quality control and make good use of the resources provided.  When making a post or comment, you are expected to understand and abide by our rules.  Make sure to review [Rule #0 - No Threads That Are Answered by the Wiki, Searching Threads, or Google](https://www.reddit.com/r/Fitness/wiki/rules/rule0) and [Rule #5 - No Questions Related to Injury, Pain, or Any Medical Topic](https://www.reddit.com/r/Fitness/wiki/rules/rule5) as these are the two most commonly broken rules by new users.\n\n# Weekly Threads\n\nr/Fitness has some regularly posted, themed threads that you can see the schedule for below.  Please also check the links in our sidebar for Megathreads posted throughout the year.\n\n|Day|Thread|\n|:-|:-|\n|[Daily](https://www.reddit.com/r/fitness/search?q=flair%3Asimple&sort=new&restrict_sr=on&t=week)|[Simple Questions](https://www.reddit.com/r/Fitness/search?q=flair%3Asimple&sort=new&restrict_sr=on&t=week) \\- For posting simple questions, form checks, and routine critiques.|\n|[Mon](https://www.reddit.com/r/fitness/search?q=flair%3Amoronic&sort=new&restrict_sr=on)|[Moronic Mondays](https://www.reddit.com/r/Fitness/search?q=flair%3Amoronic&sort=new&restrict_sr=on) \\- An r/Fitness tradition that replaces the Daily Simple Questions thread every Monday.|\n|[Wed](https://www.reddit.com/r/fitness/search?q=flair%3Arant&sort=new&restrict_sr=on)|[Rant Wednesdays](https://www.reddit.com/r/Fitness/search?q=flair%3Arant&sort=new&restrict_sr=on) \\- For letting off steam about fitness problems and telling others that their rant is dumb.|\n|[Fri](https://www.reddit.com/r/fitness/search?q=flair%3Aphysique&sort=new&restrict_sr=on)|[Physique Fridays](https://www.reddit.com/r/Fitness/search?q=flair%3Aphysique&sort=new&restrict_sr=on) \\- For questions specific to how your body looks, what you should work on, visual bodyfat % estimation, and progress photos.|\n|[Sat](https://www.reddit.com/r/fitness/search?q=flair%3Astory&sort=new&restrict_sr=on)|[Gym Story Saturdays](https://www.reddit.com/r/Fitness/search?q=flair%3Astory&sort=new&restrict_sr=on) \\- For sharing fitness related stories with others who will get it.|\n|[Sun](https://www.reddit.com/r/fitness/search?q=flair%3Avictory&sort=new&restrict_sr=on)|[Victory Sundays](https://www.reddit.com/r/Fitness/search?q=flair%3Avictory&sort=new&restrict_sr=on) \\- For quick sharing of progress or personal victories that are too short fo a full progress post.|\n\n**Welcome to our community.  We are so glad you're here!**",
        "num_comments": 0,
        "comments": []
    },
    "Daily Simple Questions Thread - June 22, 2024": {
        "title": "Daily Simple Questions Thread - June 22, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/Fitness/comments/1dlrfsp/daily_simple_questions_thread_june_22_2024/",
        "content": "Welcome to the /r/Fitness Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search r/Fitness by using the limiter \"site:reddit.com/r/fitness\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you follow [the guidelines](https://www.reddit.com/r/Fitness/wiki/rules#wiki_rule_.239) for including enough detail.\n\n# \"Bulk or cut\" type questions are not permitted on r/Fitness - Refer to [the FAQ](https://thefitness.wiki/faq/should-i-bulk-or-cut/) or post them in r/bulkorcut.\n\n# Questions that [involve pain, injury, or any medical concern of any kind](https://www.reddit.com/r/Fitness/wiki/rules/rule5) are not permitted on r/Fitness. Seek advice from an appropriate medical professional instead.\n\n**(Please note: This is not a place for general small talk, chit-chat, jokes, memes, \"Dear Diary\" type comments, shitposting, or non-fitness questions. It is for fitness questions only, and only those that are serious.)**",
        "num_comments": 45,
        "comments": [
            "# Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*",
            "This summer I will live in a hotel with a new routine for 6-7 weeks. I want to use this opportunity to try out new healthy habits long enough to see their benefit and take them home. \n\nI’m a tall, inflexible guy with average or a bit below cardio fitness, little fat and little muscle. (193cm/80kg).\n\nI would like to ask your help (tips/warnings/sources) for a healthy and balanced beginner routine (7 days a week). I am thinking about yoga for flexibility & meditation, and using the hotel gym (mostly freeweights and cardio equipment) and the pool (available last 4 weeks) for muscle gain and cardio. I’m also planning to focus on eating right/more, while remaining vegetarian. \n\nI will work 6-7 days per week 12hrs per day, so I am aiming to use most of my spare time, which will be only 30-60 min, (like, 2100-2130) for these activities. \n\nWhat kind of balance/schedule would you recommend? Any tips/tricks/sources?\nAgain, I’m hoping to find, build, enjoy and take home new healthy habits. Not aiming to transform my life or body, especially since I’ll likely be quite tired every day. Thanks ahead!!!",
            "Is there a way to engage quads/glutes/hamstrings/calves etc more when walking? I have a feeling that I could walk faster, enjoy it more and be more stable on my feet. I feel like when I do walk there is some calf engagement and maybe tibialis anterior, and that's about it... Kinda tricky to find info about this online, so... Or should I just train those muscles and I'll feel changes eventually? I know for a fact that my calves are not bad, but others are undertrained and weak",
            "whats the best test to check my stamina to get a percentile comparison\n\nim naturally athletic and explosive but have piss poor stamina, it really bothers me that im always gassed when playing sports, constantly panting for air like a bulldog, while some of my friends who arent as fit dont seem to be affected at all",
            "Is it better to do accessory work for a body part after main lift? Or do all compounds and then accessory?\n\nFor instance \nSquat -> RDL -> Leg Extension -> Leg Curl\n\nOr\n\nSquat -> Leg Extension -> RDL -> Leg Curl",
            "How do you do your routines (everyday activities & workout routine)  when you're in a calorie deficit?? Can I ask for advice before starting my calorie deficit era?",
            "How much does exercise order affect strength? I know I’m weak btw I’m tall and skinny so it be like that.\n\nAnyways today I did 4 sets of pause deadlifts: I did 225lbs x 2, 245lbs x 2, 265lbs x 2, 285lbs x 2\n\nThen I did bench: I did 145lbs x 5, 155lbs x 5, 165lbs x 3, 145lbs x 5.\n\nBut then I did close grip incline bench: I did 110lbs x 5, 120lbs x 5, 127.5lbs x 4, 127.5lbs x 5. \n\nThen I did 5 sets of rows and decided to do close grip incline bench with 135lbs. I got 5 reps in. With my long arms I’m happy with that. But could I have gotten more if it was the first exercise of the day?",
            "Where to put Flys & Reverse Flys in a PPL routine? Current setup, all with progressive overload:\n\nPush = Bench 4x8, Shoulder Press 4x8, Front Raise 3x12, Flys 3x12, Triceps Extensions 3x12\n\nPull = Bent Rows 4x8, Lat Pulldowns 4x8, Upright Rows 3x12, Reverse Flys 3x12, Curls 3x12\n\nJust added the reverse flys and noticed that I absolutely feel it in my triceps and feel the regular flys in my biceps.\n\nSwap them? Overthinking it here?",
            "When you guys take a day off, do you generally go in on your next planned day off, or do you just take the day as a loss and exercise one day less that week?",
            "What's a good alternative for DL/RDL? I've got a back injury which means I can't do these barbell hip hinge exercises but I know how good they are for posterior chain. At the minute I'm just doing barbell hip thrusts and hamstring curls but wondering if there's anything else I can consider.",
            "Hi guys, looking for some nutrition advice on getting through a fat loss plateau at 6’6” / 245lbs\n\nContext: I used to cycle and play regular football. During Covid I took a bad tackle and fully ruptured my ACL, tore meniscus etc. It was a 2 year wait for surgery (initial misdiagnosis, Covid related delays etc etc) and during that time I gained a lot of weight. \n\nI never enjoyed the gym, but once I got my referral for the knee operation I got a PT for prehab. It’s one of the best decisions I’ve ever made. The prehab quickly got merged with strength training, and two years on I love the gym…\n\nI’m really proud of the progress I’ve made, I’ve put some stats below for the weight loss which is largely from the start of this year. Most of this has come from calorie counting, daily weigh ins, good routine with gym and reducing alcohol intake. I’ve gained muscle too, and people around me are making comments which is amazing.\n\nWhat I’m hoping for is some nutritional advice, hints or recommendations. I’ve got two stubborn areas of fat around my chest and torso. I’ve managed to reduce them to a point but I’ve plateaued recently and need to find a way to break through… \n\nIm a groomsman for a friends wedding early October (15 weeks from now). It’s two weeks in a hot country so I really want to get as lean as possible for pool days, suit, photos etc. also really curious to see some gains.\n\nIve posted some stats below, because of my height (6’6”) I’m struggling to hit the protein stats I’ve seen recommended by the likes of Jeff Nippard and Dr Rhonda Patrick whilst keeping calories under my BMR…\n\nAnnoyingly I’ve partially torn my meniscus again which rules out some cardio, but I can swim, bike and use a ski erg with no discomfort.\n\nAge 28\nHeight 198/ 6’6”\nPre injury weight 105kg / 231lbs\nPost op weight (September 2023) 126kg / 278lbs\nCurrently around 111kg / 245lbs \n\nFrom measuring yesterday:\n18.9% body fat \nBMR 2185",
            "Sounds like a great opportunity! Good on you for aiming to use this time to gain some good habits. \n\nI don’t have any advice for exactly how to structure things, but here are some general tips:\n\n- Don’t go too hard all at once - exercise intensity, too high of weights, etc. \n\n- Rest days are good. I alternate lifting and cardio for 6 days and then take 1 complete rest day. You need some recovery. Some people do “active” recovery, like going for a leisurely walk or gentle yoga. \n\n- View the gym as a playground for the first few sessions - try out different things and find what you like! You won’t enjoy everything, and that’s okay. You can read about “must do” exercises all day long, but the only beneficial exercises are the ones you’ll actually do. Make consistency your goal. \n\n- Once you find what you like, make a plan of sorts so you know what you’ll do each day when you go to work out. You can write it out beforehand and reference it as needed. You don’t want to waste time wandering around wondering what you should do that day. \n\n- Glad to hear you’re taking nutrition into account too. Make sure you’re eating enough to fuel your work. If you find you feel sluggish after increasing exercise, you may need to bump up your intake a bit. Calories are not bad. \n\n- Along with food, try to get enough sleep too. Food, exercise, and sleep are the big three things to balance. Don’t run yourself into the ground with work and exercise if it means not sleeping. Your body recovers and performs better with sleep. \n\n- Drink enough water\n\nI could think of a million more things, but that’s what came to mind first. And I’m not an expert, but I’m happy to try to answer any specific questions about what I’ve written. Best of luck!",
            "I’m not a physiotherapist, but I would think actively tensing (engaging) those muscles would cause undue strain and negatively affect your gait. I would think general strengthening would be more helpful. \n\nMaybe make sure there isn’t something else going on, like hip drop (which is a sign of weak glute medius and minimus).",
            "Could try taking longer strides I feel like that loosens up my hip flexors and even slightly stretches the quads a bit more than regular steps.",
            "Are there inclines where you live or is it all flat? I've felt it's way easier to isolate how you use leg muscles on inclines and declines.",
            "There is no way to get a percentile for this.  \nIf you want to improve your cardio, do more cardio. If it’s for a specific sport, practice that sport more and find workouts intended for that sport.",
            "A percentile would require some standardized fitness test to really have meaning and that's not a thing in general, maybe just within specific communities/domains.\n\nJust do actual cardio, stamina takes a while to build",
            "The later means cleaning up a squat rack, and then returning to a squat rack.  I prefer the former for that reason.",
            ">Squat -> RDL -> Leg Extension -> Leg Curl\n\nI would do this. I feel I can do each exercise with more effort  this way.",
            "you go to he gym. you look at what your plan says for the day.you pickup the weight, and put it back down as often as is programmed.",
            "It isn't clear what you are asking. I just keep doing my routine.",
            "It can be a slog for sure. Go to the gym on a bulk? You feel like a superhero. Go to the gym on a cut? Ehhhh not so much. \n\nI'd say just follow your program as others have suggested, but don't beat yourself up if you end up not being able to complete reps/sets. Your focus should be on maintaining the muscle you have while you cut, not on new PRs. Good luck!!",
            "You put on your big girl panties and do them?",
            "probably.  programs organize the sequence with this in mind.",
            "Isos:  day of, or day after, *not* the day before.  Otherwise, \"whenever\".  What you have is fine.",
            "Depends on my programming at that time. The nice thing about 3 and 4 day splits is that it's easier to move things a bit to accommodate a missed day. Otherwise, I just consider the day a loss and continue the rest of the week as if it didn't happen. If it just happens once in a while it won't have any noticeable effect on your progress and isn't worth stressing about.",
            "You told us your entire life story and left out the one thing that might help you. How much you’re currently eating. How much protein are you trying to eat? Are you losing weight? Have you calculated your tdee instead of BMR?",
            "> Most of this has come from calorie counting, daily weigh ins, good routine with gym and reducing alcohol intake.\n\nIt sounds like you're doing the right things already.\n\n> I’ve got two stubborn areas of fat around my chest and torso.\n\nUnfortunately you can't spot reduce body fat. Where you lose fat is dependent on genetics. If you're still in a deficit and also gaining strength and muscle, then just keep doing that. \n\n> I've managed to reduce them to a point but I’ve plateaued recently and need to find a way to break through…\n\nAside from following a proper program, tracking calories/weight, and getting enough rest, there aren't really any other game changing secrets to making significantly better progress.",
            "It's boring but the truth is the you literally just need to eat less. \n\nIf you have issues reaching protein goal and keeping calories low, you need to eat more protein-dense foods.\n\nLow fat cuts of meat or low fat dairy. Whey in smoothies, cottage in whatever recipe",
            "Thanks for your tips!! Especially the “the only beneficial workouts are the ones you do” struck with me, and aligns perfectly with my goal of finding a nice balanced habit. \n\nJust a quick question: I once saw online that deep stretching for prolonged periods puts your muscles under the same strain as a workout of that muscle. To your knowledge: is this something to take into account, and thus not do some more intense yoga/stretching of the same muscles I exercised the day before?",
            "Good point! My gym has 1 squat rack (a crime I know) so makes it much more important imo",
            "Thank you! Tbh, I'm not following any programs to start with, I'm just doing my research and creating a DIY meal plan with my target calories in a day.",
            "I just edited it. Apologies for that! :)",
            "I’m doing a program but might have went a bit off it today haha (it was rpe based for this stuff). I just wanted to get that 135lbs on incline close grip. Never put that much weight on that bar before so it felt like an achievement.",
            "Yeah, it’s normally a once in awhile thing - it’s def not smth I feel good about. But it’s the second one I’ve taken this week (I normally workout 6 days a week, assuming I take today off I’ll have done four.) so I feel a bit iffy about just fully skipping it, yk?\n\nHistorically I haven’t had many problems with gym attendance, but I did a bit of a reset and made a new routine a week or two ago so I’m still kinda bajigitty about days off n whatnot.\n\nAlso thanks for the input, i appreciate it",
            "Whatever keeps you going is best, but imo it's easier to stick to simple \"minimums\" and be flexible with the rest.\n\nFox example you focus on reaching protein goal, some fat, and then whatever fits in your max calories goal.\n\nIf you prefer having a stricter plan to follow that's fine, just know that if you don't,  it's okay to keep it simple.\n\nAs for programs, I'd pick one from the wiki and stick with it for a bit for good progress",
            "I'm still not sure what you are asking. I just do the same routine I was doing before, though I may decrease intensity on some sets and I don't try to push my progress as hard.",
            "It's mind over matter. Like I said, if it's just a fluke then it won't really impact your body in reality, but if its going to bug you mentally despite that then I would just go.",
            "Okii. Thank you!"
        ]
    },
    "Gym Story Saturday": {
        "title": "Gym Story Saturday",
        "score": 16,
        "url": "https://www.reddit.com/r/Fitness/comments/1dlpqbc/gym_story_saturday/",
        "content": "Hi! Welcome to your weekly thread where you can share your gym tales!",
        "num_comments": 39,
        "comments": [
            "Some dude loaded the leg press with all the plates he could find and then some... He then proceeded to do 2cm reps by repeatedly pushing his knees with his hands. It was quite a sight.",
            "Training legs, finished a set, went to sit on the bench and rest.. falls off the bench in the middle of the gym 🤣",
            "This morning there was a dude probably taller than 6'2 ft  and in his late 30's: black shorts and tank top, black cap, the body was covered with tattoos, thick beard, a piercing and he was doing all his exercises with a strong sense of concentration. we happen to bump into eachother doing similar exercises and we finished the same time. When we entered in the lockeroom I noticed he just racked all his things in a pure white tote bag with a printed brand and comic, he put the bag under his armpit and went away with relaxed face. I must admit the way he went out was extremely innocence and cute, you would never say that in person. Big men with a youthful vibe are the best, I want to be one too!",
            "Middle aged woman here. Men still look and I appreciate it. But yesterday made my entire month:\n\nLeg/glute day, I'm minding my own business. Close to me 2 young men in their late 20s work out together. Not knowing, they speak a language I understand. I'm doing landmine reverse lunges, with the landmine on my shoulder and the front leg elevated on a plate, when I overhear one of them say \"man she's such a milf\", to which the second guy replies \"totally bro\", and then they both glance at me. Made me feel good.",
            "I had to stare at my phone hard this week. Standing right across me was major camel toe. I had never seen one where the slit was so clear. I wear leggings too but never had such a situation. No way that was comfortable",
            "Some dude playing solemn songs that can make anyone feel sleepy",
            "Loaded up the squat rack with 6 plates total. Unfortunately there were four on one side and two on the other. Thank God for clamps. Guy benching behind me got a laugh. \n\nAlso pulled 405 this week. Just when you think you have it figured out the gym humbles you.",
            "My gym opened a cafe for some reason. Now I have to deal with the delicious smells throughout my workout. And then convince myself to go home and eat what I've prepared instead of wasting money on too much food. If I wasn't too wimpy to run outside, I would be looking for a new gym (they have a convenient indoor track).",
            "I have 2 storiea.\n\n1- A friend of mine is living in London and he is always saying that he is doing now 65kg in the bench press. This week is here at my gym and he is doing 3 reps (if you can do 3 reps, you can say you do this weigh, he says hahah). I though he was doing 4*10, so.I tested what he was saying and I did 3 reps with 80kg, but I feel this is ilegal, what do you think?\n\n2- The man who do the lumbar bench bad. He ia doing a handstand almost and proceed to move the legs, so he is puting his hands where the lega ahould go...\n\nWaiting to see your stories.",
            "I want to go the gym, I have already skipped 2 months and now I dunno how to go there. Sometimes I hate being introvert 😔",
            "did he clean up after himself? I've seen people do that and not clean up.",
            "There's a dude in my gym that does this! I counted, like 850 pounds on the leg press. Tiniest range of motion you've ever seen. Basically just racking and unracking. What's the purpose of this?",
            "He was probably gaining alot of confidence",
            "Don't forget the ones with the tiny dogs, too!",
            "You're actually a 10 when you're so hot even the young ones are checking you out.",
            "Glad to see a women that appreciated this, younger girls would have them all over youtube by now",
            "Right? Working out is already hard, why make it uncomfortable too?",
            "For numer 1. Always say the rep count. I say my 5rm or 3rm or 1rm when speaking about what weight I lift.",
            "This is why this thread is so great, I read other people's experiences and it motivates me to go.",
            "now this comment made next month too lol\n\nthank you sweetheart x",
            "That's because real women like real men, and real men check out women. \n\nMany young girls nowadays are too busy with either themselves 24/7, or counting 'micro-aggressions' (whatever the f those are), waiting for their safe space to reopen, counting how many mental illnesses they have, reporting their mental illnesses on social media, crying about everything on social media, lip injections, finding space on their bodies for new tattoos, and aggressively emasculating already traumatised betas and then complaining that there are no real men left. \n\nAs a woman who was young in the 90s and early 00s, it's all very very sad to watch. We had so much fun, it seems young people don't have fun anymore.",
            "Mmmm, I always thought about 4 rounds of 10, and if I can lift that weight then I can say I lifted that weight. That's why I was surprised.",
            "We’re having plenty of fun still don’t worry about it babe",
            "Feminism ought to have ceased to exist decades ago, once the battle for \"equality before the law\" was won. Unfortunately, it appears to have evolved into a movement against masculinity. This seems to be the fate of most social movements. Rather than fading away as they should when their initial objectives are accomplished, they generate new goals, which often become increasingly absurd.",
            "I mean, not everyone do 4x10? Better to say a specific rep max.",
            "Really? That's good to know. Because once healthy young people started being terrified of breathing fresh air, I thought \"Generation Retardation\"...",
            "I could not agree more. And I'd like to point out that all aging feminists I know don't have families, just cats. And they are all miserable.",
            "I understand, like saying I do 65kg 10 reps, 75kg 5 reps and 80kg 2 reps. Well in thia case, my friend dis the same because the 2 of us said it like it was the normal thing gahahahaha",
            "What a weird thing to say",
            "You guys are dorks.",
            "You're just training for different things lol If you do always 4x10 and increase the weight you're definitely putting in volume and it's great for growing the chest. If your friend always does sets of 3 and increases the weight he's likely going for strength, volume will be lower (unless he's doing 20 sets lol) but probably in the future his 1 rep max will be higher than yours, so if you both spot each other and try to see who is able to bench the highest weight he will likely win 'cause he's more used to lifting heavy",
            "Lol, I know right? Imagine being young, fit and perfectly healthy, and yet running to get multiple experimental injections under government blackmail, harassment, threats and defamation, and thinking you're the sane one. Always trust a blackmailer sweetie ;)",
            "Thanks. I'd rather be a dork with a beautiful family, than a failed feminist spinster with 4 cats. But each to their own.",
            "Nice, so in addition I was training bad because I don't want a super chest (I almost need bras), but I want strenght. Thank you buddy. Any tips? How many times a week do you go to the gym?",
            "I started 3 months ago and main goal is weight loss since I'm fat lol I go 4x a week, monday and thursday upper body, tuesday and friday lower. I don't really want a big chest either ahah but if you need to lose weight it can look a bit \"bulky\" at first simply because there's fat, it will go away. If there is one thing I've understood is that you cannot become big by mistake all of a sudden, you must go trough your sweet spot first. It's like when you drive, you can't go from 0 to 200kph without passing trough 100, it's impossible. My chest at least already looks like a chest and not like breasts lol\n\nFor tips idk man, for the first two months I trained without a plan ahah. Then I studied a bit, and since I don't really want that much hypertrophy and my goal is to do calisthenics when I lose these 10kg, I looked into strength training and I found the programs from [stronger by science](https://www.strongerbyscience.com/program-bundle/). I think they're the best bang for the buck because they're science based and for only 10€ you basically get years of training programs. There are two programs for beginners, one for strength and one for hypertrophy, I chose the first one. I'm liking it, it's fun and it looks like it's working. Basically you chose 4 main lifts and once a week you do heavy weights for each of them. Like 5 sets of 3 at 87.5% of your max weight. At the end of the last set you have to note how many more reps you think you could have done if you didn't stop, and based of that number your max weight increases. So the excel automatically gives you your next weight each week based on your performance. Then each lift has accessory exercises which you train normally (like 3x8) at 75% of the max (always, because it is linear. So the weight can increase every week and you always do the same reps, the advanced programs have different variations instead because at some point you can't increase so quickly anymore). For the bench, for example, in 3 weeks I got to 65kg 5x3, and the last set I did 5 reps instead of 3. So next monday it's giving me 67.5kg. And so on",
            "If you want to get stronger, find a good strength program. I follow GZCLP my self right now as a novice lifter. You know it is for strength when they make you lift between 1-5 reps per set."
        ]
    },
    "Daily Simple Questions Thread - June 21, 2024": {
        "title": "Daily Simple Questions Thread - June 21, 2024",
        "score": 25,
        "url": "https://www.reddit.com/r/Fitness/comments/1dkzhy3/daily_simple_questions_thread_june_21_2024/",
        "content": "Welcome to the /r/Fitness Daily Simple Questions Thread - Our daily thread to ask about all things fitness. Post your questions here related to your diet and nutrition or your training routine and exercises. Anyone can post a question and the community as a whole is invited and encouraged to provide an answer.\n\n# As always, be sure to [read the wiki](https://thefitness.wiki) first. Like, all of it. Rule #0 still applies in this thread.\n\nAlso, there's a [handy search function](https://www.reddit.com/r/Fitness/search?&restrict_sr=on) to your right, and if you didn't know, you can also use Google to search r/Fitness by using the limiter \"site:reddit.com/r/fitness\" after your search topic.\n\nAlso make sure to check out [Examine.com](https://examine.com/) for evidence based answers to nutrition and supplement questions.\n\nIf you are posting a routine critique request, make sure you follow [the guidelines](https://www.reddit.com/r/Fitness/wiki/rules#wiki_rule_.239) for including enough detail.\n\n# \"Bulk or cut\" type questions are not permitted on r/Fitness - Refer to [the FAQ](https://thefitness.wiki/faq/should-i-bulk-or-cut/) or post them in r/bulkorcut.\n\n# Questions that [involve pain, injury, or any medical concern of any kind](https://www.reddit.com/r/Fitness/wiki/rules/rule5) are not permitted on r/Fitness. Seek advice from an appropriate medical professional instead.\n\n**(Please note: This is not a place for general small talk, chit-chat, jokes, memes, \"Dear Diary\" type comments, shitposting, or non-fitness questions. It is for fitness questions only, and only those that are serious.)**",
        "num_comments": 401,
        "comments": [
            "# Post Form Checks as replies to this comment\n\n### For best results, please follow the **[Form Check Guidelines](https://www.reddit.com/r/Fitness/wiki/posting_guidelines#wiki_how_to_post_a_form_check)**.  *Help us help you.*\n\n----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fitness) if you have any questions or concerns.*",
            "I'm using [nSuns LP](https://thefitness.wiki/routines/nsuns-lp/), 5 day variant; it's going great\n\nI have one embarrasing question tho: how do I get access to edit the [excel](https://docs.google.com/spreadsheets/d/1O0scKzbV22jNs3yYcNYymon4fsY7b7PQbWPjstorM4o/htmlview)? I cannot edit my training maxes, no matter what I try\n\nfrom my understanding, editing them will also edit the precentages for training automatically, so that's great. I found an app called “Boostcamp” that has the routine and changes the weights based on 1RM, but online calculators aren’t the best at that\n\nwhat am I doing wrong?",
            "alright, how the fuck do you properly take of weights after a deadlift  session lmao\n\ni feel like an idiot everytime, sometimes they come off with ease, other times i'm there just tugging away\n\nthis guy that i follow on youtube just yanks them off with ease every single time, what am i doing wrong ;_;",
            "is it weird to not feel sore? I did a full leg workout earlier today about 8 hours ago but i dont feel sore at all. I worked out for an about an hour and a half and in my opinion, did a lot. I did 5 sets of 8 reps of squats, leg presses, leg extensions, and seated leg curls as well as 20 minutes of cardio. I felt a little sore after the workout but no that im home i feel fine. Does this mean i didnt do enough and i should do more with heavier weights? For all of the exercises i started with low weights and then worked up until i did my max weight for each respected machine.",
            "Long arms are a blessing when it comes to deadlifts but man are they terrible when doing dips.\n\nWhat has been your timeline going from assisted dips > body weight dips > weighted dips?",
            "How are people getting 1g of protein per pound of body weight in without having an insane calorie surplus? Just getting over 100g of protein a day while staying under is hard enough, never mind having to cram in an additional 70g to get me to where I should be.",
            "How does using a Camber Bar ([like this](https://www.youtube.com/watch?v=CdTtrUQwpzk&t=780s)) on Squats differ from a traditional High Bar Squat? For example, does it allow you to stay more upright?",
            "What's wrong here?\n\nI'm doing machine bicep curls..planet fitness purple matrix machine.\n\nI feel my progress has been good and steady...so here's the problem...\n\nMy wrists don't want to follow the path of the handles...I end up lifting the weight in the notch between my thumb and index finger....which I feel is what's going to limit progress....at 140#s is hurts my hand.\n\nShould I ditch the machine in favor of dumb bell bicep curls so my wrist can move the way it wants w/o pain in hand",
            "I don't feel my chest working on most chest exercises when I'm preforming it, I only feel it after the exercise has been preformed like my chest has been working (like fatigue but I feel my chest a lot). I'm not sure if I'm doing too much volume, not going full ROM, or just doing something wrong. I go as deep as comfortably possible on all my exercises and I don't know why I'm not feeling my chest during the movements. I do: Flat Barbell Bench Press \\[3x6-8\\], Incline Converging Chest Press \\[2x6-8\\], Pec Dec Fly \\[2x10-12\\].",
            "Does anyone else have randomly bad lifting days?\n\nDespite good sleep and lots of nutrition, I had a huge strength loss today.\n\nI hit 235 lbs on front squat, 5 sets of 5 reps on last Monday. Today, on Friday, I tried to increase to 240 lbs but could only do 2 reps. Then I went back down to 235 lbs and could only do 3\n\nI had to drop down to 205 lbs to finish out the day with 2 sets of 5 reps. I'm feeling pissed off and frustrated and now my left knee kind of hurts for some reason lol. Has anyone else experienced this?",
            "I’m an absolute beginner to lifting and I’ve been following the “Linear Progression Based PPL Program for Beginners“ for roughly 7 weeks maybe. I was wondering, for stuff like the barbell row and romanian deadlift, should I try using straps if I can’t feel the weight working the muscles it’s supposed to be? My form might be wrong, but also I’m only using like the barbell with 5’s or 10’s on each side. It feels like I’m too tired/can’t hold onto the bar itself to do enough reps that fatigue my muscles or even practice the hip hinge movement. Same with the deadlift, even though you drop the weight to the ground for each rep, I feel like my arms/back are too tired to start the initial pull after a few reps. I can do the bar with lighter weights though and the movement feels easier to do than with just dumbbells. Any advice?",
            "Is it worth it having 2 different Push, Pull, Legs workouts? Like push 1, pull 1, legs 1, push 2, pull 2, legs 2. I just have one PPL I do and do that twice a week (still 6 days a week just exercise selection is the same in all push, pull, and leg sessions.)",
            "What advantages do zercher squats have over conventional front squats?",
            "I keep getting these small line like bruises on my body after working generally my chest or shoulders. At first I thought it was from my dog jumping up on me but I realized it didn't make sense for them to always be in the same spots and generally showing up after my lifts, anyone else experience this or know anything about it?",
            "im getting stretch marks on my arm from doing bicep curls, anybody know why?, and is it bad?",
            "Took the end of my bulk too far pushing the calories too high too fast, added quite a bit of fat around the waist.\nHad planned on doing a mini cut for a while so I started that, dropped around 3kg in three weeks, went back to maintenance and have been adding 125 cal per week for the past two weeks.\n\nSuddenly like 60% of the fat around the waist disappeared in the last few days, what happened there? Is it possible I was just holding a ton of water and if so why would that suddenly go away? \n\nThanks.",
            "Due to a shoulder injury, I cant do any overhead presses. Is there any exercise that I can do to substitute the machine shoulder press?\n\nAnd are there also any other good tricep exercises to do besides tricep pushdown?",
            "Any big guys with small wrists? If so, how small? \n\nCurious to see how big I can get - 6,5 inches in wrist size with relatively low body fat",
            "can someone tell me which deltoid cable y raise activates the most? from what I see, people say all three heads of the deltoid  but I would like to know which primarily. [video](https://youtu.be/ahyJaj1_Jtk?si=bmV14wKxlaMf6UPE) for reference\n\ni am trying to activate lateral delt most from this if that matters.",
            "Hello! I recently decided that I wanted to get better at dips and pullups, so I added some variations of these into my routine alongside my other non bodyweight exercises like bench press, pulldowms, rows etc and I run a Upper/Lower split. Now my question is, since I can only do a total of 1 dip, 0 pullups and 2 chinups, would it be even worth it to try to get stronger on these if I am currently bulking? The main way I'm currently doing these, is starting a set trying to do as many real reps, then following that up with 3-4 sec negatives. I do those until the lowering portion gets too fast. And about weight gain, I gain about 1 to 2 kg a month, and have been bulking now for 6 months, but I've been hitting the gym for a year now. I'm currently 82kg and 180cm tall. So what do you guys think? Is it worth it, or should I just stick to non bodyweight stuff for now?",
            "If I had time for one core exercise and one forearms exercise only, what's the best I can pick for each?",
            "In an attempt to increase side delt training volume, I've recently started doing something (maybe) a bit strange. I start workouts with two hard sets of cable lateral raises (one regular set and one drop set), do the rest of my workout, and one hour plus later my side delts feel recovered enough that I'm able to hit the same two hard sets at almost the same performance level.\n\nMy question is: is this a bad idea for any reason? Asking because almost every program I know puts all the sets of the same exercise back-to-back (with the exception of supersets), and I've never seen any program put an exercise at the start and at the end.",
            "I'm follow Jeff Nippards 2 day routine. Is it a bad idea to do both days on the weekend, Saturday and Sunday? Is it fine to do that sometimes on weeks I'm really busy?",
            "2nd week in the gym after 6+ years out of lifting semi-seriously in college. I’m pretty weak, which is to be expected. However, I’m much weaker this 2nd week than the first. Like taking 10 pounds off each lift week. Symptom of just getting back into the swing of things? Need more rest? I’m also eating below on calories",
            "Is there such a thing as too much heel elevation for (high-bar) squats? I have the Rogue Do-wins which have a .75\" heel, and while it helps me hit slightly below parallel while remaining tight, I was wondering if adding another .5\" to the heel ([using something like this](https://www.amazon.com/VersaLifts-Strength-Heel-Inserts-Small/dp/B08QJS6LB3/ref=asc_df_B08QJS6LB3/?tag=hyprod-20&linkCode=df0&hvadid=693666498182&hvpos=&hvnetw=g&hvrand=11699610241078936116&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9003279&hvtargid=pla-1584199693869&psc=1&mcid=6146447e9ee5304a9d7ebc195868d248&gad_source=1)) would be too much, even though it would probably let me hit ATG comfortably. Also, the problem is I have really long femurs, not mobility constraints.",
            "Hey all, im new on exercising and fitness. I want to strengthen my upper extremities. However, every time I started with basic calisthenics exercises like wall pushups, i ended up with irritated ulnar nerve in my elbow. I also worked as a barista.. and we have to lift up jugs, pitchers, urns. And i hurt my elbow at work when lifting a bucket of ice.. and my wrist has been hurting as well. Sometimes it feels like my forearm and elbow is about to explode, like having shin splint. My question is… how can i improve with all this pain. I have worked out other body parts before and the soreness is different than what im feeling right now. Is this normal and part of the process? Or could this lead to prolonged inflammation/injury? Thank you all, I appreciate your help",
            "Trying to get into a lean bulk after a longish cut/diet phase (a few months at 1500-1800 avg and 100-120 protein range) but after almost a week of 2200-2500 + 150-170p I've lost weight 4 consecutive days and close to the weight I started the at. I am M/6'1/175lb\n\nI know the answer is eat more, but am I also overreacting to small sample size? I am still kind of a noob so my lifts are still progressing (they were during cut, too), I am just afraid of overcorrecting when trying to find a sweet spot of surplus and trying to put everything together",
            "I’ve found most of the compound lifts to have reasonable numbers on Strength Level, except for Squat. At my body weight (190lbs), the beginner number is 171, which seems high. Alternatively, others such as OHP, bench, and deadlift all seem reasonable. Do folks often start out being able to squat to parallel that much, or are those numbers inflated, possibly because of not squatting to depth?",
            "Does the rate at which you bulk have any effect on how much fat vs. muscle you gain? If you bulk slowly by adding a low amount of calories, does that help your body gain muscle instead of fat? Assuming, of course, that you are lifting and paying close attention to volume, progressive overload, protein intake, sleep, etc.",
            "How many warmup sets should I be doing, and do I need to do them before every compound or just my first (bench)? After benching I do OHP and then incline DB press but I’ve never done warmup sets for the latter, should I be?",
            "Thoughts on pre workout? I 17M am currently on a weight loss journey and have lost close to 20lb and I’ve heard people take pre workout. Is it something I should be taking now or should I wait until I lose more weight? Current weight 208. Max was 225",
            "Hey Everyone!\n\nI'm gonna start saying that fitness is not something I know so I came here for advice. I'm almost 35 yo girl that haven't done any physical activity in years maybe a decade and I want to change that. \n\nMy goal is to just get healthy and fit enough so I don't suffer, like my knees hurt when i kneel or i get agitated quickly and I hate it.\n\nI'm 167 cm tall and I weight 65 kgs, I would like to lose some weight, like 2 to 3 kgs but that's not my concern, I just don't want to feel like im 60 years old hahaha\n\nWhat routine could I do to achieve such goals?\n\nThank you!",
            "what does the body burn first if you don't eat for a while, fat or muscle?",
            "Anyone know of workouts to improve fine motor skills? For finger/hand dexterity. Is that even a thing? or is there better methods than workouts to improve that?",
            "[deleted]",
            "Overhead barbell press - standing or sitting? I’ve been doing it standing and engaging my whole core, tried them seated today and felt better isolation of the working groups",
            "Should I leave my physical trainer? She's really close to me location-wise, has a private studio, and is great at explaining movements but she's also really expensive, sometimes inattentive, and really strict about cancellations even if I have a fever. I like her instructions and It's so easy for me to go because she's so close and I don't have social anxiety in a private studio but I feel so put off with paying 160 for a session I can't even go to because I have a fever. I just feel like she's in it for the money sometimes but I do feel like I learn a lot from her. I'm kind of torn :( any thoughts? Any idea of how to make the most of my last 4 classes in the package if I decide to stop?",
            "Protein vs creatine?\n\nI have been working out for the past about 6 months (cardio kickboxing, soccer and weights at the gym). I don’t eat red meat, only poultry. I roughly tracked my protein intake and realized I was not getting nearly enough based on the recommended amount for my weight. I started working on eating more protein including protein powder.\n\nMy goal is to both lose weight and gain muscle. I have lost about 40 pounds and want to lose about 10 or 15 more but also gain muscle. I’m now having protein-based foods/powders etc frequently - I am wondering is protein the most important thing to build muscle? Is creatine powder worth purchasing for my goals?\n\nThanks!",
            "Those who are doing 531 4x a week. How do you work in your conditioning? I've been trying to run 2 miles after weights but I always fall out of it. Mostly because I'm gassed after training for an hour.",
            "Can someone look over my push, pull, legs routine and tell me if it's good:\n\nPush\nIncline BB Press 3x10\nOverhead Press 3x8\nDecline BB Press 3x8\nDB Lat Raise 3x12\nDB Chest Flys 2x12\nBB Lying Triceps Extension 3x15\n\nPull\nDeadlift 3x5 35\nBarbell Rows 3×8 \nLat Pulldowns 3×10\nDumbell Row 2x10 \nBarbell Curl 2x10 No weight added\nFace pulls 2x12\n\nLegs\nSquats 3×6\nRDL's 3x8 \nDumbell Lunge 3x10\nLeg Curl 3×12 \nLeg Extensions 2×12 \nStanding Calf Raise 3×15\n\nI'm pretty new to the gym routine and some days I'll come out sore some days not really. Also in the process of bulking (very slowly) if that changes anything.",
            "Random drop in bench press strength?\n\n\nI had a new PR every week for the last 4 months with a rep range of optimally 6-8, but I'd take 2-4 if it's a new PR, but once I hit body weight for 6-8 reps, I plateaued hard.\n\n\nEvery since trying to progress past bodyweight, I've only gotten weaker, I can't even push bodyweight any more even for a single rep? \n\n\nI'd say optimally I'm not tip top, but it's been 3 consecutive weeks of massive strength drops. But JUST on regular bench press. Incline is fine, decline is fine, regular bench I can barely lift 1 plate? ",
            "Hey all, my question isn't for me, it's for my Dad.\n\nHe's recently told me that he would like to start exercising with me to build his strength and get leaner. I know how and what to eat so I've been able to help on that part, but the exercise part not so much as I haven't ever looked into good workouts for people his age and with his limits\n\nHe's 51 and his disability effects his back and causes back pain. He hasn't exercised in years, though takes care of my disabled mother which does involve some lifting and strength. He's been too busy to exercise until now.\n\nSo any recommendation's would be very very appreciated. We are starting small of course but for future reference I'd love some ideas for exercises, stretches, cardio and lifting. We are very excited to exercise together  :0)",
            "I’ve been on the fasted cardio wave lately\n\nTomorrow I have kind of a busy day so was considering doing 30 or so minutes in the morning, eating a quick carb-y snack at the gym and then hitting legs\n\nDoes this make sense? Will the cardio right before doing legs impact the workout too much?\n\nFor reference I’m 5’9 176lbs, currently cutting (starting weight 195lbs) at right around 2000 cals",
            "Is it a good plan to switch to a 6 days routine instead of a 5 day routine as a semi beginner (8 months of lifting) guy?\n\nIve been skipping legs for a little bit too long (around 4.5 months) and just this week i started hitting them again because i cant continue on a path to chicken legs. however, i really like the split i have right now;\n\nchest tricep \n\nback bicep \n\nshouders forearms\n\nThis has worked for me for the past few months and i really like it, i just came from a small cut and i feel stronger than ever, would it recovery wise be ok to put legs as my 4th day? this way i will hit legs the 4th day of the week always and rotate the rest of the days like i did before and it will also work as a semi rest day\n\nI eat healthy and i sleep well.",
            "feels like im stuck at benching or the progress feels really slow. \n\nmy current max is 275 \n\nwhat i did today \n\nBarbell bench 230 x 5 for 2 sets I did 4 reps on set 3 failed the 5th rep.\n\nincline barbell \n\n175 x 7 for 3 sets. \n\npec machine 145 x 10 4 sets i went slow and controlled for these burned like a mofo. \n\ncable tricep overhead ext , 3 sets of 15\n\ncable tricep pushdown 3 sets of 14 reps failed getting 15 reps. \n\nfinished with cable late raise 15 reps 4 sets.  \n\nlet me know if i should change anything.",
            "Hello, I am hoping for a routine critique. My current goal is fat loss. My current weight is 342 lbs. I just recently got macrofactor app.  I am a beginner lifter. I started lifting weight mid last year and due to health issues had to stop in December. I finally got back into weight lifting back in April. I did the full body workout program from the wiki page for beginners. I been working out 4 days a week with that routine and been recovering very well. I am towards the end of my first week of doing a P/P/L split 6 days a week. For progression my idea was once I was able to hit the top end of a rep range for all sets I would up the weight 5 lbs for upper body and 10 lbs for lower body. I take a 3 minute rest between each set currently. Also I can’t really do body weight movements such as pull-up/chin ups, push ups, or dips. I just do not have the upper body strength currently for these exercises. I cannot afford the gym, I do have a budget friendly home gym. I have a rack, barbell, adjustable bench, and adjustable dumbbells though they only currently go up to 50 lbs. The routine: Push A: barbell bench press 3x8-10, dumbbell shoulder press 3x10-12, and dumbbell skull crusher 3x12-15. Pull A: bent over row barbell 3x8-10, dumbbell row 3x10-12, dumbbell bicep curl 3x12-15. Legs A, barbell squat 4x8-10, RDL 4x10-12, single leg dumbbell calf raises 3x12-15. Push B: overhead press 3x8-10, incline dumbbell bench press 3x10-12, dumbbell tricep extensions 3x12-15. Pull A: barbell upright row 3x8-10, incline chest supported row 3x10-12, barbell bicep curl 3x12-15. Legs B sumo deadlift3x8-10, Bulgarian split squats 3x10-12, single leg calf raises 3x12-15.  Any feed back or advice would be greatly appreciated. I tried to take the information from here and the internet and do a routine based on the equipment I have and my limitations. Thank you for your time.",
            "What is a \"Pure hip hinge\"?\n\nI  have hip thrusts in  my program, or any \"pure hip hinge\" alternative, I  know an RDL  is  a hip hinge but I'm not sure if \"pure hip hinge\" means like no  low back loading or something.",
            "Need help with my current routine and recommendations if I need a replacement.\n\n I am 25 years old, 6'4, 220 Ibs and roughly 20% bodyfat. I have been lifting rather inconsistently for the past 2 years and have just started to take things seriously around half a year ago. I feel like I really push myself in the gym with failure and leave completely exhausted with around 4 workouts. However, I have not been seeing the results I'd like as progress has been rather slow and my many of my lifts are stalling. My goal is to put on more size and to cut to around 210 ibs with abs in the future.  I really would like advice on a program that gives enough volume and intensity. Here is my current program:\n\nDay 1:\n\nBench: 3x8 185 ibs\n\nOHP: 3x8 105-110 ibs\n\nWeighted Dips: 5x8 with 10 ibs added\n\nLateral raise: 5x12 25 ibs\n\nDay 2:\n\nPush downs: 5x12 165 ibs\n\nCurls: 3x15 30 ibs\n\nSkull-Crushers: 3x12 (still testing weight)\n\nPull-ups: 3x6 with 85 ibs added\n\nDay 3:\n\nSquat: 3x8 225 ibs\n\nMachine work for hamstrings: (I don’t know the names for the machines)\n\nLeg Press: 5x10 425 ibs\n\nHip thrusts: 3x10 185 ibs\n\nI sometimes replace day 2 or day 3 with a difficult rock-climbing session or hiking with a weighted backpack. All of the above lifts have around 2 min rest between sets. Please let me know if this sounds reasonable.",
            "I'm on the lower end of a normal weight, but I don't seem to store much fat on my butt, it's pretty bony. \n\n\nMy original plan was to do a classic bulk and cut cycle, but would my ass get bony again after cutting? Should I permanently gain some weight? Still bulk and cut, but not cut very much?",
            "Hey,  I’m sure there’s already a post about this somewhere, but I can’t find it.  \n\nI’m looking for a smartwatch, activity tracker, or other wearable mainly suited for tracking calories burned, recovery, stress, etc. I mainly do weightlifting and want to use it to gain more insights into daily calories burned to aid weight management.  \n\nHowever, I’m not a big fan of how these devices look and prefer to wear a “normal” watch.  I’ve seen some hybrid watches online as well, but the reviews are generally not great.  \n\nDo you guys have any ideas or tips? Currently, I’m looking at the Whoop, Withings, Garmin Vivomove Sport, or Deluxe",
            "When cutting weight, is 1.1-1.5g of protein per pound of weight to preserve muscle mass a hard and fast rule?  My 24M 240-lbs. brother wants to lose 3 lbs. per week by joining me in my 3-day split workouts, requiring him to have 1,151 calories per day.  If we were following the rule, 240 lbs. \\* 1.1g of protein per pound \\* 4 calories per gram of protein = 1,056 calories, leaving only 95 calories for fat and carbs, obviously not enough.  Assuming he can stay consistent with that calorie count, how much protein could he have to preserve the muscle?  Will he just have to settle for losing a lot of muscle mass if he wants to lose the weight that fast?  Or if he wants to preserve the muscle, will he need to lose the weight more slowly so he can get that 1.1g per pound of weight while also having room for the carbs and fat?",
            "Anyone else with a fast metabolism counted calories?\n\nI'm 33, somewhat active (cycle \\~10-30 miles a week for commuting etc., occasionally run, occasionally climb, etc.), 6 foot 1, lean but with some musculature, 72kg. Probs \\~15% body fat.\n\nOut of interest, I counted calories for a typical day's food yesterday, and the total came to **3600 kcal / day**.   \n  \nThis seems mad to me. I most definitely do not put on weight with this diet, but I'm no way active enough to burn off 1500 calories a day. Does anyone else have a metabolism this fast? Trying to work out whether I need to see a doctor.",
            "Is it possible to never/rarely need a de-load?\n\nI do full-body \\*roughly\\* 3x a week but sometimes it can be 2x with other responsibilities. I generally train in a strength range of 4 sets of roughly 5-8 reps or hyper range of 4 sets of roughly 10-14 reps, cycling every 6 weeks or so and usually stopping a set 1-2 reps shy of failure. I don't ever have any connective/joint pain and also do distance running on my off days which I feel has given me an edge as far as fatigue.\n\nEdit: And I am just into year 2 of serious lifting (if 3x/wk counts!) so still constantly achieving progressive overload gains.",
            "Hi im thinking of switching from ppl to this split: arms, chest and back, legs and shoulders.   \nThis is basically the arnold split but im hitting shoulders with legs. Is this split safe and good?",
            "[deleted]",
            "Is my app / watch crazy? How many calories does exercise actually burn?! \n\nI'm M/32/285lbs and between a ~45 min workout in the morning and walking ~2mi / day + whatever crazy math the chronometer app is doing, it says I'm burning 3500kcal in a day which puts me at needing 2400kcal to hit a 1000kcal deficit. \n\nIs the math mathin?\nI had been eating closer to 1600kcal/day. Do I need to eat more? I'm just now really starting to pay attention to protein and trying to hit ~150g/day to minimize muscle loss as I lose but I have to eat so much food to hit that!",
            "I feel like I don't have a lot of shoulder flexibility, so when I do reverse flys (flies?), I feel an uncomfortable stretch in my shoulders more than a squeeze in my back. Does this lack of mobility affect the effectiveness of the exercise for me?",
            "Are there any free online resources for 531? I own the 2nd edition but I'm understanding that it's out of date. Do I need to buy the updated versions or can I find them online?",
            "[removed]",
            "[deleted]",
            "Whey powder recommendation fitting these requirements:\n\n* No pea protein\n* No coconut\n* No lactose\n* No sucralose (this sh!t is plain bad for people. Had a health issue cuz of it years ago)",
            "Make a copy of it.",
            "you can put a small change plate, like the 2.5 lb plate, under the plate closest to the collar. It'll make unloading easier. Here's a random youtube clip showing what I mean https://www.youtube.com/watch?v=xB4cTynKkEM",
            "Use a deadlift jack, or roll the inner-most plate onto a small plate to elevate it.\n\nAlso, depends on the plate collection being used.  At our club we usually start with the big 45lb Crossfit-style bumper plate.  It has a slightly bigger diameter than the steel plates, so they all slide off nicely.",
            "put the smallest plate in the gym, usually a 2.5lb, on the ground and then roll the inner most plate onto it. This will lift the others off the ground. Pull ALL the plates off of ONE side of the bar, then slowly lift the bar up vertically and let the plates on the other side of the bar slowly slide off and then rest on the ground in a stack.",
            "If it's a home gym, invest $25 in a deadlift jack.\n\nIf it's a commercial gym, tell the owners to invest in some deadlift jacks. Surprising they don't have them.",
            "My gym has a t-shaped stand that lifts one side of the barbell off the ground.",
            "Throw a nickel or dime on the floor, roll the 45s onto it.",
            "A home gym, if you have a power rack, I deadlift in front of the rack, I set the safety bars to the lowest, and gently set it on the ends of the safety bars.",
            "https://thefitness.wiki/faq/im-not-sore-after-my-workout-did-i-do-something-wrong/",
            "No, in fact legs in particular I feel can take quite a beating and not feel sore after at times. But also it could be time to up the weight aswell.\n\nHow acquainted are you with progressive overload?",
            ">not feel sore?\n\nWith consistency, it's normal to not feel the Critical Debilitating Soreness we used to.",
            "I've always been able to do bodyweight, but I picked up weighted dips after I was doing 3x20 bodyweight dips.  \nI now add 5lbs every 3-6 weeks when I am bulking. I do weighted dips twice a week at different weights for 3x10 and 3x16.",
            "they made my shoulder feel funky until i actually figured out the best technique for my body and linearly progressed from bodyweight to dipping more (bw+plates) than i can bench over 4 months lol.   \n\nthe silver lining is long arms = more ROM/pec stretch = more hypertrophy but less absolute load",
            "Yeah, genetics are a blessing and a curse. \n\nEven at my most out of shape in my life I hopped onto one of those outdoor adult jungle gyms and popped out multiple body weight dips without much effort. On the flip side, I'm probably in the best shape of my life right now and still struggle to squat 1x my body weight (despite 1.3x bw bench and 2x bw deadlift)",
            "You don't quite need 1g/lb. 0.7-0.8 is probably enough.\n\nJust eat plenty of high protein foods like lean meats, nonfat dairy products, and protein powder. If you're cutting, reduce the amount of high-fat or high-sugar foods you eat.\n\nI personally eat a lot of nonfat greek yogurt. It goes great with granola, overnight oats, smoothies, protein shakes, and is almost 20g/100cal. Grilled chicken breast is very versatile too. Or even just adding two protein shakes a day can add 50g protein for only 250 calories.",
            "I like to look for foods that have at least 10 grams of protein for every 100 calories. Even better if foods are at 20 grams per 100 calories. I'm on a cut and getting 1,900 calories a day, and using that rule of thumb, I often have 800-1000 spare calories for fun food after hitting my protein goal of 170 grams. Here's a list to help get started:\n\n- Protein shakes (either pre-made or mixing protein powder in a shake yourself)  \n- Chicken breast  \n- Basically all fish  \n- Canned fish (tuna, salmon, sardines)  \n- Bone broth  \n- Peanut butter powder  \n- Egg whites  \n- Deli meat  \n- Realgood chicken strips  \n- Yogurt and cottage cheese (make sure you read the nutrition label, as protein per calorie varies widely)  \n- Beef jerkey  \n- Steak (the cuts vary widely in protein per calorie)  \n- Whisps",
            "It takes some time and practice to learn which foods are high in protein while being low(ish) in calories. A meal of meat + veggies usually fits in really well (like a salad with chicken), or Greek yogurt with protein powder, to name a few.",
            "1 lb of ground meat and 6 eggs nets me 120g.  I'm on a cut, and that's the bedrock of my strategy.  (Assuming .8g/lb *target* bodyweight, it's good for a *target* of 150 lbs.)",
            "Chicken",
            "I literally can't without protein powder. \n\nA good 90% whey isolate is usually only about 4 kcal per 1g of protein.",
            "First to u don’t need a gram per pound. .7 or .8 grams is enough. Also, you should go by goal weight, or lean weight so if you’re overweight don’t use that number. \n\nSecond, don’t cut too hard. 1 pound per week is plenty. \n\nThird, 150 g of protein is about 600 calories. That leaves a lot of room for other things. Drink a protein shake, eat a piece of chicken and you’re already at about 60 grams. Eggs, yogurt, pork, all good sources.",
            "562 calories of mexican style canned tuna is 100g of protein",
            "I’m recomping with a deficit of 459 calories, my actual daily intake is \\~2200 calories. I just bumped myself up to 1.2 grams of protein per pound of weight (currently at around 165lbs). I’m eating: whole milk protein shake for breakfast, Greek yogurt snack, chicken breast for lunch, Greek yogurt snack, meat or fish for dinner, another Greek yogurt snack. I have another protein shake before bed depending on what I ate for dinner (and if I got sloppy and didn’t eat a pile of chicken for lunch). I go with oats, potatoes, and whole grain pasta for carbs because they add a bit more protein. I throw in string cheese as a snack because it has protein but isn’t as high in calories as other cheeses. I stay away from calorie dense foods (breads and fats) to save calories for protein. I track almost everything that I eat with MacroFactor. If I go to a restaurant it’s usually sushi because that makes it easy to get lots of protein and track every piece of food. If I want to eat something that doesn’t suit my dietary needs I don’t fucking eat it because I’m stronger than that.\n\nOnce I cut off enough fat to make me happy (where are you my little abs?) I’ll drop back down to 1 gram per pound. Chasing protein is rewarding, but it can be annoying!",
            "The link didn't work for me, but yes, cambered bars typically distribute the weight so they are more like a front squat, which keeps your torso more upright.",
            "I think it's mostly just easier on your elbows/shoulders than a straight bar.",
            "Welcome to \"fixed path\" lifting.  Now's a good time to jump on free weights.  They're more fun anyway.",
            "thats one of the inherent problems with machines, the fixed path doesnt always align with how our bodies move. I would just use free weights instead.",
            "Use dumbbells. Biceps curls are almost impossible to screw up even for an absolute beginner.",
            "\"Feeling it\" during a lift is rarely a good gauge of how much you're recruiting a muscle in a lift. \n\nYou're not doing anything wrong, it's just the way it works. I *never*\\* feel my back on rows or pull-ups, except if I take a break from the gym, I'll feel soreness the day after doing my first back lifts since returning.\n\n\\*I'll downgrade this to \"almost never\"",
            "it is literally physically impossible to perform these movements without using your chest\n\npost a form check if you're concerned about technique",
            "Don’t worry about feeling it or not, that doesn’t affect muscle growth.",
            "> Does anyone else have randomly bad lifting days?\n\nRandomly bad days happen just like randomly good days do\n\nSometimes there's a reason, and sometimes there is not. \n\n=\n\nNot every day can be an amazing day. Track trends over time (and see if you can glean something from the data) as opposed to beating yourself up over one randomly subpar day.",
            "Honestly it might be time for a deload. If your knee feels tweaky at all after a couple of days, or if you don't feel strong and good the next time you're in the gym, I'd take that as a sign from my body that I need a lighter week, no matter what the programming says. ",
            "Yup, there are good days, bad days, and OK days. Most days are OK and you hit your lifts and move on. Bad days you do what you can and then move on. And when you get the good days you go hard and leave feeling great.",
            "> Does anyone else have randomly bad lifting days?\n\nThey exist. Those unexplainable really bad days got much rarer after my gym replaced the old collection of ancient plates from five different vendors with brand new plates from just one vendor. How confident are you that the plates and bars at your gym are reasonably well calibrated, so that you did not actually lift 220 lbs on Monday but 240 lbs on Friday (with different plates)?  \n\nSome other things that can factor in:  \n\n* as you already mentioned, sleep and nutrition  \n* order of exercises within a session  \n* being sick, even just a bit  \n* working out at a different, unusual time of day   \n* heat and humidity   \n* cumulative fatigue  \n* for women, where they are in their menstrual cycle",
            ">Does anyone else have randomly bad lifting days?\n\nNot really.  Bad days correlate with bad nutrition or sleep, and can be expected from my log.  If you have methodical progression, you'll know when you'll nail a set/rep, and when you *might* miss a rep.",
            "If grip strength or grip fatigue is limiting you, straps are a good solution to let you get quality work done. Just start using them at whatever point in the workout your grip becomes a limiting factor.",
            "I think mixing up your accessory movements is good, while keeping your main compound movements the same.",
            "If you saw someone with a single full body session that repeated every single session, you'd have some questions.\n\nFor basic periodization and progression, having two half-weeks makes sense.    So, you have deadlift/OHP/pullups as the Main Movement of one half-week, and squat/bench/row as the Main Movement of the other half-week.\n\nWithout this smidge of variety, half your movements get sandbagged.",
            "It's not necessary to create multiple workouts if you like the one you're doing. In fact, it's often best to stick to a single series of exercises so that you can get better at doing them, progressively overload them, and so on. Especially if your PPL is well programmed and you're making sure you're hitting all the major movement patterns. \n\nHowever, if you'd get bored and unmotivated by doing the same thing over and over, I think it's fine to switch it up for exercises that are similar. You could do dumbbell bench sometimes instead of barbell. Hack squats in lieu of back squats. Et cetera. Anything that keeps you in the gym is better than anything \"optimal.\" ",
            "They're more tolerant of mobility issues, can be loaded heavier, have a bit more margin for error on technique (you aren't going to dump the bar if you start to get folded, and it doesn't slide as easily) and have more direct carryover to certain lifts (particularly lifts that require a lot of upper back strength but allow you to perform them while rounded - deadlifts mostly, but also things like an atlas stone or a sandbag lift).\n\nThe downside is they hurt like a motherfucker, are more stressful overall (particularly on the lower back) and don't carry over as well to some other lifts (such as the clean).",
            "Advantages: they’re fun and make you look like a savage\nDisadvantages: your elbows hurt, people in the gym think you’re weird",
            "Stripes make you go faster its science dw",
            "Stretch marks are genetics. If you grow faster than your connective tissue can adapt you will get them. The only way to prevent them is growing slower. You can't remove stretch marks, but they get less visible over time. They are not bad, they are normal. A lot of people have them.",
            "just want to add, you may be able to prevent stretch marks by taking good care of your skin—drinking lots of water, getting enough vitamins, and using topical hydration products like aloe vera or hyaluronic acid. at the very least it'll be more comfortable.\n\nyou can try to reduce the appearance of existing ones using silicone scar cream/gel, especially if they're new. if they really bother you, you can look into microneedling/dermarolling and other skin treatments. microneedling is especially effective for scar reduction.",
            "Are you gaining weight? What is your height and weight?",
            "> I started that, dropped around 3kg in three weeks\n\nI can almost guarantee that's almost entirely water weight.\n\n> Suddenly like 60% of the fat around the waist disappeared in the last few days, what happened there? Is it possible I was just holding a ton of water and if so why would that suddenly go away? \n\nYeah, sounds about right. When you bulk up, it's not that you suddenly gain a whole lot of fat. It's that your body retains a *lot* of water.",
            "Yeah. Weight loss is weird. ",
            "I don't do shoulder presses, either. Cable lateral raises, face pulls, high incline dumbbell bench, and overhead extensions work well for me.",
            "my woman has a shoulder thing that makes overhead pressing painful.  she does fine with good old fashioned lateral raises.  for triceps, im a big fan of weighted dips and cross body extensions.  skullcrushers are also very popular and i work them in sometimes.",
            "Depends on the injury. I've been dealing with a collarbone issue recently that meant I couldn't do overhead barbell work, but I could do dumbbell single-arm incline press. Landmine press probably would have been another good one.",
            ">are there also any other good tricep exercises to do besides tricep pushdown?\n\nOverhead extension, skull crusher, bar dips, CG bench press",
            "> Curious to see how big I can get\n\nProbably very very big. Despite what online whatever says, I put little to no stock at all on wrist size being a limiter of muscle mass. I'll concede perhaps for someone trying to be a professional, as that's not in my wheelhouse, but aside from that I think it's mostly irrelevant.",
            "Wrist size is correlated with the potential amount of muscle you can gain, but it isn't the only factor. Amongst people with the same wrist size, there is still a huge range of potential.\n\nFrank Zane had about 6.5\" wrists (at least that's what I found online). And he had an all time great physique. But that doesn't mean everyone with 6.5\" wrists can achieve a physique like his.",
            "This looks like a focus on mid delts to me. \n\nFor rear delts, do the same thing but start high and pull to low. \n\nFor front delts setup the same as the person in the video but don't cross your arms, i.e. left hand grabs left handle and right grabs right.",
            "Depends how you do it. As done in this video, it looks like rear delt will be hit the most. Probably slitting hairs though. Dont get caught up in the minutiae.",
            "Your current plan seems like a solid one. An alternative would be to do banded pullups and dips instead.\n\nEither way will work.",
            "For forearm mass something like reverse wrist curls or wrist roller, since the outside of them isn't really trained directly with anything you're likely to be doing already. Once you've built a bit of size there, switch to something for the flexor muscles, since that's more likely to help your other lifts.\n\nFor abs, do ab wheel.",
            "Hanging leg raises for core and forearms\n\nSupserset w/ planks.",
            "Rollouts. Towel pull ups.",
            "Others are correct that hanging leg raises and ab wheels, if done correctly, are great. \n\nI'm here to advocate for the long lever arm plank. I slept on the traditional plank for a while because it's gets to easy really quick and who wants to hold a plank for minutes and minutes? \n\nThen I watched [Jeff Nippard's video on planks](https://youtu.be/1G0y8D5rFDc?si=OgNyl04kFN9DiCLw&t=217) and it changed the game completely. If you move your elbows forward, contract your glutes, and pull your elbows back towards your toes, the ab activation is insane. You'll be shaking after 20 or 30 seconds and, if you're not, just pull harder!",
            "its fine",
            "Totally fine to do it that way.  \nIf you feel it impacts your workouts, just move them to the end.",
            "Not optimal but if that's what you can do then it's way better than nothing. \n\nThere will be fatigue that you haven't recovered from on the second day so maybe consider switching the order you do them, i.e. day 1 on Sat and day 2 on Sun the first week and then day 2 on Sat and day 21 on Sun the next week. That way the day 2 exercises won't always suffer from immediately following after day 1. \n\nAnother tweak could be to go a bit easier on Sat than Sun each week, regardless of whether you're doing day 1 or day 2 on Sat that week. I don't mean change weight and reps, but rather maybe leave a few reps in the tank each set on Sat and then only push sets all the way to failure on Sun.",
            "Not ideal, but we all make due with what we've got.",
            "You can do it, but it wouldn't be optimal since both days are full body, many of the exercises between the days overlap so you won't be recovered by the next day. You should probably look at a different split which doesn't focus the same muscle groups on both days",
            "So many factors could be responsible. Could absolutely be rest, or diet, or stress, or just a bad day. Maybe after the practice you got last week, your form is coming back and better form almost always means harder. \n\nUltimately though, as much as progressive overload is absolutely a best practice, it's less critical when you're just dipping back in after so long. Remember that you've basically re-started your noob gains phase. The gains will come from even a very sub-optimal routine at first. Don't get too hung up on the number on the weight or the number of reps, just put in an honest effort and get to within a few reps of failure and you will progress.",
            "doms, you started too intense and aren't recovering, especially given you are on a deficit",
            "If you are a woman, it could be related to your menstrual cycle. Many women report feeling weaker or stronger during different parts of the cycle. Join us over at r/xxfitness :-)",
            "Sometimes even people that hit every workout regularly just have days where they can't lift as much as the previous week. This is nothing out of the ordinary. Just track your numbers over time and see if you can notice any trends with things like foods, sleep, calorie count, hydration, stress, etc that may be impacting your workouts negatively (and then address them if able).",
            "At some point, yes, it will negatively impact the lift.  \nFWIW I've tried versalifts, I opted to just buy romaleo 4s because I didn't like how they felt under my heels.  \nThey are a cheap way to try additional heel rise.",
            "Do you have a specific reason for trying to force more depth?",
            "This sounds like something above Reddit’s pay grade. Go see a physical therapist or doctor.",
            "The best thing you can do is work with a physiotherapist to address the root cause of the pain.\n\nIt could be a specific movement or specific action that's exacerbating it. Or, alternatively, it could even be specific weaknesses that you don't even realize you have. \n\nA 45 minute consult with a good physiotherapist, can basically make pain disappear.",
            "If this is your first week after your cut, I'd say give it another week or so then start making some adjustments.",
            "I wouldn't put too much stock into those standards. The only meaningful metric is your own past performance.",
            "This is normal. I wouldn't worry about it. Newer lifters are pretty wacky in terms of what they're strong or weak in.\n\nI find that newer lifters often struggle a lot with the squat because of how much bracing plays a part in squatting a decent amount of weight. In comparison, picking something up off the ground is a very natural movement and people naturally brace for that. And bench press  is close enough to a pushup, that people often  can do it fairly well.",
            "In addition to what others have said here, \"beginner\" is a *suuuuuuper* vague term when it comes to lifting weights. There are basically 2 main factors to how advanced a lifter is: how much muscle you've built, how much you've refined your skill in the lift. The first is a super-slow process at best, the second is incredibly difficult to quantify.\n\nYou end up with some people saying \"beginner is your first few months where you're just learning how to do the lifts\", some people saying \"beginner is how long you can run a Linear Progression before hitting a wall\", some people saying \"it's [6, 9, 12, 18] months (some longer period than group 1 says)\", some say \"it's until you can lift [X]% of your body weight on [Y] lift\".\n\nIt's just a weird thing to try to draw boundaries around, so not really that useful to use as a metric for progress. It's good to have milestones to aim for, but ultimately if you're stronger than the person you were a couple weeks ago, you're doing awesome.\n\n(And yeah, some people are just good at squats. I progressed *really* fast with squats at first, while it took me a longer time to get the hang of the other lifts. Even DL was weird for me for a while, even though now it feels easier for me than squats at the same weight do.)",
            "Probably depends strongly on your program at the beginner level. If you don't squat 3x a week, you're not gonna progress as fast. It's all gonna catch up soon, so don't worry about it.",
            "I'm not sure what your reference is, but 171lbs for a beginner may be reasonable assuming that a range for beginners included folks who have been squatting for several weeks or even months. There's not of guys who have never lifted before that could put up that number.",
            "A lot of movements FUCKING SUCK early on especially compound movements. Your body gets used to it after a few sessions but holy crap my body hated dead lifts and squats (with the bar)  so  damn much just starting off. Squat especially. Made my legs feel weird and made my head feel weird (even if the weight technically wasn't even that high).  Could barely approach parallel. Eventually got used to parallel. Tried to do ass to grass and felt like my legs were dying. Got used to that too after a few sessions. Now it is still hard but otherwise feels fine to do, similar to bench press.\n\n=\n\nAs a sidenote I felt extra weird about it because I had been doing leg press for many months and felt squat should thereby be fine and yet it absolutely was not fine for me hahaha.",
            "Yes, that's exactly how it works ([discussion of research](https://www.youtube.com/watch?v=q1J3WGz_QJU&t=8s)). A smaller surplus builds a bit less muscle and a lot less fat.\n\nConsider it validation if you're someone like me with a naturally low appetite where eating 1000 kcal surplus is very hard and feels awful. You don't have to do it.",
            "Absolutely. Current research shows that you really don’t need much of a surplus to bulk effectively, something like half a pound per week of weight gain is plenty.",
            "There are always tradeoffs. \n\nA slower bulk's tradeoff is that you put on less overall lean mass, but you also put on less fat mass. That is to say, if you put on about 4lbs over 8 weeks, you may put on something like 3lbs of lean mass, and only 1lb of fat mass. \n\nA faster bulk's tradeoff is that you put on more overall lean mass, but you put on slightly more fat mass. That is to say, if you put on 8lbs over 8 weeks instead, you might put on something like 5lbs of lean mass, and 3lbs of fat mass.\n\nHere's the thing though. Losing fat is actually pretty easy compared to putting on muscle. On a deficit, you can easily lose nothing but fat mass. In 8 weeks, you can easily drop 8lbs of fat. Possibly more if you go more aggressively.",
            "Warm up for each exercise by doing the exercise with a light weight. Quantity is personal preference - with experience you’ll figure out the best balance of warmed up but not too tired.",
            "warming up is largely individual so its just something you have to play around with and find what works for you\n\ngenerally speaking I do 3-5 warm up sets of major compounds depending on which lift it is and what program Im following. For \"smaller\" compounds (like rows/pulldowns) I generally just do 1 set. I dont do any for isolations as by the time I get to them those muscles are already sufficiently warmed up\n\nin your example I would not do an additional warm up for OHP and incline DB press, I would go straight into those working sets",
            "Comes down to personal preference and listening to your body.\n\nI do an upper/lower split, so I follow Bench with OHP (and vice versa the second upper day) and Squat with Deadlift (and vice versa the second lower day). I feel that my main compound lift leaves me adequately warmed up for my secondary compound lift, so I only do warmups for the primary.\n\nI don't usually do light sets of the lift itself for my warmups. I aim more for stretches or priming the stabilizing muscles. (I do 5/3/1 so my first sets are lower weight compared to my max anyways)\n\nBench/OHP:\n\n* Mini-band low pull-aparts\n* Mini-band [front/upward] press\n* Maaaaaaaaaybe some light dumbbell [bench/overhead] press\n\nSquat:\n\n* Catcher rockback w/ toe turn\n* Unweighted cossack squats\n* Maaaaaaaaybe some barbell squats at low weight\n\nDeadlift:\n\n* Kettlebell/Dumbbell swings\n* (Dumbbell) Good Mornings\n* I pretty much never do warmup-weight Deadlifts. I'll do heavier Good Mornings if I feel like I need more warmup.",
            "Preworkout isn't necessary for a good workout.\n\nI wouldn't worry about it.",
            "It’s up to you, all pre workout really is is flavored caffeine. All the other shit in there is just so they can market their brand as different or special.",
            "preworkouts have nothing to do with weight loss, they are simply there if you feel like you need an extra boost of energy. Its 95% just caffeine, so it doesnt even have to be a specific preworkout drink, it could be coffee or an energy drink. Simply have one if you feel like you need an energy boost.",
            "pre-workout is 100% unnecessary to having a good workout.  And other than caffeine, the ingredients are mostly bullshit.  Just eat a banana and have a coffee, if you like.",
            "On a long enough timeline, you'll become reliant on caffeine.  Don't start.",
            "Be careful with caffeine man, I was addicted to it for years. Luckily im off it now and my workouts are great without it. Its not needed to be honest. Just need creatine in my opinion which is non addictive and proven to help muscle growth.",
            "you're 17, so no, you should avoid caffeine.",
            "https://thefitness.wiki/getting-started-with-fitness/\n\n> **It’s OK to Start Small**\n\n> A point you will find harped on repeatedly in this Wiki and by those successful in the fitness world is that consistency over time is king. Each year for New Years Resolution season and the months before summer beach season starts, the fitness community is flooded with those looking to achieve fitness goals who have repeatedly tried and failed to do so in the past. Often, the reason they have tried and failed is that they tried to make too many changes and do too much at once, felt overwhelmed, and either never started at all or were too easily tripped up.\n\n> It is tempting to try to look for the most efficient plan to take on to hit the ground running and make the best possible progress you can as quickly as possible. But it’s also important to be honest with yourself about how much change you can take on at once. Some people can do a complete 180 and zoom ahead with aplomb. You may not be one of them, and that’s totally OK. Alan Thrall has a great three minute video on this subject, in which he emphasizes the importance for those getting started that doing anything for your fitness with consistency (even just going to the gym once a week) to build a habit is better than doing nothing at all because it just doesn’t work for you to commit to something more comprehensive.",
            "https://thefitness.wiki/getting-started-with-fitness/\n\n\nhttps://thefitness.wiki/routines/\n\n\nhttps://thefitness.wiki/faq/",
            "[https://thefitness.wiki/muscle-building-101/](https://thefitness.wiki/muscle-building-101/)",
            "mostly fat. a bit of muscle",
            "If you're going from a normal state to a fasted state, for the first 36-48 hours, you'll burn glycogen.\n\nOnce your glycogen stores get low enough, then your body starts burning fat to replenish said glycogen stores.",
            "if ur lifting and getting an average adequate amt of protein and in a reasonable deficit i would not worry mechanistically about muscle loss and focus on just keeping most of your strength",
            "do more of whatever activity you need those fine motor skills for",
            "Dexterity is usually more about training your brain/nervous system to coordinate movements, rather than training your muscles to contract with greater force.\n\nSo, just practice the thing.\n\n([These pieces of shit](https://bigriverhardware.com/cdn/shop/products/guitar-finger-exerciser-strength-grip-training-tool-finger-exerciser-big-river-hardware-567997.jpg?v=1587228614) have a habit of showing up in guitar spaces, and it does nothing to train your hands unless your goal is \"early onset tendonitis\")",
            "You could learn juggling.",
            "> For finger/hand dexterity\n\nLearn how to play piano.  You get your fingers have dexterity exercise and you get to learn how to play an instrument.  You never know, maybe if you have the talent and be able to develop a discipline, you may someday be able to do this https://www.youtube.com/watch?v=LdH1hSWGFGU",
            "https://thefitness.wiki/weight-loss-101/",
            "I prefer standing. Standing OHP is a super practical movement for lifting stuff over your head outside the gym. You can always add isolation work but the core workout of OHP is incomparable.",
            "Personal preference, but I prefer sitting as I feel more stable. I also use dumbbells over a barbell.",
            "I feel slightly safer standing because I can drop the bar if I need to.",
            "For training a movement with carry-over to real world tasks? Standing.\n\nFor training the muscles of the shoulder? Ya, sitting.",
            "I do standing for the same reason as you: Extra work engaging my core. Maybe it's not quite as good at isolating my shoulders as if I were seated (I'm not *intentionally* using any hip drive, but my legs probably have a *little* give), but I think the tradeoff it worth it for me.",
            "I can’t say whether or not you should continue to go, but is a bit unprofessional if they’re inattentive while you’re there since you’re paying for their full attention. From a business aspect, I do understand them charging you for taking up a spot on the schedule, however I’d feel for you if you truly were sick and elected to not come in. \n\nHave you thought about addressing your concerns with the trainer? You are hiring them and sometimes asking the hard questions can dictate whether or not their intentions with you were truly genuine or if they are just there for the money. A good trainer should be supportive for you on a little bit of a personal level and wanting to see you succeed.",
            "I clearly don't know your trainer. I think there's two things here.\n\n\n1. You are unlikely to get better advice, training, and attention elsewhere, for cheaper. Do some research on your options.\n\n\n\n\n2.  Cancelation fees are standard in any business where you are getting private or mostly private attention. You aren't paying for your time there, you are paying for the ability to reserve attention in her schedule. She would have filled it with someone else if there wasn't a last minute cancellation. I only see this as something to address if you have fevers often. Addressing why you are sick would be a bigger priority than the fee system of one of your actions.",
            "Sounds like you're mostly happy with the instruction and unhappy about the financials. That's a pretty personal dilemma that we can't really answer for you. Depends on pretty much every other aspect of your finances, how much is this $160/session eating into your ability to live your life and/or save for retirement?",
            "nah\n\nedit: ok, i read the question wrong, lol\n\nnew answer: yeah :P",
            "Yah",
            "yes and yes",
            "It’s not one or the other. Regardless of creative or not, you need to be getting you gram per lb of body weight protein. The only reason you shouldn’t take creatine is if you are worried about balding. There’s no conclusive evidence that it does accelerate balding but it’s a legitimate concern that I’ve yet to see conclusively disproven.\n\n\nOtherwise yes take creatine, there are no downsides",
            "4 mile runs on my off days",
            "8 minute break after weights, then cardio.",
            "I run 40 miles a week before I work for conditioning",
            "I prefer stairmaster to running tbh, less high impact and more enjoyable personally",
            ">some days I'll come out sore some days not really.\n\nSoreness isn't all that relevant to gains. As long as you feel the muscle is tired at the end of the set and you're growing (either in weight or reps), it's fine. \n\nWould recommend just following one of the recommended routines as you're still new over at https://thefitness.wiki/routines/ , but regardless the routine you listed looks good.",
            "What are the other three days?",
            "Some of the items on your list seem weird to me. Like why are you doing only 2x10 for  curls? Why both dumbbell rows and barbell? And why face pulls with no weights? What's your progression plan, out of curiosity?",
            "Has your nutrition/recovery changed? \n\nI know you've mentioned it's only been on Bench, but since you mentioned you've hit a new PR every week for the last 4 months on it, you can try deloading and see afterwards.",
            "Weekly PRs is not sustainable forever. You have probably accumulated a lot of fatigue and could stand to back off on intensity for a week or two. You may also benefit from a non-linear program for your bench. Something like 531.",
            "Actual progression is logarithmic, not linear.  Change your program.",
            "My advice is to just start easy and slowly ramp up. \nStart with walks, and if he’s up for it, basic bodyweight exercises (BW squats, push ups, etc.), and then very slowly ramp up. So if he can only handle 10mins of walking today then target 15min next week, 20mins the week after, and so on. \nEventually you’ll want to get to lifting weights - deadlifts and squats cured my back pain - but again you’ll start light and slowly ramp up. Just the bar, then 10lbs per side and so on. \nSame with moving walking to jogging (or some other form of more vigorous cardio). \nYour dad is still young (I say that as a 48 y/old) so there’s no reason he can’t be in great shape in a year or two.",
            "At his age and especially with a pre-existing issue it’s generally recommended to speak to a doctor before starting any new fitness regimen.",
            "Not really, because you aren't doing something for hypertrophy. You are doing a cut, so the leg exercises are just to maintain what you already have as opposed to adding more muscle.",
            ">Ive been skipping legs\n\nThen run an upper/lower.  Try [rhis](https://www.aworkoutroutine.com/the-muscle-building-workout-routine/), or [this](https://www.muscleandstrength.com/workouts/phul-workout).  Advanced guys specialize because they have to.  You don't have weak points, you have a weak body.  Brosplits are nonsensical for beginners.",
            "there is nothing wrong with lifting 6 days a week provided your personal recovery is able to keep up.  i wouldnt call leg day a \"semi rest day\" though lol.  for your upper body sure, for your central nervous system no.  be mindful of the fact that it needs rest too.",
            "I do the same thing but day 3 is Legs Shoulders.\nI don’t focus forearms cause I hit them pretty heavily with RDL, back day, and hammer curls",
            "What does your program say to do when you miss reps?  Are you gaining weight?  When was your last deload?",
            "The [wiki](https://thefitness.wiki/) has some [programs](https://thefitness.wiki/routines/strength-training-muscle-building/) that you could probably make work, but what you said in this post should be good enough for right now. Your main focus should be a calorie deficit and probaby a decently sized one at that. You should also try to add in more daily movement to further help your weightloss.",
            "I believe it's just meaning movements that are a hip hinge but not also a knee hinge. Like a deadlift you bend at the hips and knees but an RDL/SLDL is mainly only movement at the hips.",
            "Really you should ask the programme author.",
            "Just follow a program in the [wiki](https://thefitness.wiki/routines/strength-training-muscle-building/) or on [boostcamp](https://www.boostcamp.app/programs). You have no method of progression listed and I would assume you don't really have one. This would somewhat explain the slow or lack of progress. Ideally you would also be in a small surplus if you wanted to put on size and stregth.",
            "Read fuckarounditis, get on a routine someone else made, and follow it at 85% consistency+ for 4-6 months",
            ">been lifting rather inconsistently\n\nIf this was a routine analysis, you'd get the dismissive, \"it'll work until it doesn't\".  Which is where you are.  You need to run stock routines.  I'm not going into the whys of the three I suggest, as people get paralysis by analysis.  Just put the work in, and *learn* something.\n\n\nThe [basic beginner](https://thefitness.wiki/routines/r-fitness-basic-beginner-routine/) for 2-3 months.  [PHUL](https://www.muscleandstrength.com/workouts/phul-workout) for at least 3 months.  Then use your numbers to start 531bbb.  Minimum 6 cycles.\n\nThat's about a year of training.  You'll be much wiser summer 2025.",
            "The idea is to build muscle during a bulk and then lose fat during a cut. So if you go to the same weight, you'll have less fat in your butt and everywhere else. You'll have more muscles in the areas that you worked out. If you're predominantly working out the butt then after the cycle it should have more muscle and less fat.\n\nHowever given you say you're on the lower end of healthy weight, it's probably gonna be best for you to bulk. You can then slowly cut and then stop whereever you like. You'll probably find that you like your body better at a higher weight if that weight includes a lot of muscles also.",
            ">would my ass get bony again after cutting?\n\nIf you improve lifts that involve the glutes (squat, RDL, BSS, hip thrust, etc) during a bulk, it would signify you grew muscle.  If you *retain this strength* during the ensuing cut, it would mean a better chance of retaining the muscle you grew.",
            "Watches are nice but the numbers they give you are pretty meaningless. I really just rely on it for Steps and smartwatch use like checking texts and answering calls without my phone. The numbers it gives you for calories burned and other stuff are pretty useless.",
            "No device will track that accurately. \n\nThe only thing needed to adjust your calorie intake is a bodyweight scale. \n\nListen to your body and your performance in the gym to \"measure\" recovery and stress. No device will help you with that in any meaningful way.",
            "I love my Garmin Epix, but as everyone is saying, calorie count is pretty much non-reliable for smartwatches and fitness trackers. If you're into tracking heart rate, it's reliable for cardio but you'll need a chest strap HR monitor for accuracy in weightlifting.   What I do like is the sleep tracking, the step tracking, and the fact that the time the workout took syncs to my training log for easier review.",
            "I recently got the Garmin Venu 3 and I love it. For purely strength though the watch won't be that useful. Its great for me tracking sports/hiking/running and I just use it for heart rate during workouts",
            "first off, its much closer to 0.8-1g of protein per lb of *lean* bodyweight.  you dont count your bodyfat in that equation.  if your brother is 30% bodyfat, thats like 135-170g of protein that he needs daily.  to preserve/build muscle mass, yes its a relatively hard and fast rule that you need to provide your body with adequate building blocks.  now that that's out of the way, we can address the whole 1150 calories thing.  that's an absurdly low caloric intake for basically anyone, even moreso for someone who weighs 240lbs.  if you'll allow me to guestimate with the limited information provided, i predict he could literally double that caloric intake and still lose weight for quite a while, probably until he was well under 200lbs.  you will have to do your own research on TDEE and finding your maintenance level, but i can tell you with nearly absolute certainty that his is not 1600kcal.",
            "1100 calories a day for a 240lb person is madness.  I am not going to say it’s impossible but it’s insanely aggressive.  I would strongly question this approach.",
            ">Trying to work out whether I need to see a doctor.\n\nYou definitely don't. It sounds like you are a healthy active person. Nothing you describe sounds concerning at all.",
            "track for two weeks or so.\n\n\n\nthere is hardly such a thing as a 'typical day' and the amounts you eat 'intuitively' can vary by quite a bit.\n\n\napart from that your number doesn't sound too out of the ordinary for a taller guy who is somewhat active.",
            "Why would you need to see a doctor? You sound like you're very active. 3600 is a high tdee but not if you're constantly active and cycling.",
            "What issues are you experiencing?",
            "That doesn't seem that out of the ordinary and it is certainly nothing to be worried about.  To get a good estimate of what you actually eat, you should track calories for more than 1 day - probably a couple weeks - and find the average calories you eat per day over that time.",
            "Sounds pretty typical for an active person. I'm about your size, and my maintenance is around 3500 cals. I was bulking at 4000 cals/day recently and the gain was pretty slow.",
            "The numbers can certainly sound crazy at times, but everybody definitely burns calories at a different rate. \n\nPersonal anecdote is my maintenance is about 4200 calories. And this is with a daily avg step count of 7500. So my outside the gym activity levels are by no means anything special. \n\nSo to actually gain weight, I eat more in the 5200-5500. Which for all intents and purposes is a big surplus, but it takes no time at all before my metabolism ramps up which forces me to have to increase from there. \n\nThe second I add in any meaningful cardio in, then things can get loco. \n\nSo you're alright man. You are just one of the lucky ones really who has a metabolism that keeps him from becoming fat - at this point. So enjoy it and keep staying active like you are. You'll be just fine.",
            "Absolutely, as long as your fatigue management is under control.\n\nThe negative of never needing a deload, is that you're also probably not pushing your body as hard as you could be.",
            "yes it's possible, but not by doing progressive overload",
            "20s — no biggie, listen to your body \n\n30s — getting riskier but very possible if you're smart and managing your fatigue effectively\n\n40s — still doable if you take it easy but super risky if you really push yourself\n\n50s — what are your goals and why are you doing this to yourself? \n\n60s+ - bruh...",
            "https://www.reddit.com/r/Fitness/s/GBdKjfale8",
            "People get really hung up on which splits are good and which are bad but it's not nearly as big a factor in success as people tend to assume, especially compared with the two biggies — effort and consistency. \n\nUnless you're a pro who's really fine tuning every factor for perfect optimization, I think that the most important thing about a split, by far, is whether you like it and feel like you can do it consistently. \n\nFor example, I struggle with leg day. I've had some injuries that still act up, it takes a lot of effort, and I seem to get really bad DOMS in my legs no matter what I do. I found it really hard to not skip leg days and it was messing with my overall momentum. As a result, I've gradually moved towards a split that spreads leg exercises out through the week rather than having a dedicated day just for them and I've never been more consistent. As a result, I'm progressing better than before as well — not because my new split is science magic, but because it helps me stick to good habits. \n\nOther than that, the only thing I'd recommend is thinking about how fatigue progresses over time. For example, I would recommend programming arms for the day after chest and back rather than the day before so that tired arms don't interfere with big chest and back lifts like bench press and bent over row.",
            "A counter question for you; by what means could a split, which is just a way of organizing your exercises, be unsafe?",
            "its fine, the way you split up your training is like on the absolute bottom of the list of importance\n\nthis split isnt inherently more or less safe than any other split",
            "You're not giving legs the attention they deserve.",
            "Why are these the only two options? There are better ways to program this.",
            "> second option gives more time to rest for muscles that are not shared\n\nThere are *a lot* of shared muscles between those lifts.\n\nOverall, [choose a vetted program](https://thefitness.wiki/routines/) and run that.",
            "Other than the fact that you have to unload the bar, move the bar, then reload the bar between each set?\n\nThere's not much of a difference.",
            "Nothing that \"tracks\" calories burned is worth a shit.  Ignore it.\n\nSet your daily caloric goal, try your best to hit it, and any calories you burn from exercise, consider a bonus.",
            "don't rely on smart watches, treadmills, etc, to give you any sort of accurate calorie burn estimate",
            "As the others said, the estimated calories burned from your Apple Watch can be [wildly inaccurate](https://macrofactorapp.com/wearables/). According to my Apple Watch, my maintenance calories is around 2100, but I know from my calorie tracking app it's actually around 2800. I would be ravenously hungry all the time if I followed my watch",
            "i would focus on weekly/monthly avg rate of loss and how you feel, and triangulate what is fast enough for you but makes you not feel like dog shit. im guessing 10lbs/month will be the upper end of what you can handle for more than a month at a time.",
            "Shoulder mobility sure can affect your ability to do shoulder movements. But it's probably worth addressing that rather than writing off the exercise. Maybe you're using too heavy a weight for your current abilities? Rear flys hit some rather small muscles compared to other lifts, so they might require some...ego-challenging (small) weights.\n\nKeep in mind that \"feeling it\" is rarely a reliable metric for how well you're engaging a muscle in a lift. If you're facing downwards, and lifting your arms from pointing down to pointing out/back, you're hitting your rear delts and upper back.",
            "Is that uncomfortable stretch at the bottom of the movement or the top?",
            "Any version of 5/3/1 will work. Humans didn’t change in the last 20 years so what worked for training then will still work. JW has published new books so you’ll have to buy them if you want his updated content. You might be able to find what you’re looking for though by reading his free blog",
            "Plenty of volume at high consistency/intensity. Generally 10-20 sets/muscle group/week is good and you're on the high end of that.",
            "There is no way to go from 13% bodyfat to 6-8% in five days. Even five weeks is fast for that kind of change.\n\nI don't think there is anything you can do that will significantly change your appearance in five days, other than making sure you aren't totally bloated that day by eating in a reasonable deficit in the days beforehand.",
            "That's not going to happen.\n\nhttps://www.youtube.com/watch?v=ER0XQEWyqjo\n\nYou can't lose bodyfat faster than ~22kcal/lb bf/day.",
            "You say you lost 5kg over a YEAR and now want to do that in FIVE DAYS? Roughly 1kg per day??\n\nNot gonna happen. You could lose water weight weight but not much else.",
            ">No pea protein  \n  \nNot whey.  \n  \n>No coconut  \n  \nI have never had whey with coconut.  \n  \n>No lactose   \n  \nlol.  \nDo you know what whey is? You can try whey isolate if you have lactose issues (I do myself, and isolate sits fine with me and I consume a lot of it).   \n  \n>No sucralose (this sh!t is plain bad for people. Had a health issue cuz of it years ago)\n   \nlol.  \nSucralose is in so much food. I really doubt you had issues due to it specifically.  \n  \nAnyway, check these out: https://www.garagegymreviews.com/best-protein-powder-without-artificial-sweeteners",
            "Most lactose sensitive people I know can handle whey isolate fine. If you're especially sensitive, you can try whey hydrolase. \n\nIf you don't want any sucralose, you can look into unflavoured and unsweetened protein. Then simply flavour/sweeten it yourself.",
            "Unflavored casein.",
            "doesn't whey have lactose?",
            "I know My Protein has stevia whey powder.",
            "Ascent & Legion, maybe Levels but it isn't isolate. Even isolate has small amounts of lactose to my knowledge but sounds like you aren't able to have vegan protein either because of the pea protein. \n\nI use Ascent because I've had trouble with some powders and sucralose as well, it's an isolate blend - very good and clean. If you have Costco membership you can pick up 4.25 lbs for around $60.",
            "I'm sorry to ask: how do I do that?",
            "I’ve been having a lot of non-fat Greek yogurt, tuna, and chicken breast. That usually only gets me to the 100-120 range. There’s definitely a lot of fat and carbs I could stand to cut down, I just don’t wanna have too restrictive of a diet right off the bat and end up binging like I have in the past",
            "It takes about 20 minutes with a spreadsheet",
            "God I wish I liked eggs. That’s what I keep hearing, but eggs, especially egg whites, really gross me out",
            "I’m 170 rn, wouldn’t consider myself overweight, more skinny-fat, goal weight is around 160. So 128 grams of protein actually sounds pretty doable.",
            "We need your spreadsheet again!\n\nAlso what on earth is “Mexican-style” tuna",
            "Sorry. The cambered bar being used was the one commonly used for Benching/Seal Rows ([like this Titan Fitness one](https://titan.fitness/products/cambered-bench-press-bar)). But you are right, looks like it allows the weights to be a little more forward.",
            "ty\n\nI'm gonna go it a go.",
            "ty...that's what I figured...and as we age, we tend to have damaged our bodies...and that's me.",
            "I can screw anything up...lol.\n\nty for confirming my thought.",
            "Uhhh you don’t feel your back when doing rows or pull-ups???",
            "Rows are so weird because I feel it way more in my biceps during the movement, but then as time passes my arm is fine and then I can feel it in my back lol. Probably just the size difference of the muscles but not sure.",
            "Ah ok, would my grip strength still eventually improve though?",
            "Staying hydrated and maybe moisturizing should help. Eating healthy as well; a vitamin deficiency can affect skin health and elasticity.",
            "thank you!",
            "thank you!",
            "yes i am gaining weight, im 70kg, 164cm, male",
            "I dont doubt that, I didn't expect to lose any fat in such a short time period, main reasons I did it was to get a break from eating so much and to restore food sensitivity, both seem to have worked.\n\nSo why do you think all that water suddenly disappeared? My daily steps have been around the same, water intake aswell.",
            "Great I'm glad to hear that! And the weight gain wont mess with these movements too much? I just figured that If I am already pretty weak at these, gaining weight will not necessarily help, but maybe strength goes up faster than your weight.",
            "Thanks :)",
            "Still can't do hanging leg raises well but will still give them a shot. :)\n\nThank you.",
            "Thanks, I will give them a shot. :)",
            "Not really manifesting as soreness, still the case?",
            "Thanks for the reply. I think that makes sense, like I imagine they feel weird in vans or something, but the Rogue do-wins have two sets of straps to really crank the shoe on the foot tight. Hoping that would make it feel at least a little better. Still, I figure its probably worth a try to (i) try and get more depth and (ii) maybe limit lower back stress (by being more upright).",
            "I only lift for bodybuilding/hypertrophy. Extra depth could only be more beneficial in this case (not saying it’s necessary, but at the very least wouldn’t negatively affect my results).",
            "My current PT is a joke, he said he cant figured out anything wrong other than me complaining it hurts. He also said its part of the process which is why i want to ask here if thats normal to feel that kind of pain.. and not just soreness or tightness.. but thanks for your input",
            "Thank you so much for your reply. I went to PT and he said it’s part of the process. And he basically saying if i injured my wrist, it’s unlikely my elbow is injured too (my wrist was hurting more than my elbow, but now that he gave me grip strengthening exercises, my elbow hurts, even when i only rest it on a table) And he told me to ignore the pain.. so thats why im here, because i never truly build strength or exercise regularly and i didnt know what normal pain im supposed to endured as part of the process. Thanks again",
            "I’m not questioning my progress or novice-level numbers. I’m just surprised a beginner could put up that much with proper depth. I had to work to get to a plate. It could’ve just been I had weaker stabilizers or awkward form. I’m not happy with my squat numbers, but that wasn’t the point of my comment. I’m not particularly happy with my deadlift numbers, but I could see somebody coming off the street and putting up those numbers. For squats, I see people struggling below that far too often unless they’re not going to depth.\n\nEdit: I wrote this before seeing your edit. Some of this might not apply now",
            "I'm no expert or anything in studies, but that guys study seems pretty awful. Only 17 people and the results are all over the place. The conclusions he confidently draws in that interview is a bit of a stretch",
            "Thank you! I think I’d rather bulk slower, too. Even though it would be easy to lose the extra fat I’d gain. I want to fit in my clothes and not mess too much with my digestion. But I also want my butt to be rounder and more lifted hahaa. I’m happy with the look/strength of my upper body and core. Plus I’m at my ideal weight/body fat %. But I do want to gain muscle on my lower body. I’ll check out that video, thanks so much!\n\nOh and just to add, of course I’ll keep training my upper body and core. But I’m going to keep training my lower body a bit more. I’ve been eating at maintenance, doing too much volume, and not lifting heavy enough, I recently learned.",
            "Oh wow, that’s great, thank you!",
            "That makes so much sense, thank you!",
            "Thanks, are you recommending to go straight into working sets because they’re all push movements? If I was doing a full upper body workout would it be different",
            "Doesn’t pre workout have creatine? If so does that have any effect?",
            "alr thanks a lot",
            "and the lack of glycogen stores won't cause any issues i assume?",
            "nah tho what I'm tryna do is go on a like 4 day fast where i don't eat anything so that's why I'm asking if that will cause muscle loss or nah",
            "fair enough thanks",
            "Yea, id understand if it was just that I canceled for no reason/controllable things and or canceled often with short notice. I guess I just feel salty about not getting leeway when I can't control being sick. \n\nDo you have any suggestions on how to bring it up? I get really nervous thinking about it.",
            "Ty!",
            "PPL\nRest\nPPL\n\nI just do three days, Rest, then repeat",
            "Oh god it formatted weird,\n\nI copied and pasted it from my notes app where I've been keeping track and forgot to delete the no weights (which applied to the Barbell curls bc I can barley do them alone). And as for progression i just add like 5 pounds each week and see if i fail when i try to do reps. Why would rows and Barbell be weird tho",
            "I usually have a load day and deload day, and even my deload day is struggling to keep up?\n\n\nI have been burning out mid-workout recently. As I wrote this, I was mid-bench press, broke into my post-workout protein, then after a bit of a recharge I was blasting through my incline bench press like it was nothing? \n\n\nI figure this is Week 19 into a 20 week bulk, something has got to give eventually right? Lol. ",
            "I ideally train to failure, so it's not exactly terrible. Maybe I'll try that out. ",
            "I do a reverse triangle program for most of my exercises (with great success) , but on my progressive lifts, It's just not happening any more. You're probably right. ",
            "thank you sm for the advice. I'll show him this tomorrow  :0)",
            "oh definitely, thats the first thing ill do i think",
            "im not specializing, i just really dont like long workouts, im basically doing push pull legs but i removed shoulders from my push day and added it in a 3rd day in place of a leg day, \n\nwith a 6 day split i will have 4 separate days, with legs just being a separation day between my normal 3 day split.\n\nits definitely more bro splitty then something like upper lower but i wouldnt call it a brosplit.\n\nid rather have my workouts stay at an hour or so, so upper lower is very much not for me. i dont want to hit legs twice a week; id rather hit them hard 1 day a week and since i am coming from doing 0 leg days a week id rather start of with just 1.",
            "yeah thats why i called it a semi rest day, as it does rest my upper body muscles (which i did notice doing a chest tricep day after i hit legs this week) but not my cns\n\nmy question is basically, will i run into recovery problems including problems with my cns recovering doing 6 days a week.",
            "not using a program atm. I am at a very slight deficit to slowly lose weight. I just came back to the gym after taking 3 days off. i normally am consistent. i dont believe strength should be affected much if at all since im currently around 245lbs. Or 110kg for non americans.",
            "That's exactly what I was thinking, thanks for clarification",
            "I know it’s not a perfect device that can perfectly track what’s going on, but it is a nice tool to gain a little more understanding of what is happening. I think it can definitely help you in terms of accountability and motivation.",
            "Ty, we'll definitely reevaluate how fast he should lose the weight then.  3 lbs. per week was a pretty aggressive goal to shoot for.  According to a calculator site I found, his maintenance is 2,483, so 1,983 a day would have him losing 1 lb. a week, 1,483 2 lbs.  Probably more realistic and safe to shoot for 1 lb. per week.",
            "Ty, we're gonna set more incremental, long-term goals.  1-1.5 lbs. per week.",
            "Thanks! And yea, I don't do PRs or less than 5 reps even; I'm early 40's and very injury-adverse in general. I know PRs \\*can\\* be done safely, but everything I've read/heard indicates that lower reps significantly increase chance of injury. As long as I'm still making gains every week I feel good.",
            "Great read, thanks! He makes a lot of good points.",
            "i meant like hitting arms, and then hitting arms passively again on chest and back day is considered safe or I dont really need to worry about that as long as i eat and sleep well?",
            "[deleted]",
            "Only answer.  Went to the gym with a buddy of mine.  We were there for an hour.  I ran 5 miles.  He did a bunch of upper body lifts.  His watch told him he burned 600 calories.  My watch claimed I burned 550.  I somehow doubt that dumb bell lifts with lighter weights (he's just starting out and ramping up) burn more calories than an hour of cardio.  But I am just going to run either way and not worry about it.",
            "So if I've got this right, my bmr at \"lightly active\" is ~3270 kcal. So as long as I'm hitting my protein goal and staying around or under 2200 kcal for a ~1000 kcal deficit i'm fine?",
            "I get about the same ROM as when I do it without weights. Should I try a modification or an alternative exercise? Maybe a wide grip bent over row? Or I guess I can keep doing what I'm doing, but I won't really know if it's effective or not.",
            "At the top!",
            "I've seen that recommendation before yeah,so does that mean 10-20 sets for your chest as a whole or 10-20 sets for upper chest and 10-20 sets for middle chest?",
            "Yep.  Source:  Am lactose intolerant and found it out the hard way.",
            "Try this link: https://docs.google.com/spreadsheets/d/1O0scKzbV22jNs3yYcNYymon4fsY7b7PQbWPjstorM4o/edit?gid=2104087800#gid=2104087800\n\nand then go File -> Make a copy",
            "The math, sure. But living your life is a whole different thing. You have to figure out what you enjoy, what meal preps well, what you tend to be in the mood for at different times, what your options are at different restaurants or when you're at a convenience store, etc. You also just have to learn the protein content of different foods, which at this point I have stored in my head but which beginners have no clue about. Give yourself credit for the skills you've built, they don't come easy.",
            "Five bucks says you're not using enough butter in your scrambled eggs.   Loosely, about 1 tablespoon butter per 2 eggs.  But, you can get away with slightly less.",
            "Haha ye the question prompted me to start making a bigger better v2 of it. But I don't think I'm good enough at sheets to do everything I would like.\n\nInteresting you've never heard of it. We have like 50 different flavours of canned tuna here lol. I was just standing at the store last week calculating the ratio for all of them. Mexican tuna won. It's just like mostly tuna with a little bit of Mexican spiced tomato sauce and a bit of corn chilli and beans.",
            "Nope. I know that I'm *using* my back, but I pretty much never *feel* it there. \n\nI guess on the fully-extended part of the negative I feel the stretch in my back, but I never feel the \"pull\" itself.",
            "Not really. Especially pull-ups. You might not feel it but it's impossible to perform a pull-up without using your back.",
            "Likely yes. If you aren’t using straps until your grip starts to give out, you’re still getting grip work. \n\nIt can also be helpful to do dedicated grip strength training. r/griptraining has a recommended routine you can add to your lifting if you want to.",
            "thank you",
            "What's your body composition like? Like do you already have a lot of muscle? Because 70 kg isn't huge for 164 cm but it isn't so small either. If you have a lot of fat you could try to lose it first before gaining weight and trying to gain muscle. It might help with the stretch marks. But as others have said you might get them eventually anyways, some people just get them easier than others. Gaining slowly helps.",
            "You went on a 3 week cut, then slowly readded calories back in. You're probably still on a slight deficit right now. \n\nThat itself would get rid of the bloat until you start eating at an actual surplus again.",
            "It shouldn't. A lot of pullup and dip strength comes from not only increased muscle mass, but skill accumulation.",
            "If you can't do hanging leg raises, then do hanging knee raises instead.",
            "would be strange but not impossible, maybe you are just having a bad day, I wouldn't worry about it either way and just continue with the program and see how it goes in the next few weeks",
            "Yeah give them a go and see what you think.  \n.75\" is already a pretty decent heel, 1.25\" would be pretty significant.",
            "I’m a physio myself, so take this as you will, but if your physio found nothing wrong then it’s possible that it is just part of the process, given that you’re new to fitness. However, if you’re concerned something more serious is going on that your physio missed, there’s no harm in getting a second opinion from a doctor.",
            "> I’m just surprised a beginner could put up that much with proper depth. \n\nThey’re probably not going to depth. I don’t think I went to depth at all at the point in my life when I first surpassed body weight in the squat.",
            "We looking at the same one?\n\nhttps://pubmed.ncbi.nlm.nih.gov/23679146/\n\nSample size was 39 athletes in non-strength sports.",
            "Okay, thank you for your feedback on it! I haven’t looked at it yet.",
            "yes, Bench Press, OHP, and Incline DB Press all use the same muscles, just to varying degrees of emphasis, so the warm up and working sets of Bench Press would be enough for me to go straight into my working sets of OHP and DB Incline Press. You could maybe add in a single working set of OHP if you wanted, up to you!",
            "that depends entirely on the preworkout, some do, some dont. Creatine supplementation should ideally be separate from preworkout supplementation because in order for creatine to be effective you need to take it every single day, not just when you work out. Companies just throw it in there because, as the other person mentioned, they want to be different so you buy their product. Its also often less than the recommended daily dose of 5g, it might be something like 2g.",
            "Some do, but if you want creatine you should just take it as its own supplement, every day (not just on workout days).\n\nCreatine isn't fast-acting, it's long-acting. So it does pretty much nothing if you take it just before your workout. But if you take it every day, it'll build up in your muscles over time and give you a little boost to your lifting capabilities.",
            "Creatine is not a preworkout ingredient. You can take it whenever throughout the day.",
            "its a bit more nebulous than that.  if you're curious about what happens to your body when you dont consume carbs for it to break down into glucose and convert to glycogen, research the keto diet.  this approach has upsides and downsides, and is totally unnecessary for fat loss.",
            "No. Even if your glycogen stores drop too low, your body will simply start breaking down fats to refill the glycogen stores.\n\nYour energy levels may dip, and you probably won't be able to do any appreciable amounts of exercise with near depleted glycogen stores, but it's a perfectly normal.",
            "if its for religious reasons who cares the muscle will come back. if its for physique purposes id rather smash some protein for insurance purposes",
            "Sorry, that is something I’m not good at. I’m not the most politically correct kind of person and I don’t really do any BS. When I have an issue with something, I typically address it right then and there. It’s always worked well for me personally to be blunt than go home and dwell/have a concern in the back of my mind.",
            "This is like having an upper/lower and repeating the same two days.  Or a full body and repeating *the same day*.\n\nIt's not good programming.  In very short order, you'll run into a progression wall.",
            "Ah, I see. \n\nSorry, what I meant was, why do both dumbbell rows and barbell rows in the same workout?\n\nI'd say you might benefit from following a formal program (i.e., one that plans you through week by week) pretty soon, definitely once you're out of the newbie phase. There are some good ones linked in the Wiki!",
            "That's also not sustainable. An intelligent routine will manage your fatigue so that you can build up to new bests and then recover and build more strength before testing again.",
            "Any reputable beginner programs can work, he’s just gotta be careful about working within his limits. Someone in their 20s doing r/Fitness novice program might start squatting at 95lbs and add 10lbs a week. Maybe your dad starts at 45lbs and adds 5lbs a week or 2.5lbs. The program is the same, you just gotta change the rate of progress and weights to match what he’s capable of.",
            "Your average upper/lower is an hour apiece.  Bros bloat their sessions with too much junk volume.",
            "one way to find out.  personally i lift 6 days a week, and also run 30 miles a week, rock climb 2-3x a week, and work 40 hrs a week on my feet.  recovering just fine i feel great all the time.  an adjustment period is normal when adding in new activity though.  i think generally speaking our bodies are capable of a lot more than we ask of them, but it might take you a few weeks to acclimate.",
            "I'll tell you this right now. The numbers provided by my smartwatch is never accurate in terms of calories burned.\n\nI have a garmin forerunner 255, which is a pretty nice pretty high end fitness tracker. The only thing I use it for is a step counter, a smartwatch, and something to help track my runs. Even the heart rate on that isn't very accurate. My chest strap monitor consistently puts me at 10-15bpm lower than what the watch does during runs.",
            "A smart watch won’t give you an understanding of “what is happening.” The numbers are bogus. Especially for calories burned. It’s like tracking your weight with a scale that calibrates itself by rolling dice every day.",
            "those calculators are not entirely accurate, but they do provide a good starting point.  if your brother consumes 2000 calories a day, he will lose weight.  watching the scale for a month will reveal how fast.  at that point you can add or drop calories based on your results and your goals, and of course how sustainable the nutrition plan is.  after all, no plan will work if he's unable to perform it.  motivation is fleeting especially when you combine hunger with historically disordered eating patterns.  500 cal deficit is very reasonable.  here was my exact nutrition from today, to give you an idea of the amount of food you can consume in a 2000 calorie budget provided you make good choices rather than the pizza:  \n  \nbreakfast -  \n1/3 cup oatmeal made with 1 1/4 cups almond milk  \n2 eggs / 6tbsp egg whites scramble using 1/4tbsp butter, an entire roma tomato diced, 1 cup of baby spinach, and 1/4 cup feta cheese  \n75g blueberries   \n  \nlunch -  \n5 oz salmon fillet  \n100g grilled asparagus  \n100g sweet potatoes  \n  \ndinner -  \n6oz grilled chicken breast  \n3/4 cup quinoa  \n3oz steamed carrots  \n150g steamed broccoli  \n  \nprotein shake -  \n1 1/4 cups almond milk  \n1 banana  \n140g strawberries  \n2 scoops of iso protein powder  \n3 tbsp peanut butter powder  \n  \n1832 kcal, 193g protein, 170g carb, 45g fat.  \n  \nthese are big plates, my maintenance is 2500 and im not feeling starved during cuts by any means.  good luck to you both",
            "I mean, I hit PRs all the time, in that I hit rep PRs. You don't necessarily need to train in the lower ranges. \n\nI find that I grow best with high rep sets for my lower body, which is why I tend to aim for sets of 15-20. I just aim for rep PRs. \n\nMy current workout has me working up to an easy top set of 2-4 reps, around 2-3 reps in reserve, then drop down and do a lot of rep work. I find it's very effective. \n\nBecause rep PRs are still PRs. If you can squat 315 for 20, your legs and back are absolutely going to be strong.",
            "Weird mindset to bring.\n\n> The only program I know I will do without losing motivation is the one I created myself.\n\nIt's worth noting that this is a science with decades, arguably centuries to millenia of research behind it and you're willfully ignoring it in favor of what \"feels good\" to you. Based on the questions you're asking, I'd wager you're overcomplicating things to the degree that your homebrew program will end up *harder* to maintain than a proven, simple-but-effective program.\n\n> perfect is the enemy of good\n\nSure, but I'm advocating for you adopting simple and good rather than complex and bad.\n\n> I'm looking to improve it, not change it.\n\nHow do you intend to improve a routine without changing it?",
            "Yes theoretically, but the only way to find out is try it and see what happens. After 3-4 weeks if you're losing weight too fast, increase your cals. If you're not losing weight fast enough, decrease your cals. Everything else is just an estimate, the real data is what you get from stepping on the scale.",
            "At some point this becomes a question for a medical professional since we're bordering on \"this lift is painful\". I don't want to give any specific advice, and I'd recommend taking any you receive with a grain of salt. General advice: add some regular stretches into your daily routine to work on shoulder mobility.\n\nAgain, *generally* if you are doing the proper movement, you're recruiting the rear delts and upper back muscles that a Rear Fly is supposed to. Sure, one can micro-optimize the movement and argue whether they way *you're* doing it is the most effective way, but it may not be the most impactful thing for you to worry about.\n\nBent Over Rows, even wide grip, aren't gonna hit quite the same muscles as a Rear Fly. Whether they overlap *enough*, depends on your goals.",
            "Do you do regular flies for your chest?",
            "As a whole",
            "thank you, it means the world to me! I wish you an amazing day",
            "Ok, now I'm really curious. How many calories do you eat while cutting? \n\n1 lb of ground beef is already 1,500 calories. Another 450 from 6 eggs, plus 300 from 3 tbsp of butter brings us to 2,250. \n\n2,250 would already be close to maintenance for me so I'm assuming you're bigger or more active than I am. That said, unless every other calorie is the world's best fibre...how do you poop??",
            "Yo that sounds so good, where can I find that? Might have to scope the ethnic foods store, I fucking love canned tuna.",
            "Thanks!",
            "Will do, thanks. :)",
            "Thank you! Needed someone to tell me not to over think it 😅",
            "Yeah that’s why I asked, since 1.25” seems like a lot. But really long femurs suck for squatting too haha.",
            "Nope this one is different, I'll look tmoz. It would've been nice if they linked the studies in the video lol. I just searched his name.",
            "alr tysm",
            "Ah OK, no worries. Thanks though! :) I'll figure it out",
            "Omg I didn't even realize that I was training the same muscle there, thanks for pointing that out. I'll have to look through the wiki though you are the second person to suggest it. Thank you again !",
            "i disagree, the rest times of most of those exercises are very low (1 minute rest), if i count up the time to do the upper body day of one of the things you linked it comes out to about 60 minutes, but thats not include going to the machine you want to use, reracking your weight, changing, putting your bag in the locker etc.. and since the rest times are very low id increase those too, so i'd come out to about 1.5 hours in the gym at the minimum.\n\nAnd I don't really get why you are giving me advice on a upper-lower split anyway when my current split is quite literally the opposite, PPL i would have gotten, but i don't really understand this advice since its basically wiping what i said in my question off the table.\n\nnot trying to be rude or anything but the advice seems a little silly considering my training style.",
            "Ty, good meals.  I've been using a spreadsheet for myself, making meal days and such and it's worked pretty well for me.  I'm 140 myself, going for recomposition.  Now we're working on meals for him as well.  Ty for the TDEE mention, that got me finding a calculator which is helping me make a few slight adjustments to my own nutrition plan.",
            "Got it, appreciate the response. Might get a trainer at some point to review my form and let me know if I need physio.",
            "Yes!",
            "I’m trying to stay under 2,000 while hitting 120g, which seems impossible lmao. Eating nothing but ground beef and eggs also sounds like purgatory to me hahah. What does your diet look like?",
            ">how do you poop??\n\nSpinach and oatmeal.\n\n- oatmeal pre-workout\n- lb ground meat, half bag spinach, chz, salsa\n- 6 eggs\n- beans&rice (on nights *before* I lift)\n\n(I stage the beans&rice once a week, split it into 4 portions.  Gives the next day's workout a zing.)\n\nI never ran the actual total calories.  Just tried it as a experiment, weighed daily in the morning, and watched my ∆ week to week.  I'm down 35 lbs this year.  (205 to 170 lbs.)",
            "Your beef number is surprising.\n\nWhere I am:\n- a pound of 20% fat ground beef is 1150 kcal\n- a pound of 12% fat ground beef is 860 kcal\n- a pound of 5% fat ground beef is 560 kcal\n\nAll varieties are around 20% protein by weight.",
            "[https://imgur.com/a/5I6MTuf](https://imgur.com/a/5I6MTuf) The first image is just random nutritional info and pricing I found online. The second image is what I just started with real products, Greek yoghurt is a good example of why the first image probably isn't ideal. It varies from 12% to 67% depending on the brand and type. But it's also probably not gonna be helpful to you unless you live in the same country",
            "Give it a shot and see what you think!",
            "If you're doing chest flies, and if you take those all the way to full range of motion with a slow eccentric and a big stretch at the bottom, does that hurt? \n\nI'm just confused on how you're having a stretch/flexibility issue at the TOP of the reverse fly.",
            "It varies but my usual flow is:\n\nBreakfast — oatmeal with peanut butter and high protein, high fibre cereals mixed in; usually ~750 kcal altogether with ~35g protein and 50% of daily recommended fibre\n\nMidday — Protein shake with 5g creatine and fibre supplement; ~330 kcal and ~65g protein\n\nDinner — whatever I feel like as long as it's minimum 30g protein and max 750 kcal\n\nBefore bed — Protein shake with fibre supplement (same as midday just no creatine); ~330 kcal and ~65g protein\n\nThat all brings me to about 2,150 kcal total or about a deficit of of 350 from a rough TDEE of 2,500 with ~190 g of protein a day on about 180 lbs of body weight. I'm cutting right now, hence the super high protein. Also, as you can see, my body needs A LOT of fibre to keep things moving with that much protein. I'm probably hitting ~200% of the daily recommended amount. \n\nIf I was bulking or at maintenance, those protein shakes go down to 30-40 g each and dinner gets nice and satisfying at 1,250 - 1,500 kcal.",
            "I'll admit that I just googled calories in a pound of ground beef and believed the first result without vetting it. Seems I was wrong!",
            "I do my chest flies on the floor, not on a bench, so my ROM is limited by the floor. Should my RF only go parallel to the frontal plane of my torso and no more? I feel the stretch at the front of my shoulders and across my chest.",
            "Thanks for this. What kind of whey isolate do you use, or does it not really matter as long as it’s an isolate? For your shakes do you just do water + powder?",
            "I think Google is giving a figure for 30% fat ground beef, which I’ve never seen for sale.",
            "No.\n\nIMO Do your chest flies in a bench so you can actually do full ROM, you will have stronger and more flexible shoulders and reverse flies will no longer be a problem.\n\nAlternatively, doorway stretch. But I like option 1 wayyyyyy more.",
            "I work out from home and have been considering adding a bench to my equipment. I don't want to overstretch my shoulders, so will probably have to get an assessment first. This'll give me something to think about, thanks!"
        ]
    },
    "Physique Phriday": {
        "title": "Physique Phriday",
        "score": 13,
        "url": "https://www.reddit.com/r/Fitness/comments/1dkzhpm/physique_phriday/",
        "content": "**Welcome to the Physique Phriday thread**\n\nWhat's the point of having people guess your body fat? Nevermind that it's the most inaccurate method available, (read: most likely way wrong - [see here](http://web.archive.org/web/20130301185720/https://paindatabase.com/body-fat/)) you're still just putting an arbitrary number to the body you have. Despite people's claim that they are shooting for a number, they're really shooting for look - like a six pack.\n\nSo let's stopping mucking around with trivialities and get to the heart of the matter. This thread shall serve two purposes:\n\n1. **Physique critiques.** Post some pics and ask about muscles or body parts you need to work on. Or specifically ask about a lagging body part and what exercises worked for others.\n2. An outlet for people that want to show off their efforts that would otherwise be removed due to [Rule 4](https://old.reddit.com/r/Fitness/wiki/rules#wiki_rule_.234), and\n\nLet's keep things civil, don't be a creep, and adhere to [Rule 1](http://www.reddit.com/r/Fitness/wiki/rules#wiki_1._hate_speech_and_discriminatory_remarks_are_not_allowed.). This isn't a thread to announce what you find attractive in a mate. Please use the report function for any comments that are out of line.\n\nSo phittit, what's your physique pheel like this phriday?",
        "num_comments": 71,
        "comments": [
            "Showing off progress. Bulked from 101 to now 105 lbs about 17 months ago. Pre-bulking weight was 97 lbs.\n\n5’2, 30s\n\n[https://imgur.com/a/jMw4vwp](https://imgur.com/a/jMw4vwp)",
            "Pump felt crazy yesterday, [had to snap a pic](https://imgur.com/a/keWwFNP). \n\n35m/183/5’9”",
            "Upper body progress and quad progress are slow, but sometimes I can see my abs, which is pretty good [(F/5’5?/??)](https://imgur.com/a/odwgM2c)",
            "22M, 194 cm, 91 kg\n\nBeen on a bit of an extended cut recently, starting to bulk up again a little, but pretty happy with the definition and size I’ve gained over the last year\n\nhttps://imgur.com/a/FvWdUfa",
            "Been feeling good recently, even though bodyfat is higher than I'd like. Any thoughts?\n\n[27m/180cm/~90kg+](https://imgur.com/a/OlX4MCS)",
            "28M, 189cm, 89kg\n\nI've been on a cut for 4 weeks and lost 2kg. Plan to cut for another 4-5 weeks and drop the calorie deficit further.\n\nThoughts?\n\nhttps://imgur.com/a/KA3YdMp",
            "Been cutting/recomp for around 6 months, 5 years lifting experience. Would like to coast at around 12 - 14%  but not sure if I should bulk first?\n\nI'm not a body builder but would like a well rounded physique so any advice on that appreciated as well.\n\nhttps://www.reddit.com/r/BulkOrCut/s/sWZw7aARD0",
            "M, 29, 6’0\n\nBeen working out from home gym consistently for the last 2 years. \n\n I can definitely see progress but nothing too drastic. Been messing with my diet and have mostly gone high protein while keeping an eye on junk food. Tend to stick to a maintenance calorie goal. Not sure whether to bulk or cut down pretty drastically. \n\nAny suggestions appreciated! \n\n[last 2 years progress w/ scale weight, bmi, and est. body fat](https://imgur.com/a/cuMe5cr)",
            "33m/196/6'1\" [Physique ](https://imgur.com/a/3dOlk9r).  Not sure which direction to go",
            "19M/195/6’2” [physique](https://imgur.com/a/IKH6g0b)\n\nshould i start the cut? or bulk more?. i’m coming off a 50 pound bulk. i was underweight before",
            "[deleted]",
            "Pic from when i turned 48 a few days ago. Been trying to loose bf for about 4 months,, goal was around 10-12% but didnt come down that low. Started at +20% so over all happy. Any comments or critique is appriciated. [48](https://imgur.com/a/i72TyQD)",
            "Im gaining a lot of body fat, more than muscle because ive been having trouble with over eating. Im F/5’4/157 pounds. I go to the gym every day 6x a week. I do pull/push workouts. \n\n\nIm lately more concerned with me being overweight in terms of body that, that I am considering stopping the gym for a week and fasting as much as I can.\n\nHow much muscle would I lose? Would it make a huge difference to my strength when I return to it? Controversial question i know…",
            "deezed",
            "Share your secrets",
            "abs look solid. good job",
            "Solid! What do you do for core work?",
            "nice physique brah",
            "You’re a unit. Keep it up",
            "I think you’re looking big as fuck my guy",
            "Nice, looking huge. I agree like a 10 lb cut would probably be good. Looking very powerful though.",
            "Impressive size. Adding size to your side delts would be a place for improvement. For aesthetics, losing weight would be the move.",
            "Traps look really large, seeing that bicep vein, some abs outline, I think you’re on a good path my guy, keep up the good work💪🏻💪🏻 if you want any critique at all I’d say try to beef up the chest/lats some more if you can, that’ll make your waistline look and feel even thinner. But you’re looking 🔥🔥🔥🔥 my guy",
            "you need to lose more weight before you bulk....",
            "Looks like you’ve lost about 2 pounds in 2 years while staying about the same body fat from the a starting point and now. This means you’ve built very little muscle and barely lost any weight. Don’t get me wrong, there’s definitely a little progress but for 2 years, you’d expect more. You should dial in your diet and try and lose another 20-25 pounds before you go into another muscle building phase",
            "First of all I am pretty sure the bf estimation is considerably wrong. From the first to the last picture I would definitely say you went from 26% to around 21-22%. In my experience when you are around this bf percentage, weight can very misleading. You have definitely gained some muscle which makes you heavier and also lost some fat, as you see it’s kind of like both cancel each other out resulting in your weight barely changing. What I would recommend you is to prioritize muscle growth and stay in your maintenance. For that you should definitely go to a gym. Bigger muscles means a higher maintenance, with a higher maintenance, cutting will be way easier.",
            "to be completely honest this is very subpar progress for 2 years. you are gonna need to start going to an actual gym and dialing in a cut for an extended period of time. DEFINITELY cut, at your leanest you are high 20s bodyfat. do not bulk.",
            "outwards",
            "Without much context I'd say go heavy upper but keep it lean,  you have solid shoulder and chest genetics.",
            "Solid physique already, so do you wanna get bigger or leaner?",
            "Personally I'd keep bulking, but start to take it a bit slower. Like 1lb a week max to keep the fat gains to a minimum. It looks like you still have some beginner gains on the table, keep at it. ",
            "What are your goals?",
            "Don't overthink it. You can definitely get more muscular and leaner (or as lean) at the same time from where you are. I would do a slight clean bulk. Train hard. Eat healthy and plenty to fuel the hard training and muscle gains. I don't think you will gain much fat this way but I can for sure say that your muscles will grow pretty well if you do progressive overload and eat a big mighty bowl of healthy foods every now and then.",
            "Why would you stay out of the gym and fast for a week?\n\nIf you'd like to lose fat, track your calories. Calculate how much you need to eat to maintain, then eat a few hundred calories less than that. If you don't lose weight, drop the calories by 100 for a couple of weeks. Lather, rinse, repeat. \n\nDid I mention you should track your calories?\n\nDon't stop going to the gym. You need to keep on strength training so you DON'T lose muscle as you cut. It's not going to be a quick process—you should probably aim to only lose about one percent of your body weight per week to minimize muscle loss. But trying to do it fast and chewing up any muscle will mean you burn fewer calories at rest, so that'll be detrimental to your goals. \n\nSlow and steady. Learn to be hungry and be okay with it. Learn to eat high-volume foods to stay full (air-popped popcorn; most veggies; some fruits). It's not a race to see who can get the thinnest the fastest. :)",
            "Do not stop the gym and do not go crazy fasting. It will only make everything worse if not immediately then on a longer run. Keep training consistently, maybe drop the volume a bit down if you feel you cannot manage a stricter diet with so much training. 6 days a week is probably unnecessary. You can train 2-3 times a week but put more effort into those trainings. The diec will do the thing. \n\nBe disciplined, cut all the crap from your diet, plan your meals, eat healthy lowish calories foods and give it time. Eat less but don't starve yourself. Be honest with yourself about how many calories you are eating and if it's going in the right direction for you. If yes, keep the course. If not, re-evaluate everything again, adjust the plan and keep going. \n\nBe disciplined and dedicated but don't go too hard on yourself. You don't get any bonus points for suffering, only the caloric deficit counts.",
            "Consistency and like five million sets of bench press yesterday.",
            "I don’t do any dedicated core workouts, but I do climb",
            "Thanks bud",
            "Some years ago that would have been an insult, but now I'll gladly take it, thanks 😅",
            "Thanks. Yeah, I've been on a \"quick 10lb cut\" for like 8 months now.",
            "Thanks so much\n\n>Adding size to your side delts\n\nWorking on it. Always been really thick (front to back) in the shoulders, but not wide...\n\n>For aesthetics, losing weight would be the move.\n\nYeah, the plan was to be way leaner for the summer, not just for aesthetics, but also comfort (I hate being hot), but it wasn't meant to be (== I ate a lot of shit).",
            "Thanks mate.\n\nI agree with the critique particularly of chest. I always say God took my chest genetics away and whammed them all into traps.\n\nAfter my cut I'm gonna spam cheat and hopefully see some growth",
            "Fair enough. I'd never done any sports or committed to anything \"fitness\" related even in my younger days. My lifts have grown quite substantially since I started and I feel much stronger, but aesthetically it's not too obvious in pics. I've gone on deficits before for months at a time and have gotten down to \\~165lbs, but felt too weak and hungry at that point. I think jumping back on the deficit train and adding some kind of extra core workouts might be best for my goals.",
            "Thank you. This is something else I considered since I really doubt the step-on scale is too precise in calculating body fat. Do you recommend an actual gym for targeted workouts w/ machines? I've been running mostly compound exercises at home w/ free weights, squat rack, and adjustable dumbbells.",
            "definitely not 21-22. at the leanest hes maybe 28.",
            "Agree and he can probably take advantage of a decent amount of early stage muscle building still. Good time to transition to a gym and program.",
            "thanks for your input!",
            "if you don’t mind me asking, what do you think are some strong points/ weak points of my physique currently?",
            "mainly just to have a bigger chest. get my shoulders more rounded and have a good physique naturally",
            "and to just stay healthy",
            "Yeah I think thats what im going to do. To cut I was tracking calories and protien, I think to bulk I am just going to track protein and try to up it a bit to like 200g a day (I've been doing like 160-180).",
            "Thanks. Really appreciate this and thanks for being kind. I already track my calories intensely and still overeat. My tdee is around 2300 calories based off what i do in my day to day. Tbh i tend to binge eat and im working on stopping completely. Its gotten way better than how it was 2 months ago",
            "Chin ups? Pull ups? Dips?",
            "Story of my life 🙃",
            "Yep, that sounds good. My recommendation would be to try and get down to about 12% bf and start a bulk from there. But you’ve got some ways to go before you get there. It says 16% on your last picture but I believe you’re most definitely over 20% bf. That’s nothing to be mad about tho, just be consistent, track cals and you’re gonna get there",
            "As for me it's about what kind of training sticks to you. If training at home works for you and you don't feel limited by your equipment then do it for sure! However, I would recommend exploring a gym and all the variety of equipment to gain that experience. Home gym is a bit of an advanced move for experienced people I think. It's when you train consistently and you know what works for you so you just want to save time/money on going to the gym. \n\nI go regularly to the gym at the moment because it fits my schedule. In case it doesn't we have a barbell with enough plates and some other basic things at home. Tomorrow might actually do a home training because the day's schedule will be pretty tight.",
            "Overall I think you just need to add more muscle all around. But you have some good chest and arm size.  \n\n\nShoulders could use some specialized attention, I'd suggest some side delt specific movements like lateral raises at least twice a week to make them pop out.  \n\n\nMaybe throw in some weighted ab movements if you want them to pop out as well. You're at a low enough body fat % where you could have visible abs if you add some size onto them. \n\n\nCan't see your legs or back, are you happy with your progress on both? ",
            "You could do that by getting leaner. Smaller midsection will accentuate the rest. Or you can just keep on adding mass. How many calories you eating?",
            "I feel you, friend. I do the same thing when I'm hungry. One cup of popcorn can lead to eating the entire contents of my fridge!\n\nBut keep in mind that being so hungry you lose all willpower is what drives that powerful primal urge to eat, so our strategy should be to make sure the food we eat keeps us full(er). Cutting ain't never going to be fun, but with volume eating and making sure you get tons of protein in, hopefully it won't be too bad. You can do this!",
            "I feel you, friend. I do the same thing when I'm hungry. One cup of popcorn can lead to eating the entire contents of my fridge!\n\nBut keep in mind that being so hungry you lose all willpower is what drives that powerful primal urge to eat, so our strategy should be to make sure the food we eat keeps us full(er). Cutting ain't never going to be fun, but with volume eating and making sure you get tons of protein in, hopefully it won't be too bad. You can do this!",
            "I have a coach who takes care of my programming, but yes, all of the above. I do weighted chins and dips every week and usually have bodyweight pull-ups as part of my conditioning (I did yesterday). I also close grip bench. Not doing too many other accessories atm.",
            "back absolutely. but i need to make my legs a little bigger",
            "currently 3000 for maintenance. it keeps me at the same weight",
            "Cool, thanks"
        ]
    }
}