{
    "[WEEKLY MEGATHREAD] Game Questions, Recommendations, and Everything Else": {
        "title": "[WEEKLY MEGATHREAD] Game Questions, Recommendations, and Everything Else",
        "score": 1,
        "url": "https://www.reddit.com/r/gachagaming/comments/1dk4j36/weekly_megathread_game_questions_recommendations/",
        "content": "This thread is the place to post any questions or random thoughts that you may have for the community. We have an army of veteran summoners who are happy to share their opinions and recommendations. Whether you are new to the genre or a grizzled veteran, you can use this thread to ask for: \n\n* Help choosing which gacha game to start \n* Recommendations on using different emulators \n* Recommendations on finding a new gacha game to play \n* Help remembering the name of an old gacha game  \n* Updates on how games are doing from current players (“How is \\[game\\] these days?”) \n* Any sort of advice relating to gacha games at all \n\nThis is also the place to ask general questions, like  \n\n* What people’s favorite games or types of games are \n* How do people feel about a particular game feature or event \n* How do people feel about the monetization in whatever game \n* What do abbreviations mean \n* Where people get their news / information \n* What are people’s favorite content creators \n* Even topics that are only indirectly related to gacha gaming, like happenings in the subreddit, international politics, celebrity gossip, etc.  \n\nReally, any post that is just asking a question belongs here.  \n\nYou can feel free to talk about or ask about anything at all in this thread, but just don’t be surprised if your off-topic question is downvoted and you get no answers. If you are looking for game-specific help, you may ask for it here, but you are more likely to get better answers by posing those questions in their game-specific subreddits.  \n\nIf you want to contribute, please read the request thoroughly, and then make sure not to recommend something that they already tried. Please reply without bashing games or arguing with other recommenders – this is not a win-lose thing. Helpful replies should include the full names of anything. Keep in mind that new summoners may not know what “GI” or “FGO” or even “F2P” means, and even if they do then it’s helpful to spell things out so that the results are more searchable.  \n\nRule #1 still applies, so make sure to keep it friendly. Religious and political discussions, personal information, and other such comments will be moderated. Make sure to follow The Reddiquette. With that said, feel free to talk about day-to-day life here and make acquaintance with your friendly gacha gamer neighbors.",
        "num_comments": 45,
        "comments": [
            "https://i.redd.it/b77687gk4o7d1.gif",
            "possible to transfer game files via USB without rooting phone ?  \nold phone dying, trying to avoid lengthy downloads to have some games again",
            "What games have some big events going on?",
            "Hi, hi, my usual post about my current gacha games, my last post was 2 weeks  ago\n\n|xx|My Waifu is here|Magical Girl|Monster Girls|Body Suits or Mecha pilot|Generic Setting|\n|:-|:-|:-|:-|:-|:-|\n|Main|**FGO**|||||\n|Side||||||\n|Casual|**BD2**|||**Snowbreak** |**Nikke**|\n|Super Casual or Only Login|||TenkafuMA|Action Taimanin|**BA** / FEH|\n|Seasonal|GBF|Magicami  DX Events Visor|AFK Journey|Daraku Gear|Eminence in Shadow|\n|Dropping or dying|Brave Nine|Atelier / Magia Record Jp|7 sins x-tasys / Legend Clover GL / EverSoul|Artery Gear / Counter Side|AK / PtNW / RotE / AS / Outerplane|\n|Try|||||WuWa|\n|Hype wait list||New Magire2||Anchor Panic /             Haze Reverb / Nornium /   Cross Core /StarSeed / Star Wings|Project Star / Cat Fantasy|\n\nNote: Bold games are my current playing game, 5 month after Magicami T\\_T\n\n* FGO, a new event, in the banner, a 5\\* Dog Girl O.o, me doing paid yolos and pulled that girl XD (and 3 5\\* Event CE)\n* BD2, finished the collab event, I used 300 tickets by blue girl +2/+1 no weapon, and 400 tickets by red girl +5/+5 + weapon, now I am saving 50k gems (25roll10) by new Justia\n* Magire, EoS announced\n* Aka Magire2, was announced, more NA what global =/\n* TenkafuMA, bride + summer event? why not, but I am saving my tickets\n* AFK Journey, 130k gems waiting by a great waifu T\\_T, bad idea in a no waifu focus gacha =(\n* Legeclo, new event, saving 40roll10 waiting by summer\n* EverSoul, reroll, ZZzz\n* SnowBreak, a great event, but I am not pulling, now I have 9roll10 and need save to 1anniversary\n* Action Taimanin, event ZZzz\n* Nikke, finished the bunny event, I am not pulling waiting by summer, ZZZz Edit: Liberation Task: 2 pulls, ok, 1roll10 and pulled a off banner SSR, Ok, I am lucky other 1roll10 and pulled Clay =D (I am missing her partner)\n* Daraku Gear, event, ZZzzz\n* BA, super ZZZz, not event story by 3 weeks, ZZzz\n* FEH, Summer banner!!!, 60 pulls and only 3 off rate unit and the male summer ... (I was looking by waifus T\\_T)\n* Eminence in Shadow, Now event, very rare, but I am saving my tickets (30roll10) by summer\n* RotE, New event ZZZzz\n* OuterPlane, a new waifu now pulled with 5roll10 (tickets not mileage) and summer rerun event =/, ZZzz\n* WuWa, Run at 7fps in my PC, receive free resource by 7 days login, did 4roll10 nothing, skip\n\nIn this bi-week, I was very lucky with FGO,\n\nThe bigger problem is with Reddit, I cant change my table =/",
            "What game should I play?\n\nI like the aesthetics of honkai star rail and genshin impact. As for gameplay/combat, I like turn based combat or action combat that is very fast in movement and attacks(kinda like Nier automata). I want to be able to play on PC. More f2p friendly is better.",
            "Any gachas worth starting as a new player? I enjoy gachas like Epic Seven and Seven Knights, ie turn based gameplay. However, I am open to other styles of games.",
            "My pet theory on kektone is that his head was so big as a baby he gave his mom a lot of pain during child birth, so his mom hated him. Since then, he did not get enough love as a child so he had to attract attention to himself in any way possible, even if it is negative.",
            "What game should I play as a ex-FEH refugee? I always liked grinding and maxxing characters but couldn't stand the insane powercreep. Tried Genshin and hated the low rates, played for like 20-30 hrs and didn't get a single 5*. I also prefer games with auto-battle so I don't have to actively grind. Any recommendations?",
            "What gacha games are good to play when you have little time per day and doesn't need too much grind for gear",
            "Good day, I'm searching for gacha games and hoping if anyone could help recommend me one. Who knows, i might find diamonds among recommendations that you guys offer. I prefer a simple game like turn based. For example, my main games are fgo, uma musume and brown dust 2. I don't like open world games. I once tried genshin and wuwa upon my friend's recommendation but uninstalled it before reaching a week. Do you guys have gacha games that i could try?",
            "Any fun idle side games? With maybe an event going on?",
            "Long time dragon ball fan but never checked out their gacha games. Why are there two? Basically I’m asking is one worth playing / better supported than the other, as I’d like to check one out for fun.",
            "Looking for new gachas to try. My main experience is with FGO but after being burned out from it I'm taking a break and looking for newer ones to try out. I've also started Nikke and really like it so far. Biggest thing I'm looking for are ones with more in depth relationships/interactions between our character and our collected waifu's. At the moment I'm thinking of starting either Blue Archive or Arknights but I'd like recommendations for others as well (Leaning towards Blue Archive more as it seems newer and more popular, though I'll likely get to Arknights eventually as well as I like the character designs). I'm looking for more mobile oriented ones as I'm not that interested in the big open-world 3D ones at the moment. Any kind of in-game community interaction is also a big plus, like PVP and such. I'll also be mostly free to play with maybe a purchase here or there if there's a new character I particularly like.",
            "Looking for a new gacha to try preferably one that doesn't take too much time daily as I already play Arknights, star rail, BA, FGO, Genshin, Wuwa, there was some I heard of and was kind of interested in but don't know anything about or if they are worth playing those being, granblue (I like the fighting game and the characters and music seem cool), Girls Frontline (I don't know if I should play 1 or 2? I heard there was some drama with 2), kancolle (I don't know anything at all I just like the ship girls), uma musume (also don't know anything just like the horse girls). Also open to other suggestions, I usually prefer and play games longer if they have a good story and I get invested in, Arknights and FGO are ones I really enjoy the story for out of what I play. Games I've tried in the past  and wouldn't want to play again, path to nowhere, reverse 1999, alchemy stars (although I did play this one for about half a year).",
            "On Android... really enjoyed the gameplay, art style/story of ML:A, but I'm already running into walls of not having stuff to do as a f2p after 1 day. HSR was nice, but it only had like 10 characters last time I played it. Autobattling mechanics is something I prefer, since I like to keep it running while I'm working. I don't mind spending a bit of money after I've invested a couple weeks into it, but the depth and aesthetic appeal has to be there. Tried Azur Lane but the art style was a big turn off (i like Anime style, but not the off the wall superweeb stuff), as well as the UI. Good story is always a plus, though I found HSR and Arknights a little too verbose and drawn out (having to read 50 page cutscenes between every fight was a little too much for me). Though I'd rather have that than a shitty or no story at all. Thanks.",
            "Hiii so actually I'm searching for a specific type of game.\n\nI don't know if there's any player of Shikigami Wars: A Summoner's Tale that will see this post but for those who doesn't know it, that was a management game where you were upgrading your temple/village, I don't think there was a gacha function but there was quite a few nice characters, but the best feature in that game was the Alliance system and raids we could do. The community vibe in it and such.\n\nSo may sounds dumb but for players who played it: since it has discontinued, have you found a similar game?For those who didn't: do you know one in that fashion?\n\nI also liked the shikigami theme of the game\n\nThank you for the replies!",
            "any games worth trying out right now that's giving away tons of freebies? I'm fine with any gameplay as long as it's not fanservice heavy",
            "Anyone has the OG pic for devs listened? Because I don't think this one (first result on google) is it... If possible, without yinlin, but I won't ask for too much.\n\nhttps://preview.redd.it/02q5rfyitr7d1.png?width=746&format=png&auto=webp&s=d2fc914201ac7be5f5efaba5a975f865ebdac94a",
            "Hey everyone. Long time gacha enjoyer, drop most after a year (except 7ds which I’ve been playing since launch) \n\nI only like new games that eventually have quick dailies (I have two kids). Are there any new games (within the first few patches) out there worth trying? I prefer vertical play but will also try anything!",
            "https://i.redd.it/m93nz7no7o7d1.gif",
            "Brown Dust 2 is having anniversary. If I'm not mistaken it's the only one having anniversary event currently.",
            "BD2 anniversary. Nikke upcoming summer event (will have 2 weeks for new character first then summer event I guess).",
            "Reverse 1999 has its half anniversary with a top meta banner right now",
            "Bd2 anniversary begins today",
            "My paid yolo, FGO is more lucky gacha, a 5\\* late 25 pulls from the last 5\\*\n\nhttps://preview.redd.it/3lyzg6fp7r7d1.jpeg?width=2048&format=pjpg&auto=webp&s=77acaa17953d9db8ed7bf9621bab937dc7f2c5d1",
            "PGR, Aether Gazer, Nikke kind of, Honkai Impact,",
            "Limbus company, Brown dust 2 (1st anni right now)",
            "You could try Arknights. I’ve found it to have a fairly good rate of pulling new characters and powercreep is pretty mild. It’s fairly old though, so you have to be ok having missed a bunch of limited characters. Can’t auto battle a new stage but after beating it once you can. No skips apart from the weekly Annihiliation mode though.",
            "try AetherGazer\n\nit probably has the best banner rates, it has a character banner with 90 guarantee, no pity reset if non featured character appeared and it the weapon banner is 70 guarantee and its always there...no need to wait for reruns since you just select it on the character you want to put it.\n\nIt has 2 AI companions so you can basically AFK.\n\nvery friendly because you can use trial characters in the story\n\ncurrently on Anniversary, you get a free 5star of your choice, it includes Limited Banner characters.",
            "Honkai Star rail, once you are done with the game, dailies only take like 5-10 mins (WITH Auto so you can do something else meanwhile), grinding relics (gear) isn't too important either, I just enjoy building characters from level 1 to 80 and dont care much about relics.\n\nMy second to go is Azurlane, very f2p, no much grind needed if you are casual. (Like 5 mins a day)",
            "Path to Nowhere, but events are quite long",
            "Honkai Star Rail, Limbus Company, Reverse 1999 are the other big turn based gachas right now. \n\nSidenote, Limbus is very f2p friendly but I've heard the tutorial is so terrible that you'd be better off watching a youtube video about how to play, so you might want to consider that before you start.",
            "Epic seven is pretty fun too, awesome animations, not too complicated to get into.",
            "wait for sword of convallaria",
            "Eversoul has 1.5 anni coming soon I think, maybe you should give it a try when it drops. I know I'll be returning",
            "I prefer Dokkan because it is a full PVE experience with much simpler gameplay mechanics than Legends. It is also almost the 9th anniversary (July 7th). As for Legends, I never played it that much, but I think they are currently celebrating their 6th anniversary, so you could also check it out just to see how much stuff they are giving away.",
            "Wuwa been so generous so far. It's not that great of quality in anything except combat but it's still fun and addictive.",
            "try AetherGazer\n\n\nit probably has the best banner rates, it has a character banner with 90 guarantee, no pity reset if non featured character appeared and it the weapon banner is 70 guarantee and its always there...no need to wait for reruns since you just select it on the character you want to put it.\n\n\nvery friendly because you can use trial characters in the story\ncurrently on Anniversary, you get a free 5star of your choice, it includes Limited Banner characters unlike other popular games out there.\n\nor if AFK game is your thing, you can try Tower of God New World, it literally gives you 5 Pulls EVERDAY for NO REASON AT ALL, those wishes are not because they fucked up and were given as compensation like in other popular games out there.",
            "[You can pull it from the original video's thumbnail.](https://i.ytimg.com/vi/vKZcw1WxS84/maxresdefault.jpg) The meme originally featured Yinlin, so you'll have to edit that part yourself.",
            "https://i.redd.it/scmvx13p8o7d1.gif",
            "Thanks for the response. I’m a little scared of investing time in a game almost a decade ago because idk when it’ll get shuttered but I was gonna be f2p anyway.",
            "https://i.redd.it/ji23l517eo7d1.gif",
            "As far as I know, JP Dokkan is still going strong, so I don't think they will shut down anytime soon. For Global Dokkan, the best unit in the game (people say he's the best) will be a part of its 9th anniversary, so you should try and check it out.",
            "https://i.redd.it/vclswqtkgo7d1.gif",
            "https://i.redd.it/nts52bwc0p7d1.gif"
        ]
    },
    "Girls Frontline 2 release summer outfit trailer": {
        "title": "Girls Frontline 2 release summer outfit trailer",
        "score": 206,
        "url": "https://v.redd.it/9zpcnv33w38d1",
        "content": "",
        "num_comments": 72,
        "comments": [
            "that would be a very nice skin to have 😍\n\nhttps://preview.redd.it/8qghwn2vy38d1.png?width=1080&format=pjpg&auto=webp&s=6a051957e93e9533288cfbf111a6b9d2e0cef64d\n\nIF THE DAMN GAME WAS RELEASED ON GLOBAL",
            "wheres the fuck is the global version",
            "I know about the drama wise but how profitable it is in CN?niche mode?",
            "Source : [https://www.bilibili.com/video/BV1Qm421V7vN/?spm\\_id\\_from=333.999.0.0](https://www.bilibili.com/video/BV1Qm421V7vN/?spm_id_from=333.999.0.0)",
            "Suomi legs during her running animation look really weird, almost as if they her upper and lower body were animated separately then stitched together",
            "pls come to global pls come to global pls come to global .",
            "Time to start saving for when global comes!",
            "onegai mica...global version",
            "&#x200B;\n\nhttps://preview.redd.it/yccsurhwy38d1.png?width=728&format=png&auto=webp&s=e943aeac18bd9d4b510abe6d48537f62ec80a878",
            "If only this game had GL version...",
            "Pls come to global already!",
            "REEEEEE!! Shes sitting on top a duck, but she should be sitting on top of me! Guys we are getting NTR!! 😡",
            "Still cant believe how hard this game flopped in CN.",
            "oh it's that time of the year",
            "Ok cool, but where global?",
            "Trying to win back the players they lost to Snowbreak",
            "Sadly that this game is not doing well and who knows when devs will invest in a global version.",
            "It’s been donkey years since I have heard anything about gfl 2 global. Is there any news",
            "so global when?",
            "is there a Global version available of this game?",
            "With NTR story I doubt this game will release in global, if global people like NTR this game for you but not for me.",
            "Game isn’t coming to global. Play Snowpeak.",
            "I love where all the games are going now. Keep like that devs and you will get more money for sure.",
            "Nah, her raising legs clip through her hips, that doesn't look good",
            "The girl looks good and all but... where's Roland?",
            "Mr Raymond is gonna eat well",
            "For your cake day, have some B̷̛̳̼͖̫̭͎̝̮͕̟͎̦̗͚͍̓͊͂͗̈͋͐̃͆͆͗̉̉̏͑̂̆̔́͐̾̅̄̕̚͘͜͝͝Ụ̸̧̧̢̨̨̞̮͓̣͎̞͖̞̥͈̣̣̪̘̼̮̙̳̙̞̣̐̍̆̾̓͑́̅̎̌̈̋̏̏͌̒̃̅̂̾̿̽̊̌̇͌͊͗̓̊̐̓̏͆́̒̇̈́͂̀͛͘̕͘̚͝͠B̸̺̈̾̈́̒̀́̈͋́͂̆̒̐̏͌͂̔̈́͒̂̎̉̈̒͒̃̿͒͒̄̍̕̚̕͘̕͝͠B̴̡̧̜̠̱̖̠͓̻̥̟̲̙͗̐͋͌̈̾̏̎̀͒͗̈́̈͜͠L̶͊E̸̢̳̯̝̤̳͈͇̠̮̲̲̟̝̣̲̱̫̘̪̳̣̭̥̫͉͐̅̈́̉̋͐̓͗̿͆̉̉̇̀̈́͌̓̓̒̏̀̚̚͘͝͠͝͝͠ ̶̢̧̛̥͖͉̹̞̗̖͇̼̙̒̍̏̀̈̆̍͑̊̐͋̈́̃͒̈́̎̌̄̍͌͗̈́̌̍̽̏̓͌̒̈̇̏̏̍̆̄̐͐̈̉̿̽̕͝͠͝͝ W̷̛̬̦̬̰̤̘̬͔̗̯̠̯̺̼̻̪̖̜̫̯̯̘͖̙͐͆͗̊̋̈̈̾͐̿̽̐̂͛̈́͛̍̔̓̈́̽̀̅́͋̈̄̈́̆̓̚̚͝͝R̸̢̨̨̩̪̭̪̠͎̗͇͗̀́̉̇̿̓̈́́͒̄̓̒́̋͆̀̾́̒̔̈́̏̏͛̏̇͛̔̀͆̓̇̊̕̕͠͠͝͝A̸̧̨̰̻̩̝͖̟̭͙̟̻̤̬͈̖̰̤̘̔͛̊̾̂͌̐̈̉̊̾́P̶̡̧̮͎̟̟͉̱̮̜͙̳̟̯͈̩̩͈̥͓̥͇̙̣̹̣̀̐͋͂̈̾͐̀̾̈́̌̆̿̽̕ͅ\n\n\n\n>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<>!pop!!<",
            "lol I was going to ask if this released yet",
            "I ate it sorry",
            "With HIT 2",
            "Last month on mobile they only made 500k, as far as I know on PC the revenue is not very different.",
            "1.1m in PC and mobile",
            "Ngl, the duck looks like a 2d png, just photoshopped there.\n\nAlso, duck censor lol",
            "That's not a duck, that's Raymond's summer skin.",
            "Not yet, no news on it either sadly. It did pretty badly in CN allegedly cause of the NTR drama so here's to hoping it even gets to global in the first place",
            "The story was never NTR, just CN people perceiving it as NTR",
            "Seeing the takes I've seen in gachagaming, lot of people here will love the game if there is plenty of NTR.",
            "\\> Game isn’t coming to global\n\nAnd your source is?",
            "I hate this, and my inner autism says you need to pop!",
            "YAYAYAYYYY BUBBLE WRAP",
            "It's okay, we're already used to the fact that the global version is some kind of crap. Just release it as soon as possible.",
            "Hit?? The mmorpg??? It had a sequel???\n\nHow is this the first time I am hearing this\n\nEdit - the rating is not good....",
            "thats pretty good then.granted the CEO is rich asf and personally funded the entire franchise (alleged) so i guess whoever stay with the game will not worry about eos",
            "I doubt it's only because of the ntr drama, I think the gameplay is the main reason or there's nothing worth whaling on.",
            "Didnt they find translations inside the game files in the last patch?",
            "The base en files already exist in the game, it's only a matter of waiting and them tweaking out MTL-like text. Plus they've added english branch applications for global on their CN job account since maybe 2 months ago?",
            "~~the people who paid me to be a doomer~~",
            "It's not much compared to what they could be doing if they hadn't caused all that drama, revenue from Snowbreak would practically all be theirs.",
            "I do agree. I know people in here harp on about the NTR drama but I suspect it's not doing well cause of trash rates and gameplay. I just mentioned it lest someone else try to bring it up again for the umpteenth time",
            "It's much easier here on this reddit to say that everything is NTR's fault and that CN are crazy than to try to understand that the game had many more negative points than positive, a problem that MICA also didn't help with the situation by antagonizing its player base.\n\nIf the game is good, it doesn't matter how much drama there is, whales will spend regardless of what happens, we saw from the huge drop in revenue over the months that this was not the case.",
            "Yeah, but iirc they're pretty preliminary thus far - could even be machine translation. I just meant no official news on global release",
            "That was before they get failed launch in CN.\n\nIf it didn't took off in CN, they might as well just redo the IP. What? You think the global f2pgods can carry the game?",
            "Maybe this is me being too optimistic. But I see the drama as a filter for potential problematic players who have now flocked to SB because of its new coom direction. Therefore, moving forward, I think that GFL2 fandom are less likely to encounter weird-ass drama that stems from the demographic that thinks that talking to each other equates to ntr.",
            "At least it's a life sign.\n\nI'll be patient while they cook up global.",
            "Before? The game launched at the end of December. If you ever actually touched a MICA game you would know they wouldn't redo the IP since it was a passion project to begin with as all the games are connected. They've lived off of 50-100k revenues across their games for 8 years now, they can handle 1 million a month. And when did I say global would carry? If anything it would be the KR server that would handle a bulk of the sales.",
            "They fired the writer who wrote that character story, and are also looking to reimplement the oath system.\n\nIDK, sound to me like they are trying to win those players back.",
            "thank god I might actually play it when it comes to global then",
            "\"talking to each other equates to ntr.\" If you think that the drama was just that, you are innocent, a mistake by MICA could have been CN being crazy, 2 is coincidence, now when it goes beyond 5 there is something wrong and it is not with the CN players, Snowbreak took the opportunity and now is full profit mode.",
            "It's funny that GFL community is very small compared to all those other gacha games. But it feels as if they are all scared of GFL2. Hence all these disinformation and harrasement and bullying.",
            ">IDK, sound to me like they are trying to win those players back.\n\n\nHave you seen GFL1 arts? Have you seen PNC arts? \n\n\nAll I see is Mica is just being consistent.",
            "Yep same, Snowbreak looks cool but I really don't like the design direction. I'm sure lots of people like it, but it's definitely not for me.",
            "I'm fine with SB taking this oportunity to help with coom cleanup from GFL2. Which is why I'm still optimistic and not dooming. ",
            "I feel its moreso grudges rather than fear given how MICA is rooted with the OG gachas while stirring up bad blood with some of the heads of the industry when all of them were young. But MICA's always been a cockroach and survives out of spite.",
            "Right, and they still fired the writer who wrote the character story and are promising to reimplement the oath system.\n\nSounds to me like they are trying to win those players back.",
            "same tried to play SB at the very first but really just couldn't continue the gameplay looks cool and it looks like it's doing well so hopefully some competitors come soon",
            "You talk about coom cleanup but look at the skins that are going to be released, they are not helping themselves lol.",
            "The problem with just 1 million per month will be the lack of content, a 3D game like Girls Frontline 2 is not cheap to produce.",
            "I mean. That's what you *think*. You do you. \n\n\nDon't have to gaslight it as if it is a fact.",
            ">demographic that thinks that talking to each other equates to ntr.\n\n\nThis was what I wrote in my initial reply. Accordingly, when I say coomer. I refer to the schizophrenic ones.\n\n\nYou're saying as GFL players don't appreciate these kind of skins. But GFL players are not schizos.",
            "Only a matter of seeing what happens really. Nobody has a clue about how the money management in MICA works so we'll just have to see what the later patches produce."
        ]
    },
    "Honkai devs patching game to improve feet model on their Valkyrie.": {
        "title": "Honkai devs patching game to improve feet model on their Valkyrie.",
        "score": 1649,
        "url": "https://i.redd.it/vmrumbg7tz7d1.jpeg",
        "content": "",
        "num_comments": 175,
        "comments": [
            "Feet patching to make the details better is absolutely peak gacha gaming.",
            "Did players complain about her feet?\n\nAlso, genuine question: Is it because of Snowbreak that gacha devs are willing to tell players outright that they are making better looking feet in the patch notes? XD",
            "This reminds me of that guy here that said honkai is superior to snowbreak because they won't cater to degen ",
            "I'm all up for good feet and good character design, but i just wish that hoyo makes it easier for artists to draw their characters >!(especially DJ artist)!<",
            "W O U L D",
            "Those feet look very low resolution and bad shaped good that they addressed the issue.",
            "now let people poke the feet like the old days \n\nhttps://preview.redd.it/5xnef6qk208d1.png?width=112&format=png&auto=webp&s=79640b792c18cea1b6ca04b1865668ee4a92b997",
            "As a feet enjoyer, I appreciate the devs for addressing and improving this very important aspect of her design. =w=",
            "Maybe it's time to install honkai...\n\nhttps://preview.redd.it/novuy08jv08d1.jpeg?width=1251&format=pjpg&auto=webp&s=91585097c85b7503ddda4e2fe404fbd46b8bb8a2",
            "Based.",
            "It's Beta patch notes not live server. They usually improve stuff in V2 version. Nothing unusual. \nIt's weird tho that they outright said. Yeah we focused on improving the feet",
            "When can we massage & lick their feets?\n\nAlso, when will they finally add seggs.",
            "Thanks, Hoyo",
            "https://preview.redd.it/775y2kbbf28d1.png?width=200&format=pjpg&auto=webp&s=00e41659df90f94bc01ce8672b2b539b14ba1b02",
            "As a veteran captain it's funny that they are more worried about feet model than the state of the game. Our armada members are dropping like flies. It's been almost a month that we're not hitting the qouta because of their bs back to back S-rank releases that makes our new and veteran members quit. For f sake.",
            "It's ironic I remember that this game started with a lot of fan service and then they were diluted, censoring nonsense 😂 now they want to return because snowbreak opened Pandora's box for 3D games ",
            "Devs Tarantino",
            "The gripper update. This is one of the timelines of all time. Glad to see this is what they do with the hundreds of millions pulled in per month.",
            "Truely a game made by degenerate for us degenerates moment XD",
            "Don't play any Hoyoverse games, but this is my kind of update. 😎👍",
            "They know that gacha players are degens, and want to milk them, smart",
            "quite important ngl",
            "Pack do pé é real.",
            "Pretty much understandable after seeing Elysia, Seele and Griseo’s feet.",
            "Yes, this will improve my gameplay by 10%",
            "Very based now only if the story was good it would be peak. Also not a fan of  Lantern design tho.",
            "There's been a lot of feet going on in the gacha sphere as of late.",
            "Based",
            "This is the perfect place to ask:\n\nWhy?\n\nWhat's so attractive about them?\n\nWhy are people not  going nuts about hands, elbows, kneecaps, shoulders?\n\nI don't get it.",
            "https://www.youtube.com/watch?v=fuuvlE2cqX0",
            "Between this, the introduction of another bare feet character in HSR, and [this cinematic](https://youtu.be/OxOQeTJo6Fo?si=H5wrSbOLsNd9nSMc) in ZZZ, it feels like HoYo has embraced and herald in a new age...",
            "Her feet weren't very detailed. They patched it to make it look better. All Hoyoverse games, the girls have nice feet with detail.",
            "Chinese government says boob and ass fan-service is bad but legs and feet are A-OK. Basically some horny government official is forcing his specific fetish while firing down the rest.",
            "Why, did Snowbreak add a feet detail patch too?",
            "The real DEVS LISTENED moment",
            "No. \n\nIt's about the principle.",
            "Must be a blind guy, since when honkai never cater to degen when thelema, mobius, kafka, etc exist",
            "Putting aside how they're straight up wrong, I don't get this tribalism over flexing how little fanservice your game has and shit. Like yeah I get it I'm not big into most fanservice-y games either I like it when my fanservice is subtle/less frequent but what's the point of crying about it, especially when it is a game's main audience? Hoyo fans post screenshots of nikke and shit on twitter like 'fanservice game ❗️❗️⁉️❓️⁉️' and it makes me wonder why they even care, especially when half of them post shit like barking or whatever under every other official art post. Would probably have a heart attack if they saw half the shit in hi2. Applies to everything honestly but I wonder why we can't just let people enjoy different things.",
            "you are thinking about wrong Honkai\n\nImpact always had a lot of culture , Star Rail and Genshin have safe women design",
            "Bro probably didnt play early Hi3rd before Mihoyo hit the brakes on the fan service. Im still salty they removed bridge interactions",
            "I mean >!DJ artists can just forego clothes!<",
            "It's most likely a follow-up joke to their character intro trailer where two devs were 'jokingly' using stocking and a mannequin's leg to properly design Songque's costume.",
            "when Elder Scrolls 6 releases",
            "Not changing the UI was a huge L for part 2 imo.",
            "Second part, game has a finished story. People simply move on to different games(maybe even from Hoyo - they know what average consumer want. And much better in newer titles, really, I love HI3, but game is old and complicated), that's not as deep and troublesome as people made it seem. And we are on downwards trend since HoHe or HoR(but in times of HoR all information was available, now - not).",
            "back to back S ranks with each one more expensive than an SP valk by 30 pulls and half the price of a full S rank in part 1. People keep on pulling this up as if it’s a problem as if it is any different in P1. These new S rank valks are not as expensive as P1’s so of course they have a reason to release more and bringing in how “cheap” P1 was is such a bs excuse. \n\nIn P1, you’d need HoTr for 2 teams( 300 pulls) and then you would still need to gear the SPs and the DPSes which is not cheaper by much. Physical and ice in P1 wasn’t different either, you still need to get the S rank supports and their gears which btw being free for 1 patch isn’t making the game f2p by much when it’s a one time only. \n\nHere for the breakdown for the amount of pulls needed for each elements, cause all these bs of P1 f2p and P2 not is driving me insane cause all these claims are born out of nostalgia and bias, NOT CLEAR NUMBERS:\n\nElemental teams:\nHoTr: 300\nSP valks: 240( both lightning and fire)\nDPS: 300 or 200( if it’s sirin)\n\nIce:\nSushang: 200\nSP: 120\nDPS: 300 or 0 if you want to use HoTr and argue you’d need her anyway so you cheap out in this department\n\nPhysical:\nHoRb: 300\nsupport: 240( both SI and TA cause i consider them different niches)\nDPS: 300 or 50 or 0 if triple HoRb support team\n\nSpecial mention to CE cause bleed teams want her: 120\n\nNow for P2:\nSena + Lantern + Thelema + Helia: 510\nAstral Op cause why not: 50\n\nThe total amount of crystals you’d need for a functional team in all 3 elements in P2 is up to 560( counting Astral Op). P1 on the other hand would want: 500 for sus and HoTr, 360 for SPs and 300~50, adding up to 1160.\n\nFor physical, with songque coming, P2 would need an additional 150. While P1 physical team would need at least 540 for the cheapest option( 3 supports).\n\nWow this entire reply become lengthy very quickly. Though i do feel like i really need to get this out to put a stop to all these bs spreading around.",
            ">their bs back to back S-rank releases\n\nYeah and pulling a S-rank and their gear is so much cheaper now that you barely have to skip anything as a monthly card buyer. So you better believe it, there won't be a patch without new S-rank ever again. The cost will only go up  when they decide to release an A-rank or AstralOp together with a new S-rank.",
            "Sounds like their own problem not the game",
            "HI3 never had a chance to contest with Snowbreak in the first place. It is both an old game and a game that ended its story arc. A lot of players left it for other titles of Hoyo.\n\nAnd no Hoyo has always done some cultured designs. Even in HSR they still keep doing it as much as they can get away with. Its just CCP pressures them into censoring just like they do with other media. But lets not forget half of the characters had an upskirt panty shop some with big jiggly boobs and other with barefeet and bare midriff and underboobs. Like Pardo and Aponia is right there. You can't get more cultured than that.",
            "They were censor because of the CCP +4 times already they are lucky still around since you know against CCP is shadow realm snowbreak get praise because CCP dont give 2 shit about that game where HI3 does being give a shit before just not now finally",
            "more likely because they are seeing playerbase going down at insane speed",
            "When you have mad players snitching on you to the gov for the dumbest shit of course hoyo is going to play it safe most of the time these days.",
            "I feel like hoyo want to retain their \"cultured\" player base that's pretty much left HSR and Genshin and probably HI3rd by now. \n\nWhich honestly is werid to me cause the only way to retain your \"cultured\" player base is by adding back the fan service. Otherwise \"cultured\" players will just move to the more fanservicey ones. \n\nIdk how much money \"cultured\" players generate to hoyo but I feel hoyo is still in the denial stage. At a certain point, they'll either accept that they're \"normies\" or they'll return the fan service. But 100% of the time, I have never seen any company that returns back to fan service.\n\nAfaik, Azure Lane, Blue Archive, Nikke and some other less censored games might be having former hi3 players or something. \n\nBut hoyo never listens to anyone apparently. Except maybe whatever censor happy counterparts of sweet baby inc is.  You can blame CCP or whatever bullshit but let's be honest, they still release femboys despite CCP complaints. So it's never a CCP issue if you look at it rationally.\n\nAll in all, I feel like hoyo already earned their billions but for some reason, they still try to pretend like they're really one of us \"cultured fanservice lovers.\" When they're not.",
            "7.5 story seems pretty good so far, I haven't finished it yet though. Things are coming together in a more coherent way",
            "When someone see a part of a women's body that is usually well covered or not shown irl they find it arousing. Only in gacha games you'd see girls dressed like these.",
            "If we knew why, one of us can probably write a phd thesis on human sexual attraction lol",
            "Actually, it’s common (or was common, people are pushing back against it now) for school dress codes to ban girls from showing their shoulders to avoid “distracting” boys\n\nMeaning people do indeed go nuts over them",
            "Uh they go nuts over other places too. Armpits thighs midriffs to name a few. If you look at Hoyoverse's designs you will see them put an emphasis on at least one of this three. Sometimes multiple of them.",
            "My guy hasn't experienced the peak that is a good, sexy nape.",
            "They just look nice. I don't think ppl that are into feet are any less into any other bodypart, they probably like them all, or at least I know I do.",
            "How dare people find something I don't like attractive.",
            "Not someone who is into that, but I can guess that this is just natural for them, the same as people like booba of varying sizes on the anime girl. It's not bad or good, just the way they are.",
            "People absolutely go nuts about hands  though, it's even a joke that for women, hands are the most sexual/important part of male bodies. Showing kneecaps and shoulders in official settings and tons of dress codes is still rather frowned upon, just like cleavage and feet, which usually indicates people, indeed, find them hot.",
            "https://preview.redd.it/qhpfv7kiw18d1.jpeg?width=2495&format=pjpg&auto=webp&s=b2710d35036c61c7ef5ee907793e29eac6c67cca\n\nToo late, the feet already peak in GFL2",
            "Honestly the Dev's absolutely killing it with the stocking designs lately with HoRb outfit and the Aponia one, the hue is so nice and looks comfy",
            "Aren’t most of their characters wearing shoes though?\n\nThe only one I can think of who doesn’t is Clara, despite an in-universe fan club wanting to gift her shoes",
            "Hornyverse woke something in me I didn’t know I had and it started with Sparkle…I wonder what it is.",
            "That's one way to get a fetish to be openly accepted XD",
            "And somehow doesn't like pantyshots and plain bikinis",
            "because the government actually doesn't give a shit about feet, sideboobs, cleaveages, navels, or any body part that can naturally be seen without animosity only for outfit styles.",
            "few patches ago.",
            "Certain crowd of people just thinks fanservice = bad, so anything that doesn't have fanservice is automatically good. It's really weird to me, but recent trend of zoomers being completely anti-sex and puritan about fiction is the base of this argument. \n\nAlso couple that with kids these days not being taught to be avoidant on the internet and instead constantly confront anything they hate makes you see this shit more often, epsecially when there's clout to be gained.",
            "UI is lowest problem with part 2",
            "Add the fact that 1 S rank cost 90 summons (technically 85 with the half first 10) and gears 60 , you get around 80 summons per patch so you can 1 hard pity every character or 2 hard pity and full gear 1 character out of 2 with part 2 even if they keep releasing an S rank per patch it's 290 summons for everything in 2 patchs while before with the 1 A rank 1 S rank it was 420 summons in 2 patchs to get everything (sometimes less but 420 was the norm).\n\nYeah when you add math people acting like part 2 gacha is worse are just totally wrong pure nostalgia and bias but they don t care about numbers \"they feel it's worse\" because they want an excuse to hate everything.",
            "lol don't give them easy way out with CCP forcing them. Genshin models barely show any skin anymore when they release girl anymore. It's what their new audience wants.",
            "mihoyo did a good job making its Western player base believe that they are the only ones persecuted in cn, I have to admit.\n\n\nin case you didn't know snowbreak has also been pressured in CN but on his official mumu account in bilibili they said that they don't give a shit about barking and will continue making horny content that their players like",
            "Tell this Westerner who doesn't even know anything, that the statutory laws in China are mandatory for everyone and for everyone because their violation incurs the lack of a fundamental right, the law in China that you are talking about was not approved, it was only It was discussed in the assembly article by article because they must be debated before their approval, but it did not pass because Tencent Game fell in the market when the assembly tried to control the monetization models of video games after the debate had passed without even having been sanctioned by the president. but that generated resilience in investors.\n\n\nThere is no such thing as mihoyo being the victim and the rest not, their internal censorship policy is theirs and theirs alone, they have the complete will to decide whether to accept it or not, or whether they allow themselves to be pressured by non-profit organizations or consultants. external",
            "Still blaming the CCP I see, typical MXZ. 🙄",
            "Ok buddy",
            "What fkn yap did I just read",
            "Nah I think it's more so that they realized firsthand how dangerous it is to pander strictly to people who want a ton of fanservice. (yes I'm talking about the assassination attempt). It was around that time that they slowly started removing small things like the interaction in the lobby, and began somewhat censoring themselves. They obviously want to still have some fanservice cuz they're still otakus themselves, but they won't go all in anymore since they know they have crazies in their communities probably. But we will never know for sure cuz they will never disclose stuff like that.",
            "I don't play it anymore but people tell me that captain verse doesn't even exist 😓 in a game only waifu 😓",
            "over pixels of FEET?? good lord",
            "Well said",
            "Close but no.. something about pretty feet just sets me.. i mean some guys off idk what happens to me TO THEM.. them",
            "Sounds reasonable. Heard something similar about ankles in countries where woman are clothed from head to toe.",
            "Maybe it's about showing skin in general?",
            "Thigh Impact",
            "I think a lot of people ham it up too, because its funny.",
            "That's not what I said. I asked to understand, because it's an alien concept for me, since feet don't trigger anything for me.",
            "https://preview.redd.it/3px8mhu9x28d1.png?width=1600&format=png&auto=webp&s=da76bc70cc3b16ddf71d2c99bd3f45d64c1a364b\n\nBut is it interactive? 😏",
            "https://preview.redd.it/9najrke2x28d1.png?width=1600&format=png&auto=webp&s=a434658b4dfba085c81581bff1cd827e620564ac\n\nHmm...",
            "What the fuck.... Those details man.\n\nYeah, this should be your reason to buy an RTX GPU. Like... You shouldn't ever run this game on anything less than 4k Ultra.",
            "This is why I need this game to come out man",
            "Sorry Gfl is opposite of peak i aint into what the devs were cooking with its story lmao",
            "HORB's OG skin vs her paid one is the biggest example of what Hoyo can pull when they give a fuck about em designs",
            "You can see Sparkles pretty well",
            "Tingyun, Clara, Sparkle, the Judge girl with the brush, and Yunli. You can see all their feet.",
            "Open toe shoes ;)",
            "Hi3rd itself have quite a handful of shoesless too. young Gresio, Mobius, HoBR seele, HoH Elysia(during ult) and now Songque(during Stellar Outburst). I haven't even tell you character with skins that shows their feet, cuz there are a lot, a lot of summer skins.",
            "Q lot of Hi3 characters doesn't wear shoes or takes them off in burst form because a lot of them float.\nJust on top of my head. Herrcher of Ego burst form, Young Griseo, Herrscher of Rebirth , Sirin, Herrscher of Void Magical Girl Outfit outfits for Stigian Nymph and Nyx",
            "Xi Xin Ping has a foot fetish and he wants it to be more widely accepted. Unfortunately to hide his bias he had to go about it indirectly.",
            "Ok but has Snowbreak been going hard on feet or smth? I remember complaints about their feet models being undetailed and low res so did that change? Also yes, I did that on purpose",
            "They censor cleavage all the time in hoyo games.",
            "Shenhe had her belly changed due to regulations.",
            "Nice",
            "HoYo never really said anything directly like \"the government made us\".\n  \nWe just watched an attempted murder and CN players reporting them to the CCP.",
            "They are not the only ones. But all hoyo games are rated for above 12 yo. CCP does not allow that sort of thing unless the game is rated for M. Snowbreak is a game that clearly states they are for M audience. Which means Snowbreak requires ID verification to play in CN. Hoyo would lose good amounts of profits if they decided to go full M.\n\nYou are comparing a hentai game to a game intended for teenagers. Even then Hoyo does great work in sneaking fanservice. As seen with Thelema's shorts Tsavaroe's pantyhose Songque's feet Seele's feet and armpits HoFi Kiana's armpits (which iirc was made into a drama by CN side saying its too lewd)",
            "And you haven't been around HI3 enough i should expect from these \"hoyo fan\" with your arrogant thinking you know all",
            "> the law in China that you are talking about was not approved\n\nnobody even mentioned a law he just said it was censored. this has nothing to do with specific laws it's just corrupt government institutions with broad powers swinging their dicks around when they feel like it. probably some party bureaucrat from the ministry of culture mad mhy didn't pay for enough karaoke bar prostitutes last time he visit",
            "Everything can and will (and should) be blamed on the CCP and with good reason",
            "Le gasp. Corrupt government is being corrupt? Unimaginable",
            "I think the lobby interaction thing was stopped years before the assassination drama, and the drama was caused by the opposite spectrum of the type of person that would want bunny suits and coomer shit. Pretty sure the Chinese players cried about it being out of place, but I might not be remembering correctly since it was aids to read.\n\nBut yeah, the bunny suit drama was just the last nail in the coffin. Mihoyo as a company got off the coomer train the moment they switched from the lobby interaction to whatever other shit they started doing.\n\nhttps://i.redd.it/kam8zcakp08d1.gif",
            "And I think that the censorship meant people have moved on. And the censorship is getting worse. Saying there are crazies in the community when it's shown more than once that there still are even worse ones makes the argument moot.\n\nHoyo already got their billions. They got that braindead pokemon/fgo fanbase already and they should just accept that they're not \"cultured\" anymore. They can call themselves otaku for all that's worth but they'll never really be considered so.\n\nAnd personally you should accept that fact as well instead of coming up with whatever rationale for censorship. Company worship is literally pointless.",
            "Captainverse got split off into it's own thing long ago. It ended recentish with the captain marrying his waifu Luna.\n\nThe Kongming, Fallen Rosemary, etc. fans will probably complain because it was the wrong waifu.",
            "Go bring your whiny NTR captain verse ideals elsewhere, Hi3 is a yuri game since the start",
            "brainwashed by yuri frogs \n\nhttps://i.redd.it/hss0ix1o508d1.gif",
            "Armpit impact\n\nhttps://preview.redd.it/idoe6zexa08d1.jpeg?width=739&format=pjpg&auto=webp&s=98c8c32411c81d47c44fdf8bd5ae1cbacb61147b",
            "GFL Neural Cloud: been there, done that.\n\n[https://www.youtube.com/watch?v=3Cxm3KkQMLM](https://www.youtube.com/watch?v=3Cxm3KkQMLM)",
            "She can move her legs?!",
            "Say you. I'm into that shit.",
            "Hanya erasure T-T",
            "Where can I find this Judge with a brush?",
            ">I remember complaints about their feet models being undetailed and low res\n\nThat's exactly it. Before snowbreak, I don't see games with patch notes where they blatantly tell you they are improving certain body parts, especially feet. Then, Snowbreak came in & there was that period where Seasun casually tells the players that they are making nicer feet.",
            "Snowbreak until recently had a lack of staff on its development team so it is likely that part of its problems are due to that, so now that they get more money it is likely that many things will be improved that they could not before.",
            "show me the source of the news",
            "Friend, there are things that are not allowed, that is true, there are suggestive things that should be censored because they border on nudity, I am not going to discuss that because the canons of suggestive sexuality are something that should be allowed only in +18\n\n\n\nbut things like putting normal panties on girls, showing cleavage, normal swimsuits or showing the navel 😂 are actually allowed.\n\n\nBut what is mihoyo doing today? put a granny diaper on every girl even if she has a huge skirt underneath like ayaka..  \n\n\nThen they go and blame the PPCH when the government doesn't give a shit about that kind of ridiculous complaint\n\n\nThey only act if devs are doing things that are too scandalous that border on soft porn like AL",
            "\n\nI have been playing mihoyo games since even when Kiana showed her blue striped panties and Mei her black thong in the animated pv trailers",
            "It doesn't work that way 😂😂😂 damn where you guys get all those conspiracies about China from, do you think the ppch is specifically hanging on every navel that only mihoto creates in female? connects neurons, it is not difficult to realize.\n\n\n\nThe only thing that puts pressure on CN is non-profit organizations run by parents or external consultants of the company, but that's just \"pressure\", Tencet spends it putting pressure on them but look at them ignoring everything because they don't give a shit the warf 😂😂😂 they only care the 💵",
            "I don't \"worship\" them because they made fanservice games, if I cared about that then I would strictly only play Nekopara. I follow them because they're literally doing what I've dreamed of doing myself. Making billions after years of hard work of game development, to finally fund projects of games I would actually want to make, help my community a bit more, and then start working towards a VR SAO-styled immersive experience. I hope to become the Mexican version of them or Nintendo someday.",
            "lol yuri NTR what nonsense",
            "Heh based the Chrono Navi event the canonical captain is female or at least the voice sounded a lot more female than obviously male.",
            "The explanation for you being this braindead is that even though you are gay oriented down to your very braincells, the distance between a set of them is unfortunately far greater than the total hours you've spent coping about the characters being anything more than friends, so they are relegated to being in a long distance relationship forever.\n\n(low iq just in case you didn't get it)\n\nhttps://i.redd.it/evqykum5o08d1.gif",
            "Nah, \"happy-wheels\" paralyzed below the torso 😂",
            "im just with cn schizos on it",
            "Hanya from HSR, lmao",
            "So they *did* update them too?",
            "GFL2 was first then SB followed",
            "Ok but nothing specific happened regarding feet in it as of \\*now\\*?",
            "Here is an ign article about the attempt [hope that helps?](https://sea.ign.com/genshin-impact-iphone/171332/news/man-arrested-after-making-attempt-on-mihoyo-founders-lives)\n  \nThis is the original report it's linked in the article [here](https://baijiahao.baidu.com/s?id=1697981165268170988&wfr)",
            "They are allowed but the pressure done by CCP depends on what is the target audience of the game you own. They are more strict with games that target teenagers than games that target mature audience. I am not saying they are not allowed. But CCP has their own standards.\n\nThey have started doing that bike short thing after around 5.0 patch i think? Very close to the time Mihoyo attained a representative at CCP. Because they have gotten big with Genshin and could no longer go under radar.\n\nEven if CCP was not around CN player's opinion on fanservice is easily seen with [Kiana armpit disaster](https://youtu.be/BFa_Q7Wow5M?si=B8MgNIa_xsI9YUw3). They like it when its subtle not where its not needed.",
            "Actually Hoyo combats this by making their base outfits lewd enough without visible panties. That's why they put stocking on everyone or shorts",
            "The biggest reality check is the fact that mihoyo games are full of shota like characters/femboys which supposedly the ccp really really dislikes, but somehow these are never pointed at when there is contention about the questionable design choices in their game, it's only the abyss under the skirts and the granny panties that is caused by the communist party.",
            "Yuri enjoyers and self inserts dont mesh well, even though one could assume so",
            "CN event was a captainverse event. That captain is male and is the same person as the captain of captainverse. Only canon existence of captain so far is ai-chan getting help from all captains in the world during Kevin fight. So two different captains.",
            "So when Seele and Bronya, Kallen and Yae fucked each others brains out in the official manga you decided to label it as a long distance relationship/friends/insert denial\n\nSeems like your wife's boyfriend will be able to go a long way before striking any boundaries\n\n(Below average iq and insecurity that cant handle personal development that doesnt cater to you, the self insert, if you didnt get it)\n\nEdit: You edited in a cool gif\n\nhttps://static.wikia.nocookie.net/shipping/images/4/48/Bronseele_AW_Ch10_3.jpg/revision/latest?cb=20230423052759\n\nDont smash your table after seeing Seele do this to your girl :c",
            "Then how is she standing with her knees up?",
            "Oh yeah... Hanya...",
            "They did but that was months ago. It's not an issue now.",
            "That's a fair take. GFL was the one that started emphasizing feet.",
            "I have always wondered why they cite this same article over and over again but there is not a single police report or complaint, this incident happened on April 24 and it is not even in the Shanghai news, the only source of this news is this article of the internet, not even an official shangai news portal.\n\nhas never been confirmed",
            "look what you're saying when that kiana came out do you know who had already shown their armpits in the same pose???? Yelan 😂\n\n\nThe change of position was the developer's internal policy not because someone from the ppch is pointing a gun, the only thing that is true is that mihoyo are afraid of public pressure but that does not mean that they should give in to it, tencent in its subsidiaries for example allows them to do everything only if they do not touch the.soft porn   \n\n\nTencent has an internal policy of I don't give a shit about public opinion, I just want money 😎 which means it receives three or four times as many complaints as mihoyo 😂",
            "they doesn't combat anything, the only thing they do is raise up Tencent after mihoyo looked prominent in 2022.\n\nbut then they lost all the animosity of the player base in CN in a short time 2023 and 2024 due to their poor social management, now Tencent again has 2 games in top 1 and 2 which is sad because not even a hoyo is capable of beating them at their own game, and the people in CN he gave up.",
            "Tangential, but male designs in Hoyo games are rather tame and hardly much controversial. No strong make up, women-typical hair, no male chars straight up dressing like girls (and being mistaken for them), no nipples, no naked hips... unless I missed someone.",
            "Of course not. How can anyone self insert if your girl love someone else, even if that someone is a girl too. That's just cuck fetish",
            "She's sitting on her wheelchair and sensei is washing her feet resting on some sort of a foot rest 😂",
            "But the boycott did happened. They had to fuel in serious demage control because some of the CN community players are some rich fuck kids of a some influential party member so they had to croak. I also hate that people keep bringing this one article as source for alleged Assassination attempt because it's an exaggerated troll spreading fake news on Baidu and western journalist ate it right up.",
            "Different games different characters different audience. CN HI3 playerbase is against \"whoring out our characters\". They were pretty unpleasent with FoV Fu Hua having bare midriff and legs as well. Saying Fu Hua represents Chinese culture etc. But thankfully they weren't unpleasent enough.\n\nYou are confusing things. Censoring old valks that have no audience is a CCP pressure. As the game is rated for 12 yos. If HI3 was rated M we would have kept our swimsuit skins and even touch system. \n\nCensoring new valkyries that shouldn't have fanservice in the first place due to their character (Kiana being innocent and Hua being Chinese figure) is done through playerbase pressure. They can still sneak in fanservice. But sometimes they get caught redhanded. Pardofelis for example was supposed to have a belly button. CCP pressured them to remove it. So now Pardo has a bare midriff but no belly button\n\nTencent's fanservice games are all rated M. As they are almost 10 times as big as Mihoyo they can afford to take risks. But if Mihoyo decided to make Genshin and HI3 M rated when they got a representative at CCP to keep their fanservice which they could already sneak in they would have lost all of their players between 12-18 age range in China. This is huge way bigger than anything fanservice can bring.",
            "There was some CN outrage when they seen Kiana combo attack during beta phase and hot had to change it.\nThere was A LOT of complains saying that it's immature for Kiana to do that pose and that they don't feel she's a strong warrior\nhttps://youtu.be/BFa_Q7Wow5M?si=WlYxQ4OPtn0Y6tJ5",
            "You mean Arena of Valor or some other MOBA shit?",
            "Hmmm, shouldnt someone with paralysis just have no strenght so the legs just fall down like noodles? Even if you position the legs like that, if they have no strenght at all they should just fall I think?",
            "There was no attempted murder, that is just a rumor with no serious basis, there is not a single official article from a news portal that has given a note about that, only articles of dubious origin like the one the boy cited, that article had already been done. seen, but whoever does it does not even give a news source, he simply says: \"trust me bro\"",
            "what is the difference? both are gacha games focused on anime with female characters xD  \n  \nContinue believing that ppch persecutes only mihoyo forever, be happy with your granny pantys lol",
            "I have not said that there have not been complaints.\n\nI said that they the kiana animation due to their own policy, no one put pressure on them in the government like this guy is saying, that is a lie, and every time mihoyo censors the player base comes out to defend him saying this, in CN it is no longer done because it is already known that it is of their own free will that they do it.\n\nThey would have perfectly ignored the complaints like they do 99999% of the time, but they give in to pressure, that's good or bad depending on how you look at it, at this point I don't care if they censor 99% of their games, after all. The competition this year is nice and there are many options to choose from other than hoyogames.",
            "She actually does have some strength. It’s not that she’s paralyzed, it’s just that she’s really physically weak.",
            "Technically...yeah. But I guess limp noodles aren't seggs and Nexon needs to sell horny.",
            "This mf Mujin spread that this. Fuck that guy. He doesn't even check the source he yapps about",
            "One is main character of a story that lasted over 7 years. An innocent teenager girl. Other is a femme fatale side character. Shallow thinking. You dont need to be a rocket scientist to see which character people are more emotionally attached to.\n\nIt is clear you have not played this game and is just talking based on rumors. So i am not really taking your opinion seriously. Besides i am more of a pantyhose person.",
            "They quite literally got people filling official complains to the CCP. They got too big. There are feminists organisations in CN that literally sue them over and over. You can also see tons of bots in their bilbli revievs. The whole Bunny Girl stuff was fueled by people that didn't even played the game they just jumped on hate train because they despise hoyo. And hoyo do listen. They listen to CN only. Kuro shils won't admit it"
        ]
    },
    "Wuthering Waves will release the Crownless figure next January. Only 1000 will be made.": {
        "title": "Wuthering Waves will release the Crownless figure next January. Only 1000 will be made.",
        "score": 216,
        "url": "https://www.reddit.com/gallery/1dlql73",
        "content": "",
        "num_comments": 63,
        "comments": [
            "*saw 3rd image*\n\nHolyshit kalpass level cake",
            "Always thought Crownless was one of the coolest looking echoes, let alone \"characters\" in this game and to see it depicted in figure form did not disappoint at all. Holy shit this mf looks cool as fuck",
            "that looks really good",
            "aside from that, ther will be also Celebration Release set that they announce. (Not to be confused with this Resin Figure which is a separate product they will sell). The other celebration set is consist of plushies, badge, illustration book, and fridge magnet(?) etc.\n\nhttps://preview.redd.it/r5zt5nvkz28d1.png?width=1623&format=png&auto=webp&s=79dcbcba4df7caf4ae2c4914e1a423551a1eddaf",
            "Make it Dreamless and I'd be tempted",
            "That's... very cool.",
            "Man, I really want this figure but gotta save money for Jinshi and Changli 🙏🏻",
            "make's sense, he is hottest character in game.",
            "i would had cared more if they had left the original crownless fight.",
            "Is it CN only ?",
            "only 1k, until someone with a 3D scanner gets their hands on it.",
            "That looks real good\n\nIt looks better than in game one imo",
            "Now they need to make lifesize silicone based changli doll",
            "SMASH",
            "Mahoraga?",
            "I hope the \"something-less\" bosses become a mainstays in WuWa. Both Crownless and Dreamless is a really cool looking boss",
            "If only they gave him more character and voice like they did in [CBT1](https://www.reddit.com/r/WutheringWaves/comments/1dgnuv2/devs_bring_back_cbt1_crownless_cutscene_it_was_a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).",
            "How many gacha games are there that made figures of the game's enemies?\n\n[Preorder (price is 400 USD)](https://nekotwo.com/products/pre-order-wuthering-waves-crownless-statue-grade-figure-kuro-games)",
            "Looks like a lite version of Be'lakor.",
            "so this where the 150 million revenue goes to \n\nhttps://preview.redd.it/zowcyq2eg38d1.png?width=493&format=png&auto=webp&s=dae984352e26a159dccc9210e1f25fc7769b032d",
            "No Chixia.... Sadge",
            "Common WuWa win!",
            "[deleted]",
            "samfly shf and firefly scale by gsc better",
            "They call him crownless because he was exiled for having an ass2phat",
            "this makes me think you were activly looking for cake,",
            "is this level of ass in the game for male characters?",
            "i check the official link they link, all sold out lol",
            "It's sad that we're presented the dog shit version. Yapyap was awesome on the og cutscene, and rover's face was very expressive.",
            "i believe it is also available globally since even the Wuthering Wave facebook eng also made announcement and no mention of CN only.",
            "Nope",
            "Houses will be sold",
            "😈",
            "His cousin actually",
            "$400?! i could s3 changli with that",
            "Well FGO had a Cernunos plushie if that counts",
            "Mihoyo has figures of HSR's Kafka and Blade(if they count) and HI3's Herrscher of the Void",
            "Can't wait for 10 pulls compensation",
            "Holy fucking rentfree",
            "nobody, absolutely nobody\n\nhoyo fanboy:",
            "Guess this is the first figure they sell, and this is a limited production, maybe if they partnered with companies that do mass market figures they could do it for more characters",
            "Umm... do you think the devs should just give a 3D model of the characters and let the players print them with 3D printers?",
            "Can't compare durians with dragonfruits, both are cool in their own ways\n\nNow I wish we could get HG or even Moderoid for Everlasting Lord of Arcane Wisdom, its design definitely screams mecha",
            "They call him crownless because he is not assless",
            "Wait till they censor it like Scar ;(",
            "Theres two website. Nekotwo is not sold out. Just brought it",
            "Not including shipping ✨",
            "Well ... At the very least, you get something to show 10 years later rather than an EOS post",
            "It's around 60k yen - for very limited production (1k) and it's sizes (it is quite big, around the size my 1/4 New Jersey from AL) that price is not that unreasonable. Also depends how much of it is made out of reisin, because they listed few types of material.",
            "Given the limited run and the quality of the figurine from the pictures I say it's a steal.",
            " great, you'll probably forget about her in a year, and the figure will stay with you for decades",
            "HI3 has multiple figures. Including a fairly big one of Herrscher of Thunder.",
            "they're playable though",
            "5 star selector yes please",
            "ssshh not too loud now\n\nyou'lll trigger these rabid hoyo fans",
            "Ngl seems like the budget went all in the wrong places, some were in vain such as the rewriting of the story, should have put it all in merchandise...",
            "Has any \"big budget\" gacha EOS'd yet?",
            "what youre saying is i'd be losing money if i didnt get this statue/figurine?!",
            "HoT isn't really an enemy though",
            "kafka is technically also a boss...and crownless is technically playable as well /j",
            "Weapon selector though, I haven't even used that last free standard selector...",
            "they finished their \"mario but for toddler\" event quickly so they could come cry about wuwa there :p",
            "\"Big budget\" gachas haven't reach 10years yet",
            "FGO JP is going on 9 years"
        ]
    },
    "Hypergryph donated 8M Yuan worth books as well as established a 2M Yuan fund to help cultural spreading": {
        "title": "Hypergryph donated 8M Yuan worth books as well as established a 2M Yuan fund to help cultural spreading",
        "score": 183,
        "url": "https://i.redd.it/mg6k9k1dgy7d1.png",
        "content": "",
        "num_comments": 30,
        "comments": [
            "~~did they write them all~~ that's a nice giving back",
            "Plot twist: those books were written by Kal'tsit",
            "This is one of many donations that they made in the last couple of years",
            "Wait a minute what type of \"cultural\" spreading are we talking about?",
            "This is an incredible gesture by Hypergryph, so generous!",
            "Those 3 books looks heavy.",
            "Hey Kal'tsit can you give me the short version about this history?",
            "# \"cultural spreading\"\n\nBoomer brain's Right-wing mode : \n\nhttps://i.redd.it/3p7ib3thk38d1.gif",
            "Do you know other dev that also donate on the regular?",
            "Didnt know they want whole world to assimilated to china",
            "all of them are Kalsit's yapping",
            "Aka, you during finals week with english class",
            "Jokes aside, it is “traditional culture” or 传统文化.\n\nSpreading is also a little bit misleading. The original wording is 文化传承, meaning “cultural inheritance”.",
            "Communism brother.",
            "Hentai.",
            "We got CCP propaganda gif before GTA6 😭😭😭",
            "There was a post about philanthropy from gacha corps some time ago.\n\nhttps://old.reddit.com/r/gachagaming/comments/1dbm5y1/gacha_games_and_their_communitiescompanies_that/",
            "Hoyoverse",
            "Literally hoyoverse",
            "Mihoyo",
            "Don't believe in the people who said hoyo. Hoyo is an ICBM investor who will only donate to the arms manufacturers",
            "Poor Talulah, she'd join in to yap but she's in prison\n\n>!Wait no she was broken out I think!<",
            "Yeah considering the game's tendency to be overly verbose, the donation is quite fitting xD",
            "You know... I wish the gacha community started it's own library with books that would spread the traditional gacha culture.\nI really think that library would be very profitable.",
            "*Soviet anthem started playing in the background*",
            "Little Red Book if it's written by Kal'tsit be like 100000 Pages.",
            "Hoyoverse donated my friend Prosthetic arms 😃😃😃",
            ">!yeah she was, by the new Reunion led by Nine!<",
            "*I serve the soviet union*",
            "Snowbreak actually plays a similar [theme](https://www.youtube.com/watch?v=ZRKYIBzUA58), in Yehrus region that is based on Siberia."
        ]
    }
}