{
    "Relink Questions Megathread / Community Discord": {
        "title": "Relink Questions Megathread / Community Discord",
        "score": 85,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1aec6xw/relink_questions_megathread_community_discord/",
        "content": "Submit all your questions about the game here!\n\nIf your posts contains spoilers, please mark it in spoilers!\n\n(How to make your spoiler your text)\n\n>!Text here!<\nOutput: Text Here\n\n---\n\n**Unofficial Granblue Fantasy: Relink Fan Discord**\n\nhttps://discord.gg/gbfr",
        "num_comments": 2401,
        "comments": [
            "Could we get a new link for the community server? The current one in the post and the sidebar are expired.",
            "so the story seems short, right? what about the other content? do yall see the potential to grind this game for like at least 50-100hrs, are there things to chase (like very hard fights, lots of stuff to level up/build)?   \n\n\nmight be too early to ask but given that story is short some people might already be in the \"postgame\"",
            "How do I matchmake? Do I go online choose a quest and depart for the matchmaking to start or do I choose a quest and wait in town for party to fill up before I ready?",
            "Not sure why it bothers me so much, but renaming the main char \"Captain\" makes cutscenes way more bearable. ",
            "How do I change my controller visualization in PC? Its showing at Xbox controller and I have a PS4 controller.",
            "I'm really interested in how the level scaling works. I have repeatedly ran into other players in Quick Quest using awakened terminus weapons who absolutely melt any boss encounter below Proud, and they're *clearly* not being scaled down. Don't have the level down arrow beside their profile icon either. Meanwhile I'm running a 150 Stinger weapon and shitty sigils and getting synced? It's bizarre.\n\n&#x200B;\n\nAlso, is it just me or does Percival's Strength/Sup Damage self-buff apply incredibly slowly compared to other characters' self buffs? Doesn't even feel like you can dodge out of the animation in a reasonable time and still get it going.",
            "Can you replay story quests? Missed some omen stones.",
            "Is there like a spreadsheet of what skills can be rolled as a substat in sigils?",
            "On PC using a controller.\n\nI want to use a configuration similar to one from Elden Ring or Dark Souls, but the key mapping shows only keyboard settings. Is there anyway around that? Thanks!",
            "I just want to complain that I hate the transmutation system as it is with a passion.  It's clunky, it's slow, it requires hours of getting vouchers,  transmutting, vouchering the ones you just got got, transmutting, vouchering the ones you just got. Rinse repeat.",
            "How's the difficulty? Bosses shown in trailers seemed rather easy looking.",
            ">!Do we know if Maglielle and Gallanza will be playable down the line? I really hope so...!<",
            "How easy it is to drop in and out in this game? I played through the demo and had a great time and re-did a few of the boss quests with different characters and never got bored, but it sounds like the meat of the game is grinding these quests online to cap out a main? \n\nSo I'm wondering if anyone has any info on how the matchmaking is for randos (or if it's better to join a discord and buddy up there?) and how long the quests generally take, since it can be difficult for me to block off time with family aggro...",
            "Does anyone have suggestions for playing Id? I understand that Y attacks fill the dragon gauge and then in dragon install Y attacks fill Godmight gauge. Does Godmight automatically become active after you exit the dragon install? What are the blue and purple portions of the gauge supposed to mean?",
            "Whats the best stage for farming curios?",
            "Which is better for grinding Knicknack vouchers The Assault Formation Quest or Slimepede?",
            "Anybody farming Proto Baha right now? I've been farming this quest for the past 2 hours and have not gotten a single Terminus weapon. I refuse to believe my luck's down the shit hole /copium",
            "Does this game have a concept of enemy defense power?\r  \nWill the same damage done to the training dummy also be done to Bahamut?",
            "Yodarha’s SBA finisher ends with him saying ‘Oops, butterfingers’\n\nIs there another input at the end or something I’m missing? Seems like a weird thing to say for a successful SBA",
            "Has there been any official word about Steam Deck compatibility?",
            "does story difficulty affect rewards?",
            "Is it possible to remap buttons? Wasn't available in the demo so hoping its in the full version.",
            "I just played the Relink demo. I have no prior experience with Granblue but I was digging it a ton. I'm usually weeb-adjacent when it comes to games - love JRPGs but I don't really like anime. I wasn't a fan of all the cutesy characters in the story mode. I can handle a few, but sometimes multiple bugs me or if there's one prominent through the story it bugs me as well. (Like I'd enjoy Genshin I think if Paimon didn't exist, but stuff like Final Fantasy IX I was cool with)  \nSo would I be put off too much by the story to enjoy it? I'm in love with Katalina already (I love badass women) and I dig the gameplay so I've been considering to just deal with it but I dunno. I'm conflicted here.  \nApologies in advance if it sounds like I'm insulting the franchise or anything like that. I mean no offense, just making my preferences clear.",
            "Can I rebind xbox controller buttons or not yet?",
            "Is there a tool tip error or?  Percivals passive, and the sigil, to make charging not be interruptable, has never worked remotely even once, everything in the world interrupts charging still",
            "How do you break the Tayu'itar head?",
            "Should I focus on the crit weapons or stun weapons for my NPC characters?",
            "which character has the best aoe to farm?",
            "Discord link has expired?",
            "Do weapons provide stats even if they are not equipped?",
            "Is Stout Heart considered a good buff?\n \nI wanted to use particularly on Ferry cuz her style kinda demans me to stay still...",
            "Is there any database where I can see all sigils and stuff?",
            "Regarding new characters: I've just ust beaten the main story and doing the post-game. Is it safe to recruit them now? I want to minimalize grind",
            "How do the levels of the crewmates you summon with the crewmate cards work? I have several characters at level 60 or above, but the recruitable characters are still level 45. I also thought it might be related to the captain's level, but no dice there.\n\nI'm currently working my way through the very hard missions, if that helps to let people know where I am in game.",
            "For ferry which One Is Better between phantasm Harmony + DMG cap and double ferry skills?",
            "Dealing with some analysis paralysis here: how do I build Yodarha for endgame content? ",
            "Is it better for Ferry to mash tap onslaught during link time or to just launcher -> j. heavy as usual?",
            "Should I be popping the combo finisher the second I get the power up as Lancelot? Or just keep on mashing until I have to move?",
            "Is anyone experiencing really loud sounds for certain parts of the game, such as SBA art activation and the final hit of a fight? It’s extremely loud compared to other sound effects in the game and was wondering if there was a solution for this. I’m playing on the Rog Ally handheld on Steam. Thanks!",
            "Is it possible to do Male character only team and still viable ? currently using Gran (as support) Racham Id and Vane  \nI am stuck on Extreme -> Maniac wall that I don't want to grind as it will be replace later and somewhat waste effort",
            "Can I get some suggestions on how to kill Bahamut Versa? My characters are about 15k power, level 100 and I absolutely cannot kill it or get past the first phase where I get insta-killed. Is it my sigils, team setup? I am using Id, Cagliostro, Narmaya & Charlotta",
            "Is there a way for chinese/japanese characters to show up for player names/chat when playing english? Currently i see boxes",
            "If i play this offline on a place with no wifi will my progress will be saved or i need to connect to wifi/internet to save?",
            "Does multiple instance of a damaging debuff stack?\n\nFor example if I have Rosetta and Eugen apply their poisons, will only one work or will they both tick for damage.",
            "Is anyone have mad matchmaking issues rn???",
            "Has there been any news regarding the new characters release date?",
            "Having trouble with the Proto Bahamut fight.\n\nAll offensive sigils I can carry (just potion hoarder for all, and Guts / Dodge for myself), as many Damage Cap+ and actually good damage increasing V sigils as possible on everyone.\n\nEven did the \"check damage for no variance, then add more Damage Cap)\" on everyone, even a few Supplementary and a War Elemental, maxed out masteries, really good overmasteries (~20% crit, norm / skill cap ups, etc), and even with every trick out there (let AI go first and hold yours so SBA chain is delayed as much as possible) and a damn near perfect execution on Zeta (at least in that phase), I can't meet the dps check.\n\nAm barely hitting 2% left even with her Ascension maxed after full SBA chain, Link Time, etc.  Zeta, Id, Rosetta, Rackam.\n\nI'm not even close to meeting the check.  2% is a ton of health left.\n\nFeels like it's mathematically impossible with AI without getting a Terminus first.  Obviously it's doable but no idea what to do.  Feeling really bummed out and have no avenues to improve anything.  Have no desire to play online because I hate screwing up and letting other people down, and I really don't like being getting carried in games.\n\nAny tips I'm missing are welcome.  This is a terrible feeling.",
            "Which of percival's skills is this talking about\n\n\"The Adrenaline Rush support skill now grants a proportional boost to Schlacht's charge speed when charged after attacks that aren't combo finishers.\"\n\nAll of his skills are in german and I translated them, and none of them translate to adrenaline rush",
            "Hey guys - quick question about character sigils that I can't seem to find answers to online. I know that there are plus variants for certain sigils, if I buy a standard one from Siero, am I locked out of the plus variant? Also, does unlocking characters expand the possible sigils that can by pulled (regarding character sigils) - ie, is it better to keep characters not unlocked to get a better chance at pulling sigils for charaters you have unlocked?",
            "Anyone know Cagliostro move phantasmagoria and the % values for this buff?",
            "Anyway to change name ?",
            "As someone that doesn't know anything about Granblue, can someone explain in simple terms why Lilith, an Astral, supposedly has the same mission as a bunch of skyfarers? Isn't Estalucia the home of the Astrals? If this enters major spoilers territory, I apologize, I'm almost at the end of the story and I'm still a little confused as to why she needs to do \"all that\" just to go back to her home, *while* calling it a utopia.",
            "I heard on the Resetera forums from people who blasted through the game the campaign's length was about 11 hours with skipping cutscenes. Does that sound about right?",
            "I just want to know. Can friends pick the same character and...If your team mate does a super, are you stun locked then? Can you still see anything that you're doing while your team mate does that special move cinematic or not? or How does that work? o.O",
            "Link dead update pls",
            "Can this be played coop locally? Planning to play this game on ps5 with my wife. Would love to play the mission quest with her",
            "Why do a lot of zeta on yt stop the loop after 3 hits? Is it just to make sure their skills are used?",
            "I remember seeing a loot table of stuff from Transmarvel and Curios going around. If that's a thing anyone got the link to it?",
            "How does Crit interact with the damage cap? Does it make hitting the cap easier or do crits also raise the cap the same amount?",
            "Can we expect cosmetics, balance and QOL changes for the lucilius patch?",
            "so for damage cap & tyranny v+ which one is better blazing trial or melting pot of hostility?",
            "I’m starting to build up Narmaya. Is there an endgame guide like ones for Zeta?",
            "I'm guessing it'll take a lot of time, but is it possible to get S++ on every quest with CPU?",
            "(Sorry for bad English)\n\nHello there,\n\nI am currently contemplating whether I should buy the game or not.\n\nBack in the day (around 2019 or 2020), I played the browser game.\n\nIt was fun, although I dropped it after being quite busy IRL.\n\nSo yeah, It's been quite a while, and I remember almost nothing about the game.\n\nSome of the questions that I have are:\n\n1. Can I play the game offline, or does it require me to always be online?\n2. Does the game share the same story as the browser? a retell, so to speak? Or is it an extension? Is it the side story of the original? Or a completely original story with some connection here and there with the original?\n3. Will I be fine going in without almost any knowledge whatsoever about the world or story?\n4. How's the gameplay? Something like the FF7 remake? or DMC? or Monster Hunter? or Samurai Warriors?\n5. I think I read somewhere mention something about coop. Is it obligatory? Will I suffer playing solo?\n6. Does the game have microtransactions? Can you get everything the game offers you? or do you need to spend a few bucks for it?",
            "Does anyone know what traits a fully awakened ascension weapon get?\n\nI just unlocked proud difficulty and know/watched about terminus weapons and why they are strong. I'm curious to see what traits ascension weapons get since they're the only other weapon that can be awakened (if my understanding is correct).\n\nThanks\\~!!",
            "Hello. What is yhe ELi5 version of Lancelot damage combo? Please and ty.",
            "Did someone rip the character portrait/dialogue art?\nNeed them hq :3",
            "Can I play this game without having any info of this franchise?",
            "is there like a setting to make my ai teammates ult sooner? they seem to not do it till they can do a full burst.",
            "Do we think future updates will have weapons based on who you have unlocked again? I have all the Terminus weapons for my currently unlocked characters and all that remains are characters I have a mild interest in, but I run plenty of Proto. Would be nice to have an idea if I should leave these characters locked or not.",
            "I just unlocked proud difficulty.\n\nDo the fights ever require players split into different roles? If anyone is familiar with dragalia lost i mean stuff like 1 or more players manipulating the boss's actions and mechanics so the main damage dealers can continue to deal damage without having to run around so much?",
            "Does anyone have a link to the latest dummy DPS tier list? Forgot where I found it.",
            "Even without being ascended all the way Terminus weapons are the best choice right?",
            "How much grinding do you have to do in this game compared to the original granblue gacha game? I like the game, and understand there's lots of characters to play as, but can I just focus on 1 for end game stuff and be fine? Or am I forced to grind out multiple characters?",
            "is Drain or Regen better or is it just personal preference.",
            "Does anyone have any game codes for the browser game that they don't mind giving away? 🙏",
            "When should I use my ingots? I don't want to waste them.",
            "2 of my friend and i just got the game - we understand that there isnt much coop early on and the campaign is single player primarily but what options are there for coop in the first few hours if any?",
            "I give up on getting supplementary damage sigil, I have 10+ flight over fight and it pisses me off. Any suggestions who are the strongest characters in terms of DPS, those who don't rely on supp damage?",
            "Sup sigil and Sup buff   \nIf character have Sup buff (Zeta etc.) do I have to max Sug sigil, since during sub buff skill she will always proc sup damage anyway",
            "I'm stuck at 99% crit and can't figure out how people are getting to 100%?",
            "Buy now or wait for sale?",
            "Is it possible to play this game alone?",
            "What does siegfried do after a link attack? Like zeta has a high jump into hammer, percy has quick charge, ferry summons her pets, etc. Does he get a perfect execution or something? Continue his timing combo?",
            " Can someone tell me sigils Lancelot should be using or point me toward a good resource?\n\nI just finished Extreme difficulty so the game is starting to open up now.",
            "Anyone know where to farm Glass Cannon V?",
            "What are the animas for just unlocked extreme difficulty been quick questing and now I have a bunch do I use them for anything???",
            "Without getting into spoiler territory, what do you unlock after beating the story/ what's in the post-game? Game's really fun but I've been taking the story slow as it feels like I've barely unlocked anything yet I'm already on Chapter 5 of 9.",
            "So i know this game isnt really a live service and has content structure similair to monster hunter. \n\n\nI was wondering if we know how long this game will keep getting content for? Like monster hunter usually gets 1 or 2 years of extra content in small batches and i feel like relink has the potential to release some extra characters",
            "Is it possible to get Improved Guard as bonus skill for Damage Cap V+ sigil?",
            "Is Cascade & Quick cooldown Stack? or you only need one?",
            "[deleted]",
            "Does someone has a link to any resource in which I could see which sigils are on the same multipllier as others?",
            "Anyone know any relink youtubers who actually know anything at all about the mobile game?\n\n\nIt seems like the majority of the popular ones haven't even read the in game lore let alone done any research on some of the things theyre talking about.",
            "Does anyone know the English lyrics to End of Ragnarok? Not sure how to mark it as spoilers on mobile, or if it still counts as spoilers RN. But I would like to have English lyrics if possible.",
            "Looking to get into the game. But I don't have the hardware so I was wondering which would be the best option to get a ps5,steamdeck,gaming laptop/budget pc",
            "Any info on what the new sigils are?",
            "Lucious wasn’t to bad the new sigils break the game",
            "For some reason, can't find any teams to kill the new raid with. Is it just because it is early in the US?",
            "Do we know how cygames handles balance with their games? After this patch came out, it's looking like they're not addressing damage values. Maybe they're just waiting for more data before they start changing numbers?",
            "I wish steam also give us serial code like on ps 5 :/ is there anyone with unused code but not interested in playing the gacha games ?",
            "Any chance someone actually has legitimate \"perfect\" sigils/wrightstones by now? They're not considered perfect anymore with the new stuff, but I'm talking about 10 crit and 7/5 dmg cap wrightstone, as well as 3 supp V+ all with useful secondaries. Reason I ask is my brother's friend has the stuff but \"only\" has about 2k quests played on the ingame profile.",
            "How bad is ferry now? i took sometime off the game sense persona 3 reload came out and i heard ferry got nerfed",
            "Is the matchmaking broken? Before this update i was able to find matches quickly, but now, when I matchmake, i cant seem to find anybody. Yes i have set my download region to tokyo already",
            "Is it possible to swap sigil lists onto other characters?",
            "How do the alpha and beta sigils work? Is it like when you burst you give your teammates 13% sba instead of 10%, or does it give everyone the equivalent of a 30% uplift buff. For beta, is it a one time cooldown reduction of 10% when you burst, or do your skills now permanantly have 10% cooldown reduction",
            "Io main here\n\nwhat's the visual tell for when Lucilius is about to launch sword shockwaves?\n\nand\n\nis there a tell for what direction is safe to dodge in when the laser grid goes up during the puzzle?",
            "Hi, where do you get the Less is More sigil? I have seen it mentioned a few times, but I haven't found any info online. Is it from Curios or something?  \nThanks!",
            "Can someone please verify for me:\nTo my understanding, War Elemental gives a +20% damage bonus as if you had elemental advantage. By that logic, if you're fighting a character you already have elemental advantage to (like Io or Charlotta fighting Proto-Bahamut), then since you already have advantage, you shouldn't need the War Elemental. \n\nHowever, recently I've seen a handful of reports that even in a situation where the character already has advantage, the War Elemental still gives +20%. Is that really the case, or can we dump it from builds where we already have advantage?",
            "How War elemental interacts with non-coloured enemies? Does it work on bosses like Lucilius? it will break through damage cap or you deal same damage?",
            "So my friend got to the last story chapter boss fight and SPOILERS >!Id in phase 2 of the fight isn't spawning. Lyria summons good Baha and then according to youtube vids of the fight, Lizard Boy pops out and we gotta fight him while the Two Bahas fight. But this scene has not happened in my friend's play through so it's just an empty battle field while the bahas fighting until the phase \"timer\" runs out and insta ends the battle. Has anyone else experienced this glitch or know what to do to fix this? We retried the fight several times and get the same result of no Id and no way to finish the fight.!<",
            "Can I check if this is happening to others. For some reason my match making is not connecting me with other random players ever since the patch started. Is this happening to other players as well?",
            "Currently I've done my Terminus farming and I have a few objectives to \"finish\" farming.\n\n1. Getting Supplementary Damage V (Curio Farm, where is the best spot?). I have none at the moment.  \n2. Getting good Damage Cap V+ sigils and leveled it.   \n3. Get the signature sigil with double passives (from transmute)  \n4. Farm Silver Centrums for the new sigil / next terminus weapon / etc\n\nSince I have a limited amount of time to farm, which one should I prioritize? Thanks",
            "is matchmaking broken on ps as well?",
            "Anyone know of a good Lancelot guide? or just search Youtube?",
            "Hello, I heard that the devs were working on a way to rebind controller buttons. Is it out yet? Or has there been any latest news on this topic? Thank you.",
            "For Zeta, what luci Sigil would be ideal?",
            "How exactly is FoF Lancelot used in Luci fight? Do you really just spam his dodge move without doing anything else or still attack him normally and just attempt to dodge an incoming attack? \n\nI played Lancelot for a bit before Luci was introduced but never used that FoF gimmick so I have no idea why is it so broken now.",
            "I've read that it's really easy to hit Yodarha's damage caps. Think it would be worth running Flight over Fight on him?",
            "can someone help me my add-on are not showing in sieros shack im playing in playstation ",
            "for awkaing sigual's should i always aim for damage cap for all the playable charcter's no matter what?",
            "Is there any info on the timing of perfect dodges and perfect guards?  I'm interested in what the frame data is on those.",
            "About NPC skybound art: Is there a way to set them up so they ONLY use them to chain on me using it? I'm trying to kill \"First Boss on Proud difficulty\" to upgrade my First awakened weapon. But FUCKING EUGEN (hate to shit on my boy) just keeps hitting SBA as soon as one other party member has his bar full. IDC if I can make a full burst, don't use the damn thing, i need it for the DPS-checks.  \nThe Only Options i can find are:  \n\"Override Hold SBA for Chain Bursting\" from the description it sounds like this should be turned on, so they chain into me once I use my SBA, but where is the \"hold SBA\" setting to begin with? the only other setting let's me toggle between \"Full Burst only\" and \"Immediately\"",
            "Does anyone know which parts of the soundtrack were used for this trailer of the game (the beginning and ending especially)? I couldn't find it after checking through the OST. https://youtu.be/p10AY1UZeOU",
            "Deluxe edition dlc give any advantages or mostly cosmetic?",
            "widescreen 21:9 support?",
            "Is the game coop region locked? Trying to play with random people but I never find it",
            "Is there a good way to make your leveled characters weaker for lower difficulty content? eg some way to turn on the quick mode scaling for regular quests or what not?\n\nI guess you can always play a lower level character or use an unleveled weapon, but wanted to see if there’s other options.",
            "Is there a lore reason sandalphon stops doing anything meaningful after using his SBA once and casting paradise lost during the lucilius fight? He's obviously using flight over fight with how he never gets hit, but this other angel dude is spamming 3x the SBA paradise losts even though he's stout heart facetanking everything and never manages to hit the lancelots spamming seiya...",
            "Sigil: Is there a character that can use Improved Guard?  Or Improved Dodge on all characters?",
            "Do AI use potion hoarder?",
            "What’s the sigil to equip to do damage ? War elemental and supplementary damage aside. I got terminus weapon for my main but don’t do good damage plz help",
            "What does the \"Battle Camera Correction\" setting do in options? If I disable that option, will the camera stop auto panning to the SBA target in fights?",
            "This game is taunting me... Used to main Ferry while progressing through the game until early late-game. Kinda wanted to pick her up again a while back but the nerf dampened my interest. Now in  proper endgame farming for Terminus weapons, first one I get after like 15+ runs is Ferry...",
            "Does Improved Dodge affect Lancelots Twin Blade Dance (Y) attack i-Frames?  \nI keep seeing some people say no and others say yes.",
            "Started playing with Narmaya and I've seen everyone using Setsuna on guides and whatnot, the skill looks horrible to me, too much commitment it's basically unusable in any situation that isn't a broken window.\n\nI've also realized she feels much more responsive and mobile (for mechanics) with the closegap in it's place, felt like playing a way better character that can keep uptime much more reliably, can someone explain me why am I wrong and setsuna is still the correct still to use there despite those arguments against it?\n\nDo people just tap it for min charge in 90% of the situations? what am I missing here?",
            "Is it save / okay to exchange V sigils into vouchers? Kinda afraid I need them in the future :(",
            "is autosave safe to use now?  \nJust lost 1 hour of progress, sigh.",
            "Does anyone know where to get the different character sprites from the game? like the ones shown when during chain burst etc.",
            "Is this cross play with computer if you’re on PlayStation?",
            "Gosh I feel dumb for asking this. I played the Demo of this game on PS5 and I wnjoyed the combat.\n\nBut can someone explain what type of game this is? Is it an MMO? Is it an action RPG like Diablo? (Obviously without the top down perspective). \n\nI see people talking about raids, endgame and boss fights. \n\nI just dont understand what type of game it is and I am interested in buying.",
            "Any news about skins? Eternal Edge is one I’m looking forward to.",
            "I'm confused, what sigils do people use for endgame? Which defensive and offensive sigils are better? Just wondering since I just reached Lucillius and I matched with 3 players who didn't take any damage the whole fight.\n\nI'm really sure it's just my skill issue but asking here just in case there's some good combinations of sigils for dps units so I don't die from every hit.",
            "If you fight lucilius and your HP gets cut to 1/1 do you still get the max bonus of HP from stamina Sigil at full HP?(it says you need to be at 100%HP.",
            "i only bought standard edition\n\nwill i miss anything not buying the more expensive option?",
            "just got the game, i'm trying to get to endgame asap so i can play with my friends. but is there any \"mandatory\" side quests that i should do, or should i go straight up just main story?",
            "Having a bit a problem about maintaining my blocking while attacking. I'm noticing that it's getting in the way of my combos. Like, as Narmaya, if I hold block while doing my stance switch cancels, I end up doing the first hit of my auto attack string instead of skipping to the finisher, or as Siegfried, I'm unable to store my timed perfect combo with my dodge. Does anyone know any tips on how you can deal with this problem?",
            "How many damage cap sigils should I use? I don’t even have terminus for Lancelot yet have 4 damage cap v+ fully maxed and I still feel like I’m putting less damage out then everyone else I play with any suggestions???",
            "help me understand those defensive sigils on some characters, like perfect guard/perfect dodge, does these works on characters special \"perfect attack timing\" like Vane, charotta, sieg and such?",
            "I'm struggling with the quests with 2 dragons, any tips on how to clear them? I want to progress but not sure how I can clear it. Specifically the one with the wind and ice dragon",
            "good afternoon folks, is there any site to simmulate/optimize builds on this game? i already did a quick search some days ago and its strange to me that i didnt find any site like this. I used to play MHW and i remember that a single guy made a awesome build simmulator where you could put, comparing to Granblue, the sigils you have and the perks you want in your build, then it optimize to you based on your perks. Is there anything tool similar to it on grablue? I thought a big game like this would have a lot of sites like this to optimize builds, but i didnt find any :/",
            "Maybe I'm just choosing bad times to search or my region is lacking or something, but is matchmaking actually fixed? i've been trying to occasionally at different times and now finding anything.",
            "Question if anyone reads this.\n\nI have my default weapon for Charlotta.\nHave my ascended weapon for her too.\nDefault is 150.\nAscended is 150. But the stats on the default are higher? Why is the ascended weaker than the default defender?",
            "Just got my first Gamma sigil, would it be worth upgrading it first, or getting another one + Alpha or Beta?",
            "Kind of an out there question not related to gameplay but what's the theme that plays during the 2x Griffon boss fight? I can't seem to find it on the big YT playlist nor in the music box in game",
            "why is Id considered as a \"bad\" character? i know people say that you can clear any content with any character, and just play what you want, but what are the nuances that makes people say that he's bad/low tier?",
            "What are the least popular characters to play as?",
            "Want to ask quickly about characters - Normally I play more positioning heavy characters, with a beefy skill ceiling. (Scythes/Thrusting SW in the souls series, Bows in MH, where being in a specific bit of medium range is key)\nI tried Zeta but after getting her pretty easy timings down it seems like that's it, excluding her parries?\n\nI was thinking Ferry due to her sweetspot tipper mechanic but the tone seems to imply she's pretty simple to play - optimally? Not sure if those are from ppl who know what they're talking ab though",
            "How does Zeta make the most out of Link Time?\n\nI typically spam Infinite Wonders then spam high jump loops, but I feel like like I’m missing something.",
            "Can someone explain to me why when I do my special attack @ 100% sometimes it fizzles out, and other times it works?",
            "I'm looking at potentially getting the game and, having watched some gameplay from my friends in which he sort of just turned into a dragon man and rolled his face across the controls, I'm curious what the upper limit for skill expression in the combat of the game is. I see it has perfect dodges and perfect guards which is great, but are there technical characters (I'd assume Nanaya is, based on how technical she is in Granblue Vs.) and are there builds that support solo (no party members), high risk, high reward play?\n\nI like the idea of learning to solo bosses, but if it is just going to turn the fights into whittling down a mountain with a feather duster, that's not ideal!",
            "I can't turn in a few side quests because my inventory is full of the item reward. I can't sell the item that is full as far as I can tell... The item I am capped on is Disast Ore, but I have a few other quests with a similar issue.\n\nIs there a way to delete items? Or am I locked out of completing these certain side quests?\n\nHelp please, not being able to turn in these quests is killing me x.x",
            "Why does everyone say that Lancelot is braindead against luci ? Is this only bc of the freeze?",
            "Guys i need a suggestion \n\nI really feel like playing granblue fantasy relink but a lot of updates for that game are coming... not sure if I should wait and play after the updates or I should play rn and play again later in like an year or two\n\nWhat do you all suggest?",
            "I’ve just reached the end of the story and i was wondering how do you know how to build a character, couldn’t find any website about and the game is full of choices! Any advice?",
            "Does anyone have \"On Avia\" notes from curio appraisal unlocked and can send me some screenshots if so, please? As far as googling and discord lurking went I wasn't able to find anything other than people just alluding to their contents, and I don't feel keen on playing the game that long myself.",
            "May be a stupid question but my characters are sitting on about 10k attack as I'm working through Proud mode but guide videos have characters on nearly 30k. I'm using the crit weapon as I have not unlocked the terminus weapons yet but I'm struggling to understand where that massive difference is/will coming from.\n\nEDIT: Lol turns out it literally was just the terminus fully ascended. Vane is now on 29.5k attack even without maxed out sigils",
            "Is there a good way to grind Vitality Wrightstones?  Trying to find a better one that has 10 crit 4-5 cascade and 5-7 some orange offense stat, but lack of places to grind it vs others has me stumped.",
            "How strong do my AI characters need to be for Ultimate Story Mode? Eg. how much PWR? How high should I level their weapons?",
            "Just got to maniac difficulty and start grinding slimepede but only been able to consistently kill around 40 slimes, is this normal?\nRunning Percival, Rosetta, Eugen and Cag.\nAlso, what should I be focusing on masteries/sigils/weapon upgrades ?",
            "i am trying to get the plat for the game but for some reason the network for the multiplayer component is well feeling rather dead, what is the best way to try to get those tickets to buy the crew ticket with the dhalia things",
            "Hi, I'm still trying to beat the fight with the ice and wind dragon, any ideas on how I can do that? My team has the Captain, Zeta, Io and Narmaya. They all have glaciate res and I'm still failing to get one of the dragons down. Do I raise other characters for elemental effectiveness? Or maybe I need to change my build. I spent 5 hours bashing my head against this lol help",
            "Which weapon should I use on charlotta prior to terminus ?",
            "I noticed that around the 8-9k advised power bosses, the actual power I needed got much higher (12-16k). Examples of these are >!the primals, Gallanza, the infern/blizz/quakadile boss, and the 9.5k Angra Mainyu which is the one I am currently at!<. Are these doable at the lower power levels, or am I just bad? Seems like they would have just instant killed me if I tried them at their advised power, and up until that point I could use advised power as a good estimate of whether I could fight a boss. At that point I felt like I had to farm the rest of the offense/defense mastery trees to stand a chance.",
            "Is the online already dead ? I'm a solo player but I need those dahlia badges so I'm trying to join some quick quests...  I've been waiting 1 hour now and still nothing",
            "i always play this game offline\n\nso the save files on my laptop right?\n\nso i have to fo onlne on steam to save it on Steam Cloud /Save my Data online in case something happens to my laptop?",
            "I just purchased Tweyen using cash. She isn't in \"Claim Add On\", and nor is the gold colour set I also purchased.\n\nHow do I claim my items?\n\nPs I haven't beaten Lucilius (is that a requirement?)",
            "How do you get the Gateway Star Sword and the second weapons for the new chars?\n\nedit: nvm you just forge them",
            "What does Tweyen's link attack do? Is it just one instance of damage or can I press anything after?",
            "Kinda new to this so sorry if it gets asked a lot but what are tweyen and seofon best sigils to use ?",
            "Steam is absolutely refusing to let me update. I've tried restarting, reinstalling, running as admin, blocking firewall... Anyone have any idea what the hell I can do?",
            "pyet won't freaking drop lunary cell for tweyen asc. weap. \n\nsiiiiiiiiiigh",
            "Could someone please help me beat Lucilius? I'm on PS5.\n\nI've been trying with randoms but haven't been successful once!\n\nMy IGN is Azylph.\n\nThank you!",
            "is IA for Song good or do i need to main her?",
            "How do you get two-crown boundary sigil",
            "Why have people forgotten how to Lucilius? It's just crazy how teams now just trying to ignore moving around completely and facetanking all attacks now. And these are people WITH the Luci sigils, so I know they've done it before. Just curious who sent out the memo to troll now, I just finished a group with a Rakham unironically trying to dps Luci with the self-exploding grenade... Like trying to stay alive in between shots, mashing, all that stuff, actually trying lmao.\n\nDon't even need to deal dmg, just try not to die and eat up the critical bar before 5mins or so, please and thank you.",
            "How do you obtain Warpath and Warpath+ sigils?\n\nCan you obtain them through transmute/transmarvel?",
            "Is yodarha warpath good? I’m not sure I understand the wording",
            "Does Charlotta's Holy Knights Grandeur count as a perfect guard when it procs?",
            "My characters are too weak to finish off the >!quests Rolan \"didn't finish\".!< Am I supposed to farm levels now? How should I go about it?",
            "Hey to my fellow dlc buyers out here I have a quick question: has anyone of you also had issues picking up your stuff from the claims? I seem to have that problem, today I finally bought the new character packs + 1 emote set & neither of the 3 showed up in game - even after I uninstalled the game & re-download everything. Anybody else also had this problem & managed to resolve it? I'm playing on the ps4 btw if that's somehow relevant.",
            "This might be a silly question, but besides the sigil shop, where I already managed to get a double sigil for Tweyen, where else can I get Two Crown Boundary and Dark Huntress Warpath?\n\nThanks in advance (:",
            "I just completed the last quest, unlocked maniac but I'm missing one crew card ( besides the two new characters). is there a way to get the last one without going online?  I don't have ps plus.",
            "Anyone have pics of tweyen and seofon recolors included in color pack 4",
            "I just finished the story and have Id joined party. Currently level 71. I don't really know how to progress or the direction I need to grind for. What type of quest should I grind? So far I just put most of my points on one character I played for the story which is Yoda. Should I also focus on my AI party as well?",
            "With the last live stream im assuming they are done adding characters to relink,   anyone know if they mentioned any more plans going forward is that a wrap for relink?",
            "Does Beta's ougi effect reduce the lockout time on Song's and Siete's big skill?",
            "What are the 'best' (or stand-out) Warpath sigils? I understand some are amazing and some are average.",
            "Which sigils between Alpha, Beta and Gamma are best for Tweyen?\n\nI've just started farming Lucilius and can buy 2 sigils - which ones should I buy?",
            "Which bow of Tweyen is best? Her Ascension weapon has an attack stat of only 1,013 at Level 150, while her Defender weapon has 2,003...",
            "Anyone able to pleeeeease help me kill Lucilius a few times? Just need a few more runs and then I'm done!\n\nI'm on PS5 and my PSN is Azylph\n\nThank you in advance!!",
            "Can wrightstones themselves be upgraded? E.g one of my stoned has Crit Rate Level 9, DMG Cap Lev 6 and Potion Hoarder Level 3.\n\nCan I upgrade these levels? I've seen a Level 10 before so assume they can go higher",
            "Any tips of good builds for vaseraga I do a lot of damage I just can’t live long enough",
            "I just started using GBFR Logs and I have never known what's considered good DPS. I'm aware Cagliostro is currently bugged, but is 390K DPS considered decent for end game? I haven't farmed Lucilius much, so I only have a single level 15 Gamma and one Supp V as \"notable\" Sigils. Thank you!",
            "hey guys. I have a question about damage cap when i test it on the training dummy.  \nso my Rackham hits the damage cap on all skills when i fight with dummy.  \nI just wanna make sure, since he has now max  Terminus Weapon and only 1 stamina sigil to hit damage cap.  \nhis attack is only 19k though. even if i put tyranny or more attack boosts on him, he still hits same numbers.  \nThanks.",
            "I'm looking for a certain archive entry, that's between Installation Request, and Your Mission Orders. I can't seem to find it anywhere, not even mentioned in guides or the like.",
            "I legitimately have no idea what is happening against angra mainyu. When do I dimension warp? What to do with the flying hands? When do I get out of dimension warp? I've beaten it by brute force, I still don't get what it's doing. Worst fight IMO compared to the other bosses",
            "I've been playing since release, but took a big break since the first major patch until now (mostly because the Steam matchmaking was busted for a bit). I only have one Terminus weapon. I want to progress further, but am at kind of a loss of what to do other than farming more Proto Bahamut. How does the late game progression work come late game with all the newer content?",
            "Does anyone know how much better Ferry and Rosetta's dps is after the patch? I haven't seen anything about them at all.",
            "Any tips for I See a Chromatic Vision? The AI keeps costing me the fight. This happens a lot in multi-target scenarios actually, but here's it's especially bad. Honestly, I feel like it should be an industry standard to have the Gambit system from FFXII in every game that has AI companions, no ifs, ands, or buts.\n\nI'm trying to focus on whittling down one at a time, starting with inferna, because I'm maining Lance (12k power), but they really don't \"*Party Leader's target = Attack*\" and keep f'ing around, also costing me link time because they're miles away. My team's Perci (10k power), Z (8k power), and Eugen (7k power). I don't have other characters even close to their power.\n\nThanks in advance.",
            "I can't do maniac quests in assist mode. Is it just me?\n\nthanks",
            "Can someone please clarify path to mastery and fast learner sigils effects for me? \n\nLike does equipping one make everyone get the increase? Or is it only effective for the equipped character?",
            "[deleted]",
            "I just bought the tweyen expansion set and went to claim add ons but it said no add ons available? i tried to restart the game and even the ps5 as well to no avail? Any ideas?",
            "Is Narmaya a safe character for endgame content vs Zeta?",
            "Is Narmaya's New Warpath Sigil worth the loss, personally playing with it on kinda hinders me I feel, and I can't help my team very well against Lucilius.",
            "New player here.\n\nAre builds specifically for AI companions still generally optimal if played manually? I plan to follow the builds in this recent post:\n\nhttps://www.reddit.com/r/GranblueFantasyRelink/comments/1cmbsf6/now_that_were_well_into_the_new_patch_who_are/\n\nOut of the list there, I'm keen on playing Yordaha.",
            "Does final damage multiplier apply before or after damage cap? It seemed obvious from the names until I realized damage cap is mechanically a literal final damage check.\n\n- - - \n\nExample:\n\n*  200 damage\n\n* 100 damage cap\n\n* 50% final damage multiplier\n\nDoes it go \n\n* 200 damage → 50% multiplier = 100 damage → damage cap 100 damage → **100 damage total**\n\nOr\n\n* 200 damage → 100 damage cap = 100 damage → 50% multiplier = 50 damage → **50 damage total**\n\n?",
            "So if you want to play with friends for some missions after the story is relink \"1-4 players\" or \" 1 or 4 players\"",
            "Did a quick quest online, it was Vulkan Bolla **Nihila** (lol, you can probably guess already).\n\nI used three golden tickets for it. Everyone else kept dying (one-clapped) and Zeta was on revive counter. The time was almost used up by then (yes, really, they kept dying that much, no matter how much I revived others), but then realized I was the only one left online, everyone else dc'd.\n\nSo I'm met with fission mailed. But now that I'm trying to start another QQ, my tickets were used?? Is this common? Like... Why am I getting punished for others dc'ing? What about my tickets? Did I get the badges? I don't remember how many I had beforehand...",
            "What are Seofon's best skills and what's his general playstyle like?\n\nI just beat the main story so I don't need to hear about Alpha and Omega stuff yet, but I'm just curious what his general \"best\" playstyle and skill loadout is, and maybe a general idea of what Sigils are good to look out for as I get access to new stuff.\n\nI spent most of the main story playing as the Captain, so I'm only just now switching things up. If there's a comprehensive community-approved (i.e. not blatantly incorrect) guide anywhere, that'd work too.",
            "Does tweyen's debuff extension get effectively nullified by the reapplication of the sane debuff? Like, if I extend the defense down, will reapplying it cause it to just shorten the duration because it would be the the one not extended?",
            "I’ve managed to clear everything till Proto Bahamut w/ an AI team but starting to feel the buranout. What is the best way to set up AIs for the fight? Where ai get wrecked is that I take too much time to destroy the crystals he deploys….current party is Tweyen as my main then Zeta, Cag and Eugen. They have decent loadouts with their awakened Ascension weapons…but obvs not optimal given where I am at the game.",
            "When is the 1.3.1 version coming on Steam?",
            "I'm having a weird audio issue when performing SBA abilities on PS5  \nThe skill sound effects go off, but I don't hear the voice lines that go with them anymore.  \nDouble checked all my other audio settings, & I do still hear voice lines with regular skills & when activating SBA's - just not during the mini cutscenes that go with them",
            "What's a build for Sandalphon? Just got him, not sure what sigils to use",
            "Does anyone know if there's a site/server/wiki/etc out there with the game's image assets? Not the models, really just the character icons, stickers, weapon's 2D pics, etc.\n\nI'd love to save a few of them, mostly to make a few discord emojis.\n\nAlternatively, if anyone with the steam version is feeling charitable, could i ask you 🫵 to rip a few of the assets for me? :'>\n\nEDIT: if this isn't okay to ask, please ignore it, I'll make do with screenshots.",
            "Am I the only one who can solo Gallanza & Maglielle but absolutly can't do more than 50% dmg to one of the two wind and ice wyrms ? Any solutions for this quest ?",
            "Can I get a new link this one now letting me accept it",
            "Is Sandalphon S Tier?",
            "Hi, I'm planning to get the game. The question is, is it still worth it? Are there any incoming update/content after Sandalphone patch? Thank you.",
            "Are the demo rewards worth it or should I just wait til the game arrives in the mail?",
            "Want to get the game but I am curious what is there available besides main story\n\nCause in How Long to Beat it says story is 20 hours but it takes 120 hours if you are a completionist (which I am)\n\nI platinumed FF7 Rebirth and took me 200 hours playing leisurely but completing everything",
            "What subtitles does the US version of Relink supportb(PS5)?\n\nDoes it have Chinese subtitles and Japanse voiceover?",
            "I bought Tweyen from the Steam store and I got the items but don't know how to actually get the character.",
            "Both are working for me\n\nGranblue Fantasy: Relink Fan Discord https://discord.com/invite/KRm6WtQkVR\r  \n\r  \nGranblue Fantasy International Discord https://discord.gg/granbluefantasy",
            "The core story honestly feels like a tutorial in hindsight now that I'm in the endgame.",
            "Honestly yes, especially if you're into maxing out multiple characters and their weapons and sigils",
            "You can rename yourself? The subtitles not matching what they say drives me crazy.",
            "This is a known issue, there are literally no button graphics other than for xbox controllers supported in the game currently.",
            "check the steam overlay with shift+tab and then controller settings, should show how your controller is being recognized.",
            "I think Quick Quest might also be filling normal quests, so say guy with proud gear does an open quest for a maniac quest for upgrade mats or whatever, then you can quick quest into that and get synced, but since they started it they're not synced.\n\nAt least that's how I think it works.",
            "If you Quick Quest into someone's session they aren't synced. I once got dropped into a session of level 20's running Furycane with a level 100 maxed Narmaya- dude oneshot the boss before the fight even started.",
            "There is a chapter select after you finish the story, It also tells you how many chests/crabs you missed too",
            "I hope so too",
            "Beating the story grants Quick Match. Settin it to all regions gives me fast matches",
            "Assault.  Slimepede is kinda ass for voucher farming because they only drop gold and glitterstones (which can't be traded) unless you get the prismatic, so most runs, you end up with pretty much the sigil + whatever ranking to trade in (potion, xp or gold booster sigils and maybe an xp book or 2).",
            "I've played 30fps no changes needed to be made",
            "no",
            "no. Only the mastery bonuses from leveling the weapon are universal",
            "Pretty useful on almost everyone, sure.",
            "few days ago someone posted ferrry + stout heart + drain + extra defense while having stout heart\n\nShe is basically a tank lol",
            "As far as i have seen they can go up to LVL 65. But grinding EXP/ getting a character to Level 100 takes very little effort once you get to manic Difficulty and can farm this one mission. So if that is all you are concerned about then unlock away.\n\nDo note however that there has been talk about not unlocking characters to increase the chance at getting ultimate weapons from the last boss. i tried looking for the post but dont see it.\n\nIn simple terms there is a big boss you fight as the last mission of the game. Its the hardest fight and it has a chance at dropping the best weapon for a character. But it seems that the weapon it drops is randomized based on what characters you have unlocked.\nNot 100% confirmed from the last time i checked.\n\nAnyway, so if you are after your favorites weapon but have everyone unlocked then the chances of getting any one weapon get lower and lower. Just something to consider.\n\nEDIT: Found it\n\nhttps://www.reddit.com/r/GranblueFantasyRelink/comments/1al5t54/psa_do_not_unlock_characters_you_dont_plan_on/",
            "Just recruit them whenever you feel like playing them, the difference is minimal anyway.",
            "Recruitable characters stay at 45 until you unlock maniac, where the max increases to 60 and you get \\~62-67% of their masteries filled. This won't increase any further (at least for now) so you'll be safe to unlock characters unless you want to reduce the pool for the endgame terminus weapons.",
            "Phantasm Harmony + DMG cap. Optimal character sigils will have character-specific + one useful damage sigil, otherwise you're losing a possible slot for damage or utility.\n\nDouble skill sigils are a little worse overall since you want to run some attack sigils on top of the character-specific sigil.\n\n[banboy123](https://www.reddit.com/r/GranblueFantasyRelink/comments/1aq9d8n/endgame_sigil_build_guide/) has a [spreadsheet](https://docs.google.com/spreadsheets/d/139zbkluznflMS6MDJisghlAYdfvyiHW_AFkvpEeI0z0/edit#gid=0) for an endgame sigil layout.",
            "Have you maxed out damage cap and hit the damage cap on your characters?",
            "[deleted]",
            "I did play offline in the past.\n \nThis is a stand alone game with a co-op mode that just so happen to be very fun... but your not forced to play online",
            "I believe only the strongest debuff applies, unsure how damage over time works, though, I've heard it always does a percentage of the enemy's max health, so it probably follows the same rule.",
            "Just in case you didn't catch the post for it, the characters release on the 26th and there will be a showcase on the 25th.",
            "> Even did the \"check damage for no variance, then add more Damage Cap)\"\n\nOnce you are at Proto Bahamut, you should be operating at max damage cap, it shouldn't be a matter of trying to add more; they should all be at 60~65 (depending on Ascension/Terminus level) and you should be filling yourself and your AI with as much damage as possible to meet the cap. ProtoB was the original endgame, you should be running mostly-good V+ sigils, and they should be leveled.\n\nRosetta and Io are notoriously bad when played by AI. Rackam is okay-ish but not the best because he tends to squander some of his skills.\n\nThe best way to play Io is by animation canceling out of the aftercast from her charge attack. The AI will not do this. The AI is generally bad at correctly playing charge-based characters, and on Io it's even worse because the canceling is the only way to get great performance out of her.\n\nBeyond that, you'd have to post your build(s) for us to comb through. Guts/Autorevive are great on AI if you find them dying during the fight (they don't on some fights, and on others they eat damage like crazy) and potion hoarder isn't worth the slot on AI.",
            "Previously you had to do the full normal attack combo, which is almost painfully long, to trigger the faster charge speed. (Or use a skill, but that's not what this is about.) Now if you get part-way into a combo and then charge, you'll get *some* bonus charge speed, just not the full amount.",
            "Support Skills aren't active skills, they're passive parts of the character's kit.  They're at the bottom of the character page.  Every character has two Support Skills",
            "The plus variants can appear only from Transmarvels. Whether or not you bought the single versions from Siero has no effect on Transmarvel results. You can only get an awakening (the 2-in-1 that combines both character sigils) once for each character from transmarvel and you cannot get duplicates of it, however you can get duplicates of [Character Sigil]+[Normal Sigil]. Unlike Terminus weapons, the Transmarvel does not care which characters you have or have not unlocked; You can get sigils for any character, including ones you do not yet have.",
            "Estalucia is the world of the Astrals yeah, and she wants to go back there, but it's just not easy to. The skyfarers meanwhile just want to go there cause it's a legendary place, a utopia where every wish is granted and that's obviously what every adventurer wants to discover.\n\nIt is explained why she's in Zegagrande near the end of the story and also in the postgame notes.",
            "I rolled credits at 19 hrs not going particularly fast",
            "Your stun locked during their initial skyart animation; as they go through the motion of their attack you can move a bit",
            "Optimal DPS is to loop thrice -> use finisher -> use skills if needed -> repeat. This way you can keep 100% Arvess Fermare uptime and use skills appropriately as well.",
            "It makes hitting it easier.\n\nNothing raises the damage cap except for Damage Cap skill and Glass Cannon, and damage cap on overmastery. And Catastrophe skill on Terminus weapon.\n\nPlease note that supplementary damage, and War elemental are a different calculation so they sidestep the damage cap, and is why they are good.",
            "No one knows yet. There should be some details coming out March 9th during their livestream.",
            "Without getting into the discord section, these are some good visual guides to get started with:\n\nhttps://www.youtube.com/watch?v=x0N4zILJDzY  \nhttps://www.youtube.com/watch?v=Owoq748dQ0s",
            "yes",
            "1) you can and will be playing offline most of the time. This is a game on it's own, just with a very fun coop. But AI is capable on its own.\n \n2) It's basically a \"what happened after\" story. It tells a new story that takes place after the crew set foot out of the first skydom.\n \n3) yeah, the game does a good job telling you what happened on the \"previous game\" anyway. Plus, there is a toogle glossary on every dialogue.\n \n4) Like MH, but with a bare minimum personality.\n \n5) Not obligatory (just like the og game was also not obligatory). Just very fun to do it with other players. I know no one, but always play with discord random players. There's a channel there, you should try.\n \n6)Nop. It's not a gacha. There will be paid content released, but it's in the form of DLC. You buy it, you get the full content. Just like right now you get all 19 characters, but have to unlock them via invitational letters. In march they will release Lucilius boss, in april they will release Seofon and Tweyen as new characters(they will be for free) but together with free content will also be paid content.",
            "Yeah, it's pretty standalone and explains what you need to know for the setting.  They also quickly go over every character's backstory in the fate episodes",
            "[deleted]",
            "We will know in a couple hours.",
            "Generally no, you can try splitting bosses in multi-monster fight to avoid their AoEs overlapping but that's about it really.",
            "I played Dragalia for a long time, and no, not really, besides the final Proud fight where two people will be on cannon duty and the other two will be killing adds that spawn around the team; very simple roles.",
            "There are just mechanics you need to fulfill, but you can build anyway you want. During Proto, players should split into 2 cannoneers and 2 deck cleaners, during Pyet everybody splits to clear the 6 firefly totems and it seems that Lucilius will have an elemental lock mechanic and you have to destroy the orbs scattered around the arena.\n \nBut you could use any build to do it.",
            "For damage, absolutely.",
            "Yup.\n \nUnless you wanna afk farm, then a tank should be using Ascension.",
            "Well, pretty much any game is gonna feel like the easiest grind in your life if compared to the original GBF. You can focus on just levelling whatever few characters you like, for the most part it doesn't really matter which characters you use.",
            "There is a crap ton of grinding, but that is almost a signature mark of the franchise. I've being playing since release day and I still couldn't awake all 38 weapons.\n \nGranted, there are 8 characters I play in different situations... I've never even touched Zeta, for example. Other than the time I had to perform 30 ougis to awake her weapon.\n \nSo the answer is yes, you can focus on your main and forget about all else. That's what 99% of the playerbase will do anyway.",
            "Depends on your character, Drain has a 500 HP cap per hit so if you're slow hitter like Vaseraga just the passive regen might be better.\n\nOr just Potion Hoarder and potion whenever you eat a big hit.",
            "Drain is way better. Regen heals too slowly, while Drain procs on everything",
            "Neither. Potion hoarder is the reason why nobody need a healer on this game.\n \nAlso, regen has more aplications if you want to afk farm and upgrrade only worthy sigils.\n \nMy afk unit stands with 99.999 hp and each regen tick heals 5k hp... paired with a regen buff from the AI, it heals 10k...",
            "Codes for what?",
            "Any uncap that require materials from a boss you don't want to deal with (for example, I use it to skip Id materials and depending on my mood Excavallion)",
            "I just use it on the final uncap if I don't have a specific material I don't want to bother myself grinding. Everything else before the final uncap was pretty easy to get, only merits would I end up mass farming 30 or so every time.",
            "Imadiatelly. The amount of mats it take to awaken weapons/upgrade sigils is already mind blowing.\n \nSave yourself some time and at least use the ingots on the 125>150 ascension.",
            "You do unlock the multiplayer quests relatively early into the game, I may be wrong but I'm pretty sure higher difficulty quests unlock based on story progression so you won't really be able to do most quests until getting farther into the story.\n\nThere is still a decent variety of quests in the lower difficulty levels, but obviously most of the resources you'd obtain from them are not super relevant once you reach higher levels so you'd probably want to prioritize finishing the campaign when possible.",
            "If you wanna play with other players (other than you friend) you gotta reach Proud level...\n \nPretty much no one ever runs low level stages because you can one shot them if you want to.",
            "No one relies on Supplementary Damage, it's just a win-more sigil.",
            "They are different instances of dmg.\n \nIt would be like a triple attack: one tick for you basic attack,  another from the skill and yet another from the sigil. But the sigil is just a chance to get that, that's why you need 3 sigils",
            "50% from maxed mastery \n\n20% overmastery\n\nlv 15 crit sigil + 10 from wrightstone +1 from fully awakened ascension/terminus = 30% crit chance\n\ntotaling 100%",
            "Is there even a sale on the horizon? As far as I know, steam doesn't put new games on sale...",
            "The Steam Spring sale starts on Thursday the 14th. I'd wait at least 2 days for that but unlikely that it goes on sale this soon IMO.",
            "Yes. It is entirely possible to play the entire game solo. You would have to spend more time investing in the AI for proud stages (end game dungeons/quest/missions), but entirely doable. I soled pretty much 90% of the game. I played online near the last couple of quest of end game because I wanted to rush the weapon.",
            "Yes, but it will make some fights more difficult.\n \nYou need 2 cannoneers against Proto and AIs don't know how to do that.",
            "It's mostly to continue your combo. If you get lucky timing and you can link attack when you're doing a perfect execution, you can perform two in a row. Not sure exactly how but there are guides on youtube that explain it well. Granted, there may be more tech that I'm not aware of.",
            "The basic grid for all characters: 4x dmg cap, 3x supp dmg, 1x war elemental, awakening+, 1x tyranny and 1x stamina.\n \nWhat you do from this point ahead depends on the character.",
            "It's Zathba's exclusive sigil.\n \nGotta trade curios to get it.",
            "They are used for sigil upgrading and weapon ascensions.",
            "Postgame kind of starts at a cliffhanger at the end of the \"main\" story, which basically has you go through some harder difficulties of existing content, as well as starting to introduce you to harder boss fights, with minimal story advancement but some progression.\n\nOnce you complete those, then there is a final series of fights where you complete the actual story.\n\nThen the actual hardest difficulty has you doing the hardest difficulty to farm materials and at the very end, unlock the BiS weapon for every character. Along the way you'll accumulate and unlock BiS sigils.\n\nI would suggest it takes about 40-60 hours or so of endgame grinding to get your first character to BiS or close to it, then maybe 20 hours per character after that. Depending on your personal definition of \"BiS\".",
            "The only thing we know is we'll get three updates, in March April and May. Anything beyond that we have no idea, but considering the surprise success that this game has had most people are expecting at least some sort of updates after what's currently planned.",
            "Yes",
            "They stack with each other and it is generally better to have 1 Cascade and 1 Quick CD rather than 2 Quick CDs.",
            "They do stack, as they're different effects to begin with",
            "Bloodthirst can't be dispelled, no. Dispel skills in general suck as of right now due to the easy mechanics surrounding them",
            "\"Leaflit & Asari\" streams the game and makes videos on Relink, including guides. She's very knowledgeable about Relink and has mentioned many times how she's played/still plays the gacha game, and has done so for a while now.",
            "I think that all depends on your gaming preferences and how much you're willing to spend. This game doesn't have the highest requirements so whatever you think would work best for you otherwise.",
            "short version is moar damage cap + special trigger on SBA if you can get lv 30 of the new traits",
            "Do you mean random queue? I think most people trying to farm serious fight like this would be forming them in the discord.",
            "I don’t really think looking at their other games is really gonna give any insight, since one is developed by Arc System Works and the other one is a decade old Gacha game that sometimes releases balance updates for older characters. I don’t know if there is really any meaningful comparison to be made there. ",
            "Yes there is a chance. But let's be honest, homeboy be cheatin'",
            "Possible, but I know some people on discord who had rerolled 50 hours and did not see a single stone with double sub.\n \nLet's be real here, this is quite difficult.",
            "It's possible, esp with the new knowledge that you can reroll Curio secondaries.\n\nBut getting the Supp V+ to pop in the first place is pretty hard.\n\nDouble dmg cap wrightstone though, absolutely no reason to believe that's legit, unless they SS Siero or post-mission screen, I'm gonna 99.9% believe its false.\n\nAlso with the new sigils I dont' believe double dmg cap is even good anymore, I think it will be autorevive/guts or equivalent. And that you won't need 7/5 for.",
            "They reduced the SBA generation from her jump slam attack (but not the damage), so if you were doing that then you won't be able to spam SBAs anymore. If you were just using her normally then nothing's really changed.",
            "Broken. They are aware..",
            "Nop. You can however press Tab (I don't know what is the key on PS5) and click on the chararcter you want to transfer and then transfer specifically the sigils you want.",
            "It's 10% of 30%. Ergo, it just nets you 3% sbg gauge.\n \nYes it was worded in a weird way and bugged players' minds.\n \nBeta just resets a given amount of the cooldown instantly, but it's way to hard to make this work imo.",
            "https://www.youtube.com/watch?v=53QFVSS6ay8\n \nNot much to say.",
            "Yeah, it's one of the curio-exclusive sigils.",
            "You can dump it.\n  \nBut who has the patience to keep changing builds? No one.  \n \nAlso keep in mind it works against enemies with no element at all.",
            "It is a modifier to final damage after damage cap (so it ignores it), and it does work on Lucilius but does not work on fully non-elemental enemies (ie, Pyet-A before he's absorbed an element).\n\nYou can tell it's working because your damage will be in large orange numbers, instead of blue numbers.",
            "Has your friend reinstalled the game? Some data might've gotten messed up.",
            "Yes",
            "Lucilius.\n \nNo one uses standard dmg cap sigils anymore, Luci sigils are the best.\n \nHe also drops centrum, a good bunch of fodder to transmute and curios.\n \nSo it's a all in one.",
            "Yes",
            "Flight over Fight\n\nTurbo Y smash to victory",
            "Nothing new beyond them saying it's in the works after they released 1.1. Hopefully soon though",
            "Zeta barely uses skills, so either alpha gamma + 2 dmg cap with utility, or 2xalpha 2xgamma, or alpha 2xgamma + utility.",
            "It is exactly as you thought. People are spamming Improved Dodge, Flight Over Flight, Nimble Onslaught, and etc to try to minimize any chance they get exposed and then try to take Lucilius down like a group of angry hornets, and to their credit, it seems to be working for the time being. Who knows if it will still be usable once the next update comes out that releases Seofon and Tweyen though.",
            "Absolutely not.\n \nRun glass cannon instead and take advantage of his many invu possibilities",
            "Weird! Does it show it was claimed and you can't find it, or is it not there at all?",
            "No, any offensive sigil that is useful to you is fine.\n\nIn fact with the very newest to tier sigils, you actually don't want any damage cap (once you are fully, fully optimized).",
            "Ah yes, if you hold the emote wheel button, and go to the top option, that's where you will get the toggle Hold SBA.\n\nTo get the behavior you want, yes, you want \"Override Hold SBA for chain\", and \"Full Burst Only\", and finally \"Hold SBA\".",
            "Compare to what you'll need later in the game it's almost nothing but it does make starting out much easier.\n\nThere's also 2 colors from deluxe edition that might look better for some character than the free ones.",
            "Um, not that I know of. But is there a reason you'd like to?\n\nThe easiest way would simply be to remove damage cap sigils.",
            "Improved dodge on all, though I think characters that can parry count as perfect blocking so the other block sigils can possible be helpful on those.",
            "They never use potions no.\n\nThey benefit from guts and auto revive, and improves dodge / nimble defense because they always perfect dodge until they run out of dodges.",
            "You need damage cap sigils to reach the max level of 65, and typically tyranny and stamina.",
            "So later on you will get enough damage up to hit the damage cap on min charge, so you can tap it if you'd like.\n\nBut also you should use both skills. Setsuna hits very hard, and the gap closer is very good and enables you to chain blue stance finishers.\n\nThe most common skills are the gap closer, setsuna, and the um...shit i dont' remember the name but the damage one.\n\nThe other skill is typically the dance of pink petals for more damage.\n\nMost people do not run the jump back.",
            "You'll get plenty later. Melt the ones that aren't useful to you. Keep damage cap, crit rate ones for sure tho.",
            "No, theres no crossplatform play.",
            "It’s like Monster Hunter, have you play it.",
            "It is a lobby/level based action RPG similar to Vindictus.\n\nWhile there are some meandering levels, esp story levels, the primary mid/endgame content is boss killing with a team of 4.\n\nYou can do it solo with AI, or you can join other players.",
            "It's likely they were abusing Flight Over Fight, a defensive sigil that cuts your damage but makes all regular dodges become perfect dodges.  You'll need to load more offense into your build to compensate, but some characters (notably for Lucilius, Lancelot) don't really have a problem capping damage anyways.  Now that we've had time to farm Lucilius, plenty of people have Gamma sigils too, which grants a 50k shield after SBA.  Without a Gamma shield you'll still die in one hit to most things, but the defensive layers offered by some combo of potion hoarder + guts + autorevive (+ Flight Over Fight and other dodge sigils, specifically Nimble Onslaught) means you're covered when you do get clipped.",
            "Nope, but on the flip side enmity DOES kick in",
            "damage cap just increase the maximum damage you can do\n\nyou still need actual damage increasing sigil to push your number up to that new cap",
            "Yes, \"parry\" timing counts as perfect block, and Lancelot's dash counts as perfect dodge.",
            "Also, any way I can make the ai target one specific enemy? They seem to change to whichever one is nearest to them",
            "Just avoid dying, give your AIs Glaciate immunity and let them carry you.",
            "[this is the best we got right now](https://docs.google.com/spreadsheets/d/1RnNLfdqFCW7zWvfHnQsNRJoi7EtIjdOUg-uYB0xsZHQ/edit#gid=1519714141)",
            "I've had no issues with my steam download region set to tokyo ever since they announced they fixed it.  It's possible your region just gave up on matchmaking after a week of it being broken",
            "You need to awaken ascension/terminus to gain their true power.\n\nWithout awakening (at Siero) they'll have less base stat than other weapons.",
            "Always upgrade first, otherwise you're losing damage cap.",
            "He has to build up to his form, and that can easily be interrupted by boss attacks/phases, which makes him kind of inflexible.\n\nHis damage with everything going right is also not super great, it's middle of the pack but its high effort to do so.",
            "Ghandagoza easily, I've seen like three ever.  Yodarha and Ferry also seem pretty rare now",
            "She's in general fairly bad. Her kit simply doesn't work and she has some of the lowest damage caps in the game, so her intended gameplay is really unusable.\n\nHer \"best\" rotation is simply jump attack and slam, which is not only boring, its also pretty bad damage (about average/below average), its just that her actual kit is even worse.\n\nThis game doesn't really have too much in the way of characters with sweet spots in terms of positioning. There are characters like Zeta and Charlotta with parries built into their kits, and characters like Narmaya and Vane who have parries off of specific attacks and skills.",
            "A bit late to the party here, but you might wanna try Siegfried as well. He has a similar timing mechanic to Zeta (timing your attacks as the previous one lands), but a bit more involved in a few ways:\n\n1.- His combo chains are longer, so you need to focus on execution for a bit longer than Zeta\n\n2.- Each attack in the chain has a slightly different timing, so it doesn't let you time them as mindlessly as with Zeta\n\n3.- You can reposition with either dodging or a lunge attack to keep the perfect combo intact\n\nAnd the payoff for doing all of that is a very satisfying and hard hitting slam dunk AOE attack - again, similar to Zeta's hammer from loops, but a different flavor that you might like better.\n\nI say all of this as a Zeta enjoyer. I liked Siegfried a lot due to the similarities, but as an Insect Glaive afficionado in MH, \"you can't take the sky from me\".",
            "Quite simple really, you spam the everliving fuck out of her Spear of Arvess → Transition into single Loop Jump → into Arvess Hammer. Rinse and repeat. That's really it. \nAlthough a triple volley of Infinite Wonders to boost your Combo Booster is definitely not a bad starter either.",
            "Either the boss entered Bloodthirst phase or the pushback from Overdrive phase starting.  Or Someone else SBA'd before you so it canceled your input. Or you were in animation lock so the game didn't register your SBA input.",
            "Aside from bloodthirst (orange shield-ish icon buff under boss's HP bar and yellow glowy sparks) there's also possibly you just missing the initial attack to trigger SBA.",
            "The upper limit is not dying and perfect dodging to trigger invulnerability. Or if you're godly, perfect guarding everything. \n\n\nThere are a lot of technical characters like Io who have a lot of mechanic optimization to get the best damage output.\n\n\n\nAnd knowing how to minmax and abuse or skip phases in a fight to obtain the fastest time.\n\n\n\nIf you solo anything, it basically becomes Monster Hunter fights that take like 10-15 minutes to do.",
            "You can, just go to blacksmith and choose 'sell treasure' or Siero and knicknack voucher for similar reason.",
            "Freeze doesn't work at all on him for that fight.  You can literally hold down 1 button for 90% of the fight and do fine.  Dodge is basically necessary in this fight and Lancelot can attack *and* dodge at the same time, with more iframes than the other characters and relatively high SBA generation.  He can run Flight Over Fight relatively easily because his damage caps aren't too hard to hit.",
            "Maybe wait for end of April with the 2 new char releases, and then play through and drop it until later.",
            "General breakdown: maxed terminus weapon, 1x stamina, 1x tyranny, 1x crit Chance, 4x dmg cap, 3x supplementary dmg, 1x war elemental, 1x potion hoarder, overmasteries with 20% crit chance, skill dmg cap and normal dmg cap. good character guides are on discord",
            "30k sounds a bit much, endgame builds sit around 22k. fully awakend terminus adds a bunch, full masteries with overmasteries and weaponmasteries, and ofc good V+ Sigils. iirc i was somewhere between 16 and 18k when working through proud, so maybe your build aint optimal",
            "The best way is save scum transmarvel.\n\nNot really a targeted farm, but easy to do.",
            "dont really need to Upgrade the ai if your character is fullbuild. but i guess it doesnt hurt to Max their critweapons and masteries",
            "40 is super low (you should be hitting 200) but soloing the slime mission is a pain in the ass. Also don't bother with Slimes because Lucilius has better drop rates for the same items and also has other materials you need.",
            "It's region based matchmaking and most regions are pretty dead yeah.  If you're on steam, change your download region in steam settings to Tokyo, Japan (or some other populated region) to get more players",
            "Have you tried if the offline quick match trick still work?\n\nGo through the normal steps for quick match but after selecting to use 3 gold tickets and before hitting the queue up part you hit the button to bring up the quest menu (X for controller) and then switch it to Close party (Y for controller) then accept to start quest.\n\nIf done right it should use the 3 tickets even though it'll be an offline run.",
            "the pack gives you 3 Supreme Weapon Essences which you use to buy a ticket which will give you tweyen",
            "Only thing I noticed was that she quickly gained a lot of levels on her unique attack meter",
            "Is it downloading the patch but then hangs on applying/installing it?\n\nThat happened to a friend two different times, on patch 1.1 and then last night on 1.2. The only thing he could do was uninstall and reinstall the game.",
            "you can speedrun breaking the tail (ideally with sieg or eugen) and quit out; if it drops the right thing, quitting out will still give you break part rewards.  my scuffed eugen can break in about 30s reliably\n\ndoing lunary cells legit is mindnumbing",
            "Treasure Trade only!",
            "Warpath comes from treasure trade on Siero.\n\nWarpath+ does not seem to exist.",
            "Level is kinda secondary at that point, you should be aiming to get Damage Cap trait towards the max 65 level as well as enough damage increasing sigils to still keep up with that increased cap.\n\nAfter that it's jsut git gud to not die.",
            "Nowhere else, as far as I'm aware. Can only buy them from Serio's treasure trade.",
            "The offline quick quest trick still work last I tried, tho not sure if you can do it on PS5.\n\nBasically choose quick quest, open queue, choose to use 3 tickets, then on the final confirmation screen, hit square? to check the quest/abandon option then triangle? to change the party status to close. It'll give you a warning about not being able to use ticket but when you do the quest it'll actually use them anyway.",
            "Working on sigils (don't upgrade any just yet though) is the next stage in your progression.  Just clear more missions, trade more stuff for vouchers for level 3 transmutation, and try to pick apart the good sigils from the bad.  Your final build is always going to include four damage cap sigils, a couple of orange offensive sigils (Stamina + Tyranny is all most characters including Yodarha need to cap), war elemental (comes from curios), critical hit rate (outside of specific characters), and some form of defensive utility (Potion Hoarder universally the best, Guts and Autorevive also great, Improved Dodge gives a lot of freedom in spamming dodges).  However, some traits are straight up **bad** (flat attack, flat HP, Rupie Tycoon, Path of Mastery, most resistances, Improved Healing) or too situational (Overdrive/Break Assassin, Firm Stance, Lucky Charge) to usually desire.  You should also consider your character's unique sigils- Swordmaster's Art is too good to never not take, but Swordmaster's Prowess is also really good.  Roll transmarvel enough and you're eventually guaranteed a sigil with both of their effects in one\n\nYou want to assemble all of the \"mandatory\" sigils and as many of your helpful traits as you can into your sigil setup.  Most of your *really good* sigils will come from Transmarvel or curios, but you can target farm certain types of double sigils depending on the mission (shown in the \"drop items\" tab on the mission page)",
            "All they said is that they are done for now, but they'll keep an eye on player feedback and make more if there is enough interest. If they do end up making more content, expect there to go at least a couple of months before we hear of anything.",
            "It isn't game-changing like Charlotta's or anything, but Rackam's is extremely good. It's just 20% damage with an incredibly easy to maintain buff for doing something you should already be doing when playing him anyway. No complicated gimmick, no awkward fight pacing issues, just free damage.\n\nVaseraga's seems nuts on paper, but I haven't tried it out yet. I need to rework my Vas build since I changed his overmastery around and now that Supp V+ aren't a complete myth.",
            "Gamma is the best for most characters unless they skew very heavily towards skill damage or normals damage, plus it actually has a useful level 30 effect.  Tweyen's one of those characters that sits in the middle.\n\nAlso as a side note- you only have to level up lucilius sigils to 14, because sigil booster lets two level 14 sigils cap at 30.  Saves a couple of tears",
            "Ascension weapons in general are weak until you start upgrading them via Siero.  Once fully awakened, her weapon will have 4200~ attack, Supplemental Damage V, and Sigil Booster built in",
            "It's just pure RNG how they drop and you can't upgrade them (yet, might change in 1.3).  Transmarvel and curio have better rates",
            "Immortal Pain skill + his Poise character sigil + Quick Cooldown and/or Cascade. IP should be up for most of the fight.",
            "300k+ is very high.  100-150k is what I usually see in Lucilius, and I *have* seen 400k-500k in easier punching bag fights like the fire dragon, though it's still rare",
            "That... doesn't sound right. According to [the spreadsheet,](https://docs.google.com/spreadsheets/d/1RnNLfdqFCW7zWvfHnQsNRJoi7EtIjdOUg-uYB0xsZHQ) Only 1 Stamina puts him *way* below cap on a lot of his kit, even if you don't have any cap increases on your overmastery nor any Luci sigils. *With* Overmastery and Luci sigils he'd still be below (but very close to) normal cap running Stamina and either 1 Concentrated Fire, 1 Life on the Line, or 1 Tyranny. If you had 1000 Attack on an overmastery roll that would push Stam + [insert other good sigil] to cap, without the 1k attack you're looking at Stam + Concentrated + Tyranny or LotL to normal cap, assuming any mix of good overmastery or Luci sigils. And all of this is assuming he crits.\n\n> I just wanna make sure, since he has now max Terminus Weapon\n\nJust to be clear, are you also saying that you've done the full awakening on the Terminus weapon?",
            "I think you're meant to drop rifts near the boss and enter them to stun him.  It's definitely a mess of a fight and I have no idea when you're supposed to leave, but I just leave when the boss starts doing something else after the stun ends",
            "Getting all your terminus weapons is a pretty big deal, but you can also work on awakening the one terminus weapon you have (if it's a character you play).  You can try to fight Behemoth (it's much easier than lucilius and has absolutely fantastic sigil rewards) but it'll be really rough\n\nI would try to max out the terminus of one character you like and then go online for some Behemoths.  Lucilius is the best source of Azurite's Splendors (maxes out a sigil), and two Gamma sigils may be worthwhile to aim for eventually, but until you get comfortable with the fight, you'll probably want to invest in a Flight Over Fight build (easiest and effective with Lancelot)",
            "Assist is only for expert and below.  For maniac and proud, you'll want to start making your piloted character beefy as hell while throwing all your damage on your AI party members",
            "For Fast Learner it only applies to the character that has it equipped. (When leveling some characters I noticed that the one with fast learners equipped hit 100 much faster than the other).\n\nFor Path to Mastery I don't think it matters who you have it equipped on in your party. It should boost quest reward MSP either way. The sigil just says it \"doesn't apply to other **online** players in your party\". But offline with AI characters you're good (or online with it equipped to whoever you're playing as)",
            "You probably want to ask this in a community for the mobile game, not the community for Relink.",
            "Yes it worth it since it stacks with Supp V sigils (altho not with her skill Pink Petals, but theres an interesting interaction with it but i won't dive too deep into it lol), sba gauge gain reduction doesnt affect sigils like nimble/precise wrath which is why most ppl recommend running these alongside. If it really bothers you, just don't run it because using sba is one of the best CCs to stun lock a boss.",
            "> Are builds specifically for AI companions still generally optimal if played manually?\n\nNot at all. AI builds typically lean into specific skills (or lack thereof) with abnormally high natural damage caps and then stuffing a preposterous amount of damage into the character at the cost of almost everything else. They also rely on the fact that, in most fights, the AI are absolute masters at perfect dodging, which is what makes Nimble Onslaught 30 so valuable.\n\nThe AI builds are going to lack a lot of the utility and/or survival that a player character is going to need to be effective *unless* that player is nearly perfect at avoiding damage. Things like Improved Dodge (or Guard) and Potion Hoarder are practically required on a played character and useless to the AI. 1 Nimble Onslaught is good for a player, 2 is somewhat overkill. Glass Cannon is a very risky add because the punishment for mistakes gets way higher.",
            "The two things that apply after damage cap are elemental advantage (war elemental) and enhanced damage (warpath sigils).  In all other cases, as you add more damage cap sigils, you will also need to add more damage sigils to keep hitting it.  \n\nBy \"final damage multiplier\" I'm guessing you mean skill ratios but that's just how hard it's gonna be to cap the move when compared with its manually defined skill damage cap.  Skill ratios aren't actually going to affect damage cap at all.",
            "1-4, if you don't open a party up for randoms to fill the remaining space, then the party leader's AI companions will occupy any unused slots.",
            "The game gives you the materials, go to treasure trade at knickknacks and to trade for the crewmate card, and then unlock it under the crewmate unlocks menu at the same store",
            "sick!!! im slowly doing the story since the game released on steam, banger game",
            "While that is true in terms of gameplay hours, and I'm only in Very Hard, so lemme know if this changes, but it's basically just reskinned (as in different element types) of the same bosses over and over each difficulty increase. Outside of maybe a spoiler fight or two, are there any actual new enemy bosses post-game?\n\nIt's definitely a 50+ hour game to max out just one character, though I imagine each subsequent character takes way less, but if people are wondering, I don't think it's like Monster Hunter in that you have that big of a variety of bosses to choose from as the game keeps going. I hope they add more later and they probably will, it's just not there yet, afaik.",
            "sick, i want to scratch my pso1 grind itch",
            "Perfect answer.  Im happy now. Lol",
            "Oohhh nice. Thank you!",
            "Ahh okay! So then I’ll keep pushing through the quest levels until I hit maniac then. Do you recommend leveling masteries for one character at a time to the cap? Or should I split the masteries for my party?",
            "Appreciated",
            "Ohh okay.. i dunno about that stuff \nTy for the reply",
            "It's not percentage damage , it's 'capped' at percentage.\n\nThe damage is 2x your atk stat and caps at somewhere around 1-1.5% of the monster's HP, though most boss that matters would have too much health for you to hit that cap realistically (my Rosetta for example do ~41k per tick with poison atm, so she'd need boss with less than 40-60m HP to start seeing dips, and most of those would likely explode in seconds anyway)",
            "I appreciate the advice!\n\nYeah turned out that I just had a couple not so great AI party members.  Swapped out Rackam and Rosetta for a couple others and suddenly it went from \"feels like it's literally impossible\" to really consistant clears.  Now almost done with getting everyone's Terminus weapons!",
            "Ooh ok ty",
            "thanks so much for the answer dude I really appreciate it. Answered everything I need to know and just in time to play tonight!",
            "While the Skydwellers know Estalucia as the \"Island of the Astrals\" and have their own utopia-like mythology about it, it's explicitly _not_ the Astrals' homeland. The Astrals were created in another dimension known as the Astral Realm and retreated there en masse after their defeat in the Astral War five centuries ago.\n\nTo add some vague-as-possible mobile game context to Relink's postgame notes, Estalucia's true identity is >!the Holy Seat of Genesis, which exists outside of time as the home of the Omnipotent, the creator of the two dimensions in Relink's story. Lilith's endgame is to use a sliver of the Omnipotent's original power to no-clip outside of reality so she can attack and dethrone God. There are a _lot_ of reasons why this plan would not have worked, but I guess you can't fault her level of ambition.!<",
            "I figured as much but wanted to be sure. So if I'm reliably hitting cap already with just Stamina/Tyranny I probably don't need any more crit.",
            "Ahhh! Thank you for the intel! Looking forward to the 9th! ",
            "okay thank you",
            "oh i found out that its a setting in settings to make the ai ult before we are able to full burst, pretty sure the communication wheel one is just they wont ult until i ult.",
            "Damn. And with how many potions everyone gets and no unavoidable attacks healers aren't really mandatory.\n\nIt just feels like everyone just has to unload all their damage and theres no cooperation necessary or strategy. Team buffing doesn't seem that good either since it seems most finished endgame builds are right around the damage cap anyways. \n\nAre there different meta picks depending on the bosses? We have dispels, cleanses and veil but i barely saw anything that would need those so far",
            "wasnt aware of what the cap was but im playing Narmaya so i should be fine, i do have Potion hoarder as well, was just thinking of some passive hp gains is all.",
            "alright thank you",
            "Playstation copies of Relink come with a code that can be redeemed in the original GBF gacha game for a bunch of free stuff, PC players unfortunately don't get a code. I'm not sure how it works but assuming it's the same way GBF Versus did it then it's just a menu option somewhere in-game that shows you your code.",
            "makes sense thanks for the tip; we like doing the side quests so we’ll probably do all the low level missions at least once for fun but focus on getting to the higher levels.",
            "Thank you, I'm missing the +1 from Fully Awakened.",
            "They do, but they'll usually follow your lead i.e. if you derp and don't go to a cannon they likely won't either.",
            "Okay thanks.\n\nI don't suppose you know anything about what Lancelot may want with whatever slots are left?\n\nOr is it more a personal choice QoL thing?",
            "Thank you🙏",
            "Sounds good! I was worried the game was gonna be kinda short but looks like I have a fair bit to look forward to",
            "Thank you!",
            "Thank you so much, I usually see which one is better so far, so I don't know if it stack or now, now it more clear",
            "Huh i discounted them because of the weird slime person avatar they were using. \n\n\nGuess I'll give their content a shot",
            "Is it really that serious of a fight though? With some garbage AI players, I was able to get him to around 36% and only end up dying because my AI can't do some of the mechanics well and I end up getting 1 HP after awhile. It finally has motivated me to equip them properly and upgrade their weapons lol",
            "Oh man, I thought they had more games. Makes sense. I guess all we can do is hope. :(",
            "Cool, thanks. Weird I couldn't find it on any web or it hasn't dropped yet. I'll keep trying. Thanks!",
            "Oh I knew it worked against Non-Elemental enemies, but I just wasn't sure if it kept the damage bonus or not against an enemy that the character you're playing already had natural advantage against.\n\nThanks.",
            "Yea they ended up reinstalling the game yesterday and that seemed to fix the problem!",
            "Everyone still uses normal dmg cap unless you already have all supp V+. \n\nWhile having some luci sigil is good, if you are giving up stuff like quick cd, potion hoarder, improved dodge, or uplift for it, you're losing damage, esp party damage.\n\nSpread sheet damage is pointless, esp the very small return on max dmg while losing tons of useful utility.",
            "not there at all",
            "nice, thanks!",
            "Yea I got alot from farming centrums and other things to the point its kinda hard to scroll down. Thanks for the tips!",
            "Ahh no ive never played",
            "Where can I get that Flight Over Fight sigil? I've looked at every stages drops and couldn't find it. Gamma is the one from the Sierokarte shop right? Sorry if I'm asking too many questions I'm still relatively new \\~70hrs and only got to Lucillius by supporting carries with tank-stun build, kinda wanted to dip a bit into dps but I just can't seem to survive hits to not be a burden.",
            "oh wow thats neat, thanks for the info, guess i'll I have to take out stamina in all my builds for Lucilius",
            "Yeah I’m hitting that cap I also have supplementary damage and critical I just didn’t know how many I should go up to I’d imagine the terminus attack is even higher",
            "Might check what region I'm set to then,  but I'd probably be Oceania if that's an option,  others I have no clue",
            "Should I go all the way to 15 or just to 14 and rely on the +1 from sigil boost on max awakened weapons?",
            "Ah. Yeah I've been playing her and see what you mean, hopefully her numbers get reworked. Still, I've been playing her in the normal way and it's very funny, esp as the tipper multiplier seems to be 2xing her dmg.\n\nI suppose I'll try and brute force make her work as she's the only one I've tried so far that doesn't feel monotonous to play (as long as I'm playing her unoptimally), but I'm still yet to unlock everyone so hopefully I'll be eating my words. \n\nTy for the help though, who would you say is top meta atm, or is there too little variance at endgame it's not too significant?\n\nEdit:Narmaya seems interesting as the stance change mechanic I like, my background is in the FGC so that seems pretty on point",
            "Nah Ty! I've low key always wanted an excuse to play him as I love his design lol, I'll try him out too!\n\nAlthough I have my own gripes with IG (why are the most damaging combos on the ground ahh) it is my second most used weapon after Bow in MH so I went for Zeta, something though just didn't click though after getting the timing sequence down. That was super early game though so hopefully I can revisit her soon.",
            "Oh so you get Arvess Hammer after a single loop instead of three??\n\nOh my god you do!!! Wow thanks, I knew there had to be more to her special link time skill than “every attack counts as perfectly timed”.",
            "What if I’m the one starting it?",
            "What do you mean by that?\n\n\nI’ll do special attack and it’ll fizzle then I have 80%\n\nWhat did I do wrong?",
            "I swear the item I'm capped on doesn't appear in the sell list. I've definitely tried to sell it and couldn't find it on the list of sellable items. I will check again later though.",
            "You mean like roll until you get the vit wrightstone and then reroll to see what it becomes again, or like just roll and see if you get a vit wrightstone, and if not, reload, do mission, repeat?",
            "They had just gotten to Maniac; hitting 200 slimes even with full gear and on online isn't guaranteed.",
            "That's good to know. I'll do it so I'll buy this final crewmate card",
            "I didnt know about it. I'll try it then. Thanks, have a great day",
            "Really? I thought I read people saying they do have Warpath+?",
            "Thanks. Damage increasing sigils but not attack sigils? I read somewhere that attack sigils are mid.",
            "cool, thanks!",
            "Thanks! I'm at work so can't check, but are the Warpath sigils difficult to craft in terms of the materials they require? Approximately how long farming would it take to craft 1?",
            "> Also as a side note- you only have to level up lucilius sigils to 14, because sigil booster lets two level 14 sigils cap at 30. Saves a couple of tears\n\nFor what it's worth, I recommend upgrading to 15 and 13 rather than 14/14. That way *if* you do any changes to your build, like dropping a duplicate Luci sigil, you keep the lone 15 equipped to get the most out of the single slot.\n\nLike, say you're only going to grind up 2 of each Luci Sigil. It's better to have 15 Alpha, 13 Alpha, 15 Beta, 13 Beta, 15 Gamma, and 13 Gamma than it is to have them all at 14. That way you can run Alpha Beta Gamma Gamma and still get the most value out of the single Alpha and Beta. Or if you want to do something like Alpha Gamma Gamma or even Alpha Gamma to leave room for some regular Damage Cap V+ for utility slots, you're aren't shorting the lone sigils.",
            "Oh Lord, not Lucilius, no, this was against Behemoth. I'm still pretty bad against Lucilius (I only do solo runs which makes the trials slower enough to drop DPS), but I believe I had around 100K something against him.",
            "Yes, my Terminus Weapon if fully awakened lv 10. When i fight the training dummy all of my skills have that new animation when reaching the damage cap. the number and yellow X flash.  \nI was just curious of damage cap, because of the new quest that drop sup.damage i have now 4x damage cap/3 sup.damage, 1 stamina, war elemental and 3 defesive sigils equiped.  \neven when i replaced the 3 defensive sigils with tyranny/ 2nd stamina, and Concentrated Fire, its always the same damage cap numbers.",
            "Thanks, I’ve kinda of suspected it.\nThat means that slimpede has to be done manually every time which is not optimal. \nWhich is the best auto quest for mastery farm?",
            "> The AI builds are going to lack a lot of the utility and/or survival that a player character is going to need to be effective unless that player is nearly perfect at avoiding damage.\n\nFirstly thank you. But yeah I figure that would the case after reading notes on some the guides about AI being able to perfect dodge.\n\n> Things like Improved Dodge (or Guard) and Potion Hoarder are practically required on a played character and useless to the AI.\n\nNoted!",
            "By final damage multiplier, I mean I think I read somewhere a sigil had a 50% final damage multiplier in exchange for improving dodging somehow. \"Final damage multiplier\" was the wording the person used, so I wondered if it was as catastrophic as effectively halving damage cap.",
            "Good to know, thank you",
            "There are 3-4 difficulty tiers after you clear the main story, along with unique bosses, mechanics, systems etc.",
            "There's 23 \"unique\" boss in endgame + a few reskin (example : Dark version of bosses with different mechanics on Proud) and boss fights where you have to fight 1-3 bosses at the same time\n\nFor what it's worth it's a bit less than what Monster Hunter World had a launch (like 32)\n\nThere's plan for a new boss in early march so there's that, hopefully they keep adding new unique bosses to the game",
            "One character at a time (probably your main) if you're planning to play online since you only need one character in matchmaking lobbies. Otherwise splitting the masteries for your party isn't too bad. Your main might change a few times before you settle, or you'll always have a few you enjoy playing anyways. \n\nI'd recommend at least getting your controlled character's sigil slots (honestly takes \\~95% of the tree to achieve unless you skip a lot of nodes) once you reach maniac and unlock the final part of the tree. You'll unlock the Slimepede mission in maniac that helps you farm EXP and mastery points very quickly too. And any other quest at that point will get you 1-2 important nodes per run so it's just a lot of grinding from there.",
            "Yep.",
            "[deleted]",
            "People can hit cap on 'normal' attacks pretty easily, but normally SBA is hard to hit cap with so if you have any attack buff that's usually the time to do it. There's also certain builds that just have high cap attack so any amount of attack to help them push the cap is good (Ferry's jump loop, Rackam jump shot, etc)\n\nThere's no boss-specific meta character, but some boss do make certain things better/worse. For example Rosetta's rose are grounded so they have a hard time hitting flying enemies like griffin/eyeball, or bringing debuff immunity makes ice bosses much easier to handle.",
            "Only Lucilius will really shake the meta.\n \nAs it is, everybody already perfected the timing reactions. I can literally press the skills even before Proto executes the claw attack taking in consideration the delay of my character... that is how much I've killed it.\n \nIronically, right now only fight truly stressing is Gallanza & Maglielle.",
            "Anytime!",
            "Lance is one of the few characters (along with Yoda) that is completely realistic to run Glass Cannon for even higher cap.\n \nAdd auto res for utility, 1x crit chance to complete the 100% rate and 1x combo booster.\n \nAnything from here is just your preference.",
            "Yep, depends on your appetite for grind, the good news is while weapons and overmastery can't be moved between characters, most characters will share 9-10 out of 12 sigils, making it easy to change mains to try new playstyles.\n\nWhat I did was finish my main, then grind another character. When that was done, swap to that character, and then use that to grind the next one, et cetera.\n\nWas fun and let me try and master a lot of chars. I'm at 200 hours in and have 5 characters built.",
            "Vtubers are still real people behind the model; in fact, they're _more_ likely to know about a game than a regular \"flesh\" streamer haha",
            "AIs are godly at dodging so you almost never have to deal with them going down.\n\nPeople are...much easier to die. So while with good players you can do mechanic faster + have better damage overall, with bad players I hope you love seeing those red circles of someone licking the floor.",
            "Technically they do have more games, but as far as I'm aware almost every other Cygames game is a gacha game and balance adjustments are very different in those due to the whole \"not wanting to piss off people who spent money for characters\" thing.\n\nI was only thinking about the GBF games when I made my previous comment, but even including everything else they aren't making any other games that are in a remotely similar genre.",
            "Basically, you got to hunt monsters/enemies, each one leveling in difficulty. They drop materials to help you level up your character via gear. There are lot of characters to chose from and customize. Before tackling a enemies, you must prepare your character since enemies have elemental weaknesses, the game has RPG elements like crit rate, attack up and the like. \n\nI’m at chapter 3, it’s faster than MH and the combat is more action. I’m enjoying it.",
            "There are a bunch of sigils that can only be obtained as random rewards from Curio boxes, and Flight over Fight is one of them. You'll just have to get lucky with them.",
            "As high as you can (up to 65 lvl in damage cap trait itself) as long as you still keep hitting that cap.",
            "14 should be good yea, as long as you're hitting 65 total levels, you're fine.",
            "Yep, that's really the bread and butter of Zeta's Link Time. It's prime time for her to dish out disgusting damage. Enjoy ^^",
            "Depends on which 'attack sigils' you're talking about.\n\nThings like Stamina/Tyranny that increase attack by % are fine, but the flat attacking increasing white Attack trait is weak.\n\nDamage cap is usually the main limiter on your damage.",
            "Oh, Flight Over Fight?  It cuts your attack multiplier significantly (it seems multiplicative vs gains to attack multiplier?), but you can get around that by stacking more damage sigils.  It essentially halving your attack, but it's not touching the caps.  Very viable sigil on some characters",
            "Awesome! Thank you so much for all of your answers and advice! Have a great day!"
        ]
    },
    "Future content ": {
        "title": "Future content ",
        "score": 8,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dln0gr/future_content/",
        "content": "Anyone got any ideas on what the future holds I that seen relink will be at anime expo 2024 and im just curious or wondering if anything new is bound to come out ",
        "num_comments": 4,
        "comments": [
            "Simply put, we don't know. They have basically stated that 1.3.1 was all they had planned, but they MIGHT, keyword MIGHT do more.\n\nI wouldn't expect more than paid DLC characters at this point, if anything at all.\n\nRelink at Anime Expo seems more like they bought out the slot to demo the Shadowverse and Umamusume games, but decided to put up some Relink demos with Seofon, Tweyen, and Sandalphon unlocked to try to garner some more sales.",
            "Unlikely. Relink isn't carrying its own presentation or anything, it's a Cygames booth and it it's one of their recent cult hits so relink is gonna be there on the floor which makes sense, and does not suggest there's going to be any kind of unexpected announcements.",
            "I’m personally hoping for a Balanced graphics mode on ps5",
            "Honestly I would say it’s like a 50/50 chance of there being announcements"
        ]
    },
    "Ok can anyone else agree that this games PS5 version really needs a balanced graphics mode?": {
        "title": "Ok can anyone else agree that this games PS5 version really needs a balanced graphics mode?",
        "score": 2,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dlpn6g/ok_can_anyone_else_agree_that_this_games_ps5/",
        "content": "The game plays great on performance mode but just looks really blurry and graphics mode looks good and all but locking it at 30fps has really bottlenecked it. I just feel like a balanced mode would really benefit this version of the game. I mean other anime games have managed to pull this off. Genshin Impact for example. That game can run at 4K 60fps on console so I don’t see why the devs for Relink can’t work on putting in a balanced mode in the game that runs at like 1440p 60fps. It just seems like they aren’t really taking advantage of some of the PS5s capabilities",
        "num_comments": 3,
        "comments": [
            "Yup, I agreed with you on this. An RTX 2080 which is equivalent of PS5 gpu can actually do above 60 fps max settings at 1440p. So there is no reason why they put such restrictions on PS5 version.",
            "I agree. I play in 4k 120hz monitors, performance mode look like shit while graphics mode hurts my eye because of 30fps.",
            "The only reason I have mine set to performance is because of the fps and yeah the graphics in performance mode are indeed crap. They should’ve just had balanced mode right from the start"
        ]
    },
    "In defense of buffs and debuffs": {
        "title": "In defense of buffs and debuffs",
        "score": 9,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dlikfy/in_defense_of_buffs_and_debuffs/",
        "content": "I believe that people who say that ATK up/DEF down are useless have never experienced the pure, unbridled joy of 5 million damage from Paradise Lost. \n\nIt's a gimmick build for sure, but with an atk buff and DEF down on the enemy, SBA's hit way, WAY harder. I mean it's significant. It depends on the attack scaling of the SBA in particular obviously but DEF down is always useful.",
        "num_comments": 4,
        "comments": [
            "Back in 1.0 there was a funny 6.3m SBA Io build, dunno if it survived the tide of time, some SBAs are just like that (mostly the ones that have a lot of hits in them)",
            "I admit i didn't see DEF buffs having any value till the 1.3 boss rushes were added, played with a rossetta who kept DEF on the entire time and had a seigfried who spammed his party DEF buff, all those 1 shot sneak attacks from bosses only hit for 18-25k, makeing it easier to not get sniped off screen.",
            "my AI team noticeably does better whenever I main cag and keep the 30% def shred up. unfortunately, her AI is shit at it.",
            "OP is referring to defense down, not defense up. Defense up is as useless as the player is good before even factoring in the utility. That's only really good for very few things, like Zathba where offscreen nukes exist."
        ]
    },
    "Thinking about getting the game, did I miss the boat?": {
        "title": "Thinking about getting the game, did I miss the boat?",
        "score": 22,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dkvf46/thinking_about_getting_the_game_did_i_miss_the/",
        "content": "I saw it’s on sale (ps5) and tried out the demo, had a lot of fun. But I tried like 5 times and  can’t beat the golem nowhere near the three minutes for the bonus goal.( Any tips would be appreciated.)\n\n So I tried going online and had no luck finding anyone to help. Now I dunno if the game has an sos flare equivalent from monster Hunter world or how matchmaking works ( or maybe demo online is only with other demo people ?) With all that I wondering the likelihood of finding help with some of the harder missions the game might have, or is the player base pretty much gone? \n\n\n\n\n\nThanks :) \n\n",
        "num_comments": 27,
        "comments": [
            "This is a game where you can solo grind and become so powerful that it literally doesn't matter if you have anyone to play with or not.\n\nStarting Bahamut runs and anytime new content comes out is about the only time its beneficial to have others play with you",
            "Anything that isn’t high level will be a struggle to find anyone",
            "You'll find people in endgame quest.\n\nIf you want to find people to help use the sup discord",
            "I believe the demo only allows you to join other demo players, which at this point likely has a dead online presence. Even if there were some playing it, I doubt they're gonna bother trying to queue for the S++ on the Golem cuz you don't need it to get all the demo rewards. \n\nThat said, if you want the S++ anyway, I recall a really old post just before launch showing a player achieving that using Charlotta as their character. I don't remember who they used for their AI party members or their sigil setup but looks like it's possible. Good luck.",
            "don't worry about the quest bonuses, you can come back later when you're stronger.",
            "It’s a primarily single player game. Even at launch, you’d only easily find players online quickly for the top two difficulty levels of quests. It also doesn’t have crossplay, so you’re playing online with players only on your platform.\n\nThe AI is good in this game and you can do most of it with your AI team. It’s a great game. Pick it up. It’ll be worth your time if you’re interested.",
            "I've played for over 50 hours and I've never gone into multiplayer, you don't need to and honestly you probably won't even want to unless you have friends playing",
            "Ive had the game for ages yet I would still ask the same question as OP.",
            "It’s pretty fun - but you need to get past the story solo. Matchmaking is an absolutely trash heap candidly - unlike monster hunter which does this well - GB for some reason just takes forever, and has loads of menus to load in for a 5-10 min match. \n\nResults may vary - could have been a very “meta” style game but kind of fell short - hoping they improve the formula in the future as combat is fun as hell.",
            "You can solo with AI through most of it save for the few later endgame missions. There is a currency locked behind co-op with randoms though, which stings a bit when you need to grind for mats faster.",
            "you are not suppose to achieve every mission goal at the time you first unlocked the mission, especially some of the earlier ones are pretty much impossible. Fortunately, the game doesn't lock anything out. You can go back and replay them when you are stronger",
            "I would recommend getting it, its really fun and theres so many characters, youll never get bored. If you need someone to play with or need help, hit me up!",
            "From personal experience, if your PS5 network connection is on NAT type 3, it's very hard to match up with other players online, even at endgame. Some people with type 3 can still link up, but others (like me) have had no luck whatsoever in connecting with other players. I've never played with other players lol. It always returns an error and kick me out of online play. That said, it's still very viable and fun to play it fully single player mode.\n\nThere are multiple guides online on port forwarding routers and such to help change to type 2, but I didn't bother.",
            "I played the entire game and postgame solo, just takes a bit having to level up your other characters. The AI is crazy good at dodging in this game.",
            "Absolutely not it's worth every penny Full price so on sale is great! Can easily solo 90% of the content then end game is doable solo but there will be people still online doing that for some time now.\n\nThe story mode aspect of the game is actually really fun and pretty much should only be solo anyways unless you had friends you were depserately wanting to play with, then once the story is complete then the game.kind of starts on the more monster hunter aspect of the game, again can be done all offline! \n\nI'd recommend for sure.",
            "Yep. You pretty much missed the wave.",
            "It was always like that tho",
            "As a brand new player who bought the game on this sale I find quick play matches in seconds at any time of day. As for specific content, yeah that will be difficult it seems.",
            "Always a great feeling to need to use third-party resources outside a game for it to be fun. Can't just hop in and play; need to get into a chat room first. If the AI wasn't so shit on some fights you wouldn't have to play with anyone online and would simply miss out on faster clears. I don't expect or want AI to do their rotations better than geared and skilled humans but they shouldn't be so shit on some fights like Baha, Ice and Wind, and any of the quests from the last patch.",
            "Got as close to 5 minutes before giving up. I figured it’s not possible solo or something. Even though I bough the game I’m gonna figure out the best method and come back to it.",
            "I got it lol looking forward to getting started in it. I figured the ps5 probably has a larger player base than steam.",
            "Good to know this, I see a challenge and I must accept it lol.",
            "I did get, it’s super fun so far.Excited to get into it. Thinking about grabbing the Valkyrie bow lady for a ranged character even.",
            "Oh also I don't think the demo online will share the same sever as the release game I'd imagine the demo servers are dead.",
            "It's completely possible to beat a golem in the time limit solo  (for example I kill it in 4 seconds without having to hit a button because of my ai team)Many of those side goals can't be completed when you originally get the quest because you don't have the levels/sigils/masteries to be strong enough yet.",
            "It’s usually the other way around. Multiplayer games tend to attract pc players more than consoles do.",
            "Shes pretty good and i think she came out not too long ago, shes actually one of my favorites"
        ]
    }
}