{
    "Anon hates the metric system": {
        "title": "Anon hates the metric system",
        "score": 2041,
        "url": "https://i.imgur.com/m1xTQKW.png",
        "content": "",
        "num_comments": 219,
        "comments": [
            "How wide a street is is determined by how fat a roman horse ass was",
            "It's always Americans that bring up how imperials is \"sensible\" and has \"everyday object in it\", but why is a yard 0.9m?\n\nMy backyard is a few yards big, doesn't make sense at all.",
            "So the modern meter is actually based on the distance travelled by light in approx 1/299k of a second so I’d say it’s based on real things",
            "If the metric system wasn't sensible, why do all high IQ department of the american military complex use it over the american one?",
            "anon is not a part of metric chads",
            "Cope more ameritards",
            "The current imperial system is defined by the metric system. Else someone would need to keep a pefectly sized stick in a vault.",
            "the metric system is based on the size of the earth",
            "A benefit of the metrical system for single men is that you only need to be 180cm to be considered \"tall\" while in the imperial system you have to 6 ft (183cm). Just to have a round number.",
            "Anon is highly regarded, the imperial system was implemented by the British empire, which was a replacement of the previous system.",
            "Anon weights 4 baby elephants and can't even walk a distance of 7 cocks without fainting.",
            "Why is a foot this long? I don't know anyone with a foot this long, my feet are huge and they're still a cm off.\n\nAnd most of the units are straight up nonsense because they lost all meaning from the past. A mile means a thousand because it was a thousand paces, which is a barely used unit now and means a single stride (again most people have much smaller strides so good job again) but a modern thousand paces are much smaller than a mile so a mile has no connection to the real world whatsoever.\n\nAnd Fahrenheits are really funny because DG Fahrenheit was a hack and a fraud and neither 0F nor 100F have any meaning as he couldn't do anything right.",
            "Americans really don't know that their scientific community, their industries, their military and other american key sectors already use (and are required to use) the metric system. It's only the common folk who are too stubborn to be convinced to switch to what the rest of the world is using...",
            "Then there's places like the UK that use a bit of both depending on the thing they're measuring",
            "ameritards and their feet fetish, to make matter worse they used it as a measuring system",
            "I'd say Anon sorta has a point in that e.g. the meter's definition is quite stupid (idgaf what you think  \"1/299792458 of the distance light travels in a second\" makes no practical sense).\n\nThe problem with the imperial system is not the basic units (which are themselves defined in terms of the metric ones lol, a foot is officially defined as  0.9144 meters but ok let's say you could come up with a precise definition), it's the fucking stupid conversion factors like \"how many inches are in a foot\" that make no sense at all like dude ffs just choose one unit and work in base 10 with it\n\nEdit: I never said we should go out of our way to change the metric system nor that the imperial system is somehow superior to metric, you fucking baboons, I'm just stating that for once Anon has a point, even though his conclusion is stupid and the imperial system does suck ass.",
            "They're British measurements (apart from volume) and in Britain we have metric and imperial as a hybrid.",
            "Ah yes because it's well known all spoons and feet have *exactly* the same size across the entire fucking planet",
            "Shit, if adapting things from ancient times was proof of quality, we might see a resurgence in using dragon bones with your tea and letting leeches suck your blood to cure spiritual malaise.",
            "It’s not like teaspoons aren’t used in metric countries to measure stuff, for example when baking. I don’t recall any recipe ever saying “put 15 ml of baking powder”. \n\nWhen it comes to baking etc. it doesn’t usually matter if my teaspoon is slightly different size than some other teaspoons.",
            "If you love imperial so much, tell me. How many furlongs are in a nautical mile",
            "should i divide by ten and just remove a fuckin zero or  remember 796369724 is the factor for ten thousand?",
            "American measurements?\nI guess the UK, Bahamas, Belize and Myanmar just stopped existing\n\nI know it’s ragebait and I don’t care",
            "Saying my cock length in inch’s sounds right thou",
            "1 meter = 1 10 millionth the distance from the equator to the north or south pole (ie based off a real thing that actually exists and id tangaible.) All other metric distances are multiples or divisions of 10 (being the number of digits most people have, so a real thing that actually exists and is tangiable, as well as super intuative\n\nAnon should probably know what they're talking about before talking shit like an artistically regarded fuckwit",
            "![gif](giphy|Ez01FtPZuFYVa)\n\nWTF IS A KILOMETERRRRERRERR",
            "Ya using an imperial measurement from 2,000 years ago. Btw it's not an American concept and the only reason we used it at all was in spit of the British. Metric is more accurate and more easy to grasp it's also why most tools today use mm instead of fractional tools that are less specific and can't be small enough in some cases or large enough.",
            "Erm, actually...",
            "Meters, kilograms and Celsius are all based on properties of water so…",
            "My favourite is fun and useful measurements for everyday objects like \"three sixteenths of an inch\", so intuitive",
            "Americans use both but the difference is that distance is measured in imperial (e.g. miles), all the street signs are in imperial so we just roll with it\n\nFor precision measurements and scientific stuff we use metric\n\nBelieve it or not we *are* taught both imperial and metric in school",
            "Sorry Anon, I don't speak wrong. Metric was one of the 2 things I am grateful to French for. Second one is pasteurization.",
            "When your measurment system is so good that any argument in its favor looks like trolling",
            "Still using archeic measurement system because ship got sunk while crossing Atlantic 200 years ago , claims its superior. Yikes",
            "American 1",
            "The reason America doesn't use the metric system is because after WW2 when many English and European factories rebuilt and remade all their tools in metric there was no need to remake American factories and redoing the tooling was an expense no one wanted to do.",
            "The imperial system is handy for \"close enough\" stuff. 1 cup? About this much. Into the pot. Tablespoon? Something like this, into the pot. Do that a few more times, and the chicken dip is complete, it's going to be delicious.",
            "The imperial system is handy for \"close enough\" stuff. 1 cup? About this much. Into the pot. Tablespoon? Something like this, into the pot. Do that a few more times, and the chicken dip is complete, it's going to be delicious.",
            "bro does know that the metric is based off of the Earth's circumference, making it, effectively, a universal measurement on Earth?",
            "Do you prefer a base 10 or base 12 system? There, I’ve solved it for you, have fun. Neither is better or worse.",
            "The one imperial unit I will die defending is Fahrenheit. 100 degrees is a very hot day, 0 degrees is very cold.",
            "Only way is the American way",
            "Same with rail gauges",
            "Yard comes from old English gerd or gyrd, it just meant a stick that’s about 3 feet long",
            "Also they fail to comprehend the rollercoaster of size differences where the inch in comparison to a yard or a foot is fucking ridiculous.\n\nMetric every step up is comprehensible\n\n100 cm is 1 m\n1000g is 1 kg\n1000ml is 1 l",
            "Because it's 3 sizes of some kings foot unlike arbitrary French nonsense",
            "If the imperial system is so superior why do they measure things in everything EXCEPT their units?\n\nRefrigerators, swimming pools, elephants...",
            "That's why I use the superior cubit",
            "Well why does .9 meters = 1 yard?",
            "That sounds like something a French redditor from 200 years ago would say.",
            "The meter was originally created as a portion of what they thought was the distance to the earth's core. It's only when they realized their intial calculation was wrong that they changed it into a portion of distance travelled by light per second.",
            "hate to be that guy but ummm akschually 1/299mil",
            "Thats the most 1800’s french redditor shit I’ve ever seen.\n\nHow does knowing that help you in everyday measurements? A teaspoon is the amount of liquid it takes to fill a teaspoon. A meter is the distance that light travels in 1/299k of a second, how the fuck does that help anyone",
            "They use it for interoperability with allies. It started in WW1 when American solders needed to use French maps of the front so they adopted metric for distance, then in 1957 the military switched over to full metric because of NATO STANAG requirements",
            "Does Chad use metric tho",
            "I think many people forget, if the americans change to metric, we will lose so much meme potential.  \nIs the advancement of a single country really worth that much?",
            "They use metric anyway, they just don’t know it \n\n“Various definitions have been used; the most common today is the international avoirdupois pound, which is legally defined as exactly 0.45359237 kilograms”",
            "What the fuck did you just fucking say to me you little bitch?",
            "You just like your system because basic math is too hard for you. I’m sorry that you can’t multiply and divide by 3, 4, 6, 12’s without making numerous errors. \n\nIt’s best you stick to your simpleton measurements. We couldn’t risk you failing 2nd grade math.",
            "And the kilogram is based on [this perfectly sized thing](https://www.atlasobscura.com/places/le-grand-k) kept in a vault.",
            "Wrongly though",
            "Nope. Most people are pretty aware. “Common folk” aren’t being hard headed. It’s just not a feasible thing that they can change as individuals. Plus not really a change that would grant them great benefit.",
            "I don't know about all industries, my industry (civil engineering) still uses US Customary units for everything",
            "Carpets. Metres and millimetres.\n\nDistances between towns. Miles.",
            "We use imperial because we're fluent in multiple measurements. You use imperial because it's the only measurement you know. We are not the same",
            "The metres definition is not to make it more tangible, it's so all SI units can be recreated anywhere in the universe instead of basing them off arbitrary standards which introduces error. No one uses these scientific definitions in day to day life. And as you said, imperial's official definitions are based on metric anyway so what point are you making?",
            "typo: yard not foot.",
            "The definition on a meter is anything but stupid, it was changed to that because the speed of light is the one thing we're almost certain is an universal constant. Taking this definition, we're sure that everybody, at any location, or any point in time, use the exact same meter.",
            "It sort of makes sense, but it also very much doesn't. What the hell is a foot? My foot is different than yours. I wear size 13, anyone wearing like 10 or under isn't even comparable.",
            "You can also use different ways to measure out a Meter, for example a cubic decimeter of distilled Water weighs exactly 1kg. Therefore using a Weight and a cubic container you can define a Meter as 10 times the length of that cubic container.",
            ">makes no practical sense\n\nOh it makes a ton of practical sense.\n\nJust not in your tiktok scrolling fastfood eating doomer sad life.",
            "That would be because powder is measured in grams ;)\n\nBut it really depends on who wrote the recipe. I've seen both.",
            "Fun fact, most cookbooks actually define how many grams are contained in a teaspoon in the context for the book. They also define stuff like pinch, table spoon etc.",
            "No because youd put X amount of grams of baking powder in. Good job you failed at the start.",
            "Banking is chemistry and it definitely matters",
            "I think nautical miles actually makes the most sense conceptually, it's only annoying that it's divided based on 360 degrees and 60 minutes, rather than base 10",
            "UK uses metric and has since '65, about the only thing in the old system is car speeds. Bahamas and Belize use a mix of both, but you did miss Liberia which was a US colony and uses US units. Also worth nothing that there was always difference between imperial measurements and US Customary measurements (mostly volume iirc), so 'Americain measurements' does actually makes sense.  \n1 gallon in the uk is 1.20000something gallons in the US   \npints and fl oz are different too.  Belize and I think the Bahamas as well use UK gallons rather than US ones.",
            "Virgin 20 cm vs chad 8 inches",
            "It's even better: Imperial units are defined by metric. One inch is not about 2.54 cm, it's _defined_ as 2.54 cm. So americans use metric all the time, just in the most convoluted way possible.",
            "Oh really, base 12? How many feet are in a yard? Is that base 12? And how many yard are in a mile? Is that base 12?\nImperial had no base, that's why it's so disliked.",
            "Do you like decimals or fractions is also a dividing factor.",
            "But 90 degrees F is also a hot day, and 10 degrees F is also a cold day, so you still have to learn the specific numbers.",
            "Imperial makes sense how it came about. Metric makes sense for how easy it is to use",
            "Bruh USA didn’t invent the imperial system.",
            "If you want to live in hell, sure.",
            "American way? You mean adopting someone else's stuff and then calling it your own?\n\nSounds about right...\n\nImperial measurements were around before immigrants even went to America and settled there. They simply brought their native measurements with them. They're a measuring system brought by immigrants, and illegal ones at that. They just showed up with no visa or green card and started measuring stuff in feet, inches, and yards.",
            "Nah, rail gauge is based off the wheel ruts left by their chariots",
            "what a completely everyday object that isnt arbitrary at all !!!",
            "so you’re telling me its not even american? sounds about right",
            "I love how you can already tell how bullshit this actually is when you have to say \"about 3 feet long\"",
            "\"About\"",
            "Sticking out your gyrd for the Rizzler",
            "My favorite thing is that one cubic meter of water weighs 1000kg, or one metric ton (tonne)",
            "Europoor detected",
            ">some kings foot\n\n>unlike arbitrary French nonsense\n\nYou can't make this shit up lmao",
            "Not earth's core. A meter is one millionth the distance between the equator and the north pole, one quarter of earth's circumference. Theoretically, earth should be exactly 4 million meters in circumference. But the frenchies did the math wrong so their meter was a smidge too short.",
            "Because your teaspoon can be 30% bigger than mine. Its important for the units to be constant. Old unit definitions were based on physical things and changed overtime which lead to discrepancies. Every base unit of the SI system is tied to unchangeable physical laws nowadays. Besides scientific definitions of the imperial system units base on metric units anyway.",
            "That helps with precision, and that is the modern definition of a meter. The original definition of a meter was 1/40'000'000th of the Paris meridian, which is also kinda arbitrary, but at least everything else in SI is derived from that in increments of 10, which is more sensible than whatever the fuck inbred English aristocratic incest babies made up.\n\nP.S. Not all teaspoons are the same, fuckface, and scientists who dabble in precision will snap your neck when you even suggest using imperial seriously \n\nP.P.S. Ironically, the United States defines all imperial units in metric",
            "If you need a tangible object to make units like distance make sense, maybe you're just fucking stupid",
            "Because it's consistent.",
            "That might not but the conversion is in the multiples of 10 instead of arbitrary numbers",
            "That's the most 2000's Yankee redditor shit I've ever seen",
            "Ah yes cause evryone of us has the same sized foot, thats why there is only one shoe size in the world .... wait",
            "No way you tried to trash the concept of a unified system of measurement...",
            "I genuinely have 3 different sized teaspoons though",
            "It feels like a classic case of one-uppism where the former is a measurement using a widely used common implement that can be found in nearly house-hold and the other is a giga-specific measurement of something unquantifiable to the average human in a way to seem superior when really its arbitrary measurement that, sure, is *universally* able to be used (Since the speed of light is constant) but your granny ain't a rocket scientist and doesn't care.\n\n  \nIts also really funny to me when you ask a Euro's height and they say some shit like \"173.5 cm\" as if thats better and easier to visualize than 5'9 (Five, one-foot increments plus 9 inches)",
            "They also use it because when you use Imperial your Mars probe crashes:\n\nhttps://en.m.wikipedia.org/wiki/Mars_Climate_Orbiter",
            "Yes but it’s also easier to use, remember, and follows basic numerical values meaning you don’t have to use weird measurements all the time to measure things",
            "Why do you call it 9mm and not 0.0000089 football fields",
            "And why does NASA use metric then, huh?",
            "yes they are,thats why op is always sucks",
            "Engineer here to say yes, it is. So much stuff come from the US or is made for the US that every design project ends up as a weird mish mash of metric and imperial. I can’t wait for the US to collapse so we can switch to just one system.",
            "what kind of meme potential lies in the us customary system",
            "It's just like what you do when your baby does not want to eat something, you just hide it in something else they like and they'll happily eat it.",
            "https://preview.redd.it/gcomic3nc38d1.jpeg?width=1125&format=pjpg&auto=webp&s=7a61253ae60bbd85cc2acf4d63e8b2b752fc6d08",
            "I can't tell of this is a masterfully written bait or just a retard\n\nEither way, bravo",
            "Hey, remind me real quick, what system was used to get man to space?",
            "Upvote this comment if when you need to light a fire you do it by friction, and lighters are for weaklings.",
            "You probably can't read a 24h clock",
            "Either this is some serious snark, or you're a condensed ball of brain damage and stupidity.",
            "As fast as you can: how many inches are there in 5,37 yards?",
            "A kilogram is based off how much 1 dm ^ 3 of water weighs. Those weights USED to be the global standard, but ever since 2019 the standard is [plank’s constant](https://en.m.wikipedia.org/wiki/Kilogram)",
            "This is actually correct because the circumference of the Earth should 40,000km, but the guy measuring made an error and an additional 75km got added accidentally.",
            "I don't know if anyone has done studies on the economic cost of having a different system compared to the international one, but my gut tells me there is one. Considering that the last politician to propose the switch to the metric system basically lost all credibility due to that proposal, not to mention the constant online fights between americans and europeans over this dumb issue, I'm pretty sure that americans won't give up their freedom units easily.",
            "My point was that since the meter is just an arbitrary fraction of that distance you might as well choose a multiple that makes it close-ish to something to which you have a tangible reference, as it is it's just some random ass number which is close-ish to 1/10'000'000 the distance of the equator to the pole, which nobody fucking cares about. Might as well make it the whole distance light travels in a second, or a 1'000'000'000th of it just to have a nice number.",
            "Yeah lol a foot is 1/3 of that, my bad\n\n(Again fucking retarded conversion factors)",
            "I'm from the future so sorry to burst ur bubble but the speed of light has changed soz lol",
            "Dude it's not the concept of making it proportional to c that I have a problem with, it's that that constant of proportionality is just some random number which was chosen to make it sorta close to the previous definition, which was 1/10'000'000 of the distance of the equator to the pole; maybe this figure could have been useful for navigators 300 years ago but today it's just some stupid number",
            "Okay, can you explain to my TikTok-scrolling fast food-eating sad doomer brain how 1 mile being 8 furlong, 1760 yards, 5280 feet or 63360 inches makes practical sense as opposed to 1 kilometer being 1000 meters and 1000 000 millimeters?",
            "Never have i ever in my many years used grams to measure my baking powder. Its always teaspoons",
            "I’ve been baking for years and never had issues with “X teaspoons of baking powder”. Stuff raises just fine. \n\nDo people actually measure their baking powder in grams? Who even owns a scale that accurate? Drug dealers or gold merchants?",
            "We use imperial for more than car speeds in the UK. Feet and inches are used in a lot of things still, we drink pints and weigh ourselves in lbs and stone",
            "Imagine not gaving your gyrd on you at all times 💀💀",
            "Even the term 'American measurement'is wrong. The actual term would be 'Imperial measurement'. It all came from the UK.",
            ">Euro\n\n[That's quite the long shot](https://cdn.statcdn.com/Infographic/images/normal/18300.jpeg)",
            "Of course the American doesn't have any actual arguments, classic",
            "Also worth mentioning that even if their maths were perfect, it would still make sense to switch to using light speed as the basis of the meter. This makes it more precise and universally measurable etc.",
            "Ah sorry, misremembered it",
            "Which is also why napoleon is regarded as short, it’s because of that mis-math",
            "Idiots",
            "Yep. Spoons, cups, feet and everything else are all different in size. \n\nPeople having their recipes fucked up because their cups and spoons weren't the correct size for the recipe was and is a common occurrence.",
            "Its also really funny to me when you ask an Americans height and they say some shit like \"5'9\" as if thats better and easier to visualize than 1,80m (1 one-meter increments plus 80cm)",
            "> Its also really funny to me when you ask a Euro's height and they say some shit like \"173.5 cm\" as if thats better and easier to visualize than 5'9 (Five, one-foot increments plus 9 inches)\n\nThis argument is always so fucking dumb because this completely depends on which one you're using. If you use metric you know how tall 173cm is, if you use imperial you know how tall 5'9 is.",
            "Now go and Google how the yard and pound are defined",
            "0.5 burger height",
            "Chad is a land of chads then, it's official",
            "Do you want me to measure the potential in feet or hamburgers?",
            "RAAAAAAAAH WHAT THE FUCK IS A KILOMETER 🦅🦅🦅🇺🇲🇺🇲🇺🇲🔥🔥",
            "https://preview.redd.it/wgwalofcm38d1.jpeg?width=750&format=pjpg&auto=webp&s=a2055299cf01e0de2037fcb56f4d9a7b378ddaae",
            "We used a mix of both. We even used it to get a teacher up one time",
            "Lighters work off friction. It’s the metal wheel quickly rubbing off the spark prone alloy to ignite the highly flammable fumes.\n\nIt doesn’t matter either way since I just clip 2 lithium ion 9 volts together and throw it into the kindling.",
            "Why would I? There’s only 12 hours on it. Or do you need military time since AM and PM is too complicated as well?",
            "I had heard about it when it still was the standard, even tho the link does say it no longer is. Although it according to that link it seems they still go through the trouble of preserving and measuring it.",
            "Isn't that because the earth isn't a perfect sphere which wasn't know at the time?",
            "They were measuring the distance from the north pole to the equator through a line that crosses Paris, and dividing it by 10000 km. So 1/4 of the circumference. It was pretty close [for 1789](https://en.wikipedia.org/wiki/History_of_the_metre).\n\nThe circumference through the equator is a bit longer because the earth is thicc:\n\n40075.01 km through the equator   \n40007.86 km through the poles",
            "Calling imperial \"freedom units\" is pure genius",
            "This is no longer true. The meter is no longer defined as anything to do with earth because of the aforementioned inaccuracies. It is simply now as you mentioned, how far light travels in a vacuum, in 1 second, divided by 299,792,458.\n\nYou could say having it divided by that is stupid, but the unit system still needs to make sense for everyday use, there's no point having a standardized unit that is exactly just how far light travels in a second. What use would we have for a length 299,792,458 meters long? What use would we have even having this divided by 100,000,000 to get 2.99792 meters? I don't recall often times in my life I've measured things around 3 meters long. But things longer and shorter than a meter? All the time.\n\nYou have to balance the use case to universal constants. Each SI unit is supposed to have easy usage, with some minor exceptions. Seconds are a good length of time to count in. Meters are a good middle ground for most everyday measures of distance, Kilograms are a good measure of weight and so on. Each of these units can be mathematically tied to a universal constant. It doesn't matter that a meter is how far light travels in a second in a vacuum divided by 299,792,458 - you don't need to know that. That knowledge is just so as a previous commentator mentioned, if you're in another part of the world, or on another planet elsewhere, and a diagram says, this part is 1.5 meters, you can know exactly how long that is simply using light.\nTry to imagine every meter ruler in the world was destroyed. The constant the unit is based on is just an instruction book on how to work out that ruler again and get the same answer every time.\n\nIn regards to your ideas around time units, that's massively arbitrary too. How exactly do you propose using the average resting heart rate as a measure for time? What is the average resting heart rate? The answer is it varies depending on health, gender, genetics, weight, and so on. That's pretty useless for an SI unit, where things need to be absolute. Most people can easily estimate a second, so why over-complicate?\n\nWill you tell me that you want to simplify Avogadro's constant for molecular weights next because that number is stupid too? That number is 6.02214 x 10^23 mol^-1. Should we simplify that, and suddenly change all molecular weights for every element?",
            "You're assuming this was intentional, it's not like those french lads in the 1700s could measure the speed of light, let alone know light had a speed. The system was designed for all units to work together seamlessly and standards like the kilo and metre were based off literal physical standards that all others used to make their standards.\n\nIt's only recently that we've switched to these standards based off the fundamental universal constants, so it's possible to recreate the SI system anywhere. Why would we disrupt the measurement system of literally the entire world bar a few stupids just because the numbers aren't round?",
            "Well if you can get everyone in the wolrd to suddenly change the definition of a meter by more than a few nanometers be my guest, but I'm sure you can envision the absolute mess that would be",
            "There's nothing fundamentally wrong with having teaspoons of a substance, that's fine. It's just that it's massively arbitrary. What if I only have a scale and I don't have any teaspoons? What exactly is a teaspoon? If I don't have one, and can't buy one in my country, I'm fucked. Every country has scales though.\n\nAnd pretty much every modern kitchen scale weighs in grams, I'm not entirely sure what scales you're buying that can't. Ones that are accurate to the closest 0.1g sure, those are what people who deal in gold and drugs use, but you don't need to be that accurate.",
            "> Who even owns a scale that accurate?\n\nAny basic kitchen scale will measure down to a single gram.",
            ">Who even owns a scale that accurate?\n\nWait what? How is owning a kitchen scale something foreign to you?\n\nRecipe says to use 450g of flour, what do you do?",
            "Hell, the money is still, in theory anyway, based on lbs of Sterling Silver",
            " yeah, fair, I don't really think of drinking a pint as using the imperial system. I've  lived in UK and Australia and beer sizes were always just something different and seperate haha. Australia has some real wacky ones. \n\nwhen I was working in the UK I didn't remember ever measuring things in feet and inches but that my depend upon what field you're in.",
            "Legit can't tell if they're being serious or not, like do people in their country not even have gyrds or are they just trolling? How tf do they fight off wyverns???\n\n Do they just let them eat them or smthn",
            "Nothing more American than clinging onto a relic of the British Empire",
            "Nah, US Customary and Imperial are different, same name for shit but different values/quantities.",
            "For weights it’s actually a Fr*nch word! Avoirdupois!",
            "Hence IMPERIAL",
            "No. US uses “customary” system, UK uses “Imperial.” The units are different, and they standardized on them a few years apart.",
            "That’s a short burger",
            "https://preview.redd.it/u4yw66hpr38d1.jpeg?width=1284&format=pjpg&auto=webp&s=4a5728d1c5e46e7cb1445a586b682b8ff993799b",
            "The Russians used metric, and they were the ones who first got a man into space. The first to do many space related things, truth be told.\n\nThe Americans made the majority of calculations in metric, as well. Like the Apollo computer, programmed in metric, but often translating those measurements to imperial for communication. \n\nIt's not a matter of basic math if some of the brightest minds in the world often choose to use it, for math, over the alternative.",
            ">Lighters work off friction\n\nBut it is the a superior kind of technology of lighting a fire through friction.\n\nLikewise, the metric system is the superior kind of the technique of measuring and modeling the real material world via using standard abstract quantities.",
            "I wouldn't say retarded or bait, since it's definitely bait, but in your case it's \"unemployed or no friends\", cause there's no way you have this much free time to bait with this dumb bs.",
            "Are you bragging about doing something more complicated than it needs to be?  \n  \nAlso last I checked there was 24h in a day not 12",
            "Bait used to be believable",
            "Check out the Wikipedia Article for the International Standard Unit System [here](https://en.m.wikipedia.org/wiki/International_System_of_Units#:~:text=The%20SI%20comprises%20a%20coherent,candela%20(cd%2C%20luminous%20intensity), scroll to definition and to SI-Base Unit, its really interesting. The seven SI-Units like second, metre etc. are all based on universal constants so that each measurement has an exact definition that stays the same no matter where in the universe you are. Also every single unit used by physicists like Newton for force, Diopter for reciprocal length and so on are all based on these seven units and can be expressed through them. One Newton is just one kilogramm*meter/seconds².",
            "If i get elected president im making the world a perfect 4000km",
            "It's an old joke by now and I can't take credit for it, but I'm glad you like it",
            "Yeah no I fucked up with that thing about seconds sorry don't worry about it; my point was that you can just fudge your proportionality a bit to make it closer to something you are likely to have a direct reference to, but seconds were a bad example (they're already pretty good now that I think about it, a heart at 60bpm already beats once per second)\n\nI'd argue that feet would be just as practical as meters if used in a sensible way. I ain't got a direct reference for a meter on me at all times but I do have a very rough reference for feet: my feet, which are average as will be those of most people. You may be a giant or a dwarf, sure, but in that case it's your problem I'd say.\n\nRegarding mols, I'm pretty much never going to use them outside of chemistry and I'll certainly never have to estimate any amount of mols by eye in my life, so just defining them so that they are convenient in the one situation when I'm gonna use them does make sense (I'm not a chemist so idk if a different constant would be better or easier to work with, in that case yes moles would be stupid)",
            "Dude I know that, but since the thread is \"anon hates the metric system\" this was just my two cents on why it is stupid but not as stupid as the imperial system.\n\nBtw this way of thinking is exactly the reason why ameritards are still using imperial, to them it just didn't seem worth it to fuck up all their standards.\n\nTbh I don't think it's a big deal, it literally doesn't affect me at all, but to me it's amazing that we still ain't reached any completely logical consensus on what units to use. Personally I'm a fan of god-given units, but that's just me.\n\nEdit: I'd also argue that having numbers that look generally nice is the one job of a measuring system, otherwise any system is as good as any other.",
            "I agree, but this seems to be the thread today",
            "Which is why most cookbooks have a section to define how many grams a teaspoon contains in the context of the book aswell as pinch, tablespoon and so on",
            "I measure 450 grams, of course. I have a digital scale. \n\nI just mean that my regular kitchen scale won’t even register a small amount of like 3 grams, if a recipe asks for that amount of anything like baking powder. One doesn’t need much baking powder. \n\nI have survived well by just putting a teaspoon, even if I’m taking a risk that my random spoon isn’t standard size.",
            "Once upon a time yeah but now it's just fiat currency",
            "If someone tells you their height here in cm usually the follow up question is what's that in feet?",
            "Bruh, it's the year of our lord 2024. I just take anti-wyvern essential oil every morning and I'm good to go for the day. Can't believe there's still people out there carrying around gyrds like freaking caveman.",
            "You say that like the British didn’t use it until very recently and still do for some things. A stone? That’s a British-exclusive imperial measurement. A stone being 14lbs.",
            "First man made object in space was German, never forget…",
            "12 total people have been on the moon. Literally all of them are American. It seems petty to give Russia any credence in space travel seeing how the USSR who actually did the work has since collapsed and been rebirthed into an equally shitty warmongering nation that is lapping up the bottom-of-the-barrel weak neighbours because the vast majority of their own country is uninhabitable.\n\nMost of our scientists use metric because gifted people from all over the Earth flock here to thrive in our top of the line education and best opportunities to those willing to put in the effort. If the best in the world grew up on metric, who am I to stop them? I’m saying the daft wanker who is yapping about how the imperial system is flawed because it’s not multiples of ten is a dumbass.",
            "Ah fair no worries. It's more even if the average is 60bpm, how can you measure that to get an accurate depiction of a second?\n\nFeet are as practical as meters but are just as arbitrary. Using your own feet to measure something would be extremely inaccurate. A foot is 12 inches, the average US foot size for men is 9-12, and 7-9 for women. So that's 0.859ft to 0.944ft for men, and 0.807ft to 0.859ft for women. That's about 90% accuracy for the average population, which is pretty bad. That's not a, 'your' problem. That's a problem with the unit itself. It's a bad unit of measurement if it makes sense for only those with a 13 US foot size. (Foot size is correlated to height, US 13 foot size correlates to those taller than 6'2\". Using this as an estimate, about 4% of the US population has this foot size. 96% of the population can't use this unit in the manner you describe accurately, which is pretty bad for a unit.)\n\nNo-one uses their feet to measure something. They will whip out a tape measure, at which point meters and feet are equally arbitrary. And dividing the distance light travels in a vacuum by 983571087.90472 to get 1 foot is even more convoluted. Meters simply exist because initially they were defined as what you said, 10,000,000th the distance from the north pole to the equator. It was the first attempt at standardisation and not bad for one. Feet never had this so, having just, a stick defined as a foot or yard was the most arbitrary one could get. The meter was then better defined, while the foot wasn't, and the rest is history. Since it's arbitrary, why change what most of the world uses now?\nEven the foot is defined by a division of a meter now since it's faster to do so, and the meter is already concrete.\n\nWhen doing chemistry it doesn't matter what you're multiplying a number by. So no whatever you use wouldn't be stupid. Changing every atomic weight to go in line with some new number you think up of just to make it nice and round would be though.\nThis isn't the point either, when is the last time you needed to divide light by 299,792,458 to measure something? The answer is never. Even those who manufacture rulers and measures don't need to. Only those who work in national measurement laboratories need to know this stuff. And as you just said, mols don't matter to you because you'll never have to estimate any amount of mols in your life.\nSo why does this?",
            "Wouldn't you agree that conversions between units in imperial generally don't look too nice?",
            "There's no payoff to round off SI constants, there's a massive pay off to switching to the measurement system everyone else uses. That's why every other country has made the effort to make the switch.",
            "The metric system isnt stupid bc its based on something that isnt used in everyday life. Except it is, though that is a coincidence, a meter is around a large step, a pinky is about 1cm thick, water freezes at 0° and boils at 100°. Based on mundane things and much better for calculations than freedom units. Maybe its cause I study science, but I cant wrap my head around how a system that allows for easy conversion to any unit needed can be called stupid.",
            "Fair enough, have a good one mate",
            "Is your scale electric or mechanical?",
            "Yeah. I was into numismatics for several years and figuring out the pre-decimalized system was hell. Like, half pence, fatrhings, pence, shillings, 2 shillings, pounds etc it was horrid",
            "height is the same in Australia as well, I think feet and inches work better because they are less exact inches being bigger than cms, also less of a mouthful I guess too, not having to say 'hundred' in it makes it more appealing.\n\n Different measures have told me I'm either 193-194cm, if I just say 6\"4' it covers both haha. \n\nBut if I were measuring to make a cut in places I've worked in both places then we'd use metric.",
            "\"What's that in old money?\" Is one I hear often.",
            "Well I'm sorry if i care about the environment! I hope you're happy knowing your essential oils (which barely even work anyways) are destroying cockatrice habitats",
            "Oh yeah the UK uses a weird mashup of imperial and metric, MPG for fuel but KM for some distances. Thankfully stone is dying and most people under 40 use KG. \n\nBut that’s understandable because the British Empire was British, not somewhere that bases its identity on not being part of the British Empire.",
            "Also using the metric system, just in case Americans forget.",
            "Was that the manhole?",
            "Oh man, turns out you are seriously retarded. Nvm. The Imperial system is absolutely flawed. That's not even up for debate. It's a goddammit mess and has no redeeming qualities other than that it's easier for idiots that grew up with it to keep using it instead of switching to a better system because learning is too hard for them.\n\nSo, I guess it has no redeeming qualities.",
            "It seems pedantic to differentiate between the USSR and Russia when they both used metric which was the main point being made. and referencing to the USSR as the Russians is common slang.",
            "If I have to estimate a distance with no tape (which, yk, can happen, and is pretty much the whole point of the system) a reference with 90% accuracy is better than no reference at all imo. There is no advantage to the meter over a \"well defined foot\" other than the fact that it is already established. Same thing for mols, apparently.\n\nAm I saying we should change the SI to accomodate for this? No, the inconvenience of doing so would far outweight the benefits. I'm just pointing out that Anon, for once, made a good point.",
            "It’s electric but doesn’t easily register small amounts if the amount is close to zero grams. Based on these comments, I think I’ll consider getting a new scale, lol.\n\nI’ll still probably just tea spoon small quantities of salt/baking powder/soda/spices, has worked well so far.",
            "Basically the same here. If you want a sheet if ply wood it's 8 foot by 4 foot but it you cut it you use metric",
            "Everyone's always raving about cockatrices like they aren't a psy-op from the Adventurers Guild to keep getting wyvern-slaying requests.\n\nWake up morons, they are taking your coin and the 'Kingdom' is in on it.",
            "The UK doesnt use kilometres",
            "Give me the full metric system but with mph / bhp for cars, and teaspoons / tablespoons for seasonings. That is the dream.",
            "A4/V2 rockets. The manhole was during nuclear tests of the Americans, afaik.",
            "The point of the system is not to estimate a distance without a tool of measurement. The point of the system is to be able to concretely define what a distance is to make said tools.\nYeah you're right, that is what I'm saying - the meter has no specific advantage over the foot, except for the fact that literally 95% of the world uses the meter. So everyone else changing makes less sense than the remaining 5% changing. \n\nMols is defined as such to concretely define existing measured atomic weights. That's the point of all the units.\n\nBut that IS my point - that anon didn't make any good points at all. Every measurement he pointed out was massively arbitrary, and badly defined. And him shitting on a system simply because he doesn't understand why it's done the way it's done is the stupidest part of the whole argument. Lastly using both systems causes confusion, causing conversion errors so severe they can result in millions of dollars of damages, or loss of life.\nI.e. the loss of the Mars Climate Orbiter.\n\nMetric is superior simply because it's better defined and everyone uses it. There is no better argument than the whole world should use the same system, and in the military and scientific community, this is already the case.",
            "in some areas it is used / some people do, in the UK both the imperial and metric systems are used interchangeably, the only thing of note is that older folks tend to use the imperial more, and younger people the metric more ( attention, MORE, not only one )",
            "Using speed in kilometers per hour is close enough to miles per hour. Teaspoons and tablespoons are used as a common measure in the kitchen, at least in Latin America. \n\nIt's worse here, where we use horsepower (bhp) to measure the power of cars and kiloforce-meters (kgfm) to measure torque.",
            "Im from scotland and the only time we use kilometres is when we go on holiday to ireland(for american scrollers Ireland isnt in the UK).🤣\n\nI know we have a mixed system, we use celcius for temp and miles for distance and have pints for milk and low alchohol drinks.\n\nMaybe its different elsewhere but i know here in scotland we dont use Km or farenheit etc.",
            "It's because torque is a professional/scientific measurement, whereas bhp is just a random measurement invented by car companies to sell cars in the age of horses. And a horse isn't even one bhp. One horse is 2-10 bhp. Because the measurement was completely made up. A guy just literally said his engine was 10 bhp to sell his engine, with no proof."
        ]
    },
    "An opening appears": {
        "title": "An opening appears",
        "score": 7463,
        "url": "https://i.redd.it/q0cdz8tvnz7d1.jpeg",
        "content": "",
        "num_comments": 206,
        "comments": [
            "Ask her to remove her shirt and check for plates, then locate the nearest anti-fed contraption (unregistered firearm) that works with whatever level of plates she has. \nOf course, I already have a bug-out bag, but assuming I didn't, I'd quickly grab anything important I can carry and burn my house down and escape into the night and hope the other feds aren't to close behind.",
            "turn 360 degrees and walk away",
            "Probably go play Runescape",
            ">sex her\n\n\n>complain that it wasn't good enough and whine/scream until she gives me a refund\n\n\n>pay another prostitute to \"have sex with my virgin son\" \n\n\n>repeat\n\n\nInfinite free sex loophole",
            "Well best not waste their money",
            "Leave her and kill my parents",
            "Prolly wake up ngl, one weird ass dream.",
            "https://preview.redd.it/n8xj0x0ke08d1.jpeg?width=662&format=pjpg&auto=webp&s=221bdafbcaa3427ed5a96011e6c6356b8d2d12b2",
            "Jokes on you mom and dad, I'm not a virgin. Thanks Uncle Dave 👍🏻👍🏻👍🏻",
            "![gif](giphy|124ySNrM8Rt8go)",
            "SMAAAAAAAAAAAAASH\n\n![gif](giphy|57NztNfDPBz9BC2nAm)",
            "![gif](giphy|rbzLgG9VR0QMw)",
            "https://preview.redd.it/04357ovl808d1.jpeg?width=2560&format=pjpg&auto=webp&s=a8b04ba7e2461c50df5eaa3b881a2654fca15203\n\nRight in her dooker.",
            "Ask if I can pay her to fuck her parents instead",
            "Nice try, fed",
            "*unzips* game is game",
            "Eat a zebra cake and watch bobs burgers",
            "I would feel disgusted",
            "Did they forget to pay you the \"foreplay charge\"",
            "JLaw from what I’ve heard over the years is a legit freak IRL. It would take a lot not to fold.",
            "\"So Dad, there is this --I don't know, 18 to 24-year-old cam model at my house. It's hard to tell, because I haven't been able to tell the difference between 28 and 33 for a long time now, but she said --OK, this is going to sound crazy, but she said you paid her to have sex with me. Like, you know she could easily be your granddaughter, right? Yes, I'm aware this that conversation is more uncomfortable for you than it is for me. Yes, it doesn't make any sense. All I can think is that either she has the wrong address or the state police are doing some kind of sting operation. I'M A BAD PERSON? How am I a bad person? She just showed up at my house! YOU ARE CALLING THE POLICE? On your own son?\"",
            "sell her organs and give the parents the money as a thanks 🙏",
            "this movie premise was such fucking slop lmao it’s beyond parody\n\n“we’re mad that our son is the slightest bit eccentric/divergent from the mainstream so we paid some slag to force him to assimilate”",
            "This would be extremely out of character for my parents, so I know that's a lie. Get rid of the obvious intruder by any means necessary",
            "I don't care who the IRS sends, I am not paying taxes!",
            "![gif](giphy|126Atuf8ZpQsQE)",
            "I dont need hos hos need me",
            "I’d grab my Barrett 50 caliber sniper rifle model 82A1 and 360 no scope myself",
            "There is absolutely no fucking way that's anything my parents would do. I'd just tell them to leave or get trespassed",
            "What movie?",
            "Blow a nut in that butt",
            "https://preview.redd.it/mm1xjr1im18d1.jpeg?width=1170&format=pjpg&auto=webp&s=c114e776e6f89df97c670c8c8a475ac1e88628d3",
            "Cry into my boyfriends massive man pecs",
            "Get all up in them guts",
            "Ask her how much they paid her. Then ask to split it and have a night out",
            "Only if we can censor your booty hole",
            "\"Give them their money back.\"",
            "harvest",
            "I would give up trying to have self esteem",
            "fuck it.",
            "Get outa the way I'm trying to beat the rocky guy in the first Dr. Wily stage without the \"select cheat\". If you come in here while I'm fighting the clone ima slap your ass.",
            "I'm gonna fuck her, sorry lads no decency here. I'll tell you about it on our fishing trip tomorrow.",
            "pull the pin on the grenade i have hidden in the cushions",
            "\"They should ask for a refund.\" And leave",
            "if they hire a Jennifer Lawrence level woman I'm folding at the speed of light, the dude in the movie had some serious self control",
            "Too old for the basement, onto the butcher's rack she goes.",
            "If she mentioned my parents paid her it would completely kill the mood cos thats all I could think about now.",
            "Your getting paid?",
            "https://preview.redd.it/zn6n6gp3l28d1.png?width=985&format=pjpg&auto=webp&s=08cbb99a5301f732d1973623706524ea59930a7e",
            "Sex without the emotional intimacy makes me more flaccid than a spaghetti",
            "https://preview.redd.it/kw87kpmxr38d1.jpeg?width=1152&format=pjpg&auto=webp&s=8089b12dcf688d0ced9c0231641be90dc98799fc",
            "https://preview.redd.it/d7bwzwz6128d1.jpeg?width=1170&format=pjpg&auto=webp&s=abda1732a14789e90a4dd3ae44c0d10fb5368722",
            "I know that my parents know that I'm bad with the girls, but why would they do that?",
            "https://i.redd.it/ib9t30h4q28d1.gif",
            "No thanks,\n\n*pulls out the*\n\nhttps://preview.redd.it/ubo5wyp0u28d1.jpeg?width=4320&format=pjpg&auto=webp&s=7c8c091659e0f931d790a1bb6ede49f1ba3b605e",
            "Make her eat a bowl of eggs",
            "Nom nom nom",
            "Don't look a gift slut in the mouth",
            "But my parents are dead?",
            "I think you mean:\nA wild opening appeared",
            "If i was placed in such a situation I would likely consume her, as I need my strength for the winter.",
            "Ask her for a hug and if we can watch a movie.",
            "\"Oni-Chan, I told you no...\"",
            "Sure! I mean I'm too old for my parents to buy me a hooker, and my parents don't really give a fuck about me, but sure!\n\nNot marry, just fuck and bail though. Sure! Get an STD test first though.\n\nLord knows how many \"clients\" she's had.\n\nAlthough, in the context of the movie, that wasn't the case, but still a ho is a ho. Get tested for every STD.\n\nThanks for the downvotes. It means I'm right.",
            "What does /tv/ mean?",
            "You just gave away your master plan dude! Now the feds know exactly what your going to do",
            "> Nearest anti-fed contraption (unregistered firearm)\n\nKek",
            "Nice face fed",
            "What",
            "&#x200B;\n\nhttps://i.redd.it/tesjwjiftz7d1.gif",
            "https://i.redd.it/6j92e7lusz7d1.gif",
            "![gif](giphy|Sn443G8D4XbOM|downsized)",
            "[deleted]",
            "[deleted]",
            "I love runescape so much",
            "Based and RuneScape pilled",
            "![gif](giphy|d9gJJEQiAXiZXarzKZ)\n\nThey bought me a girlfriend? Ha! Nice try, mom and dad! I can buy one of those at the grand exchange! Buying gf!",
            "Woodcutting lvls?",
            "Can I play with you? While someone else is fucking her",
            "My uim ain't gonna max itself",
            "Old school or RS3?",
            "My son",
            "i remember maxing my main on os lmaoo never again",
            "[deleted]",
            "Step one: cover yourself in oil",
            "[deleted]",
            "Same tbh (yours, not mine)",
            "Holy based",
            "Kill her and leave my parents",
            "Just an hero yourself",
            "This is some Crusader Kings 3 shit lmao",
            "Time for them to pay the Ultimate Price",
            "Z,x n",
            "He hired a prostitute for you too?",
            "connely was stupid hot in this movie",
            "What film is this ",
            "The only honest one here^",
            "Movie is called No Hard Feelings",
            "https://preview.redd.it/c2tq55wea28d1.png?width=720&format=pjpg&auto=webp&s=5438c713a4d2649fefd3618af82138b02b269405",
            "I read it as \"foreskin change\" and was confused",
            "Is this an actual line from the movie? lol",
            "Toy Story 3",
            "Cannibal Holocaust",
            "Die Hard",
            "No hard feelings",
            "Yeah might as well just eat her at that point.",
            "Sure!",
            "What was the movie?",
            "one of the boards on 4chan.",
            "fool, it's his decoy plan",
            "That's when I suck them off.",
            "[deleted]",
            "Finally, a worth response",
            "Hello buddy\n\nhttps://preview.redd.it/u1msdbo7608d1.jpeg?width=1179&format=pjpg&auto=webp&s=c2c9670bb835e1abbde3361f7f77e570d42a7ace",
            "https://preview.redd.it/rzelo924a28d1.jpeg?width=620&format=pjpg&auto=webp&s=7e722e85ec5d3a132d8ae4b7ebd8822f528b63d2",
            "A boyfriend free girl",
            "Stop the cap",
            "Look at this fucking nerd, knowing numbers and shit.",
            "Newfig",
            "(User was banned for this post)",
            "Nah your account is 7 years old this is bait",
            "Autism and it's consequences",
            "It's unhealthy the amount of devotion I have to this game. It's the only thing I've ever considered actually getting a tattoo of. This is not a joke. This is a legitimate cry for help.\n\nOn another note, I'm only 405k from 99 fletching. Let's get it bois (OS of course)",
            "84",
            "87",
            "99",
            "99",
            "99",
            "99 and 90 on my ironman",
            "99 baybe",
            "99",
            "Currently 60, afk maples in seers on forestry world. Need 62 for sins of the father",
            "83",
            "Erm.. what the sigma?",
            "Ain’t no question boy",
            "Definitely classic!",
            "No. r/2007Scape",
            "https://preview.redd.it/e27gmu5we48d1.jpeg?width=1079&format=pjpg&auto=webp&s=55da822ad3477eabdc8f9285763b9a27ec79c752",
            "Quite the opposite, that's why I'm not going to waste their money dingus",
            "She's just doing it for money. Your parents are doing it because they don't respect you.",
            "If my parents are hiring me a prostitute you better believe they're not seeing another day.",
            "Uncle Dave IS the prostitute.",
            "Yeah, she’s stupid hot in everything. This film sticks out for many of us though.",
            "In every movie",
            "Career Opportunities (1991)",
            "Career Opportunities",
            "You could also be too shy, or lacking self confidence and genuinely not wanting to smash, asexuality aside. It took me years to be at ease with the fact of having sex with a stranger and I never imagined it would be the case when I was virgin. I was so wrong",
            "Jennifer Lawrence beats up on some teenagers while naked on a beach. Fun movie.",
            "False I'm hard",
            "Damn everyone's hopping on that lip and facial injection train, even Jennifer Lawrence",
            "![gif](giphy|ONRnFGCb4EP4s)",
            "Oh yeah when Jesse gives buzz a woody.",
            "No Hard Feelings.",
            "Not even, thats a classic decoy decoy plan",
            "They’re obviously working together",
            "The fact that this is honkau star rail sex alarm that is used solely on the okbuddygenshin subbreddit is astonishing",
            "silence traveler, a okbuddytrailblazer user is talking",
            "https://preview.redd.it/6pw5v3geh28d1.jpeg?width=225&format=pjpg&auto=webp&s=a926c7b59a21bd4cdaebdce85950f209bf292b8a",
            "![gif](giphy|zAeuU4hHvZhjW|downsized)",
            "Gzzzz",
            "How many years of in-game time have you clocked?",
            "When I maxed my life became empty and I broke the addiction, there is hope brother but get there faster.",
            "80k away from 99 mining myself! Idk whether to be proud or disgusted with myself 🫡",
            "Nice",
            "Nice",
            "Nice",
            "Nice",
            "nice",
            "Nice",
            "Nice",
            "Nice",
            "Nice",
            "nice",
            "Nice",
            "Nice",
            "Nice",
            "Nice",
            "Nice",
            "Emote plz",
            "Nice",
            "Nice",
            "Nice",
            "Nice",
            "Classic 😎",
            "Yeah but I'm doing it for fun",
            "i was the prostitute for uncle dave, he just hasnt paid me yet.",
            "for a film that is largely Failure to Launch its a pretty good film, enjoyed it more than I thought it would",
            "Turned many a boy into a man",
            "Eh. I like to watch movies to escape my day to day life.",
            "Imma beat off a 40 year old to this movie later",
            "That scene was one of the few halfway decent scenes tbh, the rest of the movie was mostly varying degrees of cringe.",
            "Thanks",
            "The Venn diagram looks an awful lot like a 3D circle",
            "wait, you're telling me that sex alarm is a canon thing on Honkai?",
            "If you don't chew big red then fuck you",
            "!remindme [30 minutes]",
            "Same here, I ended up watching it and it was a good time. Honestly appreciate getting more silly, adult comedies like that.",
            "Lol that gave me a solid chuckle, thanks you fuckin' stud.",
            "i too am over 40",
            "a sphere",
            "I will be messaging you in 30 minutes on [**2024-06-22 12:49:24 UTC**](http://www.wolframalpha.com/input/?i=2024-06-22%2012:49:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/greentext/comments/1dlehd1/an_opening_appears/l9r58tg/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fgreentext%2Fcomments%2F1dlehd1%2Fan_opening_appears%2Fl9r58tg%2F%5D%0A%0ARemindMe%21%202024-06-22%2012%3A49%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlehd1)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "I’m busy with my own shit, take care of yourself",
            "Thanks i had to look up what a 3d circle was",
            "a ball, then, because a sphere is empty inside",
            "i have not been able to reach my penis in years",
            "a circle is also empty inside\n\na circle is hollow, a disk is solid",
            "I'm imagining you with trex arms not a huge gut",
            "[*I have a big head, and little arms. I’m just not sure how well this plan was thought through*](https://www.youtube.com/watch?v=93B072j-E3I)"
        ]
    },
    "Anon's roommate gets a gf": {
        "title": "Anon's roommate gets a gf",
        "score": 751,
        "url": "https://i.imgur.com/SRxqpiF.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "I despise everything about this post",
            ">anon fantasises about his roommates dick",
            "How does he know he has a big dick?",
            "Anon wishes that was him getting railed by the roommate.",
            "So not homoerotic story per se but homoerotic by proxy. That's a nice change for once.",
            "https://preview.redd.it/a66co0jqa48d1.png?width=469&format=pjpg&auto=webp&s=a9dde02a26b7bac49fc8cbf82e8d5f22ddc0d7e8",
            "fake: cartoonish plot\n\ngay: anon fantasies about his roommates cock",
            "Just a hunch",
            "Anon peeks at them going at it once in a while and wishes he was the one getting railed instead.",
            "Sweatpants",
            "can you blame him? he seems to know what he is doing.",
            "Homoerotic cuck story",
            "https://preview.redd.it/56pdevwf248d1.jpeg?width=1079&format=pjpg&auto=webp&s=f491cf1e33fbc1d2bccba04323fbaa9222c9d8ff"
        ]
    },
    "Clowning around": {
        "title": "Clowning around",
        "score": 358,
        "url": "https://i.redd.it/kqz85xom938d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "I wish clown girls were an actual race of people. Their entire skin is white. The clown nose is natural. Their nipples and pussy lips, aka Clussy, have alternate colors, sometimes the same as the lips. Their skin probably tastes funny Imagine the taste of their breast milk. Grabbing their breasts or ass causes a honk noise. Want to playfully grope Clown wifes butt in public, loud ass honk is heard echoing from her. Everyone turns to you too, knowing full well what is going on. She embarrassingly honks her nose, trying to play it off.",
            "You think that's wild? In Gremlin's 2 some guy fucked a transexual gremlin\n\nhttps://preview.redd.it/nswxzi4sb38d1.jpeg?width=2402&format=pjpg&auto=webp&s=37a1f4dbba2e0b9faccfb788745011fa23cae093\n\nYes he was covered in kiss marks after the deed was done.",
            "Clussy stock has been on the rise in recent years",
            "at least they laid \n\nand you not",
            "Would honk, next question.",
            "Wait they didn’t get killed?",
            "Game is Game 🤷‍♂️",
            "https://preview.redd.it/i7aajm7ae48d1.jpeg?width=1242&format=pjpg&auto=webp&s=6e6085d3df6a8533412d645d8e1488ce288fb2ed",
            "Keep going",
            "You try to kiss her, she instinctively throws a pie in your face. You have no idea where she got it.",
            "And when she gives birth, it's twelve babies at once?",
            "what the fuck?",
            "Just as Mr. Enéas intended.",
            "https://preview.redd.it/5kmi4k7uf48d1.png?width=1440&format=pjpg&auto=webp&s=dd5a813dfc1d5e470986f329a15925abef30faf1\n\nThanks for ruining my morning dump with your god forsaken comment",
            "Man, people will just fuck anything, huh?\n\n\n\n\n\n\n\n(it's me. i'm people)",
            "he got the grussy",
            "nah they survived the clussy.",
            "[https://www.youtube.com/shorts/8gF-S5jsEwM](https://www.youtube.com/shorts/8gF-S5jsEwM)",
            "All of them a different color",
            "https://preview.redd.it/qi0xrt2ba48d1.jpeg?width=395&format=pjpg&auto=webp&s=e761f8a8dd1d3abce0ac8ce3934bff9661eb3fad\n\nGarotas palhaço para sempre",
            "Hi, i'm anything. Let's fuck",
            "Go commit die",
            "all of them linked arm in arm as the doctor proceeds to take them out"
        ]
    },
    "Anon Doesn't Understand Bridgerton": {
        "title": "Anon Doesn't Understand Bridgerton",
        "score": 263,
        "url": "https://i.redd.it/i1wbh2dsg38d1.png",
        "content": "",
        "num_comments": 24,
        "comments": [
            "He should have told her that she is pretty and they look alike",
            "Could definitely self insert into that character",
            "\"Yeah she is pretty and low-key you looks like her fr\" and see how the hypocrisy goes",
            "It *obviously* fits on a man.",
            "Ahh anon should have given her the good ol \"you are as beautiful as her/lizzo\",then watch as his gf malfunction at this comment because if she reacts negatively especially in front of her friends she will be seen as being fat phobic and etc.\n\nAnd if she accepts said compliment she is essentially agreeing with anon that she looks like a land whale.",
            "She's built like a brick wtf",
            "Why is he asking? This dress could fit on a water whale",
            "I understand her lover in the show is her irl boyfriend they have a sex scene and boy is it steamy",
            "Lmao why did anon actually sleep on the couch when his gf told him too? She's your girlfriend not your feudal lord.",
            "Anon hates downies",
            "My gf and all her friends couldn't stomach the sex scenes. There is hope",
            "I didn’t know the Crushinator got another acting role. Good for her. ",
            "It’s not fatphobic to say she’s not pretty, she’s not. Doesn’t have to do with her being fat tho. Fucking look at her forehead",
            "[deleted]",
            "Woah, easy there, satan.",
            "Oooh that's evil",
            "It probably fits on a linebacker",
            "You’re intellect is 20",
            "What about a fire whale?",
            "Walter white",
            "I did a cum",
            "Found the friend",
            "You will never be a woman",
            "Not with that attitude and a penis."
        ]
    }
}