{
    "Friday Buyday 06/21/24": {
        "title": "Friday Buyday 06/21/24",
        "score": 12,
        "url": "https://www.reddit.com/r/guns/comments/1dkux4l/friday_buyday_062124/",
        "content": "[Collectable tupperware](https://imgur.com/TEUSyCR) edition\n\n  \nAlt text: >!SOLD Early Gen1 Glock 17, Sale Price $5450.00!<",
        "num_comments": 57,
        "comments": [
            "300 shims from SendCutSend. Because cutting out even a handful manually was too much of a pain in the ass.  \n\nAlso, [a threaded barrel and mag extension](https://imgur.com/7QiDaqJ) for the Beretta.  \nSwapped the thread protector because I hate \"default\" ones.",
            "$36 for breakfast at the hotel, it was continental so not really that great tasting and the kids mostly wasted food. $35 for parking at Sesame Street place, we brought food in so I only spent $20 on dippin dots before we left, since it was mid 90s. The hotel bar upped their prices on beer from Wednesday to Thursday, a $2 increase in the same beer which I thought was a little strange, same time I was drinking too, just a different bartender. Wawa for breakfast today before we head into Philly for some kid museum, we found an Irish restaurant that looked good but zero parking so instead we plan on a Mexican place closer to the hotel.",
            "I broke down and got a copy of the [German rucksack](https://www.military1st.com/14016001-mil-tec-german-army-mountain-rucksack-olive.html) that \na bear stole from me, and I'm actually pleased at how its made. Doesn't feel quite as heavy duty as the original but I think it'll work well regardless.",
            "Had some OP call me a snowflake before swiftly blocking me and others in their \"pwease choose a Turkish 1911 knockoff for me\" post. Another OP said to me \"reprioritize your time management and do everyone a favor\" in a post where they were essentially asking everyone to outsource their time and effort into spoon feeding them a complete mk18 clone parts list, so that they wouldn't have to waste their own valuable time doing so. Irony is dead.\n\nIn other news, it hit 92 with all of the humidity here in southwest PA while the contractors were digging post footings for the carport. Fellas were slamming beer when I came out to check on them. They got it done, though.",
            "May go to the range tomorrow, if I do I'll need to buy some 9mm as I only have 1 box left, and that won't last at all.\n\nAlso going to call the bank that we got our car loan through, I should be coming up on the 7 month time where I can pay off the balance of our financing.\n\nEdit: I own my vehicle now!",
            "Nothing for me this week. Currently in Florida, so all our money is going to vacation stuff. I was sold on this as about 1k from us but I think it's costing way more. Kid is having fun but, damn.",
            "Neat bit of history but that seems spendy.",
            "Should be getting my Steiner T432 in tomorrow, my trigger kit for the B&T TP9 in next week along with some new batteries for the 509T X2 on the same gun. Batteries lasted over a year so I can't complain at all on a high setting with the circle dot reticle.\n\nI'm also going to give the Heathen Systems Assaulter Bipod a go as I'd like a simple bipod that I can keep on the rifle at all times, and the whole thing weighs 3.5 ounces with a barricade stop built into it. Not expecting it to be anything but light and adequate.",
            "I have a neighbor with a Glock 17 Gen 1, a couple years ago he was talking about possibly getting a Gen 5 and I offered to trade him but he turned me down. Oh well.\n\nBought a Condor shirt, one of those t-shirts with velcro patches. Gonna try wearing it at work to see if it's more comfortable in this heat. Nice thing is that now I'm buying t-shirts sized L instead of XL like I used to. My only problem is that sometimes shirts sized L vary in sizes, and so the shoulder width doesn't always match me. But buying XL sized shirts doesn't feel good either because they're meant to accomodate a way bigger gut than I have.\n\nApparently our boss got in a shouting match with someone from corporate arguing over how he should be running the branch, and this was perfectly timed to coincide with him getting a call that one of our crews locked themselves out of their truck at a stop over an hour away. Our boss was fuming for that day.",
            "[I'm buying some small magnets](https://youtu.be/1_X-nLYZ3Xc?si=wR28A-ViGQpuyWIq) that's what.",
            "I bought a Glock 43 (not 43x) in current year. Gonna slap a TLR-6 HL on and carry it. Also been eyeing a Glock 17 Gen 2. I might end up becoming a dreaded Glock collector.",
            "A Glock 17L mos last week and a Holosun 507 Comp I ordered showed up yesterday. Gonna go hit the range today with a coworker and have some fun.",
            "Picked up a Recover Tactical 20/20 Glock chassis for a range toy. The optics mount is a flimsy POS plastic piece, so now I'm looking at mounting an optic to the G17 slide. The big complaint from users is that the brace is too high to use iron sights and even slide mounted optics feel low. How cursed would an RMR cut + [10mm riser](https://www.omahaoutdoors.com/reptilia-rof-riser-rmr-10mm/) be?",
            "One of those cans of surplus Pakistani 7.62 that Aimsurplus was selling.  It is rusted closed pretty tight and I have bothered to lever it open yet.",
            "This week I bought a bunch of magazines for my USP45 which I bought used a couple of weeks back, HD sights and a new recoil assembly as the old one felt \"weak\".\n\n\nTrying to decide if a USP Compact V7 is a good buy right now; given I already have a P2000.",
            "Match fees for USPSA tomorrow. Time to go get my butt handed to me once again by 25+ yard swingers. I do I like to think I'm a little more prepared this time and with the 3 M class shooters on my squad I'll have some good notes to take.",
            "Was considering match fees for this weekend, but it's going to be a heat index north of 100 so I don't think I'm going to do that. Next Saturday is the rifle match which only comes around once a quarter, so I'll probably brave the heat for that instead. \n\nSilencerCo looks to have completed a batch of Scythes recently as I see them in stock at a few places. Hopefully they are around still at the end of the month next paycheck because I had to pay my car insurance and registration and don't have the funds available right now for one. That would be perfect for my Tikka.",
            "Took the Polonium K out Wednesday and it ran great even if a bit gassy. Did have a round get pushed back into the case which dumped powder and jammed the gun up good. Mortared the hell out of the gun for a few rounds and bent a cleaning rod clearing out a FTE. Running the bore snake through a few times remedied the issue but it was an exhausting 15min of troubleshooting and buggering with a new build that initially worked fine. Discovered that initial jam + more lube (thinking it was fouling/lack of lube issue) + residual spilled powder = chamber super glue. \n\nOn the agenda still is figuring out which 16\" build will run with the K (one has AGB, other does not) and how much zero shift I get on the pencil barrels with a heavy string of fire. The 11.5\" SBR I started on was hitting a 12\" plate at 100 yds offhand for maybe 10 rounds before it started to wander. Could have been me or the fact it has a Faxon pencil barrel and it was drooping with the added heat/weight. Have a 11.5\" CORE in the drawer to build a second setup and make a decision between the two. Preferred the Faxon for lighter weight but the core might help with balance when I add the LAM/Light up front and should definitely help with accuracy. This would ideally be a <200yd gun with occasional bouts to 300yd for matches, so if the Faxon is opening up/stringing too much I might just throw it to GAFS and stick with the Core and keep it a dedicated NV/CQB setup and reserve the 200/300 yd stuff for the 16\" builds. I'm in \"Open\" division now at the local match since they change \"Limited\" to RDS only and excluded all magnification, and open allows for multiple guns.",
            "Spent 8 grand on a 7.62x54 NDM-86...don't drink and bid in auctions, guys. Only way I'm justifying it is by saying it'll probably be a museum piece if my kids can hold onto it for 50 years. And I even got it for a bit cheaper than the new Hungarian Hd-18's have been selling for, so it's not too bad. Just need to find some not overpriced dragunov mags.",
            "Banner has been updated.",
            "I hopped on the Brownells sale on metal magazines and 50cal ammo cans. Also ordered a new PDP holster from We The People, and a case of 300 BLK. My Form 1 should be approved any minute now, and I can get that engraved finally after sitting on the parts for nearly a year.\n\nEdit: Oh man, I already have a Fulton M16A4 upper, but Brownells has them on sale for under $500 right now with the coupon code. Hey u/BobbyWasabiMk2 so I need another AR? Especially a carbon copy of one I already have?",
            "Got a back in stock notification for blem Nosler 300gr 0.338\" cal RDFs, so ordered 500x of those for less than $0.50 each. Hopefully .338 Spectre barrel is ready in the next month or two",
            "I’ve been hopelessly trying to find .300 H&H ammo for a rifle I’ve inherited from my father but everywhere is out of stock. Does anyone know where I could find some?",
            "I'm a simple man. I see a Beretta 92, I upvote.\n\nIs that a flathead slot? If so, that is kinda brilliant. Can I ask what thread protector that is?",
            "Beretta 81BB + Omega 9K == infatuation\n\nNo gas in the face. I suppose it's the direct blowback action. Maybe it's that the little .32acp round doesn't generate enough gas to matter.\n\nI waited a long time to get a threaded barrel for my CZ-75B, paid a lot to get it fitted when I got it, and the stinging particles made it not fun and not worth it.",
            "I’ve also got the threaded barrel and mag extension, except on my 80X. Can is waiting on ATF right now. My goal is to have the most ridiculous 380 this side of the Mississippi",
            ">Wawa for breakfast today\n\nCoffee is ok and half their sandwiches are actually decent.\n\nSucks you all have to be here during a heatwave, but I hope you enjoy yourselves.",
            "> German rucksack that a bear stole from me\n\nStory time!",
            "I was even keeping it toned down with my response to OP in the 1911 post. Like why the fuck are you asking people to decide for you what you like?",
            "Congrats!",
            ">May go to the range tomorrow\n\nDo it, you coward \n\n>if I do I'll need to buy some 9mm as I only have 1 box left\n\nBooooooo, manage your life better\n\n>I should be coming up on the 7 month time where I can pay off the balance of our financing.\n\nMeh, I stand by what I said. Congratulations!",
            "I have the same issue with shirts going between L and XL. I'm 6'5, so it's length that's my problem. Ls fit but after one wash/dry they'll shrink to just barely cover my midriff, so I usually get XLs but those are sometimes obnoxiously baggy.",
            "I used to think SoTAR was kinda pretentious, but it’s hard to be pretentious if you are actually better than everyone else. He is right about everything I have ever seen from him, and the hits just keep on coming. If my exact k life method for pivot pins wasn’t working for me so well, I’d buy these magnets too just on that video.",
            "A couple big sellers just got batches of trade in 17 Gen2s, is that what you’re looking at?",
            "$125/250rd can is suspiciously cheap. Hopefully there's not a huge proportion of duds",
            "I almost jumped on the ODG USP 9 tactical that Rooftop was selling, but I waffled because I didn’t know if I wanted a 45. The USP is a really cool design, and I wouldn’t mind if that was my main entrance to the HK superiority complex.",
            "You're braver than I am with the triple-digit heat index but I'm probably braving Sir Walter rifle next week if you're up for it.",
            "When the IDPA match directors stop requiring concealment on every stage, you know we've reach peak heat index. Thankfully, Goshoot is mostly in the shade, but yeah it's gonna suck.\n\nHow are the distances for the SWGC rifle match? I'm intending to shoot it with my Flux for fun next week.",
            "Nice! That's close to the price you'd need to pay to \"correct\" an HD18 anyway. And it doesn't come with a dumb-looking QR code on the receiver lol. Good luck on the magazine hunt, I hope the fair market price isn't $200+ like on Gunbroker right now",
            "Sir, that's an 81...  \nIt's a cz thread protector that I snagged off of my brother.",
            "The burrito I got had better eggs than the hotel, and at a much cheaper price. Wife got free coffee from the hotel. \n\nThis wasn't a long trip, so it's still a heatwave back home. I feel bad for my dog, we only have a split unit and window ACs, and I'm not trusting of the dog sitter to run the split unit for only a set temperature. The fans on his bed should help.",
            "Earlier this month I was in the Boundary Waters Canoe Area Wilderness and [this asshole ](https://imgur.com/a/Bklb7O8) took my beloved old backpack from the entry point parking lot. We arrived, unloaded and piled up our gear, and as usual I went hustling down the portage trail (about 2/3 mile) with a pack and a canoe to get things going. As I was returning and almost back to the parking lot after everyone else had departed, I heard something in the woods just to the side of the trail and sure enough it was a big bear about 10 yards away. I snapped a couple of quick pics before yelling it off, and it barely budged. Got back to our stuff and my pack was *gone*- we suspect the bear stashed it and was back for more. In it was my fishing tackle (fortunately not my fishing reels), my prescription sunglasses, my crocs, and a few more bits and pieces.\n\nFirst trip in the BWCA was 1998 and between myself and members of my usual group we have hundreds of trips worth of experience, and we'd never had a bear encounter like it. Every once in awhile you hear about bears becoming pack robbers but they're rare, and regardless now I'm treating my smelly rubber worms and fake leeches like food. Historically we don't even keep toothpaste in our tent knowing they can smell it so its not like we're totally unaware but there's a first time for everything I suppose",
            "I was robbed by a rather enterprising bear once:\n\nIn high school I went camping at Quetico Provincial Park in Ontario (highly recommend), and a black bear mama and two cubs stalked our group for 3 days as we went deeper into the park. She came to our camp in the middle of the night, knocked over the pots and pans as a sound trap, *lowered* the bags from the tree branch, *opened the latches* on each bag and found the one with the food in it. She took off and dropped a small trail into the woods. In the morning, we followed the trail and found a small clearing where there was an absolute graveyard of campers backpacks and food containers. She had *unscrewed the lids* on the tupperware and licked every one clean. The bag was partially destroyed, but there was a really nice bag that was in perfect condition, and we returned that one with our awesome story when we got back a few days later. Lake fish and scraps from other campers for 3 days.",
            "The first one I just quietly reported and moved on. The second post was just pathetic.\n\nI don't think anyone caught on I had quoted starship troopers",
            "Thanks! I enjoy the bank not owning my stuff.",
            "I've seen them, but no not really. I'd rather opt for something I can see before paying for. I was never the type to buy sight unseen trade-ins online.",
            "> $125/250rd can is suspiciously cheap\n\nYeah It is.  We'll how it goes, but I think this is going to be \"shoot at my buddy who used to be an armorer property\" situation with them.",
            "I am waiting to see of Rooftop actually gets in the ODG USP-9 Experts before I jump.\n\nI have to say as far as fitting my hand, the USP45 is the second best fit in my collection. The full sized USP's of all calibers just shoot so damn soft.",
            "> braver\n\nThat's giving me too much credit, I'm just stubborn. Next week is gonna be hotter and there's no rain in sight for a bit, so I'm just playing with the hand we've been dealt.\n\nI intend to shoot the rifle match next weekend and the USPSA match the weekend after, then I get my NROI cert the weekend after that. Those will likely be my last matches until the state match, as I'm gonna be on paternity leave all through August.\n\nLet me know what squad you hop on when you sign up.",
            "Usually pretty short, I think the furthest I've ever seen was like 30 or 40 yards on a mini-IPSC to simulate a further shot. Their bays aren't that big, so even corner-to-corner on any of them would probably barely be 50 yards.",
            "Well, when I even *think I see* a Beretta 92, I upvote!\n\nFriday Buyday - I made an eye appointment and am probably getting my eyes touched up with the laser soon lol",
            "I honestly need to do more research in the models before jumping on one, but damn I want a USP bad, and those seem pretty great.",
            "Sounds good will do. I may have another friend or two who wants to come too.",
            "You just missed the deal of a lifetime at rooftop, 800 for a brand new USP 9MM V1.\nKeep an eye open I've seen other periodic deals that get close.\n\nUSP-9 is such a soft shooter, If you're not deeply invested in the platform you can get jet funnel 18 round mags and just run nothing but those.",
            "Cool cool.\n\nOh, I overheard from some people at the TSA why True North stopped running USPSA. Apparently whoever the MD is got tired of people complaining about \"illegal\" stage design and loose adhesion to the USPSA rulebook. Not sure if it's 100% accurate, but given it was changed to the \"Fun match\", it seems highly likely.",
            "I'd believe it, they were always much less high strung over there than at Sir Walter, which is why I liked that match so much. Also because it rarely filled up instantly like Sir Walter often does.\n\nFrankly it seems to me like as long as the classifiers are to-spec, then what does it really matter, but I suspect that difference of opinion is why I like shooting there and rules lawyers \"well ackshullied...\" them out of wanting to do it any more. And I like their falling steel match the best anyway."
        ]
    },
    "Official Politics Thread 2024-06-21": {
        "title": "Official Politics Thread 2024-06-21",
        "score": 37,
        "url": "https://www.reddit.com/r/guns/comments/1dl1h1q/official_politics_thread_20240621/",
        "content": "[The antis have lost their minds](https://giffords.org/analysis/the-supreme-courts-reckless-bump-stocks-decision/)",
        "num_comments": 166,
        "comments": [
            "PaaP, or Politics as a Personality, is a very real psychological affliction.  If you are suffering from it, you'll probably have a Bad Time™ here.\n\nThis thread is provided as a courtesy to our regular on topic contributors who also want to discuss legislation. If you are here to bitch about a political party or get into a pointless ideological internet slapfight, you'd better have a solid history of actual gun talk on this sub or you're going to get yeeted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/guns) if you have any questions or concerns.*",
            "Now bump stocks are allowed again people won't want them anymore.",
            "US Supreme Court Decision in United States v. Rahimi is out. Rahimi loses 8-1, (Thomas Dissenting) with the majority opinion focusing on the fact a court found he posed a credible threat to the physical safety of others when issuing the restraining order. Note, he did have a chance to challenge it, and consented to the restraining order.\n\nhttps://www.supremecourt.gov/opinions/23pdf/22-915_8o6b.pdf",
            "[The GVA tweeted](https://x.com/GunDeaths/status/1803558458886631440):  \n\n>YTD comparison of U.S. gun violence, this year vs. last year.  \n\n>So far, 2024 has seen:  \n\n>↓ Fewer gun deaths  \n>↓ Fewer gun injuries  \n>↓ Fewer children shot  \n>↓ Fewer teenagers shot  \n>↓ Fewer mass shootings  \n>↑ More defensive use incidents  \n>↓ Fewer unintentional shootings  \n>↓ Fewer murder-suicides  \n\nI would like to know how they think this is possible. We have an all-time high number of firearms in the US, 28 states with constitutional carry effective, all 50 states with shall-issue permits (well, for the most part), courts post-Bruen starting to smack down anti-gun laws, something like 100x \"ghost guns\" than last year, etc.",
            "The Trace, not satisfied with the low levels of media sensationalism about school shootings and mass shootings, decides to inflate the figures by now claiming [500 yards is nearby a school](https://www.thetrace.org/2024/06/shootings-near-k-12-schools-us-data-map/).  \n\n>In Chicago, our analysis found, there were 97 schools with at least 100 shootings over the last decade.  \n\nAh, let's casually drop the \"nearby\" wording and assume the reader won't notice and will now assume those are school shootings.  \n\n>There is a clear racial divide running through Washington, D.C. The vast majority of the population living west of busy 16th Street NW is white. East of the same street, the population is majority African American.  \n\n>Nearly all of the school-adjacent shootings identified by The Trace were on the eastern side of the district.  \n\nIt's gotta be white supremacists doing these, right? AG Garland [did say](https://thehill.com/policy/national-security/553161-biden-officials-testify-that-white-supremacists-are-greatest/) they are the biggest threat out there: \"the top domestic violent extremist threat we face comes from racially or ethnically motivated violent extremists, specifically those who advocate for the superiority of the white race.”",
            "Has any of the big CCW insurance companies like CCWSafe or USCCA ever actually published numbers on their members, i.e. how many members have called in to report an incident, how many were actually charged, and how many were convicted?",
            "**Turks and Caicos**  \n\nRealizing that their hard stance on ammo was about to devastate their economy due to a significant drop in tourism, the government has [repealed a mandatory minimum of 12 years in prison](https://www.foxnews.com/us/turks-caicos-backtracks-ammunition-law-landed-american-tourists-behind-bars) as punishment for firearms offenses.  \n\n>The country's parliament agreed unanimously to revise the new ordinance after \"a great deal of flacking\" from American lawmakers, the country's Newsline TCI reported.",
            "> The antis have lost their minds\n\nYou love to see it",
            "**SCOTUS**\n\nThe Supremes will be dropping more opinions today at 10 a.m. Eastern. Normally they only release opinions on Thursdays, but we're late in the cycle and they can't go on summer break until they release everything. This schedule isn't unusual, and they announce their schedule at the beginning of the week. \n\nWe're still waiting on *Rahimi*, and I would not be surprised if they dropped that one on their last day before adjourning for the summer. *Cargill* was released last Friday, and if memory serves, *Bruen* and *Dobbs* were both dropped on Fridays as well. \n\nIf you're a fucking nerd like me, SCOTUSBlog does a live chat when opinions are dropping.\n\nRAHIMI DROP INCOMING\n\nVote is 8-1 with Thomas dissenting, will read shortly.",
            "[*SNRK!*](https://reason.com/volokh/2024/06/19/when-i-see-an-animal-that-looks-like-a-duck-swims-like-a-duck-and-lays-eggs-like-a-duck/)",
            "From the linked article:  \n\n**The Supreme Court’s Reckless Bump Stocks Decision**     \n\nBump stocks turn regular guns into automatic weapons, and the Supreme Court just rolled back the ATF rule banning them.  \n\nToday, the Supreme Court struck down a federal rule banning bump stocks in Garland v. Cargill.   \n\nBump stocks are dangerous accessories that convert semiautomatic weapons into fully automatic guns that can fire hundreds of rounds per minute. After bump stocks were used to murder 60 people and injure hundreds more at the Route 91 Harvest music festival in Las Vegas in 2017—the deadliest mass shooting in modern American history—the ATF issued a rule categorizing bump stocks as machine guns and therefore banning their ownership.  \n\nNow, in a 6–3 decision, the Supreme Court has recklessly undone this lifesaving ban and allowed automatic weapons back into civilian life. In his decision, Justice Thomas uses a narrow, technical reading to reach his conclusion that bump stocks don’t cause the type of rapid fire that federal law defines as a machine gun, in spite of their ability to kill scores of people in mere seconds.   \n\n\nOur attorneys filed an amicus brief in Cargill arguing in favor of the ATF’s rule banning bump stocks, which Justice Sotomayor referenced twice in her dissenting opinion. She reinforced the commonsense position that bump stocks act like automatic weapons and therefore must be regulated like automatic weapons, writing, “When I see a bird that walks like a duck, swims like a duck, and quacks like a duck, I call that bird a duck.”   \n\nAdditionally, as our team delved deeper into the opinion, we discovered that the majority opinion propped its argument up with information and drawings from the Firearm Policy Coalition—an extremist gun rights organization with alarming rhetoric.   \n\nWhile this is a reckless decision from a right-wing court beholden to the gun lobby, it’s not the final word on bump stocks. Congress has the power to take immediate action to ban bump stocks in order to keep what are effectively machine guns off our streets. Without action, lives are at risk.",
            "So does anyone want to make predictions based off of Rahimi whether the court will take up the 7th circuit assault weapons challenges or they have just been taking so long because Thomas is writing another 30 page dissent?",
            "Banner has been updated.",
            "The 5th Circuit ruled against Paxton in Paxton v. Dettelbach in which plaintiffs were ruled against for lack of standing against the federal government. \n\nhttps://www.ca5.uscourts.gov/opinions/pub/23/23-10802-CV0.pdf",
            "[deleted]",
            "No one wanted them before. It was a scapegoat for whatever the fuck happened at the Vegas shooting that they are not telling us about.",
            "Hell, the day after it dropped people were here on Reddit asking when and where they could buy them.",
            "I don't see any problem with this one. Clear and present danger restrictions, just like the first.",
            "Based Thomas as usual",
            "We're finally moving into a Post-Post-pandemic phase socially. We saw some  initial quieting at the beginning of the pandemic, and then an explosion afterwards, and now things are returning to the slow decline in violent crime we've seen since we've seen since the mid 90's.",
            "It'd be interesting to know where they get the data from. If it's from the FBI well 37% of cities, including all the major cities, are no longer reporting crime data to the Feds.",
            "If you add in the nearby gun deaths in Ukraine, the US has the highest school shooting rate by a factor of 10.",
            "Man, I want to parody this by creating a site that uses 7,774 yards as \"nearby\" a school.  Mainly because at least then it would be the absolute longest range possible for a rifle.  Picking 500 just seems arbitrary.",
            "No because then they'd have to reveal how they never pay out like they claim they will if you need their legal assistance.",
            "Not insurance, ACLDN has:\n\nhttps://armedcitizensnetwork.org/2023-year-in-review",
            "And what would those numbers tell anyone? Some people won't get charged, some will, some will have actually committed a crime, some will get convicted because the jury didn't agree with them no matter what the hive mind thinks about their case...it's pretty useless information since no-one, not anyone on this earth, can indemnify you against being charged and possibly convicted. It will always come down to the facts of your case and the opinion of the prosecutor, grand jury, judge, etc.\n\nThe only thing an insurer can guarantee you is to pay up if the situation exactly matches the term of their contract, everything else is going to happen however it does.",
            "I mean, if you're trafficking in ammunition or firearms, feel free to lay down the ban hammer. But if you're just stupid and take a bag that you've carried a gun or ammunition in (most of the cases thus far) with you on vacation, well, that's not quite the same thing nor does it deserve the same punishment.",
            "They can't lose what they never had.",
            "About what I expected. Given the language in *Heller* and *Bruen* which reiterated that some regulations are presumably lawful, it doesn't seem surprising that they would uphold the prohibition on domestic violence abusers. \n\nOn the other hand, this would seem to not bode well for any attempts by Hunter Biden to constitutionally challenge the prohibition against drug users/abusers tossed. But I don't know if that line of argumentation made it into his defense. If it didn't, it would be hard to challenge, because the argument has to start at the trial court.",
            "Rahimi\nhttps://www.supremecourt.gov/opinions/23pdf/22-915_8o6b.pdf",
            "The real hiccup with Rahimi, IMO, is that the man himself clearly has no business anywhere near firearms. \n\nThe specific restraining order and related legislation that prohibited him from owning firearms was flaky as all hell, but he was as far from a sympathetic party as you could get. There were a mountain of other laws that could have been applied towards him to disqualify him from owning firearms, but none of those occurred. \n\nI applaud his public defender for taking the case to SCOTUS, they really went above and beyond for the guy. There's only so much you can expect when the court asks \"so you're saying your client shouldn't have guns?\" and your response is \"pretty much, but not because of *this.*\" \n\nBecause whether we like it or not, the court tries to be pragmatic, and if it is presented last ditch tool that is used to disarm deserving individuals, they weren't going to take that away.",
            "The loss was less than what it could be. In oral arguments, it was clear that 2A rights would be curtailed, thankfully they limited it to only the greater dangerousness concept. What wasn't address was a due process claim, probably because the appeal came form the solicitor general. \n\nThe thing I really wish was in this opinion would be a much greater explanation of the Text History Tradition methodology. The court just kind of applied it without providing any additional explanation. While I can see some courts clamping onto some language, I don't see any drastic shift in how courts would act as antigun courts will continue being antigun.",
            "[Antis when they pass very technically specific laws and then get mad when people create solutions that are compliant with those technical definitions.](https://imgflip.com/i/8ulebc)",
            "I've seen comments in other subs about SCOTUS \"allowing\" bump stocks, and this whole issue is demonstrative of the gulf between people who read the opinion and people who read the headlines.",
            "My favorite part is when they don’t mention that the decision was about agency overreach and not about the bump stocks. \n\n> Congress has the power to take immediate action to ban bump stocks in order to keep what are effectively machine guns off our streets. \n\n“Ok. That was always allowed.”",
            "> we discovered that the majority opinion propped its argument up with information and drawings\n\nThis line is very funny. In a case that is entirely depending on the technical definition of the word \"function\" it is clearly extremism to show diagrams and information that explain how a trigger functions lol",
            "> a narrow, technical reading\n\nAs an engineer who often has to use technical jargon to communicate, I'm going to just repeat something I say when people get annoyed at me for that:\n\nWords have meanings.\n\nThey have specific defined meanings and you can't just change that to be whatever you want it to be.",
            "> Bump stocks are dangerous accessories that convert semiautomatic weapons into fully automatic guns\n\n\n[WRONG](https://c.tenor.com/ezHTpJeCQi8AAAAC/tenor.gif)\n\n\n> the Supreme Court has recklessly undone this lifesaving ban and allowed automatic weapons back into civilian life.\n\n\n[WRONG](https://media1.tenor.com/m/dvKpIshSZaYAAAAd/wrong-scrubs.gif)\n\n\n> [Justice Sotomayor] reinforced the commonsense position that bump stocks act like automatic weapons and therefore must be regulated like automatic weapons\n\n\n[WRONG](https://c.tenor.com/z8IxIGwkSo0AAAAd/tenor.gif)\n\n\n> the majority opinion propped its argument up with information and drawings from the Firearm Policy Coalition—an extremist gun rights organization with alarming rhetoric.\n\n\n[WRONG](https://www.reactiongifs.com/r/wrong-gif-300x158.gif)\n\n\n> In his decision, Justice Thomas uses a narrow, technical reading to reach his conclusion that bump stocks don’t cause the type of rapid fire that federal law defines as a machine gun\n\n\n> ...\n\n\n> Congress has the power to take immediate action to ban bump stocks\n\n\n[Oh, yeah, they actually got that right.](https://crdpala.org/wp-content/uploads/2018/04/negan-701.gif) ",
            ">the majority opinion propped its argument up with information and drawings from the Firearm Policy Coalition—an extremist gun rights organization\n\n>Our attorneys filed an amicus brief in Cargill arguing in favor of the ATF’s rule banning bump stocks, which Justice Sotomayor referenced twice in her dissenting opinion\n\nDissonance says what?",
            "I love that when Sotomayor references their amicus brief, the Gifford's Law Center to Prevent Gun Violence it's reinforcing a common sense position. \nBut when the majority references the Firearms Policy Coalition it's propping up their argument with information from an extremist gun rights organization with alarming rhetoric.\n\n\"Our extremist anti gun rights rhetoric is common sense, unlike their extremist pro gun rights rhetoric!\"",
            "So the normal procedure would be for the court to grant certiorari to one or more of the cases. Somewhere in this thread, there's a brief summary of all the Illinois AWB cases, and the questions presented seem similar enough that they might consolidate the cases if they accept them. Or they may hear what they feel is the strongest case, issue an opinion, and then grant, vacate, and remand. \n\nRight now, it appears they're still circulating in conference, with no grant or denial of cert occurring yet. While justices may issue an opinion that dissents from the denial of cert, it's usually a short opinion, not a 30-pager. And it has no real meaning, other than to potentially signal a more effective argument to be made in future cases to achieve a grant of certiorari. \n\nEither way, it would appear that the justices are moving away from Justice Thomas' absolutist view on the 2nd Amendment, given the lack of support for his absolutist position in *Rahimi.*",
            "K",
            "> the extreme position some have that the 2nd Amendment is absolute and nobody can be denied their rights to bear arms for any reason.\n\nI don't think you'll find any statistically meaningful number of people who believe that.  \n\nI'm totally fine with people being disarmed while they're actually in prison, for example.",
            "They've been saying that since *Heller,* reiterated it in *McDonald*, and again in *NYSRPA v Bruen.*  Lay people can have whatever opinion they want. But the court has been reasonably consistent on this topic over the last 16 years (since Heller was decided). \n\nI think a lot of that mentality is a result of the polarized culture war we consistently find ourselves in. One side is constantly encroaching, imposing themselves on the law abiding because a lone criminal has done something, using whatever means is available to accomplish their goal. The other side, which has compromised multiple times over the years, sees a never ending attack on their rights. So the other side is left with an absolutist approach, pointing to the 2nd Amendment and shouting \"shall not be infringed.\" I'm hard pressed to think of a provision of the Bill of Rights that is absolute. There are provisions for restricting free speech under specific, limited circumstances, there are exceptions to the warrant requirement, statements by a subject may be allowed under certain circumstances, etc.",
            "They did during the ban. Telling people they can't have something creates a demand.\n\nAs for Vegas it reminds me of the 1982 rampage in South Korea where a drunk cop massacred 56 people for no clear reason. The only apparent motivation was that he was demoted to a village job and his girlfriend woke him up by swatting a fly on his chest.",
            "I remember some comments that were like \"Now mass shootings are easier than ever!\" like the Vegas set up wasn't the most insane, perfect situation that was a security failure on many levels and like every other mass shooting ever DIDN'T use a bump stock",
            "The Vegas shooting conspiracy angle is interesting to me. \n\nThere's lots of weird stuff in that hotel room that doesn't make sense to a rational person. But given his family history it's entirely possible that there was an underlying mental illness that caused him to finally go.",
            "Dude, the day it dropped there were postings on gundeals.",
            "Ultimately the guy involved in this case was a total thug which weighed heavily on the outcome but that doesn't change my mind that a restraining order on its own should be the basis for denying anyone their 2A rights. \n\nThe bar for a restraining order and/or a red flag law is pretty low. I get in this case they focused on his past history of violence but federal law still dicates no matter what your criminal history is that you are to be disarmed if you're under a restraining order. All it takes is one woman and one judge to issue one. The judges most of the time have an incentive to issue one because in the off chance they don't issue one and the spouse does something it makes the optics for the judge look terrible.  Also their is already legal mechanisms in place to ensure the safety of a potential DV victim without this gun ban in place.",
            "Nah, This is Thomas just doing whatever the fuck, there's a reason he's sole dissent here.",
            "The decline in violent crime is one of the stats that tells me we really aren't failing as a society despite some people's opinions.",
            "Don't need to go that far, the current policy seems to be to abolish the border with Mexico.",
            "Update the list every time the longest confirmed sniper kill record gets broken.",
            "Is there even examples of them covering anything? I've always been very skeptical that any of them do anything but collect premiums and advertise on social media",
            "What's even more stupid is that the people who were caught...were on the way out.",
            "They expounded a bit on how to apply Bruen. Anybody smarter than me want to guess at how that might affect the AWB challenges that are making their way through the courts?",
            "I can't wait for the mental gymnastics from the left on this one. They've been ranting day and night after the bump stock opinion how SCOTUS is owned by the NRA, the conservative court doesn't care about violence, etc. Now we get an opinion on a case that is clearly 2A related that mainly aligns with their anti-gun rights paradigm and it'll be mostly crickets about how the conservative justices treated this case.",
            "> On the other hand, this would seem to not bode well for any attempts by Hunter Biden to constitutionally challenge the prohibition against drug users/abusers tossed.\n\nI strongly disagree.  The majority in *Rahimi* explicitly stated that the TRO provision is facially acceptable because it includes a process by which the right is infringed upon.  True, Rahimi didn't raise due process concerns so they didn't comment on the process outlined by the law being adequate.  That doesn't matter though as several categories of prohibited persons have no process attached to them at all.\n\nMost egregiously is the category for illegal users of drugs because it's not a prohibition after conviction as purchases are stopped cold should you admit to being an illegal drug user.  The 4473 is even explicit about this now as it states that the use of marijuana where in states where it is legal still prevents the transfer of the firearm due to marijuana being illegal.\n\nIn other words, if Hunter Biden couldn't own guns now that he's been convicted of being an illegal drug user *Rahimi* would make it harder to overturn.  His conviction though is the first time that a court or jury reviewed whether or not he was a user of illegal drugs.  *Rahimi* should, hopefully, kill that if he appeals it.",
            "Personal opinion. \nI think drug use is different from drug distribution, and I think drug use is different than domestic violence, and drug use is different than discharging a weapon into someone's home to intimidate them.\n\nIs deciding it is constitutional to restrict firearms possession from violent people threatening others and discharging their weapons, mean it's constitutional to restrict firearms from anyone who alters their mental state with a chemical on an arbitrary government list?",
            "This one is a slam dunk easy case for both sides, no one wants the dude hitting kids to own a gun",
            "This is bad.  If I had any faith in the lower courts this would be a fine decision, but it immediately concedes a number of terrible points to the antigun side that can be abused.\n\nIt quotes “is not unlimited”.  That’s the main wording they use to justify ANY gun law.\n\nIt quotes “it extends to arms even those not in existence” yay that’s good.  but then…\n\nIt immediately waters down Bruen by saying “it doesn’t have to have a law in 1797, just to be generally consistent with our historical traditions blah blah”.\n\nThe antigun courts are going to take this inch and run miles and miles more than they already had.\n\nRed flag laws and disarmament of all misdemeanors are on the table now.\n\nI really cannot believe that after 3 appointments we still have a generally moderate court that is still leaning left on gun laws. We need more and that’s insane. The court needs to strike down AWBs this term otherwise I am not sure what the long term solution is here to what should require an obvious amendment.",
            ">I applaud his public defender for taking the case to SCOTUS\n\nHis public defender didn't take it to the SCOTUS, the Solicitor General appealed the case, and set the question. That's why the question is only about can the government disarm a person deemed dangerous, nothing about the exact process short of it requires \"notice and hearing.\"",
            ">The real hiccup with Rahimi, IMO, is that the man himself clearly has no business anywhere near firearms.\n\nThe Miranda case (as the origin of your Miranda Rights) involved Miranda confessing to kidnapping, raping, and robbing a woman. That's basically the ultimate standard for 'not a sympathetic party'.",
            "The average American has absolutely no idea about how the courts system in the US works. I'm skeptical of tests to be able to vote because of how they could be abused to disenfranchis people, but idk maybe we could make some test akin to the citizenship test a requirement to graduate high school?",
            "My favorite part of this whole thing was a top post in one of the r/politics threads about this. The poster was having a meltdown, wailing that the Supreme Court shouldn't be allowed to change laws and pseudo-legislate.  \n\n\nTell me you have no clue what the case was actually about without telling me you have no clue what the case was about...",
            "\"Drawings\" reminds me of this classic supreme court ruling.\n\n\nhttps://youtu.be/Hyph_DZa_GQ?feature=shared",
            ">Words have meanings.  \n>  \n>They have specific defined meanings and you can't just change that to be whatever you want it to be.\n\nThank you!\n\nI've been trying to make people understand this for a long time.\n\nWhen dealing with things like the Constitution you have to research how the word was used and what it meant then.  You can't use the modern word meaning.\n\nFor example.  In classic literature you see the word faggot, they are referring to small sticks.\n\nIn literature during the WWI era you see the word faggot and they are talking about a cigarette.  \n\nNow, faggot means something entirely different.\n\nWell regulated doesn't mean what the anti-freedom people think it means.  In the era of the Constitution it means in working order.",
            ">\\[Justice Sotomayor\\] reinforced the commonsense position that bump stocks act like automatic weapons and therefore must be regulated like automatic weapons\n\nI absolutely hate this one. I saw a bunch of politics dingdings saying \"Oh well it complies with the letter of the law but everyone *knows* it is *basically* an MG\" like holy shit the law is not based off of vibes! Why do you guys want to give government agencies unlimited overreach? We should be mad Congress can't do anything right, not empowering unelected officials in government agencies.",
            "I can hear that Dr Cox gif",
            "It's not worth engaging these guys, Tab. This is the same dude that said he'd trade his gun rights away for the trainwreck that is Medicare. A true temporary gun owner",
            "Don’t engage too much. Before long he will delete his comment.",
            "[deleted]",
            "The human mind just really struggles to understand randomness and is always looking to establish causation, especially with a negative outcome. You saw this during COVID and the popularity of the \"lab leak\" theory, if COVID leaked from a laboratory due to something like negligence or incompetence, then that's something you can prevent from happening again through legislation or policy changes, but if it was just a random mutation of a naturally occuring virus, then there's nothing we could have done to prevent it nor do anything to prevent it from happening again, and that's just something lots of people cannot intuitively comprehend. \n\nThere's a reason why statistics & probability was one of the last fields of mathematics to be developed, it's just antithetical to how the human mind thinks.",
            "More like a M240B.",
            "Fed",
            "What's funny is I had opportunities to 'acquire' bumpstocks while they were banned that I almost took up on, but now that I can readily acquire them I'm not all that interested anymore lol",
            "If you have a problem with the low evidence burden of DV restraining orders, you should be targeting them. There are more rights lost by being targeted by restraining order than just your right to bear arms. But I stand by what I said. Restraining orders are theoretically put in place because someone presents a threat to someone else, and I see no reason why someone who is a clear and present danger should be allowed to possess arms which make them even more so. These aren't reformed felons or college stoners we're talking about. DV is bad. Real bad. There is no moral or constitutional reason to make it worse. ",
            "All are good arguments but, unfortunately, Rahimi only raised a facial challenge to the GCA section he contested instead of a due process one.  That means that all the Supreme Court really could rule on is whether or not the law as written violated the Constitution under the THT established by *Bruen*.  The opinion is full of people strongly hinting that raising a due process issue might get them to rule differently.",
            "You should check the recent rule changes Biden made at the border, we sending them back home plus Texas is just shooting them with bean bags now lol",
            "Actually, the longest sniper shot is 4,156 yards set recently in Ukraine.  The distance I picked is the [longest distance any rifle has hit a target ever](https://www.themeateater.com/hunt/firearm-hunting/7-774-yards-new-world-record-rifle-shot-set-in-wyoming).  But yes, the idea would be to update it every time a new record is set.",
            "One important thing to remember: it is basicaly universally illegal to issue an insurance policy that in any way 'rewards' committing a crime. This includes any liability or other coverage that covers an intentional act on your part.\n\nIn order to be legal, the insurance policy would be required to have a clause that automatically denies coverage if you are found guilty. New York recently fined several companies for violating this rule. This is why, these insurance policies usually work by reimbursing you for your legal expenses AFTER you receive a not guilty verdict - requiring you to front all of the legal fees yourself.",
            "I think the immediate fallout if any from this case will be NY, CA, etc expanding what misdemeanors crimes disqualify people from firearms ownership.\n\nI can't recall if it was NY or Cali trying to strip people convicted for misdemeanor \"hate crimes\" of their 2A rights, but I would expect that to be a 1st step towards low hanging fruit in many blue states.",
            "The fact that they quoted “is not unlimited” and “doesn’t have to be a perfect analogue to 1791” means they will continue to uphold AWBs in most circuits.  The only good thing they gave in Rahimi is reiterating “applies to all future arms as well”",
            "There's a list of cases that keep circulating for conference at the Supreme Court. In theory, one of the cases below could be granted, argued, and decided and address that question. Playing the slow roll game of waiting for a case to get to the Supreme Court after one of these rulings is a dangerous game - see what happened to Justice Ginsburg. You never know who will be in office when a given justice passes away and gets to select the replacement.\n\nThe cases still pending after conference:\n\n**Herrera v Raoul**, 23-877\n\nIssues: (1) Whether the Constitution allows the government to prohibit law-abiding, responsible citizens from protecting themselves, their families, and their homes with semiautomatic firearms that are in common use for lawful purposes; (2) whether the Constitution allows the government to prohibit law-abiding, responsible citizens from protecting themselves, their families, and their homes with ammunition magazines that are in common use for lawful purposes; and (3) whether enforcement of Illinois's semiautomatic firearm and ammunition magazine bans should be enjoined.(relisted after the May 16, May 23, May 30, June 6 and June 13 conferences)\n\n**Herrera v. Raoul**, 23-878\n\nIssues: (1) Whether semiautomatic rifles and standard handgun and rifle magazines do not count as \"Arms\" within the ordinary meaning of the Second Amendment's plain text; and (2) whether there is a broad historical tradition of states banning protected arms and standard magazines from law-abiding citizens' homes. (relisted after the May 16, May 23, May 30, June 6 and June 13 conferences)\n\n**Barnett v. Raoul**, 23-879\n\nIssue: Whether Illinois' sweeping ban on common and long-lawful arms violates the Second Amendment. (relisted after the May 16, May 23, May 30, June 6 and June 13 conferences)\n\n**National Association for Gun Rights v. City of Naperville, Illinois,** 23-880\n\nIssues: (1) Whether the state of Illinois' ban of certain handguns is constitutional in light of the holding in District of Columbia v. Heller that handgun bans are categorically unconstitutional; (2) whether the \"in common use\" test announced in Heller is hopelessly circular and therefore unworkable; and (3) whether the government can ban the sale, purchase, and possession of certain semi-automatic firearms and firearm magazines that are possessed by millions of law-abiding Americans for lawful purposes when there is no analogous Founding-era regulation. (relisted after the May 16, May 23, May 30, June 6 and June 13 conferences)\n\n**Langley v. Kelly**, 23-944\n\nIssues: (1) Whether the state of Illinois' absolute ban of certain commonly owned semi-automatic handguns is constitutional in light of the holding in District of Columbia v. Heller that handgun bans are categorially unconstitutional; (2) whether the state of Illinois' absolute ban of all commonly owned semi-automatic handgun magazines over 15 rounds is constitutional in light of the holding in Heller that handgun bans are categorially unconstitutional; and (3) whether the government can ban the sale, purchase, possession, and carriage of certain commonly owned semi-automatic rifles, pistols, shotguns, and standard-capacity firearm magazines, tens of millions of which are possessed by law-abiding Americans for lawful purposes, when there is no analogous historical ban as required by Heller and New York State Rifle & Pistol Assn, Inc. v. Bruen. (relisted after the May 16, May 23, May 30, June 6 and June 13 conferences)\n\n**Gun Owners of America, Inc. v. Raoul**, 23-1010\n\nIssue: Whether Illinois' categorical ban on millions of the most commonly owned firearms and ammunition magazines in the nation, including the AR-15 rifle, violates the Second Amendment.(relisted after the May 16, May 23, May 30, June 6 and June 13 conferences.)",
            "Those talking points will be conviently ignored as their understanding of SCOTUS cases doesn't go beyond sensational headlines.",
            "They'll use it to snipe at Justice Thomas, individually, since he was behind the Cargill ruling on bump stocks and stood alone in challenging the domestic violence gun ban in this case. Plus the various ethical allegations against him and his wife. Look for arguments about how it's time for him to go and he couldn't get one justice to side with him on his \"extreme views\" in Rahimi.",
            "Yeah the bump stock ban wasn't even a 2A case. It was the fact there is a plain definition of a firearms term that ATF has to follow. Also ATF does stupid shit like tolerate pistol braces before trying to ban them. \n\nI'm left wing but even I was rolling my eyes at the \"Strict Scrutiny\" podcast where they talked about bump stocks.",
            "It's not that - it's that most folks on the left reject the entire text, history and tradition paradigm instituted by Bruen.  It's not wholly unreasonable to think that the second amendment should consider governmental interests and scrutiny balancing like the analysis of every other constitutional amendment. \n\nAnyway, that they had to walk back Bruen with Rahimi to make sure that the Second Amendment applied to firearms beyond muskets and sabers is not exactly lunatic ranting - it's in the express text of the decision, twice.  Plus, refusing to disarm domestic abusers isn't exactly politically palatable.  There are plenty of ways to read this decision and believe that the court is fundamentally in the bag.",
            "Has he actually been convicted of being an illegal drug user? Or was he convicted of lying about being a drug user on the form? I don't know there's an actual federal charge for illegally using drugs, unless you happen to be in a federal facility or on federal property. But because the US provided evidence that he was still using drugs in close proximity to the purchase of the firearm, both before and after, they were able to prove to the satisfaction of the jury that his statement was false and thus a violation of the law. Ditto with signing the 4473 attestation. \n\nAs for your second paragraph, in theory, one could be prosecuted for falsely answering the drug use question on a 4473 and signing the form and having a NICS check come back with a disqualifying arrest or conviction. I believe that was the issue with the shitstain who shot up the church in Charleston, SC a few years back. He had an arrest (not a conviction) for a drug-related charge, but the FBI couldn't find the right agency to confirm the charges and their disposition, so the transaction was allowed to proceed. After having 12 hate crime charges filed federally, there really was no need to prosecute him for lying on the 4473.",
            "Obviously, drug use is different from distribution. Just as back in the days of Prohibition, the consumption of alcohol was not penalized nearly to the extent that the production, transport and sale of alcohol was. And, yes, drug use in one's own \"space\" without endangering others is different than the use of violence against a domestic partner. Ditto with discharging a weapon and drug use. I don't believe I've argued they are the same. \n\nAs for your second question, I believe that Rahimi's discharging of firearms (which may be a separate and distinct crime) post-dates the domestic violence restraining order. As for whether it's constitutional to restrict firearms from anyone using drugs, that would be a question for the Supreme Court. But considering that *Heller* first used the phrase to \"law-abiding, responsible citizens\" in the context of being entitled to 2nd Amendment protections, as well as the court's reference in the *Bruen* ruling on the test of \"how and why the regulations burden a law-abiding citizen's right to armed self-defense,\" I suspect the court would probably take the view point that if Congress wants to legalize the use of certain substances in all or most cases, they are free to change the law to do so.  But I suspect that Congress would, rightly, retain some prohibitions on citizens altering their mental state while engaged in certain activities, like operating vehicles engaged in interstate commerce (whether they be trucks, buses, trains, planes or boats).",
            "The unfortunate thing is that oftentimes the defendants in cases that make it to the Supreme Court are not the best human beings. Take *Miranda v Arizona*. This is the case that got us the Miranda warning about the right against self-incrimination during police interviews/interrogations. Miranda was accused of kidnapping and rape. The Supreme Court overturned his conviction and remanded the case back to a lower court for retrial. That trial, using different evidence, also saw him convicted, Apparently, he did around three years between the original conviction and the overturning of his conviction and then another five years after his second conviction before he was paroled. Four years after being paroled he was stabbed to death in a bar and, although a subject was identified, there was insufficient evidence to try him. So, a real shitbag, but provides protections for all of us.",
            "I fully expect a nationally coordinated \"Bruen 2 Electric Boogaloo\" response-bill in most Blue and possibly some purple states.\n\nThey will likely try for lower hanging fruit, like state level prohibitions which match the Federal ones and adding in things like probations for people convicted of misdemeanor hate crimes, crimes against children, even possibly prohibitions for people behind on child support.  \n\n\nI don't foresee California trying to go full on extreme \"all criminal convictions disqualify you from your 2A rights\" , yet.\n\n\nEdit: They will likely save a more *vast* expansion until the SCOTUS makeup is more favorable.",
            "They've been saying \"is not unlimited\" since *Heller*, in *McDonald,* and *NYSRPA v Bruen.* This isn't new language and it's been repeatedly telegraphing a result like this. \n\nFolks overlooked *NYSRPA v Bruen* and think it was a 6-3 ruling when, in reality, three justices (Alito, Roberts, and Kavanaugh) all expressed that there were limitations to the 2nd Amendment as noted in the earlier cases. The three were expressing clearly that they agreed with the ruling on the question in *NYSRPA v Bruen*, but did not automatically extend that ruling to other restrictions/prohibitions.",
            "I wonder if it’s bait to get the circuits to move on the various AWBs that they keep slow rolling to avoid a split. \n\nThen they can pee pee slap the AWB for good",
            "> I really cannot believe that after 3 appointments we still have a generally moderate court that is still leaning left on gun laws.\n\nIf the 3 most activist justices on the court were clones of Thomas instead this would have been a 5-4 decision with the same end result. It's appalling how poorly the 2A is treated in nearly all courts.",
            ">I really cannot believe that after 3 appointments we still have a generally moderate court that is still leaning left on gun laws. We need more and that’s insane.\n\nNew idea:\n\nWe reduce the number of Supreme Court seats to one, it's just Clarence Thomas",
            "You guys don't get it.  They had to.  You want pure history stuck in 1791 - then the word arms only applies to weapons existing in 1791.  You get the history test and don't have to be disingenuous about it.  There is a reason you got 5 conservative justices to sign on.",
            "He lost at trial in the District Court, initially lost at the Court of Appeals for the Fifth Circuit, but then Bruen came out and the court reconsidered their ruling in light of Bruen and vacated their previous ruling and overruled the District Court. \n\nAs a side note, it highlights the interesting twist in how cases are referred to by the Court system. In the initial case (in a criminal matter), it's the entity prosecuting v Defendant. So, United States v Rahimi. When Rahimi initially appealed, it was considered at the Court of Appeals level as Rahimi v United States, since Rahimi was the one challenging the outcome. When he won and the US appealed to the Supreme Court, it reverted to US v Rahimi. Likewise, in Miller, the trial judge ruled the NFA was unconstitutional and the US appealed that ruling to the Supreme Court, so it was U.S. v Miller. But in the Heller case, it was Heller who originally sued the District of Columbia, got a favorable ruling from the Court of Appeals for the DC Circuit, which resulted in the District appealing that ruling, hence the styling DC v Heller.",
            "I'm aware. \n\nHowever, Clarence Thomas, the day's lone dissenter, has often pointed out that the right to keep and bear arms is routinely and erroneously treated as a \"second class right\" by lower courts, and historically, SCOTUS isn't much different. \n\n I don't think our nation's highest court has ever decided a 2A case in favor of an unsympathetic party, unlike just about every other constitutionally enumerated right. For whatever reason, guns are always different. The challenges that have succeeded have always been picture perfect.",
            "They don't understand that the bump stock \"regulation\" was changing the wording through an administrative process and applying it to the statute. When the statute defines a term adequately, there is no justification for an agency adding to the definition that Congress (the elected representatives of the people <hah hah>) enacted. But they don't get that. There's a process for amending laws, they just don't want to follow it.",
            "The SC does not have the authority to change laws but they most certainly do have the authority to nullify them.  Not that this applies to bump stocks since it was never a law in the first place.",
            "/r/politics is chocked full of some of the most idiotic people online.  99% of the posts there are from disinformation websites with absurd titles and insane misinformation from sites like Slate and Huffpost.  It's a circlejerk sub for paid-mods, bots, and super-far-left people.",
            "She's a \"living Constitutionalist\":  an unprincipled authoritarian who does not believe her role is to enforce the law, but to remake the law into what she believes it should be.  Her whole professional existence is \"Sure the law says X but I want Y and I'm in charge so go fuck yourself.\"  \n\nThis what we get when we elect the sort of Presidents who appoint this sort of justice, and for the most part it's what those Presidents' voters *want.*",
            "Don't worry!  I wasn't debating:  I was antagonizing.",
            "> This is the same dude that said he'd trade his gun rights away for the trainwreck that is Medicare. A true temporary gun owner\n\nDamn I would trade the other way, remove the NFA but give universal medicare. That is how we should be doing this, social policy for the left and give (back) the right more rights",
            "Or as we used to call them when gun buybacks were more frequent, /r/applebeesgiftcardowners. ",
            "[deleted]",
            "And there's the deletion. \n\n\nThat should be ban-worthy",
            ">They've been given access to weapons the writers of the 2nd Amendment couldn't have ever envisioned\n\nCorrespondence exists between gunsmith Joseph Chambers and several of the founders and higher-ups of the US government attempting to interest them in his newest invention: [the 224 shot flintlock machine gun](https://www.forgottenweapons.com/chambers-flintlock-machine-gun-from-the-1700s/)\n\n\nSamuel Pauly invented self-contained cartridges in 1808.\n\nThe fundamentals of modern firearms absolutely existed during their lifetimes, and they were at the very least aware of some of them.\n\n\nThey weren't foolish people, to think that any of them believed that firearms would permanently remain as they were is wrong.",
            "You mean like the internet?",
            "Given stuff like the Sverdlovsk anthrax outbreak happened it wasn't that unreasonable. The stuff about Bill Gates microchipping people was nuts though.\n\n>If there is something comforting—religious, if you want—about paranoia, there is still also anti-paranoia, where nothing is connected to anything, a condition not many of us can bear for long.",
            "I definitely agree with the principle of your argument.  I will add, though, that as someone working in medical molecular diagnostics, the lab leak theory is the most likely in my opinion.  Even before the shutdowns, those of  us working in the lab were talking about the virus, and the liklihood of a lab leak was the general consensus.  The Wuhan lab had terrible training, poor safety audits, and often disregarded proper protocols. Add to that, the strains they were using and type of gain of function research they were conducting, it's quite likely someone got infected, easily a lab assistant or janitorial staff and spread it from there.  \n\nIs it plausible to be from the wild and that it made it's way through the market? Yes,  but it should also be noted that this particular mutation leading to sars-cov-2 had not been identified in the animal population.  Very similar ones were,  but not that one.  Altogether, it would be one hell of a coincidence for it to have originated in the one city in this region with that lab doing that particular research.  \n\nOf course, as someone already commented, the main people originally screaming about the lab origin often made it sound as if it was intentional and designed.  There is absolutely NO proof of that and plenty of evidence against it. They also expressed many other nonsense conspiracies.",
            "Stfu moron",
            "I do have a problem with restraining orders. If they present a clear danger to themselves, others, or the victim complainant (hopefully meeting the probable cause standard) then they need be criminally charged and arrested. Once they are charged then the judge has discretion of whether to keep them in jail thus keeping the victim complainant safe. Even if the judge grants bail, the judge can put into the bail agreement that the defendant cant have any contact with the victim complainant thus theoretically keeping him/her safe. Even if at this stage the firearms are surrendered at least the defendant is actually being charged and also being afforded their full rights (right to councel, a public defender if one cannot be afforded, etc).  \n\nWith a restraining order in force in absence of a criminal charge you are being deprived of your rights without being charged. You have to pay an attorney to fight this (since a public defender cannot be given to you since you are not being charged) and you cannot have this reviewed by a jury. Like I wouldn't have an issue with a restraining order ban as long as it is accompanied with a related DV criminal charge. My ultimate issue with this is that this is a very likely 5A and 2A violation all being done in the name of safety for a crime victim. \n\nThe PROCESS is what makes this consitutional.  How can you say someone who is stripped of their gun rights is being afforded full due process of law (which is what the 5A requires) when it comes to the low evidence standards of a restraining order gun ban and NOT being violent enough to warrant a criminal charge?",
            "Some of the Republican rhetoric of \"deport them all\" never seemed feasible to me. But damn, the apparent Democrat policy of \"open borders, sanctuary cities, and just keep these people in perpetual legal limbo\" is just bonkers. I'm glad to see the Biden administration take the reigns on it a bit, even if it is just an election year performance. We're definitely in need of immigration reform.",
            "If they do that it might make the court actually set a due process standard for it than what they have pinched off here.",
            "> they will continue to uphold AWBs in most circuits.\n\nWe'll see.  The shit justices will obviously vote against gun rights regardless of the issue, but \"assault weapon\" bans are basically impossible to defend if you're not in a venue that has no concern at all for the truth, like a media venue, social media argument, or one-party courtroom.  \n\nI do *not* envy the officials who have to stand before the Court and explain why it's absolutely crucial that we magic-up an exception to an enumerated Constitutional right to combat the terrible scourge of [checks notes] ah, \"people's semiautomatic rifles having pistol grips on them.\"",
            "INB4 every antigun judge selectively cites the first line of that paragraph and ignores the rest of the paragraph.",
            "SCOTUS has actually never decided an AWB type case. They have refused to hear challenges in the past but they have never decided a case. Honestly I think an AWB case is VERY likely to be heard within the next 2 years. An AWB case is a tough to hear at SCOTUS purely due to circumstance which I'll layout below.\n\nSo SCOTUS generally speaking will only hear a gun case where the circuits have made split decisions. This was true with bruen and the bump stock case. The problem with an AWB is the fact that all the states that have passed them fall under VERY heavily liberal judicial circuits thus results in uniformly upholding them in court. I hate to say this but another state (that falls under a heavily conservative circuit) is going to have to pass an AWB then it will have to be challenged in federal court to be VERY HOPEFULLY be overturned in order to create a split where SCOTUS will then take the case. The only state I can see this happening is Michigan since they are a Democrat state and they fall under the 6th circuit which is heavily conservative.",
            "That was the bargain.  If you have a strictly historical test that the 5th Circuit wanted - you couldn't say all regulations are in amber in 1791 but the word \"arms\" is the only evolving part of the statute.  You end up having the Second Amendment only apply to \"muskets and sabers\"  SCOTUS found a way out of that trick bag - so they basically had to walk back the pure history test in Bruen.  Should put red flags laws on pretty solid legal ground as well.",
            "To add, these cases have been circulated for conference 6 times already. Note that most cases, 2A or not, typically only circulate 3 times at most before being accepted or rejected. This basically implies that there is someone that is seriously pushing the cases with a couple of justice waffling, someone is writing a scathing dissenting opinion to their rejection, or there could be discussions of a summary disposition on at least one of the cases.",
            "Awesome list, thank you!",
            "> whether the \"in common use\" test announced in Heller is hopelessly circular and therefore unworkable\n\n\nI'd like to see a ruling on this. I agree with the part of Breyer's dissent in Heller where he points out the common use standard is circular logic. He specifically cites machine guns, and the fact that the only reason they aren't in common use is because they've been de facto banned for so long.",
            "Hunter was convicted on three charges one of which was being a prohibited person in possession of a firearm due to his illegal drug use.  The other two were for lying on the 4473.  At least, that's what I can find as I haven't read the conviction paperwork directly.  In any case, it was his drug use that made him prohibited prior to being convicted for lying on the form.",
            "Roper v. Simmons is a similar landmark case.",
            "My fear is that the 2nd circuit is going to use this to uphold the CCIA and the state is going to double down on it.",
            "Better combine that with some immortality technology *pronto,* or that's going to turn out very badly.",
            "I’d prefer an electoral college version where at least 2 would need to be from rural areas and the other 5 represent various regions of the united states.  As it stands now only Barret is from the midwest in any capacity.",
            "I think it's less that people don't understand and more that they just don't care. It's about the results, not whether any of the rules or procedures were followed. \n\nWe saw it with *Dobbs* as well. People lost their shit about legislating from the bench, completely forgetting that *Roe* and *Casey* were ... legislating from the bench.",
            "Exactly! It's clearly defined in the law. A single action of the trigger. The stock doesn't change how the trigger works or add anything to it. It still requires multiple actions of the trigger to fire more than one round. Something like a cam mounted on an electric drill that actuates the trigger could be argued to be an extension of the trigger mechanism, making the single action of the trigger firing multiple rounds the act of depressing the trigger on the drill. But a bump stock doesn't interact with the trigger at all.",
            "95%+ of reddit is bots, teenagers, and the terminally online",
            "A lot of people right now prefer results driven government vs process driven government.",
            "I'm fairly sure the other party would be quite happy to have the court rule they win every election forever though.",
            "This applies to the entire Supreme Court but I agree",
            "You're very cute. And the age would explain your inability to understand nuance. I hope the rest of your life is as wonderful as you are.",
            "Ahh...I've got ya beat.  I've owned guns since the 1970's and you're an idiot.",
            "I like the girandoni air rifle since it saw military service abroad and was most famously sent with the Lewis and Clark Expedition.",
            "That’s different, the internet wasn’t designed to kill people!\n\n/s",
            "That was the core problem with the \"Covid came from a lab\" people is that they were also the ones carrying a torch for every other nutjob theory related to it ranging from \"it's a Chinese bioweapon\" to \"the whole thing is a hoax\".",
            ">Of course, as someone already commented, the main people originally screaming about the lab origin often made it sound as if it was intentional and designed. There is absolutely NO proof of that and plenty of evidence against it. They also expressed many other nonsense conspiracies.\n\nIt's important to distinguish between accidental lab leak and intentional release of a biological weapon. Whatever the cause, the medical establishment didn't do itself many favors by coming out as it spread and providing \"authoritative\" guidance that people should slap some type of cloth on their face and that would be sufficient to reduce the risk of transmission (it wouldn't) and then later admit that guidance was bogus because they were trying to preserve medical-grade masks for medical settings.",
            "So then you have a problem with the very nature of restraining orders, and should be focusing on getting those declared unconstitutional and not the restrictions on 2A rights that accompany them. ",
            "> immigration reform\n\nWe need to stop telling the world that we are the best place on earth or help make our southern neighbors safer places to live. We should have put manufacturing in Central America instead of China so they would have a chance at a decent life instead of having to come to us. I think everyone would agree it's worth the fight to live in the US instead of Honduras",
            "The issue is going to be states slow-playing a restoration of rights for people who have a restraining order ended. In Illinois that is up to a 1 year process, I am sure its not easy in Cali either.",
            "I don't want to stir the pot with you, but I've seen you make that *pistol grip* point many times now, and I don't really find it to be a meaningful insight into the minds of the antis.\n\nIt has never been about pistol grips or bayonet lugs, and never will be. These accessories are just a means to an end: that end being restrictions on semi autos primarily of the mag fed variant. Attack commonalities within this category of weaponry, and you've successfully regulated a massive portion of the market.\n\nThis doesn't boil down to boomers scared of pistol grips and I can't imagine that that will end up being the primary focus of any AWB court case. The semi autos themselves will be, even if different avenues have been taken to restrict them in different places.\n\nI can't help but think that the talking point of \"these out of touch aging boomers who are afraid of pistol grips\" is in itself an out of touch point. Semi autos themselves are the target and their capabilities are what will be discussed in the courtroom, silly little accessories may get talked about but they were never the actual focus of gun legislation.\n\nBoomer Karen and her grandson Zoomer Kyle don't actually care that your AR has a pistol grip, they care that you have an AR in the first place. Same goes for anti gun judges and politicians all over the country.",
            "Common use for lawful purposes (*Heller*) should be enough precedent for ending AWBs and restrictions on standard capacity magazines.",
            "It will be amusing if that happens in the 7th despite the ruling seems targeted at them with their test saying the AR-15 is super militaristically dangerous.",
            "Thank SCOTUSBlog. I just cribbed it from them and their writeup.",
            "This is absolutely true.  At least 90% of commentary on SCOTUS rulings is about who won and who lost, with no consideration at all for whether the decision was legally correct.",
            "How many times does SCOTUS need to literally say \"Congress needs to do their damn jobs\" before it sinks in?",
            ">I think it's less that people don't understand and more that they just don't care\n\nBingo.\n\n\nIt isn't stupidity, it's malice. They recognize politics for what it is, the right largely does not.",
            "It's maddening. I view the \"rules of government\" as a protection from when the people j don't like are in power. I just want both sides to follow the rules, and don't understand people who don't. Both sides scare me and honestly my ideal government is a split executive/congress. If you don't like the rules there is a process to change them. I regularly vote against \"my side\" when the incumbent tries to pass obviously unconstitutional laws and it blows my mind that other people dont.",
            "They would until the shooting started. \n\nI’m no accelerationist, and I don’t see a happy ending to the US given the last twenty years (whether than happens in 10 years or 100), but the leftists who think that once they have unilateral power they can really grind their boots down on people’s necks are in for a very rude awakening. \n\nHeck, even people like Schumer (whom I utterly loathe) is smart enough to see that some people on his side are pushing too hard and too fast. When a govt pushes too hard and too fast people begin to see them as illegitimate, and when that happens they revoke their consent to be governed, usually violently. \n\nThe way for a government to fully institute total control is to do it gradually like the English and Australian governments did. And in the case of the US, it must be done even more slowly and subtly because our nation and national identity is based on a group of people who violently rebelled against government overreach. ",
            "> We need to stop telling the world that we are the best place on earth\n\n\nSo you want me to lie?\n\n\nAgreed on everything else. Especially in regards to China. I'm so tired of seeing the defeatist attitude of \"well everything is made there, what are you gonna do?\" Uh, we can start moving manufacturing elsewhere. Won't happen overnight, but the sooner and faster the better.",
            "> Boomer Karen and her grandson Zoomer Kyle don't actually care that your AR has a pistol grip, they care that you have an AR in the first place. \n\nOh, absolutely.  I phrase it in that way because the vast majority of normal people (which is to say, not the politicians and activists exploiting their ignorance) who think an \"assault weapons\" ban sounds like \"common sense\" have no idea what an AWB does.  They believe there's some sort of nebulously more deadly form of gun, and that their representatives have identified it and passed a law banning it.  Over the years as I lost patience for how flagrant the lie is, I've been blunter about what a transparent lie it is, and have found that actually more effective when speaking to normies than all the nuanced discussions.  \n\nThere's a perception (and not an unearned one) that gun rights advocates are pedantic about details that don't matter, and a lot of people with no expertise to go by assume that when we criticize AWBs on the details, we're doing the equivalent of saying \"it's a magazine not a clip so your opinion is invalid.\"  This isn't helped by the fact that many gun rights advocates *do* try to harp on semantics when arguing AWBs and are often wrong and contradict each other (I'm certain you've heard a well-meaning person say \"there's no such thing as an assault rifle the antis just made that up!\")  I have found greater success taking the approach of \"They're telling you that they're trying to ban an extra-deadly kind of gun, and we're obstructing them and costing lives, right?  Here's the Wikipedia entry.  Look at the list of criteria *they* wrote.  Ignoring the 'grenade launcher' silliness, is any of that a thing you really want to see banned?  They've been lying to you since 1989.\"  \n\nI recently read an article (I wish I could find it now) by a dedicated lefty commentator who desperately wanted to believe the anti-gun Democrats were the good guys, but was deeply disillusioned when he saw how thoroughly empty the laws were, and how transparently an anti-gun group's representative dodged the questions when he asked for clarification.  \n\nSo you and I don't have a disagreement, I don't think.  Normal people (and halfway reasonable judges, for that matter) don't care whether my rifle has a pistol grip.  And that's exactly why I routinely frame the debate over \"assault weapons\" as a debate over banning pistol grips.  Normal people don't want AWBs:  they just often don't know that until they're told.\n\nEDIT--ALTERNATE SMUG PEDANTIC ANSWER:  \n\n> These accessories are just a means to an end: that end being restrictions on semi autos primarily of the mag fed variant. \n\nI know of only a very few semiautos that are not magazine fed.",
            "At least one more, we haven't had a *Chevron*-focused decision yet. They're releasing more opinions Wednesday of next week.",
            "It starts with malice but the lemmings who perpetuate the talking points aren’t malicious, they’re stupid.",
            "I meant the hard right would be quite happy to win elections forever, and they have a lot more support from the police/army at boots on the ground level that means they could do so. Military regimes can crush democracy in a matter of days, Australia is child's play.\n\nAll they would need to do is say the other side were communists/terrorists and extreme measures has to be taken and the country would go the way of the Philippines and Indonesia.",
            "Aha I'm picking you up now. I've always read that remark as a dismissal of the goals and cultural significance of the anti-gun team, which I don't think is wise. \"Silly Diane and her pistol grip woes lawlz\" doesn't exactly give insight into Diane's actual wishes and means to achieve them.\n\nBut I understand now, kind of wished I'd have pushed for clarity sooner. The disparity between anti-gun legislation and what the anti-gun populace wants is an interesting point to ponder. The obvious worst case scenario is that instead of silly legislation just dying out, that it is replaced en masse with actual damaging legislation......but that's a completely different discussion.\n\nI still think dismissing these silly laws as aged out is a little overconfident, but I understand where you're coming from much better now. Thank you for the detailed response.\n\n>I know of only a very few semiautos that are not magazine fed.\n\nI added the mag caveat to prevent a silly correction that I would have almost certainly received from someone. Ironically that corresponds to the point you made up top pretty well.",
            ">> I had a conversation with a TV producer who worked on Last Week Tonight and Saturday Night Live, two bastions of Right Wing Bad urban authoritarian politics, who was literally rendered speechless when I showed him that AWBs are essentially pistol grip bans.\n\nHave you been able to turn your brother in law yet?",
            "[deleted]",
            "The antis wailing \"THE ILLEGITIMATE SCOTUS HAS GONE TOO FAR!\" also ignore the rulings where the \"left\" and \"right\" justices are mixed in the decisions. It is almost like they are individual human beings with different interpretations of the same documents in front of them that come to a consensus that is sometimes imperfect. Weird.\n\nLooking forward to Congress being held accountable for legislation.",
            "That's the one decision I've been waiting for.\n\nI really really want Chevron tossed.",
            "I'd like to think the US military wouldn't be so quick to turn on the citizenry in support of a dictator.",
            "> The obvious worst case scenario is that instead of silly legislation just dying out, that it is replaced en masse with actual damaging legislation\n\nIt's certainly a possibility.  \n\nBut bluntly, what they want is \"ban semiautomatic firearms with detachable magazines.\"  I don' think there's a realistic chance of them getting that, and I think they agree:  that's why they're still peddling this decades-old transparent lie and hoping nobody notices instead of pushing for what they really want.  I think the most likely outcome of a widespread understanding that the AWB emperor is nekkid would be them having to completely back away from this avenue the same way they used AWBs as a new approach when their decades-long quest to ban handguns fell apart.  \n\n> I still think dismissing these silly laws as aged out is a little overconfident\n\nFWIW, I'm not predicting anything.  Courts and normies have shown, again, decades' worth of willingness to swallow this lie, and I can't see the future.  But given the dramatically presence of the AR-15 and similar rifles in Americans' homes, I can't say I'd be voting on AWBs winning in the end, if I were a betting man.",
            "We have a mutually respectful truce on the matter.  He's much more reasonable than you'd expect given the context, but culturally I doubt he'd ever be able to be *pro gun.*",
            "The Garand has a magazine.  \n\nThe only semiautos I can think of off the top of my head are the Webley-Fosbery, the Mateba, and the AR-17.",
            "I mean, the 9-0 rulings on banking regulation are boring in both their subject matter and their unanimity, and people won't give them those sweet ad revenue eyeballs if they aren't riled up.",
            "They did on the Bonus March, and Hoover wasn't a dictator.\n\nBear in mind the context here as well - a lot of the citizenry would be on the side of the security forces here because the opposition are accused of communism/terrorism. Many ordinary people genuinely support Marcos and Prabowo as well. We're not talking about a dictator with 0% approval sending the army to kill people like the Shah of Iran did to his complete failure.",
            "Federally I agree with you, with the caveat that a particularly \"bad\" election followed by a tragedy could wreck it all. The longer time goes however without this being accomplished, the less likely it is.\n\nOn a state basis though things can and will get worse for a lot of people as urbanization turns purple regions into blue ones. I don't see the red/blue divide on guns going anywhere anytime soon and the convoluted mess that is interstate gun law will continue to escalate.\n\nI'm not a defeatist by any stretch, and I think the gun side has done far more admirably than a lot of people realize.....but the state by state polarization is sad to see and I don't think a magic court case will reverse it all."
        ]
    },
    "Grandpa passed. Grandma is selling his guns ASAP. Looking for info on the limited info I have.": {
        "title": "Grandpa passed. Grandma is selling his guns ASAP. Looking for info on the limited info I have.",
        "score": 72,
        "url": "https://i.redd.it/rvr1zipq148d1.jpeg",
        "content": "I am reposting this as I posted this last night before bed and while I was sleeping it was removed due to not having a description in the comments.  All of your help is appreciated!\n\nAs the title states, our Grandpa passed away.  His guns are now being sold very abruptly by Grandma. I would like a 20 gauge but I'm curious if anyone can identify the circled 20 gauge in the photo and/or recommend a fair price for it?\n\nI'm told a broker came by and put a \"fair price\" on the lot of guns at $5000. I have no idea if that is high or low or even the exact details on many of the guns on the table. Getting the details from Grandma at the moment is very difficult. She wants the money for a good cause to help another family member in need. However, none of us imagined these weapons going to non family and especially this fast - so im looking to see if I can get any info and keep one or more in he family.\n\nIf anyone sees anything else in the photo they can identify and/or put a value to or recommend that I try to purchase, I would greatly appreciate it.\n\nP.S. They live in Montana and I'm in Michigan so there's no reasonable way for me to do recon for more info other than what I get from Grandma.",
        "num_comments": 53,
        "comments": [
            "Definitely leave all the pistols in their holsters and do not post descriptions of any of the firearms so they are harder to identify. /s Sell them to a family member. Getting rid of family heirlooms like this is robbing your future ancestors of the chance to have a connection with your grandfather.",
            "My grandfathers guns were auctioned off in front of my face and I’m still pissed a decade later. I would’ve love to pass them to my boys one day",
            "If my kids sell my firearms, I'm going to curse them all. I'll haunt them and disown them when we meet in the afterlife. \n\nDidn't mean to shame OP. Posts like this just make me a little mad 😅",
            "Circled gun looks like a Remington Wingmaster, great heirloom gun.  It's a shame your grandma is selling these.  I have several firearms from deceased family members and they're worth more than money to me.",
            "Way more than $5k. Broker sounds like a scammer or idiot.",
            "I like the Browning Hi Power and whatever that S&W with target grips is.",
            "No offense, but your grandma kinda seems like a bitch. They're heirlooms that I'm sure you and multiple other people in your family would like to have, and she's selling them",
            "Shotgun is a 870 wingmaster.  Relatively modern given the flexi tab.  \n\n\nProbs a extra high grade model, given the beautiful wood, but I don't know that level of detail as my interests are more tactical in nature",
            "I am reposting this as I posted this last night before bed and while I was sleeping it was removed due to not having a description in the comments.  All of your help is appreciated!\n\nAs the title states, our Grandpa passed away.  His guns are now being sold very abruptly by Grandma. I would like a 20 gauge but I'm curious if anyone can identify the circled 20 gauge in the photo and/or recommend a fair price for it?\n\nI'm told a broker came by and put a \"fair price\" on the lot of guns at $5000. I have no idea if that is high or low or even the exact details on many of the guns on the table. Getting the details from Grandma at the moment is very difficult. She wants the money for a good cause to help another family member in need. However, none of us imagined these weapons going to non family and especially this fast - so im looking to see if I can get any info and keep one or more in he family.\n\nIf anyone sees anything else in the photo they can identify and/or put a value to or recommend that I try to purchase, I would greatly appreciate it.\n\nP.S. They live in Montana and I'm in Michigan so there's no reasonable way for me to do recon for more info other than what I get from Grandma.",
            "I'd guess that each of the pistols could go from $600-1000.\n\nBiggest issue is selling them without paying too much to in fees.\n\nA local gun store that can sell on consignment including gunbroker would probably net a little more.\n\nAlso the Blue Book of Gun Values, recent sales on Gunbroker, and looking the serial number of each gun on the manufacturer's site would assist in nailing down a fair price.",
            "Offer grandma $4000 for the lot. You will easily make your money back and still have several family heirlooms.",
            "I’d be willing to pay that to my grandma to get all of that of my grandpa’s.  There’s gonna be ammo and accessories too she’ll throw in.  Figure it out and go get them.  You know he loved the black powder guns since he had at least 3.",
            "Sorry for the loss.\n\n5000 seems low, but it is a reseller so they are gunna low ball to take it off your hands. Otherwise you’ll have to sell one by one.\n\nI would see if your grandma can send you more pictures of the model number on each to get a more accurate accounting.\n\nWas your grandpa the kinda guy to keep these clean all the time? Or more like my dad who leaves them filthy for years?",
            "Offer grandma 3,500 for everything and keep them.",
            "Far left pistol looks like a Hi Power, I'd be keeping that as well...",
            "Dealers generally buy at 30 cents per dollar, and resell around 60-80. So seeking yourself might get double but you have to sell it. If you have the money I would offer 5k and have them shipped to you, you can keep what you want and dispose of the rest and still break even. \n\nOtherwise you'll want to get barrel markings for good identification",
            "High grade 870.  Get it.   Likely also the revolver under it.",
            ">I'm told a broker came by and put a \"fair price\" on the lot of guns at $5000\n\n\nGrandma is getting screwed.",
            "God damnit grandma",
            "Not gonna encourage financing a firearm. But pending on your financial situation, I personally would get a loan/cash out, offer $4-5k to her, liquidate a couple to make some of your money back, and keep the other 40-70% of the guns for heirlooms. It’s something 10 years from now everyone is going to regret. If I could buy just one of my grandpas rifles, to me the value would exceed 5 bands, can’t put a price on family history.",
            "Is that revolver bottom right a .357?",
            "The one at the very bottom of the pic could be a Ruger No.1, hard to tell from the pic. If it is, it could be worth a pretty penny. They range anywhere from 800 to tens of thousands of dollars depending on a few factors, primarily what it’s chambered in.",
            "Bottom, I think a ruger mark 1.\n\n\nHandguns  \nThen you have a ruger SIngle action, likely in 44 mag.  Next to that is a s&w, probably 44 magnum so 629.  \n\n\nWalther ppk\nBrowning high power, 5-800 bucks as it looks new  way less if a Hungarian clone.\n\n\nSmith and wesson revolver, \n1911, could be valuable or worth $100.\n\n\nEven I'm not good enough to identify a revolver by a bit of butt",
            "Dude that shotgun is so pretty. It's all so pretty. Teard up because my girls grandpa passed away and I'm worried the same is going to happen. And it's *Alot* more. \n\nHe should consider trying to change her mind. Help her with whatever she needs help. Also tell her alot will not be worth the jackpot she is thinking. \n\nToo many widows think the arsenal there husband's spent their life building will get the same money value back and sadly just not the case OP. Guns are tools. Few become collectibles.",
            "Not his kids, his widow.",
            "I have like 80 guns and I'm 30.  I expect to have many more when I die.  If my kids keep them all I'll be extremely surprised.  Maybe keep a couple, but it's totally unreasonable to expect they want to have rooms full of guns.",
            "Everyone has different needs and interests. Selling a bunch of guns they won't use to buy a car or a memory building vacation or pay for school etc it's fine. Hell even just buying an iPad they enjoy is fine. I'm dead wtf do I care, if my grandpa left me a damned cow I'd be mad",
            "Definitely scammer. I get trying to make a profit but that’s absurd.",
            "Hard truth right here.",
            "No doubt, but it’s probably pretty scary to lose someone late in life and most likely income security too. 100% sucks, and asshats like the broker take advantage of folks in those situations.",
            "Kind of a shitty thing to say without knowing anything about her situation. Maybe she does suck, or maybe she is dead broke and on the verge of needing extremely expensive memory care. You don't know, but just call her a bitch anyways.",
            "She might not be a bitch, she may just be emotionally compromised. We had a death in my family and *suddenly* the perpetual fuckup of the family was in another crisis and needed money - more than their share in the will. The older family members including the executor wanted to give them that money, tearfully wearing rose tinted glasses and forgetting that said fuckup frittered away every dollar they've gotten. It got very nasty.",
            "5k is definitely a low ball offer. Probably less than half of the actual worth. Hell the Ruger no. 1 at the very bottom could sell for over $1000 on its own",
            "Locally you can sell them face to face with no fees at all...\n\n\nIf you have a relationship with a dealer they'll usually do it for their normal transfer fee that the buyer pays. ",
            "Ruger no. 3.",
            "The ruger single action looks to be an old model Blackhawk, probably 357 magnum. The no. 1 is actually a no. 3, still probably $1200-1500 depending on caliber. ",
            "First of all, sorry about your grandfather and the situation you are finding yourself in. \n\nI have spent a lot of time building my firearms collection. I do have some family heirloom guns that definitely need to stay in the bloodline. Some of them include a sxs shotgun from my grandfathers, grandfather which saw a lot of use during the great depression. A pump shotgun from my mom's dad which he used heavily, a lever gun from my dad's dad that he bought with his first paycheck when he started at a steel mill in 1959. There are others but these are the ones with the most history.",
            "You sure its not a No.3?",
            "> 5k is definitely a low ball offer. Probably less than half of the actual worth. \n\nStarting to bug me when people say this.  Having seen the other side 50% is a pretty reasonable offer.  Dude has no connection to OP\"s grandmother and a business to run, with employees to pay and mouths to feed of his own.  Buying used to resell is a complete gamble too... you can be pretty confident on something you think will sell, and then for some reason it'll sit for months on end while you're carrying te overhead.",
            "Low ball for actual value, for someone trying to resell not really. If they just hauled them to a pawn shop the scumbag working there would probably offer $1200 for the lot. A decent gun shop would maybe offer 60% value.\n\nI just had this happen with my grandpa's guns. WW2 bring back P38's and NIB engraved Browning SA-22's ditched for less than a month's rent. I tried to save what I could. Made me realize that when I get old I need to write down what guns go to which family members and sell the rest before I croak.",
            "> Ruger no. 1 at the very bottom\n\nI had to go back and look again.  I guess I saw the Blackhawk the first time and stopped scanning.",
            "Its 100% a no. 3.",
            "Right?  If gramma wants to blast through her husband's possessions to get whatever money she can as fast as possible, she's going to be effectively paying somebody else to do the work of selling.  In what universe do people expect to get \"the actual worth\" of a commodity they're selling to somebody who's buying it to resell?",
            "This.",
            "50% is what I expect a pawn shop to offer, an actual gun store with non-asshole employees, especially if its something they think they can shift quickly will offer 100-300 less than they're going to sell it for.",
            "LOL. I was trying to *hint* at it in the nicest way possible.",
            "What’s a no. 3 mean for collectability, value, shooting etc (vs no 1)?",
            "upon a quick count there are 14 guns on the table assuming the broker wants 300$ profit on every sale then he is going to ask for about 4200$ off of the total value. \n\nIf everyone's rough estimate of half the value holds up the table is worth about 10K take the 10000-4200 and get 5800 so sure lowballing it but not by nearly as much as people think.",
            "My toddler has taken all the patience out of me already today.",
            "Probably $1200-1500 depending on caliber.",
            "It was basically a budget version of the no. 1 with birch carbine stocks and a different lever and fewer caliber offerings. Just as robust though. Less common than the no. 1 but I don't know if they'd be more valuable because of that.",
            "I don't have one of those. Hope your weekend gets better mane!",
            "Thanks dude, its all good."
        ]
    },
    "Single or Double?": {
        "title": "Single or Double?",
        "score": 21,
        "url": "https://i.redd.it/hdo7s2dip38d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Finally completed my “PMM” (IJ70-18AH) double stack Makarov with a complete military look. Although the small amount of military double stacks are different. The hard to find “Bakelite” (textolite) grips, combined with a surplus slide, hammer, safety and mag catch really make this gun look as aesthetic as possible. Very sweet little piece I’ve always wanted set up this way is finally complete.",
            "I should have bought the Bulgarian mak (circle 10) with bakelite grips and safety's they had at the pawn shop in town.  Super cheap, I'm sure it is gone now.",
            "What are you doing today? Go look mane. They are not making any more.",
            "I know, maybe I will on the way back through.  As someone from Memphis, I am damn proud to be called mane on reddit. Hahah."
        ]
    },
    "A collection of pea shooters.": {
        "title": "A collection of pea shooters.",
        "score": 29,
        "url": "https://i.imgur.com/DXkXznR.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Someone commented the other day they just couldn't find fun in shooting .22 long rifle, so I was inspired to finally stack 'em all in one spot and grab a picture because I feel no such lack of pleasure in propelling tiny projectiles shorter distances without much fanfare.\n\nStarting from the right top and going down:\n\n* Ruger Single Six Bisley \n* Ruger Single 10 with Swift 2x20 Scope\n* 1974 Colt Peacemaker .22lr\n* Colt M1991 frame with Ciener Platinum Cup Conversion\n* S&W Model 41 with UltraDot \n* Buckmark Camper\n* 1969 Browning Challenger I 6\"\n* Buckmark Camper with UltraDot\n* Ruger Mk. 3 22/45 with Bushnell Centurion 2x20\n* Taurus 9422UL",
            "More cost effective as well. Nice colection.",
            "Favorite?  And what would you recommend ",
            "Until I finally get the nerve to setup the reloading kit and try, this is about the only thing I can afford anymore."
        ]
    }
}