{
    "America!": {
        "title": "America!",
        "score": 3753,
        "url": "https://i.redd.it/kamvva5tk08d1.jpeg",
        "content": "",
        "num_comments": 142,
        "comments": [
            "\"We're going to cut down this tree! Oh, please try to stop us. Oh, pretty please try.\" - The US.\n\nSeriously though, if I'd been a Korean trooper watching the US direct that many resources just to cut down a tree, I'd have serious second thoughts about partaking in the war.",
            "The **Korean axe murder incident** was the killing of two [United Nations Command](https://en.wikipedia.org/wiki/United_Nations_Command) officers, Captain Arthur Bonifas and First Lieutenant Mark Barrett, by North Korean soldiers on August 18, 1976, in the [Joint Security Area](https://en.wikipedia.org/wiki/Joint_Security_Area) (JSA) in the [Korean Demilitarized Zone](https://en.wikipedia.org/wiki/Korean_Demilitarized_Zone) (DMZ). The officers, from the United States Army, had been part of a work party cutting down a poplar tree in the JSA.\n\nThree days later, US and South Korean forces launched **Operation Paul Bunyan**, an operation that cut down the tree with a show of force to intimidate North Korea into backing down, which occurred.\n\nOperation Paul Bunyan was carried out on August 21 at 07:00, three days after the killings. A convoy of 23 American and South Korean vehicles (\"Task Force Vierra,\" named after [Lieutenant Colonel](https://en.wikipedia.org/wiki/Lieutenant_Colonel) Victor S. Vierra, commander of the United States Army Support Group) drove into the JSA without any warning to the North Koreans, who had one observation post staffed at that hour. In the vehicles were two eight-man teams of military engineers (from the [2nd Engineer Battalion](https://en.wikipedia.org/wiki/2nd_Engineer_Battalion_(United_States)), 2nd Infantry Division) equipped with [chainsaws](https://en.wikipedia.org/wiki/Chainsaw) to cut down the tree.\n\nThe teams were accompanied by two 30-man security platoons from the Joint Security Force, who were armed with pistols and axe handles. The 1st Platoon secured the northern entrance to the JSA via the Bridge of No Return, while the 2nd Platoon secured the southern edge of the area.\n\nConcurrently, a team from B Company, commanded by Captain Walter Seifried, had activated the detonation systems for the charges on [Freedom Bridge](https://en.wikipedia.org/wiki/Imjingak) and had the [165mm main gun](https://en.wikipedia.org/wiki/Royal_Ordnance_L9) of the [M728 combat engineer vehicle](https://en.wikipedia.org/wiki/M728_Combat_Engineer_Vehicle) aimed mid-span to ensure that the bridge would fall if the order was given for its destruction. Also, B Company, supporting E Company (bridge), were building M4T6 rafts on the [Imjin River](https://en.wikipedia.org/wiki/Imjin_River) if the situation required emergency evacuation by that route.\n\nIn addition, a 64-man task force of the [ROK Army 1st Special Forces Brigade](https://en.wikipedia.org/wiki/1st_Special_Forces_Brigade_(South_Korea)) accompanied them, armed with clubs and trained in [taekwondo](https://en.wikipedia.org/wiki/Taekwondo), supposedly without firearms. However, once they parked their trucks near the Bridge of No Return, they started throwing out the sandbags that lined the truck bottoms and handing out [M16 rifles](https://en.wikipedia.org/wiki/M16_rifle) and [M79 grenade launchers](https://en.wikipedia.org/wiki/M79_grenade_launcher) that had been concealed below them.[^(\\[4\\])](https://en.wikipedia.org/wiki/Korean_axe_murder_incident#cite_note-2koreas-4) Several of the commandos also had [M18 Claymore mines](https://en.wikipedia.org/wiki/M18_Claymore_mine) strapped to their chests with the firing mechanism in their hands, and were shouting at the North Koreans to cross the bridge.",
            "Adding on that North Korea immediately began lying and playing victim; saying that it was an unprovoked attack by the UN officers and that the US should withdraw from South Korea.\n\nThe Conference of Non- Aligned Nations agreed.\n\nHonestly if North Korea told me the sky was blue I'd get the sudden urge to check.\n\nP.S. The NK officer was known as 'The Bulldog' and was known to pick fights.",
            "This incident is one of the most satisfying shows of force I've heard of. Although there's always plenty to criticize, the US/UN intervention in Korea is one of the few post-ww2 US military adventures that actually had a definitely positive impact. ",
            "That time we gave North Korea the ultimate in FAFO.",
            "Oh, look, it's [a relevant Tom Scott video](https://youtu.be/vs3XJTYli10)...",
            "I remember watching a video about this event from a YouTuber called A Grain of Salt. Pretty underrated channel if you’re into niche and weird history.",
            "When was it? Kim Jong-il (the first \"glorious Kim Jong\") was an infant during the Korean war and came to power as late as the 90s.\n\nDo you maybe mean \"the glorious Kim Il-sung\"",
            "Lmfao, using literally Blue Jay’s video is a great choice",
            "Iv heard/seen this story multiple times and I don’t think the US/South Korea are the victors. The US had 2 soldiers murdered and the best revenge they could get was cutting down a tree. I don’t care if they cut down every tree within 100 miles of the DMZ, the North Koreans were able to kill 2 American officers without any real repercussions.",
            "American pig dogs will never understand the glory of seeing supreme leader watch volleyball",
            "[Oh that's a good Army](https://youtu.be/vO3KbXMxHfw?si=iHsO4AE8E1ULqY_0&t=4)",
            "I think at this point I would simply order napalm over that r/fuckyouinparticular tree",
            "Don't forget 7th fleet parking themselves off the coast during this also.",
            "The Lions Led By Donkeys podcast did an [episode](https://open.spotify.com/episode/0yFEz9RFBNpCMYBJEXrU2I?si=hjdhxvxDTBuxTprmG1Mfcg) on this incident, highly recommend the episode and the podcast as a whole",
            "I like how under the Casualties and Losses section for Operation Paul Bunyan, there is only one point:\n\"1 tree cut down.\"",
            "You probably wanna change their uniforms, those are Cultural Revolution-era Maoist Chinese uniforms, not North Korean ones",
            "Americans think this was win smh dude they murder two of Ur guys and U did nothing but cut down a tree 😂😂😂",
            "Citation Needed mentioned.",
            "Can I get the WHAT THE FUCK IS A KILOMETER meme?",
            "the only accurate thing abt this is it was indeed the USA VS Koreans, as South Korea was merely their puppet that no one liked",
            "[deleted]",
            "On that day North Korea learned America has no chill",
            "Saying, \"Cut down a tree..\" instead of \"intentionally causing a most serious capital offense\" is a bad way to frame it.\n\n It's such a heinous act that they have no choice. Hell, they might have executed the entire bloodline of the soldiers who did nothing while an extension of dear leader is murdered.\n\nDoing something that deserves instant death is disgusting, doing it to justify fucking their shit up when they serve justice to the offenders is double plus disgusting",
            "Yeah that was definitely the point, put up a big short of force to a relatively minor provocation, and the enemy will think twice before doing anything big",
            "Imagine being the North Korean Trooper who killed that officer with the axe. He's like \"awww fuck they are coming for me\"",
            "If I’d been one if those soldiers, I would understand the message: you don’t fuck with the United States",
            "A US infantry company in 20 utility helicopters and seven [Cobra attack helicopters](https://en.wikipedia.org/wiki/AH-1_Cobra) circled behind them. Behind these helicopters, [B-52 Stratofortresses](https://en.wikipedia.org/wiki/B-52_Stratofortress) came from Guam escorted by US [F-4 Phantom IIs](https://en.wikipedia.org/wiki/F-4_Phantom_II) from [Kunsan Air Base](https://en.wikipedia.org/wiki/Kunsan_Air_Base) and South Korean [F-5](https://en.wikipedia.org/wiki/Northrop_F-5) and [F-86](https://en.wikipedia.org/wiki/North_American_F-86_Sabre) fighters were visible flying across the sky at high altitude. F-4Es from Osan AB and [Taegu Air Base](https://en.wikipedia.org/wiki/Taegu_Air_Base), South Korea, [F-111](https://en.wikipedia.org/wiki/General_Dynamics_F-111) bombers of the [366th Tactical Fighter Wing](https://en.wikipedia.org/wiki/366th_Tactical_Fighter_Wing) out of [Mountain Home Air Force Base](https://en.wikipedia.org/wiki/Mountain_Home_Air_Force_Base), were stationed, and F-4C and F-4D Phantoms from the 18th TFW [Kadena Air Base](https://en.wikipedia.org/wiki/Kadena_Air_Base) and [Clark Air Base](https://en.wikipedia.org/wiki/Clark_Air_Base) were also deployed. The aircraft carrier [USS *Midway*](https://en.wikipedia.org/wiki/USS_Midway_(CV-41)) task force had also been moved to a station just offshore.\n\nNear the edges of the DMZ, many more heavily-armed US and South Korean [infantry](https://en.wikipedia.org/wiki/Infantry), [artillery](https://en.wikipedia.org/wiki/Artillery) including the Second Battalion, [71st Air Defense Regiment](https://en.wikipedia.org/wiki/71st_Air_Defense_Artillery_Regiment) armed with [Improved Hawk missiles](https://en.wikipedia.org/wiki/MIM-23_Hawk#I-Hawk:_MIM-23B), and [armor](https://en.wikipedia.org/wiki/Armoured_forces) were waiting to back up the special operations team. Bases near the DMZ were prepared for demolition in the case of a military response. The defense condition ([DEFCON](https://en.wikipedia.org/wiki/DEFCON)) was elevated on order of General Stilwell, as was later recounted in Colonel De LaTeur's research paper. In addition, 12,000 additional troops were ordered to Korea, including 1,800 Marines from Okinawa.[^(\\[6\\])](https://en.wikipedia.org/wiki/Korean_axe_murder_incident#cite_note-probst-6) During the operation, nuclear-capable strategic bombers circled over the JSA.\n\nAltogether, Task Force Vierra consisted of 813 men: almost all of the men of the United States Army Support Group of which the Joint Security Force was a part, a South Korean reconnaissance company, a South Korean Special Forces company that had infiltrated the river area by the bridge the night before, and members of a reinforced composite rifle company from the [9th Infantry Regiment](https://en.wikipedia.org/wiki/9th_Infantry_Regiment_(United_States)). In addition to this force, every UNC force in the rest of South Korea was on battle alert.",
            "So basically south Korea gave a bunch of karate kids M16s... I know that might be offensive but that thought entered my head and I can't stop laughing.",
            "North Korea history books and historians \"The Korea war was started unprovoked by the USA and South Korea but due to our magnificent leader we defeated them\".\n\nVeterans of the war from North Korea \"Yes, that is definitely what happened. We definitely did not invade and dominate the early stages of the war until the USA and allies made us retreat past our initial borders and we needed China to bail is out to default to the original borders. And any evidence of to the contrary of the first and in support of the second is a lie, like first hand witnesses.\"",
            "*Barges in to protect under threat democracy* \n\n*soviets not too powerful yet to truly stop intervention*\n\n*through fire and brimstone liberates Korea from Busan to the Yalu*\n\n*only stopped by overwhelming Chinese manpower*\n\n*still negotiates beneficial ceasefire that results in a booming regional power*\n\n*American Influence vs Chinese and Soviet influence visible from Space*\n\n*Remain a thriving democracy to this day*\n\n*proceeds to rule the world through Samsung*\n\n*W for South Korea bros*",
            "80% of North Korea destroyed and creating the north Korea of today. Not positive. Should have either not got involved or fully finished the job, not this half assed result.",
            "Thats kinda the problem with North Korea; we've pretty much done everything we can do to them short of war (and we really don't want a fight with nuclear china for obvious reasons).",
            "You're 100% right, they definitely should have reignited the war, the only way to show that killing two people has real repercussions is to ensure that hundreds of thousands die",
            "Daring today, aren't we.",
            "We only have FAFO memes.",
            "North Korea murdered two soldiers in an unprovoked attack. The US chopped down a tree. \n\nDo explain how this is an act of bullying.",
            "The incident started because North Korea murdered 2 Americans",
            "Tbf, nobody has more no chill than North Korea.",
            "It was on the southern side of the border and was a serious risk of blocking Line of Sight, thus allowing a major build-up of forces. The US soldiers were trimming the tree and got murdered, the NK decided to play the victim and said the US should leave.",
            "Iran was also taught this lesson when their mine in international waters damaged one of our boats and we destroyed half of their navy.\n\nThough from recent events it seems the Iranians are in need of some more schooling",
            "All of this info is from Wikipedia, check out the actual article for more info, also the background of the 2nd Panel is from the YouTuber Blue Jay's video from the DMZ, check him out too. He makes banger videos.",
            "\"Mr President two people were killed cutting down a tree\"\n\n\"Bring out the B-52s and the CSGs\"",
            "Wow… humans are so stupid. Wasting all these resources over a tree.",
            "Taekwondo isn’t karate 😬",
            "> under threat democracy\n\nAh yes the egalitarian liberal democratic government of Syngman Rhee",
            "They weren’t stopped by overwhelming Chinese manpower.  They stopped because they realized the army they were beating weren’t the ones they were at war with.",
            ">fully finished the job\n\nDamn what a great idea, why didn't they think of that?",
            "You killed one of our lumberjacks? We'll send another one and an entire army to back them up.\n\nYou touched our boat? Say good bye to your navy.\n\nYour state sponsored mercenaries attack an oil field?  [We'll show you why we don't have free healthcare](https://www.youtube.com/watch?v=viuUzGGac5M&t=2s)\n\nYou tell me that NK has more 'no chill' than that?",
            "See they failed to learn one of the most important lessons of war, never get involved in a land war in Asia and never mess with the US's boats",
            "Another good example of enemies of the US fucking around and finding out was when around 500 Wagner mercenaries and Syrian loyalists attacked a US-defended oil refinery with like 20 special forces operatives and Syrian rebels and the Russians getting a taste of American air power and getting utterly obliterated. Remember, kid: you don’t fuck with the United States",
            "Honestly, Iran needs to be dealt with now. They cannot be allowed to develop a sophisticated nuclear arsenal.",
            "\"Though from recent events it seems the Iranians are in need of some more schooling\"\n\nthere has yet to be payback for the US Embassy invasion.   After the hostages were released George Will suggested a surgical airstrike destroying the embassy.  He said something like \"We built it.  It's our sovereign territory. We can obliterate it.\"",
            "I heard about this from a youtuber called the fat electrician and in his video he said that north korea initially pretended to be unaware of the US show of force and were planning to play it off as not a big deal so the US sent NK a message that read they were there to finish the work left unfinished.",
            "Yea it is kinda stupid,I sure hope no one was killed trying to cut it down /s",
            "In the words of Joker :\"It is not about money, it is about sending a message.\"",
            "When they kill your people, you remind them that they only exist because you allow it. Especially when you can afford it.",
            "it wasn't about the tree",
            "Cry about it snowflake",
            "Imagine wasting all these resources building all this military equipment & how much is used globally. Damn if only humans were in some\nForm of Cheshire utopia , that would be ideal",
            "For alliteration purposes might I suggest he says “taekwondo tots”",
            "Nothing wrong to see here move along, move along\n(Worked better in my head than US backed police state vs Soviet backed police state, but hey they got better in the end(mostly)",
            "You fell victim to one of the classic blunders!",
            "U.S: DON’T TOUCH MY BOATS!!\n\nJapan: please don’t touch their boats. They will drop a sun on you. \n\nCanada: If they give us the okay we get to pull out the Geneva checklist. Please touch their boats.",
            "Unless you're Israel.",
            "[removed]",
            "And the three Wagner survivors wound up getting a medal in Russia with AH-1’s firing TOW’s/rockets at a tank on them. (One died from his wounds and the family received posthumously I think?)",
            "Reminder that this mindset is what got us into this mess in the first place, when we couped their government for the British Empire over access to oil.\n\nSeeing these brown resource rich countries as problems to be managed is just going to end up as another decades long land war in Central Asia",
            "I mean if they do you know they will nuke Israel.",
            "They're welcome to try, but Israel will cheerfully uranium production centers and (unless Trump wins again) it's reasonable to assume the other possible administration would renew the treaty on peaceful energy production.\n\nIran has the right to develop nuclear technology for energy production. I'd support it.\n\nTheir current regime can't be trusted with weapons grade material, but I doubt they'll actually achieve it.",
            "Yes, it is stupid to kill someone for cutting it down",
            "Killing someone over a tree is an incredibly stupid waste of resources on NKs part. Wasting all those resources over two guys was stupid on the US’ part.\n\nAnd that’s absolutely not true, NK wouldn’t still be here if their survival was entirely up to the US. NK still exists because China allows it to, not us.",
            "It very much was about the tree, that’s what started the whole thing. NK murdered 2 guys over a tree.",
            "Most western nations dont use more then 3% of their gdp on military production. The US only hiked up production in the last few years  in 2019.\n\nThe US spends plenty on wealfare and charity if that could change the world it would",
            "Hell yeah that works",
            "Now it’s the choice between 1984 without the option to leave and Cyberpunk but with the option to leave.",
            "INCONCEIVABLE!!!",
            "Are we all getting our US Military History lessons from the fat electrician now?",
            "Canada being bastards will always send me🤣",
            "friendly fire = attacking ships intentionally",
            "Despite popular belief on the matter, the USS Liberty incident was a case of friendly fire, which unfortunately isn't that uncommon. Nonetheless, Israel has since publicly apologized and paid several million dollars in reparations to the families and survivors.",
            "Seams to have been repeated again 🤔",
            "Doesn't matter at this point. They state their primary mission as destroying the west. They're seeking to develop nuclear weapons. \n\nDue to this, it's not really something that can just be ignored.",
            "No, they won't. They'll say they'll nuke Israel every 6 months until the damn fisile material in the bombs decay into lead. Were familiar with this gambit",
            "They said the reverse with Israel",
            "they were on rout to get nuclear weapons during the treaty",
            "1. NK was stupid for picking a fight with someone who had just beat them while holding back.\n\n2. The nukes we almost used on them says it was us that decided they got to exist, not China.",
            "Yes. And the US pulled off this show of force because NK killed two of their men. Which is reasonable given the alternative is letting it happen again, which would invite NK to be bolder and risk a war in the future",
            "North Korea: 1984\nSouth Korea: Brave New World",
            "North Koreans can go to China all they want, while north Korean defectors in South Korea are often locked in solitary confinement for months, if not longer, and when they are finally released they are made to give up their citizenship of the DPRK and are never given passports making them essentially trapped in south korea. I suggest trying to see the situation from the DPRK's perspective for once instead of swallowing south Korean and American propaganda completely uncritically.\n\nThere is a great documentary showing the struggles of some DPRK \"defectors\" In South korea called 'Loyal citizens of Pyongyang in Seoul\" available for free right here on YouTube. \nhttps://youtu.be/ktE_3PrJZO0?si=wf1QCpoEZj1PZPTM\n\nAnd please remember that the reason North korea is behind economically is because the US bombed every factory and farm and many other civilian targets they could. And this is according to the American airforce themselves.\n(I cannot find this document at them moment, but I will go looking for it if anyone is interested)\n\nAnother very interesting video debunking some misconceptions and lies:\nhttps://youtu.be/EzDhqXuELjo?si=DBK3TdOsgeUyRDm6",
            "Hello, My name is the United States of America, you damaged my boat, prepare to die.",
            "Habitual Linecrosser too",
            "Yes",
            "Yeah, it was totally accidental. Definitely not trying to bring the US into a direct conflict with their enemies at the time with a false flag operation, that would be *ridiculous*.\n\nAfter all, Israel is literally incapable of any form of even the slightest wrongdoing.",
            "Yes guys trust this dude, Israel never intended to hurt innocents or use it to blame other countries during the conflict to get us involved those are just commie conspiracy theories, Trust me guys.\n\nEdit: many people fail to see the tag and understand  the joke",
            "That's the purpose of mercs. They're purely acquired to be expendable and deniable.",
            "The Muscovian Gambit?",
            "The US picked the fight by cutting down what was apparently an important tree to NK in a zone where doing so was forbidden. NK overreacted, but the US were the ones who picked the fight.\n\nYou can’t just use nukes, using them has repercussions. The cost of doing so would be far too high for the benefit of wiping out NK, which means we don’t because NK and China keep that cost too high.",
            "South Korea: actually quite a lot like BNW if you actually read the book and understood what the \"class separation\" idea was",
            "Ah.",
            "You are mentally deficient",
            ">And please remember that the reason North korea is behind economically is because the US bombed every factory and farm and many other civilian targets they could.\n\nYeah until 1953. They've had 70+ years to build back better and it's still a hellhole for most of their citizens. That's not on the US, that's on the ruling party and the leaders.",
            "I ain’t reading all that. Good for you or good riddance, whichever works.",
            "He’s my favorite",
            "I mean sure, whatever floats your boat but this one separate incident is clearly a case of friendly fire.",
            "US wanted the tree cut because it was blocking line of sight. It was on their side of the zone so they had every right.\n\nNK just wanted to cause problems.\n\nDo you honestly think NK was telling the truth about their leader planting the tree?\n\nIf you do I've got some great farmland in the Australian Outback for sale.\n\nYou interested?",
            "I'm open to have a debate, cite your sources and I'll be happy to read them. But if all you've got is personal insults, then it appears to be a waste of both our time.",
            "70+ years of embargo by most of the world, and besides there has been no starvation since the famine that occurred shortly after the collapse of the soviet union",
            "Then don't read it and don't respond.",
            "The line of sight… in a demilitarized zone? Yeah okay buddy sure.\n\nI do think so, even NK isn’t stupid enough to murder two enemy soldiers for no reason. Plus they had a million better explanations available like claiming self defense or something rather than “they were cutting down an important tree”. That’s a terrible justification for murder you’d only use if that were the truth.",
            "They had the support of the USSR (which mind you was a massive economy) and PRC that whole time, playing each other off because the USSR and PRC grew to hate each other for being the wrong kind of communist.\n\nThe Kims could have put that effort into building a strong economy, but dumped it on making a pile of shitty guns to resist an invasion that would never happen. \n\nBy contrast, South Korea was thoroughly devastated and impoverished by the North Korean invasion, feared another invasion, and so needed a pile of guns. Problem was, their sugar daddy America was busy discovering that napalm does indeed stick to kids so they kinda had to wait for the pile of guns. Asshole in charge Park Chung-hee figured out that it is much easier to build a pile of guns if you have a strong economy to make them, and launched reforms to build a strong economy so he doesn’t have to keep asking Uncle Sam for more guns. This led to the Miracle on the Han River where South Korean living standards surged far past North Korean standards.  \n\nBy the 90’s, South Korea went from a poor tinpot dictatorship reliant on foreign aid for survival to a massively wealthy democracy exporting decent manufactured goods and services across the world and was about to unleash K-pop on the world. Meanwhile, North Korea saw their Soviet sugar daddy suffer a self-inflicted case of existence failure and all they had to show for it was a massive pile of guns very similar to the ones that Uncle Sam and friends just turned into scrap metal in Mesopotamia. \n\nThat’s when the famine and suffering really starts for North Korea.",
            "Pretty sure they don't starve because the West keeps sending them food.",
            "You can’t tell me what to do.",
            "They did claim self defence by saying our guys attacked first. \n\nUnfortunately for them we have the whole thing on video.\n\nFurthermore, NK claims their leader doesn't shit. They're clearly not too concerned with objective reality over their own narrative.",
            "dawg, they were that stupid. the tree blocked the the of the approach angle to a watch tower. if it weren’t cut down the north could approach unseen until almost on top of the tower, the north koreans were just being stupid. even if their glorious leader planted it himself, he can go fuck himself, it’s not his tree. it’s not his korea",
            "Lol you're clearly uneducated about this topic which is ok. This is history. It's documented. Hell you can look at the links that the op posted. The info is right in front of you.",
            "Can you be uneducated somewhere else please?",
            "I am not telling you what to do, just wondering why you feel the need to lash out."
        ]
    },
    "He didn't lose, he merely failed to win!": {
        "title": "He didn't lose, he merely failed to win!",
        "score": 3869,
        "url": "https://i.redd.it/2yaynwdbwz7d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "*“If he had a million men he would swear the enemy has two millions, and then he would sit down in the mud and yell for three.”* - Secretary of War Edwin Stanton",
            "George B McClellan has some wild ties to Washington State as well. \n\nHe was commissioned by the then Secretary of War Jefferson Davis in 1853 to find a passage across the Cascade Mountains, a job which he did pretty terribly at. The locations he picked were generally not viable and worse still, better routes would exist nearby.\n\nEventually after basically refusing to do his job governor Isaac Stevens would eventually demand he hand over his log books, which McClellan refused to do. As it turned out, McClellan wrote at length about how much he hated his bosses and how misunderstood he was. He was apparently reluctant to turn over said books out of embarrassment. Some seriously angsty shit apparently. \n\nAside: Isaac Stevens was interesting in his own right, but I want to point out he named his kid Hazard. Hazard Steven’s claim to fame was being the first person to have climbed Mt Rainier, the most prominent mountain, most glaciated point, and tallest volcano in the Lower 48.",
            "McClellan: Stop giving me your toughest battles.\n\nLincoln: That's literally your job.",
            "Sun Tzu once said “not making a decision is a huge fucking decision.” \n\nSource: my ass",
            "Democrats: “Hey, can you run against Lincoln to favor peace with with the confederacy”\n\nGeorge: “Sure, but I reject peace”\n\nDemocrats: “Okay, this won’t be confusing.”",
            "The Confederacy's strongest soldier 🫡 /s",
            "He is actualy very good at logistics, maybe even a pioneer in the field.He sorted out the Union logistics network after he was sent to the rear, but he should under no circumstances be within a mile of the front",
            "I didn’t lose I merely failed to win",
            "To be fair, Mclellan was great at training and building an army. He just wasn’t willing to then put that army in a position where it might be destroyed. As Robert E. Lee correctly (a broken clock is right twice a day) summarized: “To be a good soldier, you must love the army. To be a good commander, you must be willing to order the death of the thing you love.”",
            "McClellan is interesting because unlike most failed generals, he wasn’t really that bad at leading troops, and was actually a very talented organizer. He failed because he was a perfectionist who refused to engage the enemy. Wanting to save your soldiers’ lives is noble, but meticulous planning and slow action drag out the war, which means more deaths.",
            "He was very good at training soldiers, just not at attacking. Should've been sent to command Chilton Foliat😂",
            "“If General McClellan does not want to use the army, I would like to borrow it for a time.” -Lincoln",
            "McClellan pursued the strategy that Lee should have. Lee pursued the strategy McClellan should have.",
            "I read a critical account of his generalship, \"Mclellan\" by Steven Sears. Whilst he often delayed attacking, given the primacy of defence in that war then his wish to avoid mass causulties amongst his troops was understandable (compare that to the WW1 era generals). As well, even his critics praised his training and logistical methods that allowed the Union army of the Potomic to blunt the rebel forces, all while maintaining a relatively high morale in a citizen army.",
            "Of the job you gave him was to rebuild an army, he was your man. If the job you gave him was to use that army to win a war, he was not the guy.\n\nVery talented, but not morally brave.",
            "That idiot probably prolonged the war by a year and a half.",
            "Ngl this made me actually laugh out loud. I can’t believe Lincoln put up with him for so long.",
            "This post is another example of why you shouldn’t learn history from meme youtube videos.",
            "What if they had four million? I'd need five!",
            "Little Mac doing Little Mac things",
            "During that time in the PNW, he apparently met Grant in his depressed alcoholic phase and George made sure everyone knew about it later on when Grant was winning battles in the West while George wouldn't even try to fight.",
            "George McClellan was apparently the first r/ antiwork user",
            "“If you choose not to decide, you still have made a choice.”\n\n-Neil Peart, well-known military tactician",
            "\"LOL lets meet this plague infected body\" - Sun Tzu, a time before now",
            "And also have a Peace Democrat run as his running mate, his name totally won't be famous for something else (Pendleton).",
            "He was also very good at inspiring loyalty in his soldiers and loved them a ton. Which like you said is very bad for a Commander of his station",
            "Yeah, as a historian, it’s easy to see that someone like Grant was a much, much better general than McClellan, but if I were a Union soldier, I’d much rather serve under McClellan.",
            "Robert E Lee was not right like a broken clock. He fought for a contemptible cause, but that doesn't mean he wasn't talented.",
            "So he was basically Captain Sobel?",
            "The South had no chance fighting a defensive war. I often see Lee criticized for attacking, but while that strategy was a long shot, a defensive war was impossible. The South did not have the resources or manpower to beat the North in a battle of attrition.",
            "\"I understood that reference!\"",
            "He was an OK-ish Governor of New Jersey, helped streamline administration and statistics and promoted education.",
            "Really? Under McClellan, would you really be safer considering he was also part of some of the bloodiest battles in the entire war. Not to mention how destitute of initiative he was, I’d feel like I’d actually be doing something right under Grant instead of just standing around waiting the entire time for an invisible enemy",
            "I wouldn’t consider “just barely better than the worst of the Union generals” to be talented.",
            "Yes, especially when compared to how he was irl compared to how he’s depicted in Band of Brothers",
            "Winning definitely beats losing, but living beats dying. Sure, under Little Mac you might end up with Antietam, but odds are you just get a lot of maneuver. You get to enjoy excellent logistics while knowing that your commander probably won’t just feed you into a meat grinder.",
            "However you chances of dying, battles or not, increases the longer the war goes on. The soldiers preferred Grant because they kept moving south and coming closer to finishing the war, instead of dying in a camp of disease",
            "Isn’t it a little reductive to say Grant fed his men into the meat grinder. Yes there was Cold Harbor, Shiloh, but those were rare mistakes of his. Vicksburg and even the Overland Campaign show how much of a master of maneuver Grant was. \n\nAlso, wasn’t Grant as good at McClellan at logistics, if not even better considering how much more intensive his campaigns were?\n\nAnd yeah living sure beats dying, but even if a bullet doesn’t get us, even a tiny splinter might lmao, disease was rampant, it just sucked to live back then",
            "Kind of, but you also had a period of enlistment. Most troops weren’t serving for duration. \n\nAlso, it’s hard to say who the troops preferred. There are tons of first hand accounts during and after the war. Many certainly liked Grant because he won and troops want to win. That said, people often forget that the “Grant the Butcher” sobriquet wasn’t given to him by the Confederates, nor did it refer to how many rebels he killed. I’d imagine that the Union troops who coined that nickname weren’t too fond of him. Then again, it’s also possible that opinions changed over time. In the same way that many soldiers who complained about “Granny Lee” in 1861-62 came to eventually sing his praises, it’s possible that many Union soldiers called him a butcher during the war also changed over time. When those soldiers looked back and saw that being part of the Army of the Potomac when it defeated the Army of Northern Virginia was the defining moment in their lives, they probably viewed Grant more favorably. \n\nMcClellan had the opposite happen. He was hugely popular with his men, but he looks much worse in hindsight. Then the fact that he ran against Lincoln further tarnished his reputation. It’s worth pointing out that just as the Lost Causers slandered and attacked the legacies of Southerners who went on to become Republicans (like Longstreet and Mosby), so too did pro-Union historians write more critically of Northern Democrats, like McClellan.",
            "Grant was an excellent logistician, but I don’t know if he was an institutionally gifted as McClellan. Grant sustained a huge army in the field, but McClellan basically built the system that made it possible. \n\nAs for maneuver, McClellan was too fancy for his own good. Because he always overestimated rebel numbers, he constantly tried to outmaneuver them. When he felt he could not gain a position of advantage, he often withdrew (as evidenced in the abortive Peninsular Campaign). Grant was excellent and coordinating the movement of vast numbers and even conducting joint operations with the Navy, but his maneuver was usually pretty linear. That isn’t a criticism. If McClellan had gone full speed ahead like Grant typically did, he probably would have broken through Macgruder’s force and into Richmond by ‘62. \n\nThat said, I’d still rather march and counter march trying to find some mythical gap in the line under McClellan than smash through the Wilderness, the Bloody Angle, and Cold Harbor under Grant.",
            "Fair enough ",
            "Vicksburg was a masterpiece of logistics under incredibly trying circumstances and terrain. McClellan was gifted at logistics no doubt, but I wouldn't put him over Grant in that regard."
        ]
    },
    "Don't get me wrong, it's a great book, it's just not \"a story about rabbits\"": {
        "title": "Don't get me wrong, it's a great book, it's just not \"a story about rabbits\"",
        "score": 509,
        "url": "https://i.redd.it/9m09oqmxg28d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Watership down?",
            "Was using the rabbit meme template intentional or happy coincidence?",
            "Idk, I didn't red that, but I guess it will be a good idea to read it during summer.",
            "The movie adaptation seriously traumatised me.",
            "its the aeneid with rabbits",
            "I need explaining I think",
            "Two weeks to stop the spread",
            "God I fucking love that book. Highly recommend the audiobook version narrated by Peter Capaldi. Dude absolutely crushes it.",
            "Yes, sorry I was too lazy to add context\n The author is quoted saying \"it's just a book about rabbits\"",
            "I'm guessing of mice and men.",
            "Happy coincidence. I searched for a template for a few minutes and that was the only one that worked",
            "My parents thought it was, as the author said, just a story about rabbits. So I read it when I was 6.",
            "I hate the Aeneid. Dido lived 400 years after the fall of Troy, how does that make any sense?",
            "They're all lies, but two of the biggest lies we've heard all cower in fear at the one said by Richard Adams, the Watership Down author. There are several traumatizing parts to the book as the rabbits leave their home to make a new one. Tremendous book and I recommend it to everyone with eyes or ears. Each warren the rabbits come across represent a different form of human governance.",
            "Yeah idk wtf this means or how this is is a history meme at all",
            "Is that a reference to the book? Because I completely forgot the story",
            "I just pirated the audiobook for this the other day\n\nWhat a coincidence!\n\nGod damn audiobookbay really is a gamechanger. Never had the time to read through books but listening to them on the way to work etc, amazing!",
            "Fantastic book. \n\nI think Addams had a conversation with El-Ahrairah about calling it just a book about rabbits",
            "No, it's Watership Down",
            "The film was infamous at traumatising kids.  For a while if I wanted to cry, listening to Bright Eyes by\nSimon and Garfunkel would do the trick.",
            "Hmm. Surely a tough read at 6, though? Simply the prose, let alone making sense of some of the symbolism is high school level material, isn't it?",
            "Basically a bad adaptation of Odyssey",
            "The most unrealistic part of the book is the rabbits actually listening to Fiver, which the pandemic made quite clear",
            "Check out Plague Dogs if you've not seen it. Movie and book. Same author, same director."
        ]
    },
    "Barrel Man had the right ideas ": {
        "title": "Barrel Man had the right ideas ",
        "score": 18901,
        "url": "https://i.redd.it/8joek7jhlx7d1.jpeg",
        "content": "",
        "num_comments": 128,
        "comments": [
            "Dude was punk rock before punk rock was even cool",
            "“Why Diogenes do you sift through the trash heap for food, I can supply you with all the food you could want!” Alexander the Great\n\n“I was searching for the bones of your father, but I could not distinguish them from the bones of his slaves” - Diogenes",
            "Diogenes is a legendary troll.\n\n> Diogenes had nothing but disdain for Plato and his abstract philosophy.\n\n> Diogenes viewed Antisthenes as the true heir to Socrates, and shared his love of virtue and indifference to wealth, together with a disdain for general opinion.\n \n>Diogenes shared Socrates's belief that he could function as doctor to men's souls and improve them morally, while at the same time holding contempt for their obtuseness. \n\n> Plato once described Diogenes as \"a Socrates gone mad.\" According to Diogenes Laërtius, when Plato gave the tongue-in-cheek definition of man as \"featherless bipeds\", Diogenes plucked a chicken and brought it into Plato's Academy, saying, \"Here is Plato's man\", and so the academy added \"with broad flat nails\" to the definition.\n\n[Source](https://en.wikipedia.org/wiki/Diogenes#Athens)",
            "He was told not to spit on the floor or here or there. Given no place to spit politely Diogenes decided to make a point. \n\nI like Diogenes in all his stories like this. He’s my kind of genius.",
            "Behold…A Man.",
            "I often wonder if Diogenes was just the collection of a bunch of fun anecdotes about a particular careless and brash honesty, like some sort of Bill Brasky of antiquity.\n\n  \nYou know that Diogenes, well he was wanking it in the street again yesterday! The magistrate, he comes over and boy is he in a fit. He tells Diogenes that he can't be doing that, going purple in the face. O'l Diogenes just looks him in the face and says, \"**If only it were as easy to banish hunger by rubbing my belly.**\" Then starts wanking it it right there... DIOGENES!!!",
            "“I pissed on a man who called me a dog. Why was he so surprised?” -Diogenes of Sinope",
            "dude was a total savage, he saw the son of a prostitute throw rocks at a crowd and shouted to him “Be careful, you might hit your father”",
            "Alexander the Great said that if he had to be anyone but himself, he’d be Diogenes. He met Diogenes and asked him if there was any request he could grant him, and Diogenes just asked him to get out of the way of the light he was trying to sunbathe in. Fucking legend.",
            "OG cynic.",
            "be me\n\n2500 years ago at the forum\n\nhanging out with the greatest minds of my times in ancient greece\n\nPlato just said a man is anything that stands upright and has no feathers or fur\n\nmfw makes sense to me.\n\nunwashed bum who lives in a barrel outside the city walks in\n\nthrows plucked chicken at my boy Plato\n\nShouts \"Behold, A man!\"\n\nL(・o・)」MFW  my whole greek world view is broken by homeless dude.",
            "Including debasing currency, shitting in public, and jerking off onto fresh produce?",
            "I don't know if this is real, but it sounds like something he would say just to get a rise out of someone",
            "He voluntarily lived like a slop, most people who love him cant clean their own toilet, but those that can take care of themselves and still enjoy the man usually are interesting to chat with",
            "diogenes was the first redditor, so stunning and brave",
            "I just remembered a Diogenes story I read that was probably made up, but it fits him so we'll I've got to tell\n\nOnce upon a time, a rich man found Diogenes and saw him eating lentils.\n\nHe told him: \"If you knew how to flatter the king, you wouldn't need to eat lentils.\"\n\nDiogenes answered: \"If you knew how to eat lentils, you wouldn't need to flatter the king.\"",
            "https://existentialcomics.com/comic/219",
            ">fuck all philosophy\n\nbrainlet moment",
            "Diogenes’ entire life could be put on one big gigachad meme. That’s just the vibe he gives off.",
            "If you’re a fan of Diogenes, maybe don’t join a philosophic school. Everything since Diogenes, explaining Diogenes, is… not Diogenes.",
            "We could all learn a thing or two from Diogenes.",
            "OG hawk tuah",
            "alexander the great \"i will do literally anything within my power for you\"\n\ndiogenes \"yeah, you can get out of the way you are blocking my sunlight\"",
            "It wasn't quite as simple as that. The wealthy man's house was adorned everywhere with images of gods and other mythical figures, so spitting anywhere BUT his face could be blasphemous. Thus, Diogenes wasn't only mocking the host's materialism, but also his pretensions to virtue by sanctifying his abode while neglecting his own profanity (as opposed to Diogenes himself, who was wretched without yet pure within).",
            "My fave annotate is how Alexander the Great became a fan of his, visited this man and asked if there was anything he could do for him. And what does this legend ask of the man who could do damn near anything for him. 'Move a little to the left, your in my sun'",
            "Wasn't he the chicken guy? Absolute chad.",
            "would've done huge numbers on tumblr",
            "Diógenes the GOAT",
            "[You get what you fucking deserve!](https://youtu.be/OfU9DprXw1E?feature=shared)",
            "The original shitposter",
            "Diogenes walked so Marx could run",
            "Diogenes is the Danny devito of old philosiphers",
            "Hawk Tuah!",
            "Hello? Based Department?",
            "Diogenes was quite wrong about this. Spitting on the floor is bad. It’s dirty. It spreads disease. It’s a small act of cruel indifference inflicted on your neighbors.\n\nDoes Diogenes care about other people? (This is not a rhetorical question.) If he does then he should consider that some system of manners is good for a society, even if you disagree about the specific implementation. If he does not then his philosophy has no merit.",
            "I think history might have vindicated Diogenes the Cynic a bit.",
            "That's kind of a man who'd say go fuck yourself to great emperors.",
            "Is he suggesting wealthy people value property above the self",
            "Or you could just like… not spit in anyone’s house or on anyone’s face.",
            "Hawk Tuah on that thang",
            "Diogenes was once the greatest philosopher the world had ever seen before the legendary MC Hammer came about 2300 years later",
            "cynicism is probably one of the most damaging generic philosophy lately, so no, he kinda didn't. FFS, Russia spends tons of cash trying to make everyone as cynical as possible because they know how exploitable it makes people",
            "Great meme, awesome history, keep it up",
            "Politics of envy.  It has never worked out well for any society.",
            "Diogenes isn't punk. Punk is Diogenes.",
            "Dude was punk rock back when rock only referred to actual rocks.",
            "More so hip hop... Shoot, the man was a rebel who actually was spittin",
            "\"Hello Alexander, have tou yet conquered Sukondees?\" - D\n\n\"Where is this Sukondees?\" - A\n\n\"Suck on deez nuts u fuckin nerd\" - D",
            "Would a kangaroo's nails be broad and flat enough?",
            "Don't forget that when Alexander the great himself came to speak with diogenes, diogenes reportedly told Alexander to \"stand out of my light\".",
            "I also remember reading a similar story, where Plato was holding a bowl and told Diogenes “ this is only a copy of the  only one real bowl, that only exists here” and pointed at his forehead ( alluding to his theory of ideas). Diogenes then told him “ then this means that the empty space inside the bowl is a copy of the only real, supreme emptiness, that only exists here” and pointed at Plato’s forehead.",
            "We should give some credit to Plato for reformulating his definition when faced with criticism",
            "If Diogenese could have taken Olympic Wrestler Plato in a fight, he probably would have pulled his nails just to prove a point.",
            "Diogenes was the OG troll and I kind of love him for that. \n\nI mean, I wouldn't want to hang out with him because he was obviously a bit of a jerk but still. \n\nIt's a complex relationship.",
            "Alexander: you know Diogenes, if I was not me I’d want to be you\n\nDiogenes: if I wasn’t me I’d also want to be me",
            "Definitely the opposite of Erasmus of Rotterdam and his rather restrictive rules of etiquette. Couldn't even blow ones nose on the tablecloth...",
            "I mean I wouldn’t want someone to spit on my floor either…",
            ">He was told not to spit on the floor or here or there. Given no place to spit politely Diogenes decided to make a point. \n\nSo he was acting against senseless restrictions, not making a point about wealth \n\n\nThat makes more sense, ty",
            "I mean, I don't think he was a philosophical genius but the dude was based",
            "Proceds to undress",
            "and beneath the man, we find his... nucleus",
            "There's enough evidence that he actually existed lol.\n\nYou can kinda do that to anyone if you follow that line of thinking.",
            "Hey, new Diogenes lore!",
            "Diogenes also said that if he was anyone but himself, he'd also want to be Diogenes.\n\nHe's my favorite part of ancient history to read about.",
            "Always thought that story reflected really well on Alexander, 99/100 conquerors would have had that mf beheaded after saying something like that lmao.",
            "I love that a school of philosophical thought is just \"Doggish\" because the dude acted like a dog.",
            "Hell yeah brother",
            "I've gotta disagree. He's  not 500 pounds, and he lived outside, not a basement",
            "no, becauae he had a spine and stood by what he believed.",
            "We are stunning are brave? Weird.",
            "Like the cost benefits of living in a giant urn",
            "Diogenes would probably spit in your face for saying that.",
            "? what",
            "Truer words have never been spit in the face of a rich man",
            "Diogenic?",
            "Accurate",
            "BEHOLD, A MAN!",
            "And rocks were formed by air, fire, water and earth",
            "Hip hop and punk actually share a lot of similarities. As a punk who grew up and has lived in a city that is predominantly African American/black and Hispanic, I have made many bonds over the years through similar views. \n\nAnd I happen to love hip hop too.",
            "Hmmm...not sure.  Possibly?  \n\nUnfortunately, during the time of Ancient Greece, Australia hadn't been invented yet.",
            "They're actually kinda long and pointy. Like an untrimmed dog's nail.",
            "Pretty sure primates are set apart from other mammals partially by \"finger nails instead of claws\". So hairless bipeds with fingernails is actually *pretty* close.",
            "Nah the Australian expansion hasn’t come out at the time yet.",
            "I believe Alex the G offered him anything he desires, and Diogenes told his bitch-ass he was ruining his tan",
            "He's a consistent jackass. The best kind of jackass.  Play nice with him (and don't treat him like shit like most people tend to do in his stories) and you'll be fine.",
            "He seems like a chill dude, I’d just have talked with him all day.",
            "I bet he smelled pretty bad too",
            "Alexander:...Listen here, you little shit",
            "https://youtu.be/OfP1Iy7nXmg?si=Dp2lEAbdhHt6y9Qz",
            "He was probably making a point about wealth too, considering that he owned nothing but the barrel he lived in. Hell, there's a story about him throwing away his drinking bowl once he realized he could just use his hands.",
            "It was absolutely about *both.* Diogenes despised the wealthy. Viscerally.\n\nAlso, his idea of senseless restrictions was broad enough to include shitting in the street.",
            "The man who was a cynical ascetic who criticized himself for having the extreme luxury of a bowl to drink from would never dare make a point about wealth.",
            "*furiously masturbates*",
            "Yeah there's historical references to him and Alexander the Great. \n\nNow if some of his stories are tall tales, I can believe that.",
            "Can’t believe I forgot the best part",
            "Alexander was a lot calmer in his earlier life. He probably would have laughed it off with just about anyone. It wasn't until he was battling like multiple times a year in Persia he started to lose his knockers.",
            "There’s a story where at a dinner party, or something like that, they were making fun of him by calling him a dog. What did Diogenes do? He literally peed on the guy that called him a dog.",
            "Guys will see this and just think \"κόλαση ναι\"",
            "well he lived in a jar, pretty close",
            "Imagine your only understanding of Diogenes came from this meme.",
            "But then, everything changed when the fire nation attacked",
            "You're not wrong.  I said hip-hop cause like Punk as brotha re known as rebellious, one seemed to outlast the other.  But man others disagree 😂\n\nI appreciate your anecdote.",
            "ʎɐp ǝʞɐɔ ʎddɐH",
            "He used to masturbate in public…",
            "More like:\nAlexandra: Damn not even mad. This guys a legend.",
            "*Diogenes* “you own all this shit but don’t have a thing for me to spit in?” *spits in the guys face*",
            "I'm not surprised at all. This man was simply built different",
            "That escalated quickly",
            "Classic Diogenes",
            "This guy was born and chose violence",
            "The diogenes cum jar. Only it was self inflicted",
            "First 4chaner",
            "Punk is still heavily prevalent in today's culture. Hip hop is not as prominent as it used to be, unless you mean rap, but there is a HUGE difference between the 2. \n\nBoth have been around for quite some time and have a following to this day.",
            "I mean punk is still a thing its just evolved further and split into different smaller movements, especially underground. I think",
            "It's okay, he finished quickly.",
            "No no no. Violence chose to be born",
            "Same goes for Hip Hop.",
            "And his name was Diogenes."
        ]
    },
    "These guys had balls (bearings) of steel": {
        "title": "These guys had balls (bearings) of steel",
        "score": 7583,
        "url": "https://v.redd.it/8op3dov35y7d1",
        "content": "",
        "num_comments": 91,
        "comments": [
            "So glad they're filming ww2 flicks with practical effects now\n\nSarcasm aside, what the hell is actually going on in this clip? For real.",
            "Sadly, they missed the target as the factory was in Amsterdam ....",
            "Song: The Bombardier’s Song - Bling Crosby",
            "Now I wanna know what the fuck this is about",
            "Meanwhile the British night bombers",
            "WHAT IN THE ACTUAL FUCK IS THE CONTEXT OF THAT CLIP?!",
            "Nazis_ add glue to their planes that quite literally eats through the wood on the plains....... yeah.... Goes as well as you would expect \n\nAmerica_ builds a god damn flying bunker that eats flak and bullets like breakfast cereal and proceeds to build radar flak shells that chew through enemy aircraft like a fat kid in candy store \n\nFor all of you..... \"historians\" that like to think that Germany came super close to winning, Let that sink in for a bit......got it?....... GOOD....now stop giving those fascist losers so much credit when they actually were very bad at waging actual warfare \n\n( and TOTALLY not just because you simply look at them fondly and agree with their horrible ideology,)",
            "Heineken is a Dutch beer. In Germany it’s not even considered beer…",
            "Heinekin is Dutch not German.  They were enemies during WW2",
            "How and why is this guy's whole house exploding?",
            "They must really have hated that beer brand.",
            "what is this video from? i need a source and context please!",
            "They like to see better when bombing during the day",
            "No balls of steel here, it was orders, and stupid ones",
            "Sadly the bomber will never find a Heineken brewery in germany",
            "What is the name of this song?",
            "Now that’s 4D entertainment right there",
            "u/savevideo",
            "Yes",
            "So *that’s* what it feels like to chew Five gum",
            "No comments on the city name - bumfuckisberg?\n\nHmmm",
            "Watched Masters of the Air not that long ago. Real fucking good show.",
            "See the issue with this meme, is that the bombing worked irl",
            "Colin Furze on youtube wanted to make a \"4 dimensional gaming setup\", similar to 4D movies. He's playing Doom in this clip if I remember correctly.",
            "They bombed Heineken, that was zweiken",
            "Removing Heineken from this world wouldn’t have been a military target, but it surely would have been a worthy goal that all sides could agree on.",
            "Heineken Heinkel close enough",
            "It’s complicated but night bombing for the British at the start of the war while Americans did the day bombing with heavy fighter escort. This allowed for non stop bombing once the US entered the war and got to Europe. \n\nNear the end of the war Germans were unable to field fighters so round the clock bombing was stepped up. However, there was still flak cannons and every once in a while they got lucky and actually hit a bomber. The bombing was so often they sometimes didn’t get fighter escorts but they rarely needed them.",
            "Arthur \"fire up the Lancasters\" Harris",
            "Arthur \"The Dresden Decimator\" Harris",
            "4D DOOM",
            "Do you mean to tell me that the Germans couldn’t have defeated the allies if they managed to produce enough Sonderwunderwaffesturmgewherscheissenpoopenfartenpanzerkamfflugzeugunterseebooten Ausführung Bs?????????",
            "I completely agree. The Germans lost because the US had a lot of resources and couldn’t be attacked or bombed like the French and British, so the US was able to produce and research whatever equipment it needed without interruption.",
            "Conquering most of Europe is quite the impressive feat. Germany was a powerhouse, they simply bit off more than they could chew.\n\nNo one thinks they were ‘super close to winning.’ They simply had an impact greater than what would be expected of a nation that size.",
            "Me: \"Professor Farnsworth, ask that machine if the Germans win if-\"\n\nWho Win Machine: \"No.\"",
            "My favorite story was the British thought he Germans built a good cannon and shell so they had to engineer up better ones for a long time. Turns out the Germans literally were throwing shells at a wall and picking which shape they thought did the most damage with the cannon",
            "I don't think they came close to winning but German aircraft were very good, and the allies made plenty of mistakes too, and the B-17 bombing strategy was horrific with casualties higher than a WW1 trench assault. We're sort of nostalgic about it now but in the years after there war it was very controversial to have done unescorted day time bombing.",
            "Gettem!",
            "What is this writing style called",
            "I think your grossly underestimating the german military in ww2 man. The allies won through a mix of better tactics, skill, and in the end sheer fucking numbers.\n\nThe tiger was the undisputed champion of tanks in ww2, but that didn't matter when the western front had five to six shermans for each german tank(not just the tigers), and could easily and consistently replace them. And on the eastern front you have the soviets projectile vomiting t34's and a few IS-1 AND IS-2's at the germans (plus more shermans from lend lease)\n\nIt was the same in the air. The germans had the BF109, as well as the Fuke-Wulf. They created Air to Surface missiles, and pioneered CAS. (Although the allies copied and improved on what the ger.ans did). The only plane in the early war that could keep up with germany was the P51, and that is the same story as the tanks. We just spammed P51's until the germans couldn't see anything else, and gave every plane we weren't actively using to the soviets or brits.\n\nAnd on the seas was no different.  The U-boats kept the allies from operating at full capacity for a damn good chunk of time, and forced the allies to completely change how the approached naval warfare in the Atlantic.  We had to develop new radars and depth charges to combat the U-boats.\n\nAnd most Americans were deathly afraid of german equipment.  The MG34 and Tigers above the rest, allied tankers were constantly alert for any german soldiers with a panzerfaust. Why? Because they knew that the german army was a proper fighting force. And to sit there and say that they weren't,  is an insult to all the heroes who died on the beaches.  Who died in France, in Belgium,  in Italy,  all those who died above the skies of London, and every soldier who fought, to end the threat of Nazi Germany. \n\nGermany lost by the fact that they were outnumbered,  and in the end outskilled. As Roman said: \"men. You have fought like loins, and have been led by donkeys\"",
            "Damn are you guys obnoxious",
            "I don’t know if the flying pillbox is the best example or worst example considering it was a super heavy bomber but only in the sense that it was super heavy, and a bomber, being matched for payload by another allied one man fighter-bomber and 4-5x less than other allied heavy bombers.\n\nThat all said, the fact that it still makes the German planes look subpar really shows the capability difference at that stage of the war",
            "Nor in the Netherlands. \n\nThe Allies did bomb various Dutch targets too though, like the Philips factories.",
            "https://youtu.be/8FJXZfH03Mk?feature=shared",
            "[Colin furze](https://youtu.be/8FJXZfH03Mk?si=Id9ipF_Nh8-mmlLb)",
            "\"The Bombardier Song\" by Bing Crosby.",
            "###[View link](https://rapidsave.com/info?url=/r/HistoryMemes/comments/1dl78za/these_guys_had_balls_bearings_of_steel/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/HistoryMemes/comments/1dl78za/these_guys_had_balls_bearings_of_steel/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
            "Well goddamn thats impressive. However reduced to 6/10. Lack of Cacodemons and pinkys reduce the immersion.",
            "I did a similar thing for elden ring, but I just paid the neighbor kid $5 to kick me in the balls whenever I die",
            "Remember when his videos were reasonable?",
            "God I love him, absolutely mental nutter lol, glad to see he’s still at it",
            "That is impressively hilarious and Doom of all games",
            "I like Heineken 0%, I'm so sorry",
            "But in the beginning (before the P51D Mustang I believe) the fighter escort planes (P38s, P47s, Spitfires, etc.) didn't have the sufficient range to follow the american bombers through the whole mission. So they just turned back home earlier. Afterwards the german fighters came and attacked the bomber formations. German Flak also did its part after the axis fighters left. Both caused high losses in the daylight bombing campaign of the americans as the meme references.\nBut just as u/Intrepid00 said, it got better, the nearer the end of the war got. Other factors that haven't been mentioned for higher allied bomber surivival rate nearing the end of the war are the following:\n1. After the introduction of the P51 Version D Mustang there was a fighter plane that had the range to follow american bomber formations the whole way through their missions deep into German territory. (most important factor for increasing range and performance was using the british merlin engine in the american warplane frame)\n2. After D-Day gaining allied ground in continental europe shortened the length of bombing missions significantly. The shorter flight path also enabled other fighter plane models with less range to escort the bombers the whole way through.\n\nHope this explains the meme pal u/Goh2000",
            "Also as the war went on German anti air defenses were being more and more compact, since they were defending less area. In some ways they were getting harder to bomb.",
            "Arthur \"A very high percentage of you are going to die but that's a risk I'm willing to take\" Harris.",
            "*”Dear Fascists, if God meant for the Nazis to win then why did he make them so flammable?”*",
            "Nah, but there were plans in a drawer in the Führerbunker for an updated model. Shit would have been lit. Win would have been ez pz",
            "Ausführung Bs 👌😂",
            "I was able to read and pronounce that. Weird.",
            "haters will say it's not real, but it be",
            "Geshundheit",
            "Go go gadget 1 million M2 Brownings ordered! \n\nAlso stuff like the Sherman tank was a great example of US having undisputed industry. Maybe not the best singular vehicle, but there were always 5 more to backup",
            ">couldn't be attacked or bombed\n\nTo be fair, Japan did attack the US directly and made the classic blunder of touching the boats.",
            "\"No one things they were super close to winning\" you underestimate the werhaboos, my friend",
            "I have heard all my damn life \"German would have won if they implemented this gun\" or ' if Hitler made more of these tanks' \n\nSo many people DO believe they had a chance with the powers they were facing \n\nThey spend days borderline idolizing this dysfunctional country, and make excuses for it's MANY failures. and are lured toward fascist beliefs and political systems\n\nThe growth of semi-fascists in America is partially thanks to TV channels and historians giving them way to much credit \n\nThey lost cuz they sucked and refused to think differently. Sure that doesn't go deep enough into why they failed, still it's overall is a true statement",
            "The second classic blunder behind boat messing as evidenced by MIG-31 vs. F15",
            "Tired of bullshit and want to make people check themselves once in a while \n\nIt's a rare writing style \n\nI really don't like what I'm seeing, so I try and get people to see history as it actually was",
            "Nukes were coming \n\nA ANGRY idiot for a leader \n\nAmerica had planes that flew so damn high no god damn thing could hit them\n\nYears of refusal to adopt new tactics and technology \n\nThey SPENT resources on breading program for cows so they could bring back some big fat cow they considered the master race of cows..... IGNORING THE FACT THE SPECIES WENT EXTINCT IN THE FIRST PLACE \n\nBros were doomed from the start",
            "No cacussy for u",
            "Gotta admit, dying in ER is not as bad as dying in DS2.",
            "I feel like a lot of people like Heineken 0%\n\nAs in, they do not",
            "There's an SNL bit about people knowing all the trivia to Game of Thrones, which Castle everyone owns , or what is their Saying/\n\nAnd then they are asked \"Who is your local representative\" \"Name One state senator from any US State\"\n\n  \nI think WWII history is kind of like that",
            "This is why the wunderwaffen would never work.\n\nGermany didn’t need to produce laser nuke mecha.\n\nGermany needed to produce ten million artillery shells instead of one million.\n\nThey were outclassed at every level of production from food to shells to personnel.\n\nhttps://en.wikipedia.org/wiki/Military_production_during_World_War_II",
            "I meant the mainland US",
            "I have an uncle that texts just like this",
            "That's it, I'm getting me bat.",
            ":(",
            "It's definitely more forgiving. DS run backs make me want to cry. It's just a more relevant title, what with the expac and all.",
            "Didn't one of those weird Japanese balloon bombs hit 8 civilians on the mainland?",
            "Bro is probably pissed to be honest \n\nI spend way to much time hating how people behave and act, I'm not the most put together person. But Jesus \n\nPeople are STUPID \n\nI don't know what your uncle writes about but I'll assume he is trying to get a good point across. And not a less than desirable opinions \n\n\nI think me and your uncle believe if we take all dumb, pathetic, and downright ugly beliefs and standards they hold true, and put it in their faces.... maybe they will change I guess?\n\nIf someone craps on the floor, and don't believe me when I say there's crap from them on the floor...... IM GONNA POINT TO IT AND ASK HOW DID THAT GET THERE",
            "Nah the 6 gauge is required for that task",
            "Even Rune Farming is relatively easy. The general gameplay loop is far more forgiving. Just invest your runes if you got a nice big amount saved up instead of entering new territories or a boss fight. Even usable item farming is far easier, with the crafting and all, and many respawning spawn nodes."
        ]
    }
}