{
    "The Post Formerly Known as Anything Friday - June 2024 Edition": {
        "title": "The Post Formerly Known as Anything Friday - June 2024 Edition",
        "score": 4,
        "url": "https://www.reddit.com/r/homelab/comments/1d59y77/the_post_formerly_known_as_anything_friday_june/",
        "content": "# Post anything.\n\n* Want to discuss something?\n* Want to have a moan?\n* Want to show something off?\n\nDo it here.\n\n[**View all previous megaposts here!**](https://www.reddit.com/r/homelab/wiki/megaposts)",
        "num_comments": 21,
        "comments": [
            "I built a AI chat server. Nothing fancy but it works great. https://noted.lol/ollama-openwebui/",
            "I sometimes wonder how much cheese I can fit in my R720 before it stops working. 🤔",
            "Why is this thread known as \"the post formerly known as ...\" but it doesn't have a new name?",
            "Uptime kuma has a really great python package for API. Much easier to bulk add everything that way",
            "Just spent half an hour going progressively more insane trying to get postgres auth to work. No matter what I set the auth fails.\n\n...turns out I've got more than one VM with hostname \"postgres\" on the network. fuuuuuu",
            "I am planing on cobbling together a basic server using old PC parts.\n\nBuilding the machine is not a problem.\n\nWhat I am looking for is a way to connect other devices to it wireless.\n\nHow would I achieve this?",
            "Can I put a Cover panel on top of shelf in a  rack?",
            "I'm moving to a new house so that's means another 1000ft of ethernet to run to all the rooms.\n\nHelp me decide.  Blue or black ethernet cables?  This is important.",
            "CCNA = $$$$",
            "So I have a Dell PowerEdge R730xd running docker and plex with lots of storage for plex. im trying to think of new things to spin up in docker. What do you all use in your homelabs? Note: Im trying to avoid using reverse proxies as I dont want to expose my router like that, i use Cloudflare Tunnels instead.",
            "This subreddit is really inspiring me lol. Now I want to clean up all the cat6 spaghetti in my basement from when I ran cable through the house. I made a lot of them like 10 feet longer than they needed to be to give myself wiggle room, and it's a real eyesore down at the switch.\n\nWhat do yall think: Coil up the existing cables to tuck nicely up amongst the joists, or cut them short to a more appropriate length?",
            "I have a home server/seed/nas box.. 16tb HDD x8, 128gb ECC ram (zfs), ryzen 5700x, gtx 3090.\n\nI do occasional ML projects and gaming (when I want to play some AAA game on ultra) on it but it is  idle 97% of the time other than torrenting. But I'm still getting idle draw of like 130-150w, not unreasonable, but it seems so high for my actual needs.\n\nI guess I was kind of hoping that it would idle lower so I could kind of split the difference between 'power efficient nas/seedbox' and 'powerful homeserver/workstation', would it be possible to get the idling levels much lower and still retain most of the performance? What would be the lowest hanging fruit if I were able to go back in time?",
            "I put pihole into a container recently and now I feel the need to have a secondary server as failover for absolutely necessary things like DNS, or have my router (Mikrotik) simply be the secondary DNS in the event the pihole is down for any reason... that'd probably be ideal. Anyone know how to set that up properly? I use Quad9 for my upstream. Seems like the router would need to have settings for a lookup timeout to failover to Quad9 directly? Searching isn't really giving me much to do this.",
            "I wanna expand my homelab and also start getting into proxmox (with ZFS)\n\nCurrently I only have an Synology DS718+ running multiple Docker (\\*arr, emby, deluge, wireguard) and a Raspberry PI5 (pihole, unbound, heimdall).\n\nI still have a spare HP ProLiant MicroServer Gen8, G1610T lying around that I bought back in 2017, but never got around to installing it.\n\nStill running stock CPU and RAM.\n\nMy biggest issue is that, after reading into it, ZFS is somewhat CPU/RAM intensive (the more RAM, the better it seems).\n\nSeeing how my Gen8 only supports up to 16GB and is also from 2017, I'm wondering if it's worth it to invest into a new CPU and RAM, or if I should just go with a newer version (that I probably will end up having to buy more RAM as well?)\n\nI fear that the 16GB limit is gonna hurt the performance.\n\n\n\nPreferably I can get rid of both the Synology and Raspberry and migrate all services to the ProLiant, as well as adding more services to it.\n\nAny advice on what you guys would do in this situation",
            "Hello everyone,\n\nI am evaluating the cheapest and simplest way to manage, to backup my NAS. Today, considering that I am backing up more or less 2.5TB (and a little more than 1TB offsite), I do this:\n\nSynology NAS DS920+ in-site backup -> Raspberry Pi 4 with OpenMediaVault (USB 4TB HDD). \n\nSynology NAS DS920+ off-site backup -> Backblaze B2\n\n\n\nI have a Ugreen USB 3.0 3.5'' hard drive enclosure and a WD Red NAS SMR 8TB hard drive. Also, I am using 3 of the 4 bays of my NAS - I have one with no hard drives installed -. Which option would you recommend to me?\n\n- Continue with my current scheme\n\n- Replace the 4TB HDD with the 8TB HDD, via USB enclosure, on the Raspberry Pi\n\n- Replace the 4TB HDD with the 8TB HDD, via USB enclosure, but swap the Raspberry Pi for an Intel NUC, with Proxmox and an OpenMediaVault VM\n\n- Removing the Raspberry Pi (and the 4TB HDD) and connecting the 8TB HDD, via USB box, to the NAS\n\n- Removing the Raspberry Pi (and the 4TB HDD) and connecting the 8TB HDD to the available bay of my NAS (and creating a separate volume with only that hard drive)\n\n\n\nMy idea is to use the 8TB disk, which would allow me to backup more data or set more snapshots, simplifying my scheme, but preserving (or improving) the management and resilience of my homelab.",
            "we once had our lead dev plugin a server running its own dhcp. took out half the network before we figured out wtf was going on.",
            "Install a WiFi USB dongle or a cheap WiFi PCIe card? Connect it to your router/AP and done!",
            "Will the cables be visible?\n\nIf Yes: Black\n\nIf No: Blue",
            "I mainly use my homelab for learning. So most of the docker containers are self-build apps. Currently working on an Elasticsearch cluster (3 nodes with AMD ryzen 1600AF, 32GB of memory per server and a 500GB Nvme SSD).\n\nDnsmasq for ad blocking and Powerdns as the authorative server for my local domain. So all servers are reachable via their name. Example: nas.dest.lan, nuc.dest.lan, etc.",
            "As long as your velcro game is solid, coiling is the way to go. If you cut them shorter future-you is bound to be grouchy when you end up needing that slack for some insane unforeseeable reason.",
            "Same! I'm mainly just trying to learn different things. I use adguard home for adblocking. Never tried powerdns but I'll look into it."
        ]
    },
    "Mod: UptimeRobot Monitor Giveaway": {
        "title": "Mod: UptimeRobot Monitor Giveaway",
        "score": 0,
        "url": "https://www.reddit.com/r/homelab/comments/1dk5gie/mod_uptimerobot_monitor_giveaway/",
        "content": "The awesome team over at /u/UptimeRobot has contacted us about giving away some free upgrades in order to celebrate the release of their new web app!\n\n## Prizes\nIf you would like to toss your hat in the ring, **tell us about a time where monitoring helped you resolve a difficult situation**.\n\nThe top 10 most upvoted responses will receive 50 monitors for a year.\n\n## I want in\nReply to this post once. Do not reply to another post. Do not reply to a cross-post. Do not reply more than once, including with alts. If you can't figure it out, we can't help you.\n\n## Selection process/rules\n1. One entry per person. Using alt accounts will result in a ban. New accounts are not eligible.\n2. Thread is open through **Friday, June 28th 11:59 PM UTC**. We'll let you figure out when that is in your own time zones.\n3. We will create an export of all unique eligible users who have a top level comment (that is, replied to the post, and not to another commenter). Commenting more than once will not help you and may annoy us. Breaking the rules in your comment reply will get it removed and get you possibly banned.\n4. From that export, we will grab the top 10 most upvoted people. We will contact each of those 10 via PM on Either Saturday, June 29th or Sunday June 30th.\n\t1. In the case of a 2-way tie resulting in more than 10 selected responses, both responses will be selected.\n\t2. In the case of a 3-way (or higher) tie resulting in more than 10 selected responses, the winner will be chosen by submission time (the person to have submitted their comment first will be chosen).\n5. Winners will have **48 hours** to provide us their details for the account they'd like to redeem their winnings on.\n6. Any person who does not reply in time loses their spot and everyone moves up a tier. For example the 3rd place person does not respond, so the 4th place person gets their prize, and the person 5th on the list moves up to 4.\n7. We will give the list to Uptime Robot, and they will provide you with your winnings directly.\n8. We reserve the right to edit this post including this process and these rules without notice. This is Reddit, after all.\n9. The giveaway is open for anyone to enter.",
        "num_comments": 16,
        "comments": [
            "to end a debate :) monitoring was able to prove to dev's that the website was down, just because you can ping it does not mean its up, HTTP monitor was able to send the message loud and clear, website got fixed very quickly then",
            "Did anyone see the post and think the giveaway is about physical monitors - like displays?",
            "Why are we using upvotes instead of a randomizer? Upvotes just encourages me to downvote everyone else or wait to comment till the last possible minute when I will be least downvoted.",
            "Skynet is the coming.",
            "The post title is pretty misleading. A giveaway is not the same as a contest. Even the keyboard communities give away keyboards at random, and those things aren't cheap.",
            "One of my containers became completely unresponsive and I only noticed it very late, but thanks to monitoring I was able to know when exactly it happened and I was able to determine the correct backup to restore from immediately, saved me a good amount of time and braincells",
            "I use uptime robot on my web site!  And I have for many years! :)",
            "We've discussed this at length, and the decision was to choose based on upvotes rather than randomly picking 10 winners.\n\nAs far as upvote count is concerned, we've enabled contest mode specifically to hide that counter, and randomize comment order so that those voting aren't biased towards certain responses.",
            "you sly devil, this comment will end up being the most upvoted...",
            "Monitoring this situation will really help us determine the effectiveness.",
            "Yea, this isn't a giveaway, it's a lottery/contest.",
            "Sound like the type of guy that complains about the quality of service at a free soup kitchen for the homeless",
            "Hey, thanks for sending a reply!  That's pretty cool.  I guess my only point was that as a \"contestant,\" I'm not really sure what my incentive is to upvote anyone's post (versus downvoting).",
            "I mean, fair point.  That wasn't the intent.",
            "Definitely a fair point. Though if you post later to avoid downvotes, you also won't potentially get many upvotes either!"
        ]
    },
    "ThinkCentre Cooling": {
        "title": "ThinkCentre Cooling",
        "score": 170,
        "url": "https://i.redd.it/tamtlwfu6z7d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "^(OP reply with the correct URL if incorrect comment linked)    \n[Jump to Post Details Comment](/r/homelab/comments/1dlc9hl/thinkcentre_cooling/l9nrz5f/)",
            "My ThinkCentre got waaay to hot, now they are averaging 15-20c cooler.\n\nI hope someone else find this, and can help there hot-box.\n\n[https://www.printables.com/model/919453-lenovo-thinkcentre-cooling-mod](https://www.printables.com/model/919453-lenovo-thinkcentre-cooling-mod)",
            "Can you share some pictures of your rack mount for them and additional for your fan base and attachment?",
            "Are these for the ThinkCenter Mini/Micro's (M720 / M920) etc or for different models? I have a bunch of M920's that I would love to cool further. \n\nAlso how are you powering the fans? The fans you've linked to on printables seem to have a 3-pin header.",
            "Maybe a dumb question, but why not make 1 larger mount with a single 120mm to cool both?",
            "Good color match for the Lenovo/IBM bracket hardware too.  Nice attention to detail.",
            "Could you adjust the mount so it accepts 40x40 fans? That would let the smallest noctua fans to be used",
            "What were your temps before?",
            "Its not rackmounted, it just slides on the side with two fans",
            "M920 yeah, the same one i linked with usb header. They have removed the listing, but they are powered on 5v ",
            "Good question:) i have made one for work, one for my office and two for my rack.  I wanted something that was “per” host in case i mowed some etc.",
            "It's an excellent question. It would be far more efficient and quiet. OP provided the only good reason not to, which is if they plan to ever split these.",
            "I did try with another brand, at 40x40 but the frame/ height of the lenovo is smaller… so it looked off ",
            "70c😳",
            "I think they mean just back up a step or two and take another picture. Show us the patch panels to the UPS",
            "Is that also why 2x (per unit) and not just 1 central with some funneling?\n\nThe noise from 40mm's goes hard, so I would have thought halving the number of fans would be preferable.\n\nVery cool nonetheless.",
            "Not great. Not terrible.",
            "Thanku :) "
        ]
    },
    "Low power storage and media server": {
        "title": "Low power storage and media server",
        "score": 3,
        "url": "https://www.reddit.com/r/homelab/comments/1dlt3vx/low_power_storage_and_media_server/",
        "content": "I'm currently trying to build a new home server to get an upgrade from my Odroid H3+ to one that runs RAID and needs 30W or less (parental limitation) while being in idle. The services I want to run are Jellyfin (4k to 720p downscale if possible), SMB, SCP, Immich, and a Minecraft server (mod packs like Better MC or more realistic ones). It could get more in the future, like a smaller AI over Ollama, or LanguageTool.\n\n\nSpecs I already have/need:\nRAM: 32 GB (2x 16 GB)\nStorage: 4x 4 TB (software raid, tips might be helpful for TrueNAS) + 2 TB Samsung NVMe (from the old server)\nCPU: Needs integrated graphics\nCase: Can't be a rack one, only tower or smaller form factors\n\nIf anyone has good recommendations or already a PCPartPicker/Geizhals list, then I would be thankful.",
        "num_comments": 4,
        "comments": [
            "Why 4x 4tb?  If you're trying to save power, 2x 8tb will save you 4-5w idle.  The simpler (=lower power) MBs often come with only 2 now.\n\nIf you want 4, you can get the 2.5\" drives at that capacity for a similar price that use less power.",
            "> software raid, tips might be helpful for TrueNAS\n\nSounds like you mean raidz1 in zfs, which would give you 12TB usable space with tolerance for one failed drive.",
            "I want to use RAID. Not just mirror two drives",
            "Which is RAID-1 ;-)"
        ]
    },
    "Cooling in Apartment": {
        "title": "Cooling in Apartment",
        "score": 3,
        "url": "https://www.reddit.com/r/homelab/comments/1dlubye/cooling_in_apartment/",
        "content": "As the UK experiences a heatwave, my living room (which is quite large in width and height) is reaching 23-27c on a daily and although my network equipment and server hasn’t complained about temps yet, I was wondering if I should be looking into cooling during hot days.\n\nEDIT: It’s always 27c, I just happened to leave my above window open overnight, which kept it around 23c.\n\nIf so, what would be adequate? ",
        "num_comments": 7,
        "comments": [
            "27c..? That's nothing.",
            "27C is indeed nothing:) I'm in Poland and there is 28C outside right now. Balmy weather. \"Heatwave\" would be like 35C or higher for days :) What are the actual hardware temperatures?  Start monitoring your CPU, GPU, hard drives and SSDs. Maybe there is nothing to worry about? Most likely, there is nothing to worry about ;)",
            "In the 90s/2000s I lived in a 5th floor walk up with no ac. I played games late at night in my swim trunks with a box fan pointed directly at my open PC case to keep it from shutting off.\n\nI think that rig was a dual processor AMD duron 800mhz with 512mb of RAM and a ATI GPU with like 32MB.",
            "I assumed if the room temp was high, operating temps of my hardware will be much higher?",
            "I’ll start monitoring more than I am. I didn’t think too much about that.",
            "Damn.. I can’t imagine the cost of running that.",
            "Play at night, lower temps, lower power costs."
        ]
    }
}