{
    "Get in the Robot, Firefly - General Question and Discussion Megathread": {
        "title": "Get in the Robot, Firefly - General Question and Discussion Megathread",
        "score": 568,
        "url": "https://www.reddit.com/r/HonkaiStarRail_leaks/comments/1diyjrh/get_in_the_robot_firefly_general_question_and/",
        "content": "[.](https://media.discordapp.net/attachments/1248444425647161425/1252615911752597644/ZOR93Ag.jpg?ex=6672dcf9&is=66718b79&hm=8a979f8cf5f5eefaac60a90fca88e693afd61160acbd7d5fc3031f579b36d503&=&format=webp&width=668&height=437)  \n\nA huge thank you to our very own u/erikahrna for the Firefly edit!!\n\nPlease use this thread for discussion, questions, or other topics related to the game. Off-topic discussions are welcome, though we do ask they be marked as such.\n\nRemember to be respectful to others and follow the rules.\n\n# Please properly spoiler tag comments relating to the 2.3 Trailblaze/Companion/Adventure missions and story leaks.\n\n**Make sure any story spoilers are properly tagged using the following format:**\n\n>Spoiler Topic  \n\n\\>!spoiler tagged text here!<  \n\n\\>!separate paragraph of spoiler tagged text!<\n\nThank you to [u/Legonominom](https://www.reddit.com/user/Legonominom/) for the megathread title!\n\n **We recommend checking out the below useful resources:**\n\n# Tools:\n\n* [Warp and Achievement Tracker](https://pom.moe/warp)\n\n* [Stardb.gg - Achievement Tracker + Leaderboard](https://stardb.gg/en/achievement-tracker)\n\n* [Enka.Network - Showcase + Character Build Card](https://enka.network/)  \n\n# Community Guides:\n\n* [KQM Guides](https://hsr.keqingmains.com/)\n\n# Wiki:\n\n* [Honkai Star Rail Fandom Wiki](https://honkai-star-rail.fandom.com/wiki/Honkai:_Star_Rail_Wiki)\n\n&#x200B;\n\n***\n\n|Previous Megathreads|\n|:-|\n|[Latest Megathread](https://www.reddit.com/r/HonkaiStarRail_leaks/comments/1de7sc5/the_good_the_bad_and_the_son_of_a_nice_lady/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) \\- *12 June to 18 June 2024*|\n|[All Previous Megathreads](https://www.reddit.com/r/HonkaiStarRail_leaks/?f=flair_name%3A%22Megathread%22)|",
        "num_comments": 11487,
        "comments": [
            "# FAQ\n\n**What are the 2.3 second half banners?**\n\n* NEW [Jade](https://starrail.honeyhunterworld.com/jade-character/?lang=EN) (5 Star | Erudition | Quantum) / [Argenti](https://hsr17.hakush.in/char/1302)\n* [Serval 💜](https://hsr17.hakush.in/char/1103) / [Natasha](https://hsr17.hakush.in/char/1105) / [Asta](https://hsr17.hakush.in/char/1009)\n* NEW [Yet Hope Is Priceless](https://starrail.honeyhunterworld.com/yet-hope-is-priceless-item/?lang=EN) / [An Instant Before A Gaze](https://hsr17.hakush.in/lightcone/23018)\n* [Shared Feeling](https://hsr17.hakush.in/lightcone/21007) / [Trend of the Universal Market](https://hsr17.hakush.in/lightcone/21016) / NEW  Sunday 💜 LC [After the Charmony Fall](https://hsr17.hakush.in/lightcone/21045)\n\n&#x200B;\n\n**What are the 2.4 banners?**\n\n* First Half: NEW [Yunli](https://starrail.honeyhunterworld.com/yunli-character/?lang=EN) (5 Star | Destruction | Physical) / NEW [Dance at Sunset](https://starrail.honeyhunterworld.com/dance-at-sunset-item/?lang=EN) (5 Star | Destruction)\n* Second Half: NEW [Jiaoqiu](https://starrail.honeyhunterworld.com/jiaoqiu-character/?lang=EN) (5 Star | Nihility | Fire) / NEW [Those Many Springs](https://starrail.honeyhunterworld.com/those-many-springs-item/?lang=EN) (5 Star | Nihility)\n* Unknown Half: NEW [Poised to Bloom](https://starrail.honeyhunterworld.com/poised-to-bloom-item/?lang=EN) (4 Star | Harmony) / (QUESTIONABLE) HuoHuo will rerun according to Block\n\nNEW [March 7](https://starrail.honeyhunterworld.com/march-7th-character-2/?lang=EN) (4 Star | The Hunt | Imaginary) will be a free unit in 2.4. Trailblazers will be able to get up to E3 from the main event.\n\n&#x200B;\n\n**Is Sunday going to be playable? What is his path/element?**\n\nYes, he has been confirmed playable by multiple reliable leakers. Uncle has put him *potentially* at 2.7. We do not know his path/element at this time. 🕯🕯Join our prayer circle every Sunday🕯🕯  >!All nonbelieving heretics will be ritually sacrificed at the Church of Sunday's altar for kit leaks!<\n\n&#x200B;\n\n**Do we know of any other upcoming playable characters + their kits?**\n\n* Screwllum (Imaginary | Erudition | Male) - unknown release date\n* Hoyo announced Feixiao, Lingsha, and Moze in the 2.3 livestream. Unfortunately, Huaiyan, who was announced in the same livestream, is marked as an npc in the data files.\n\nCheck the rentry link at the bottom of the FAQ to learn more! The rentry link also has a few more potential upcoming characters (but with no concrete information about their kits).\n\n&#x200B;\n\n**When is the next livestream/patch/drip marketing/beta?**\n\nPlease note:\n\n* Livestream dates are pure *speculation*\n* The Live Date format is America time / Europe & Asia time\n* Drip Marketing takes place over the span of 3 days; only the first day of drip is provided in the chart\n* Beta usually starts around the same time as the new patch\n\n|Patch Number|Drip Marketing|Livestream Date|Live Date|\n|:-|:-|:-|:-|\n|2.4|Already Dripped|19 July|30/31 July|\n|2.5|15/16 July|30 August|10/11 September|\n|2.6|26/27 August|11 October|22/23 October|\n|2.7|7/8 October|22 November|3/4 December|\n|2.8|18/19 November|3 January|14/15 January|\n\n&#x200B;\n\n**What are the current active codes?**\n\n[Redeemable here](https://hsr.hoyoverse.com/gift) or in game  > Phone Menu > click “…” (to the right of the character pfp) > Redemption Code\n\n|Code|Availability|Items|\n|:-|:-|:-|\n|[STARRAILGIFT](https://hsr.hoyoverse.com/gift?code=STARRAILGIFT)|Permanent|Stellar Jade × 50 + Credits × 10k|\n|[6T3F5HVD6LK7](https://hsr.hoyoverse.com/gift?code=6T3F5HVD6LK7)|Limited 2.3 Code|Stellar Jade × 50 + Credits × 10k|\n|[FIREFLY0619](https://hsr.hoyoverse.com/gift?code=FIREFLY0619)|???|Oak Cake Rolls × 2 + Credits × 5k|\n|[FIREFLYSGIFT](https://hsr.hoyoverse.com/gift?code=FIREFLYSGIFT)|???|Traveler's Guide × 3 + Oak Cake Rolls × 2|\n\n&#x200B;\n\n**Where's the unreleased character google doc?**\n\nIt is now hosted on rentry! (sorry mobile users - reddit eats rentry links)\n\n&#x200B;\n\nrentry. co/7k3mt",
            "I can't take it anymore. I'm sick of Cocolia. I try to get a SU run. Cocolia is there. I do a battle event. Cocolia is there. I unlock a new game mode. Cocolia is there. I need stellar jades. Cocolia has them.\n\nShe grabs me by the throat. I pull Huohuo for her, I pull Aventurine, Fu Xuan. She isn't satisfied. I build Gallagher. She freezes him instead. She locks her weakness bar.\n\nI can't pull for Ruan Mei, I don't have enough jades. She grabs my credit card. It declines. 'Guess this is the end'. She performs 7 actions in a row. 'The Eternal Freeze will bury you!'. It buries my will to live. There's no hint of sadness in her eyes. Nothing but pure, raw CC. What a cruel world.",
            "Can we bring back companion quests?😭 I feel like penacony kinda needed more than BS/Sparkle...",
            "the saddest part of finishing penacony exploration is that i won't be able to hear the red origamis doin that super cute sound when i find them and they leave to go back to the nest é.è *mnyo mnyo mnyoouu\\~*",
            "respectfully i would like to ask cocolia to stop taking actions for fucks sake",
            "hello i’m usually a lurker but i was so overwhelmed by one thing in penacony that i had to ramble about it somewhere so i made a throwaway\n\nanyway 2.3 side content spoilers, 2.0 cocona quest spoilers (tw: suicide mentions)\n>!i was in a really, really bad place when penacony dropped, as in ‘this is the most suicidal i’ve felt in years’ kind of bad. i sobbed my heart out while doing the cocona quest because at first i really wanted to let her go and give her the ending i couldn’t reach myself. but then i had this thought that ‘well, i know what will happen if i let her go - that’ll just be the end. but i don’t know what will happen if i hold on and she keeps living. i kind of want to see that.’ and i realised that i could apply that thought to my own life. it’s a really obvious thought and one i’ve had time and time again but somehow being forced to see a fictional character in my shoes just made it so much more impactful.!<\n\n>!and then along came 2.3, where you can invite cocona to sing on stage and live out her dreams. and i remembered how i agonised over the choice to let her go, and how if i’d gone through with that i wouldn’t have been able to see her do this. i wouldn’t have been able to experience this little precious moment all those months later. how if i had ‘let myself go’, so to speak, i wouldn’t have seen any of this either. and it probably sounds really stupid, but when i saw her there, it suddenly felt like making that difficult choice to stay alive - for both myself and cocona - was somehow worth it. even if only for a moment.!<\n\n>!i have mixed feelings towards penacony as a whole. but i feel like i owe a lot to this particular side story (as well as everything with aventurine in 2.1, but that could be its own comment lol). i felt so seen for the first time in forever, and the fact that i was rewarded for such a difficult choice, even if it’s a totally inconsequential one in the grand scheme of things, even if it’s just in a gacha game i probably won’t remember in a few years - it has made me feel feelings i didn’t know i could still feel.!<\n\n>!anyway that’s all. thank you for reading my silly little thoughts and i hope you’re having a wonderful day/night/whatever time it is wherever you are!<",
            "(2.3 story spoilers)\n\n>!It's really funny that not all the Stonehearts transform with their cornerstones. It's Aventurine's specific power to turn into a sexy jester with a tiny waist, bless him.!<\n\n>!On a more serious note it makes sense that his power involves being very flashy and making himself look like a supervillain considering how often he uses that tactic in his strategies to distract from what's really happening (including in that transformation scene). It's really interesting how their cornerstones are personalised.!<",
            "Apocalyptic Shadow's music 👌👌 \n\n\nApocalyptic Shadow's creepy vibes 👌👌\n\n\nApocalyptic Shadow's NPC 👌👌\n\n\nApocalyptic Shadow's gameplay 👌👌\n\n\nApocalyptic Shadow's buff effects 👌👌\n\n\nApocalyptic Shadow's minimum requirement for 3 stars ❎️❎️❎️❎️",
            "Okay i cooked a sunday team - Robin Bronya Sparkle Sunday\n\nSo basically they all advance him forward so we can get his banner earlier 👍🏻 thoughts on this team?",
            "that split second of black screen between the login and maint message always gives me hope, just for me to be dragged back to reality",
            "2.3 early story >!Okay, but Dan Heng saying that his dream was all current Astral Express crew members travelling across the universe together forever is really fucking sad actually. /(.\\_.\\\\) Like, as a Vidyadhara, he'll probably outlive every one of us. Well, other than Pom-Pom, but still. Damn. Now I made myself sad too.!<",
            "I’m not really in the camp of “Jiaoqiu needs to heal to be good,” but I am in the camp of “Jiaoqiu needs a heal (or otherwise some team effect) for his 2-flavor hot pot ult to make sense.” \n\nIt looks silly for him to only have a *yin* side but no *yang* side.",
            "2.3 spoilers\n\n\n>!Love that Robin went behind Oti Alfalfa's back to give the Astral Express the Radiant Feldspar and very publicly announcing that it was a unanimous decision, thus preventing Oti from denying the claim if he wants to keep up the appearance of perfect unity among the Family to keep prices stable/high for his IPO plan. Love me a scheming little sweetheart!<",
            "(2.3 story spoiler) >!Old Oti: I enjoy talking to smart people because we don't have to beat around the bush.!<\n\n>!>Proceed to beat around the bush!<",
            "Hi folks! Some of you may know me from the Genshin leaks sub's megathread.\n\nAlthough I don't play HSR anymore I got a request to post time tables for this sub as well, so I've been working on calculating and crosschecking dates which has been a real pain in the ass. I also have vague plans to do these for the ZZZ leaks sub eventually.\n\nHere's what I managed to piece together for the next few patches:\n\n|Date|Days left|Event|\n|:-|:-|:-|\n|6 July 2024|15|Jade Trailer|\n|10 July 2024|19|2.3 Phase 2; Jade Debut|\n|15 July 2024|24|2.5 Drip Marketing ; Livestream Announcement|\n|19 July 2024|28|2.4 Livestream|\n|28 July 2024|37|2.4 Preload; Yunli Trailer|\n|30 July 2024|39|2.4 Patch; 2.5 Beta; Yunli Debut|\n|17 August 2024|57|Jiaoqiu Trailer|\n|21 August 2024|61|2.4 Phase 2; Jiaoqiu Debut|\n|26 August 2024|66|2.6 Drip Marketing ; Livestream Announcement|\n|30 August 2024|70|2.5 Livestream|\n|8 September 2024|79|2.5 Preload; ??? Trailer|\n|10 September 2024|81|2.5 Patch; 2.6 Beta; ??? Debut|\n|28 September 2024|99|??? Trailer|\n|2 October 2024|103|2.5 Phase 2; ??? Debut|\n|7 October 2024|108|2.7 Drip Marketing; Livestream  Announcement|\n|11 October 2024|112|2.6 Livestream|\n|20 October 2024|121|2.6 Preload; ??? Trailer|\n|22 October 2024|123|2.6 Patch; 2.7 Beta; ??? Debut|\n|9 November 2024|141|??? Trailer|\n|13 November 2024|145|2.6 Phase 2; ??? Debut|\n|18 November 2024|150|2.8 Drip Marketing; Livestream  Announcement|\n|22 November 2024|154|2.7 Livestream|\n|1 December 2024|163|2.7 Preload; ??? Trailer|\n|3 December 2024|165|2.7 Patch; 2.8 Beta; ??? Debut|\n\nI cannot predict things perfectly as sometimes HSR will delay things like drip marketing but I hope this is still useful. Please don't hesitate to let me know if you think there's a mistake somewhere.",
            "May your pities be early, and 50s won",
            "2.3 trailblaze mission (THE groupchat)\n\n>!help me i cannot stop laughing 😭😭 sparkle's bomb threat with monodrama playing in the backround is already cool. then there's this random groupchat of who knows how many people?? turns out most of the penacony cast is there and it just keeps getting better!<\n\n>!boothill going \"wtf is wrong with u\" is relatable but argenti with \"my silver cowboy!\" LMAO ik he means well but i was also not expecting that!<\n\n>!aventurine suggesting to bet on who will survive... thank god for context so this is it. my lil meowmeow is safe and can spend the rest of his time recovering. maybe even have fun in watching the chaos unfold?!<\n\n>!ofc the best part of this groupchat is ratio. says \"k\" and then just leaves. he really said \"this is not my problem anymore, you can all deal with this by yourselves.\" truly no one's doing it like him 😭😭!<",
            "The whale speedruns over on CN are an absolute insanity.\n\nI always thought whaling on HSR was kind of boring since the lower the cost the more impressive the run, the clear is the same if there's that 0 cycle ceiling.\n\nHowever, now with AS you can properly speedrun with extremely jacked characters, here's a [**19 AV** Acheron top side and **7AV** Ratio bottom side run](https://b23.tv/dwxP2JC) (yes you read that right).",
            "DU: here's your propagation equation\n\n\"Alright, DHIL time\"\n\nDU: ...and your elation blessings\n\n\"Never mind, I guess it's Ratio+Aventurine and I'll switch the equation later\"\n\nDU: ...and your curio for Fire breakers\n\n\"I... guess I'm using Gallagher instead of SW here then?\"\n\nDU: ...and a boss that requires DoT\n\n\"\\*screaming\\*\"\n\ni get that the focus is encouraging more team variety but this much rng is hell",
            "A message to all megathread users,\n\n>!Thank you for always having patience and answering my (noob) questions, or just anyone else's questions while we're at it. Early on in the game's life, I remember asking in the megathread of that time which resource site was the best for HSR, but the truth is that you all are the best resource for me. So thank you again.!<",
            "I really identify with the origami birds and their kindness, hyperfixation on a single task, prowess at getting stuck in random items, lack of object permanence, misunderstanding of basic concepts, and their need to evacuate a conversation after two sentences\n\nI too wish I could leave a conversation with a customer simply by saying “Oh no! I suddenly remembered that I left some luggage at home. I hope it's not too late to fly back to the Great Tree, chirp!”",
            "So, Argenti missing English voicelines is just going to be a thing every patch from now on?",
            "(2.3 story spoilers) >!Watching Numby just shoot off to the distance distracted by a chest as soon as any cutscene ends during Topaz PoV was a perfect representation of my mind and ability to fully focus on just the story. \"I'll just do the story and go back to collecting chests later\" then a couple hours later, properly distracted and browsing reddit: \"oh right I was supposed to do story\"!<",
            "2.3 : >!The Astral Express is running out of Traiblaze Power, the choices for the next destination are limited. However, there is a way to never run out of fuel again : go to a world that even Akivili never reached, a world that many across the universe don't even know exists, a destination fettered by three Paths... The Eternal Land, Amphoreus.!<\n\n2.4 : >!Nevermind let's go back to the Luofu!<",
            "Just saw Cocolia go 8 times in a row... this woman must be stopped wtf",
            "Every new thread I look at the \"do we know of any other upcoming characters\" part of the faq and see Screwllum there. This time he's alone.\n\nSometimes characters join him for a while and then leave as they enter beta. But Screwllum stays and waits for his turn to be released",
            "2.3 \n\n>!CN comment: what did robin exchange for sunday's freedom? !<\n\n>!reply: selling herself as BiS support for the IPC team!<",
            "I feel like a parent telling their kid \"not yet\" with how I keep answering my internal dialogue \"So how's Hunt March sheeting\" \"Patience, *lists some reason it's not worth calcing now and what info we lack*\" \"oh ok...   ...    ...So how's Hunt ma-\"",
            "Gotta unsub from any main subreddits for characters who use the new relic sets to avoid seeing the most insane luck day 1 and getting jealous",
            "Refreshing the thread hoping someone says \"it's up\" 🙏",
            "Let me in! I want to get my 50/50 loss out of the way so I can cry myself to sleep",
            "apocalyptic shadow\n\n>!crying laughing giggling so hard that Cocolia gets a super fancy title name \"Annihilator of Desolation, Mistral\" and Gepard is still just \"Gepard\" - I love the landmeows!<",
            "2.3 story interaction\n\n>!Aventurine’s “Wanna bet on who survives this” text immediately followed by Ratio’s curt “k” still has me cackling hours later!<\n\nAlso >!When Boothill said something like “One wrong move and I’ll blow your brains out” to Aventurine I laughed and went, “Joke’s on you ranger he’s into that”!<",
            "2.3 spoilers\n\n>!Okay I’m tired so idk if I missed it but did the standoff at the end of 2.2 between Boothill and Aventurine just…go nowhere??? 😭 Like he took out a couple IPC guards and asked about Oswaldo and then…???????!<",
            "Apocalyptic Shadow Rant\n\n>!Go fuck yourself Cocolia🖕🏽!<\n\nEdit: >!And I love you Gepard, but you can go fuck yourself too🖕🏽!<",
            "Oh wtf\n\nA complete in-game guide with recommendations on LC, Relics, teammates, statgoals, trace priority and everything HSR has now\n\nTruly peak bruh, draws from HoyoWiki but damn, this makes everything SO accessible",
            "2.3 story >!Hey, Jade? Jade? How the fuck did you take away Stacy's ability to make friends? Like I understand how you took one guy's wealth and the other's memory bank, but how did you make sure Stacy will never be able to have close relationships again? (O∆O) !<",
            "❌Doing the 2.3 quest to find out what happens\n\n✔ Doing the 2.3 quest so that I can read everyone's comments",
            "the \"just fuck my shit up fam\" combo of picking the curio that deletes all your blessings for fragments (with no shop before the boss to buy any new ones, epic, only a workbench to trade blessings of which I HAVE NONE), then immediately picking the curio that buffs boss HP by 40% and ATK by 20% for every inactive equation\n\nI have five inactive equations, 5291 fragments and no hope of victory but at least I unlocked shit for my dex",
            "[aventurine's boss theme](https://www.youtube.com/watch?v=Sl9_wcOLass) is officially released finally!!!!! \n\n'Hell Is Preferable to Nihility' go off my brother",
            "Take these noisy-ass billboards out of my sight or so help me Xipe",
            "Damn Silverwolf maybe drop some 10 fuels pls? Like just say its to oil up the arcade machines or something 😭",
            "Bruh theres this new curio that forces you into autoplay. I didn't think too much of it until I realized that its going to force you into autoplay for the ENTIRE run. If you try to turn autoplay off it tells you that you literally don't have the right to do so 😭",
            "Finally finished the 2.3 quest (positive + negative)\n\n>!Well,,,,,,,,,,,,,,,,,,, it certainly happened. While there were parts I enjoyed, it felt like there was just way too much bloat. It's another epilogue that just fell flat for me.!<\n\n>!The Good!<\n\n>!I liked the sneak peak into the Stellaron Hunters' relationships with the scene with Silver Wolf and Firefly. Their dynamic is so much fun. I love that Kafka lets Firefly have free reign with her credit card, I love that Silver Wolf is poking fun at Firefly (why do you ask a question if we all know you've made up your mind and are stubborn as hell), I love that Blade is worried in his own angy grandpa way, I love that the crew regularly throw sweets at him and Kafka. Firefly's relationship with the Stellaron Hunters was the thing I wanted to see most in the epilogue, so I'm glad the devs let us peak into their dynamic a bit.!<\n\n>!Already gushed about Dan Heng's dialogue in an earlier comment, so I'll just leave this as a bullet point. I do love that we got to see more of the crew today. (I am a sucker for found families, so getting to see the Stellaron Hunters AND Astral Express families in one quest was a treat).!<\n\n>!Really enjoyed the Acheron farewell cutscene. Praying, begging, pleading that we get a skin for her with the Mei Bangs (tm) and horns someday soon.!<\n\n>!The Sunday ending was (in my incredibly biased opinion) the best part of the quest. The voice acting was so raw. His VA really went above and beyond. I'm desperate to know how his and Robin's story plays out in the future. I *need* to know what price Jade is going to make them pay - Shaoji has me worried with her previous \"customers\" losing their wealth, their relationships, and their memories. I don't think it's going to be something as simple as just getting information from Robin for the Oti deal. That seems too small a price to pay compared to Jade's other bargains.!<\n\n>!The Rant (ye be warned, there are negative feelings I'm going to vent out and then move on from ahead)!<\n\n>!The rest of it just was not my cup of tea. At this point, I hope Hoyo stops trying to write \"clever\" characters since they always, always, always miss the mark. The entire scene behind Jade and Oti was just *bad*. You hype up a character as poison and an extreme business shark and then turn around and give her a scene that essentially boils down to:!<\n\n>!Oti: Everyone here is so smart! We're so smart! Let's be transparent because we are so smart we all know what's going to happen! Here is my entire plan!!<\n\n>!(10 minutes later) Jade: Here is my detailed plan a 12 year old could make. We're going to talk bad about you on social media and news networks. Or you could do this deal instead.!<\n\n>!Oti: Wow! You are so smart! This is a great deal!!<\n\n>!Idk man I'm just tired of Hoyo not being able to decide if they are a visual novel or an rpg. There is so much they could have done with a character that excels at working behind the scenes instead of just telling us she is smart. Jade just deserved to have her writing handled with care, instead of what felt like her being shoehorned in at the last minute to do a small lore drop :/!<\n\n>!Moving along, Sparkle's arc in penacony was a miss, the bomb scene sure happened, the only thing impression of the end cutscene I had was \"Why is Aventurine standing next to Acheron's slash that we spent 3 hours fixing in the boring Clockie Event?\" Just left me feeling indifferent to everything, which isn't something I want from an epilogue.!<\n\n>!Last gripe, but it's been ongoing pet peeve with both Genshin & HSR: I really, really, really wish Hoyo would put more care into animations during the character interactions. Most of the time the characters just stand there and do 2 or 3 arm gestures and the Floaty Breathing With Their Arms At Their Sides Thing and that's it. Hope they spend a little more time/effort on them moving forward.!<",
            "Not a Megafull Threadshine? smh",
            "Admittedly, I half hoped when I opened reddit that this thread might be named “Like Glamoth(s) to the flame”.",
            "2.3 Quest and beyond\n\n>!Having the TB be an NPC while the player assumes the POV of another character is a concept that I hope they do more often in the future. Perhaps March during the upcoming return to the Luofu.!<",
            "dimulated universe",
            "made me laugh when I opened up Divergent Universe and almost all my units were highlighted green, indicating the game was giving them assistance. I was like jeez are my builds THAT bad... turns out its because i didn't level basic attack on anybody and the game thinks it needs to be level 5 for you to survive. i'll take it i guess lol",
            "The lack of the easy access beta is making this cycle already feel like a drought.\n\nNot a Leaks... save me Not a Leaks...",
            "2.3 main story funny observation \n\n>!the way Ratio just said \"k\" and hopped out of the group chat... unbothered king!<",
            "Seeing some people say AS is easy makes me feel like I have skill issue when I’m struggling to even stay alive on side 1 with Luocha 😭",
            "AS talk\n\n>!After malding over AS Difficulty 4 all day (to the point where I couldn't focus on doing the main quest because I kept thinking about AS...) and trying to make my Xueyi team work, I found that the secret was just to use my Boothill team on the first side -- even with Cocolia's phys res and my lack of Ruan Mei, his weakness implant and big damage while she was broken made it work. It took a bit of timing to get right since Boothill's standoff meant Cocolia was just blasting him a million times in a row, but with a little bit of planning I was able to make sure Luocha's auto-heal was always ready to save Boothill in the middle of Cocolia's blasts!! Shoutout to Bronya, too, because her cleanse came in handy so many times when Boothill got frozen. And then for Argenti's side, my DHIL/Aven/Hanya/Yukong team did super well :') Now I can ignore this mode exists for the next 46 days!<",
            "Golden Aideen Tokens\n\n>!You can use your tokens to buy stuff from the dude in the Dreamflux rooftop and buy a Hanu TV for the Astral Express. You get 2 achievements from placing it in the train and transforming into Hanu to enter DH/March's room.!<",
            "I just started Divergent Universe and the relic mapping feature is a nightmare. It straight up replaces some full sets/builds just because one relic is +12 and completely breaks their speeds (along with everything else). Why did they not make this toggleable?\n\n(DU opening quest and post-2.3 main story quest spoilers)\n\n>!Screwllum always talks so highly of Ratio and takes into serious consideration everything he says - meanwhile Ratio is an absolute menace in return. Of course he refused to be directly involved and complained about everything. One day the robot man friendship will catch up to you! That being said Ratio didn't have a goodbye or check out like the other Penacony characters and didn't show up for DU. He really just Tuxedo Mask disappeared once he was done here ~~to show up for the next planet~~.!<\n\n>!The Boothill/Argenti and IPC scenes were so funny, it feels like they were made to be voiced so it's sad they weren't. Jade acting like a single mother trying to check out of the hotel while the kids are screaming and pulling each others hair was hilarious. Topaz and Aventurine's sibling rivalry dynamic is great, it's so funny that people thought she hated him but she really just had a grudge because he trolled her with the stock market. I like that they're the friends that say nice things about each other behind each others back and then trash talk each other when they're face-to-face.!<",
            "put apocalyptic shadow on autoplay despite knowing autoplay makes dumb decisions (i died internally watching it use seele’s ult on an unbothered icicle instead of gepard who still had his shield up) but i needed to go eat breakfast \n\nand i finally full star cleared it\n\ni’m actually stupider than a robot! i can’t have this realisation right now please",
            "wish hsr was like genshin and had consistent character quests, they just did one companion quest in penacony and then just decided to not do any more 🥲",
            "divergent universe is fun even if for the sole fact that you get to play with the 4-star/standard 5-star characters you have no resources to build for.",
            "i love march a marchillion amount",
            "I might actually be Bennett irl holy fuck. I just lost my Ruan Mei 50/50 which would make this my EIGHTEENTH (18th) loss in a row continuing my over a year long streak. Doing gacha pulls genuinely makes me sort of anxious now and its just not an enjoyable experience anymore. I think I'm gonna finally take the hint and quit for a long while.",
            "[We don't deserve Argenti](https://x.com/omochipaaan/status/1804096682340290905) 🥹",
            "I will not talk about Jiaoqiu until v3, I will not talk about Jiaoqiu until v3, I will not talk about Jiaoqiu until v3...",
            "2.3 story and side quest spoilers\n\n>!make sure to go back to the stern of the boat to accept the side quest to customize the ship. around the end of the quest you get a package and it's gifts from aventurine 🥺coupled with Ratio saying \"no wonder he likes you so much\" and him giving us gifts to congratulate us, Aventurine I will be your bff until eos😭😭!<",
            "> Logs in to Genshin\n\n> Gets Yoimiya's precious birthday message.\n\n> Logs out.\n\nI might not be playing that game much lately, but true fans have standards, happy birthday to my queen 👑",
            "Something I have noticed for a while now, Hoyo event UI designs are so slick. The graphics, the sounds, the transitions between pages are all so satisfying. It's a level of polish that I really admire as someone who knows next to nothing about game design, but has played enough games to appreciate the people behind it all.",
            "Find someone who loves anything as much as Hoyo loves thigh straps. \n\nSeriously I just scanned through all my playable characters and I swear at least 80% of them have at least one. \n\nThis is how you know Screwllum will be playable. Lol.",
            "Imagine if you died as firefly and instead of whatever voiceline she does you hear: *windows shutdown sound*",
            "I nominate we permaban the first enigmata person who says it's up when it isn't",
            "SPOILERS about 2.3... but not really, it's more a critique about what's *missing* from the story in my opinion, I don't really go into detail about what happens in the new patch.\n\n>!There's been a severe lack of companion quests for the past 6 months, it's especially noticeable in this last patch.!<\n\n>!Boothill and Jade got next to no screentime or development and heck, even Firefly didn't get much of anything in what was supposed to be her big patch, besides the trailers that is, but if a trailer can tell a better story than the damn game then clearly there's something wrong.!<",
            "I sort by new for this sub and usually get annoyed by the deluge of showcase videos but something about there being nothing for Yunli and Jiaoqiu because the guy who makes the private server for them has no interest in the new 5 stars makes me sad",
            "Jiaoqiu debuff only 10% better than Pela smh  \nJiaoqiu DoT 100% worse than Gui until E2 smh  \nJiaoqiu healing 100% worse than Gallagher smh  \n\nJiaoqiu not worth pulling smh\n\n(for legal reasons, this is a joke)",
            "yunli’s uncle became immortal trying to bring back yunli’s uncle's friend, who upon a botched revival had to be mercy-killed by yunli's uncle's friend, and yunli's uncle's friend tortures yunli's uncle until yunli's uncle is let loose and starts chasing down yunli's uncle's friend's reincarnation, whose previous incarnation had convinced yunli's uncle to try reviving yunli's uncle's friend, to make them pay the price. this all culminates in a confrontation in which yunli's uncle confronts yunli's uncle's friend's son and yunli's uncle's friend's reincarnation, who is stabbed by yunli's uncle and teams up with yunli's uncle to fight yunli's uncle's friend's son, and this was all secretly orchestrated by yunli's uncle's friend's son's dad",
            "We're hitting hard pity with this server maintenance",
            "Why is Jiaoqiu so lazy? I mean, 98 base speed? Man’s gotta get some more pep in his step.",
            "[Meshing Cogs](https://files.catbox.moe/wtw0vz.png)",
            "I hope the next megathread is named Firemega Flythread (don't know where to post megathread suggestions sorry)",
            "Nah that alleged \"lingsha\" lightcone is bonkers if you consider that she uses summons as stated by homdgcat. She will keep on stacking speed. Break teams will go lightspeed with this one lol",
            "im still thinking about that march lc\n\nshit had 4k ultra hd ray tracing graphics on max or something because it looks better than some five stars",
            "Just lurking here cos here’s where I learn when the server is open 👋",
            "@ Apocalyptic Shadow NPC: Ma'am may I have your hand in marriage\n\n(I love the spooky gothic vibes just *chef kiss*)",
            "Got to the slot machines in Divergent Universe for the first time and got excited\n\nUsed Aventurine\n\nGot the worst prize for all 3 turns\n\nWHAT THE HECK AVENTURINE I THOUGHT YOU WERE LUCKY 😭",
            "Minor 2.3 spoilers >!Acheron with a genuine smile on her face is everything I ever wanted!<\n\nAS was good, the horror sound effects were legit creepy and actually really cool. Only thing is I kind of wish it wasn't the same 2 bosses for all 4 difficulties; some variety would be nice instead of the same fight 4 times in a row. The ult refresh actually working with Acheron was nice. Also, if they allow you to skip the easier difficulties if you 3star the later ones like PF and MoC, that game mode is going to be super short in future cycles.",
            "2.3 / potential 3.X spoilers\n\n>!So I'm thinking the 3 Paths Amphoreus is fettered by are Remembrance, Elation, and Erudition. Sparkle mentioning Dr. Primitive liking bananas also makes me think he and Black Swan are enemies, so that's a representative from each of the 3 factions right there.!<",
            "Got home from appointment, decided to do Apocalyptic Shadow while cooling off from walking so much and- the Elegy looks so good?? \n\nkicking hoyos doors down to make her playable she is GORGEOUS and i NEED her\n\n/edit: talking to her and she speaks so cryptically i love her",
            "I think Cocolia is the most I've ever disliked an enemy they've designed across both Genshin and HSR.",
            "Free my son Stephen Lloyd from the basement!!!! I have his rubber duckies waiting !!!",
            "2.3 story spoilers: >!a little disappointed with Sunday's outcome. Zero answers were given, short cutscene and lc (could at least put it in the game as cutscene, considering how many people read lc lore). After that conversation with Jade and the lack of interference from the SH i just want him to give them all a middle finger and go his own separate way.!<",
            "Ruan Mei is completely stupid. Like holy cow. I never felt so powerful before. She is insane and I am part of the cult.",
            "2.3 spoiler a bit rant\n\n>!the only things I dislike about Jade is her lipstick, like who wears those purple tones when you have such bright skin? 💀 At least go with purple red or something like plum? A little darker 💀💀it was bothering me all story long because she has a lot of close up and all i can see is her lipstick!!! It look cool in splash art but honestly 💀!< \n\n>!2.3 epilogue feel like they're gonna go higher and deliver a peak af epilogue, then suddenly the engine is out of oil, gas is out so they just slowly descending 💀 it was beautiful cutscenes, funny chat room and heartwarming tributes, buuuuuuut.... Underwhelming!< \n\n>!i like the nod to hi3 when you say goodbye to Acheron though, neat! I didn't play Hi3 but I recognize it! Also when you ask Welt where he went after the order end he will also said he dream of reunited with someone he know, which I also think it's a nod to HI3 too!< \n\n>!Siobhan is so pretty! 😭!< \n\n>!k. by dr.ratio is my favorite line!< \n\n>!Argenti and Boothill is such a pair of dorks!< \n\n>!I want Sparkle, Robin and Gallagher side quests now to flesh out their mission, motivation and background....!<",
            "Story spoilers\n\n>!Holy shit I can't remember the last time I cry-laughed like I did from the absolute comedic timing of Ratio no-selling the bomb threat with \"k\" then immediately leaving the group chat. This man is my spirit animal istg lmfao!<",
            "2.3 (idk if a character's presence in the story counts as a spoiler but marking it to be safe)\n\n>!Is it just me being a simp or was Sunday's en voice extra hot this patch... like you can feel the quiet anger and holy shit i've always known his va is goated but something new awoke in me today!<\n\n>!Really want his combat voicelines to be similar, I can't believe the managed to make the :3 guy sound intimidating!<",
            "apocalyptic shadow is easily harder in it's debut form than PF was. I went in expecting it to be trivial with DoTcheron and Firefly, but i only barely cleared it. The npc looks nice and the presentation is good, but i don't think i'm sold on this mode. Having to play through the lower levels to get to the highest one was kind of tedious since it's effectively repeating the same bosses again. Buffs also seem to be on track to become constrictive like they did with PF.\n\nI appreciate the fact that you can selectively redo one node of it though. I choked on Coco half with Gallagher/Black swan/Kafka/Acheron yet i could still do the second half then retry the first.",
            "I can already tell that Aventurine boss in Apocalyptic Shadow is going to be the absolute most annoying thing on earth",
            "Who thought that putting those jumping advertisements in front of the Divergent Universe entrance was a good idea???\n\n##DISORDERLY NOISE!",
            "If Star Rail was allowed (1) F-bomb which character would you give it to?\n\nPersonally, I think it would be extremely funny to give it to March.",
            "Played AS. I like the concept, but right now it's way too overtuned. 60% elemental res against any non-weak element, transfering weakness to mobs, so you cant touch the boss's bar, which is also incredibly long. And they basically take no damage before being broken. If anything, this mode heavily favors a mix of both ST and AoE to deal with the mobs and then bosses. And even with that, the point requirements are too high.",
            "Mods i see you sneaking that >!sunday!< into the subreddit description \n\n>!I'm proud!<",
            "Just noticed Jiaoqiu and Ratio’s techniques are both field types, so you can’t use both 🫠",
            "JQ opening his eyes when he's angry or surprised 🥹🥹🥹🥹 ueueue",
            "2.3 \n\n>!dr ratio being a masisve introvert was my favourite part of the quest!<\n\n>!> is told that there are 1000 fake bombs and one real one about to detonate on the ship!<\n\n>!> responds with “k” and immediately leaves the group chat after!<\n\n>!> proceeds to help find them with no further assistance!<\n\n>!> leaves without elaborating further (the last cutscene lmao)!<",
            "With both Yunli and Jiaoqiu punishing enemy actions I was wondering what exotic mechanic they were going to use to incentivize them, and it turns out the answer was just Industrial Strength Cocolia.",
            "2.3 final cutscene spoilers\n\n>!I was rewatching the [firework cutscene](https://www.youtube.com/watch?v=3n4QxywUuNQ) and why did I finally notice Boothill pulling his gun out on argenti while Ratio leaving before shit went down lmfaooo😭😭me and the boys when i'm a sore loser at pool!<",
            "2.3 story spoilers\n\n\n>![New reaction image just dropped](https://imgur.com/a/rJ2TKzY)!<",
            "I love it when cocolia and her ice bitches act multiple times (not sarcastic) because it allowed Aventurine to refresh shield 3 times in a row. \n\nDelicious aoe for the gamble king.",
            "2.3 side quest spoiler\n\n>!Topaz and Aventurine fighting right at the front desk was hilarious 😆 And Jade calling them kids makes it look like they're on a family outing pleaseeee. I'm really looking forward to more stonehearts if this is how these three interact on a regular basis!<",
            "OT Genshin:\n\n>!Check on your Kaveh fans in these trying times 🕯️!<",
            "turn out AS is actually leaderboard for HSR TC whales to show off, bilibili players are racing for the score ceiling down to single digit (7973 to 7974 in six hours)",
            "2.3 spoilers, positive impressions >!I just wanted to say I love the Firefly and Silver Wolf dynamic a lot. That Silver Wolf arranged the whole third death thing with Sparkle to ensure the safest outcome she could for Firefly just warmed my heart even more than the cute Firefly/MC moment (princess carry rescue was adorable, Firefly is HSR Xiao real). Whether it's as ships or purely platonic I love the Stellaron Hunters family so much and it's why I am firmly in the SH Firefly forever camp.!<\n\n>!Also the prospect of Black Swan being around for the next world is intriguing; I don't think it's going to happen but I kind of do have a soft spot for the idea of Boothill hanging around the AE for a while though as a callback to Tiernan being the AE's gunslinger guard and going full circle from Tiernan traveling with the Galaxy Rangers to a Galaxy Ranger traveling with the Express. Hope someone writes a fanfic if it ends up not being a canon thing.!<\n\n>!The Sunday and Jade scene has me worried about Robin though; what did she give Jade that was enough to get her to intervene for Sunday? I really hope it was some vital information that clinched the negotiations and not giving up something more personal, like Robin's ability to ever see Sunday again or even worse, her memories of him as her sibling. 😰!<\n\nEdit: >!One more thing is I love Firefly watching Trailblazer engaging in that unhinged RPG MC behavior. I love our weird trash panda gremlin Stelle/Caelus.!<",
            "Did Apocalypse Shadow and why the hell is it so creepy???? The puppet looks super cool and eerie and I love that but she's also so spooky. And has anyone heard the sounds in the background?? There's like weird thunder and wails and crows? It's so so creepy! I love it but also what the hell is up with that? Is the Finality going to be some sort of super weird and creepy entity?",
            "AS quest spoiler\n\n\n>!In love with Elegy's design. Everything about it is so beautiful! The floral motifs, the wide boning giving the skirt structure, the clockwork trims and the ballet shoes!!! You could say her whole look is... en pointe! I really hope they bring some of this creative energy to the playable charcters' designs!<",
            "workshopping the best way to explain hsr to my “level 4363 in candy crush as a f2p” mother so that i can unleash her on the origami bird event next time i see her",
            "a relatively new player on my friends list with a Firefly profile picture has been borrowing my E1 Vonwacq RM like their life depended on it lately and after checking their profile, maybe it does. they have FF and Boothill and Robin but seemingly no RM. I am praying for their grandma so she can break out of the hospital",
            "2.3 spoilers\n\n>!Me using Topaz for the first time: why is my pig in the night pool?!<\n\n\n>!*five minutes later*!<\n\n\n>!Numby…He's following me? He’s so cute!!!! That’s…a treasure chest!! Good boy omgggggg I love youuuu!<",
            "Got jumpscared when i got a lightcone from the weekly boss, shit's so rare i forgot that's even a thing.",
            "learned the hard way that DU raising your unleveled characters to max doesn’t carry over when you use the save file to farm relics",
            "Riddle me this Batman, if AS is about breaking, THEN DO I HAVE TO _KILL_ THE COCOLOA SUMMON TO GET THE WEAKNESSES BACK TO HER???",
            "(divergent universe) (soul-crushing)\n >!I was playing with my Jingliu and Bronya for a while and I was thinking oh it's so weird that my Bronya keeps going before Jingliu! I guess I really need to get her off 4-piece hackerspace--that set bonus effect sure messes up my action order!!<\n\n\n>!Wrong. After several unobservant rounds where I misattributed the absolute fucking mess of my turn orders to my own skill issue, I FINALLY remembered that mapping is a thing that exists, and HOLY HELL DOES IT EXIST ON MY +12 RELICS BRONYA. MY SPEED-TUNING! MY PERFECT SPEED-TUNING! DR. RATIO WHEN I GET MY HANDS ON YOU I SWEAR I'LL!<",
            "2.3 \n\n\n>!aventurine giving us a bunch of gifts <<3 thanks pookie!<",
            "So the Astral Express may or may not have glitched out of the 2.2 fight assist, because it's now stuck along the [full length of the Theatre](https://postimg.cc/ykVk37Mv), and the [sight](https://postimg.cc/bSPdTPsY) is absolutely comical.",
            "The real reason Ratio has those muscles is clearly to win the annual Intelligentsia Guild Academic Conference fistfight with whoever is beefing with him and his research that year.",
            "So I just got back from a small family vacation and went to get the paper from the open newspaper slot under the mailbox. It would have been delivered on Sunday, so it’d only been there for five days. And yet, when I pulled it out of the box, guess what was attached to it?\n\nIf you guessed >!an entire hornet’s nest!<, you’re right!! 💀\n\n>!I immediately backed off, got promptly stung in the ankle, freaked out, dropped mail all over the driveway, picked the mail up off the driveway, and then proceeded to sprint inside and call my parents while sobbing on the floor because holy mother of Tayzzyronth, that little slut *hurt*. *Thankfully*, I managed to avoid being stung by the rest of the remnants of the Propagation, because apparently they like to swarm you?? And hornets can sting more than once! I’ve never been stung by a hornet/bee/wasp/etc. before, and Jesus, I was *not* expecting that level of pain. Just a stinging/throbbing that was almost debilitating to walk and some gnarly swelling up my ankle that’s thankfully subsided now. But the spot is still sore. How tf did those little demons build their stupid hell-nest in like five days??? Unless it was already in there and the paper got shoved into it?? But how long was it there if I never encountered it until tonight?? I’m *baffled*.!<\n\n>!One thing’s for sure: I’ll have my revenge on them in due time, and rest assured, it will be a bloodbath.!<",
            "The new auto-battle curio is a new favorite. Not because it's super duper strong, but because \"The leader is thinking. You do not have the right to activate your self-consciousness.\" when you try to deactivate auto-battle goes hard... and because it's super funny seeing your characters flail around because auto-battle is garbage and you can't do anything about it.",
            "So I completed DU max difficulty and I felt like sharing my thoughts. Yapping warning.\n\nThings I have liked so far:\n\n- Great variety of builds\n- New and refined approaches to path identities (destruction being the biggest winner here)\n- Rebalancing of some absurd blessings which made previous SUs too easy \n- Reaching high blessings count is now harder to accomplish and you have to be more cautious with your picks.\n- Even my strongest builds would not steamroll bosses. Depending where you come from this may be a negative but I liked the fact I still had to be strategic no matter my build.\n- Biggest positive by far imo: auto building the characters. I could play Firefly day 1 and it is an excellent feature.\n\nThings I disliked:\n\n- A lot of builds felt weak/very hard to get going. I specifically felt that break builds were heavily favored *BUT* it is possible I was just not building the other ones correctly. Some of you may have had more success with non break builds than I did.\n- Lack of reroll makes RNG more frustrating. If you do not get the blessings you are looking for in the start there is an argument to be made that starting over is the way to go. (Yes, you can reroll with fragments before bosses but the cost increases rapidly/workbench)\n- The first 5* equation being given from the first boss instead of the start. I get that a 4* is easier to complete by the time you reach the first boss but the 5* equations are the make or break deal. Lack of rerolls also aggravate this issue.\n- RNG will screw you over way more. I had 700 cosmic fragments, needed one preservation blessing and I got none after all possible rerolls at the workbench. Getting the build to work is essentially harder and more RNG based than before.\n- Final boss encounter RNG may cost you the run just 'cause your team gets countered/is not prepared for that type of fight.\n\nOverall fun stuff. I did end up playing Gold and Gear for a long time and I do believe I will stick with this version of SU for a while too. And sorry for the wall of text.",
            "birditas ratio. abirdturine. birdhill. arbirdti. birdle.",
            "Poor Robin. She told me she was new to games and I accidentally one shot her in Candy Crush. She is never picking up a controller again.",
            "I want an origami bird :(\n\nThey’re so silly…I want to pat them…",
            "ot art\n\n>!spent like 5 hours drawing today and my gf said i should try drawing some of my hoyo faves from memory so i did... and i'm so happy with how my aventurine and xiao turned out!! i don't rly use any other social media other than reddit so i wanted to [put them here](https://i.imgur.com/ld7jEru.png) just so i could say i showed it to someone other than my gf... yippee!<",
            "*whispers* ruan mei is beautiful.",
            "ok… the more I think about it… everything Yunli can clear Clara can probably clear… everything Clara cannot clear (dot robot etc) Yunli probably also cannot clear…\n\nSo why exactly am I planning to spend ~300 pulls on Clara upgrade… I could get AVENTURINE EIDOLONS…\n\nUff…",
            "2.3 story spoilers.\n\n>!Jesus christ that leak was the most maliciously true thing ever written. The alliance of the SHs with Diamond is brought up in passing and framed as purely negative and as a deal with the devil. Stellaron hunter sunday isnt just not brought up, its not even alluded to. What the fuck was that leaker on about. Elio didnt even hire sparkle.!<",
            "2.3 Spoilers / Beginning of the Quest\n\n>!I love that the 2.0 Penacony quest started with the Sam armor towering over Silver Wolf and now the 2.3 Penacony quest is starting off with Firefly *still* towering over her. I always forget how tiny Smol Wolf is 🥺💜!<",
            "2.3 story \n\n>!Topaz: \"Oh! You mean his cornerstone. Sorry, but  mine is not quite so... visual.\"!<\n\n>!Fell down on my knees at Spacemart.!<",
            "2.3 story spoilers\n\n\n>!Aventurine and Topaz playfully bickering was cute haha. Nice to see they're close with each other!<",
            "I truly just love Argenti… that is all.",
            "Hoyo is evil for repeatedly exposing me to Screwllum's gentleman rizz but not letting me pull for him. Release him!!!",
            "2.3 story spoiler + hi3 story spoiler >!somewhat negative ig? But I'm more in for the memes!<\n\n>![this post ](https://www.reddit.com/r/houkai3rd/s/P2vC7LBOAA) is actually quite funny, considering how \"hyped up\" he was when it was revealed that he writes on penacony + how controversial hi3 ending was and they just did it again!<",
            "2.3 argenti spoilers >!so am i the only one very interested in learning more about the beasts of the beauty? the way i interpret it is that some knights of beauty will lose sight of true beauty and search to achieve external beauty in unethical and selfish ways. i do apologize if we know more about them and i didn't paid attention >.<!<",
            "(2.3 post-story exploration) >!Getting Cocona to perform at the bar on the ship almost made me tear up 🥹 I hope her singing career takes off...!<",
            "(2.3) >!Can’t decide if my favorite Stelle moment this patch was watching her climb up on the bow of the ship for the origami birds while March was trying to get her to come down, or if it was Himeko telling Stelle they now own 5% of the Hotel’s shares and Stelle immediately letting the power get to her head.!<",
            "[AHHHH FINALLY AVENTURINE BOSS THEME LFGGGGGGGG](https://x.com/honkaistarrail/status/1804002639983841433?s=46&t=ySDa0MHVnM75Cpg8SLeg8w)\n\n“Hell is preferable to Nihility” wow this song name goes so hard??????",
            "2.3 Story\n\n>!Just realized that with Misha + Gallagher dead/MIA and Sunday in jailed, Robin is...alone in Penacony. I wanted to run around and look for the playable characters to talk to, then I realized it's just Robin and I don't think she's even there!<",
            "Do you think the Xianzhou is adding something into the water that makes the kids swordsexual?",
            "2.3 spoilers \n\n  \n>!Oh god. Did robin give up her relationship with sunday so that he could be free? Jade said it herself, he's free to do whatever he wants now. Oh god. Is this what elio meant by eternal separation? !<",
            "I propose the shorthand “HM7” for Hunt March 7th.",
            "Jade musings - mild 2.3 spoilers\n\n\n>!Do I have a favorable opinion on Jade because she's a morally grey character with actual ambitions in life or do I like Jade because I always root for the underdogs? We'll never know...!<",
            "2.3 early story\n\n>!\"Nobody has pressed the buttons because Penacony's guests are all afraid of death\" Well considering how depressed people are in the side quests I don't believe that someone hasn't thought of pressing a button!<",
            "2.3 spoilers \n\n>!SUNDAYYYY. Ah he sounded depressed in that last scene. Now that 2.3 is done it's going to be a while till we see him or hear from him again. the wait will be long. I wonder how they're going to go about his story since it is very clearly still incomplete. Will be patiently waiting for the day he is drip marketed and saving up till then.!< \n\n>!fellow Sunday enthusiasts how do you guys feel about things-his potential story, changes in philosophy etc. I am so sorry I am so brainrotted about this man I need people to talk to!<",
            "[2.3] >!i was laughing first but now that i look at her more closely i have to agree with the megathread friend who said purple isn't jade's best lip color. it makes her look a bit sickly and kinda one-toned since blue and purple are all cool colors. i think she'd have a better time with a nice red, but i can't decide if it should be a warmer, orangey red or a cooler red!<",
            "2.3 spoiler >!there is a readable that talks about how Robin has lost some weight and looks exhausted. Wish we could spend some time with her during epilogue and cheer her up at least a little.!<",
            "The Stonehearts definitely have some kind of workplace comedy going on over at Pier Point. Y'all see the vision, right?",
            "Divergent Universe spoilers\n\n>!I really like the new UI but I really don’t find the main gameplay loop particularly engaging and I feel bad. I hate going through multiple domains and not getting any blessings for the equations they give me😭I don’t hate it or anything but I hope they give it some extra polish as time goes on but if it doesn’t then I need Screwllum and Ratio to never cook again!<",
            "Hello. Here's a list of how I think the Aeons would be like if they worked in a coffee shop or similar business (this comment is inspired by the other comment about whether the character would be admitted into a lab; for reference I think all the Aeons would definitely be rejected except for Ena) \n\n\nNanook - wouldn't even get hired in the first place. Silent, deadly, would definitely kill someone over the counter. Destroying the workplace is also frowned upon and definitely something they'd do. All in all, a terrible employee, they'd just destroy everything \n\n\nNous - would be awful at customer service. Theoretically would have the knowledge to make the world's most delectable cup of coffee, but their lack of hands stops him from actually doing so. Their overbearing thousand thoughts a minute talking style would also overwhelm the customer and the cashier left unregistered. However, if there's anyone who can do the financial math and expenses and taxes, it would be Nous. Their lack of supervision of the Genius Society also implies they'd be a mostly absent manager \n\n\nAkivili - has probably done community service in the past, if we judge the Trailblazer's and current AE crew's past experiences. Theoretically the best Aeon to work anywhere. Would be a great employee, if only because they actually work and are capable of talking to people. \n\n\nAha - the novelty of an Aeon being a barista may stop them from causing chaos in the workplace, at least initially. Decent employee if they don't get people's orders wrong on purpose or mess everything up but we know that's not happening. Can shape shift, so has hands and can talk to customers\n\n\nXipe - Probably one of the best employees. Would definitely not cause trouble, and would simply do their job. Has hands. Can talk with people. Understands the importance of teamwork. All in all, a great employee\n\n\nEna - Micromanaging manager.\n\n\nTazzyzzyronth - who hired them? For similar reasons to Nanook, they'd be fired, but also because he's propagating in the coffee too\n\n\nYaoshi - would likely do their job, but may also grant customers immortality on a whim and violate some sort of food standard protocols\n\n\nLan - Would have to be forcibly removed from the premises for trying to kill a fellow employee\n\n\nQlipoth - most likely the most genuinely hardworking employee ever. Does their job without complaint. Has hands so can definitely make things. If they can build a wall for thousands of years, they can make coffee nonstop. However would most likely try to return to their wall\n\n\nOuroboros - no.\n\n\nHooH - would try to change the orders so everything is perfectly in balance. Double the productivity for double the Aeon (and its two selves) \n\n\nFuli - would just stand there and record memories. Nonperforming employee.\n\n\nIdrila - ??? Employee missing ",
            "Y'all I LOVE the Creed Exequy theme music from Apocalyptic Shadow 😍\n\nSomeone on Youtube mentioned how you can't tell if the music is playing in reverse or forwards. And that if you play it in reverse it sounds exactly the same as playing it forwards. So fitting for the followers of Terminus.\n\nAlso the soundtrack in general, accompanied with Elegy who only moves when you look away from her like a weeping angel, is all quite creepy. The whole vibe is eerie\n\nI'm loving the taste of Finality music and vibes they're giving us",
            "2.3 discussion\n\nso what would stop the IPC from just >!buying the entire stock or at least the majority if Oti really went and opened up Penacony's shares for everybody in the cosmos?!<",
            "Minor 2.3 spoiler \n\n>!Dr. Ratio: k!<\n\n>!I actually fucking can't bro i litteraly have tears in my eyes ahahahah this is so fucking hilarious i love this game so so much fucking k ahahahahha!<\n\n>!And the groupchat is named 11111 ahahahaha also why is aventurine there i thought he's gonna type something like \"yall gonna die lmao\" but him placing bets is soooo funny tooo!<",
            "Maybe it's just my innate love for cruise asthetics, but the Feldspar has been a complete joy to explore tbh. >!Especially after the quest, when you become the captain, and can decorate the ship, name it, hang up SU/DU portraits, etc... it's nice to have something to call your own in this game. Now where's my room on the express hoyo!<",
            "(2.5 AS) \n\n\n>!I wonder what nightmare-inducing mechanic Phantylia will have that will undoubtedly haunt my waking days!< ",
            "HERE IS WHERE WE HOLD OUR MOZE FIVE STAR PRAYER CIRCLE: \n\nIn the replies thou must sacrificeth thoust crow emojis in an effort for him to be a five star 🐦‍⬛",
            "No fear\n\n\"Yunli's LC might be reworked to be worse on Clara, like how Iron Calvary was reworked to be worse on Boothill.\"\n\nOne fear",
            " \nman i love boothill and all his goofiness but i hate the fact that every time im writing a serious or romantic scene i have to make him go \"holy forkeroni\" or something to keep him in character\n\nexample below (warning: peak fiction)\n\n>!\"boothill, i am in love with you. you make me happy beyond words can describe. let us navigate this vast universe together and journey amongst the stars, painting it with beauty.\"!<\n\n>!\"well fork me sideways and call me a biscuit, you gon' make me cry you rootin tootin muddlefudger!\"!<",
            "\"I love Apocalyptic Shadow.\"\n\n\nTheir teams: DoTcheron and Super Break Firefly\n\n\n\"This mode is hard as hell.\"\n\n\n\nTheir teams: Hypercarry Serval, Super Break Guinaifen.\n\n\nIt depends on your account folks. I find the mode to be pretty okay. But I know damn well it's gonna get even harder from here.",
            "Jiaoqiu looking like the love child between Taigong Wang and Vitch is funny ngl",
            "[my brand](https://x.com/hh760844914253/status/1803097324442517849) 😍",
            "March’s ult voice line is gonna be something like “Come on, March!  Think back to your training!” with “training” timed to coincide with the bubble tea.",
            "Gonna go sleep now before I start mindlessly pulling out of sheer fucking boredom, me from 10 years ago would be in shambles if he saw me like this at 4 am.\n\nWell, best of luck to everyone pulling, may you get what you are aiming for in an acceptable amount of pulls 👍",
            "The war…",
            ">!it took march saying it out loud for me to realise it's dreamjolt HOSTELRY not HOLSTERY. That makes....a lot more sense!<",
            "My biggest gripe about the new mode is just how often the bosses go like jfc do I have to watch a movie of Cocolia going like 10x in a row? Who thinks of this shit💀💀💀",
            "EN Argenti VA: **Disappeared among the sea of butterflies**",
            "elegy is my favorite design in the whole game but she's not even playable MIHOYO WHY DO YOU DO THIS TO ME",
            "I can't believe how beautiful [this is](https://www.reddit.com/user/me)",
            "2.3 ᗜˬᗜ\n\n>!I must own a sparkle fumo!<",
            "Honestly im glad cocolia got gepard this time and not bronya",
            "Shoutout to Xueyi, finally got her E6 with the free copy and sis clears AS crazy good.\n\nGood for Firefly and Boothill skippers like me, she’s really fun to play too !",
            "i have yet to play the game but i have basically most of the epilogue spoiled lol",
            "i hope ppl looking at my AS clear go \"you can clear it with Argenti and Jing Yuan???\" (yes, yes you can)",
            "Post 2.3 text spoilers\n\n\n>!Micah's text was so somber and I was feeling all down until he said bye and gave us 10k credits... Aventurine gave us 200k...!<",
            "i just realized its only pela and welt who wear glasses. unacceptable. i hereby promise to pull for the next character who wears glasses",
            "Me, watching Jiaoqiu in the showcase: Jiaoqiu ur so beautiful\n\nWatching him do a 141k ult: Jiaoqiu ur so terrifying\n\nHe does have a decent amount of crit in the showcase though...in additional to a lot of EHR because Tutorial, and being paired with Pela on Pearls meant he was being batteried very well. Also that kind of substat fine-tuning takes ages. I'm happy to see him with Acheron but I really want to see him with, say, Ratio teams where you're likely to run a Harmony unit in the third slot.",
            "2.3 story spoilers\n\n>!if you go to the train seemingly after the story, there's a note left by gallagher otw to the jukebox 😭😭!<",
            "Me : .I'm gonna see how Jiaoqiu's kit shapes up for DoT before I try for Ruan Mei E1\n\nMe : /waiting... Waiting... Please stand by...\n\nMe, suddenly realizing how fucking stupid it is to potentially prioritize E2 on a character I do like but don't know much about, will probably be able to E0 still as long as I don't chase a loss on this pull, over spoiling my second favorite character in the game and the character that winds up in literally all my teams :\n\n\n....anyways, mission failed successfully lads. If Ruan Mei has no fans, that means I'm dead.",
            "[Man listening to the White Night MV again after it’s all over makes me so emotional](https://youtu.be/U7W8QR9fsFw?si=0diAqUsrK1yxoh1a) 😭😭😭 wraaaah I love Penacony \n\nI was already greatly enjoying the game before it happened but it really took my enjoyment to new levels",
            "I completed the short 2.3 story and I have decided to go all in on E1 Jade. I really like how unapologetic she is about what she does. She even has dark humor like Sparkle. I have E0S1 Firefly already and I am skipping 2.4 so I am ready to give everything for the Amber Lord. ",
            "I play AS, AV is important, I use DDD.\n\nI play MoC, Tingyun instantly procs DDD. I don't have a cone for Sparkle, she uses another DDD.\n\nI play PF, DDD let's me cheese enough to 40k.\n\nI play DU, enemies are extremely fast, but not fast enough to keep up with my DDD Ruan Mei and DDD Hatblazer.\n\nI love DDD, would you like to Dance Dance Dance?",
            "Penacony story review as a HI3 player, no spoilers, blocked out some of it because it’s so long haha, yapped too much\n\nTLDR; It’s good, but could be better. 7.5/10\n\nThis is the first major story arc written by Shaoji, and as his writing style is very distinct, you can feel his influence and voice throughout. This is a compliment in a sense, as the other stories (Belobog, Luofu), are more “generic” and standard for video-game storytelling. However, this isn’t his best work, and the story overall feels heavily self-indulgent at times. Compared to the heights of Elysium Everlasting, Penacony has great set-up, but stumbles at times and doesn’t quite stick the landing when it comes to pay-off. So many plot points that are built up to be huge get handwaved, multiple characters are underutilized and unexplored, and some characters need to stfu and get to the point (you, Black Swan).\n\n>!When I thought about why Firefly and Robin don’t work as characters for me, it’s because I realized that they don’t really have personalities besides “nice” and “want to do good”. They don’t really have any kind of meaningful character development. This is less of an issue for Robin, who’s really a side character (that’s a different problem), but for Firefly, as one of the main characters we partner up with for the planet (a la Seele/Bronya), it doesn’t really work for me because the events of the story don’t leave a tangible impact on her. She wants to keep on living, but she wanted that before Penacony. Nothing could change and she’d still be the same. Her backstory also isn’t explored in game the same way as Aventurine’s, so I can’t tell you much about what led up to this. It’s explained in the trailers sure, but I shouldn’t need to do homework to like a character. Why does she even like the TB? Did they know each other during TB’s time with the Hunters? Idk, they never tell you. I also wanted to see Firefly act more like edgy SAM while outside of the suit (let women commit mass murder), why is no one treating her like the dangerous (badass) Stellaron Hunter she is? I’m upset because I like what she had potential to be, and they kinda wasted it. Ironically, I think Acheron’s story was handled ok with the drip feeding of her story and motivations, but if you aren’t a HI3 fan I feel it’s likely you’d get kinda lost at times with the fan service.!<\n\n>!The 2 new main male characters, Aventurine and Sunday, are handled pretty well in comparison. Shaoji has a pretty good track record with male characters, and throughout the story, we are able to thoroughly understand their backgrounds and motivations, and by the end of their story arcs, reach a solid conclusion driven directly by the story’s events, while also leaving room for future developments (Sunday…). This is the treatment Firefly deserved in-game, but likely didn’t get due to how lengthy the story is already. That brings me to the pacing.!<\n\nWhat Shaoji really needs is a strong editor who’s willing to put their foot down and say, hey, maybe this is too long. The gameplay team need to integrate the story better. Everything could be so much more concise and there are entire sections that could have been emails. Do I really need to walk through 3!! maps for Sunday to finish his preaching? Do I really need to sit through a philosophy lesson for Acheron to answer my questions? Do I REALLY NEED to listen to Black Swan wax poetry about the universe for her to tell me what fucking happened? A few times is fine. But please. I don’t need everything to be so flowery and verbose, it reduces the impact of the sections that use it well. And I play in CN, so no, it’s not just the translation, Shaoji just loves to write like that. One of the things that Sumeru does so well in Genshin is that it doesn’t really waste that much time- overall, most of the plot points/gameplay build towards the story’s ending. So much time is wasted in Penacony. So much time that could be spent on developing the side characters is spent running around the map doing puzzles to reach the next sentence in the essay. Still don’t get me wrong- this is the best story quest we’ve gotten so far. It *is* really good, and I will continue to praise it. It just could be better.",
            "discussing characters’ likelihood of getting kicked out of a lab  \n\nruan mei: **immediate ban**. not only is she trying to revive the swarm (who is on her institutional review board this feels wildly unethical) and should be kept away from insectaries she has never heard of ppe in her life. why does this woman not work in a biosafety cabinet. where are her properly fitted nitrile gloves. for the love of god her hair is going to contaminate her samples. why are her legs and arms exposed. who dressed this woman for doing science. \n\ndan heng (normal): **allowed**. honestly half the scientists i know dress like him and his coat is kinda like a lab coat. that one tassel might get him in trouble but he can just rip it off.\n\ndan heng (stabbed): **watch where you’re putting that tail**. i fear his waterworks would wreak havoc on some very expensive electronics. also his top half is slutty and vulnerable. tail could knock samples off the benches or get trapped in a fume hood. banned. \n\nfirefly: **allowed**. she’s got a headband to keep her hair out of her face, her outfit is professional, probably the worst parts are the sleeves and shoes. \n\nsam: **banned**. ceilings too low.",
            "My cringe contribution for the inevitable.\n\nMegathread loss syndrome: DMCAblaze",
            "Tip\n\nThe game server is currently undergoing maintenance until 2024/06/18 23:00(UTC-5). See the official notice for details.\n\n❌Confirm ✅Go to the official community\n\n>!Let me innnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn!<",
            "This is 🍷Gallagher👤3.500 HP💪250% Break Effect ⛓️‍💥160 SPD🪽25% Def Ignore from Iron Cavalrussy 💦 100% Effect Res🚫 100% Action Advance 👟 Heals like Luocha ♰ Insane AOE Toughness Damage🐯 70.000 Super Break ☝Multiplication is BIS ✕ can solo sustain 🧙‍♂️Buffs Break Damage 💥 Prints SP🖨️",
            "Extreme Ratio brainrot:\n\nSo two weeks ago now the word of the day was \"meliorism\" (the belief that the world tends to improve and that humans can aid its betterment) and ever since then I haven't been able to get it out of my head. Which is so much for some random word but I'm actually so obsessed with any sort of theming about humanity's ability to grow and change for the better (don't even get me started on SMT neutral routes or Frieren) and hearing that there was a name for that as an actual philosophical guideline made me crazy.\n\nAnd of course I connected that to Ratio because!! That's like his whole thing!! And now I opened up the DU starter quest and he's back in my head again (ok let's be so fr he's been pretty much all I've been thinking about since finals ended). Pretty sure I screenshotted every single line Screwllum mentioned him in because AGHGHGHHGH.\n\nI can't believe this. They made an entire character about my favorite theme and I fell in the trap just like that. When he was revealed I called him ugly and made fun of his name, but look at me now. They put him with a hot blond man and then I liked him because yaoi and then he took over and became my favorite character. How does this KEEP HAPPENING TO ME",
            "Even more thoughts on 2.3 (mostly on one of the beginning scenes, positive)\n\n>!The Firefly and Silver Wolf scene have been living rent free in my head for hours now,,, I do think it's interesting that the devs made it a point to tell us about the Stellaron Hunter interactions. We had Blade the Uber driver scene in 2.2, seeing Silver Wolf want to \"stir up excitement\" with Firefly in Penacony, Silver Wolf remarking on Firefly's habits, Kafka lending out her credit card, picking out fashion for Kafka, Blade being a worrywart, Firefly talking about purchasing a second oak cake roll to give to Silver Wolf, Kafka, or Blade. It's all everyday mundane things you would see in a family with a little crime on the side as a treat,,,!<\n\n>!But not once did they mention *Elio* in these kinds of activities (no offerings of oak cake roll for the cat, the ultimate crime :<). The only time he is brought up in this interaction is when they are talking about following his script. It just further reinforces the feeling that he is detached from the group, that he is only there to create and guide the script. He sounds like such an interesting character (you have to be to be able to collect such a wildly different range of people into a criminal organization) and it makes me so incredibly excited for when we will be able to finally meet him.!<",
            "2.3 Story Spoilers\n\n>!I really wasn't expecting to see Siobhan again, but I was so glad we got to properly say good-bye to her. She was a genuine delight for me in the game (even if the story parts of her event dragged a bit for me) and I adore her VA and design so much. She just seems like someone I'd love to hang out with. I love that energy. !<\n\n>!And then we have the eccentric as hell Dr. Ratio that responds with \"k\" to a bomb threat, and is later mentioned to be assisting as the \"plaster head guy\" according to (I think) Boothill. He just said \"fine we'll entertain the gremlin, but here's my serious face.\"!<",
            "I graphed all the global stats from Star Rail Station and came to some interesting conclusions.\n\n* The three most pulled on banners were Acheron, Seele, and Ruan Mei. The three least pulled were Ratio, Boothill, and Argenti. Robin trails closely behind Argenti, making her by far the least pulled support. :(\n\n* Although Boothill's banner stats look extremely low, they're likely underreported. I noticed that SRS's stats on recent banners keep going up a decent amount after the banners end, probably because people update their stats infrequently. However, it's still likely the lowest pulled banner not counting Ratio's. (They actually kept going up while I was writing this, which made me very confused when I went to double check my work. This also probably means the data is significantly biased toward earlier banners in general.)\n\n* Because of this bias, it's hard to know how well Firefly's banner's doing. Judging by trends of how previous banner stats updated over time, she doesn't seem to have surpassed Acheron - but we need people to upload their stats to be sure.\n\n* Star Rail Station also lists the amount of unique users who pulled, so you can see if people vertically invested in a banner. Acheron pullers spent a whopping 113 pulls on average, far and away the most for any character. For reference, the average is 54 pulls. Aside from Seele, the release character, people also invested heavily in Black Swan and Kafka at 68 pulls. Ratio pullers only spent 19 pulls on average, which surprised me as I thought anyone willing to pull on that awful banner would be a mega simp gunning for E6, considering we already got E0 for free.\n\n* User distribution is much flatter, meaning a lot of people pull at least a little bit on many different banners. Even Acheron isn't much higher here than the competition. The most universally pulled character is Ruan Mei, beating out even Acheron and Jingliu.\n\n* Rerun banners are much less lucrative, often only getting around 1/5 the pulls that the new character does. The three most pulled on reruns were Silver Wolf, Imbibitor Lunae, and Kafka. It's too early to say how Ruan Mei's rerun will fare, but it's shaping up to be very good.\n\n* You know how HSR's 50/50 seems to be biased in our favor? The data suggest that the 5-star rate is also better than it should be. The consolidated chance of a 5-star including pity should be 1.6%, but many of the banners reach as high as 1.7% or 1.8%, and none dip below 1.6%. The rates average out to 1.68%, which comes out to an average of 3 pulls saved per 5-star. Could this be a self-reporting bias? Maybe, but paimon.moe doesn't look like it has the same bias, so this is likely HSR-specific (or possibly an issue with SRS's data somehow).\n\n[Here's the sheet if you want to see!](https://docs.google.com/spreadsheets/d/e/2PACX-1vRiVQeEFhvTXz82mgbdjQpw98q9STKOagSbFhaJ2Jk2s4hsXjWF5XuNKWiMIeMQlL7KaSGufOYxbO_6/pubhtml?gid=0&single=true)",
            "AS is really doing its job in exposing the people who didn't bother matching weaknesses since Day 1 lol\n\ntoo bad for the new players though, this is anything but accessible",
            "Sometimes the main sub can cook. 2.2>!I just saw a very compelling theory about how Gallagher is a dog. Like a literal dog who got Enigmata powers. It makes *way* too much sense, especially when you consider that Mikhail is described as being accompanied by a dog by the Dreamflux Reef bartender.!<",
            "Just sleepy me rambling about Acheron.\n\nAcheron's flavor of \"wholesome\" is just so refreshing to see. I'm not really the type of person that likes the type of characters that just radiates positivity in media since it comes off as really wishy-washy but the way Acheron goes about appreciating and respecting life, death and all the stuff in-between that ultimately makes you, you is genuinely heart warming.\n\nTiniest of 2.3 spoilers about her scene:\n\n>!Even the way she goes against cliches by pretty much directly stating \"It's okay to be railroaded by fate\" when practically every other anime character would say the opposite in the exact same circumstance just feels so... real. That one line really stood out to me and has been stuck in my head.!<\n\nEven if she sometimes speaks in riddles I'd go to the ends of the galaxy to try to understand her. I love her so dang much.",
            "i cant stop looking at jiaoqiu. i am not asking for help",
            "new megathread means new moze truthers rise up!! he will surely just randomly show up any day now i swear",
            "2.3 spoilers//\n\n>!Jade confirming that the Stellaron Hunters follow The Finality and me gasping like crazy and taking a screenshot of it (as if I didn't already know it was super fucking obvious from the beginning that they were following the Finality, I just need to be dramatic asf 😱)!<",
            "DU is lots of fun but I miss being able to refresh blessings/curios. Don't even see that as an option in the skill tree, but maybe I just missed something...",
            "I keep thinking about how Lynx has an idle animation of her having grilled fish over a campfire while Jiaoqiu only gets to imagine cooking food and only gets to have a thought  bubble. 😭😭😭😭",
            "The only thing I actively disliked about Penacony:\n\n>!The White Night song doesn't exist in-game. I was expecting it to come up during the Epilogue. Does the CD for it exist? At least I want to play it onboard the train!<",
            "i loved the previous SU expansions but im really hating DU rn. im at threshold protocol 4 and struggling hard with dps (and sustain when i do have enough dps). maybe im just not familiar with what equations and blessings are good yet, and dont have too much of inspiration circuit unlocked, but i didnt struggle this hard with G&G high conundrum. it just feels so luck based and theres no extra buff from dice like in proper expansions to prop up my aventurines shields ",
            "I know it's probably been said a million times already but that MoC floor 12 *really* made me wish I had 2 Ruan Meis.",
            "[Sunday as an Arknights unit](https://twitter.com/cioccolato_kun/status/1803459115647377608?s=19)",
            "Okay, I think I cleared everything in 2.3 in regards to story & side content. Some thoughts (beware this'll be a long one & I might to do a separate comment for the new gameplay stuff):\n\n&nbsp;\n\nPenacony Epilogue: >!The epilogue was a neat palette cleanser from the previous heavier story driven parts with some good comedic moments (seeing TB's antics from a third party's PoV, Ratio dropping a \"k\" & leaving the groupchat was hilarious & the whole \"bomb\" segment with Sparkle lol!<\n\n>!The PoV segments of Firefly & Jade were okay (I dare say a tad bit too short for my taste just like with Robin), since it left me wanting for more. I did enjoy seeing Jade's MO in regards to negotiations (shout out to her JP VA for shifting her tone slightly, when she starts to negotiate with Oti alone, to show she means business & it was very noticeable, before Oti pointed out the obvious) & I loved Firefly casually chatting with Silver Wolf and getting more glimpses into the relationship between the SH.!<\n\n>!I'm not sure why they decided to this, but the transition from the firework scene with TB & Firefly to the AE going to Dreamflux Reflux to say goodbye to Acheron & Micah and paying their respects to Mikhail, Tiernan, Razalina & Gallagher, was extremely jarring. It feels like something was missing in between those two scenes. Nevertheless, this must have been my personal story highlight in this patch having all members of the Express in one spot & honouring their predecessors with March's unexpected philosophical question.!< \n\n>!Speaking of Acheron: I'm going to miss her. She and Robin were the characters who unexpectedly grew a lot on me during the Penacony arc and I hope we get to see her rather sooner than later, since the optional talk with her, did imply we'll meet her again.!< \n\n>!It's almost a given that we're going to return Penacony in a continuance quest at one point, considering the Nameless are share holders of Penacony with 5% & are on the board of directors.!<\n\n>!Amphoreus, a planet where not even Akivili set foot, sounds really exciting. It's obvious Black Swan suggested this next to stop, not because out of kindness of her heart, but because she hopes to collect some very unique memories from here. The wait will be a long one...!<\n\nIf I had to spontaneously rank my favourite story parts it would be: **1.** 2.1, **2.** 2.2., **3.** 2.3 & **4.** 2.0. Overall, I'd give the Penacony arc an eight out of ten points. Keep on cooking Shaoji.\n\n&nbsp;\n\nSide content & other stuff:\n\nDreamscape Pass: >!I didn't expect the narrator in the pass to be Razalina! I was so sure it was Elio, but in hindsight it makes sense considering in one of the pages if you select the option, the narrator remarks how TB is similar to Tiernan & they would've gotten along well with each other. The only people who knew Tiernan were Mikhail & Razalina and Acheron when she met him as a Sin Thirster. Guess at the end we've gotten to know her a little bit as well!<\n\nSidequest 1: >!\"Checking Out\" has to be my second favourite side quest in Penacony, since it feels like another small epilogue for the other characters. Topaz & Aventurine bickering like siblings, Jade radiating proud mom energy around the two, Argenti & Boothill becoming friends (I think I was able to hear faint happy screaming across the globe from the Guns N' Roses shippers lol), Robin going on a  journey outside of the spotlight & Qingque nearly getting forced to join a cult had me rolling. What also got a chuckle of me how the devs themselves were lampshading when will the AE crew will get another new member, lol.!<\n\nSidequest 2: >!Remember, how people here wished how nice it would be to have a room on the Express to decorate?. Welp, TB now has a whole ship just for themselves on Penacony, lol. I went with the Pom Pom design for the engine, but you can change it at anytime, you just need to talk to your First Mate. Also in regards to decoration, Screwy continues to be the best genius, since we can also use the paintings from occurences & SU story as decoration for the ship, you just need to progress DU a bit until you unlock the museum.!<\n\nThree other titbits, won't spoil them if you haven't discovered those since they're pretty neat, but I'll still put it behind spoilers:\n\n1. >!After you completed the story, return to the Parlor car. Right opposite of the table where the guest book is, you'll find a readable!<\n\n2. >!Remember the dude on the rooftop in Dreamflux Reef who said he is preparing something Hanu related in 2.2? Go visit him make sure you have two Golden Aideen Tokens in your inventory!<\n\n3. >!After you finished picking your First Mate for your ship, you'll get a package. That's all I'll say, lol!<\n\n&nbsp;\n\nThere's a bunch of other stuff in regards to story I haven't mentioned, but I think for now that's quite enough, lol.",
            "//Misha text messages, post Penacony quests AND Major Post Penacony spoilers\n\n\n>!I got Misha yesterday will burning some of my pulls and the 15 jades..came from Micah.. who informed us that the Memoria Flow in Dreamflux has stopped completely and while Gallagher and Mikhail aren't here to witness their dream we still brought it to fruition throughout our efforts..!<\n\n\n\n>!My day has been officially ruined, don't be a 4-star in Shaoji's story, ever!<",
            "Shitpost about jiaoqius legs \n\n>!he took the crown for skinniest topmodel legs from dan heng!< \n\n>!that's it.!<\n\n>!cooking and catwalk, icon!< \n\n>!sunday still has the most muscular calves out there!<",
            "I don't know if anyone here will find this useful, and if anything I may be outing myself as a dumbass for figuring this out so late.\n\nThose rotating compass adventure domains? There's a secret to getting them all to align 100% of the time.\n\nhttps://cdn.discordapp.com/attachments/522625543053508642/1253609981211705485/image.png?ex=66767ac6&is=66752946&hm=4db4fb31abdeeddeb71ab8691b8a98c4f2617dff51bf62598ee711cdf8f2d5d6&\n\nNote the colored dots in each ring. They literally tell you how many 'spaces' that the 'line' on that ring will move after you try to stop each ring.\n\nLike in my example, my outermost ring has 2 colored dots. In order to get the 'line' to slide to where it did in my example, I had to stop the ring when the 'line' was between the 5 o'clock and 7 o'clock positions (or was it between the 7 o'clock and 9 o'clock? I'll need to do this again, but I think you all get the point). Better method than trying to eyeball the speed of each ring (that I did for a whole year like an idiot).\n\nAlthough when I brought this up with a friend, they notified me that these things went through a slight design change for Divergent Universe (the 'dots' used to be crescent moons), so I don't actually know if the old ones worked the same way at all.",
            "Ok I'm editing a Chinese novel and the protagonist name is Jing Yuan \n\nAnd I open HSR on another window and use Jing Yuan to run AS \n\nTheir Chinese name also use the same character (景元）\n\nI'm happy to continue edit this novel acknowledge this cool fact 🤩\n\n(Cocolia is whooping my ass tho)",
            "i blame dan feng for ruining Long's reputation. /s",
            "2.3 spoilers, speculation on future arcs\n\n>!one thing I really liked (and also makes me a little nervous for the future) is march’s worries about the future. It’s something that ties in pretty neatly with the story of the Nameless in Penacony, of how all things to do come to an end and exist only in the past, but also of how their stories will keep enduring.!<\n\n>!The part that makes me nervous is wondering how each of them will react to a farewell. Himeko, judging from her character stories, is almost always ready for any farewells. She’s kind of fascinating actually, I do think that her best time in the spotlight will be at the very end of the journey given her suspicious connections to Akivili. Welt is a little hard to judge but I think he’d be sad but take the farewell with grace. He’s enjoying the adventure and cares for the Crew but his ultimate goal will be to return home at some point, wouldn’t it? If he’s able to go back home, I think he’d have some regrets but would gladly go back. Though there is the point about him wanting to protect Himeko….. I guess, he would willingly leave when Himeko leaves. I’m less sure on him tbh. Now the trio are the ones I’m most nervous about!<\n\n>!March, for instance, really doesn’t have any huge ties beyond the Express Crew. When the time comes for farewell, where will she go? Maybe she does get some idea once she gains her memories back, but what happens if she never gets them back? Or what if the people who existed at that time aren’t alive any more? The Crew are everything for her and the people who she’s made the most memories with. I think for that reason, the idea of farewells would be especially devastating for her!<\n\n>!Dan Heng….. interesting case wherein he could technically disembark on the Luofu. Despite the public dislike, there are still people there who respect him and treat him well, like Jing Yuan and Bailu, and Yanqing. He does long for his homeland and it could be a chance to slowly regain his connection with it, in a better way than how he was treated in the past. But ultimately, his most precious and closest ties are to the Crew. Plus his most deepest desire was to travel forever with the Crew…. He’s aware that it’s a fantasy so he knows there’ll be a farewell. But I think it’d be pretty devastating for him all the same given how much he wishes to stay with them!< \n\n>!And what happens with Trailblazer? As a character that’s like half self insert, half their own character, it’s pretty hard to pin down. They could easily be a case like Himeko or someone like the other two in the trio. But I’m leaning towards being like the other two. In their case tbh, im more nervous about how *they* would eventually leave the Crew. As a body made to house a Stellaron, how long will they live for? How exactly is their journey going to end? Like is it going to end with a sacrifice on their part, is it going to end with them being the first to leave….!< ",
            "[2.3] >!not me getting sad over the Gallagher note that was left behind on the express…😭😭my feelings…!<",
            "2.3  \n\n>!so if I'm understanding it correctly, Sparkle was hired to make all 3 of Firefly's deaths \"safe\", not just the last one? if so then I guess it kinda makes sense for her to be throwing the TB and Firefly into the real Dreamscape back in 2.0 so Firefly gets stabbed by SUD...?!<",
            "New megathread, new manifestations.\n\n🕯️🕯️🕯️Manifesting Sunday leaks🕯️🕯️🕯️\n\n🕯️🕯️🌶️Manifesting Jiaoqiu rework and buffs on V.3, including E2 -> E0 as a DOT burn and a new positive effect on allies affected by his ultimate.🌶️🕯️🕯️\n\n🕯️🕯️🕯️Manifesting Feixiao model reveal🕯️🕯️🕯️\n\n🕯️🕯️🕯️Manifesting a big leak of 10+ future characters kits (saying what archetype they will be part of   and all)🕯️🕯️🕯️",
            "For some reason whenever i make a post it gets auto-deleted,\n\nHere is 2 new jade codes for yall\n\n[https://hsr.hoyoverse.com/gift?code=6T3F5HVD6LK7](https://hsr.hoyoverse.com/gift?code=6T3F5HVD6LK7)  \n[https://hsr.hoyoverse.com/gift?code=FIREFLYSGIFT](https://hsr.hoyoverse.com/gift?code=FIREFLYSGIFT)",
            "2.3 story spoilers\n\n>!just fell down on my knees, screaming, crying, begging, after topaz said her cornerstone doesn't give her a transformation like aven.!<\n\n>!hoyo is so ungodly cruel!<",
            "2.3 >!Gallagher's note!< is devastating holy",
            "I'm gonna type up my thoughts on 2.3 and Penacony arc at some point down the road. For now, I just have to ask this question: [2.3 story spoiler] >!WHO GAVE THIS [SASSY LOST CHILD](https://imgur.com/a/tqY0qSQ) A GUN?!?!!<",
            "Randomly came across this [Yunli showcase](https://x.com/luvvrouge/status/1803483259759895018) if anyone's looking for crumbs \n\n\nEdit: It's not very good tho. Multiple Eidolons on everyone \n\n\nEdit2: WTB showcases even if they're unrealistic for the Pink duo",
            "I want Screwllum\n\nಠ ∩ ಠ",
            "[2.3] >!this group chat is a fucking shitpost. this trash-brained lunatic really put in everyone he knew 😭😭!<\n\n>!also, the GOLDFISH OF PEAK!!! i missed her!!! and i should probably reread kagurabachi (aka peak fiction) again for the other one!<",
            "Ok… DU is my least favorite SU expansion so far… can’t choose equations the way u can choose ANY path in SU/SD/G&G, a lot of times I end up with shitty equations that want 2-8 blessings from 4-5 completely different paths and then the gold equations want as many as 8 blessings from one path and I nvr get that far before it’s over… WTF…\n\nAlso somehow the bosses are doing STUPID damage… 2nd boss (not even final boss) Kafka in her 3rd phase one shot my Clara through aven AND fmc AND m7 shields… like…",
            "who up Simulating they Universe",
            "When did QQ's Autarky (E4) get renamed to \"Self-sufficer\"? this patch?",
            "Lesson learned, never grab curio that forces autoplay when you have Erudition blessings, Ruan Mei, and Ratio",
            "2.3 story\n\n>!The height difference is kinda funny seeing how Silver Wolf is more like big sister to Firefly. Remind me of my cousins lmao.!<",
            "fixed spoiler tags x__x 2.3+\n\n>!Possible M7 lore in Amphoreus, hopefully!<\n\n>!\"Listen to the infant in the mirror.\" – Blackswan about the Beauty; if Amphoreus is hidden in the mirrors of the Remembrance, then it could be that the world only exists for as long as people are able to remember it, Idrila herself is represented in Argenti's splash art as a greek statue with ruins around!<\n\n>!BS sneaking into March's room could mean that she had been the one putting the photographs in her room and could easily be changing her memories into believing she had took it herself, as she's been shown to be able to do it with Sparkle!<\n\n>!March not being phased and even mocking her dreamscape interpretation in the Order's dream is crazy, because it's been so blatantly stated that her deepest want is to know about her past, and Sunday wasn't even able to take advantage of it cause maybe even THEY can't see it!<\n\n>!\"They compose magnificent tragedies for heroes facing their end...\" If the mourning actors are actually there, then per lore wise; they could be setting up a tragedy; a GREEK tragedy: a world doomed to be forgotten and a girl who wants to remember!<",
            "getting absolutely beat down in honkai candy crush over here. im gonna pretend everyone i lose against are all match-3 bots for the sake of my dignity",
            "I just noticed that they changed Gallagher's autoplay AI so he now ults asap instead of holding onto it until multiple teammates are about to die. Great stuff.",
            "“World devoured by ice!!!” “Freeze to death!!!!” 😐",
            "For those who finished the 2.3 story, >!the very last page of the sticker book has a nice finish to it.!<\n\nAlso, a nice little titbit for those who don't know yet, but scrolling through each page from 1 onwards will play the Penacony leitmotif.",
            "Leaked character model >!continues the still on-going trend of [male characters and side parted bangs](https://imgur.com/a/LIvNT1y)!<",
            "2.3 story spoiler \n\n>!k. !<\n\nI fuding love him",
            "2.3 spoilers, song\n\n>!I may be getting sentimental in my old age, but I'm bawling my eyes out at \"Had I Not Seen the Sun\". I hope we see Sunday reunite with Robin at some point in the future, surely they're not doomed to be separate forever, right?!<",
            "Minor 2.3 story spoilers\n\n>!If you go to the prow of the ship during Firefly’s section, you see what it looks like to everyone else when the Trailblazer is talking to the origami birds!<",
            "New character\n\n>!I love men in suits 😭 He looks so dapper. I can't wait to see his complete 3D model.!<",
            "the real highlight of 2.3 isnt the fun story, the new characters, or various QOL updates\n\nits the fact i can farm planars with a single button press. im never touching normal SU again",
            "About divergent universe. Like, I'm sorry but is there a way to turn off the builds that they give you? Because it sometimes makes my characters worse. Like my boothill has like 194 BE (htb helps fill the gap) but in DU it's 163. and like same for my dan heng and cooler dan heng, both get lower crit damage, a lot lower, just to get a bit more crit rate. At least my ratio is still cunty",
            "2.3 story spoilers\n\n>!i didnt miss anything as i always do all the optional objectives + all dialogue options but i really do hope they stop putting significant things behind optional text. i genuinely cant imagine missing that final acheron conversation.!<",
            "Character development is when you go from feeling regret pulling Ruan Mei to wishing you could run duplicates of a  character so she can be on both teams.",
            "mfw auto battle plays AS better than i do 💀\n\nedit : i got 6648 points on auto both sides 💀 💀 💀",
            "Divergent Universe:\n\nim probably missing something obvious... but is there a way to turn off the DU character enhancements?\n\nit's wrecking some of my relic builds x.x my 160 SPD RM is getting bumped down to 144 with 140 BE... and not just her but a lot of the mapped relics have worse builds for me TwT",
            "I'm a radish? 🤨",
            "The worst thing about DU is >!the curio that forces you into auto-battle for the ENTIRE RUN. Makes me want to avoid any 'get random curios' options like what even is this 😬!<",
            "2.3 A heads up for the Final Dialogue with Acheron\n\n\n>!I'm not sure if this is easy to miss or anything but I personally almost missed this after choosing the 2nd dialogue option when she asks us. So for people who still aren't finished or redoing it in their 2nd acc: choose the \"What if it isn't an illusion?\" dialogue option and keep pressing the first options. We get a longer dialogue with her accompanied with 2 beautiful cgs of her and her past self.!<",
            "2.3 main-quest spoiler and question.\n\n>!So, i left a little confused, how exactly FF taking the bomb away count as her third \"death\"? Sparkle text us explaining someone hired her to deliver the most safe one, but like, how can this be considered a death and fulfill destiny? Also...what was the unforgivable gains FF was promised?!<",
            "Did anybody else fo Checking Out quest? >!I don't think a quest was this hilarious since Aurum Alley. QQ, Boothill, Argenti and Stelle stomping on some Pepeshi was so funny. Also I really like Topaz and Aventurine making fun of each other and Jade acting like a mom. As for Stelle, our Trailblazer is back on being a menace to society. Although it was for the sake of a joke, she wondered when will Express will have a new member, maybe foreshadowing?!<\n\nBtw where are Yunli showcases?",
            "Taking a long vacation under the Shadow of the Erdtree. I'll be back Star Rail! 🌳",
            "Using Ruan Mei techniques in SU is satisfying like damn that's a lot of dmg.",
            "I feel like the more we see Topaz in the story the more and more I like her, and I already liked her a lot.",
            "played DU and i can confirm the solution to every max difficulty SU mode is DHIL propagation",
            "DU thoughts (mixed / slightly neg)\n\n>!I just cleared DU protocol 6, in my opinion the game mode overall has some good ideas, but a bit too much rng with not enough control over it to be properly satisfying.!<\n\n>!Positive: Some of the combos are very satisfying and I like the idea of equations in general. Boss variety in itself is also nice (if only it wasn't complete rng) and having to do only one run weekly and being able to farm planars easily is great qol.!<\n\n>!Negative: Having limited control over blessings and equations made it feel like I ran similar \"safe\" builds every run. More specific builds like freeze/shield from swarm/gng didn't seem to worth to even try for to me (might be skill issue). And my least favourite part: complete rng on what bosses you get can make a drastic difference in difficulty, especially with the added focus on breaking enemies. Really wish at least you could pick 1 out of 2 options as before or something similar.!<",
            "Is it just me or... Divergent universe is soo random. there are no mainpath to make a higher chnace x path to appear etc. most of my run have a a mixed equation. is there any tips in bigger difficulty?",
            "Quick question, does my flair look normal to yall or does it just say \"Custom with Emojis (Physical)\"? For some reason it shows up normally for me on pc but on mobile it just shows the above phrase.",
            "Lost my life saving rerolling a 5 star equation so I'm opening a GoFundMe.",
            "Wild that they put a 27% def ignore on FUA as a mere 2 star elation blessing.",
            "i should be asleep but instead I'm checking this sub for absolutely no reason at all, i am sane, thanks for asking ",
            "Sometimes I remember how Kafka’s old beta kit didn’t have Dot denotation on her ult (instead it was in her E1 💀) and I’m thankful of how such a thing was avoided",
            "I submit defeat at this candy crush game. I'm trash lmaoo. I never liked candy crush and this proves it.",
            "ot rant (irl)\n\n\n>!Boy, do I love being forced into a set of 4 choices on a subjective opinion question in _finals._ What makes YOU, person who set the exam, think the answer you came up with is the correct one? How am I supposed to see the exact angle you're coming from? Is mind-reading a required skill to qualify for college now?!<\n\n\n>!I'm probably being way too dramatic over this, but it genuinely ticks me off when it happens. Like seriously, couldn't this be an essay question? It's not like I fully missed the point, but I'm not sure if the choice I picked among a very similar pair is the \"right\" one.!<",
            "If RM wants to play god so much why don't she clone herself so I can get the last star in AS4???? Cocolia is a bitch I'm glad Serval got over her",
            "gallagher is sexy",
            "The life of a Sunday ~~cult member~~ fan isn't as simple as it seems, they follow a very strict weekly routine :\n\n* Sunday : Praise Sunday and pray for new leaks 🙏\n* Sunday : Praise Sunday and pray for new leaks 🙏\n* Sunday : Praise Sunday and pray for new leaks 🙏\n* Sunday : Praise Sunday and pray for new leaks 🙏\n* Sunday : Praise Sunday and pray for new leaks 🙏\n* Sunday : Praise Sunday and pray for new leaks 🙏\n* Sunday : Praise Sunday and pray for new leaks 🙏",
            "2.3 spoiler\n\n>!Heres my biggest copium crackpot theory: we know Aventurine & Boothill are cooperating together to find Oswaldo, and that the marketing development dept has beef with strategic investment dept. Argenti is also on good terms with Boothill in the post-2.3 lobby manager quest.!<\n\n>!in a future patch, Sunday gets pulled into this group of misfits & we follow this JoJo Bizzare Adventure story of 4 dashing dudes going around beating baddies for info until they eventually reach Oswaldo!<",
            "2.3/DU minor note\n\n>!I know it's just a small piece of lore, but the fact that they explain the difference between SU vs DU using Dr Ratio's views of \"we should be looking at *humans,* not Aeons\" is just... ugh, I love Dr Ratio so much (his philosophical views are based)!!<",
            "Fuck that bitch cocolia",
            "2.3 spoilerinos: >!Ok I was pretty neutral feeling and 'aw that's a touching eulogy' throughout the farewells at Dreamflux Reef and Dreamjolt Hostelry, but idk why Pom Pom crying when they found out the fates of the three Nameless brought me close to tears too 😭 I think it's a combination of knowing that the For Tomorrow's Journey light cone exists where they're all happy and toasting each other before their departure and remembering that light cones capture memories that did it for me. It also reminds me of Doctor Who in a way???? who sees his companions come and go and at the end of the day it's always just him and his TARDIS. The loneliest creature in the universe :')!<",
            "VA Conspiracy/Guessing:\n\nChris Hackney, who voices Dimitri from Fire Emblem and Ayato, just started playing HSR fairly recently. And he got to around Penacony story now. What if he is voicing a future character and is preparing to catch up to the story when they are released.",
            "Now we know what we asking for on the survey: Pls bring back companion quests 🥺🥺🥺",
            "Why is Elegy kind of a baddie? She gives off this creepy necromancer vibes. Her design is so intimidating. It feels like she will come running after me if I turn around. Peak creepy vibes with a sick design.",
            "(2.3, Ratio rambling) \n\n\n>!I have lots of thoughts rn on Dr. Veritas Ratio, and shockingly not about his single 'k.' text, which is so at odds with the essays in his daily messages that it's comedic in hindsight to know how much he did not care. Anyway, moving on, the very last page of the Dreamscape pass sticker book has everyone's stickers in it with some nice text underneath it that relates somewhat marginally for the character, and Ratio's one is \"I just did what a supporting character would do\", which is so at odds with everyone else's, which were generally reflective and introspective of sorts, or even Boothill's funny \"this is some nice fudge! I mean the actual candy\" one. So why is Dr. Ratio, poster child of an academic scholar, talking about being a supporting character (a line usually mentioned by people like Sampo and Sparkle, who are Masked Fools)?!<\n\n\n>!My speculation is that either this ties Ratio more deeply with Amphoreus, as the Cosmodyssey Board Encounter was written by Sparkle and emphasised Amphoreus' theater culture, and also made a Ratio reference (so perhaps Amphoreus citizens view life as some kind of performance, and this is just relating Ratio further to Amphoreus) OR it's more evidence that Ratio is in some way connected to Elation. It's also worth mentioning that thus far, Ratio has acted out different roles in both Mundane Troubles (his Trailblaze Continuance) and the Penacony plot, which are his 2 plot relevant sections. In 1.6, he pretends he has no idea about the whole thing and just goes through the interrogation, investigation, fight the entire way through and acts clueless, even going so far as to take a theatrical bow when he lights himself rather dramatically on fire and leaves, and in 2.1, when he acts like he hates Aventurine and even betrays him very convincingly. Both times he has just been acting, which is another theater connection to Amphoreus and a possible theater connection to the Elation too, especially with his owl mask on his shoulder, which seems a bit similar in concept to Sparkle having a fox mask. Am I saying Ratio is a Masked Fool? Probably not. But I am saying that Ratio probably has ties with Elation concepts, and if the Amphoreus-Ratio connection is real, then Amphoreus probably has Elation concepts in it too.!< \n\n\n>!A last bit I was thinking about, but the whole theater, Elation, Erudition connection makes sense if the cultural inspiration is Ancient Greece/Rome for Amphoreus. There was a period of history where the Greeks, right after overthrowing a tyrant and establishing a democracy, used Greek tragedy plays as a means of political education to ensure that citizens would remember that tyranny is bad and to remember to be an active, conscious voter involved in politics to ensure that governance would not fall into the wrong hands. In this regard, Erudition also tied in nicely for Amphoreus, esp with the Dr. Primitive mention. And who else do we know with Greek inspirations in their character that has acted out a part for the sake of educating people again? Dr Veritas Ratio, of course.!< ",
            "Damn Apocalyptic Shadow is hard 😭💀",
            "2.3 post-story\n\n>!Players before 2.3: When are we going to see MC's room in the Express? Do they even have a room?!<\n\n>!Da Wei in 2.3: **Woe, flying ship be upon ye**!<",
            "2.3 ending\n\n>!staring at the Acheron smiling CG my crops have been watered, my skin is clear, the sun is shining 😭😭😭 when’s her rerun best therapist frfr!<",
            "I can’t wait to return to Penacony someday. I am absolutely in love with the aesthetic. Hope to see more playable members of the Family. Can’t wait for playable Sunday. I really want to know what his animations will be like. 2.7 can’t come soon enough.",
            "2.3 story spoilers\n\n>!so rude of them to give us a taste of the origami pvp event in the story only to cockblock us for another 2 days... give me the origami bird event now!!!<",
            "leaked character model spoilers\n\n>!> obviously unfinished character model is leaked!<\n\n>!> people are already complaining about how john hoyoverse made a lazy and uninspired design!<\n\n>!why are people like this!<",
            "Apocalyptic Shadow >!Just started the 4th stage with cocolia and gepard keeps taking multiple turns to hit my ally and seeing the AV drop and i was flabbergasted. Girl, i haven't even started my turn yet and you're telling me my AV already drops? Knowing what they've done with PF, i'm not excited to what they're gonna do with this mode. !<",
            "have I mentioned yet how much I despise fighting base Cocolia literally anywhere",
            "please… moze… all i need is one peek…",
            "2.3 spoilers\n\n>!I was expecting the Trailblazer to whip out their bat or fire lance to block Sparkle’s hammer before getting knocked off. You’d think they’d stop letting Sparkle even get near to them to begin with and fall victim to her antics after previous encounters but alas, cutscene power to the max.!<\n\n>!In our last conversation with Acheron, I was almost expecting her to say “Fight for all that is beautiful in the universe.” or something along those lines but what we got was good too, carried the same sentiment.!<",
            "Desperately need another limited sustain soon so Aventurine isn't forced to go on the side with heavy incoming damage/cc and not the side that optimizes his damage sometimes. I didn't really vibe with the others except Fu Xuan but she refused to come home TWICE so I pulled a Yanqing and said \"This is why people fall asleep when you talk\" and gave up on her. Lingsha gives me Seris from Paladins vibes (and I mained Seris) from the silhouette so I hope I like her vibes!",
            "Running through DU with a Himeko based superbreak comp. Up against the musical trio. Gallagher breaks with a basic attack. It deals 2.7 million points of damage. \n\nGallagher (or whosever legs these belong to) never skips leg day, confirmed.",
            "New genshin banner, lmao wtf even",
            "OT genshin\n\n\nWHAT ARE THOSE BANNERSSSSSSSSSS MIHOYO WHEN I GET YOU",
            "Looked around a bit for Yunli showcases and this seems to be the only decent one so far? https://www.youtube.com/watch?v=LXviXMaqNU4\n\nNever a big fan of these tryhard 0 cycle teams though, I want to see her in a normal sustain comp, and also in duo with Clara just for fun.",
            "*channeling my inner ✨mother✨ coz I'm gonna play candy crush in hsr tomorrow*",
            "I love how everyone's pointing out the funky pepper on Jiaoqiu's phone case, while ignoring the cleverly half-hidden star anise. We must stop this sneaky fox from sneaking spice into everything!",
            "(post 2.3 TB quest)\n\n>!Thanks to the commenter who pointed to the letter on the Astral Express, appearing after the TB quest... !<\n\n>!He's really gone, hu. Now I feel genuinely sad. !<\n\n>!and that mention about releasing Sleepie was gutwrenching!<\n\n>!Geez!<",
            "the problem with DU is that WE DONT KNOW THE FINAL BOSS UNTIL THE FINAL CHAMBER. imagine setting up equation and blessings perfectly for acheron team but then at the end theres freaking CIRRUS. im not fighting that thing without clara!! my only saving grace was having abundance equation with the dewdrop blast so after tinkering some teamcomps could clear with luocha/clara/blade/gallagher (needed bc luocha always dies in the final wave so i need some healing to make it through the last flower blast)",
            "[Boothill profile voicelines]\n\n>!I was just going through Boothill's voicelines (as you do) and I've noticed that they changed his \"About Sunday\" line in 2.3. In 2.2, it was: *\"What's that old saying again? Got it! The path to hell is paved with good intentions! That's the one!\"* but now before he gets it right they've added in *\"A roadkill steak is paved with indigestion...?\"*. I have no idea why they went out of their way to revise that line, but more Boothill fudging up his words is always appreciated lol.*!<",
            "Checking Out (Post 2.3 TB Quest) Adventure Mission\n\n>!Saving QQ from a cult of Pepeshi with the help of Boothill and Argenti is probably the funniest thing this game could have come up with!<",
            "Is there a lore reason as to why the \"tomorrow in harmonious chords\" enemy has such a ginormous caboose?",
            "Me: Casually earns 68 points on a round\n\nMy opponents for some reason: **254 points**",
            "Day 59 of Manifesting Playable Siobhan \n\n\nHappy Friday besties. So we all know Acheron is an incredible dps already. She doesn't *need* JQ to deal insane amounts of damage. With that in mind, how do you think MHY could mess with his powerbudget to be weaker in Acheron comps but open him up in other comps? ",
            "divergent universe save files expire weekly??? BYEEEEE \n\nyou still have to technically grind divergent universe weekly lol. i guess this is only efficient if you are farming for the planar sets for the whole week (or for most of the week).",
            "I saw i had the excel sheets from when i got balistic into Aventurine on his beta. So i decided to see how much Jiaoqiu helps Aventurine on preventing CC's. Jiaoqiu takes away 30% EHR of enemies, so:\n\nWith the scenarios: Ally with only the 50% EffRES of Aventurine and ally with 20% EffRES we have:\n\n|Base Chance|100%|100%|100%|\n|:-|:-|:-|:-|\n|EHR\\_atk|36%|6%|6%|\n|EffRES\\_tg|50%|50%|70%|\n|DebEffRES\\_tg|0%|0%|0%|\n\nAnd then\n\n&#x200B;\n\n|Enemy Real % to hit|68%|53%|38%|\n|:-|:-|:-|:-|\n|**Real Chance to dodge CC**|**32%**|**47%**|**62%**|\n\nIn conclusion, is a **15% increase** on chance of dodging CC'S on the 50% scenario, and the diffence gets lower the more EffRES we get. At the 20% scenario we only see a **increase of 11%** on the chance of dodging.",
            "From what I've seen from beta testers on Discord, the consensus seems to be that Yunli is ridiculously strong currently, T0 or higher and very likely to get nerfed. It's kinda hard to see this right now with the lack of showcases but there is one 0 cycle on YT where this is more apparent (the Bronya there isn't doing much other than cancelling Sparkle's buffs so the team basically only has three units).",
            "Won my first origami pvp and now I'm afraid to do it again because I'm on an ego trip",
            ">Additional mechanism unlock:  \n\n\n>Food on-the-go- you can use Consumables in Divergent Universe (except for when Threshold Protocol is active)    \n\n\ngee thanks. this is practically useless 😭😭😭😭",
            "...oh. the way i just beelined it to V5 without realizing you can place exhibits on the cruise ship to give small DU buffs lmfao\n\n~~surely this 2% hp increase is my missing key to not wiping in V6~~",
            "Uhhhh i might have gotten a /little/ addicted to the origami bird event. They had no reason to make this as fun as it is. I either feel like an absolute god or the stupidest person to ever play the game lol. I’ve been swapping btwn tb bird and ff bird and they’re best a blast to play. \n\nThe only complaint is that i wish they would give us more time during the later rounds bc sometimes the combos get ridiculously long, like 5-8 seconds and that’s a lot when you have like 10 moves to make and only 40-50seconds left. I had a couple of rounds where both me and my opponent didn’t get to finish our moves bc the timer ran out…. Besides that, it’s really good.",
            "Some funny words I found from hoyo fans today: \n\n>!finally mhy is pondering to us heterosexual!<",
            "Hi ! [Elio](https://imgur.com/a/XwDZuxe) here to remind you to follow the script !\n\n* Don't spend more than you can afford, no matter the twist of fate ! Firefly will come back later !\n* My stellaron hunter's favorite snack are oak cake rolls. Use this knowledge as you will.\n* My favorite, non forbidden snack is chicken. If you scratch my chin and give me some chicken, you will win all your 50/50s",
            "I need a skip patch, but HSR keeps putting characters that I want. \n\nThe last time I had a skip patch was 1.0 (I didn't know how pity works back then. I was too afraid to spend my pulls and get nothing).",
            "No voicelines when animations come out really makes me appreciate and listen in on the sound design more",
            "I have 9 wishes and a dream.",
            "[Bladie and Yunli](https://x.com/hikkapirate/status/1803139789354574253)",
            "Firefly's voice actors rent was DUE \nI fucking love the aggression in Sam's voice 😭",
            "I got a fire, got a firefull of flyshine\n\nI got a mech and I know that it's all mine oh, oh-oh\n\nDo what you want but you never gonna break me\n\nSwarms of bugs are never gonna shake me oh, oh-oh\n\nTake me away, a secret place, a sweet escape\n\nTAKE ME AWAAAAAAAAAAAAAY 🎶",
            "Cocolia heard me saying she's become a pushover over time and came back with a vengeance lmao",
            "Firefly without HMC is so \"lol, lmao even\"",
            "2.2 story\n\n>!So Dan Heng has actually spent years in Ena's dream. That's fucked. My poor boy.!<",
            "2.3 minor spoiler \n\n>!The funniest piece of trivia to come out of this quest is that the feud between Strategic Investment Department and Marketing Development Department is apparently well-known in the universe lmao I really need to see a Diamond vs Oswaldo fistfight soon!<",
            "Texting options when texting characters be like:\n\nOption: Trick or Treat\n\nWhat trailblazer texts: ludicrous tomfoolery or delectable sweets",
            "i do not appreciate this new mode changing my luocha's relics, is there a way to turn it off😭 they literally made him worse",
            "Is there a reason why we havent seen any showcases of the 2.4 beta characters since the first gameplay videos we got when the beta opened? I know its early and the characters will recieve changes, but I would still like to see how they work/interact with other characters in battle, stuff like Jiaoqius debuff application in Acheron teams and March 7 in a superbreak team. I’ve seen a single showcase of Yunli in a fua team on YouTube so it definitely seems like people CAN do it, i’m just wondering why there havent been more since betas release",
            "OT reverse1999\n\n>!very excited to wake up to Getian tomorrow. It’s been such a long wait but he will be hereeeee. The birb!!! Not the hsr birb but a birb nonetheless, his design is mesmerizing and i really enjoyed him in the story. Been pretty miserable today bc of a fever and a headache but that’s one thing to look forward to yay. I do hope the fever goes away tomorrow because i really need to be cognizant on Friday!<",
            "(2.3 spoilers + post-TB text messages)\n\n>!I think that this epilogue was a good summary of the good and bad points of the whole Penacony arc: !<  \n>!- a bit took talkative for its own good (and pace), !<  \n>!- some plots way too easily resolved off-screen or swiftly swept under the rug (The memoria leak issue for Dreamflux Reef, the Stellaron?!)!<  \n>!- FF + MC= BFF!<  \n>!- The whole Trailblazing arc, which I truly loved and was for me the best moment in 2.X. The \"toasting\" at the end was perhaps a bit long-winded, but the whole bit was sweet nevertheless. !<  \n>!To an imperfect tomorrow, Gallagher. May the Astral Express meet you again.!<\n\n>!- EDIT : And I nearly forgot: Acheron is truly a gem, from the beginning to the end. I was indifferent to her pre-2.0, but now I love her. She was truly the most wonderful character in an already wonderful new cast.!<\n\n>!Super happy that Sleepie seems to have found a new friend (the heliobus)! I have only seen the dialogue on the ship, does somebody know if we get any more info about this by exploring? !<\n\n(DU)\n\n>!I really like it very much. Yup, it's a lot of RNG but at least, it keeps things fresh for a while! My only gripe would be that the whole UI screen at the beginning feels a bit cluttered with a lot of pointlessly complicated terms. But that's a minor thing. Looking very much forward to playing it a bit more! !<",
            "Yooo March offered me the Grimace Shake!!\n\n\nLet me try it-",
            "(2.3) >!You know, Topaz teases TB to come work for the IPC so often that I almost want to see it happen lol.!<\n\n>!During the checkout quest she even takes it semi-seriously if you joke that you will, and says that the main thing stopping her is just that she doesn't want to overstep boundaries with Himeko.!<",
            "I finally have 4 save files for DU:\n\nSave File 1: QUINQUILLION DMG\n\nSave File 2: BRAKE!!!\n\nSave File 3: DOT DOT DOT\n\nSave File 4: FOLLOW me into the light",
            "losing 75/25 on LC with the only LC i dont want is so, so sad. like that is 1/7 on top of that 25/75. i havent had the mood to touch the game since it happens on banner drop. and i have never skip a day from when i started back in december too, but this is just too much pain\n\n\nbailu LC is the only standard LC i dont want, and would welcome literally any other standard LC. feels bad",
            "Why are there barely any showcases?",
            "2.5 moc bringing back the monkey and debuff galore while having 1 gallagherillion toughness so that they could sell the healer/cleanser with break efficiency for one character\n\nalso e1 firefly stonks since she's sp-neutral",
            "I love the new candy crush event, hope they try clash of clans or plants vs zombies next.",
            "Colored aventurine nendo & blade nendo [announced ](https://www.reddit.com/r/HonkaiStarRail/s/4s4aOhBidz)\n\nLet's go! They really step up their merch game rn!\n\nThey also announced [Sakura ](https://x.com/WINDBREAKER_FAN/status/1804095438850789774?t=Nr89sVgeOOgj4fJZkO6TQg&s=19) if anyone here is a wind breaker fan 😭",
            "[This is Himeko's world, we all are just living in it.](https://cdn.discordapp.com/attachments/1103172179572555827/1253745989991403520/image.png?ex=6676f971&is=6675a7f1&hm=2167044018dee9288179842544897f19f8ae3e4bd8ac4d82db249f7e135eec5e&)\n\nI'll miss when the content stops catering to her niches 😔",
            "Me coming in here all the time for Screwllum CRUMBS",
            "how are there so many match 3 pros in this game? are they using bots?",
            "where did all of the atk% mainstats and subs go? my flyshine is starving",
            "[Got my DU V6 clear!](https://imgur.com/a/17cFzdI)\n\nThankfully the final boss was Sam who is completely unable to get through Macrosegregation stacked Aventurine shields.\n\nMy main gripe is how the RNG final boss roulette decides whether or not your build lives or dies. Also feels like this mode shills the hell out of Firefly considering the weighted curios all feel meh except for the destruction/fire break ones.",
            "Origami bird event \n\n>!Losing by 4 points hits harder than being nuked for 100 !<",
            "Wishing everyone a very Fyrefull Flyshine\n\n>!legitimately sounds like a made up festival you'd hear in a D&D campaign!<",
            "1 hour until its time to start spamming the login screen for early release",
            "2.3 aftermath \n\n\n>!I was expecting Aventurine's photo when they were showing new express visitors and he didn't appear... My disappointment is immeasurable and my day is ruined 😔!<",
            "Okay so apparently, some people are saying that Argenti is missing voicelines AGAIN in this patch... How can you fumble that *twice* 💀 Rip Argenti mains wanting to hear his beautiful voice",
            "I cannot prove it, but I'm completely convinced that the person who designed Hanu Wars is actually evil",
            "Hello\n\nDo all the (Optional) dialogues in the 2.3 story.",
            "2.3 Spoilers for the last scene >!Just realized the truth of Elio's script. The rewards Firefly gained is not just her friendship with the Astral Express but also the alliance between the Stellaron Hunters and the Ten Stonehearts. And the brother and sister forever separated meant that Robin made a deal with Jade, in exchange for her brother's freedom, she and him will be eternally separated.!<",
            "Mild 2.3 spoilers\n\n\n>!While I was exploring the Feldspar after the quest, I found the Titanic re-enacting birds at the prow of the ship and I just stood there listening to their conversation and that's when I realized: This is exactly what the TB was doing in the quest!<",
            "[2.3] >!oh, i love seeing how fucking loony mc is from an outside pov, this shit is PEAK!<",
            "Since there's a lack of companion quests recently I'm just gonna ramble and list some of my fave ones and talk about one thing I really liked & remember about them:\n\n* Serval's companion quest: >!So many feels from Serval trying to find closure. At the end when having to choose if TB should tell her what the fragmentum!Cocolia said felt like all of the options just felt... painful. I chose to tell her the truth but the truth hurts. The other options would be lying and especially pretending not having heard anything kind of felt like maybe it would make it harder for Serval to eventually move on, not knowing. I still occasionally think about how conflicted I felt when having to make this dialogue choice and it was one of the first companion quests I ever did.!<\n* Luka's companion quest: >!I wasn't a huge fan of Seele after Belobog story but I actually really liked her presence in this quest. I thought her dynamic with Luka was fun and I enjoyed going through the quest with her trying to figure out why Luka was acting a bit cringe, only to awkwardly leave at the end after finding out. Still not my fave character but that's not really what makes quests enjoyable for me apparently.!<\n* Yukong's companion quest: >!Somehow I managed to relate to both the mother wanting to protect her daughter from harm AND the kid being frustrated about an overprotective mom preventing them fulfilling their dream. I don't have kids nor do I have an overprotective mother. What the hell, hoyo, stop.!<\n\nWish we had more companion quests, I really enjoy doing them. And there seems to be more freedom in the writing when you don't have to shoehorn it into the main trailblaze mission.",
            "ruan mei's sfx is very well-done. from the ruan riff in her ult to the twang of her normal attack to the chord that plays when you use a skill, it's all very satisfying to listen to\n\ni also *really* like the sound of her technique. ngl, sometimes i spam it just so i can appreciate those pretty chords",
            "2.3 mixed\n\n>!Has anyone else noticed that the stellaron no longer seems to be a major part of the story? In both Luofu and Penacony we never actually get to see the Stellaron. It's just there as this invisible doohicky that's supposedly causing shenanigans. But as soon as the main conflict is solved, it just gets shoved somewhere you can't see. Belobog was the only time we actually got to see the Stellaron and actually get to interact with it. At first I thought the lack of focus on the stellaron in Luofu was just a one off because so many things about that story didn't feel polished but they did it again in Penacony. It's like the writers intended for it to be a much greater part of the overarching story initially but at some point decided they didn't care for that plot point. Now it's just an excuse for conflict to happen but doesn't get any more interesting than that.!<",
            "its cocoliover.......",
            "It needed 5 more easily, half of the cast wasnt explored enough, and they needed it",
            "Robin companion quest save me….. robin….",
            "Robin boothill and jade (minimum) needed one. The pv thing only worked for aventurine and acheron",
            "That is some excellent onomatopoeia, but unfortunately all it summons is the image of cake cats in my head...",
            "Im gonna miss the birbs. Can't we get one to come with us ;;",
            "I swear she took like 7 in a row at one point.",
            "She’s abusing Bronya’s skill and DDD at the same time",
            ">!many hugs. i may not have been in as dark a place as you at the time of 2.0 but i remembered how it felt, and had the same dilemma with letting go vs holding on with cocona. and i feel the same seeing her back. glad you’re still here 🫂!<",
            ">!Just want to say, even if we don't know each other, I'm really glad you're still around. I'm glad you chose to hold onto Cocona, and I'm glad you chose to hold on yourself, too. I hope you also have a wonderful day/night/whatever time it is where you are!!<",
            ">!I don't have anything smart to say about this. I just wanted to say that both yours and Cocona stories were touching. I kept pressing the choices to make her live, because i know that, while suicide is the end of pain it is also the end of joy, happiness and anything good that you might experience in the future. And that's lame af. I'm glad i got to watch her sing.!<",
            ">!sad that we can't see all the stonehearts transform together though!<",
            "Whoever started the hype around \"hunt-focused gamemode\" was truly a minion of Enigmata, seems more like a \"match the weaknesses or else\" type of thing based on the first one. 💀 Also Cocolia is kind of cruel, even after all this time.",
            "my team watching in horror as Jing Yuan gets ice blasted 6 times in a row by Cocolia then ensnared, completely ignoring my Aventurine with MoV:",
            "Why do they even play the train animation man 😭",
            "\"Oh my god is it time\"\n\nNo bitch I just decided to lag\n\n-sincerely, your computer",
            ">!Welt can possibly outlive him due to entropy shenanigans but ye that's still really bittersweet that Dan will probably live to see at least us (TB), Himeko and March either leave the Express or die off long before his rebirth cycle comes... and only Welt will be left to tell our stories until he decides to leave too.!<\n\n>!Gosh I love the Express fam so much. It's so rare for me to love every single character in these found family tropes to bitty little pieces, but they really hit the mark so hard with these five. I will be in shambles if the day comes that they have to separate. (dead Stelle on the floor emoji)!<",
            "Agree. It doesn't have to be a heal but at least a buff for the team.",
            "Energy mayhaps, for ults",
            ">!Wait until the Astral Express sees how much it costs to run and maintain the Radiant Feldspar, dreams or not - clearly this is a long con to get those 5% worth of shares from the IPO back.!<",
            "Now this is Finalityposting I can get behind. Thanks!",
            "not the 1554 days left-",
            "and upon you as well, brother",
            ">!Watching everyone panic and Aventurine, Boothill and Argenti being the weirdos that they are. And RATIO. Omg that group chat was easily the best part about the quest!<",
            ">!Ratio probably already deduced that it's nothing serious, and he's not going to participate in this farce lol!<",
            "Honestly it feels like this mode was made specifically for this",
            "7??? jesus christ on a bike. and somehow what caught my attention was them not even bothering with tingyun skill. truly unrelatable clears.",
            "I've always thought that E6 Ratio is overkill since nothing in the game could live until the 3rd FuA from his ult, but I guess now it's the trick to absolutely shred the toughness bar in AS without taking a turn. Acheron and Ratio on top ☝️",
            "Ratio stonks rising ✨️",
            "Perhaps I've been an origami bird all along and never knew..",
            "on all levels except physical, i am an origami bird",
            "...Oh, that must be why I like them so much.\n\n....Pwo wo wo ?",
            "god damn it, Ourgenti didn't deserve this 😭",
            "They don't record lines for individual patches, but for larger batches. If something went wrong with the recording they can't fix it until they can rerecord the lines. Which can affect several patches.",
            ">!Filler episode not related to the main story that gets aired because anime ran out of manga chapters!<",
            ">!You know, we *do* have a way to make the Luofu come to us, and this *is* kind of an emergency...!<",
            "Who allowed her to have so many actions?\n\nAnd there's no Bronya either, imagine if she was there too.",
            "Headcanon accepted. LMAO.",
            "STOP WITH THAT you'll win this!!!!!!!!",
            "Geppie is just a dude, dude-ing it up.",
            ">!Not just a \"k\" but it's also followed by him leaving the group chat immediately.!<",
            ">!I think it's more of a foreshadowing for future plot instead of something they want to explore right now. They're just building up the Strategic Investment Dept. vs Marketing Dept. beef™️ for future IPC arc!<",
            ">!they are working together now, bh said that aven will help him found oswaldo, probably a future plot point!<",
            ">!There was a discussion in the bar before the charming festival where you talk with Aventurine and Boothill and they tell you about the situation, this is likely a *later thing*.!<",
            "They've definitely taken notes from HI3 on that one. It needs work, but overall a great feature for casual players",
            "Stuck a note with some nasty slurs on her back.",
            "Do it for her (picture of stellar jade)",
            "I'M GETTING MURDERED BY GUMBALL MACHINES",
            "Did you know that Nanook once met a billboard? THEY ascended right there and decided to destroy all life because of it.",
            "This is legitimately cursed oml",
            "This sounds really funny but I'll probably be mad when I get it without thinking",
            ">!Hard agree with what you said, average Otto pfp W take. Adding on to the Jade bit, if the IPC was planning to take over Penacony, wouldn't they have... you know... planned in advance? Why was Jade's plan hinging on Robin's intel? After all that set up with Aventurine they're making the stonehearts look so silly 😭 Seems like a classic case of Hoyo dumbing down the story for its audience, or its just lazy writing, either way people will still find ways to misinterpret it!<",
            ">!Yeah I'm honestly tired of how hoyo's idea of how to write smart characters often just is to have other characters gushing about how this character for sure is really intelligent! Please believe us! Whenever they actually do something that actually could show them as smart it's off-screen or you can only read about it from their character stories, readables, etc. They do emotional stuff well, especially in the companion quests, but geniuses (at least when they want to make sure we know they're super smart) really isn't it. Often I end up thinking \"wow this just doesn't make sense, are they actually stupid?\" instead.!<\n\n>!The entire thing with Sparkle's bombs felt a bit weird, I was half-expecting Firefly to reveal she's actually Sparkle in disguise at the end there. I got the impression the doll-hunt may not have happened like that but honestly who knows. It was treated afterwards as real, kind of. I did overall enjoy the epilogue but there were some parts that really didn't work and again there were parts that felt like they were there just to waste time while still feeling like it was a bit rushed at times.!<\n\n>!Sunday's EN voice actor is really good, I've actually been really impressed even though the character itself isn't a fave.!<",
            "There's still a chance for it when the first megathread inevitably gets taken down before her banner is over",
            "We should get more discourse so we get to see all the different megathread names",
            "Still plenty of time to tag MHY on the comments and reroll on megathread name (dont actually do this)",
            "I respect that the easy access beta person didn't feel like putting in effort for 2.4, it's their call, but...man it feels bad.",
            "There is definitely a higher barrier to survival in AS compared to our other game modes. You also have to play a bit differently compared to what your used to. Like instead of making sure your buffs/debuffs are up for your carry's damage its much more important to deal as much toughness damage as possible. For example on side 2 I was regularly ulting with Jingliu to enter her enhanced state to just deal more toughness damage rather than worry about dps efficiency.",
            "lmao I love how the TB is really converting the passenger cabin's hallway into their own megaroom.",
            ">!tbh i was hoping to see a ratio ducky even though i know he's not a genius and therefore would never get to take a major hand in the real SU 😭 also yea i feel like DU can be summed up as \"cool in theory but atrocious in execution\". kinda disappointed ngl 😞!<",
            "I completely forgot we used to have companion quests in this game, lol.\n\nI think maybe the reason they stopped doing them is they were replaced by the new \"point of view\" main quest style, where you play as the featured character.",
            "Remember when we had a companion quest for a 4 star character? Good times",
            "18? In a row? Bro go ahead and buy a lottery or something",
            "I'm thinking they give the simpler tasks like UI design to interns and trainees. Because the UI design is less intense and probably requires less handholding it may well be the main or only task these guys get to do, so they put their whole ass into it.\n\n\nAdditionally, I've heard Hoyo has a good reputation among job seekers, so they probably get the good recruits who figure that shit out and make it clean. \n\nAlso also, they expanded a lot a couple years ago, so they probably had an excess of those recruits with a lot of time to be perfectionists.",
            ">!yeah I've been wondering why boothill didn't get a companion quest. some characters like aventurine clearly had their quests integrated into the story but like... where are the rest of them!<",
            ">!argenti the whole entire penacony arc: 💀!<",
            "I wonder if it's ever happened before. This is the first/only instance I know about, but yeah it's unfortunate. Really looking forward to Yunli and would like to see how she plays. Understandable that they don't want to do it though, if they're not interested.",
            "Even if he’s just a pela clone, there are some comps where I want to run 2 pelas.",
            "Remember, Black Swan is only 10% better than Sampo",
            "Jiaoqiu fluff ~~only~~ 10% better than Tingyun- must pull",
            "Most understandable Xienzhou backstory.",
            "MDZS COPYPASTA IN MY HSR LEAKS MEGATHREAD???????? I LOVE YOU LMFAO 😭😭😭😭😭",
            "this is completely not the point but Yingxing being Yunli's uncle absolutely has me in pieces 😭😭",
            "He's taking a nap after eating too much",
            "gee, cocolia, how come mhy lets you attack *7 times in a row*?",
            "I don't know how they let her into the game like this.\n\nAnd she just got a new endgame mode she's even better in",
            "Huohuo deserves it.",
            "Boothill, and then hes like, oh shit, my synthesizer is working! But then he trips or something and it breaks again",
            "Obligatory Boothill Answer",
            "Whoever gets to off Oswaldo Schnider should have the right to say \"fuck you\" before they pull the trigger.",
            "March, Clara or Robin\n\nit just sounds perfect\n\nEdit: On second thoughts, I want a myriad celestia where someone gets destroyed by the abundance denizens, goes \"FUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUCK YAOSHIIIIII\" on a cosmic scale and ascends to Lan the Hunt. Now that'd be pure fiction\n\nOr Nanook",
            "Gonna love using Ratio+Jiaoqiu+Robin and getting to gamble 4 technique points on Aventurine. ^(Or just trying to get the heart pose from Ratio statues for good clear luck.)",
            "i love elegy honestly. goth girlboss\n\nand i figured the weird sounds in the stages is the bg music in reverse + added effects to make it extra creepy. i love that too ngl. everything about the finality is great. peak lore give me more of this stuff hoyo",
            "2.3 story >!We were clearly warned that the Express was running out of fuel but nooooo!<",
            "The flavor text when you use the Training Doll that forces you to auto battle is neat too.\n\n\"*You have no authority to intervene\"*\n\nAight bro chill.",
            "Just get Yunli's LC. Best of both worlds.",
            "HM7\n\nHM07\n\nThank you Hoyoverse for making March learn Waterfall. Now I can travel more in Scalegorge Waterscape🙏🏽",
            ">!what’s so fascinating to me about sunday is that he is both malleable and rigid. he was under the influence of the order but he maintains his own unchanging ideals. there’s this religious philosopher, simone weil, who said something like “the existence of opposite virtues in the soul are like pincers to catch hold of god” and i think it’s so sunday.!<\n\n>!that’s why it’ll be super interesting to see where he ends up. it’s not clear (i really wish we had gotten more in the epilogue for this reason) if other characters still consider him a threat or if he’s devolved to a bargaining chip, but there’s certainly a struggle over his fate and considering his beliefs i wonder who will win. the stellaron hunters seem almost diametrically opposed to his ideals so joining them never made sense to me, but i guess it could be out of desperation or repayment. (with freedom being such a vital component of penacony’s story, that kind of arc makes sense.)!<\n\n>!overall i’m just hoping he doesn’t get sidelined indefinitely like jingliu and luocha. there’s so many stories this game could tell!!!<",
            ">!I wish we could spend some meaningful time with her at all. She seems so important but got sidelined almost as much as boothill!<",
            "I hate how the \"idea\" behind it is to form a team around the equations you get. It's like the game chooses the characters you play instead of the other way around like in normal SU where I can choose the path",
            ">!I might be overthinking this but like I really love what I think it means. That Ratio said that one letter to acknowledge that he understands and to not waste any time searching for the bombs. Like it fits his character so well.!<",
            ">!She's already pretty nightmare-inducing, her HP aside. She eats SP, lowers your HP and can spam her big aoe attack... they can make her eat your energy too, as a treat 💀!<",
            ">!When the flower takes a skill point, it also taunts the target 💀💀💀!<",
            "🕯️🕯️🕯️🕯️🕯️🕯️🕯️🕯️🕯️\n\n🐦‍⬛5\\* Moze pls, thanks.🐦‍⬛\n\n🕯️🕯️🕯️🕯️🕯️🕯️🕯️🕯️🕯️",
            "Yeah I joked about this when I first saw the LC, but its a very real possibility.\n\n\nI do think the whole 2 stacks thing is supposed to be the way to make it better on Yunli than Clara, so hopefully they leave it as that and don't try to make it worse for Clara.\n\n\nThey could take the taunt away and put it into Yunli's traces, thats probably a worst case scenario for Clara (that or they make it ult dmg).",
            ">It depends on your account folks\n\nwhat depends on account is if you can or cannot clear, liking something is a different thing oO\n\ni could clear all PF full stars from the start till now, but i hate it with a passion. \n\nill probably hate ass too when ill try it because it was already clear when we saw the first leaks about it that it was gonna be PF 2.0 with extra bullshit .\\_.'",
            "Thanks, Argenti.",
            "The amount of actions she keeps looping are basically an innate Bronya, but at least she doesn't dispel your debuffs I guess.....",
            ">!You know what they say, when a poor man gives you 10k, it means a lot more than a billionaire giving you 200k!!<\n\nStill love you, Aventurine.",
            ">!😭 it's not like people in Dreamflux Reef are rolling in cash...!<",
            "screwllum has a monocle o_Q screwbros stay winning",
            "Inside me are two wolves\n\nOne of them wants this terrifying man to drop the crit scaling completely and fully go into reverse Black Swan territory\n\nThe second wolf really doesn't want to pull E2 and is worried he'd lean more sub dps if they dropped E2 into his base kit.\n\nThey're both gay.",
            "Yeah, I enjoyed Penacony as a whole but there are serious issues with pacing in certain parts lol it's crazy to me that they felt the need to include a lot of puzzle solving in the middle of the story and I wouldn't mind it too much if it didn't take forever to get to the point 😭\n\n2.3 spoilers\n\n>!What bothers me the most is how certain parts you'd want to see are solved off-screen like Aventurine getting saved by Argenti, Firefly's 2 other deaths, and most importantly the fudging Stellaron getting sealed. It's like they knew the quests had gotten too long so they decided not to show some scenes but like,,, it wouldn't be too long if there wasn't too much padding in useless scenes (will forever loathe the audition parts)!<",
            "I agree with pretty much all of this. I wrote about my disappointment with 2.2 [here](https://www.tumblr.com/willfulabyss/753673306757087232/major-22-main-story-spoilers-ahead), and 2.3 just continued this trend. It really, really feels like 2.0-2.1 and 2.2-2.3 were written by entirely different writers and that the latter group took a hard turn to try to soften the story.\n\n[2.3 main story] >!My biggest issue is with the pivot from murder mystery horror Disney with trappings of anti-capitalist/materialist satire to generic, flavorless video game fantasy. Throughout 2.0 and 2.1, I was engrossed in the lore of Penacony, doing all the side quests and feverishly hunting for all the readables, trying to piece together this place’s history. (And there were so many eerie moments, like the weird Clockie with the Bizarre Tape that depicts an actual scene of carnage or that one-time interactable in the Dreamscape hotel that shows a chilling flashback of a prisoner getting shot dead by a warden for drinking SoulGlad.) But after 2.2, I just… lost interest because there’s apparently not much scary about Penacony after all. There was so much *atmosphere* and buildup in the first two patches, yet it inevitably went to waste because the vibe changed entirely once we learned that Misha was actually *totally* fine, no trauma here—in spite of the horror of A Child’s Dream and that freaky first encounter with SUD. I already talked about my disappointment with Misha’s story in my previous post, so I won’t go into that again. But it bears repeating: If you’re not going to give a horror/mystery payoff, *don’t do a horror/mystery setup!* A good part of my disappointment stems from that tonal bait-and-switch.!<\n\n>!Conceptually, I like the *idea* of learning about the previous Nameless, but while Tiernan’s piece was woven really well into the narrative, Razalina *barely* existed, and Mikhail’s was tied up in the whole Misha disappointment. And 2.2-2.3 quests spent *way* too much time waxing poetic about these former Nameless when only one of their stories was actually compelling (and only really the “afterlife” portion of it). That time, as well as all the filler fluff with the SoulGlad competition, would have been better spent developing the other characters and tying up loose ends (of which there are still many). The timeline of Penacony is still a confusing, nonsensical mess with people who should have been long dead during certain eras still existing despite not being indicated as long-life species. (I haven’t done any of the side quests from 2.2 yet aside from Dreamjoy Memoir and the Dr. Blues quest, but I’ve seen it said that apparently, you can just… give up your physical body and exist forever in the dream world? If that’s the case, that’s 1) playing way too fast and loose with the narrative, AKA too convenient for the writers for my preference, and 2) never mentioned at any time in the main story or major side quests despite greatly affecting understanding of the main story. Also, why is Mikhail’s corpse just… in there if it’s a dream? And will it remain there forever…??)!<\n\n>!Aside from Robin and Firefly (who I largely agree with you on), Gallagher was another whole mess of a character. We get that insane cutscene at the end of 2.1, and it amounts to basically *nothing*. As for his character, I still don’t understand what exactly he *is*. His last character story implies he has an original self and that sense of self largely resonates with Gallagher. Yet it also seems to be implied that he was a fictional character created by the History Fictionologists (another element that, while conceptually interesting, feels like the writers playing too fast and loose with the narrative—if anything can be justified as “this faction just made it up,” it allows for easy retconning and hand-waving). If that’s the case, why was Gallagher created? How did he get to know Mikhail and why? Also, he apparently died in 2.2, but I didn’t even notice. What was up with that? Anyway, I didn’t need him to be the main villain (or even really a villain at all), but I wish that antagonism he showed toward Sunday at the end of 2.1 amounted to… anything at all? Inevitably, he feels like a “convenience character,” just there to guide us to our next plot point and info dump a bit. And that sucks because he has a great design. I don’t think it’s ever explained anywhere why he starts to Hulk out in his idle animation before keeping it at bay with whatever’s in his flask. I had been speculating that he was actually Hanunue due to his intense hatred of the Family and loyalty to the Watchmaker and also that he was a Borisin, hence the dog/wolf aesthetic that both he and Hanu share. I mean, it would have made so much sense! The weird transformation he was suppressing, the fact that he’s an Abundance unit, and him being alive from the Prison Era (because Borisins are long-life species blessed by the Abundance)—it all fits. But no, he just ended up as another underutilized character with a great design and indistinct origins.!<\n\n>!Overall, I’d give Penacony 5/10 (though my current disappointment wants me to rate it lower). It’s hard-carried by 2.0 and 2.1 and *especially* by Aventurine, who was the real standout and the only character who made actual good use of the POV switch. If this is how Shaoji writes male characters compared to female characters, perhaps he should hand the ladies off to a female writer? I feel like sometimes, men who write female characters are satisfied with them just being “nice” and “cute” and fail to develop them much beyond that (obligatory “not all male writers”). I got similar vibes from Firefly as I did with a certain creator’s pet from the game 999, and that’s that the author liked the character too much as a romantic interest and not enough as a character. Rather than showing us why we should like them, they instead give them lots of informed attributes and forced-shippy moments with the self-insert. (Firefly was a much milder example of this, but she did have shades of it.) From the special program, I really got the sense that Shaoji is a serious writer and that he has a lot of passion for his craft, and as a writer as well, I really respect that. But I think you’re right; somebody needs to take the reins from him occasionally and tell him “no.” I think he’s a talented writer, and I look forward to seeing more from him, but I also think he needs an editor’s firm hand to guide him away from some of his own self-indulgence. It’s also good to know that this isn’t his peak and that he’s capable of more.!<",
            "> his top half is slutty and vulnerable\n\n*wheezing*",
            "So many open toed shoes, loose clothing, long hair not pulled back, etc. They are all getting banned",
            "Sampo: banned for selling lab supplies and trade secrets.",
            "just got hit with a vision of SAM trying to work in a fume hood",
            "Tip\n\nThe game server is currently undergoing maintenance until 2024/06/18 23:00(UTC-5). See the official notice for details.\n\n❌Confirm ✅Go to the official community",
            "That's the magic of Dr Ratio, he catches your eye because funny name chalk man, and then he springs actual fascinating themes and personality on you.",
            ">!Firefly does seem a bit disapproving of Elio/his way of life in her voice line about Blade, where she says he won't become \"Destiny's Slave.\"!<",
            "Me, an Argenti owner, a Boothill owner, and soon a Jade owner: ^(at least i get free support credits...)",
            "Thanks for doing this work! Interesting stuff! What do the LC banners look like? If it's a lot of work you don't need to bother just because of my curiosity. \n\nArgenti and Boothill had the problem of highly anticipated banners coming out right after them, with Ruan Mei and Firefly. I'm sure that affected things a lot for them. Especially poor Boothill. I've seen so many people saying stuff like how Firefly was instantly powercreeping him.",
            "It's really not THAT hard until the last stage so if you can't clear that, you still get all the rewards you would get from clearing MoC 12 before since the extra 80 jades are tied to the last stage.",
            ">!He even has dog paw prints on the bottom of his shoes!!<",
            ">!Ok, that would actually be very fun. It'd even be an interesting reference to one of Hanunue's potential origins being that he's just a mythologised wolf.!<",
            "unfortunately agree, i've loved all the su expansions so far but du has just been really tedious. there's no starting path and no path-banning system so your odds of encountering blessings you need are pretty bad\n\nyou don't even get the 5 star equation until after the first boss anyways so it's kind of a struggle to get a good build when you're not even sure what you're trying to build",
            "ngl, i'm not really enjoying du either. usually, i absolutely *love* su and its expansions, it's my favourite game mode by *far.* but du is way too luck-based, imo. equations are an interesting concept and i really like the curio synthesis mechanic too, but there's way too much rng involved in pretty much every aspect\n\nmaybe my opinion will change once i max out the inspiration circuit and/or move past threshold protocol 4, but this is how i feel right now",
            "Yeah it's always been like this since it first came out. This adventure game is by far the easiest one to complete 100%.  \n  \nThe number of colored dots on each ring basically shows how many FULL segments the pointer will continue moving after you press the button.   \n  \nSo if your target ring has 3 dots on it, then you want to press the button when the pointer is 3 and a half segments away. It will complete whatever non-full segment it is currently on, then travel 3 more full segments.",
            "further 2.3 story spoilers\n\n>!\"The abilities of the Ten Stonehearts' cornerstones are all different. Some can even read your thoughts, grasp your desires... So be careful...\"!<\n\n>!Very obvious \"this is what Jades cornerstone does\" loredrop is obvious, but I love it, really plays into the Jade is The Devil motif lol!<",
            "2.4: Selfful Sufficershine",
            "It looks normal! Mobile has this kind of issue for me too but it shows fine for others apparently.",
            ">!I like to nominate Ratio for the group, but he'll probably go insane dealing with Boothill alone,..!<",
            "We only treat lightcones like weapons in casual conversation (they are), but sometimes I randomly remember that they're actually fragments of memories and moments that did happen in time, and just fall to my knees at Walmart thinking about the specific memory saved in some of my favorite ones. >!For Tomorrow's Journey!< is definitely one of the most heartwarming and heartbreaking at the same time - >!I keep thinking that since we lowkey agreed to let Black Swan and the Forgotten Hall meme to harvest our memories, these moments we're living with the Express crew will end up in lightcones like that one some day. At some point in time, future Trailblazers will find a lightcone with TB, March and Dan joking and laughing like Mikhail, Tiernan and Raza, and *oh lord* my feels can't handle it.!<",
            "*that's suspicious... that's weird*",
            ">It feels like she will come running after me if I turn around\n\nI wish she did that. Please call me, elegy",
            "Sunday said Ena's dream has to be perfect ",
            "Honestly they can get rid of the 15% ult vulnerability on ultimate. Is so niche, just give another universal buff in exchange. I dont even think this hurts Acheron that much, while Jiaoqiu keeps the \"enemy gets a debuff on their turn\" part of his kit, he will be the BiS for acheron, no question on that. So the rest of his kit can be made for any general DPS who trives on debuffs (cof cof Ratio), but also future debuff centric characters.\n\nCant wait to see what they will change on V.3, this two weeks will take forever to come...",
            "You still need to do your 14k points in SU/DU weekly anyway.",
            "new Sparkle video/2.3 spoilers >!Meanwhile me watching the JP version of the video and they use Stelle. Ladies, is it straight to be princess carried by your mechasuit-wearing bestie and fly through a fireworks-filled sky holding hands? 🤔!<",
            "hsr for the gays hard confirm\n\n*this is a joke....unless--",
            "Join us in the \"DU made my builds worse\" club we have free cookies!",
            "Apparently one of the big showcasers doesn't care about the new characters and the public private servers aren't available yet.",
            "I remember  someone in the thread saying they will set up a server when V3 hits, cause anything before that is not worth it.",
            "person who sets up the private server doesn't think the new characters are interesting enough, so they're sitting out this beta",
            "The dude who set up the server for people to use the last couple patches didn't for this one.",
            "I ate it for my March 8th sorry",
            "One hour until my eternal nemesis, *that damn train shooting off into the light*, returns to taunt me,,,,,",
            ">!just means more story to come!<",
            "If they are also the one that added the flawless achievement without any way to tell if a stage was already completed flawlessly....",
            ">!It really hits different seeing TB's actions from a third person POV 😆!<",
            "i think the stellaron is moved to the front or back depending on how powerful and well-connected the world it lands on is. on belobog, the stellaron was more of an otherworldly, unconquerable power that corrupted the minds of its leaders. whereas penacony and luofu both had the knowledge and ability to subdue them but faced antagonistic factions who exploited the stellarons’ powers. \n\nWhen we first meet Yukong she states “The Xianzhou Alliance knows what a Stellaron is and is more than capable of handling it ourselves.”",
            "ice - ice - ice - normal attack - normal attack\n\nand then add another five actions during her final form\n\nmaybe march was right to shittalk cocolia after her death",
            "Aeon of Action Advance fr",
            "Yeah, “Hunt mode” rn feels like a big joke 💀 people are saying it’s not BE-oriented, but tbh, it kinda is (the major mechanics being focused around breaking the boss asap and getting free SPs and ultimates from it, which seems also to be the case for 2.4 AS)",
            ">!cannot agree more, it's easily one of the best parts of the quests bc of how unexpectedly funny it is 😭 i don't usually like how fast the chat goes but in this situation it was perfect bc of all the chaos heheh!<",
            ">!i thought so too 😂 though i misinterpreted it a little, he did help find some dolls later on (boothill mentioned it in a later update in the gc) ratio is just really that introverted but still managed to assist them lol!<",
            ">!Yes that scene just felt like it was a last minute addition to me. Like you said, it just made all of them look silly. Her scene with Sunday was so much better - I like that the devs leaned into her devil imagery (with the snake and the apple) going to an angel that has fallen from grace. It was so simple, and just a few minutes long, but it sold her character to me much, much better than the entire what? 30 minutes with Oti did.!<",
            "There has to be someone else, no way it just dies with one person not feeling it  💀",
            "At least Argenti got that one companion quest back in 1.5.\n\nThe only time where his voice worked properly might I add.",
            ">!this is a really good writeup, Gallagher is such a wasted character honestly, so much more they could had done with it, definitely feels like two different groups of writers handled it!<",
            "it's the guy who makes the private servers who isn't interested in new characters rather than a showcaser \n\nhttps://i.imgur.com/4OKCnj3.png",
            "I owe an apology to March.\n\nI should have known she would never have said something like that without a good reason.",
            "bruh\n\nThat's just annoying honestly, it reminds me of how Overtime refused to sub KR series because they \"looked bad\" so we had to rely on subgroups like EXCITE to get anything at all."
        ]
    },
    "[SPOILERS] 2.5 Beta Character Appearances": {
        "title": "[SPOILERS] 2.5 Beta Character Appearances",
        "score": 332,
        "url": "https://i.redd.it/0t4rk1ko348d1.jpeg",
        "content": "",
        "num_comments": 196,
        "comments": [
            "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "Tingyun with four tails? I'll take your entire stock!",
            "Moze slowly and slowly becomes Sunday what is happening",
            "Text\n\n> Feixiao\n\n-Hairstyle: White-gray high ponytail with deep blue highlights at the ends. The bangs transition from light white to gray.\n\nWeapons: Dual-bladed axe and two gunblades.\n\nOutfit:\n\nBottom: Black shorts exposing the thighs, with two rings on the left leg and a blue inner layer.\n\nTop: White and gray trench coat similar to Dan Heng's style, not exposing the upper body.\n\nBoots:Long, simple boots.\n\n> Lingsha\n\nHairstyle:Long black hair, inspired by HI3's Fuxi or Nuwa with minor changes.\n\nOutfit:\n\nTop and Bottom: Black and white clothes with arm bands, similar to Tingyun.\n\nLegs: Exposed legs with a leg ring on the left leg. Hands and feet have a gradient red color, referencing Genshin Arlecchino's black hand.\n\n> Tingyun's New Form\n\nOutfit: Long black dress with a waist cincher. The chest area resembles a crossed collar style, with the upper chest exposure similar to Genshin's Raiden.\n\nHairstyle: Long hair, white with a hint of pink.\n\nBody Features: Bare legs, at least four tails.\n\n> Moze\n\nModel: Male.\n\nHairstyle: Hair color similar to Sunday, with typical forehead and eyebrow bangs.\n\nEyes: Purple pupils.\n\nOutfit:\n\nTop: Dressed conservatively with a hood. Shoulder armor with three purple-black feathers.\n\nAccessories: Wearing black gloves with a silver finger guard on the right hand.\n\nMuscular build visible through the clothing.\n\n> Another Information:\n\nFeixiao and Lingsha will appear in 2.4.\n\nTingyun's new form may undergo modeling changes.\n\nThe three female characters have the same model types, with Feixiao not being a lady model.\n\nSunday's release is far off, with a higher likelihood of changes compared to Tingyun's new form, and is currently not in black clothing.\n\nSource: Uncle G7DD8tV",
            "Sunday not in the black outfit (stc)",
            "Tingyun sounds amazing.",
            "Reminder that this leaker has like a 100% record with leaks so far, so this is all probably true 🌚\n\nEdit: his record [1](https://www.reddit.com/r/HonkaiStarRail_leaks/comments/1dadjv9/information_about_future_xianzhou_characters_via/) [2](https://www.reddit.com/r/HonkaiStarRail_leaks/comments/1d9kveh/hsr_23beta_spoiler_about_the_23_storyline_via/) (2 has story spoilers) [3](https://www.reddit.com/r/HonkaiStarRail_leaks/comments/1bvfj28/about_march_7th_via_hxg/)",
            "oh i need to see moze",
            "Pinkish hair and four tails ? Tingyun turned into Sakura 😭",
            "i liked Tingyun with her brown hair tbh\n\nalso her personality is very endearing, i'm a little scared they're gonna completely change her into a new character, would make me sad",
            "Feixiao!! She sounds awesome looking from the details and like some weapon master? Maybe?? Excited to get more info on her.",
            "four tails? alr im sold",
            "4 tails??? GODDAMN say less",
            "white hair tingyun!?!? dammit release fast hoyo!",
            "I'm a bit worried ngl over all these design choices, but aside from that 4 tails got my curiosity. Moze seems very cool too.",
            "...let me see Moze. That's all I want. I care about nothing else.",
            "Her four tails will be the same size as her normal tail surely",
            "I didn't even notice that on official reveal Feixiao seems to have something like a high ponytail, but it is slightly visible next to her ear",
            "Girl I hope the muscles aren't the only part that's peeking through in Moze's",
            "Feixiao has three weapons?? Looks like the summons being related to each weapon might be true after all. Small summon for gun blades and big summon for axe probably. Axe is probably for skill/enhanced skill.",
            "Moze  design 🔥🔥🔥🔥🔥🔥🔥🔥🔥 \n\n\nJust at least let Sunday come out before 3.0.",
            "Feixiao has an Axe and 2 gunblades?!?!? AAAAAAA!!!!!\n\nAlso does this mean all 3 girls are march/RM/FF Model and that Feixiao is not Kafka? Not sure how each model is named lol.\n\nMoze crumbs are good and Sunday crumbs even more welcome!! Not sure what they Sunday stuff means though is 2.7 speculation still valid?",
            "ahh yes ofc the arbiter general of the xianzhou yaoqing is required to expose her thighs for practicality and safety measures, very realistic. /hj",
            "Tingyun sounds so beautiful wow. I really want her to have a personality change as well",
            "BRO WHAT ARE THEY DOING TO MY BOI SUNDAY 😭",
            "Moze's muscles are visible through the clothing you say?",
            "Sees Tingyun 🧐 Oops I spoiled myself.",
            "God, that Moze description… if he ends up a 4* I’m gonna throw up. 😔",
            "\"Muscular build visible through the clothing\" YEZ. YESZZSZZSZZ. 🤤. COME HOMW MOZE OUR ALHAITHAM AT HOME BUT ELECTRO. COME HOME.",
            "FEIXIAO WIELDS GUNBLADES LETS FUCKING GOOO",
            "No info on Huaiyan, sad",
            "Lets hope they step up the writing this time and redeem Xianzhou's 1.x story.",
            "8,5/10 fanarts when",
            "Holy these leaks are so good. 2.4 leaks felt kinda stale for me, but this post answear many question that some players and i have. I really wanted to know more about feixiao, tyngiun and Sunday, because i can t get every character and leaks kinda help me to manage my pulls in advance.",
            "TINGYUN FOUR TAILS???",
            "Pink hair Tingyun? Oh nooo. My weakness.",
            "Feixiao:\n\nMedium model, ponytail, white hair, fox girl, wields a giant axe, FuA main dps?\n\nHOYO! HAVE HER VOICED BY TARA PLATT AND MY SOUL IS YOURS!",
            "I want lingsha to have dead eyes like hanya and i will 100% be pulling",
            "Feixiao another character with shorts and a long coat all hope is lost please look at Acheron",
            "Finally some Sunday crumbs (not on a Sunday this time), I was starving",
            "TINGYUNNN!! MY WIFEYYYY !! 😭😭😭 I knew you would come back.",
            "New characters look impressive! Can't wait to see their skills in action",
            "Gotta have to save for Tingyun fr, if she happens to be a 5* variant.",
            "Hopefully, we get the elements of 2.5 characters possibly 2.4 V2 this Monday along with their pre beta kit",
            "In myth fox having multiple tails is like, mega big deal which most of us already know. The question is the hell did she do to even achieve that???",
            "Fox? With pink hair? Hmmm",
            "Fu hua when",
            "Noooo, what do you mean Tingyun won’t have her brown hair anymore? 😭😭😭",
            "Tingyun  5 star ? SOLD",
            "T I N G Y U N ? ?",
            "Feixiao - wears shorts\n\nYe that's reliable lmao",
            "Fexiao is sounding promising… also Tingyun… wait for me",
            "Yes please I need my girl Tingyun to comebackkkkk",
            "DUUUUDE!",
            "Moze having similar hairstyle to Sunday.\nBlack Coded outfit\nNow if Sunday is Moze, Sunday is actually jacked underneath his clothes?!",
            "Dual bladed axe and gunblades seems super interesting. This thigh showing short a bit too much unpractical imo",
            "When I first saw Feixiao's silhouette it really reminded me of gunbreakers from ff14, I'm shocked she actually is one lmao",
            "is it bad that I want all of them",
            "Tingyun with FOUR TAILS? She already dominated the competition with ho big her tail is how the fuck is this fair.",
            "Lingsha continues to sound more and more like [Fuxi](https://imgur.com/a/SAghTfT) and [Nuwa](https://imgur.com/a/2x2uQEC). Not just the hair that was confirmed by the official silhouette reveal already but also the black and white clothes, exposed legs and potentially gradient red colour on hands and feet if it's meant to be something like a snake's, like the scales on Fuxi and Nuwa's arms. [With one of Nuwa's stigma arts also depicting her as half red snake.](https://imgur.com/KWjgiT1)",
            "Shorts, long boots, no upper body exposure???? Sign me the fuck up for Feixiao hype train!!!",
            "Moze has muscles visible thru clothing? I'm finding that hard to believe when his silhouette is rather slender.",
            "L-Long black dress? LONG???? I got my bearded muscle daddy, and now i will get my long dress mommy? PLEASE BE TRUE  \n\nThey said i was a fool, they said i was insane",
            "Change of plans I'm getting Tingyun LETSGO",
            "4 tails? I feel like this is fake. A foxian looking this mystical she should be atleast an emanator or something weird/special. I want it to be true tho",
            "Feixiao weapons reminds me of Fie Claussel, this will be interesting.",
            "How the hell did the luofu folks not get tricked by Phantiliya when TINGYUN HAS FOUR TAILS",
            "I'm interested in Tingyun new form.",
            "Well the Feixiao design is starting to lineup with her kit i feel like having gunblades and dual blade axe makes me think she could be a stance change unit\n\nLingsha will probably look like Arlecchino based off of that? Maybe an expy\n\nMoze sounds like the typical cold asf assassin getup\n\nTbh idk if people can handle white haired Tingyun lol\n\nThey sound pretty sick waiting on some artist interpretation of them, but also figured Feixiao and Lingsha would show up in 2.4 kind of makes sense probably representing their ship",
            "sunday fans on >!suicide!< watch 💀 inb4 we see him at amphoreus",
            "I LOVE YOU GENERAL FEIXIAO",
            "Feixiao be like: maid to lady to maid",
            "So ready for Her (Fei Xiao)",
            "Fuck it. Skipping everyone till Sunday and Tingyun",
            "Wait is this confirmation tat Feixiao and Lingsha are the 5 stars on 2.4? or just appearance?",
            "Damn, saving for that new Tingyun",
            "Moze visible abs copium",
            "Battle axe user LET'S GOOO\nMy pulling plans are locked in",
            "Feixiao not lady WE WON! And hopefully a few more badass armor for her. She's a general ffs hoyo give the tomboys and their fans a chance!",
            "Feixiao's design sounds so pretty, i can't wait for a reveal",
            "Can we see their designs in the next 2.4 beta ??",
            "Feixiao weapons alone make me want to pull for her!!!!",
            "How many stars would it take to make tingyun goes nine-tails mode",
            "So Fei has THREE weapons ? 🤩",
            "I tried using A.I to get some images.  \nI copied the description of the characters, and got some results.  \nShowing only the best ones.  \n[https://imgur.com/a/i-generated-possible-new-characters-design-leak-bnJwzTc](https://imgur.com/a/i-generated-possible-new-characters-design-leak-bnJwzTc)\n\nGive some opinions!!  \nP.S: Its only to get an idea of what could be their design.",
            "I hope tingyun gonna have new personality. personally, I wanna see her as villain or something like that",
            "So lingsha wasnt Llama? The siloutte had me coping...",
            "Why do I getting Yae Sakura vibes from the New form tingyun ......",
            "Ahahahaha... ahahahaha... all the white hair... I'm in danger...",
            "Ah yes, Ahri and Talon in HSR",
            "I really like Tingyun but I'm kind of disappointed she's gonna be back, it's starting to feel like there's no stakes in this game because every death is just a fake out.",
            "Let Tingyun be Destruction for Lore Reasons(Phantylia) or Harmony.",
            "Wut, what does it mean by \"Feixiao not being a lady model\"... Is lady model like march, ff, bronya, topaz?? and so her model will be like himeko, jade, umm what else?",
            "Feixiao using a Charge Blade",
            "Feixiao sounds absolutely insane not gonna lie but everyone else same thing tbh",
            "there it is, the female xianzhou outfit curse has begun. Im betting yunli will be the only distinct one among all of them",
            "Since he mentioned NuWa (idk if she is a hi3 character, im talking about mythological chinese figure nuwa) for lingsha im still holding out hope she has a snake lady transformation. My life will be ruined if she just has legs, i want my c*nty snake goddess lingsha",
            "feixiao and tingyun gonna have to duke it out who gets my jades because the rest will go to sunday",
            "Maybe Tingyun will be revived by tree or will be some sort of mix helioby/abundance power/foxian spirit, literal kitsune",
            "Definitely skipping 2.4",
            "wait, how is it possible for tingyun to appear in different form? she got resurrected?",
            "...i am calling it, that's not tingyun. I bet it's a placeholder, or phantyllia done awaken something in tingyun. ",
            "Is tingyun's new form going to be a seperate character to her like DHIL, or a different path like TB or march?",
            "FOUR TAILS??? Jiaoqiu powercrept before arrival",
            "Νo more space china, please 😭😭😭",
            "This was actually something I was theorizing. For her to come back as a 5* she's probably going to have super foxian powers of some kind, which pretty much means multiple tails in anime world.",
            "I was already sold on the new Tingyun, but it's just getting better. And then there is Feixiao and Jiaoqiu. The era of foxians is upon us.",
            "I hope 5 star Tingyun’s kit is Just 4 star Tingyun but better. Would increase Jingliu and Argenti stonks",
            ">Tingyun new form \n\nI can't wait to play the plot. It will be awkward with that foxian dude that's obviously like her. \n\nAlso will be awkward with Yukong\n\n>but we have a whole funeral and everything!",
            "Here before she has more aggrou than Yunli and the 4 stars Tingyun combined:",
            "\"My death was.... greatly exaggerated\"",
            "M O Z E\n\nM O Z \n\nM O\n\nM O N \n\nM O N D\n\nM O N D A\n\nM O N D A Y",
            "2.3 spoilers >!this was the price that Robin paid Jade!<\n\n>!Sunday will be free from jail but will become a chuuni 4 star!<",
            "I didn't understand the context a bit. Does this mean that Sunday will not have black clothes after all, or will it be black, but now there are no changes?",
            "Always knew she was gonna come back as a 5 star (hope she doesn't ruin the chances of a Yae expy tho)",
            "Wow, looking back, it seems like they make changes to March's splash art compared to the leak. There is no Xianzhou character at all. Or are they confusing her splash art with the the picture from her Ult that has Yanqing and Yunli.",
            "Story spoilers are 2 \n>!this means SH Sunday is still possibly true. I won!<\n\nI'm shocked though. This dude is like an insider or something.",
            "That’s probably why people said Yae was in 2.6 LMAO it was Tingyun all along",
            "Same here, I loved her brown hair, I don't understand why they need to change that, just give her 4 tails and new outfit and call it a day.\nI'm also worried they'll ruin her personality.",
            "Same, Moze and Sunday",
            "his crow hopefully",
            "I hope it isn't painted on like a certain someone's muscles",
            "Maybe its like bloodborne/rwby style? Maybe she, like, combines two guns into one axe?",
            "More like almost every female characters. Exposed thighs or panty hose.\n\nAlso always wear skirts or shorts.\n\nMy dreams for Feixiao looking like [Degenbrecher](https://images.app.goo.gl/rHRjDYh7ndD4cifG6) from Arknights is lost. /hj",
            "Yukong has hip windows and visible thong straps. Hoyo knows how to design characters.",
            "These characters can tank cities exploding, let's be honest it doesnt matter what they wear it's not giving any added protection\n\nArgenti does it because *BEAUTY*",
            "We knew she wasn't dead from the livestream",
            "I saved up 200 summons for e6 Gallagher...ended up with e1 acheron. If he's a 4-star I'm about to go back into hell again and we're coming out with him dammit. We're doomed.",
            "I'd love if she were abundance but more like a necro healer than just a plain healer. So with visuals and a kit surrounding that (dead eyes, drain health to heal mechanic etc).",
            "Well at least it says Feixiao isn't showing her upper body so probably no revealing cleavage.",
            "My immediate thought was Acheron and I was filled with dread. I hope they don’t mess Feixiao up as badly as they did her",
            "I genuinely don't know why people don't like this type of look 😥\n\nThe only thing I was kinda eh about in Acheron's design was the crop top, shorts + long coat combo is great imo",
            "That's subjective. You not liking it doesn't mean others don't",
            "Well Acheron has my favorite design in the game so it sounds like a you problem",
            ">please look at Acheron\n\nLooking respectfully, she's hot",
            "*New characters look*\n\n*Impressive! Can't wait to see*\n\n*Their skills in action*\n\n\\- Mirandainm\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "True, do we have a foxian with 2 or 3 tails in the game ? I don't remeber seeing a foxian with more then one tail. And normaly more tails=older,wiser and powerful",
            "I believe they have different body types according to previous leaks, Moze have the tall body type (like Luocha), while we already know Sunday's body type is medium (like TB).",
            "For you ? No\n\nFor your wallet ? YES",
            " I mean, the leaks literally say her look is inspired by them, lol",
            "My theory is that the real Tingyun actually IS an Abundance worshipper and that's why she has multiple tails.",
            "oh no... I love Fie...",
            "Lingsha looks like fuxi it literally says right there. The arlecchino similarities refer to the colors not design.",
            "i can handle white hair tingyun.\n\n\n:-)",
            "Every diehard Sunday fan saving for him, will easily be able to e6s1 him by the time he gets a banner. \n\nSo they can't be too mad about it. 😅",
            "Appearance, it lists 4 characters and no information beyond that",
            "I mean, Lingsha is the last female character mentioned and the first character to get their clothes compared to one of the generic Xianzhou lady outfits. Feixiao definitely wears something different, and Tingyun maybe wears something different (she gets compared more to Raiden Shogun than to any Xianzhou character).",
            "She is also a Hi3 character. There’s stigmata art with her bottom half being a snake tail and there’s also some with normal legs.",
            "We don’t know the fate of Tingyun after Phantlyia revealed herself. It could be possible that Tingyun is still alive somehow and has undergone some sort of “evolution” during the time between being a puppet for the Lord Ravager and up until the present, but even then her overall fate is debatable at best. We’ll just have to wait and see, and besides take all leaks with a grain of salt.",
            "She was never confirm to be dead.",
            "We never met the real Tingyun",
            "Now the question is whether she's Tingyun Tingyun or Phantylia Tingyun. I don't mind a playable Lord Ravager, but Tingyun being dead or reduced to Phantylia's pawn is still quite hard to accept personally",
            "I wonder if she is corrupted by Destruction power or something.",
            "Ultimate regenerates all allies energy to 100%\n\nSkill buffs allies with 100% of TY Atk.",
            "Well yukong has been searching for her since 1.3 and cosmodyssey outright said yukong firmly believed tingyun will return, the same cosmodyssey that mentioned the wardance and yunli, so it won't be awkward I think",
            "Imagine coming back and see all your stuffs are gone because they thought you're dead",
            "Yukong explicitly said that it wasn't a funeral",
            "Imagine she is preservation that guarantee to get hit no matter what, no skill, just trace that state that tingyun will hit by just existing.",
            "OMGGGG😰😰😰",
            "I'm thinking the black came probably an expression like 黑化 can mean so many different things other than outfit turning black. Such as becoming evil or start to having more ambiguous moral values etc etc.",
            "For now there are no changes",
            "Wym we already got Jiaoqiu\n\n>!/hj!<",
            "Which yae are we talking about? Yae Sakura, Yae Miko, or SAKURA",
            "yeah it's probably that",
            "Will she be the rumoured ice hunt.",
            "Or maybe she's like Senti from HI3, where she has all 3 weapons on hand and cycles through them in combat",
            "Every 5* female dps character has two styles within them:\n\nShort dress showing legs\n\nShort shorts showing legs",
            "image is not loading but i search it and...man, thats very close to the image im picturing her to look like. she couldve been so much cooler but alas, every female characters (and future ones) in this game atp will be set up to be victims of lingeries and ~~panty hoses~~ shorts. imagine the potential being held back if not for fanservice",
            "It took Genshin nearly 4 years to release another woman wearing actual pants, gotta give some time to the HSR designers, they're still figuring it out.",
            "explains why the whole fandom loathes her outfit so much bc she looks silly and goofy interacting with her coworkers lol",
            "Just spent 140 pulls and zero Gallaghers (but RM, FF and e1 Clara and e6 Misha/Xueyi). I don't even care much for him as a character. Just love his kit and animations. He's going to stay e4 for a long time now. 😅",
            "I don't think the shorts+coat combo looks bad but in the case of Acheron it just clashes with her character, like, that outfit doesn't seem like something she'd wear of her own will but something she has to wear because it's a gacha game and those run on horny.\n\nYou can't tell me that the woman with turbo depression, barely holding on to her sense of self for the sole purpose of killing the source of said depression, who's constantly waxing philosophical, and who's essentially a space psychopomp, is getting around the cosmos dressed like she's going to the club to twerk her ass off 😂.\n\nAs for Feixiao, it'll depend, every female character having like 10 skin-holes in their clothing gets obnoxious at some point for some, and this one's a general of a Xianzhou ship so ig the expectation is something more modest and regal compared to the usual.",
            "That is the only way that make sense to fix her broken neck I agree. Still her body was taken by destruction peeps and destruction and abundance aren't really homies as they are opposites. Really curious how the abundance/abundance emanator gor her. Or she is the one.",
            "Oh found a Zephyr comrade here! I'm skipping entire 2.4 since no one interest me, funny that if we give a short call: Fei & Fie is just so peak similarity lol",
            "Ah ok my bad",
            "I have a theory that Phantylia isn't even off the Luofu yet. She literally said the Xianzhou's end is nigh at the end of the fight and just disappeared for some reason. We know heliobi don't die so why did everybody just assume she left? Would be hilarious if Tingyun comes back and gets possessed for reals this time.",
            "Idc .... I'll take em both. As long as she's alive.",
            "Also increase the ultimate dmg! Tingyun basically becomes erudition blessings",
            "*Joseph Joestar looking at his gravestone meme*",
            "And somehow 4 star Tingyun will still get hit more often.",
            "In the End, maybe only his Haird and Head Wings became Black, to fit the Black wings of the clothes",
            "I honestly doubt it. I think Sakura will be similar to Acheron in a sense that they will take the kit idea and maybe merge it with another one. About Tingyun’s element and path i have no idea.",
            ">explains why the whole fandom loathes her outfit so much\n\nif you think reddit/twitter are the majority, you may be a bit naive",
            "No. Not really i heard 0 hate for yukong's outfit",
            "You vastly overestimate the amount of people that care about any of that",
            "Fox Fie... Fie was my Trails best girl too... uuuurgh... but my funds have been depleted by Firefly and I kinda want Yunli too...",
            "Np bro",
            "Destruction Aeon/Emanators and villains are really EDP/Box Ghost in HSR  ngl.",
            "Or just implement a foxian soothe/brain jar mechanic.",
            "[now you do.](https://www.reddit.com/r/HonkaiStarRail/comments/1dk9b7n/which_character_in_your_opinion_has_the_most/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "Yukong is like the blueprint, the only hate I've seen stems from same outfit syndrome, not.yulong specifically",
            "That would be great too. Anything to buff my Jingliu and even Argenti"
        ]
    },
    "2.5 Apocalyptic Shadow": {
        "title": "2.5 Apocalyptic Shadow",
        "score": 1263,
        "url": "https://i.redd.it/em4vb1byb18d1.jpeg",
        "content": "",
        "num_comments": 274,
        "comments": [
            "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "God forbid King scarabaz takes the stage soon in apocalyptic shadow 💀",
            "Oh shit, it's time to hear Pedujara in a proper fight again. I love that Apocalyptic plays their respective boss themes.",
            "Oh what's this? You hated not being able to move because Cocolia froze your entire team? Worry not, the next one is somehow even worse.\n\n\nIntroducing Phantylia that attacks a dozen times. If you do not have Firefly or DHIL, get ready to have no SP, no health, no energy, and do nothing but normals just to even have a chance to kill her.",
            "Lemme guess:\n\nFire and phys weakness plus if you don’t break fast enough, she steals all your SP, you can’t generate any for 2 turns, and she limits your HP bar to 1/3.",
            "OH HELL NAH YO ASS TWEAKIN WITH THEM PLANET DESTRUCTORS",
            "Watch them include Jing Yuan not being allowed to die just to mess with people.",
            "I BEG SOMEBODY PLEASE FLAG THIS AS QUESTIONABLE, THEN IT WONT COME TRUE!",
            ".... dhil stonks rise?",
            "One day swarm king will be in AS and we’ll be praying for Cocolia instead",
            "Lightning Wind Imaginary Ice surely",
            "I swear to god man if she keeps spamming the sp robbery attack my e2 dhil gonna die in a ditch and i'm not prepared for it 💀",
            "Idk who the enemies are, just make the maximum score 6000 instead of 6600 😭",
            "Phase 2 Phantylia??? Oh I'll let her destory me to hear that + that creepy ass screams in AS4 Argenti side this patch\n\nalso is this probably Sparkle rerun sign? Yk sp drain x999 and such",
            "My guess :\n1. Limit SP to 2 until flowers are broken. \n2. One unit gonna be perma CC every boss cycle.\n3. Phase switch nuke is now a normal move.",
            ">!EPHEMERAL!<",
            "If DHIL doesn't clear this easily we riot",
            "I fear Cirrus being added. What? You want your turn? no. Here, take my 24-combo attacks. Oh, you're still alive? Let me do it again.",
            "We're gonna consume our SP with this one. \n\nMy King Yuan is also ready",
            "Imagine how absurdly difficult Dominicus will be if added to AS.",
            "Superbreak Blade let’s go",
            "save me Dan il save me",
            "Ah fuck. Will she have 3 phases like story Phantylia?",
            "Blade agenda time??",
            "Someone please fire Sparkle from The devs team💀💅",
            "Oh hell naw",
            "I hope blade is still good againts her here.",
            "Why do I feel like a certain masked fool might get a rerun in 2.5…",
            "Good lord",
            "NO GOD PLEASE NO 😭",
            "NOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "Dreading svaraog boss\nAbout be apocalyptic hand with 4 hands at the same. Gotta kill them all in 1 turn or is a wipe",
            "wallahi_im_finished.png\n\nAs if Phantylia wasn't bullshit enough as a boss. Can't wait for her phase transition nuke to limit your HP to one half, her flowers to deplete your SP to 0 until you kill them, and for her to act at least 6 times in a row in her final phase.",
            "Acheron aventurine blackswan Kafka  that's it ",
            "Ah fk my fu xuan is screaming right now",
            "If it kept the same weakness as before I should be good. But knowing this gamemode the 'free SP flowers' would be nerfed hard.\n\nIf I had to guess how Phanytlias phase goes. She summons those mara strucked general and Ascended with their own gimicks. They'll definitely keep the if you don't break me flower I'll ohko your unit.",
            "I was just saying about this to my friend yesterday that I expected Phantylia to show up after the doomsday beast, lol, Sunday boss in AS when Sunday releases",
            "Mommy",
            "Welp. Time to pull out the good old reliable general",
            "Off topic but I find it kinda funny that Phantylia seem to obsessed with abundance power despite being emanator of destruction, the entirely different path herself.",
            "She has 20% phys and fire res. Would you really still bring bh/ff here? This seems like IPC squad fest",
            "Cant wait for the day doomsday beast is in AS that's about to be the easiest shit",
            "Her destruction flowers gonna kill you one by ine with an 80% health hit",
            "wait to see the buffs before panicking lol. I think the 2.3 AS turned out a lot easier than i expected it to be, though i had the teams to exploit the buffs admittedly. \n\nmight break Blade out of retirement, he was actually quite useful against her iirc.",
            "Looks like a job for Nihility Mommies + Huohuo Team",
            "Sooo when they say this its a single target mode.. They lie",
            "It's Sparkle's turn to shine ʕ•̀ω•́ʔ✧",
            "DON'T EVEN JOKE ABOUT IT",
            "Gonna need Sparkle & Hanya to Counter her.",
            "im cooked",
            "phantylia theme lets goo",
            "[removed]",
            "Me omw to get prana-siphoned 245 times in a single cycle so that my characters die without even taking a physical hit:",
            "Brother eww\n\nWhat's that?\n\nWhat's that brother?",
            "DoT fuck em up",
            "This first victim to the premium Firefly team. Firefly, Ruan Mei, HTB and Lingsha. We can finally see her peak potential.",
            "Ok holup can we have the dhil support atk plz? 😭",
            "Its Xianzhover guys",
            "This mode scares the shit out of me, Phantalya already had 3 turns in a row normally and already had annoying mechanics...",
            "So... aventurine when at this point?",
            "And they said This mode was created FOR HUNT.",
            "i still rmb the old time when this was a Loucha check",
            "Ah yes, Kafka keep making profit for now",
            "[removed]",
            "I assume the weaknesses will be wind lightning and imaginary so my dot team should destroy her. I got Archeron team just incase.",
            "I wonder if it will be all Phases",
            "NOOOOOOOOOO WHYYYYYYYYYYYYYY",
            "Yay my favorite boss 🥰",
            "Aren’t we in 2.3?💀",
            "Dan heng agenda were so Barack",
            "Save me Acheron senpai!!!",
            "Dotcheron fodder",
            "Ugh I did Mono Quantum for Cocolia (Seele-Fu Xuan-Sparkle-Silver Wolf), and Mono Ice for Argenti (Jinglui-RuanMei-Gepard-Pela)\n\nWhat team is needed for this one? Please do not be Imaginary.. :'( I only have DHIL built for that one.",
            "Oh my god😭",
            "good! challenging content!",
            "Please no 😭",
            "Hmmmn....i think im fucked on that patch.",
            "Thank god I never bothered with hunt characters. Waste of resources",
            "I mean it's the perfect weakness for my DoT team so I'm looking forward to it.",
            "We’ll finally get past the 5 enemy limit 💀",
            "For her majesty",
            "I'm actually terrified of this possibility, far above and beyond Phantylia",
            "The Starcrusher Swarm King is about to prove himself worthy of his crown.",
            "Don't be loud they'll notice you",
            "Acheron gonna eats lmao.",
            "Oh god, and I don't have a helper adventurine crutch... \n\nI should still be able to get up to 6 stars, but still, it's going to be arduous!",
            "He will now spawn true sting to deep fry us",
            "unlimited kuru works",
            "There is absolutely no way that will happen,surely Hoyo will not release a boss that most casual players haven’t even beaten yet\n\n\n… right?",
            "My Acheron + Black Swan will clear so hard it's not even funny",
            "Definitely the biggest W with apocalyptic shadow mode",
            "Hearing A Gentleman's Fantasy after so long was amazing...",
            "DHIL *solving* SP issues is hilarious.",
            "~~>Firefly or DHIL~~\n\n~~Add acheron too, since her ult is a \"wtf is a weakness type?\" button. You can generate stacks with just basic attacks on supports and Trend LC so her teams will manage regardless.~~\n\n\nWait.. the flowers don't count as attacks. Trend LC can't generate as much stacks as it does during Cocolia(Pillars and herself+gepard). I'm cooked. Fuck. \n\nJiaoqiu save me please.",
            "E1 firefly save me.. e1 firefly save me...",
            "DoT gonna have a field day",
            "Jingliu my beloved(low SP cost)",
            "My E6 Acheron's response to your comment:\n\n\"Phantylia? I weep for the departed.\"\n\nThen she forgot what this was all about and moved on with her life.",
            "Also she gets three turns in a row to planetary explode your face.",
            "She add a debuff that gray out your HP bar and Skill Point slot.\n\nThe Rerun Banner will be Sparkle.",
            "Guess which character has E1 remove SP usage? Clueless",
            "That sounds like hell on earth",
            "Probably moving off the breaking in the next round, who are the new chars? FUA?",
            "Or it makes your SP go -5. You need Sparkle or Hanya to make up.",
            "me thinkin u meant firefly boothill, but realizing u meant jaioqiu yunli, then realizing again 5/6 of our most recent limiteds are 2 elements, phys/phys/fire/qua/phys/fire how interesting",
            "E1 Firefly winning.",
            "Lmao, as a Bonus Challenge",
            "That would actually be interesting mechanic ngl. When I first fought Phantylia she keeps trying to kill Jing Yuan that makes it more difficult for me compared to other bosses. So trial Jing Yuan and you have to protect him while he tries break Phantylia’s weakness",
            "If the flowers get 30 turns in a row too, then he will be useless since you will stay at 0 sp the whole battle",
            "Is it time for second reruns to start indeed? Doomsday Beast Seele stonks in 2.4 seems more real now.",
            "I love your flair",
            "Forget the Swarm King, one day we’ll get Aventurine 💀",
            "Lightning is a given since we can't have Acheron be unfavorable in anything",
            "If anything, the score will go up",
            "I can see them put DHIL and Sparkle on the same half like Topaz/Robin lol",
            "I mean I'm pretty sure the phase switch nuke is already a normal move in her 3rd phase",
            "Cirrus in DU summoning those goddamn ice guards that delay your characters and the elite that AoE freezes you is in my nightmares now.\nGepard's action value was at 253 because he kept getting targeted T-T",
            "This is the most cursed thing, I like it.",
            "Worked once should work again 😎 so long as she doesn’t attack 865 times before we can move",
            "We can only hope that she gets 2 phases like Cocolia did",
            "Time to send them to paradise.",
            "He got me once like that in G&G, I died a little inside",
            "I was gonna say that the flowers don't actually ohko your characters, just deals too much DMG, but then I remembered we are talking about AS, yeah they will buff that attack a lot...",
            "Tbf, she's still a heliobus and would like a body of her own, and what better body than an undying one",
            "Weaknesses and Res are changed for AS.",
            "likely the other side will have either fire or phys weak. If they keep the break requirements up, it doesn't make sense to make the premiere break DPS feel bad.",
            "Yes since this is the same patch Lingsha appears. We will see the premium Firefly team for the first time ",
            "It’s in the 2.4 AS.",
            "That was always just speculation, seems it's more break focused instead.",
            "It's the boss mode. People down here saying that it's a break mode are insanely short sighted, the buff won't always be about breaking the boss. That's like saying that Pure Fiction is the FUA mode because the first PF had those buffs.",
            "It's clearly a break mode, not a single target mode. Nobody ever said it was single-target, Hoyo just said it was a \"boss mode\" and players assumed that meant \"single target.\"",
            "They never said it was a single target mode. That was just something people made up, even though we already know the current bosses all have ads.",
            "[removed]",
            "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 1: Be respectful and civil\n\n>It is natural that people have different opinions. Please stick to basic discussion etiquette and refrain from insulting or harassing others.\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
            "Ikr lol, look at Argenti summons",
            "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 4: No NSFW\n\n>Any NSFW submissions that contain nudity or sexual activities will be removed.\n\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
            "looks like dhil would actually shine in this one, cuz breaking the flowers means regenerating sp, and DHIL just happens to have insane toughness breaking in his EBA3",
            "You don't need mono teams...",
            "It just continues to zoom out with each one added. He eventually becomes the size of the regular ones when there are 50 summoned.",
            "Lore accurate swarm disaster dear god \n\nWe ain't surviving 56 seconds with this one 🗣️🔥🔥🔥🔥",
            "Erudition characters: Allow us to introduce ourselves",
            "More stacks for Acheron with BS, then  the bugs exploding and giving more stacks and spawning more in the process which gives Acheron more. Unlimited",
            "THE TSARITSA!! ^(Sh*t, wrong sub... Glaze capitano)",
            "Can't wait to hear the theme while fighting Sleepy. The first time hearing that theme it actually terrified me. Listening to the theme outside of the combat doesn't have the same mood.",
            "He solves sp issues by being the sp issue himself",
            "Then again, Phantylia is the one fight where DHIL doesn't have energy issues. The fact that the flowers grant SP on weakness break, AND they're weak to Imaginary just means that as long as DHIL can dish out his AoEs consistently, he wouldn't have any SP issues at all.\n\nThe ideal combo would probably be Sparkle + DHIL + breaking the flowers consistently + Ult whenever it's available (or run Tingyun but she might die without a Fu Xuan or Aventurine). Here's hoping that's the case for those DHIL havers and that Phantylia's strat has something for them. \n\nI'll probably just run FF though since she trivializes this mode against any boss. As long as you can survive until she can attack AKA making sure Gallagher has his Ult ready when you're low on health, you're pretty much set and can clear the mode consistently above 3.5k for their node.",
            "Flashbacks to the hell DoT PF that doesn’t trigger fua retaliations like aventurine hits or clara counter with the dot elites",
            "Jiaoqiu isn't needed but he'll laugh at those flowers taking turn and handling out free Acheron stacks for sure lol. Fake foxian facing true foxian.",
            "Cleared AS just fine with Acheron + no Trend 1st half. Total score was 7.4k  \n  \nWe'll manage.",
            "40% ice resist go",
            "Same with Cocolia. But if you can actually kill all the summons immediately you can prevent the Bosses to spam their atk.",
            "Eh, that debuff hell sounds like huohuo to me",
            "That's right, Sushang",
            "Nah, only reliable stuff is break oriented healer so break is def still on the menu",
            "If JY die: -1000 point",
            "wait ur cookin with this",
            "please don't manifest this wallahi",
            "wouldn't everyone be useless then😭",
            "Pretty sure the mechanic was that they steal SP but if you break them they give them back to you.",
            "A certain Quantum Elation Gremlin says otherwise",
            "She cant eat his stacks also Sparkle, Hanya and Tingyun exists to alleviate his SP needs",
            "Doomsday beast has quantum res",
            "Curse of Six Six Sided Dice Six Times in a row",
            "Except this time each party member must pass the die test 3x fail 1 means fail them all, all or nothing",
            "So jy and Kafka is not lightning ?.",
            "Phantylia has had lightning weakness since 1.2 buddy",
            "The next AS doesn't have Lightning Weakness any side. Bosses in this mode have like 70% RES to non-weak elements. Acheron is going to be very mid next AS.",
            "NOOOKJSDJF:LDK please no my wallet won't be able to take it 😭😭",
            "She can use it in 2nd phase too. The real shit would be if Phantylia could use Havoc without the flowers havifn to do anything",
            "Yeah it's 60% res ? (Argenti have 60% light res in as moc have 40 !20 maybe) .",
            "Ph fr?",
            "At the very least the buff is actually always after breaking the boss, you can check the leaks we have for 2.4, so Firefly+RM Super Break is basically always a guaranteed clear on one side",
            "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 1: Be respectful and civil\n\n>It is natural that people have different opinions. Please stick to basic discussion etiquette and refrain from insulting or harassing others.\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
            "Argenti: its beuty time.",
            "\"Just afk for 56 seconds, duh. What are they gonna do? Force their turn in?\" /s",
            "We 'bout to experience the Glamoth Incident with this one 💀💀",
            "Love how ppl say ''lore accurate'' for simply 10 or 50 swarm enemies, when there are legit billions of them.",
            "Chadgenti gonna protect all beauty.",
            "Of course jade propaganda 🗿",
            "imagine the herta spins",
            "Acheron seeing more than 4 swarm mobs on the field exploding which debuffs themselves + Jiaoqiu: so you're saying I get free Brain in the Vat.",
            "Hopefully. Erudition and Hunt are still too weak in comparison to destruction",
            "Pssst still wrong",
            "We must glaze GOATHIMTANO, our glorious dark blue eyed King as hard as we can",
            "Man with the sound effects of things in Apocalyptic Shadow i can imagine that would amplify it a good but lol",
            "By having a worse SP addiction than Phantylia",
            "I ran Clara too ffs, it was a phys weak PF but the fucking robot wine doesn't trigger counters.",
            "Lol true. His face expressions will be so satisfying, would look at Phantylia like \"foxian my ahh get cooked\".",
            "Mine's E0S0, almost half of my stacks are from Trend on Gepard lol. Nearly got a whole ult from it against cocolia and her four ~~co~~ pillars.\n\n\nI know we'll manage, I was just joking about Jiaoqiu and his inbuilt \"trend stacks\". I got around 3520 first half with her too. \n\nHappy cake day btw. 🍰",
            "Apocalyptic Shadow really turned out to be an Acheron/Ruan Mei check huh.",
            "Not kill, the lockon for mistral only exists as long as her summons are unbroken.",
            "Sushang gains SP instead of removing the cost, which makes her way better than Firefly due to triggering Sparkle's talent",
            "haha\n\nI was thinking Firefly. Her e1 turn her into Jingliu and e2 into Seele.",
            "Yeah. Also if Feixiao on 2.5 she also has some kind of break kit based on the early leaks (well she has everything lol)",
            "Yeah. Also if Feixiao on 2.5 she also has some kind of break kit based on the early leaks (well she has everything lol)",
            "And the Jing Yuan is like, level 50 without relics using S1 Breakfast",
            "Just increase his toughness reduce then bam a new gimmick! And for buffs you can have different options on how to use the lightning lord. One buff can Increase lightning lord’s spd and toughness reduce. The other buff can be similar to FUA buff where lightning lord strikes upon weakness broken based on the accumulated dmg by Jing Yuan’s skill.",
            "Doesnt one of the flowers drain energy tho?",
            "I just know it has some weird Quantum/Imaginary mechanic",
            "More like Acheron always good",
            "Who we got in the next AS?",
            "As in, they literally don't have the same weaknesses, the leaked Kafka for 2.4 is Fire/Phys weak, for example",
            "Yeah",
            "Herta: Kurukurukurukurukurukurukurukurukurukurukurukuru...",
            "Worst part is I'm prolly gonna have to give firefly ptsd by bringing her in there",
            "He's gonna recharge his ult just by ulting alone",
            "*Hertacopter*",
            "Imo, every erudition character should be like Argenti and Jing Yuan: At least in their ultimate, AoE attack should have fixed amount of hits. If there's less than X amount of enemies, those spare hits should be given to existing one's. That way, Erudition characters would be good in both AoE and 3-1 target scenarios",
            "F*CK THE FACT WE'RE IN ANOTHER SUB!! GOATHIMTANO ON TOP 🗣️🗣️‼️💯💯🌄🌄",
            "Yeah can run my clara ipc fua (clara robin aventurine topaz, all e0s0), and juuust manage 30k points, but then my acheron underperforms and shits the run lmao. Imma wait till my ff is half built and use her to destroy the second half as mhy intended for us DoTless peasants. I need bs and kafka ig…",
            "it's honestly more of a reading check to utilize all the buffs. lots of people without acheron and ruan mei cleared it just fine (used jingyuan and ratio)",
            "I thought I heard back then Apocalyptic Shadow was going to be the Hunt oriented mode. But here we have Argenti and Cocolia both needing aoe attacks",
            "Seems like it or maybe Boothill can do it too? Acheron seems to be doing a good job in this Apocalyptic Shadow since she's currently the only one who can dish out strong AOE and has A strong ST on top of that.\n\nFirefly on the other hand doesn't seem to do that much, not sure I don't have her. But with her Fire Implant it should be strong.",
            "And people were doubting the power of Acheron 🤣\n\nShe's going to be at the top of every AS stage.",
            "True, Sushang is the superior carry!",
            "Ah, Shushang. The only 4\\* I still somehow don't have despite having done over 2k pulls since starting in December.",
            "this was a half joke because of how obvious the answer is",
            "I honestly dont trust any of the feixiao stuff, every piece of info has been contradictory in some capacity",
            "Uhh no? \n\nUnless they added that in the AS version (haven't seen her new moveset)\n\n\nAnd if it did, at that point, Dan Heng isn't the only one who'll be useless here 💀",
            "I didn’t look at the AS version so maybe they changed it for that mode",
            "I thought new mode for break and hunt unit .\n\nBut more likely acheron,ff,rm mode .acheron is only char can break enemies without care about weakness ( she' will have hard time' if both sides enemies have 60  electric res ) she's currently best' brute force char for new mode and ff too maybe boothil but I have no hope for hunt unit..\n \n\nShe's so good in all 3 mode . thanks too her kits she's only char can dish out good DMG in both st and aoe mode .\n\nShe's getting her bis too (jq).",
            "Ong, inf ults here we come",
            "MAINTAINING THE AGENDA IS OUR TOP PRIORITY ALWAYS\n\nKEEP GLAZING COMRADE",
            "Keep glazing the GOAT🗣🗣💯💯💯",
            ">second half as mhy intended for us DoTless peasants.\n\nI actually have the DoT characters, I just ran Clara because of phys weakness lol. I ran the DoTcheron team (Kafka-BS-Acheron-RM, all E0S0) in second half against the dino chef. It's hilarious how easy that team clears PF, 40k every time. Incredibly good synergy in there. \n\n\nOnce I learnt that shitty wine robot is a scam and doesn't proc Clara counters I cleared separated DoTcheron to Acheron on one side and DoT on the other and cleared.",
            "ig ratio has follow up buffs on side two but which ones jy has on side one?",
            "Hoyo has never said AS is going to be a hunt oriented mode. That's the assumption everyone else made.\n\nAnd Hunt is STILL really good in this mode. The mode as a whole is a lot more balanced between the three than PF or MoC are.",
            "Boothill 1-2 shots argenti on the second half, but it takes a while to get through his summons first and  it's still a pretty comfy clear.",
            "FF also has action advance and speed so she can dish out lots of damage per cycle.",
            "My himeko can match my acheron. 400k+ ult on break. But shes slightly more restricted than acheron to get that damage due to not having universal toughness shredding on ult.",
            "I think they can all do it with enough investment. Tbh I'm kind of afraid of what power levels are going to be like for HSR in the future. All the new main dps seem to ignore weakness types now to some extent. What kind of character or enemy can top that at this point? Enemies and characters are going to get super gimmicky like no break bars until you do x amount of dmg and ehr debuffs to nerf Acheron. Or debuff immunity.",
            "On my friend list most people that don't have FF can't get 3 star on the last difficulty. FF is crazy strong on the current cycle.",
            "We can trust that she's wind now that Phantylia said hi.",
            "They very much did, it's not the weekly boss",
            "Next AS Doomsday Beast goes into Weakness Break instead of just not having a bar, presumably because when scaled up to level 90 it would actually give superbreak DPS a pretty hard time if it was just the Echo of War version",
            "Seele with mono quantum is always on element with 3 units that can do moderate to high toughness bar damage. I think E1 silver wolf is probably needed to make things really smooth though since it will really increase her toughness bar damage with the ultimate spam",
            "This is a bit unrelated, but argenti is probably the reason we won't get a character that increases energy recharge, argenti would just be able to chain infinite ults in pure fiction",
            "Keep going my magnificent comrades!Yall deserve a promotion and new fatui insignia for glazing and maintaining the GOAT agenda!Invest in HIM stocks before it's too late y'all, before things starts going crazy and he will solo fraudlan using crayons, don't think, don't hesitate, just glaze and feel the delicious taste of W with us, r/FatuiHQ comrades, celebrate this triumphant moment when our glorious dark blue eyed King would show the peak🗣🔥",
            "super break jing yuan",
            "I used JY against Cocolia, if you have his ult ready when the icicles spawn you can mostly kill them instantly, and LL does good toughness damage to break Cocolia (since AS is a break check above anything else right now).",
            "I just used my usual hypercarry Jingyuan team with Tingyun, Fuxuan, and Sparkle",
            "Not really though. Cocolia and her ice minions have fire, lightning, wind and quantum, which automatically locks out imaginary hunt like Ratio (x Aventurine) and favors JY, Kafka DoT and Acheron. Boothill's trickshot stacking time makes it hard for him to catch up with Cocolia taking 3 turns in a row, every other ice sculpture regaining its toughness bar and Gepard putting up his shield.\n\nArgenti has imaginary weakness but DanIL is better than Ratio once again because of his minions that need aoe imaginary attacks.\n\nEveryday I wish MHY finally releases a second Tingyun, so that I can play JY and DanIL on both sides of every game mode and not have problems. When will we ever have Hunt-oriented version of pure fiction",
            "Just the break dpses as they are useless without it. Imagine a fireweak boss with non fire/img/ice weak spawn, who will kill that spawn in a break team? They can easily be countered with shields of toughness hide if Hoyo wants to. On the other hand, Acheron should not have that colorless ult. Just the res down is enough, make it -40res if they must. Their favoritism really throw the game out of balance. I wonder how long till they can fix this, making new character still enticing and having content difficulty still viable for older characters.",
            "I was (1) point off using acheron and bh, malded so much lmao",
            "As long as you can break fast enough in AS, FF/BH is not a requirement. They're comfy, yes but it's still very much doable without them.\n\nBring relevant elements so your supports/sustain can also contribute in reducing the boss break bar. Also bring good toughness breaker/support. Example: DHIL, Gallagher, RM is comfy enough for argenti side",
            "You can. My friend without FF can barely clear it with his terrible relic, no 5* eidolon things. 1st node acheron team, 2nd super break JY as I remember. ",
            "You definitely can \n\nFollow up teams have a good time on that cycle \n\nMono quantum has an okay time\n\nBreak centric characters like Boothill and Sushang have a good time on it \n\nYou can also make a makeshift break team with Harmony trailblazer doing all the heavy lifting as well. I 3 star’d that side with an e0 Guin and trailblazer, also attempted it with Himeko and TB and 3 star’d it. \n\nHypercarry Jingliu also has a fine time on it",
            "First half Acheron + Second half Boothill did it for me. Saw a friend who does Acheron DoT first half + Jingliu hypercarry 2nd half and also clear.",
            "It was a breeze for my Xuyei break team, didn’t need firefly there. I do have all the necessary eidolons though (E1 RM E6 Xuyei-MC-Gall), so maybe that’s helped too",
            "my friend did it with his sushang and ruan mei team. But i agree FF is very strong, I slapped a 4star LC on her, quantum relic, lvl 7 talents and at 130% break, harmony mc(no lvled traces), ruan mei and loucha. I managed to 3 star it, but not my premium FUA team 💀",
            ">  we won't get a character that increases energy recharge\n\nThat's unfair since Jiaoqiu is coming for Acheron 😞",
            "And MoC cause his damaged is is really high",
            ">Not really though\n\nSeele (don't even have her, but a lot of my friends from release used her, and it worked wonders because of her extra actions apparently).   \n\n\n>Argenti has imaginary weakness but DanIL is better than Ratio once again\n\nBeing better or worse doesn't mean one can't clear it as well, it's a race against the boss not against other people for you to need more points than what's needed.",
            "Me who cleared 3700 pts with Ratio fua team against Argenti: ???",
            "Pretty sure firefly also got the favoritism and they aren't even trying to hide it. Loads of hype by hoyo themselves, relics and planetary sets tailor made for her on release, they are too blatant about it. I like firefly but i hate how hoyo butchered boothill when they reworked the relics to not work for him without HMC.",
            "Oddly specific considering that bosses typically have more than 1 weakness type. If the said scenario occurs where minions don't have any of those weaknesses, they're bound to get destroyed by a DPS that can cover for it which in turn means that the Boss will have that same weakness typing.",
            ">Imagine a fireweak boss with non fire/img/ice weak spawn, who will kill that spawn in a break team? \n\nOne, Sactus Medicus Shapeshifter exists already, his spawns only share an ice weakness with him. Two, the answer to your question is Firefly. Or boothill. Or Acheron. Or even Xueyi.",
            "I don't think there is a way to fix this because they'll always have to give us a reason to pull for new characters. It's inevitable that they will have to nerf Acheron and Ruan Mei through enemies and buffs that don't support them. It sucks but that's just how turn based gachas work.",
            "We'll just get even more support characters with niche gimmicks to counter niche enemy gimmicks. For instance if Gepard provides a toughness hide shield on an enemy, then we'll just get a character who can tally the amount of damage dealt to destroy that shield, then re-unleash them in one god once the shield is destroyed.",
            "I cleared with 6612 so glad I didn't have to do it again.",
            "Yeah RM is part of the break meta and lucky I had her and my FUA team was useless on side two against Argentina because it's a Topaz and Ratio. Hitting the right elements but you just can't beat Argenti without strong Blast like JL, DHIL. I barely cleared it with Clara Topaz RM and Luocha.",
            "Can confirm. My e0s1 Jingliu with RM/Gallagher can comfortably auto the argenti side",
            "Of course you can, I did it without FF as well, never said you can't.",
            "Thank you for mentioning Sushang. ❤️🐔",
            "The one I'd say you can't go without is RM actually, with how much she speeds one side up",
            "Yeah the ones that I saw which was able to clear used JL or FF on second half.",
            "I mean yeah that is a break team so it doesn't get nerfed by the mech.",
            "Yes Firefly is also an example. I can let the relic set a pass since Firefly does shit damage even blast compared to BH, in the absence of HMC on the team. On the planar however, they could have made it locked to fire break.",
            "She's getting her bis lol (jq ) hoyo buffing her even more ..",
            "I personally think that firefly is the most questionable designed kit they released after dehya. Sure she is strong but it felt like her kit was a last minute change. Biggest gripe for me is the HP drain feels out of place.",
            "It doesn't prevent them from cockblocking her in some way in MoC for new big DPS to push spending money after being dried out from collecting all pokemons for her team"
        ]
    },
    "[SPOILERS] New map mechanics": {
        "title": "[SPOILERS] New map mechanics",
        "score": 501,
        "url": "https://v.redd.it/hz8624wqc18d1",
        "content": "",
        "num_comments": 78,
        "comments": [
            "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "They way it creates another staircase is actually kind of sick",
            "they brought back the bird",
            "I love over the top architecture like this, like the whole central pillar being a giant fuckoff key is amazing",
            "Did that octagon just... spin in its own shape or did it go under it then spin? Physics be damned here ig.\n\nAlso, the birbs are back!",
            "you either love the bird or hate the bird",
            "I hate this bird",
            "prompt says some badass shit like \"Awaken the Messenger\" and then it's a fucking cycrane my disappointment is immeasurable and my day is ruined",
            "One of the worst mechanics in Xianzhou tbh.",
            "Oh no. After those Hanu puzzles, I hope they stay away from doing it so much.",
            "Huh, reminds me of Kaneshiro's palace final location.",
            "Somebody tell Hoyo that these “summon” mechanics are just…not fun. I did NOT enjoy playing as Hanu, Crane Bird, or Peppy. It’s literally one of my least favorite mechanics ever in Hoyo games that they always seem to implement in newer content😭. Just let me play as my own characters.",
            "NOOOOOO NOT THE BIRD WHY HOYO",
            "I suppose I’m the odd one out here, I’m excited to use the cycranes again",
            "is this the shackling prison?",
            "Its birb time again",
            "To think this is Star rail's equivalent of a SCP containment base",
            "I know everyone is talking about the crane, the puzzles, etc\n\nBut at 0:07, if you imagine the walls as giant bookshelves then this frame looks almost exactly like the Royal Magical Library",
            "If only the bird can glide/dash quickly. I hate them because their flying speed was slow AF.",
            "I hate these bird!",
            "Its giving Kung-Fu Panda prison era",
            "giving tai lung's prison in kung fu panda one for some reason",
            "After playing the bug minigame in wuwa, any puzzle that needs controlling a flying animal gives me ptsd.",
            "\"new\"",
            "anything is better than that clockie mini games :D",
            "Cant we have any game aside from this? like zuma or bookworm. Hate this bird, i havent even finished those bird quest.",
            "ugh",
            "it look like the prison of Tai Lung in Kungfu panda 1",
            "not the cycranes again...",
            "If this is the Shackling prison will Jingliu will be present in the next story?",
            "so there’s story in the beta judging by the yellow beacon? so do the other four characters not show up in the story?",
            "That fucking bird that I hate",
            "Oh yay...it's that incredibly slow bird minigame that everyone loves so much.",
            "This area looks like a Skyrim dungeon lol. Draugr boss fight in 2.4 confirmed. ",
            "Go back where you came from, birdie",
            "We surely are back to the most loved mechanics of the most loved world.",
            "what is this\n\nGenshin sumeru moment ?\n\nheck ye",
            "Why does that room remind me of the building Griseo and Fu Hua were in....",
            "O hey, the birb is back. I like the bird, bit surprise to see I'm one of the odd ones out here. Though I must say, the phrase \"awaken the messenger\" sets up grandoise expectations that the bird does not fulfull.",
            "That fucking bird that I hate.",
            "If this is the Shackling Prison, then it makes sense why we're getting Borisin enemies",
            "Shit, my iPad is gonna be fucking burning like a hotplate in this new map.",
            "I am not seeing  the new part.\n\ndynamic music seems nice.",
            "I hate this",
            "I’m already sick of Xianzhou and its annoying mechanics ugh",
            "ALL PRAISE THE birb",
            "What does fuckoff mean?",
            "The new area gives me zelda dungeon vibes",
            "I love the birb, I love all birbs",
            "I mean this game clearly supports the fact that birds are just controlled drones, so I'm fine with the birds in this game",
            "That fucking bird that I hate",
            "Fr 🤣🤣🤣",
            "Yes, the controls are very janky, especially the ascent and descent controls - they are just not precise or straight up bad. I REALLY hope they steer clear of these awkward and unfun avatar controls like the cycranes and Hanu in future regions.",
            "And that is saying fucking something",
            "Peaksona 5 mentioned. Kaneshiro's Palace was my second favorite, only beaten by Maruki.",
            "I’d rather do 100 cube puzzles over ONE cycrane. Cube puzzles are fun. Please add 10x more. /gen",
            "What Hoyo NEED to do is actually zoom OUT so we can actually see. I can't see the puzzles you forced me to solve Hoyo, at least let me see the entire picture.",
            "I'm surprised to see that a lot of people don't like it too. I love doing the cycrane games in the garden map xD",
            "I'm with you, never knew people hated them",
            "yup. xianzhou scp base break in time!",
            "the one they lock Tai lung in",
            "i still have nightmare of the remote helicopter mini game in GTA 3, the cycrane remind me of that",
            "\"New Map\" mechanics hehe",
            "i like them 🥺 but i really like casual logic/puzzle games in general",
            "agree, i hate those too",
            "why not",
            "It has more prince of persia vibe for me",
            "It means \"man get your ass out of here we don't want you\" if you use it in a sentence.\n\nBut as a verb, it means \"hidden key\"",
            "That fucking bird that I hate",
            "[removed]",
            "okay point for you on this one XD",
            "the english language's vagueness strikes again",
            "Ah, i understand evrything now XD talking about a new map mechanic",
            "I hate fucking that bird",
            "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 1: Be respectful and civil\n\n>It is natural that people have different opinions. Please stick to basic discussion etiquette and refrain from insulting or harassing others.\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
            "That bird that i hate fucking",
            "😟"
        ]
    },
    "[SPOILERS] More new area": {
        "title": "[SPOILERS] More new area",
        "score": 373,
        "url": "https://v.redd.it/4q7qbba3e18d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "The landscape:⛓️👻👿 \nThe music: ☺️🌸✨",
            "Damn DHIL’s old pad is pretty spacious",
            " This place is giving me [Mogushan Palace](https://wow.zamimg.com/uploads/screenshots/normal/351941-mogushan-palace.jpg) vibes from WoW. Same ancient Chinese architecture.",
            "I just realized we already had a 3d place for shacking prison since ~~1.1~~ 1.0 (those scenes with blade and Jing Yuan and the Loucha scene) yet we’re only getting the map now",
            "If we don’t get some story with Dan Heng for the shackling prison I’m going to be pretty disappointed…\n\nUnless he stays on the train for the Xianzhou B plot to join in the main story for the next planet",
            "Shackling Prison is basically a SCP containment site",
            "Love the atmosphere of the place but the music choice seems off.",
            "Close enough welcome home, Dan Feng!",
            "this music sounds like it came out of survivor is it just me",
            "I'm just glad the most recent Xianzhou areas haven't been like Cloudford and Stargazer Navalia",
            "isnt that the place where Jing Yuan meet Luocha and Jingliu ?",
            "I think we will meet Kai next",
            "I have high hopes for going back to the xianzhou the new characters and areas look so good so far",
            "They be playing with Yunli and no showcases",
            "is this the location Blade said his famous quote in trailer",
            "Oh my dear the shackling prison..... We are so back...........",
            "Honestly as cool as this looks I cannot wait for the new Rome based Planet, I'd love to see more character designs like Himeko and Ratio",
            "Spooky and haunting area fitting for Shackling Prison with menacing music. Love it!",
            "Dan Heng: Shackling Prison, Home\n\nAt least it was after I fucked everything up",
            "Grandoise architecture? Depression? Huge fog wall in a gateway? Not to resurrect a crappy meme, but... is this the Dark Souls of Star Rail?",
            "So were going back to the Xianzhou it looks like. And this time it looks like we going into the Shackling Prison it appears.",
            "The Blade scene was in 1.0.",
            "Aight, another sword run it is.",
            "Tbh I never got the hate for those places. Maybe I'm just old but they seem pretty typical JRPG areas.",
            "Those are my favorite areas of hsr. I will never get tired of the warehouse by the sea vibes.",
            "...did you just realize this?",
            "Oh my bad. I started playing at 1.2 so I assumed Loufu started at 1.1 😅",
            "Also the xianzhou areas were all still way better than most of Belobog’s tbh. ",
            "Rainbow box vomit areas",
            "Not outright directly. I first assumed judging by how the next 2 characters in the next update their appearance was a bear resemblance towards the Xianzhou clothing style.",
            "I think having two distinct aesthetics really made the Belobog areas stand out but a lot of them were super basic technically speaking. Like the first zone was literally just a snowy white corridor. Xianzhou areas got a lot better in the later zones like the ruined underwater area and garden.",
            "The starting area in Belobog is literally a just small corridor covered in snow. It's so small relative to the maps we're getting right now.",
            "Did you somehow miss all the Xianzhou-based leaks and drip marketing that have been going on for like literal months now?",
            "The moment when you leave cryogenic chamber is the most exciting part of hibernation ;)"
        ]
    }
}