{
    "Ask India Thread": {
        "title": "Ask India Thread",
        "score": 36,
        "url": "https://www.reddit.com/r/india/comments/1chg6de/ask_india_thread/",
        "content": "Welcome to r/India's Ask India Thread. \n\nIf you have any queries about life in India (or life as Indians), this is the thread for you. \n\nPlease keep in mind the following rules:\n\n* Top level comments are reserved for queries.\n* No political posts.\n* Relationship queries belong in /r/RelationshipIndia.\n* Please try to search the internet before asking for help. Sometimes the answer is just an internet search away. :) \n\n[Older Threads](https://www.reddit.com/r/india/search?q=%22Ask+India+Thread%22+flair%3AScheduled&restrict_sr=on&include_over_18=on&sort=new&t=all)",
        "num_comments": 694,
        "comments": [
            "No reach to any of the comments here. Posts were much better.",
            "I have a budget that's around 60k\n\nNeed to change / exchange my One Plus Nord. Confused between : \n\n1. iPhone 14 128 gb\n2. iPhone 13 256 gb\n3. Samsung S23 256 gb\n\nI use my ipad so adding an iPhone would help the ecosystem. I like iOS interface ( used it a lot from my dad's iPhone and also the iPad ). However, I didn't read much into the Software updates that iOS is getting ( altho I k the updates are smoother than in Android... However .. lately very laggy )\n\nSamsung S24 is a no go for the Exynos. But S23 looks rlly good on paper. I have been using Android for a rlly long time ( Samsung One UI is rlly good ). One thing that I love abt the new samsung(s) are the camera and it's auto adjustments in dark light. And also .. great telephoto lens. \n\n256 is preferred. Tbh. I'm rlly confused. Thanx in advance for the help.",
            "**7 days travelling in India!**   \n  \nThis is one of the subreddits that I was lurking on to getting a ton of tips and advice on our journey, we are so thankful for it because I think the trip would've been much more difficult with you all <3\n\n[https://youtu.be/86klCG7JaP4?si=9eWncFzOrfWR\\_0CQ](https://youtu.be/86klCG7JaP4?si=9eWncFzOrfWR_0CQ)\n\nHere's our experience, perhaps it might help you decide what to do too :)",
            "Planning to buy one robotic vacuum. Never used one. And in online reviews it is very confusing which is good. \nPlease share your recommendations and that\nI can get in India only. Whether after sales service is good or not of the product.",
            "How to cancel Jio Fiber?\n\nHave been trying to cancel my jio fiber connection all day. Things I've tried:\n\n- MyJioApp - couldn't find any option for cancelling or uninstalling, the chatbot tells me to call their support number\n- Support number - it's just an IVR which doesn't connect me to any human. IVR doesn't have an option for cancellation.\n\nThe reason I'm cancelling is because I'm moving states and relocation of wifi connection is not supported across different telecom circles. \n\nI'm stumped and frustrated, has anyone cancelled their fiber connection recently? If so, how?",
            "# best destinations to stay for July and August in India?\n\n[I'm coming to India for months of July and August ... I have a small team of IIT grads I am hiring for a startup, and I'd love to stay in a villa somewhere, where weather won't be brutally hot or too wed.](https://www.reddit.com/r/india/?f=flair_name%3A%22AskIndia%22)  \n  \nWould appreciate if anyone has recommendations of good towns - calm and good internet.[](https://www.reddit.com/r/india/?f=flair_name%3A%22AskIndia%22)",
            "Please suggest a good air conditioner (ac) brand? With good installation process and after sales service.",
            "Hey folks! I usually do long road trips on my bike and recently when I was travelling to Kanyakumari I lost my bag which was tied to my bike on the way and couldn't track it and had to bear a loss almost 1 lakh as the lost bag had expensive items like camera etc., I still am planning to do these trips and I will be extra careful from here on but I do not want to risk anything this time as even on my last trip I had tied everything properly and still lost it. So, I am looking for a domestic travel insurance that will cover my baggage and health to avoid any risks in future. Is there any insurance that you guys can suggest that does this",
            "Is it okay for BJP to call and ask for my vote? Like how the fuck did they get my number? Never registered with BJP or anything, did they simply take it from aadhar?",
            "[Volunteers needed for online survey!](https://universityofkent.qualtrics.com/jfe/form/SV_dfXBGaFBaLWC3fE)\n\nFor an MSc research project, we are investigating dietary motivations and food habits in India.\n\nPlease follow this link to participate: [Food practices in India](https://universityofkent.qualtrics.com/jfe/form/SV_dfXBGaFBaLWC3fE)\n\nthank you for your participation!",
            "I am a dark skinned, African American male visiting New Delhi India in a couple of weeks. I will be interning at one of the hospitals as a physician. I see there is a lot of inherent racism in India. What will my experience be like? Are people outwardly racist or do they just stare? I am about 6 foot 3 and pretty have a stock build.",
            "Hey guys, does anyone know what computer shops/centers are called in your area where you can go and fill out government forms, college applications, or do other online tasks related to the government or educational institutions?\n\nIn Rajasthan they have these places called 'E-mitra' that serve this purpose. I'm just curious what the equivalent is called in your state or city? Any insights would be appreciated!",
            "Hello! Is getting medical insurance a good idea in India? This is for a senior citizen who is in good health. I've heard many people being let down by insurance companies at the last moment while making a claim. How common is this in your opinion?",
            "Must visit places in India?\n\nWhat are the best places to visit in India? Im flying to Bangladesh and on my return trip I thought about visiting India as well. I was first thinking about Delhi and Agra but I would also be intrested visiting the southern parts like the Western Ghats area. Which area should I rather visit when I only have like 4-6 days? Or is there any other place that I should see? Thanks!",
            "Retail prices of bath and cleaning supplies ... Volume to price is wierd\n\nWhen buying items like Soap , Dishwashing liquid etc ... do you people look at price per gram or ml of the product. I have noticed this in India of late, that bigger brands are actually charging more per ml or gram if you buy higher volumes.\n\nexamples are 100 gm lux at 36, 150gm at 80.  Another one was 125 ml vim at 20 Rs, 900ml at 205 Rs. These are the 2 i just noticed today. I have been seeing this trend across a lot of products.\n\nDoes anyone know why they price it like this ?\n\nUS and UK had pricing per ml or gm way less , when buying larger qty",
            "Do you think India will marginally improve its facilities in the coming 2-3 decades?\n\n\nWhile travelling to other countries it becomes apparent that we have a long way to go before we truly say that we are on the same level as other countries. In parameters like public transport, general cleanliness, government policies etc we hve a long way to go.\n\nWe have our unique set of issues like the huge population, corruption etc. Do you think there will be a massive scale of improvement in our country in the coming decades, or is it just going to be the same shit, different government type of scenario?",
            "Is shopping in India different than in the US? I want to make clear that this is a genuine question based on a pattern I’ve noticed. I work in a part of the US that has a large Indian immigrant population, at least large enough that I interact with a lot of them on the daily. I work at a shoe store and I’ve noticed that a lot of times when an Indian family comes in, they just sort of drop shoes they’re not going to buy in a big pile and walk away. They’re always very polite, but it leaves a big mess for us to clean up. Is this common in India?",
            "\nIf I’m booking a hotel through a website like Agoda, does the fee I pay cover the cost of staying in the hotel as well or do I have to pay the hotel extra separately?\n\nIf Agoda shows 1500 and I pay through Agoda, do I have to pay the hotel anything else at the time of checkout?",
            "27 year old, graduated from top tier college in India, worked at a PSU for 3 years, followed by a tech startup for the last 2 years. Planning to go for masters in ME at UCSD. Following questions make me uncomfortable, and need some perspective on them.  \n1)  **flexibility:**  IMO India gives a lot of short term flexibility, like since I dont have any loan I can switch careers from tech to MBA/do whatsoever I want without much worries. Being from one of good colleges, I believe I can get a descent package any day I wish to switch to other roles. Compared to this, I'll have to pay a hefty fees in USA and work my ass to pay back the loan for another 2 years, followed by a constant fear of being sent back to India\n\n2)**Comfort:** Got a househelp taking care of all the chores so that I can have all my time to myself, which will be impossible in USA. Also the cost of things will feel exorbitant for first 2 years.\n\n3)**Growth :** Exposure to smart people and learning new tech is the only reason I want to go to US;. I have a very comfy life here otherwise. Worked at a startup for last 2 years, where projects were interesting but resources (colleagues to have discussion and execute project) were not that great.\n\n4)**Another year :** I didnot accept admits to other better colleges like UMich because it was expensive.  In hindsight, some people suggest to wait for another year to reapply and join better college instead of UCSD. (UCSD was the my safe choice, and I am sure I can get into better college, but then I dont know if waiting for another year will be worth it)",
            "Help me regarding this issue\n\nI am currently in Nepal and I have not been receiving any sms in my airtel sim. I recharged it.\nBut still am not getting any sms.\nI did international recharge aswell but still no sms \nDo you have to send sms to 121 with START as message?\nBut I can't even send sms to 121 with my airtel sim card \n\nI called airtel customer care and they said that my sim card is not deactivated and is working just fine \n\nThey said to send sms to 121 with START but the message is not being sent with airtel sim \n\nHow do I send sms with wifi\n\nI have nepali sim as well. That's how I called airtel.\nHow can I receive sms while being in Nepal?",
            "So a month back. I was driving in my classic 350 in an highway at 60 kmph a guy tried to cross road without checking the roads he suddenly came out of nowhere where and got hit by me (his mistake) but he filed a case on me stating that he was stationary I hit him due to my rash driving. He is permanently disabled to do work now, I too got injured since I was wearing helmet(he dint) | had several scratches and shoulder dislocation. He has claimed a huge amount and filed a case on me. So what happens now there was no eyewitness and he had pinion. What if the pinion tries to convince the judge so what should I do",
            "Hey there, I am traveling to Kuala Lumpur from Delhi. I will be first taking a domestic flight and reaching delhi indira gandhi airport around 11:05am. My flight to KL is scheduled for 1:15 pm. Now my problem is that, i have to pick up my baggage, walk to Terminal 3 from Terminal 2, and then re-check in again. The airline check in counter closes 60 minutes before departure which is 12:15pm in my case. And the boarding gate closes 30 minutes, which is 1:15 exact. Will I have enough time to make my flight? Can I skip the immigration and security queue, do they make exceptions at IGI Airport? Please share your experiences.",
            "Where can I watch the results coming in for the election in English?",
            "Hi, I am from Malaysia, I am going to Hyderabad, India for a work trip, and I am looking to bring some souvenirs, probably some food for my Indian co-workers. What do you think is a good gift to bring? I have narrowed it down to Malaysian instant white coffee, local biscuits, chocolates.",
            "Where's the Exit Poll Mega thread?",
            "My friend's sister preparing for neet needs a second hand laptop that would smoothly support browsing, giving online tests.\nIf you are already looking to sell or have a spare laptop pls dm.",
            "What unique gifts from India would you bring to relatives in the US?\n\nMy parents are traveling to the US for the first time to visit my sister and some of our relatives. Every time my sister and our relatives come to India, they shower us with gifts and make us feel special. These gifts range from dry fruits, chocolates, skincare, makeup to electronics. Now it's our turn, and we want to return the favor but we’re unsure what to take. \n\nWhat unique and thoughtful gifts would you bring for relatives in the US to make them feel special? Looking for your best ideas and inspiration!",
            "We really need some good mini smartphone options in the Indian market, don't we?\n\niPhone 13 mini was such a good phone with a perfect display size of 5.4 inches. And with that they stopped the production of minis. \n\nDon't you think we really need some mini smartphones in the market. Why is such a phone not being sold in India? \n\nThe only phone that I can think of a good mini phone is Samsung S23.\n\nI am using a S21FE with 5 green lines, contacting Samsung Customer Care for the past few days, made 2 visits to the service centre. I would like to try any brand phone but not Samsung. But all of the new phones are more than 6.7 inches.\n\nI really think if a company introduces a phone with\n1. Overall good performance \n2. A battery backup of one day with normal use\n3. Display below 6 inches\n4. No network connectivity issues\n5. Good service centre,\nthat company might make good profits.\n\nWhat do you guys think about it?????",
            "What are some of your favourite low calorie snacks? Preferably vegetarian.",
            "The ISEER rating sticker has a annual electricity consumption of 754 units. How did they calculate it? Did they ran it for a year and observed the units consumed? It’s a split AC of 5.13 ISEER rating. I was trying to find how many units would it use if I ran it for 16 hours almost everyday for 6 months a year.",
            "*Why does the mod team keep deleting my Zomato giveaway posts?*\n\nI’ve done a ton of them, check my profile. why do they keep getting deleted now, the last 3-4 months? The deletion comment also says I have violated their rules - I checked and I’m pretty sure I don’t. Mod doesn’t respond to DMs too - any ideas here?",
            "Hi there,\n\nI‘ll be visiting your beautiful country in a couple of days for a business trip and I was wondering what guest gifts to bring? \nDo you have any ideas or suggestions what would be suitable? \nIs there anything from Germany that is famous or known in India, but not available ?\n\nAny help is greatly appreciated!",
            "Need some suggestions for an idea - Do you think there should be an app for students who are looking for pg and flats? I mean like Oyo for pg and flats. I know there might be many platforms for this but still not in the masses. All platforms available are somewhere not trustworthy or not maintained properly.",
            "https://preview.redd.it/lk7f0x7v5h7d1.png?width=725&format=png&auto=webp&s=fbe713fc127600ef0f85394ceb544d23547bd789\n\nhey guys  \none of my friend has made this painting   \nif anyone is interested to buy please dm",
            "Has anyone tried the amul’s gouda cheese? I found it a bit weird. Is it the case with others or am I overthinking it",
            "Hello, can anyone explain to me what does 'Aye Motki' mean? I hear it pretty often on Instagram reels. Thank you",
            "**Better to buy Saregama Carvaan Mini or Mobile?**  \n  \nSo Saregama Carvaan has many variants- the basic feature being 1000+ preloaded songs. I want to buy a gift for my parents and I am confused whether I should get them a MINI (BT Speaker+FM+Preloaded songs) or a MOBILE (Simple keypad phone+Preloaded songs). Pls advise.",
            "I am free totally free for the forthcoming 25 to 27 days as work starts only at the end of this month. At home, in Bangalore , my routine work with my hobbies/ passions and gym take away a few morning hours. After this, I am completly free. Can somone suggest a cooler place, where i can visit and stay for the above days ?",
            "# Hi, can someone explain me, what do civil engineers do in INDIA ?\n\n\n\ni asked my bro he is one and he thought i was insulting him but i wasn't trying to.\n\nbeing serious can someone explain what an indian civil engineer do in india ? (no pun intended)",
            "Got a recorded message saying my parcel has been returned and to press a number to continue. I didn't press anything and the phone got disconnected immediately instead of repeating.\n\nI checked true caller and it showed a person from UP West. Now I want to report this person via the cyber crime portal but all the govt sites I see on Google are down.\n\nWhat to do?",
            "Guys I need your help. please can you fill you this form its for my masters research. [https://forms.gle/9qyoz2E1kZFmc1tW8](https://forms.gle/9qyoz2E1kZFmc1tW8)",
            "How close are we to a wet-bulb event, seeing how the temperature is soaring when we have 2 more months of summer left.\n\n* Wanted to know whether coastal areas are at much higher risk due to humidity.\n* I've seen humidity in Mumbai going as far as 70% with 37 degree temperatures that feels like 43 degrees.\n* Are we a power grid failure away? Not trying to scare, just wanted to know realistic estimation.\n\nTrying to ignore won't help either.",
            "Why are sim card companies using this limited time recharges instead of the original long term recharges? I remember when a recharge used to last as long as I had main bal instead of this BS they do. Why is the incoming of sim cards gets cut when my recharge is not done regularly. Shouldn't the incoming be always available since emergency otp from banks and post office or calls are always necessary? Isn't this just a scam to take more money from us? For example idea used to have a recharge plan of 99 rupees went from 28 days to a mere 14 days but no explanation why this happened. Last year my sim card got expired for no reason n it took 500 rupees to buy n recharge for the new one.",
            "# Supima percale bedsheets in India?\n\nHas anyone here bought these from a company/store in India? Any recommendations?\n\n(They're one of the best bedsheet type for summer)",
            "Hey everyone, I'm a student who completed class 12th with PCB and spent a year preparing for NEET, but I've always wanted to pursue a career in the CSE field. Now, I feel it's time for me to make that transition. However, I don't have much knowledge about CSE or programming languages from an academic perspective. The last time I studied programming was Java, three years ago as an ICSE student. I'm confused about what to choose next and where to start to enter the CSE field. Initially, I considered BCA, but after comparing BCA and B.Tech, I found B.Tech to be a better option. However, I don't think I have enough skills to directly pursue B.Tech. So, I'm considering doing a Diploma in CS and then pursuing B.Tech, followed by a Master's degree if possible. I'm not confirmed about anything yet and still feeling confused. I would appreciate your suggestions and reviews on this plan, and any help you can provide to guide me in the right direction.",
            "This is insane! More and more deaths in Mumbai due to overcrowded local trains. Need more local trains in Mumbai.   \n\n\nDo electoral candidates have any solution for this? - No   \n\n\nIs anyone even doing anything about this? - No\n\n\nNot even a month left for elections in Mumbai, still hardly anyone knows who are their ward candidates and what did they do in past years(which is nothing), hardly any sustainable development in any region.",
            "So I’m curious and not to sounds rude I work for stundent housing in the USA why are all the Indians apartments I go to so dirty food scraps everywhere on the floor flys and it ends up attracting roaches as well they never sweep or clean the kitchen or living room stoves left with grease all over along with the microwave and fridge and rotting food I just don’t understand ?",
            "is there a good brand of matcha available in India? so far i have tried matchas from heapwell and tencha both are utter garbage, they are not authentic at all. Instead of bright green they are dull in color and don't froth well no matter how much you whisk.",
            "Heyy, I am a writer and I usually have foreign readers who wish to donate me money every now and then so I have linked my Stripe account to my Kofi account. But I am not sure if it's working or if I can receive international payments. I recently checked my payment history on Stripe and found out that someone had tried to donate me some amount in dollars but the payment failed. Is it because I can't receive international payments? And if yes, what other method should I use to recieve donations from Kofi?",
            "What Ac brand should I consider - CRUISE, bluestar, panasonic or carrier?\n\nI came across these brands (for a 1.5 ton 3/5 star ac). I found cruise to be the cheapest but could not find much about this brand. \n\nRest all costs almost the same, I can't figure it out which of them would be better.",
            "I’ve finally gotten back to working out, and I'm using MyFitnessPal along with my Apple Watch to keep track of everything. But, no matter what I do, the workout data from my watch isn't showing up in MyFitnessPal.\n\nHas anyone else had this problem? How did you fix it? Or if you know a better app for this, I’m all ears. Tried Healthify as well, but that has the same problem – it only includes the step counts. \n\nThanks a ton for any tips or advice!",
            "\"\" ___22 3  b 9h4021",
            "Does anyone have a good recommendation for a mattress protector that doesn't trap heat so much?\n\nI have a semi latex mattress and don't want to negate its feel and airflow. Have tried WakeFit's own protector but it is not as breathable and gets super warm and uncomfortable.",
            "*Custom related questions*\n\nSo i order some manga (comic books) from japan it is right now In Mumbai aspo idk what that thing is it custom office or something? And my order came from airmail(japan post office)\n\nPackage details: Manga(comic books) price- 1188.71 Shipping - 901.83 Total=2090.54\n\nI didn't pay any custom price when I order so how much i have to pay after it gets in custom",
            "[deleted]",
            "In a couple weeks I will be in India and have an iPhone with only e-sim available. Ideally I want to be able to activate a JIO e-sim while in the USA before the flight. I was wondering how I would go about doing this if its possible at all. If its not possible then how should I get an e-sim activation as quickly as possible in either Dubai AIRPORT, AMD AIRPORT, or as quickly as possible after landing?",
            "Hello, this might be a weird question - a relative of mine who lives near Goa and Maharashtra was talking about a local superstition about the line of trees/forest that often lies between flat agricultural fields.\n\nHe called the line of trees something like a “Bandh”, but to my awareness that only means a type of protest. Does anyone else know what word this might be? (Likely Marathi, Hindi, or Konkani)",
            "Hi,\n\nAny  advice for a Job seeker with UG from India and  MS in bio-technology  from U.S?\n\nWhere to look for jobs in India? What kind of salary being offered?\n\nAll inputs welcome.",
            "Hello everyone,\n\nI am currently writing a thesis regarding healthcare in India, particularly pricing strategies, difficulties for access to some medicines, and the stigma of some diseases. I am trying to find some people who are aware of these issues and would like to answer a few questions over a call? That would be amazing!\n\nThanks everyone :)",
            "Good tasting whey protein powder that is available in the Indian market\n\nMajority of whey protein powder that I've used taste like crap. Ive got strong taste buds and always pick up on the very unpleasant artificial aftertaste pf protein powders. Make me want to throw every single time. Are there any actual high quality and affordable options that I order from Amazon?",
            "Hello everyone,\n\nI am an international student in Canada from India with Indian passport. I'll  visit India during summer and am able to get a slot for visitor visa there as waiting times in Canada are very long. Is it suggested to apply from India, any drawbacks or something to look out for?\n\nPlease give your input\n\nThank you",
            "Hi , if any Indian is reading it please suggest me a good orthodontist or jaw surgeon in Delhi ncr or any part of the country. I am a victim of extraction retraction orthodontics and no doctor I have met knows how to treat it. My tongue doesnt fit in my mouth anymore and my tmj pain is going out of hand. If I don't meet any doctor soon I dont know what I am gonna do to myself. I just need a doctor. Help.\n\nI tried aiims but they do not treat unless you have some strong referrals and connections in the hospital.",
            "I’m a longterm traveler and very much in need of new sandals, preferably trekking sandals that don’t mind water. I’ve been to so many sport and shoe stores but couldn’t find any in my size 12, not even 11. Can anyone point me to a store where I could get lucky? Preferably in Bihar, West Bengal or Assam.",
            "TL;DR - CKYC has wrong Date of Birth, how to change it!\n\nDetailed- I was renewing my activa insurance on phonepe, where it asked to submit KYC details as per the new norms. After 2/3 hrs I got notification from the app that transaction has failed and refund issued, because of 'KYC error'. Now I tried multiple times with changes in name/mobile number/email id but everytime it was the same.\n\nFinally, I read in TnC that they are going to fetch details from CKYC and check it, so I went to CKYC site and downloaded my details. There my date of birth is mentioned as 01-01-1995. Instead of actual date/month🤦‍♂️.\n\nNow I need to know how to change this in CKYC portal. All my bank accounts (SBI/PNB), demat account (paytm money), aadhar, PAN have correct details.\n\nI could not find any option to rectify this error myself, apparently \"it has to be reported to them by some financial institution\". Is there any way if anyone knows?",
            "[removed]",
            "Please tell me if this is really fine\n\nI had worked day and night to get into one of the top 5 engineering colleges in my city. After coming to college, I was still in the same mindset of my jee prep days. I didn't make any female friends in college in my 1st semester. I was just doing the same hustle. Later on I realised I had to enjoy my college life as well. I wanted to get into the main group of my class but which had the popular girls and boys but it was too late. I am currently in a position where I talk to all of them but I am not able to get too close with any girl. I tried hard but was of no use and I was even having the doubt that maybe I may look too desperate as well. I still regret the decision why I didn't do the same thing in my first semester when everything was fresh. I am finding it too hard to make any close female friends in college. I am stuck with a boys group of 5 where none of them are really interested to get female friends and are quite boring in nature. I am feeling is it a waste of my college life if I don't have any female friends in my close group because all other groups are a mix of both. I know I will do fine with the placements and stuff. Its not that I don't really talk to any girl. I do but nobody became too close. Idk how could I even explain this to anyone so posted it here",
            "Hi, I’m looking for a 8-12 hour house help for all household chores (cooking, cleaning, laundry etc) in Gurgaon. Broomees was a terrible experience. Do you know of any agencies that are good/ trustworthy? Thanks!",
            "Hello! I wanted to send a gift to my friend who lives in Hyderabad but I don't know how to. I live in the Philippines and I want to get him a shirt from \"crazy monk\" shop in Instagram. can someone help me on this? thank you so much in advance!",
            "How many felonies do you think modi committed to win 2024?\n\nAnd do you think that EC will ever take action? \nWhy are they so complicit in this? \nWhat’s even more concerning is that why are there no protests against this despite clear violations and state sanctioned rape being committed.",
            "Doing graduation after 30s\n\nI am a 33 year old looking to return to college. During my +1-+2 I had severe undiagnosed depression and anxiety issues which basically ruined my education. I had scored 92% in Xth, but didn't learn anything after that. \n\nI didn't explore my interests and aptitude after as my life always felt like doomed. Currently I want to pursue a degree and I can't figure out which stream, may be psychology, economics, anthropology,accounting as these are few of my interests. \n\nI always dreamt about experiencing education in a foreign University, so if things go well I plan to pursue masters from a university after the graduation.\n\nBut the colleges in India often have an age restriction for under graduation and I like offline education. What can be done and is there any good options for me?",
            "Friends,\n\nI'm looking out for a new phone within rs. 20k range (can extend by 2k if needed). Just a day to day phone with good camera, no bloatware, with stable OS and security updates, with 3.5mm jack, with nfc, good speakers, and amoled screen. Mostly used for consuming social media, videos, songs, calls and occasionally gaming. I know it's not possible to get all these in a 20k phone. I'm confused with all the ones in the market so unable to make a decision.\n\ndo you guys have any suggestions?\n\nTIA",
            "How's nmims Navi Mumbai for bsc applied psychology?",
            "any good website where i can design caps as per my requirement which also have good quality, pls do tell",
            "Flyder Immigration review??\n\nRecently got a call from Flyder Immigration Services in Delhi and they explained about the process to relocate to other countries on work permits/visa.\n\nI am interested in exploring this opportunity or service but feeling a little hesitant as I have heard these things can be a scam. \n\nSo if anyone has taken their services please feel free to share your experience.\n\nThanks.",
            "Hi India,\n\nI am searching for a movie I watched as a kid in the 90s. I can't remember its name and need your help. \n\nHere is what I remember:\nThe movie has a police officer (I think it was Rajinikanth) \nThere is a villain in the movie who is driven around in a car shaped as bird/pigeon \nVillain is terrorizing a village and the police officers saves the day.",
            "Hi there India,\n\nI am exporting a pet dog from India to bring to UK. I have hired the services of an agent based in India. Upon receiving the invoice, I read there is an 'export fees' item with a billing of £220. Upon searching the internet, I found this to be related to the Animal Quarantine and Clearance Service (AQCS). But on the website of AQCS, it is mentioned this service is FREE. I confronted the agent and he just replied, \"hahaha lol. Nothing is free.\" Am I being duped? Is anyone here with a hands-on experience of exporting a pet abroad who can enlighten me on this?",
            "Visiting India - Faridabad - its middle of the night. Power seems to have been out for hours. Is there a way to check status?\n\nI’ve been visiting India for the past few weeks. I’ve experienced a few power outages, but they didn’t last long. However, tonight the power has been out for several hours over night. It’s extremely uncomfortable. Is there a way to check estimated time till it’s restored or anything like that? I tried searching on google and I think I found the power company page, but it says no current outages for the area. Not sure if I’m on the right page though.",
            "Gym goers, what do you do when someone is extra rude to you at the gym?\n\nI recently joined another gym because our college gym is closed for the summer break. I am an easy going person, lift weights 4x a week and I am usually done with my workout in between 45min- 1 hour. Today I was at my last exercise of the routine, I was using the equipment. I started using the equipment at 7:07am and was doing 3 sets of 12 reps. I take breaks in between my set during which I use phone(breaks are not that long)\n\nNow, I had another guy ask me at 7:11am whether I am done with the equipment, I politely replied that no, I just have one set left. He goes, \"toh jaldi kar na, tujhe toh phone chalane se phursat nahi\". I was flabbergasted so I didn't say anything to him and I thought maybe it was my fault. But I couldn't stop thinking about how rude he was about it and I wasn't on the equipment that long. What would you have done in this situation?",
            "Can I get a sub-titled version of Purab Aur Paschim?\n\nI live in Canada and my best friend is really interested in watching this movie (No I am not trying to do any patriotic thing, he is just interested). He is white so I need some subs in English. I can translate for him and his dad but is there somewhere I can get the movie with the subs? Piratebay failed me so any recommendations would be appreciated!",
            "Can someone tell me on which subreddit can I ask questions related to men's clothing style in India...?",
            "Hi. I am planning a northern light tour in 2025. But with all the different information available on the internet I'm very much confused.\n1. What is the best location to go for northern lights from india where the chances to watch the lights are highest?\n2. How long shall the trip be?\n3. What is the best time to go?\n4. Tentative cost per person for the trip?\n\nThanks in advance. It's my childhood dream to see the lights.",
            "https://preview.redd.it/9k1mcj2m87zc1.jpeg?width=838&format=pjpg&auto=webp&s=0d944325caa296e0641851d2369f4767263703bf",
            "IIRC during covid days, Pfizer never launched because they didnt want to take liability of any issues while Covishield would take liability of issues found later...  Recently issues were found in Covishield, does anyone know if they compensated folks based on those issues? if not, any hypothesis what was the benefit of not allowing Pfizer in the first place?",
            "Titan Eye+ Lens confusion\n\nCouple hours ago I was at titan eye+ and they suggested me lenses worth 1250 and another with 2250, I selected 1250 one for my sister's glasses as she stays home most of the time and selected 2250 one for my glasses, I was in a hurry so didn't check the difference but the lady there said 2250 one has some night time car light block coating something.\nBut now when I checked on titan's website it says 2250 is priced for high power glasses and I don't have a high power, help me out please and how I can get it changed and will they refund the difference or how it'll work. Thanks!",
            "I stopped working in India a few years ago and applied for a PF final settlement on the UAN website. The claim went through, but I only got back about 80% of the value shown in the online passbook. Any idea why that might be the case? I can't find any rule or restriction about this",
            "#Book Giveaway - Rs 500 worth of books from Amazon of Bookchor for deserving students from 1-30th May\n\n[Day 7 winner 🥇 - Rural Public Libraries of Karnataka](https://www.youtube.com/watch?v=pBeMeTyf5is)\n\n[About the book giveaway campaign](https://www.youtube.com/watch?v=9_8lttvjNGE): Our son is a bibliophile who has posted over 120 Book Reviews. As a pay-it-forward, this summer he is doing a month-long book-giveaway by sponsoring books worth Rs 500/day for deserving students and readers.  Someone tweeted and sent details of Rural Public Libraries of Karnataka, and he decided to have 15 books shipped to them.\n\n[Running update on daily Winners](http://www.beyondlayoff.com/2024/05/BookGiveaway.html)\n\n#Need help in spreading the word on R/India and elsewhere",
            "Hello, people who have applied for a Schengen visa previously please help me out.\n\nSo today I was applying for a France visa in their portal and there was an option that said \"City of submission of application\" for which I chose Chennai and then I filled up the form and submitted it. After that, I went to VFS Global to book an appointment for which I chose the city of appointment as Mumbai (The confusion is because I will be traveling between Mumbai and Chennai in the next few weeks). I realized this mistake after paying the service fee and finalizing the appointment, so I canceled the appointment. However, I cannot delete the application in the France visa application portal as it has been submitted.\n\nMy question here is, should I now book an appointment in Chennai? Or is there something else that I should do? Also, will I get a refund for the appointment that I canceled?",
            "Hello! What are some wools and yarns that are unique to India. Even if they're not exactly unique to India and hold special place in our history/culture like pashmina.\n\nKhadi is there too but I'm looking for something which can be worn in winters and it blocks outside cold. \n\nIs there anything else like pashmina?",
            "Good day ! Looking to travel to India soon when is the best time of the year for tourist ? Add things to do also Thank you !",
            "[removed]",
            "Feedback Needed on My Travel Plan from Delhi to Kumbalgarh and Back\n\nI am planning a trip with my mom (multiple health problems - cardiac issues, diabetes, cancer survivor, etc.) and my daughter from Delhi to Kumbalgarh in the last week of May. My plan is to book a taxi, leave early at 4 am, make frequent stopovers (every 2-3 hours) for my mom's convenience, and reach Kumbalgarh around 1-2 pm - at the time of check-in at the resort. Rest for the day. Go to Nathdwara early morning (at 6 am) the next day, come back, and rest. And come back to Delhi on the next day (leaving around 10 am). Do you think this is doable with someone who's not in the best of health? Also, if you have any Nathdwara tips or stopover tips - please share them too.",
            "Hey everyone!\n\nI have a redmi note 7 pro from like 5 years ago and its pretty beaten up and the screen has started to have issues after being replaced so looking to get a new phone around the 20k price range. The difference between 13 pro and 13 is just 2k but the 13 variant comes with **12GB RAM and 256GB** storage at 20k and the 13pro comes with just **8GB RAM and 128 GB** storage.\n\nSo my question is whether there are significant improvements in 13pro that make it worth forgoing the RAM and storage space?\n\nOpen to other phone suggestions, just keep in mind that my budget is 20k and MAYBE I can stretch it to 5k but would prefer not to.\n\nAnd I would like to have the headphone jack since I just recently bought an IEM that I want to use for at least a few years haha.",
            "If I had gold worht 200 sovereign back in, say 2002-03 period, how much will it be worth today? I'm trying to figure out how much it could have appreciated.",
            "Hey!\n\nI would like to sell a high-end expensive laptop a little above it's base price (INR 3,40,000) because it is just 2 months old and I've upgraded some hardware components beyond it's stock (RAM and SSD).\n\nI can't have it returned by the vendor (Amazon) nor by the manufacturer since return window has long passed.\n\nWhat is your suggestion of the best way of going about selling it?  \nI've thought of selling it in a place like OLX but are there other better options for me here? Like Amazon or a service that deals in buying used laptops?\n\nWould appreciate some recommendations and advice here.",
            "Hello! \nI’ll be getting married in mid Dec in Mumbai and am looking for hotel/resort recommendations in Goa/Kerala or any beach side property where we can just chill for 3-4 days. What are some of the good properties or even locations to consider?",
            "Hey, I want to sell an iPhone 15 Pro Max that I got from the US but since it has a bill from walmart what value would I get for it here? does that bill still qualify? its the 512GB version with 100% battery health for reference.\nAs for why I want to sell it, I have been on the dumbphone train now and am planning to stick to the blackzone winx, so would like to sell the phone and instead get a camera.",
            "Why is it so difficult to get passport?\n\nEverything was smooth apart from the police verification and delivery from post office.\n\nThe post office guy never called to confirm the address. How in India is it possible to deliver anything without calling the individual?\n\nI had to go to the post office only to learn that they returned it back. Then i had to contact the paasport customer support 3 times for nest steps. \nEvery executive gave different information. One said i have to wait for show cause notice, another one said i had to go to RPO and last one said you have to book appointment of inquiry which has made me confused whom to trust.\nAnother individual told me to file complaint against post office so that you get call. 😖\n\nAlso if no one is calling me for delivery how will i get the show cause notice?\n\nWhat's the point of post office and delivery services if the customer has to go to the post office for their parcel?\n\nNo one is giving clear answers. I have filed grievance complaint as well.",
            "Hi I have a 5 year multiple entry evisa for India. I am a Canadian citizen. It says I am allowed to stay a max of 180 days per year in India. Is there a limit on the number of times you can enter per year? I went for one month in February/March, and I am planning for one month in August/Sept and another in November, will I be allowed entry 3 times in one year?",
            "Hey guys and gals,\n\nI’m wondering if one is able to and knows where to purchase pre popped  Makhana seeds (lotus seeds) \n\nThanks",
            "Hey guys and gals,\n\nI’m wondering if one is able to and knows where to purchase pre popped  Makhana seeds (lotus seeds) \n\nThanks",
            "Did Maggi Oats get discontinued?",
            "Which RO can I self service?\n\nWhich RO should I buy where for servicing I can get parts from local markets and do the servicing myself.\n\nBasically, if it accepts 3rd party filters and replacement without much headache and cost. \n\nAlso, informing if and when did you buy that model would be great help!\n\nPlease do not suggest DIY models. I do not have the bandwidth right now",
            "does anybody already have the Samsung M15 5g? Would you please post a couple pictures taken of text or books or newspapers? I am really interested in this phone but I cant find any tests which include fotos of small print or small letter text. I want to compare it's camera quality to the A25 of which I have found a very detailed review online.",
            "People who have Non-Software Jobs or jobs not related to you degree, what do you do ??\n\nI have an acceptance from NYU tandon masters (MOT) but the loan is scaring me, i have a passion for cinematography, acting, finance, fitness, pencil drawing and some others but i just wanted to know what people were doing.",
            "Can anyone please please help me with a hindi translation? It's an audio file. It's important.",
            "I need help finding an old show\n\nIt was a 2d animated scifi series with a female protag. It used to air on TV in this timeline (2012-2017). I don't really remember the exact year or name. I would really appreciate it if someone could help me out.",
            "Millions of Indian Youth aspire to go abroad, but an MP who probably doesn't speak much English or a word of German simply lands up in Germany. How?",
            "I got a sms from IT dept no that says \"Total TDS by Employer of PAN ACCXXXXX0K for Qtr ending Dec 31 is Rs 0 and cumulative TDS for FY 23-24 is Rs 0. View 26AS for details. ITD Team\"\n\nI do get this message for my own PAN numerous times, but this PAN I don't recognise. Has someone linked their PAN to my phone number? How do I find it out?",
            "Name / Culturural Etymology: ‘Rai’ / (English: Rye) \n\nCan someone explain in detail the meaning of ‘Rai’ in Hindi or Gujarati? It appears it was a common replacement for ‘Raja’ which means King, but I don’t know if this still holds true and in which regions. \n\nI am wondering what the common surname also refers to exactly, which can easily be found online, but I’m more so looking for the cultural side about how the name ‘Rai’ is generally perceived in India culture today.",
            "I've been fascinated by the Indian mythology and I've wanted to read mythological and religious texts of you folks, but I've been too overwhelmed and I would not know where to start.\n\nIn which order one should read the original texts? I am also not interested in modern written works. I strictly want to get into the actual texts.\n\nI am a foreigner. I can't understand Hindi.",
            "Hello,\nI'm very new in this space, but I've been an ardent follower of art and artists in real life and on Instagram. I am hosting an event for my father's retirement, it would be great if I can get a caricature artist there, it'll be a great way to make memories throughout the event and people can get something out of it. But I'm very clueless as to how much it will cost. Since it'll be a big event - close to 300 people and I'll be arranging the decor, music and gifts I wanted to know the price range for these things before approaching any artist online. I don't want to get embarrassed and disheartened if they quote something big. Please help me know if you've booked any artist before and I'm sorry if this is the wrong sub.",
            "I'm trying to buy one or two GPUs from India. As it is quite cheaper there. But every shop I'm spoken to, they don't ship to Bangladesh. I found three shops whom say they deliver globally, but their google and amazon review is not so great.\n\nSo any legit shop in India which will ship products directly to Bangladesh?",
            "Where can i find pure nitrogen tanks? How should i go about it? someone please help",
            "Why do these god damn idiots keep on blowing their horns when they drive?",
            "hello! I'm an aspiring writer from Canada and I have a question as I have a couple characters I'm working on who are from India. \n\n I am struggling to find a last name for them. I learned how the caste system works with names but a lot of google searching leaves me a bit confused as I can't find a reliable list of last names by caste. The family is originally Vaishyas. It seems different websites I visited have varying results. I like the named Gupta but one site said it belonged to an upper caste, while another said it was in Vaishyas. If this is incorrect, could you suggest appropriate names for me please? Thankyou!\n\nThe grandfather of these characters found himself in a great career and managed to improve his family's life years before the story takes place, so the caste isn't quite important, but just wanted to have that small detail of their origins in the name. \n\nThanks again, have a great week everyone!",
            "[removed]",
            "I have a friend who got selected in IIM Indore but she is choosing to go to IIM Nagpur. Her reason is that she doesn't think she can cope with the pressure there and compete with other students there as she has a very low profile ( no name college, engg, no work experience). She is someone who is diagnosed with Anxiety disorder and ptsd and wants to choose a more comfortable and known college ( she has lived in Nagpur for a few years). She thinks she will do poorly in Indore because of her anxiety and doesn't want to put herself in a position where her anxiety will act up a lot. Previously she has left a college because she couldn't handle the pressure. Is she right?\n\n\nPS: posting this on behalf of her with her knowledge and consent.",
            "Hey guys! My Airtel Xtreme Fiber wifi connection is down since yesterday morning, it's not restored yet. I am having this issue in Barrackpore, West Bengal. I have raised the issue in their app, called them and texted them on twitter but to no avail. They're just sending this text every 3 hours- \"Service Update- We're still working to resolve the technical issues. You can expect your Airtel Xtreme Fiber services to resume by 15/05/2024 9:48 PM. We thank you for your patience.\" The wifi is still not working. They've not provided any engineer's number who is going to attend this issue. The Airtel Thanks App just shows \"resolution in progress\" for the complaint raised. Is anyone here is also facing the same issue with Airtel? Or anyone have faced this issue recently? If your issue got resolved please tell me how long it took for them to restore the services? Did you do anything apart from what I had mentioned in this post regarding lodging the complaint?",
            "common Womens clothing \n\nHello, I was wondering how common shalwar kameez is for women in india. I am german so im not sure but from meeting the people from south asian countries i,ve noticed that indian women are usually wearing saris and pakistani wear shalwar kameez. despite this, ive heard that shalwar kameez is also common in india for women. i was wondering how common it is for women to wear shalwar kameez or sari and in which parts of the coünty thanks.",
            "Just turned 18. Currently no income, just a student, going for undergraduate studies. Ready to open 2 bank accounts.\n\n**1st Bank Account is for Savings**, So I don't expect some fancy features from bank services.\n\n* Just Zero Balance is a must.\n\nI prefer SBI Bank for this because I trust that my money will be secure with them. But I'm open to recommendations for this Account.\n\n**2nd Bank Account is for Online Transactions** i.e. I would spend money from this account for shopping, fee payments, & other stuff.\n\n* Zero Balance is a must.\n* Better rewards & offers as compared to other banks.\n* Services charges should be cheap or at least minimum.\n* And convenient customer service.\n\nI prefer IDFC First Bank, but I'm open to recommendations for this account. I don't care about the bank's app UI because, after all, I'm going to use apps like GPay, PhonePe, etc for online transaction stuff.\n\nAlso, **I have heard that Credit cards are better than debit cards, should I get them?** Right now I have no income so I don't know it is safe or not to have a credit card.\n\nPlease give your opinions & suggestions for the same. Thank You. Sorry if the same question is already asked. And Also sorry for any grammatical mistakes",
            "Can I try Nakpro plant protein? It's quite popular and budget-friendly. Currently, I'm using As It Is whey protein concentrate, but I want to try something new. I'm not lactose intolerant but need your suggestion.",
            "Recommendations for books on contemporary Indian History?\n\nDoes anybody have any book recs regarding Indian History roughly from the 1970s to 2010s. Particularly around politics, especially around 'economic policy' of this time period. I find myself vaguely aware of the 'headlines' so to speak (LPG, nationalisation of banks, 08' crash) but would love to be better informed on this topic.\n\nSomeone suggested I start with Raghuram Rajan's \"I Do What I Do\", though it falls a little on the later side of my area of interest. Not sure if this falls under \"history\" technically but wasn't sure what else to call it. Thanks in advance!",
            "Failing golden kt in mumbai university \n\nI really want to cry my heart out first. i have 3 subjects in golden kt and I recently gave my maths 2 golden kt paper. i have filled 20 out of 30 pages trying my best to solve as much as I can. the paper was messy and I have really never been good at maths so I cannot say for sure if I'll clear my golden kt or not.\n\nI really really do not want to take a drop. I do not know what to do....",
            "I’m getting ads even after subscribing to zee 5. My subscription expires next month. I thinking of not renewing it. Is anyone else facing the same issue?",
            "I recently received a challan for a vehicle from 2019, even though I bought my bike in 2022. The number plates matched, but it was a different vehicle. How can I cancel this challan? Also, I received two more challans for entering a bridge during restricted hours. I always follow traffic rules and wear a helmet. The bridge is sometimes open for two-wheelers due to traffic, but I got fined from the other end. Can anything be done about this, or should I just pay the fine?",
            "Hi All,\n\nI am looking to purchase Dasuquin - med for dog arthritis. It is not available in India and has to be imported? What are some reliable sites I could use?\n\nAlternatively, if any of you are returning to India from US/Canada, I am happy to get this delivered to your place and if you could bring it back, I should be able to pick it up from wherever you are landing.\n\nThanks very much.",
            "What are some good TWS earphones under 4K for calling?",
            "What does \"start\" mean to Indians? They seem to think it means the opposite of what the word actually means (to begin). They seem to use it when they are ending things instead (so why not say the word \"finish\"?) They especially say it a lot when they are leaving work for the day. \"I'm going to start\" when what they really mean is \"I'm going to leave/finish\"",
            "Will I be able to bring my expensive laptop (for personal use) to India as a foreigner on medical visa?\n\nFirstly, I apologize if this question seems naïve, as this will be my first international trip. I'll be visiting India on a medical visa next month, and since I'm not familiar with international travel and regulations, I'm concerned about bringing my expensive gaming laptop. The laptop is solely for personal use, and it is logged in with my user account. Will I need to pay any customs tax or fees for it? Could I encounter any issues because of it? Thank you in advance.",
            "Politics \n\nOkay so the context, we all know the opposition candidate isn't a great guy but how difficult it is for us indians to understand that a religion which is existing since god knows what time and will exist forever as well doesn't need a political party to be it's face? Also isn't it clearly evident that so many candidates or workers from the current party are rapists or offenders I mean look at the guy who raped 400 something females, also isn't it quite evident that the leader changes his words alot in every interview or speech, he clearly lies, clearly manipulating media and etc etc how can his fans be so blind? If you're his fan please change my pov I'm open to changing it.L",
            "Why are IAS officers wealthy although they don't earn a substantially large amount of money? Is it due to corruption? Idk my colleague told me that they earn 1cr minimum just for signing a document- is that true?",
            "I am attempting to do some historical research on various 1960s-70s rock music groups from India. In this pursuit, I just read this article about the Junior Statesman (JS) magazine, a teen music magazine from the late 1960s-1970s:  \n[https://www.aljazeera.com/features/2021/12/9/the-rise-and-fall-of-js-indias-70s-cult-youth-magazine](https://www.aljazeera.com/features/2021/12/9/the-rise-and-fall-of-js-indias-70s-cult-youth-magazine)  \nwhich, of course, seems like it would be an invaluable resource for this type of study. Would anyone know if the digital archive mentioned in the article above has appeared online anywhere, or if there is another archive accessible from any world libraries? Any help on this would be much appreciated, many thanks!",
            "Indian Rupee Customs Declaration\nI want to know if I bring over 25,000 rupees in cash to India and declare to customs on arrival at the airport the amount I have if there will be a problem? I've researched and can never find an exact answer. Is it completely forbidden to bring over 25,000 or is it just the maximum I can bring in before needing to declare it to customs. Does anyone have any first hand experience with declaring to customs an amount in rupees over 25,000?",
            "Guys i came across a website called zeelab pharmacy, is the company legit, they sell medicine at a very cheap rate.",
            "With all the articles on adulteration of food items; l wanted to know is there list of products in markets that are your go to that not adulterated. Please I appreciate it if the conversation is kept to only the products that are good so we all have some products to rely upon.Thanks in advance",
            "any monasteries to stay around Dharamsala?\n\nI’m currently in Dharamsala and am looking for a Buddhist monastery I could stay at for a few weeks. I just want to practice meditation for a bit without distractions.\n\nAlso open to other traditions as long as they provide a private room and a meal.\n\nWould really appreciate your help. Been here a few days but so far not many leads.",
            "Hi,   \ncan someone suggest me joggers with zipped pockets, i would prefer relaxed fit. Thanks",
            " i am looking for hill stations of any other good travel destinations to go to with a few friends during the month of june. \n\nIt would be best if the places are easier to reach from north india and not very crowded (unlike the typical nainital darjeeling etc) \n\nPlease do lmk your suggestions",
            "I am a US born man of Indian heritage. Long story short I’m trying to see if I get a visa for Pakistan and travel there for potentially family reasons, will I be able to still go to India after? I’ve been told that I am not going to be able to ever go back to India if I get stamped in Pakistan is that true?\n\nAlso let’s say I have half Indian half Pakistani kids, are they gonna have issues too?",
            "How does dream11 earn money and is it legal in India? The company has grown very sharply in the last 5-6 years signing a lot of big brand endorsing assignments. I read that the company plays on the gray line of what can be termed as gambling and what cannot be but are there enough cases to conclude if it is or not? Have people become addicted to it and lost a lot? Or is it like a cigarette packet that stays safe because it gives disclaimer of cancer and leaves consumption to people? \n\nAlso I am aware that there are apps which promote gambling directly and indirectly and therefore this is more of an inquisitive question rather than an attack on the company. Just looking for insights on this company. Thank you.",
            "**Say the weird /unpopular thing**\n\nLet out your most unpopular opinion or the weird thing. \n\nFor eg:\nI hate the song \"Tera bina zindagi se koi shikwa\" by Kishore Kumar. Love rest of his songs.",
            "Greetings All,\n\nMy brother is in Thailand, and I want to get an Apple MacBook Air M3, which is approximately 32 thousand less than the Indian price. I was happy at first, but then I remembered customs duty on it. Has anyone ever come across such scenarios where anyone brought something from Thailand or Dubai? How much customs duty do we have to pay when bringing such one-time electronics items to India from Thailand?",
            "Does tempered glass / screen protector and mobile covers actually increase protection? Or can i use phone without them which is what i prefer?",
            "hi! market research question if you want to help me out: as someone from India who regularly pays with UPI, do you immediately know what a payment method called \"UPI ID/VPA\" is?\n\nI ask the question as there are different types of UPI, so at work we want to make it clear which type is which. thank you!",
            "Driving License Application \n\nSo basically i am stuck in a bad situation. Here is the ordeal:\n\nMy LL is about to expire on 31/05/2024, i checked the DL appointment status and it showed booked on all dates..so I thought of booking with special quota LL about to expire, Once i made the payment for DL application and got to the page of slot booking, i was surprised to see it did not show on any quota and showed no slots under general category. Now once the new dates come for normal slots, my LL would have expired by then..\n\nApplication Date : 20/05/2024",
            "Need Some Help/Guidance To Find Vendors/Wholesalers Dealing In Handlooms/Textile Industry\n\nHi, I'm not a frequent reddit user so I'm unsure if this is the correct place for this query. If it is not, please redirect me to someplace where I can place this.\n\nI'm looking for vendors to supply me with some items for textile-related classes. Basically for teaching purposes, to students of different age groups. Primarily, I'm looking for these four items:\n\n1. Thread Spinning Charka (Spinning Machine of 24\" x 10\")\n2. Small Tapestry Weaving Frame Loom (Of size 24\" x 36\")\n3. 4 Shaft Weaving Looms (Of size 18\" x 24\")\n4. Weaving Comb Beater Wooden ( About 5\" - 6\")\n\nI appreciate any leads or direction on how to find these\n\nThanks in advance!!",
            "help\n\nHow do I purchase a nitrogen gas (pure) cylinder for individual use? How do i order it and from WHERE?\n\nCan i have it delivered to me?",
            "Do you have any courier service to recommend to import non prescription medicine from India to EU ?\n\nI would like to buy some medicine on Indian marketplace like 1mg or Netmeds to get them delivered to EU. The medicine I want to buy are without prescription, easy to find in Europe, but there are waaaay cheaper on Indian website and there is a lot more choices there. Do you have any service to recommand ?",
            "Hi everyone,so I recently applied for a passport and went for the police verification but there was a slight issue with my application where the education was filled as 'graduate and above ' which I don't even remember filling up to be honest and since I still have like 2 months until graduation,they told me to cancel my passport and reapply.\n\nNow can anyone tell me how do I even cancel it ,check on the website,I don't see any cancellation,just that surrender certificate.\n\nI would really appreciate if any of you can kindly share some wisdom",
            "I'm not sure if this is the right place. I'm looking to purchase a gift of chocolate for a colleague who is located in India (I'm in the US). ideally, I would purchase on an Indian site so I don't need to ship it all the way from here. Does anyone have any idea how to do this? I can't figure it out.",
            "Please suggest me a laptop in the range of 60-70k.\nMy needs-\n1. Best display possible which don't fuck my already fucked eyes. \n2. Performance needs to be top notch in this range. Like I will runing multiple applictions, coding(basically python I love python man lol) and video watching(anime at max visuals kek). \nDon't care about gaming but some applications I use demands GPU so will be great if it does have a dedicated GPU. Ignore GPU if for GPU I have to compromise performance.\n\nAlso, planing on buying from Amazon/official site as I heard many bad reviews for flipkart. \nShould I buy on emi or one time payment?",
            "Are PC based MOBAs popular in India in comparison to other games like mobile games, FPS, etc.?\n\n  \nWhich mobas are most popular over there?",
            "I've recently starting watching Vimoh's live streams on YouTube, which I find quite engaging. Despite his atheistic views, his sessions often delve into philosophical topics. I am on the lookout for similar long-form YouTube channels that focus on philosophy and are created by Indian content creators, available in English or Hindi. I would appreciate any recommendations, excluding channels akin to Beer Biceps and those of a similar nature. Thank you.",
            "[deleted]",
            "These days I'm getting a lot of automated calls from election campaigns, is there any way to block these? I've tried blocking a lot of the numbers manually but they call from new numbers everytime I block one :(",
            "I ordered few products from US, they had an option for DHL delivery i paid for it. Now I got an email saying that I need to upload KYC documents which I don't have any problem with. The problem is they are saying KYC documents must match with shipping address. I'm staying at a PG for work outside my resential address. There is no way I can get rental agreement since it's a PG. Kindly help.",
            "Why does the Congress Party keep running Rahul Gandhi as their leader?",
            "I am planning a backpacking tour (duration is not yet fixed). I plan on travelling light and cheap (accommodation primarily, transportation second). I have no problem with trekking. I plan to go to:\n\n1. Ladakh (from Siliguri)\n2. Then Himachal Pradesh\n3. Sikkim\n4. Arunachal Pradesh\n5. Nagaland\n6. Meghalaya\n\nPlease suggest me:\n\n1. Places that I should visit\n2. Cheapest/Best way to travel to each location\n3. How to find the cheapest possible accommodations and meals in each location\n4. Any interesting activities\n\n  \nI know I am asking a lot. But Google is very confusing or does not return relevant answers. It would be a big help if someone would guide me. TIA.",
            "To give you an idea, I wanna watch it with my father for i really like those moments.\nWeb series like , panchayat, khakee the Bihar chapter, maamla legal hai ( i didn't show him that one episode where they take a stand for the sex ), scam 1982.\n\nMovies like 12th fail, srikanth all the feel good family movies are his type too. \n\nYou get the idea. I don't have any problem with cursing or tbh even a mild scene of kissing or sex which lasts for 5 sec but not full on. \n\nI am considering family man but I found there are some heavy scenes which isnt the best sort to watch w him..\n\nPlease give me suggestions mostly around comedy, or some thrilling sort of adventure. Thank you",
            "I am from the UK and recently did a banknote swap via post with someone from India. The letters were sent on the 18th March but they still have not arrived. The stamps on the letter added up to 40 Rs. Does it usually take this long?? Thanks",
            "  Hey fellow Indians, I am not sure if my question can be answered here but I give it a try. I am looking forward to my trip to Phuket in the end of this year and tound Air India offering cheap flights to the Thai island via New Delhi. They are going to utilise one of their 787-8 aircraft and what I was reading so far didn't really make me want to go with them at all costs. I heard about weird smell, bad customer service, malfunctioning aircraft buttons etc. A light at the end of the tunnel could be the takeover by this company called Tatu. People say, it's going to take time but it might improve overall quality of Air India flights. So now, your opinion is asked. What do you think about that? Have you recently flown Air India and could confirm what they were saying? Is some improvement compared to 2020 visible already? Or do you have some positive experience to share? I am very interested, please let me know! thanks in advance!!",
            "All good people of my beloved country, I have a small question for you that I need help on.\n\nAre online courses or degrees credible to upskill and potentially look for better opportunities? I want to get into a MBA-Business Analytics course, but would not able to drop out of job because of attached liabilities.\n\nIs a online MBA degree for a reputed university still credible? Will it help be fine better opportunities and place me in a considerable position in the selection pool?\n\nAny suggestion would be very helpful. Thanks!",
            "Hey! I was wondering if it's possible to send a message along with a cake or flowers on birthday to someone. I would have portered a cake and letter as a parcel myself but I live in West Bengal and this has to be delivered in Delhi.\n\nI checked out FNP and the likes but couldn't find the option to add a personalised message, since I need a 100ish word message sent to them.\n\nIt doesn't even need to be handwritten or anything fancy. Just need my message on a peice of paper to be sent along with the cake, printed would be okay too.\n\nAny ideas about how I could get it done?\nThanks in advance!!",
            "If my brother sends me a small parcel (approx 2kg) containing SS screws (small size 5mm diameter, 10mm long) from Canada to Bangalore in express service on my personal name, will I face a problem in customs by any chance for the same ?",
            "I have accumulated loan of 12 lakhs from (2 personal loans 2 credit cards and 3 app loans). I was paying around 50k as emi and I had around 1+ lakh as my monthly in-hand salary. I lost my job last year October and I couldn't find a job ever since. I managed the dues till last month and this month I am penniless. I've been getting harrasment calls from banks and they are visiting my place. I don't have a single rupee to pay them. I need time to find a job and start repaying. \n\nHow do I ask for more time? \n\nMy father passed and It's just me and my younger brother. I'm a women in her early 30s and I take care of the family. I took the loans to pay of mums debt. We don't have our own house and I have no jwelery. \n\nWill I go to jail If I don't pay?",
            "Okay so I placed an order to print a document on Blinkit. When I checked the order there was a page missing so obviously i raised a complain and they issued a promo code for the entire order amount (Rs. 105). \n\n\nAn hour or so later the delivery boy showed up at my doorstep. My brother answered the door and the delivery guy asked him about the complain. Turns out Blinkit deducted Rs. 1000 from his salary on the grounds that he never delivered the order to me. I double checked to make sure I didn't accidentally select the \"didn't receive my order\" on the Blinkit automated chatbot platform. \n\n\nI kinda feel bad because Rs. 1000 is probably what the delivery guy earns in a day. I don't know whether to take back the complain because blinkit might not cancel the delivery guy's penalty. I would write an e-mail to Blinkit but I'm not sure how they would perceive this especially since the delivery guy turned up at my doorstep. So any advice?",
            "Took drop for JEE and it didn't go well so now what next ?\n\nMy qualifications is 12th passed in 2023 and took drop for 2024 attempt for JEE which didn't go well so then I gave CUET and completely changed the courses so now what I want to pursue, like I'm interested in BA courses in Japanese from JNU, Social Work from TISS and also Economics but not sure if I will get it or not or which college is best ?\nI'm also interested in LLB but I don't know a thing in legal studies so CLAT is out of option but considering it if I can prepare for it own my own able to crack it so should I leave the program in which I will get enrolled now for NLU or not !? \n\nAnd out of all these choices, which are generous ones and able to get me a job easily ? \n\nI love to learn Japanese and I like economics also and got 75% in intermediate result!\n\nIn CUET exam, I smashed the English subject paper but General test was on average!! Gave PCM exams also !\n\nPlease guide me through all this mess, I want some helpful insights, information and suggestions!!\n\nThanks",
            "So my nephew is about to start applying for junior colleges in Mumbai and just mentioned that Science stream now allows dropping biology for economics, and so you don't necessarily need to take bi-focal/vocational (computer science/electronics etc) to drop biology.\n\nSorry to be a skeptic, but is this true for junior colleges in Mumbai or is he capping?",
            "Help me plan a long distance surprise gift delivery. \n\n \nI'm planning to get a flower bouquet and cupcakes delivered to my friend for his birthday. The issue is that he is in Kanchipuram chennai and I'm in a different country. I need help finding an online business that can do same day delivery for cupcakes and flowers to that location. Preferably businesses that have a website and accept PayPal payment.  \n\nWhat I've found so far is FNP and Flower Aura, but since I'm not Indian, maybe I'm sleeping on better options.",
            "Anyone know what's this RDIFAMT charges in PNB bank?",
            "Hi folks! Can you please suggest any Good brush cutter machine brand available in India for personal use?\n\nI am looking to buy a durable and robust brush cutter machine for personal use(mainly grass cutting at home). In my research, I have come across many brands like stihl, RBD, Balwaan, Boston International etc. None of them have any satisfactory review. General consensus in reviews in Amazon and Flipkart is that the parts of all these companies are of average quality. While I don't know anyone personally who uses this machine in my vicinity or in my circle of friends/relatives/acquaintance, I also don't have much idea about this kind of product to judge it at any offline tools and equipment store.\n\nSo, can you guys share your experience with this type of tool and the quality of the product of the brand(s)? Any suggestions and information that will help me buy a good value for money quality tool is welcome.\n\nThanks in advance!",
            "Hi Folks! I am planning to buy a tablet for basic daily use like reading, watching netflix, and using Notion. I have browsed some tablets: like Samsung Galaxy Tab A9, Redmi Pad, Redmi Pad SE. My budget is around 15k. Can you suggest which one would be better among these? Also other suggestions are also welcome",
            "Traveling for an Indian wedding\n\nI'm thinking of going to Gwalior for a wedding I've been invited to. I believe the wedding is occuring at the same location as the hotel. I'm a woman in her 30s. Any tips? Recommendations?  I'm seeing if I can get a +1 to join me for safety. \n\nThey recommend getting there via Delhi Airport and either taking a domestic plane to Gwalior or they will arrange a taxi. \n\nThanks!",
            "Ordered gym equipment from Amazon few days ago and the delivery date was showing as next Sunday and it still shows. I got a verified call (Truecaller) from Delhivery today and he asked me about my address. I told that I had put the address properly on Amazon but he told it's showing only \"Mumbai\" and then he told the correct brand name of the gym equipment and told, \"Your delivery is in CST. Where do you live though?\" I said my location and asked when the order will arrive. He said two days later and said that it will go from CST to so and so office and then it will reach your home. Is this normal?",
            "Need Advice on Health Insurance Policies\n\nHi, I'm 34m in perfect health living in Mumbai. Currently I hold two health insurance policies. National Insurance Mediclaim for 10 lacs coverage and Niva Bupa Reassure for 20 lacs. I had bought the Niva Bupa during Covid when I was paranoid. I'm not wondering does it make sense to hold two policies? If no then which one should I discontinue? \n\nWould appreciate any advice. Thanks",
            "Can anyone of you help me find a movie?\nI can only remember, like just barely a bit of information. In the movie, a group of friends get send down to hell, i guess?.\n\n Where they have to do tasks to get out and get a wish form a angle or something.\n\n By the end all but only one friend survive and the angle ask his wish. \nHe say he didn't need it and goes away. \n\nI guess on his scooter. \n\nThe angle say \"he say's he don't need it but he will come back and make the wish\". \n\nThat all i remember. I watched it on tv like around 2010-12. \n\n\nTl;dr. Friends get send to hell, all but one survive, one can wish anything, refuses and goes away. \nThank you.",
            "# Which phone should I buy? Poco X6 Pro or One Plus CE 4\n\nI'm gonna mainly use the phone to play games and watch movies, and don't really care much about the camera. My budget is around 25-26K",
            "Is it worth abandoning starhealth insurance?\n\nMy(17M) father(52) purchased Star Health insurance in 2019, which claimed to cover INR 5 lakhs for each individual in our family of three. Currently, the premium has increased significantly from INR 22,000 to INR 36,000 over the past five years. Additionally, I've heard that Star Health is notorious for rejecting claims. Hence, I am considering abandoning our current insurance and starting a new one.\n\nI've been looking into HDFC Ergo Optima Secure, which has received positive reviews. If anyone has experience with HDFC Ergo, I would appreciate your insights.\n\nFurthermore, my mom is a state government school teacher in West Bengal. If there are any health insurance options available for such employees, please let me know",
            "What are some Youtube Channels, blogs, news channels which give proper knowledge about India's history, politics, culture, geopolitics, sports, world history and other knowledge a Indian should acquire.\n\nI have turned 22 and while I am not preparing for Civil Service Examinations, I want to be a citizen who knows about his country, the conditions it went by and the challenges its facing.\n\nThough may feel problematic but even with no adequate knowledge, I don't think any party is good, everyone is using religion to acquire votes. As someone who is interested and has read about my own religion and other religions' culture, it pains me to see them fighting.\n\nThus the reason, I want you to provide sources whicb provide facts rather than stating something favorable for one, while hatred for other.",
            "ON 9-03-24 I PURCHASED TWO PS5S FROM A SHOP IN KHAN MARKET DELHI WHICH WAS THEN DELIVERED TO ME. I HAVE THE INVOICE FOR THE PURCHASE.\n\nI OPENED ONE OF THE BOXES AND REALISIED THE CONTROLLER WAS USED. CONFRONTED THE SELLER AND HE GHOSTED ME OF SORTS AFTER MAKING ALL SORTS OF EXCUSES. FAST FORWARD TO PRESENT DAY I FINALLY OPENED THE OTHER BOX AND TO MY SURPRISE I REALISED THE PS5 ON THE OTHER BOX WAS USED BUT THE CONTROLLER WAS BRAND NEW ON THIS ONE. I TURNED IT ON AND IT STILL HAS THE USER DATA OF THE PREVIOUS USER. IDK IF THAT COUNTS AS PROOF BUT IS THERE ANYTHING I CAN DO LEGALLY AGAINST THE SELLER.\n\nTHE SHOP IS A PRETTY HIGH END OUTLET. NOT A SURPRISE GIVEN ITS KHAN MARKET IN DELHI. I KNOW IT WAS VERY CARELESS AND STUPID ON MY PART TO CHECK ONLY NOW BUT I DID HAVE A SUPER TIGHT SCHEDULE AND HAD TO LEAVE DELHI THE NEXT DAY. CAN I TAKE ANY LEGAL ACTION?",
            "Could someone help me figure out UPI. i have to pay something with UPI but i dont have Access to it.",
            "I lost my sim when I went abroad. When I went to the Jio store, they told me that my biometrics are locked and I should unlock it. If I go to the aadhaar enrollment center, would I be able to unlock the biometrics or should I get a new sim?",
            "can i carry small indoor plants on international flights? i really want to bring my small snake plant to my new home in the Middle East. Do you think plants will be allowed through? ideally I want to put it in checked baggage. Will I have to declare the plant at customs?",
            "Hello everyone! A few hours back I received a call from an unknown Indian number. On receiving the call, there was an IVR informing me that I \"failed to collect a district court summon letter and legal action will be taken within the next 2 hours\". The IVR does not mention any court name or location or anything. However, I was prompted to press 9 if I had any queries. I did that and spoke to a person called Karan Kumar from District Court of Mumbai. He tried to get my info or any summon number. Which I'm sure he knows I didn't have. He then asked for the last 4 digits of my Aadhar. I did not provide that. However I did mention my name in panic (due to the initial astonishment). Should I lodge a complaint against it?\n\nPS: I did not face any issue yet.",
            "How to deal with the guilt of a non useful high value purchase ?:(",
            "Hi all!\n\nI am planning to go around our country but not as a trip. I am planning to go to a city and work there at some job for maximum a month , then shift to next city and so on. In such a way I am planning to cover all states and UT/s . If anyone have any experience or can guide me please help! If anybody want to join me, you are welcome. If you can provide me with some work in your city, please DM we will discuss.\n\nThanks in advance.",
            "Hi everyone, I have an assignment for my communications class where I am to learn about workplace culture in India. What better place to ask than on [](https://www.reddit.com/r/india/)?\n\nDo you have an opinions/thoughts on any of these questions?\n\n* Describe a typical workday.\n* What is the general sick leave policy?\n* Explain annual/vacation leave.\n* Is maternity leave offered?  If so, explain.\n* Is competition emphasized?\n* Is it appropriate to express concerns at the office?\n* What do they eat?  Are some foods offensive to eat at the office?\n* What days of the week and hours of the day are spent at work?",
            "what salt is used by indian street vendors for making popcorn? What kind of salt is that actually? I don't know why but the popcorns just taste really good when made in that salt...",
            "Hi all! Is anyone here working with the embassy or familiar with how entry for folks under student-intern visa works? \n\nI'm an Asian studying overseas and will be in India for a two-month summer internship. I was granted a multiple entry student visa so I was thinking to go to my home country in the middle of my internship, but I was advised by HR to not leave the country to avoid complications upon re-entry. \n\nHoping to get advice as I'd love to visit my family but I'm also mindful of any potential complications, if any. Thank you!",
            "Households where everyone works outside, how do you manage parcels\n\nAs many of you may know, in US and other Western nation, it is normalised to leave parcels outside at doorsteps with excuse that \"Most people aren't home at the time\". So how does people in same situation in India handles it since thankfully not only do they hand it over, many cases they even need OTP to deliver it",
            "Has anyone used Oikos Paints? Is it good???",
            "Is studying Law still worth it as a career option in 2024, if i wanted to earn a decent salary?",
            "*How to verify if an Indian Company is registered?*\n\nHi! I’m working with an Indian freelancer and he’s signed documentation under a company name. He says it’s registered under MSME and provided his “Goods and Service Tax number”.\n\nThis doesn’t see very reliable so want to ask if it’s normal to use the tax number as a company reference, and whether there’s a way to verify if it’s actually registered. \n\nThank you.",
            "Passport issue : need help\n\nI am currently residing in Bangalore, my passport was issued in Delhi and has my Delhi Permanent address. I need to change my name in my passport now, would i also be needed to change my address to bangalore? My aadhar has the bangalore address right now.",
            "Hey! We are looking to open a company in India from abroad and we found this company RegisterKaro that can do it for us. \n\nHas anyone worked with them? Are they legit and can be trusted?",
            "Hello! I'm non indian and living outside india. I want to purchase few things from myntra but the app requires indian number for sign up.Is there any way to open myntra account without indian number?",
            "Hi! I have been dying to figure out the name for this one specific dance movement. It is commonly known as changing the lightbulb or screw the lightbulb where the people imitate changing a lightbulb. I want to know the formal name for this if there is one or atleast what is is called in the language.\n\nThe dance is famous in bhangra and bollywood party music and weddings and it is very common -- it is also the staple of the Tunak Tunak Tun dance choregraphy. There has to be a name for this motion.",
            "Hello, I want to do BSc in physics but was wondering if I should do BSc(hon) or BSc+MSc or BSc(hon)+MSc or BSc+MSc(hon) or BSc(hon)+MSc(hon). I want to pick a path where the degree has more value but isn’t taking a long period of time. please help!",
            "Have you guys ever known someone who indulges in occult practices. Please share your experiences with them. \n\nRecently, I came across someone(online)who's into these things and I'm scared and as well as excited regarding the unknown. What would you guys say ?",
            "I was applying for renewal of my driving licence on the sarathi.parivahan portal, I completed the first 2 steps of filling the form & uploading documents. Now it was stuck at the last step - Fee Payment. I tried paying once but it didn't work.\n\nWhen I click on verify payment status it shows me a blank page.\n\nAnd when I click on Proceed it says \"Please select a flow to continue\". The problem is it is not allowing me to select the payment option...\n\nHas anyone faced this issue? Is there a way to resolve it and complete this process??",
            "Hello People, \n26 M here with thin/ Asian hair. \n\nIf any of you have the same problem give me your solutions. \n\nDo you guys apply hair oil daily? \nIf yes, what oil and how do you apply? \n\nIf not, then how do you comb your hair without oil or do you apply anything else?",
            "Hey indian ladies and men living in the USA, I'm in a bit of a dilemma here and wanted to seek some advise. My parents live by themselves in India and want to visit us this summer. They say that when parents visit kids in the USA they are there for about 4-6months. My husband is very clear that anything more than 10-12 days will make him very uneasy. In the past when they've visited for longer it's really been a very stressful time for me. When i communicate this with my parents they tell me that I have to convince him. That they spend a lot of money to travel to USA so it can't be such a short trip etc. They are also older and traveling is not so easy. I love my parents and I care for them but I also want their trip to be an enjoyable one and not one where my husband chooses to sulk. Also summer is the only time, we get some time to ourselves as a family for our own travel and such and my husband wants to make the best of that for our family time. I do not want to make my parents feel that they are not wanted by me but at the same time I want to tell them to respect our wishes as well. How do I tell them this? Or am I being unreasonable? If i'm being unreasonable what can I do to convince my husband?",
            "Hi,\n\ni’m currently registering for my OCI (i live in england but was born in india) and i’m just wondering if my parents can get it too. I was adopted but they were born in Sri Lanka, so i thought they could get it through me since they are my parents but would just like confirmation if they can or not.",
            "Hey, I’m an American and one of my coworkers (I used to be his manager but am not anymore, not sure if that’s relevant at all) lives in Tamil Nadu and is getting married. In the America we typically give gifts to people when they’re getting married and I’d like to send him something nice as a gift. I don’t know what he would want so I was planning on sending him $100 USD or ~8300 INR so him and his wife can buy something they would like. I cannot buy an Amazon gift card that will work in India with a foreign credit card And I can’t find another way to send him cash or a prepaid debit card or something that would be equivalent. Is there any good way for a person in the US to buy a gift or send cash to a friend in India? I’d appreciate any help or advice. Thank you.",
            "Hi!\n\nCan someone lead me to subreddits for job seekers, hiring, and freelancers in India? Would appreciate it. Thanks in advance.",
            "Hi so I’ll be traveling to India next month and I’ll be staying mostly in Mumbai/Pune. \n\nIn the last week of June I want to travel to either Gangtok or Darjeeling for 4 days. Which would be better? Mostly I want to relax whilst also exploring different food and drink experiences.\n\nAny suggestions welcome. Thank you!",
            "I live in a village near a tier 2 city in Gujarat. I visited multiple shops offline as well as checked online and found 4 brands of ac to be attractive: Daikin, bluestar, Hitachi, LG.\n\nThe offline prices are all 3-4k higher than online and am also getting cashback from my credit card but I'm in a dilemma whether buying online is reliable as you know parents and relatives say \"beta agar kharab ho gaya toh kya karoge\".\nSo considering all the factors like reliability and after sales service is it good to buy online???\n\nBtw I only have LG service centre in my nearby city",
            "[https://www.youtube.com/watch?v=DMpl4HEezrY](https://www.youtube.com/watch?v=DMpl4HEezrY)\n\nI'm looking for the song title in this video starting at 2:51. I already know the first song but not the second one.",
            "Hi, My mother transferred large amount of money to a negative balance account by mistake.\n\nShe sent the money to a relative through PhonePe UPI. But the bank account linked to the recipient on PhonePe has a negative balance of more than 1L+ due to loan repayment issues. And the amount she transferred is 75k. So the bank adjusted the amount in the negative balance. I contacted our bank's Customer care and lodged a complaint, PhonePe told me to visit the bank, so I did and our branch manager (SBI) sent an email to the recipient bank's branch manager (Axis bank) asking to reverse/refund the transaction. But the bank told us that the amount has been adjusted in the negative loan amount and they cannot refund it.\n\nI'm badly stuck since the money need was urgent for some other purpose and it got lost in this. Can anyone advise me what I can do in this situation to get the money back?",
            "I’ve been talking to this North-East Indian girl recently(she is very Christian so I assume Assam) and her name is Jangkime. I have no idea how to pronounce that and was wondering if anyone could provide some assistance?",
            "I have a small electric hair trimmer (Remington Self Haircut) with a rechargeable battery (that cannot be taken out). I've taken it in my carry-on luggage in many parts of the world, but I'm not sure about India since I've had the tamest things seized (e.g., a 2-inch allen wrench). Indigo's website states that hair trimmers with battery are allowed in carry-on, but trimmers without battery aren't. It doesn't make sense that a device without a battery isn't allowed, but one with battery is. Nevertheless, given that mine has batteries inside, can I be confident that I won't be hassled by the security staff?",
            "I will be travelling back from Krakow to Bengaluru via Munich with a layover of 1hr 15 minutes. I wanted to know if I will require an airport transit visa if I have a valid Schengen visa from Poland?\n\nThe flight operator is Lufthansa and the ticket is on a single PNR.\n\nThanks.",
            "Does anyone know what does this mean for India post?\n\nI sent a package to a friend and when I track it on India post, it now shows the event type as “Custom Hold” with the remark “AWAITING PRESENTATION TO BORDER AGENCY/S”. Is it normal and when do you think it will be delivered? Thanks",
            "Just a question. Whether the person who is working and having experiences in different field ,if later applies for another job which is different from his previous job, then should he apply as an fresher or recruiter? (i know it may sound silly or senseless, but this question was roaming my mind)",
            "I ordered a refrigerator from the official LG website and it has not been delivered yet. And on top of that they have taken the item back, without any intimation. \n\nI have raised a complaint with the national consumer helpline by lodging a complaint and the associated invoice documents. \n\nWould the helpline of any help ?",
            "Looking for anyone who lives in Chennai\n\nI am in the UK. My next door neighbour (an old lady) is dying. Her brother was killed while serving in India and is buried in the Madras War Cemetery in Chennai. He was 22 when he was killed in a plane crash. She has never been able to visit the grave and has never seen his headstone. \n\nI'm hoping some kind person could take a picture of it for me, and send it to me so, I can surprise her with it before she dies.\n\nThe grave location is in section 5 row E grave 1\n\nThe name on the grave is \nFRANCIS BERNARD BRINDLEY\n\nThe plan of the Cemetery can be downloaded here...\nhttps://www.cwgc.org/visit-us/find-cemeteries-memorials/cemetery-details/2015100/madras-war-cemetery-chennai/\n\nCan somebody help me?",
            "**Native M1 Water Purifier - Time to fill?**\n\nI recently purchased a Native M1 water purifier and honestly bit surprised to see that the 8 liters tank getting full in approximately 20 minutes. Wondering if that is the case with everyone using Native M1? The technician who installed the machine advised it would take upto 40 minutes for the tank to be filled but my machine cuts it down by half. Just want to  know other’s experience and make sure that there aren’t any issues with my machine.\n\nThanks, any insights appreciated!\n\nP.S: I previously used an Aquaguard with 10L tank capacity and it would easily take 40 - 50 minutes to fill.",
            "What’s your view on the videos circulating in social media about food which presents India in a negative light?\n\nI am quite curious about this. There are a lot of posts on other subreddits that discuss how India has bad hygiene, disgusting food, and being too extra on social media. What’s your view on this?",
            "Indian SIM in USA\n\nSo I am moving to the US for a couple of years for my studies. I have a Jio SIM, and that number is linked to all my documents (Aadhaar, PAN, etc), bank accounts, investment folios etc. So I need to keep the number with me. Which SIM carrier can you recommend for this?\nI just want to keep the number with me, and keep recieving OTPs, and sent messages for authentication purposes.",
            "I need suggestions for wireless earbuds that can be paired with an iPhone and a MacBook. I'm looking for budget-friendly options since I'm a student and will be buying with my own savings",
            "Hello everyone. What a the best long term Investing platform for Indian and US stocks?\n\nLooking for reputed companies and want to know your opiniona on what you use and what options are out there\n\n\nThanks in advance",
            "[deleted]",
            "Hello \nI recently booked a round trip for my parents from Goa to Mumbai (and back) for mid June. It was booked in the last week of May. Due to some sudden changes in plan, we have to cancel the return flight. \n\nThe round trip costed around ₹11k+. But the total deduction for cancelling only the Bom-Goa trip is ₹10k+. And they're giving a refund of merely ₹900. Their cancellation policy says that fee for cancelling 4+ days before departure should be ₹3000 and 0-3 days before should be ₹3500. Yet the deduction breakup shows a cancellation fee of ₹3840. Other fees in the breakup include airfare charges (₹3,960), convenience fee, aviation fee, user development fee (₹1,168), and GST. \n\nIs this how it's supposed to work? Can anyone help me out here?",
            "Hello Guys, I hope you're having a pleasant day!  \nI hope I am asking this in the correct subreddit. I had taken an educational loan of 4 lakhs from Bank Of India for a repayment tenure of around 10 years. However, I got a job and told the bank that we would want to pre-close the loan within an year, since I didn't want to pay compounding interests. And, the loan account was closed and I got a NOC as well.\n\nHowever, in my cibil, they have reported it as \"Restructured loan\", and I was asked by HDFC bank recently about this when I approached them for a personal loan. I'd be very grateful if you guys could please let me know how to remove this false report in my CIBIL, since it's adversely affecting my CIBIL ?\n\nWishing you guys a splendid day ahead !\n\nPFA Cibil screenshot: [https://postimg.cc/SjTcN8Zj](https://postimg.cc/SjTcN8Zj)",
            "Hello, does anyone know if esims work in Leh/Ladakh? Will be travelling there soon and was looking at plans from Airalo or Nomad. Thank you!",
            "Food combos u love but many don't?",
            "Online MBA\n\nHi everyone!\nWhich is the best Online MBA institute here in India and why should one join it? Like are career opportunities better after MBA from the said college. I’m strictly speaking about online mba.",
            "Hi everyone! I recently did a freelance project and for payment they asked for bank details which included account holder's name, bank name, account number and IFSC code. I shared these details but now I am worried whether it was the right call to do so. If it was a fraud then does sharing these details put my account under risk? I talked to my bank and the manager there scared me even more.",
            "Please recommend which dashcam to buy?",
            "\n\nMHey there , i’ve been looking to transfer my vehicle from tamilnadu to west Bengal, the rto process i’ve searched so far suggests obtaining NOC and repaying road tax , but the vehicle’s that i hold have a road tax paid which is valid for 15 years , however they still say us to pay tax for transfer , \n\nis that the case till now , can anyone help me out if you’ve done this in recent year in your state , and a small caveat is that the vehicle that i’m willing to transfer is on my moms name , will that matter to be changed to mine before transferring to other state ? Any suggestions, help me out please, thank you :)",
            "Today, 3rd June 2024, I sent money to a person through their UPI Id but they did not receive it. After a lot of back and forth, I learnt that the UPI Id I sent money to has been changed. However, when sending the money through Google pay, their were no errors and the name of the person I want to send the money to showed up and the amount was successful sent. But the other person did not receive any money. It cannot be another person with the same name as the person I was sending the money to has a very unique name. Also Google pay showed their full name. Did I just loose my money?? Is there anything I can do? Please help 🙏",
            "Does anyone know if rohtang pass is open tomorrow (Tuesday)",
            "Hey guys!\n\nI'm (19F) planning to head over to India this summer to learn about Bhairav worship practices and its history. I have some places in mind from research but would love some input. I'm from Norway studying anthropology but my knowledge in Hinduism is fairly limited to books and websites.\n\nI'd love some suggestions on places that are safe and have a lot of Bhairav traditions (maybe even certain times to visit for celebrations?).\n\nThanks! :D",
            "People have worked with contractors and builders to build your own home, have you had a clause in your contract to avoid delays in your construction project?\n\nWe were thinking to add a clause mentioning for every day delayed by our builders beyond the agreed time, they will bear a penalty. Is this a bit too much? I spoke to our builder and he says this is not done by anyone in India.",
            "So i pay income tax, then converting currency takes some money away, then i find out govt takes out 20% tcs for anything spent from forex card. Even taking out money from ATM to deposit in your foreign account will be charged 20%. eg. i take out 100 pounds, my Niyo global forex card will charge me 120 pounds.\r  \n\r  \nSomeone informed me i can get a refund on it but not full amount the NEXT financial year after filing ITR. Which means my fund will be blocked for a year.\r  \n\r  \nIm not a finance guy, far from it. Can someone explain why should indian govt get a piece of what im spending in foreign country after ive paid my income tax ?\r  \n\r  \nTurns out, govt increased this from 5% to 20% last year which is absolutely ridiculous cause everything now is 20% costly for me here in UK.",
            "My company fired me on May 29th, and they’re giving me a severance package equivalent to two months’ salary. However, according to previous appraisals appraisal letter was supposed to release before april , my appraisal letter was delayed. Since I was fired on May 29th, I didn’t receive my appraisal letter, and I was supposed to get promoted. My salary was not increased due to the delay in the appraisal letter, but now my company is giving me severance based on my old salary, not the appraised salary. Am I supposed to receive the appraised salary for the two months’ severance, or the old salary? I’m confused; please help me out here.",
            "Hey! Is anyone here who is doing btech in maharashtra as a non maharashtrian ?? Need help regarding OMS students :(",
            "Is it important to update address in passport? \n\nHi,\n\nRecently I have shifted to new place within the city. \nDo I have to update the address in my passport? Or updating address in Adhaar, DL, and pan card is enough?\nLet me know.\nThanks.",
            "Looking for good airline wholesalers who offer best discounted prices on airline prices . Pls share contacts of reliable agents",
            "Hi, is it true that India is paying it's citizens to leave country?\n\nI heard that in context of some Indians who went to work in Europe, usually low level jobs. It was said that agency fees for getting them job is around 5k€, but that this is allright since India is paying people around 10k€ to leave?",
            "Hey, everyone!\n\n21F here, and I'll be onboard at EY GDS, Kolkata soon. Any affordable PGs nearby with sufficient amenities, considering a salary of 3.8LPA? Also, is Kolkata safe for newcomers?",
            "TITLE: no learning \n\n22M- I am currently doing an internship in a very reputed MNC. My internship position is of technical program manager. It's been almost 1 month into the internship. The work that they are giving me is not at all related to program management. Currently i do work like make reports or sort of data entry work. I am getting a decent stipend but from this past month I haven't learnt anything about program management. What should I do? Should I leave this company or wait for 2 months more to see if they give me tasks related to the role? Fyi,My internship is of 6 months duration",
            "Wondering if someone can advise me as I couldnt find anything clear online.\n\nI have Indian passport but live & work in Australia for last 5 years. I am planning to visit India in Oct-24 for few months for a vacation, during that vacation I plan to travel 10 days to Switzerland & Italy.\n\nMy question is should I apply for Schengen visa in Australia or can I also do that in New Delhi when I am on vacation ?\n\nthanks",
            "Hey guys, I am planning to travel to Malaysia and then Vietnam and return back to India from Vietnam. Malaysia has voa/visa free entry and for Vietnam I will apply an e-visa. I needed to know since I will be traveling to Vietnam from Malaysia and not directly from India, do I need any other document for passing immigration ?",
            "Hello everyone, seeking your advice on which travel insurance policy to purchase for month-long vacation in the U.S. Our options are:\n1) Atlas America\n2) IMG Global Patriot \n\nWould be grateful for any insights/experience you could share. Thank you.",
            "‼️‼️‼️NEED ADVICE‼️‼️‼️\n\nHey guys , so I’ve recently been thinking about this , I’m pretty good at background checks , finding frauds , defaulters , catching scammers, fishers , online fraudsters etc etc , I am very good at background checking and was wondering if I could get into something professionally as a career or how I could make a career out of this \nThank you :)",
            "✈️ ✈️ ✈️ ✈️ ✈️ \n\nI need a buy few domestic flight tickets for next month (about 5 weeks later), but not yet exactly sure about the dates so hesitant to buy. I have observed that till 3 weeks prior the prices are low and then it starts increasing gradually. Have you guys had the same observation or is it risky to wait a couple more weeks to book ?",
            "I want to keep receiving SMS's on my secondary Airtel SIM card without having to recharge every month.\n\nIs it possible to keep receiving OTPs and calls on my secondary SIM card assuming I don't want to initiate any calls with it? I live in Delhi, btw and the SIM is from Airtel.\n\nI have heard of a possible option such as Airtel Postpaid so could someone give me more detailed explanation of how postpaid works? What happens if I never send ANY SMS's or initiate calls from a postpaid number? Do I still have to buy monthly packs or something like that with postpaid? What should I do?",
            "# Guide me on TAXes\n\nIf I (a STUDENT) use my normal/personal UPI ID for my dad's business to have a upi transaction of <50000 per day.. what possible taxation problems I may face... My bank account would have, at average, Rs.20000 per month",
            "I have an international flight in less than 24 hours, but Indigo wouldn't let me web check-in for it. If I try to check-in using the app, it redirects me to its website. And the \"continue to health declaration\" button does nothing on the website. In this way, I'm not able to proceed with the web check-in.\n\n\nHas anyone faced this issue? Is there a solution? Or will I get scammed at the airport and be forced to pay for assisted check-in or worse, have to reschedule my flight?",
            "Hello friends,\n\nI'm thinking of starting a cricket turf in a Tier 3 city, Borsad. I've been researching a lot about it, and I've found out that I need a minimum investment of ₹20 lakh. \n\nMy question is: can the public in a Tier 3 city afford to pay ₹1000 to ₹1200 per hour to play cricket?\n\nThere is a cricket turf near Anand city (Tier 2), and it is occupied by players most of the time. Can I expect a similar response in Borsad?\n\nWhat are your views on this?",
            "Cheapest colleges for mbbs in India with a score of 516? Asking for my brother.",
            "Need a good phone under 20 k urgently in 1-2 days. Should I go with the Oneplus Nord 3 for 20k? It's for my Dad, he basically needs a good battery, good mic and speaker and a decent camera?",
            "Does anyone have experience with Akbar travel European tour packages? Are they good? I am trying to book for my parents.",
            "Hi everyone,\n\nJust curious if you could share any impressions of QTV?\n\n[https://www.theq.tv/](https://www.theq.tv/)\n\nI'm asking because this is a Canadian company that has been trying to grow in India, but really hasn't been growing for the past two years. I'm not sure why. Just curious if you have ever heard of it and what your impression is.\n\nThanks.",
            "Can I carry vitamin D and thyroid hormone tablet from India to spain with doctors prescription?",
            "Is SK Telecom/HS Toolsworld a legit website?\n\nI want to buy some Goot solder wick (the 3 mm one) and was considering buying it from that website since it had them at 160/piece but I've had some bad luck with shady websites. So I was wondering if anyone here has dealt with them since people here buy electronics equipment here a lot.\n\nAlso, fuck me why is it so hard to buy even middle of the road brand soldering equipment at a reasonable price that doesn't take a month to ship? And why are are there no decent Indian alternatives as well? Can't we even make decent quality solder wicks?",
            "Hi everyone, I am seeking some advice on getting around northern India please.\n\nI am on a tight budget and really trying to travel as cheap as possible.\n\nI am currently in Kerala, and after this I plan to head up north where I'll be for just over a month, and fly out of Delhi at the end of July.\n\nThe places that I'd like to visit are: Varanasi, Jaipur, Himachal Pradesh (Kasol, Parvati Valley) and Rishikesh.\n\nI'll catch a flight from the south into 1 of these northern regions, and then hope to take trains and busses in between them. My thinking was that I'll fly into Varanasi, then take a train from Varanasi to Delhi, and then find a way to one of the other areas.\n\nDoes anyone have suggestions or advice for better routes or directions?\n\nAny other tips and tricks would be greatly appreciated too. Thanks :)",
            "\nGot a new job for which I need to relocate to a new city, company is providing 15 days of accomodation in any hotel that I book but for 1 person only, I am planning to include an extra person in my stay as one of my parents will be travelling along to help with the relocation & finding accomodation. \n\nHow can I tackle this? The hotel is going to be a 4 or 5 star property.",
            "I want to travel from Bangalore to Philadelphia in October. Can you please help me understand which would be a better flight to book. Emirates economy or British Airways premium economy. This is my first time traveling to the US. Please suggest any other good options if any.",
            "Hi all,\n\nIm from Malaysia and would like to ask some questions regarding India's online shopping.\n\nIn my countries suzuki brand car had been closed because local car brand want to\nmonopolize some of the business because of this Malaysia no longer have Suzuki car and to find the car spare parts kinda hard.\n\nI heard that India have Maruti Suzuki and the parts are quite easy to find. \n\nCan someone recommend me what online shopping or shop that can postage Suzuki car parts to Malaysia please.\n\nI need to repair my car but quite hard to find the parts in Malaysia.",
            "Moving to a hostel for the first time. What extra things should I carry to make my life easier? Please give me some tips.",
            "Wish to gift ‘Bhagavad Gita’ in Hindi language to my mother. Please guide about which version to go for.",
            "Employees died on a work duty. Employer said they won't compensate the families and asked the employees to compensate from their salaries \n\nIs this legal? Can the employees do anything? \n\nTwo workers went to a village for delivery and died on the way back in an accident. \n\nThe employees had to go overnight to a village to deliver because the CEO and executives didn't plan. They forced the employees to go.",
            "Hey, I'm American whats a good place to go to learn about Indian history?",
            "Guide me on TAXes\n\n\n\n\nIf I (a STUDENT) use my normal/personal UPI ID for my dad's business to have a upi transaction of <50000 per day.. what possible taxation problems I may face... My bank account would have, at average, Rs.20000 per month",
            "How to get new/duplicate property papers? \n\nMy father has misplaced/lost some property papers and we want to sell this property. He has electricity bills that are in his name and some house tax receipt. We are currently outstation and unable to be where the property is located.\n\nIs there any process on how to get duplicate papers? if anyone has gone through a similar experience, how long did it take? Will it be possible to file an FIR online and get this sorted or someone needs to be at the location of the property? any help will be greatly appreciated!",
            "Suggest which AC to buy according to my requirements\n\nI want to buy reliable AC for my new home in amravati. Highest temp here.goes around 45 and it will go more in upcoming years.\nMy first and foremost requirement is \n\n1) It's gas should not leak or leak after years of use. Gas leak feels like planned obsolescence and i feel it is 100% possible to prevent it for atleast first 4-5 years of life. This is because it's for my old parents and they qont be able to service it frequently and wont get it if something's wrong.\n\n2) should have relatively good lifespan.\n \n3) good cooling\n\n\nEverything else can be compromised if the first two makes.",
            "What if you don’t convert your minor pan card to major\n\nHello so I have my pan card which I made when I was minor also it says minor where should be my photo so now I’m adult so should I make it new one or I can use it normally without anything except picture",
            "Paper visa expiry date?\n\nHi, I have a quick question regarding the expiry date on my paper tourist visa. I applied almost 9 weeks back and received the visa in my passport today (paper visa as a foreigner with Pakistani heritage).\n\nThe date of expiry on the visa is 6th September 2024 so a total of 3 months validity. My question is do I have until the 6th of September to enter India or do I have to exit by the 6th? I know with the e-visa the date of expiry is the date in which you have to enter the country but I've read that's not the case with the paper visa so I'm really confused.\n\nAny help appreciated!",
            "Is there a shop that sells Stevia (the white powder not the green one) in bulk (1kg) and ships to Europe?",
            "How much do I need for a month or less visit to India?\n\nHello everyone, I am planning on visiting India for the first time. I am from U.S. so I don’t know much about how expensive things are. I have grandparents as well as other family who live there but I don’t want to be a burden and would like to have my own place for the time I’m there for. I plan on staying in Delhi specifically South Delhi because my family lives in that area and this special woman I met lives there as well. I plan on having $10k (around 835,643 rupees when converted). Would this be enough for a month there to have a comfortable/luxurious trip? I don’t plan on clubbing or partying much at all. Everything else I would like to do. Would this budget also allow me to rent a luxury car and place to stay? I will also be visiting with my younger sister who will have her own budget but we will obviously share things.",
            "Are lower castes not allowed to use the internet?",
            "Hey everyone, so basically, my current (old) passport is expired and it was issued when I was around 6 months old. Now, my family got those passports at that time through an acquaintance, and they probably rushed it. Therefore, things like my place of birth and even my gender are incorrect on the passport. I'm an adult now, and want to know if it'll be easier to just apply for a fresh passport instead of renewing the old one assuming there will be no legal issues in the future?\n\nTLDR; Old passport has incorrect place of birth and gender, was issued when I was a baby. Getting a fresh passport recommended?",
            "what happens when a government employee does not pay electric bill? throwaway account, chandigarh. will it just lead to disconnection eventually or will it lead to deduction from salary?",
            "Extra surname added in ticket\n\nHi all,\n\nI booked an air india flight from Kolkata to London with layover in Bombay and there’s a return flight as well.\nOne of my friend’s name in the ticket got added as per their government id proof which is let’s say - (example)\nJohn Doe Roy.\nThis is as per her new surname post marriage and this is her current name.\n\nBut, as per passport, her name is\nJohn Doe.\n\nThe visa is also on her old name. (Because the passport was not changed, only the other government id proofs were changed)\n\nAir India support is clueless and making me run circles in this situation.\n\nI am really worried about this and whether my friend will face issues during security clearance. \n\nShe has her old and new gov id proof and passport by the name of John Doe.\n\nAny help?",
            "**Any smartwatch to keep in touch with your kid?Any smartwatch to keep in touch with your kid?** \n\nHi,\n\nMy brother's kid is introverted and doesn't speak in class. His teachers get frustrated at times but kid doesn't speak at all. I have already suggested him to try therapy. His kid just finished preschool, the preschool was right next to their house and teachers knew how to deal with any issues. Or they could call the parents if needed.\n\nNow issue is that their kid's new school is far away from the home and school bus takes more than hour to reach home. So parents are a little paranoid. On top of that he never shares whatever happened in the school. So we were thinking of getting a smart watch with a camera and ability to call if needed. Watch should have a school mode and live location feature. Are there good smart watches available in market that offer these features? Also, do these watches allow you to enable camera without \"calling\"?\n\n(One more question, does watch become a distraction/nuisance, for example if other kids try to take/steal the watch etc stuff?)",
            "Recently got ears pierced with gold wire(turned to earring), how long does it take to heal?\n\nRecently got ears pierced and piercer told me to keep spinning my earring as it would help it heal faster. I have been doing that and am now able to do it easily without pain. My piercer did not tell me how long I should wear these earrings so approximately when can I wear my pair of studs I bought?",
            "Has the monsoon started yet? Is it projected to be a big one?",
            "I am not 100% sure of this is the best place to ask, but what has been your experience with bajaj alliance?\nI wanted to renew my pet’s insurance policy \nI’ve been trying to reach these people for weeks and today is the last renewal date. They have been putting me on hold for hours at a stretch and once connected they are disconnecting my call. \nHow unprofessional are they? \nCan anyone please suggest some other way to contact them/renew policy or any other company that sells pet insurance and has better customer service?",
            "Does anybody here have a samsung s22+ or a similar samsung phone with a broken screen?\n\n\nIf yes, please DM me or just reply here, it would really help me!!",
            "I ordered my PVC Aadhar card on 10/06/24 and got an SRN no. after successful payment. Till yesterday it was still showing print in progress but today (14/06/24) when I checked the status it's showing \"no records found\". \nI haven't also received any tracking no. \nIs anyone else facing the same issue? Do I need to reorder ? Or is there some other course of action?",
            "Help me find this perfume.\n\n2 years back I was at airport.Over there was a perfume shop with premium perfumes. I really liked one of them but dont know what happened with my card i was unable to pay for it.Now the thing is after that i forgot the name of the perfume\nBut today i was at a mall in which there was a small booth of bellavita. The saleman showed me Bellavita ocean man and it had exact same smell as the perfumethat i  found in the aiport.  \nSo anyone has any idea from which perfume bellavita copied there fragnance ?",
            "So I'm working on this listicle style piece for an assignment and I'm doing forgotten/lesser known hill stations of south India. Can you help me out if you know any that fits the bill? If you could also had a point or two about *what* you find special about the place, that would be very nice.\n\nfor example, I found out about Lambasingi in AP which gets snowfall, and I don't think a lot of people know that. So maybe thinks like that. All suggestions and advice are welcome! Thank you!",
            "Good Celling Fan around 3k\n\nI want to buy three celling fans for new house. My budget is 3000. Please suggest celling good fan.",
            "So, I was looking for a phone between Rs 20000 to 27000 for my mom (it doesn't necessarily have to be a oneplus but she wants a \"good brand\" so no motorola etc.). Do y'all have any recommendations?  \n- gaming is not a priority at all.  \n- camera should be decent but it isn't a major priority  \n- battery life and time taken for charging is the most important.  \n- should look decent, no curved display, and no heating issues or anything else of that sort  \n- should have an 8/256 or 12/256 variant. however, 8/128 is also fine  \n- should at least have a 120hz display  \n- should last for a long time  \n- charging adaptor should be inside the box  \n(I am aware that all these criteria can't be fulfilled but I need recommendations with as many of these features as possible",
            "# Manali - Spiti valley - Leh - Srinagar help with itinerary\n\nHello dear people, I am in Manali and I realized that I want to do both Spiti and Leh Ladakh. I am traveling alone so private car will be expensive. Busses and tourist vans are my options. I am not sure I can drive here as its on the other side and the roads are quite rough.\n\nCould anyone advise the best route? I'll go by bus from Manali to Kaza, then I think there there are day trips and I can find transport.\n\nNow my understanding is that to go to Leh, I have to go back to Manali and the to Leh? There are no other ways? Then from Leh to Srinagar?\n\nI have a flight from Srinagar to Delhi, but if its not worth it, I can fly maybe directly from Leh to New Delhi. Would appreciate any help with the itinerary.\n\nOh and btw, I am a solo female traveler and was advised here that its so unsafe. Its absolutely safe, just use common sense and meet other travelers!",
            "Hi all, this is my first time posting so hope I don't do anything wrong.\n\nMe and my husband are expecting a child and we are really stuck on boy names! I want something Indian but that's easy to pronounce and spell for white people (my husband is white British).\n\nOpinions on the name Sunny? I know there are some famous Indian males called Sunny, but is this commonly a given name in India? Is it better to make it a nickname for something like Sunil or Sundeep?\n\nIf you meet a boy/man called Sunny, what kind of person would you expect?\n\nThanks in advance :)",
            "Doing bcom hons but losing interest \n\n[18M] so guys I'm from commerce stream, later realised that i had an interest in architecture but didnt take science as people around me kept saying science is hard and all, I myself didn't like physics and chemisty that much. Im currently in college doing bcom hons and my 1st year is about to end, now I've got no interest in accountancy and all. My cousins suggested me CFA and I'm planning to do it after bcom hons, but again no interest in accountancy anymore. I keep thinking why i didn't take science, can't focus on my studies, tensed about my future, what should i do?",
            "[removed]",
            "Insurance reimbursement \n\nHi guys. Does anybody have any experience regarding claiming reimbursement on health insurance. My BIL suddenly had a heart attack and had to have a stent placed in his heart. He's diabetic but it wasn't notified to the insurance company. He bought Reliance general insurance from policy bazaar. They denied his cashless claim upon admission. Now he's been advised to claim reimbursement afterwards. Can anyone with experience provide any insights/tips regarding claiming reimbursement? It would be helpful. Thank you.",
            "Hi There,\n\nTrying to learn more about my family history and learnt that we are descendants from Sindh who escaped during partition. We have the name talreja. Trying to learn more about this last name if anyone has more info as google has not been any help! Do you know what our caste was, what were Talrejas predominantly involved in? What does our name mean... literally any info would help massively...\n\nThanks so much for the help guys!",
            "What do you think about air coolers? \n\nI ask because in most Western countries, evaporative coolers exist, but they’re not very popular and many people don’t even know what they are. In India, it seems they’re very common, but nobody seems to really talk about this. I’m curious just how common they are, and what people in India think of them and how effective are they considered?",
            "What bank should I choose?\n\nWhat bank should I choose?\n\nI'm a 22yo graduate entering the job market in India in a month, and I want to create a personal bank account (my current account is a joint account with a parent).\nMy number one priority is completely online, branchless and visitless banking. I also don't know if this is a thing but i would really love a bank that does NOT require me to go to a \"home branch\" for specific things.  \n\nTying into that, my second priority is a good Bank app. I've tried Iris by yes Bank and it seems nice, Yono by SBI is passable but not that good. I don't care much about interest rates and minimum balance because I'll keep most money in investments anyway. \nAdvice is greatly appreciated!!",
            "Hey! I’m looking for companies/travel agencies that offer group packages for solo travellers who are looking for a group, to travel to Bali and Gili from India, in the month of July. Can you recommend some good ones.\n\nI’ve been going through the packages by “the Island crew” but I’ve no idea about the company, whether it’s fake or genuine. Do suggest if you’ve got any clue.\n#bali",
            "Hello, 36 makes from the US looking to travel and spend some time on India. I want to leave this country and yeah. There anyone willing to take me in and show me around? 😅 Doesn't hurt to ask. Anywho. Have a good day y'all",
            "Which phone case/cover brand is the most underrated and overrated in india?",
            "Hello all!\n\nMy question is simple - how long would it take to exit IGI for an international flight from Europe? We land at 04:55 on Wednesday and are aiming for the 08:10 train from the Hazrat Nizamuddin railway station - would this be possible?\n\nThank you!",
            "Hey guys I wanna buy a watch. Max budget 4k rupees. Y'all got any recommendations?\n\n(Recently saw HMT watches and they look dope. Y'all got any good HMT watch recommendations?)",
            "How to know for sure if I'm aromantic and if so , can I stay single forever ?\n\nHello I'm 26M from Bangalore and I'm about to study btech biotechnology or Bpharm next yr. After that I intend to go abroad \n\n Thing is that I might be aromantic. Like sex I understand but relationships... i don't c how they are different than a good friendship . I don't really get all the mushy stuff between a couple \n \nSo can I just stay single forever ? \nand what if my dreams don't pan out and I have to remain in India ? can I be single forever in India ? \n\nLike who will take care of me in my old age then ? \n\nAre any of you guys aromantic or for some other reason, are planning to stay single forever ? \n\nAlso how can I be 100% sure I'm aromantic ? \n\nIf any aromantic persons are reading this then pls tell me how u got to know u r aromantic \n\n Like I've never been in an actual relationship thanks to my poor mental health so yeah I'm not sure . \n\nThank you",
            "New phone Recommendation S23, Nothing2 and IQneo9pro\n\nHi guys,\nNeed your suggestion.\nthere is a sale going on on Flipkart. I am considering buying NP2 or S23 or iqoo neo 9 pro. What will you recommend. I am looking for a good camera and decent battery life. I don't play games, I mostly use phones for social media surfing and playing multimedia. S23 with only 3900mah seems a bit less.\n\nAny other recommendations other than these are also fine (except poco).\nYour feedback would be appreciated. Thanks",
            "How does digital surveillance in India compare to other countries, and what can we do about it?",
            "I'm looking for a freight forwarder in southern India. I've got a harmonium located in Kerala. It weighs about 12kg and I want to ship it to Germany via sea or air shipping depending on what the forwarder offers. Any help is appreciated. Commercial shipping is not an option. Thank you. \nNamaste",
            "Are there sites or anyway to contact buying agents for products in India to be shipped to the USA? I am looking to have something made but, need to have a producer found.",
            "Hello everyone,\n\nI’m a 45-year-old healthy, good-looking male, single, and living in the USA. I immigrated from India at 19 and am a US citizen. I’m interested in finding a young and attractive partner in India with whom to start a family .\n\nI also want to mention that I make an above-average salary. Given my age and circumstances, I would love to hear your opinions or advice on how feasible this is. Additionally, I’m curious about the best approaches to finding a partner. Are there specific ways or platforms I should consider for meeting someone? What strategies or methods might increase my chances of success?\n\nAny tips or advice on approaching this situation would be greatly appreciated.\n\nThanks in advance!",
            "\nA weird question but I visited new York earlier this year and the family took me to the beach. And women are openly walking with very little clothing on.\n\nI found it very uncomfortable not to ogle. Am I just uncivilized?How have other Indian guys dealt with this? Do you just accept it as a cultural difference and move on?",
            "Why is Goa so expensive?\n\nTaj Holiday village is about the same cost as the Ritz Carlton in South Beach Miami. And the beaches in Miami  are amazing and the real estate in general is more expensive than Goa. Also the Ritz is comparable to Taj — both are top tier in respective countries. \n\nGenuinely curious as to why resorts in Goa are so expensive.",
            "How is Shimla (and nearby places) for tourism in July?\n\nMy friends and I plan to travel to Shimla during the first two weeks of July for 4-5 days.\n\nIt's mostly going to be a chill, weekend trip and not filled with too many tourism activities. \n\nWanted to know how Shimla is for tourism during first two weeks of July. Weather wise and safety wise (considering monsoons and vacation season results in landslides, heavy traffic), if it's cool to travel, if there will be any hold ups, yada yada.",
            "Do any of you own the TCL C755 TV? If yes, what has your experience been with it's performance, image quality, streaming etc.?\n\nThis is the only TV with good specs (mini LED, local dimming) that fit my budget (getting the 55 inch version for 63k on Croma/Reliance Digital with card offers). I'm not planning to do much gaming, but movies and series are going to be the primary intent.\n\nI did see a lot of positive reviews online about this TV from other geographies (this model is sold as C805 in Europe). But since the firmware and specs might vary slightly across geographies, I wanted to check what the experience of people who bought this in India has been",
            "Hey everyone! Could you help me with my masters research by filling out the survey? It takes about 5 minutes and I would greatly appreciate it! https://hass.eu.qualtrics.com/jfe/form/SV_diDdjUPNvkW5G62",
            "India's household debt is rising although it's not in an alarming stage but cover 36% of the GDP. I believe with the growth of easy loan access the debt will just keep reaching new heights. Majority of the household debt is concentrated towards middle class household. And these people are vulnerable to any changes in economy. I'm curious to know:\n\n1. How many of you have ongoing loan?\n2. How are you managing them?\n3. Are you having any difficulties clearing them off?",
            "I want to travel to Bangalore and would like to know if it is possible to travel with 2 laptops and 1 PS5 + luggage in a flight ?",
            "Hello Everyone,\n\nMe and my team is working on collecting p.o.v. of you all to find solution for climate change.\n\nFill this form urgently!!\n\n[https://forms.gle/ahwDeJzJXWGXvHq4A](https://forms.gle/ahwDeJzJXWGXvHq4A)",
            "Please suggest where to buy 2nd hand 2 wheeler non gear for my sister in Bangalore.",
            "How to get money back from someone who owes you?",
            "How to pay fees and book appointment? I filled the details by 10 June 2024, but as of now appointments are mostly booked till 17th September in all the POPSKs. 2 days ago when I was trying for my hometown, it said to try after 190624 16:00 . When I tried I was able to select my city but \"make payment\" option is inactive. The only city which is allowing me to make payment is like 400km far. Should I go to the nearby POPSK and try to book appointment there? Please help me out.",
            "Help me choose a medical insurance in India. I want it to cover all expenses including any consultation, pharmacy charges, any disposables, etc. AIso don't want to run behind them to claim my expenses. I don't want to come across any hidden exclusions or hidden charges too. (I'm 30 years old without any medical conditions. Looking for a insurance of atleast 10Lakhs). Tell me what I should look for while choosing one. I need a premium service basically. Please don't spam me with ads.",
            "Anyone intl fmcg sector.  I need help and details about this. Specifically in the online sector",
            "Hello people. I plan to visit Nagaland next month and I would like to know if there are any advice on-\n\n\nInteracting with people - are they friendly? Is there anything offensive I must avoid?\n\n\nPlaces to visit\n\n\nWhat's the food like?\n\n\nThanks!",
            "I was wondering how to buys things in Japan and ship them directly to India . I don't know which sites to go to ( mostly for fashion ). And how to avoid the custom tax when shipping to India.  \npls Help me! :(",
            "Do you think an atheist would be able to fight elections?\nGiven the state of unrest with regards to religion, I was wondering would people be open to a candidate who doesn’t use religion as a tool to get votes. What do you guys think?",
            "PS5 rentals\n\nI have the next week off. Was planning to rent a PS5 and spend the week gaming.\n\nDo you have any suggestions for any online agency that provides such service?\n\nThank you in advance.",
            "I'm planning a trip to Himachal Pradesh, and I hate being in crowds. For example, I've looked up Manali/Solang valley, but apparently its too crowded for me. What travel options do I have?\n\nP.S. I would love having a beautiful starry night sky, but that's not a huge necessity if I get a beautiful scenery in return.",
            "As a freelancer, the bank is refusing me a home loan. Do I have a way out here? Full information below ⬇️\n\n90% of my income comes from the US. I am a freelance content writer. I am making roughly 1.5L/month. The bank says only TDS-related transactions will count toward the computation for the home loan. The 10% of my income that does have TDS deductions from clients comes from one-off work within India mainly for design projects, which is not significant and just based on that the bank cannot give any loan, which is reasonable. \n\nNow, as I am working as a freelancer for US clients directly, the payments are received in my bank account through PayPal, so there's no TDS that they can deduct for these payments. Most likely, there's no way for me to even coerce these payments and make them eligible for TDS (afaik; so do correct me if I'm wrong). These are simple orders received over email, and payments made twice a month or so, very cash-type business. And all this income is being filed as exactly that, \"cash\" income, by the bank, which is not relevant for my home loan computation.\n\nMy CA who's been helping me with legal things, ITR filing, etc. has no solution for me. My bank representative also has no solution for me. Basically, my whole career that I've built as a proud freelancer over the last 10 years (not a proper career or business per se, I know) is useless. I can't suddenly join a 9-to-5 job and wait 5 years for my salary to be on a similar level and then get a home, it's insane. If I save 20% of my income every month, that's roughly 30,000. I was looking for an independent home in 35L (had already seen some projects). That will take me 116 months or 9.5 years to save up enough to buy in cash, but by that time the 35L would be much higher thanks to inflation.\n\nAny way out for a freelancer like me? Any alternatives or options? Any advice from someone who has some knowledge in this?",
            "What are the best clinics in India for ICL surgery? What has your experience been after the surgery?",
            "I mean literally at this point we are focusing on foreign relations,trade and all and not only India but like each country is doing that and definitely that is a important things but I would say we have to something for our earth i guess like making a comitee which helps on the increasing issues our planet is facing, just look at the water shortages, even big cities are having it and the heat waves it's literally killing people even in the rural areas and the pollution in big cites like the upcoming infants and all are being born sick, i mean this really scares and not only government but people themselves have to do something about it...",
            "# How to avail max discount while buying an iPad in India?",
            "Does anyone have insight to Nihal/Nihali people? I’m adopted from Maharashtra and know nothing of my biological family. I found my haplogroup through a 23&me test. My group has only been found in a small percentage of Nihali people. This is the first confirmation of my ancestry to me. When trying to learn more about the people/area I’ve only found a couple things on google that don’t give much information.",
            "A tourist new to Delhi here. Want a hotel advice.\n\n\nI have a flight to Delhi in mid July and a flight to Srinagar 2 days after that. The problem is my arrival in Delhi is at 10pm and my flight to Srinagar is 7am so basically I would like to book a hotel that has very late checkin around midnight and very early checkout around 4am to spend 1.5 days. Could you recommend me some hotels in walking distance from the airport that could fits my criteria?",
            "Looking for advice on vacationing in Puducherry. Is there any good hotel there that offers car parking?",
            "Hello everyone. I was looking for store/online bought Misal Masala powder and found some products.  Can anyone share their experience if someone used them and rate them in their authenticity . As Misal masala / vatan require lot of spices, it’s better to use the dry mixed version imo .\n Specifically I am looking the taste of kolhapur.  Thanks.",
            "I'm landing next Friday in Mumbai.\n\nIt seems like there is a heavy rain forecast for the next Friday. I land around 5:30AM and have a train at 12:30. Given the rain, will it be sufficient time to catch my train if I take Uber/Ola and is it safe to take them?\n\nThanks!",
            "Are Non-IITians destined to fail in life as they didn't get through JEE/NEET. This is because society always tells us ki'If you don't crack these exams, your life is worthless and you won't be able to do anything in life. I am asking this question because I have seen thousands of students ending their lives after failing these exams and hence even I get thoughts of ending my life.",
            "where can I ask controversial questions? Any sub where I can ask controversial questions because every single sub seems to not like my question. 💀",
            "Hello, I am looking for travel advice. I want to go to either Leh or Srinagar end of August. I know they are difficult to compare and I would love to visit both but I have only limited time. There are travel warnings for Srinagar. I don’t think it would be very unsafe, but maybe someone has insights on how it is to be there as a tourist right now? Also what would you recommend in general, also for the season. I am a European female travelling with her partner and grateful for any advice 🥰",
            "Water science tap filter\n\nHave you guys used Water science tap and shower filters? If yes, do you find it useful? Whats your review ?\n\nI am looking for a new filter for my home as the water has sediments. I am looking for an effective way to remove them. Please suggest any ideas.\n\nIf you are also facing the same issue. How are you solving it? \n\nThanks in advance.",
            "Hello.\n\nI apologize if this isnt the right reddit for these kind of questions .\n\nI came across this phone randomly and damn, it looks really good ( with no bezels at all ) and a snapdragon 8 gen3  .\n\nBut the thing is, it isnt released globally yet and i was thinking of importing it. I heard that Meizu 21 had chinese hardware and i wanna know if the current sims of india support it or not ? (( Jio preferably )) . I just wanna know if i can use it same as a normal mobile here\n\nthank you",
            "Please help! My parents are old and live by themselves and it seems like the Airtel people are troubling them. Internet hasnt been working since two weeks and the engineer basically said the problem cant be solved and that they cannot even disconnect the internet until the complaint is closed which they refuse to close because they wanna keep trying to fix it.\n\nI tried looking on the website and it keeps asking me to download their app which has some help bot in it and no human. No contact number to speak to them.\n\nHow do I get in touch? Is there an email to escalate this issue?",
            "Is it a good time to visit arunchal pradesh in mid July? will monsoon be a significant problem?",
            "Yeah",
            "Just keep in mind that any repair or a component replacement for an Apple product will burn a hole 🕳 in your pocket.    \nHad an issue with charging port and they said the port won't come as a standalone component but it will have to be replaced along with entire back panel which consists of speakers, charging port, and whatever the back panel holds together. The quoted price for that panel was freaking 37k!. Thankfully, mine is still under warranty.",
            "[https://poe.com/poeknowledge/1512928000270442](https://poe.com/poeknowledge/1512928000270442)",
            "July and Aug is peak of monsoon in much of the country except south-east. \n\nTry a resort in the South - Mahabalipuram has a number of great beach-facing resorts",
            "LG is the king buy from first party store. \n\nOthers i recommend are \nDaikin \nHitachi\nCarrier/Voltas \n\nNever buy Haier ac they suck as an organization.",
            "panasonic offers a very nice range too",
            "Haier or Mitsubishi",
            "Everything above Mumbai is a no go, southern states are chill though",
            "Karnataka One. But the project was started in the capital Bengaluru where they are still called Bangalore One.",
            "Akshaya In Kerala",
            "I have used the medical insurance from my employer for my parents and kids without any issues. Check and make sure about the terms and conditions of the insurance.",
            "> Do you think India will marginally improve its facilities in the coming 2-3 decades?\n\nUnless corruption and social unrest became much worse than it already is, then yes it's safe to assume there should at least be *some* improvements. It would be abysmal if a quarter century goes by and material things don't manage to improve.\n\n> While travelling to other countries it becomes apparent that we have a long way to go before we truly say that we are on the same level as other countries.\n\nSo now this depends on what countries you are trying to compare to. 3 decades isn't enough time and comparing to western countries and especially East Asia is simply unrealistic. India should be aiming to match development similar to SEA (Vietnam, Indonesia, Thailand) or Brazil/Mexico.\n\n> Do you think there will be a massive scale of improvement in our country in the coming decades, or is it just going to be the same shit, different government type of scenario?\n\nInstances of massive scale of improvement in a \"short\" period of time has always been an outlier throughout history... either due to small countries being given a bunch of outside aid (S. Korea and Japan) or consistently strong leadership to steer the country in the proper direction over several decades (Singapore and China). So no I dont foresee this happening to India or any country for that matter anymore. Current outlook of the bureaucracy is too inefficient and the global economic order is not going to be in ideal conditions for the country.",
            "Manpower is cheap in India. So, stores would have employed people whose job it is to return the shoes to the shelves and arrange them. In most shops (even the small ones), the sales agents bring the shoes to the customer for them to try.                   \nThese people are probably used to that and don't realise it's done differently there.",
            "Almost every news channel will do livecasts on Youtube for the whole day on Tuesday.",
            "We definitely need more offerings around the 6.0 in display size. The regular Pixels and Galaxy S models are the only flagship ones that come to mind.",
            "I've never visited Germany (unless you count Frankfurt airport) but European chocolate is always a hit, though you have to be a little careful since they tend to melt very easily in Indian weather. Snacks are also the kind of gifts you can get for everyone (exercise more discretion with something like alcohol). I always bring pretzels from North America because they're not easily available here but still suit most people's taste palettes so you probably have a lot to work with there.",
            "In a similar boat. Need to find a place (within a budget) to travel to or a something new to keep myself from getting bored. Ooty, Kodai should be good places to go now.",
            "In your contacts app there will be an option to mark contact as marketing, scam, insurance etc. just do it. they will automatically get filtered",
            "r/india Moderators have not confirmed identity of the posters here. \n\n#####Please tread with caution and take appropriate precautions before submitting any private information or transferring money. \n\nOP, please answer questions of commenters promptly - as they come - and provide enough contact information to them so that they can contact you off-reddit too. \n\nAll the best.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/india) if you have any questions or concerns.*",
            "You should attach the purpose of your research together with your identity. Your questionnaire should help in the 2nd page.",
            "Everything is turning to subscription model. This is just a way to keep the bottom-line growing for the corporates. Before Jio, the internet charges were extortion. Now it seems the recharges are a way to keep the money flowing.  \nEven 28 days felt like a scam as they call it monthly recharge but you end up paying for 13 months in an year. Nothing to be done really as every provider is the same.",
            "It will be better to go for BCA or other Bachelors instead of Diploma because it makes you eligible to go for masters directly from there, or BTech if thats what you want. Diploma is a trishanku. \n\nLot of free resources can be found online, youtube etc to learn programming, computer science background etc. Harvard CS50 is a famous course that you can take for free on coursera, it is intro to compsci by Harvard professors. Good but done in simple way",
            "You want to learn cp?\nOr just web development nd stuff?",
            "Many of these students would have been privileged brats back home who've always had someone else (parents or more likely, domestic help) to pick up after them.          \nMost will eventually learn but until then, are roommates from hell.",
            "I got godrej 1.5t 3 star inverter ac at 27k. Installation costs extra. Try a distributor of ac to directly deliver at your home rather than shops.",
            "Yes, that would be the Mumbai Foreign Post Office and your parcel is being held up at customs.       \nYou can contact India Post to find out how you can help in expediting customs clearance. Usually, this will involve sending them a copy of one of your KYC documents.               \nCustoms duty on books won't be more than 5%. If the seller has attached a proper invoice to the order, this will be on the price excluding shipping (so, 1181). Otherwise, it will be based on the value they assess. There's also a good chance they won't charge customs duty for this delivery.                  \nIf duty is charged, you should be able to pay it to the postman during delivery.",
            "Are guys swingers? Is this a coded msg ?",
            "Are you a tourist or an NRI with friends/family in India?      \n\nIn the latter case, this is what you do. Have one of them buy a SIM for you and place it in their phone. Then, they download the Myjio app and activate international roaming under settings (ignore the prompt to buy a roaming plan). Follow the instructions on the Jio website to convert the sim to an esim but with your phone's EID and IMEI number. (This just involves sending an SMS from the Jio number mentioning IMEI etc). The ESIM will be active on your phone within a couple of hours.\n\nIn the former case, there are a few complications. Firstly, due to the new security regulations, foreigners need to provide local contact details (along with OTP verification). You need to contact your hotel if you can provide someone there as the local contact. (The better option is to have the hotel get the SIM for you themselves. This service is now provided by most hotels who host a lot of foreign tourists).           \nThen, there's the issue that both major telcos (Airtel and Jio) don't sell esims. They only sell physical sims which can then be converted to esims. So, you need someone who can load the sim to their phone and send the ESIM conversion SMS.",
            "Probably bund. It's just an embankment made of earth. Would make sense as a boundary between two agricultural lands.",
            "Are you talking about a US visitor (B2) visa?    \nIf so, then yes, you can apply from India. But confirm that you will indeed be able to get a slot during your India visit. The appointment waiting time being low doesn't necessarily mean you will get a slot during the preferred dates (and the fees are not transferable across countries). It's best to confirm from someone who has already paid fees and can access the available interview dates.          \n\nNow for the bad news. If you're an unmarried 20-something student in Canada who's about to complete your degree, your chance of a US visitor visa is not very good and there have been a lot of rejections in the recent past. The exception is if you have another reason (eg:a conference) to visit the US on a B1/B2.     \nThis is because you'll be seen as someone with minimal ties to 'home' (both Canada and India) and at risk for overstaying.      \nIf you don't have an urgent need to visit the US, I would suggest waiting until you graduate and start working.",
            "See if Paytm Money will update the records. I know Zerodha does after raising a ticket.",
            "Hi SocialPsychUK. It looks like your comment to /r/india was removed because you have been using a link shortener. Due to issues with spam and malware we do not allow shortened links on this subreddit. Feel free to re-submit using the full URL.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/india) if you have any questions or concerns.*",
            "do you really need to become friends with the girls from that group only? are there no other girls in college?",
            "I see some 'crazy monk' shirts on [amazon.in](https://www.amazon.in/stores/Crazymonk/page/621CC3BD-3280-433F-B167-01A5775B3CF6?ref_=ast_bln&store_ref=bl_ast_dp_brandLogo_sto). Buying from here might be the easiest way since they accept international cards without issues.",
            "Would have recommended Oneplus nord ce4. But Oneplus decided to be stupid and removed NFC support even though it was present in all previous models of the series.",
            "vistaprint",
            "One thing to keep in mind is that all of these agencies, cannot really guarantee that you will get the visa. Getting visa finally depends on factors, many of which are out of our hands. What these agencies do is take care of the application paper work.",
            "that is the reality in India sadly. most good apartments have generators that kick in when there is a power loss.",
            "zee5 has this movie",
            "norway/iceland?",
            "Did you leave before 5 years?",
            "Absolutely hot summer",
            "Very doubtful. Almost all polls and surveys predict a victory for the NDA coalition. The question is by how much. The three realistic possibilities are     \na) The ruling BJP gains a lot of seats compared to last time. Then, they can claim the mandate to do pretty much whatever they want.          \nb) The BJP gets just as much as last time or a little less. This would mean business as usual.      \nc) The seat share of the BJP falls and they'd need to rely on their NDA alliance partners to form a government. This is the best-case scenario for the opposition at this point because it would indicate a resurgance of sentiment on their side.    \n\nThe voter turnout in the first half of the election has been lesser than expected which has led people to expect scenario b or c. But we'll know for sure in June.",
            "Yes. That would be perfectly alright.",
            "Lot of brands are there. For eg: MR. MAKHANA",
            "You can PM it to me",
            "Kim possible?",
            "He is travelling on a diplomatic passport for which many countries including Germany offer visa-free travel.        \nRegardless, if you have even 1% of the money that guy and his family of criminals do, getting into any country in the world is not a problem.",
            "The Ramayana is always a good place to start if you're looking for a mythological text.          \nThe original verses in Sanskrit and the versewise English translations can be found [here](https://www.valmikiramayan.net/) or [here](https://www.valmiki.iitk.ac.in/).      \nThere is also [this book](https://www.amazon.com/Ramayana-English-Valmiki-ebook/dp/B004UITKYU/) which is one of the oldest English translations. Some poetic liberties have been taken but it does a very good job trying to preserve the lyrical quality of the original epic.",
            "Ancient texts which talk about the 4-caste system recommend the surname 'Gupta' for Vaisyas (like Sharma for Brahmins, Verma for Kshatriyas and Dasa for Shudra). But this simplistic picture of castes hasn't existed for at least 2000 years and probably never existed even before that.         \nMany non-Vaisya castes have taken on the Gupta surnames at various points in history and for different reasons.     \nThat said, most people with the Gupta surname in the Northern Indian states do belong to one of the Vaisya/Baniya castes.        \nAlso, most Vaisya castes *are* upper castes. They were trading and mercantile communities that were usually prosperous.",
            "I checked on Timatic (the system used by airlines to check for visa conditions etc) and you should be good to go as long as your UK visa is a sticker on your passport. Looks like the program resumed in April 2023.     \nI have used similar visa free entries in other countries in the past and you shouldn't need anything more than your passport with UK visa and a copy of your entire flight itinerary (get physical printouts to be safe) to be granted entry.",
            "Indore will look better on CV. more opportunities. if she has been selected, she will be able to cope with the coursework.",
            "Yes. One laptop can be considered under personal effects. You can bring your used personal items like one phone, one laptop, clothes etc that you're going to be using during your stay. In addition, you can bring ₹8000 (about $100) of items duty free.       \nAfter passing through immigration in the airport, you'll see two lanes marked 'green' and 'red'. If you don't have anything other than the items listed above, you can walk through the green line.",
            "None if you have one personal open laptop. Boxed pieces , pay around 30%.",
            "clearly scam. Our legal system is so slow, 2 hour action makes me laugh. (Unless you are a rich man's son driving a Porsche) \n\nThere is a portal chakshu where you can post complaint on attempted scams. https://sancharsaathi.gov.in/sfc/",
            "Count it as an invaluable experience about what **not** to do in life",
            "I think I can guess what's happening here.        \nWas 11k the cost for both your parents' tickets together?       \nIn that case ₹1920 (3840/2) was the airfare charge for the BOM-GOI sector per person. Since this is lesser than the max ₹3000 fee (this is also calculated per person), the whole thing is being charged as the cancellation fee. What you're getting back is just the assorted other fees you've paid for the return leg minus gst on the cancellation fee. This has probably come out to ₹450 per person or ₹900 in total.           \nThe fares in the breakup (airfare charge of ₹3960 etc) are the ones pertaining to the GOI-BOM leg.     \nYou can verify this in the email they'd have sent you after booking which should have the sector-wise breakdown.   \n\nFrom next time, I suggest you book the flexi-plus fare option of there's even a slight chance of your plans being changed. It only costs around ₹200-800 more and comes with perks such as free seat selection and a meal. It has free unlimited date changes where you only need to pay fare difference for rescheduling (can even claim refund if new fare is lesser). Cancellation fee is also low for this option.",
            "When booking tickets you can see multiple options (On the airline site, 3rd party sites differ) . Cheapest one is what you took. There will be other options which cost 1K more etc, that offers free/cheaper cancellation, change of dates, free snack on flight etc (Indigo). \n\nIn below image 2nd one is what I take\nhttps://imgur.com/a/6UY6S4u",
            "I like to have spicy pulao and take sips of mint flavoured buttermilk to bring down the spiciness of it.",
            "How much have you spent on your card?     \nIf it's below 7 lakh (for the financial year), you should get a refund within the next couple of working days (may take max 1 week). Will be credited to the Niyo card itself. \n\nIf it's above 7 lakh, then yes. You need to wait until you file taxes next year. The TCS amount will be adjusted to your taxes and if it's over that, you'll get a refund with interest.     \nAlso, are you in the UK for education? Then the TCS applicable for fees etc (after the 7 lakh threshold) will be 5% (0.5% if the money is from a loan). But you can't use your forex card for that. Will have to do a fund transfer and mention education as the purpose of transfer.",
            "No; just keep the ticket for your Vietnam-India flight downloaded on your phone.    \nSame for Malaysian immigration. They may want to see Malaysia-Vietnam flight along with Vietnam e-visa as proof of when you'll leave Malaysia.",
            "I assume you finished the seat, luggage etc steps and it failed after that? It's common for international flight check-ins to fail at the end before issuing your boarding pass. It usually means they need to check your visas.       \nI've never been asked to pay for physical check-in when this has happened. But in any case, keep a screenshot of what's happening so that you can show that and refuse to pay if you're asked to.",
            "I saw your post elsewhere on trying to figure out trains in India. \n\nUnless India has changed last time I was there, there should be travel agents all over the place in the major tourist areas. \n\nTalk to them, they can book train tickets easily and make suggestions. You aren't paying much for their services.",
            "Names like \nSunny \nRohan \nKabir\nShri \nCan be very good they sound Indian and can be easily pronounced by anyone",
            "Sunny is not a common given name in India. It's a common nickname. Most of the famous people with the name just happen to identify more with it than their actual given names.       \nGiven name Sunil with the nickname Sunny may be a good idea. (Note that due to the recent trend of giving babies unique and uncommon names in big Indian cities, the average age of popular names like Sunil tend to run a little older. But it is still a meaningful and beautiful name that isn't going anywhere).          \nAs an aside, the name Neel, related to Sunil, is among the popular choices for people in your situation. It is derived from Sanskrit and in use as a given name from ancient times. It looks similar and has the same pronunciation as the Irish name Neil.",
            "One famous sunny, Sunny Deol (actor) 's actual name is Ajay Singh Deol.",
            "Shaadi.com",
            "Going by what you say about no appointments till September, is this a POPSK in the jurisdiction of the Bhubhaneshwar RPO?      \nIf so, they were the guinea pigs for the migration to the new software/portal. This was fumbled to epic proportions and appointments were completely stalled for weeks starting from March.     \nThe reason all dates for the next 3 months are shown to be completely booked (they are not) is either because there is now a backlog of people wanting passports from the last three months that they have to manage or that they've still not solved their software woes so they're rationing appointments. I suspect it's a combination of both.      \nAnyway, when you try to choose a centre it should show when the next round of appointments are set to be released. Login at exactly that time and choose your centre to proceed to payment. You need to be very quick.    \n\nYou cannot go in person to the POPSK to book an appointment.\n\nIf you're in a hurry and don't want to play this game, the only solution is to book an appointment at a PSK/POPSK in a different state. See [here](https://www.passportindia.gov.in/AppOnlineProject/online/apptAvailStatus) for available dates.             \nYou'll need to make a fresh application in the old portal with a new email ID and choose a different RPO. The employees at the PSK may spout some nonsense about you needing to choose the RPO based on your address. But stand your ground that anyone can apply from anywhere in India and preferably carry a printout of [this](https://portal2.passportindia.gov.in/AppOnlineProject/pdf/CIR_0186917_Y.pdf).     \nNote: This will only work for normal appointments. Not tatkal. If you've booked tatkal in another state, it'll be converted to normal.",
            "No. The IIT tag is only helpful in building contacts and getting the initial push in your career.      \nAnd there are a lot of other ways you can get those irrespective of which college you go to.       \nWhatever college or program you get in, the first step is to refuse to settle down and go with the flow. Use the first semester or two to figure out what you're interested in. Try to get into projects (inside or outside colleges). Reach out to people (without fear of rejection) for internships during your holidays etc, be they in IITs or established companies or startups. If you do all this, your profile in your final year will be as good or better than any IITian.     \nThis is coming from someone who graduated from an IIT in the last decade and then worked with and hired many people, both from IITs and not.",
            "Fuck.",
            "amazing insight, thanks!",
            "Perfect, I'll keep an eye out :)",
            "Thanks, this is really helpful! Maybe as a nickname is a better idea. \n\nUnfortunately we can't use Neel as we already have a family member with this name."
        ]
    },
    "Mental & Emotional Health Support Thread": {
        "title": "Mental & Emotional Health Support Thread",
        "score": 44,
        "url": "https://www.reddit.com/r/india/comments/1chg6d2/mental_emotional_health_support_thread/",
        "content": "Welcome to /r/India's mental and emotional health support thread. \n\nIf you are struggling and are looking for support, please use this thread to discuss your issues with other members of /r/India. \n\nPlease keep in point the following rules:\n\n* Be kind. Harsh language and rudeness will not be tolerated in these threads. The aim is to support and help, not demotivate and abuse. \n* Top level comments are reserved for those seeking advice. \n\n[Older Threads](https://www.reddit.com/r/india/search/?q=%22Mental+Health+Support%22+flair%3AScheduled&include_over_18=on&restrict_sr=on&t=all&sort=new)",
        "num_comments": 114,
        "comments": [
            "Hi everyone. \nI am a 29 year old male and a father to a toddler. I don't know what I should say but i haven't been able to sleep properly since ages. Six months ago I had an accident and had to leave my job. My right leg doesn't work anymore. I need help waking up and lying down. There is no source of income. I am down to neck in debt. I don't even have enough money to buy diapers or food for that matter. I am looking for job everyday, but whatever this fucked up recession is doing to us is effecting everyone's life I guess.\n\nI have experience as an HR. I can work in any thing related to customer relations or human relations.\n\nI know there are probably thousands of people facing the same problem but I can't face it anymore. I am nothing but a burden to my family now, a failure. I have promised God that if by the end of tomorrow I am unable to earn anything then I will end my life.",
            "I am writing this post not knowing who else to discuss this with or find anyone who can relate to this experience. I was raised for the most part in what I thought was a traditional household with modern values. Only much later did I realize that was not entirely the case.\n\nTo elaborate, both my parents are well-educated and working professionals. I was bullied numerous times as a kid and have grown up with likely undetected mental health issues. Major life changes brought me and my family into a close community of upper castes and Brahmins.\n\nI was raised with an aspiration to assimilate into the culture and traditional lifestyle of Brahmins. This was partly because my parents wanted to be part of that community, instilling the belief that following the lifestyle of a different group might make us better. Additionally, I had seen people of my caste behave poorly towards women and undervalue education, whereas we observed many upper castes and especially Brahmins who were well-educated and well-settled in life. Moreover, my parents had close friends, closer than family, who belonged to the Brahmin community and were practicing traditional rituals to varying degrees.\n\nI almost believed I was half Brahmin until I benefited from reservations. During this teenage phase of upbringing, I hardly socialized compared to my peers and friends. Most of what I was exposed to were religious and spiritual speeches by various preachers and babas. The central theme was the normalization of dogma, miracles, and an emphasis on belief rather than rationality. Additionally, given my introverted nature and the cultish upbringing involving no interaction with people my age, I did not make many friends. I do not blame my circumstances entirely, but I cannot ignore their contribution as a key factor.\n\nFast forward two decades later, and after numerous depressive episodes in life, I educated myself on different ideologies and perspectives. I learned from acquaintances and distant friends how their lives were so different and the kind of exposure they had. Over time, I realized my folks' propensity to be hypnotically drawn towards cults and single-minded perspectives with no room for nuance, introspection, or questioning. I also realized that celebrations and happiness are not to be shunned as vulgar and greedy disillusionments. In short, I grew a bit more liberal in how to view life and people.\n\nCurrently, I find myself in a happy relationship, although not fully accepted by my parents. On the other hand, my parents have grown increasingly regressive and accustomed to being part of many cults. Behind the scenes, they express hatred towards me and my choices at every moment, while with me, they express great anxiety for their lives and me being their only caretaker. My relationship with my partner and our work lives are affected daily by the casual lack of empathy or care they express, and I have not been able to make many friends, especially someone who I can talk to about these things. Whether it's near and distant family members or friends, most have grown apart or do not share distantly liberal beliefs.\n\nThis brings me to the present day - I continue to be lonely and depressed but do not wish to share this with anyone. Having tried therapy a couple of times, I am getting weary of explaining my life story with little chance of the therapist truly understanding where I come from. Has anyone gone through a similar transformation in their lifetime or can relate to these emotions and is willing to talk? Does anyone have suggestions on how to progress in life when one foot is tied to guilt-tripping loved ones and the other to a lack of social life? Does anyone have experience on how to overcome regret? I look forward to your perspectives!\n\nTL;DR: Raised in a traditional household that aspired to assimilate Brahmin culture and lifestyle, leading to an isolating and dogmatic upbringing. Over time, grew disillusioned with parents' regressive views and lack of open-mindedness. Now in a happy relationship but not accepted by increasingly cult-involved parents. Struggling with loneliness, depression, lack of understanding social circle. Seeking perspectives from those with similar experiences of ideological transformation and advice on overcoming regret while dealing with guilt-tripping loved ones.",
            "Need a good, affordable therapist guys. Help me out.",
            "I am curretly so confused and ocerwhelmed about what yo do. So i message this intagram account and he sends me a mega link which had just to say some illegal stuff. later he started saying he will report me to cyber crime and will ruin my career. I dont know what to do and how to handle this",
            "My Indian Parents don’t let me decide for my life. \n\n\n\nI’m an NRI, and live in a west country. This year I’m going to graduate from Year 12. But since last 2 years my parents are talking with their Indian friends and have decided that I should go to India and prepare for JEE for 1.5 years in hope that I’ll go to IIT. \n\n\n\nMind you there are three universities from my cities which come in top 30 QS rank for engineering and I’m happy to go in one of them to purse the discipline with my friends doing similar major. But my parents somehow got this idea that all these rankings are paid and these colleges are nothing in front of IIT. I eavesdropped on my dad talking about how none in his distant family has ever been able to crack it, so he wants me to be the first one.  But his 2 arguments are most CEOs are IIT graduates in the world, and if ever in my life I want to work in India I will have a chance in my hand. I told him I have never thought of doing a job in India when I we have the best laws here for work life balance. But he just tries being aggressive so I just remain silent when my life decisions are being made without asking me. \n\n\n\nHe says once you’ll graduate from IIT then your life will be cakewalk, companies will run behind you to hire you. Everyone will kiss your feet, and you will earn in millions. But honestly I’m happy with my simple life. I’m already burnt out with the rigorous schedule in my school. Jee will be 3 months after my final exams. My curriculum is a lot different than what they ask questions upon. When I told my dad this he just asked me to prepare for it for next 1.5 years. Now for a 4 year degree I have to spend 5.5 years at-least. I have no power for that. \n\n\n\nHere I’m studying for my exams and side by side researching JEE which has taken a big toll on my life. At the age of 17 I am diagnosed with Rheumatoid arthritis my life expectancy can go as low as 10 less years than normal life. I’m still studying pushing myself, with a risk of heart attack. \n\n\n\n\n\nBTW, all these uncles who are asking my dad to send me to IIT have their kids settled in USA, Canada and Australia with a successful life and no they never asked their own kids to join IITs. It is my dad who is so keen to send me to a college where chances of getting in virtually 0. Furthermore he taunts me that I want an easier life and don’t want to do “sangharsh”. Moreover, all these uncles who live in India tried their best to force their kids in IIT and they all failed and got depressed and were not able to do anything in life. I wonder how every friend on my dad’s had a son preparing for engineering. \n\n\n\nAnyways, Can someone give me tips on how long I have to study for this exam. And what strategies I should consider for this exam. I guess I have no option but to give it a try.",
            "The British rule of India\n\nNamaskar 🙏🏼, \n\nI’ve just watched this YouTube video about the impact of the British rule in India, how the country was thriving before hand and the nefarious strategies deployed to exploit the country.\n\nNow this left me feeling very saddened about these events and I was very curious to hear your opinions on what had happened. If it really was as bad as the video suggests and how do you cope with that reality. \n\nI am a half Indian that was born and raised in the west and I am only recently getting back in touch with the heritage. It am seeking more understanding and wisdom so all opinions are welcome.  \n\nThe video for reference: \n\nhttps://m.youtube.com/watch?v=gIzQxNZfGM4",
            "I have a friend who got selected in IIM Indore but she is choosing to go to IIM Nagpur. Her reason is that she doesn't think she can cope with the pressure there and compete with other students there as she has a very low profile ( no name college, engg, no work experience). She is someone who is diagnosed with Anxiety disorder and ptsd and wants to choose a more comfortable and known college ( she has lived in Nagpur for a few years). She thinks she will do poorly in Indore because of her anxiety and doesn't want to put herself in a position where her anxiety will act up a lot. Previously she has left a college because she couldn't handle the pressure. Is she right?\n\n\nPS: posting this on behalf of her with her knowledge and consent.",
            "Drunk Narcissist Dad ruining my life and mental health since childhood \n\nI [19M] Hate my father [51] all i have memories of him since childhood is him being drunk and abusing my mom. All this years I could do nothing but hear them fight. I used to cry all night acting like sleeping it was really traumatising it made me mentally really weak. \n\nIt resulted in me being unable to study, socialise, i became an introvert and shy. I developed inferiority complex. \n\nAs years passed same thing continued and i was no more able to resist his acts. I started to fight back at him but he always kept justifying that he is right and i am living because he is earning bread.\n\nAll the important exams i had soo far he came drunk and fought mom.\nThe only reason he ever gives is that she ruined his life (narcissist behaviour) and bad words her side if family. He never speaks ill about his side if family.\n\nThere came times when I asked him crying why do you drink and it made him really mad and he blamed my mom that she raised me bad.\n\nHe didn’t really do anything in life than earning a bread to eat and provide an shelter and general needs.\n\nThere was a time when my mother wasnt  home he still came drunk and this time his target was me. He verbally abused me saying how bad of a son i am. \n\nWhen he sober he is really hyperactive person. He makes fuss out of small things and gets stressed out real quick.\n\nI don’t really know what i am supposed to do even if i get out of this house he will trouble my mom even more and we don’t really have any well wisher relatives. And even if i take my mom with me leaving him alone, he wont live he needs us or he will diee of nobody to fight with I realised this when my mom wasn’t around.",
            "Hello everyone \nI have been working on a mental health podcast - The Cozy Conversations for a while now and finally I have released the first episode today🌻\nhttps://lnkd.in/gU52E_JS\n\nThis podcast is an initiative to break the stigma surrounding mental health and create more awareness.\nYour experience could be the source of inspiration and support for others who are going through similar challenges. Whether you've triumphed over adversity, found unique coping strategies, or have valuable insights to share, your story can make a difference.\n\n\nIf you are interested in participating in the podcast, you can go through this form🌻\nhttps://lnkd.in/g-99gDRn",
            "..",
            "I'm M20, Since my childhood, I have been exposed to anxiety. My parents' mental abuse is the reason for it, even though they never physically abused me. Despite the fact that they don't directly attack me, fighting with one another is what they do. My mom threatens to leave the house and my dad threatens to commit sucid if she leaves, and I've been stopping this from happening for a long time, I'm completely exhausted now, My anxiety rises even if they're having a regular conversation. I can't handle it anymore, I love both of them, They are clueless about what they did to me, but the harm was done.",
            "So a month back. I was driving in my classic 350 in an highway at 60 kmph a guy tried to cross road without checking the roads he suddenly came out of nowhere where and got hit by me (his mistake) but he filed a case on me stating that he was stationary I hit him due to my rash driving. He is permanently disabled to do work now, I too got injured since I was wearing helmet(he dint) | had several scratches and shoulder dislocation. He has claimed a huge amount and filed a case on me. So what happens now there was no eyewitness and he had pinion. What if the pinion tries to convince the judge so what should I do",
            "\n\nI learned that June is \"Men's Mental Health Awareness Month.\" Kabhi suna bi nahi hai. I was sure it's an Instagram and Twitter hoax. Is this true? Does anyone know?  When did people start caring?",
            "This whole sub needs mental support after today 😂😂😂",
            "Can somebody please talk to me? I'm having suicidal thoughts. I know once this phase passes it'll be okay but rn I can't seem to get my head to be stable. Talk to me about something. Anything. I just need people near me. Around me. Idk. Don't talk to me about not dying and how living is worth it. Don't do it. Please. Anything is okay but not that. Please help me get my mind to a different place.",
            "I am leaving my metro city tomorrow and going back home. 3 months ago  I was at top of my life, inpendent, able to leave alone, had my savings, having fun with life, having praises at work and tomorrow I'm going back cause I have become dependent on my parents. I can barely have a small walk without having multiple anxiety attacks. I wanted to stay here, enjoy my life but guess fate has other plans. I should have atleast saved more money for myself cause rn I don't have much. I am looking side gigs online as my job isn't paying me much. But everything just looks scam online. I don't have much hope left in me. Neither I feel my life is worth fighting for but guess I gotta keep going.",
            "Loneliness\n\nWhat would you call a person who seems to be a people person at work, fun around the family, decent husband but lonely af? \nPractically zero friends, no social life outside the one with family, tries to be friends with younger people bec can’t relate to people of his age. Can’t express his true feelings to anyone. Goes to office to feel normal, seeks people connection but is unable to make any.",
            "Are Non-IITians destined to fail in life as they didn't get through JEE/NEET. This is because society always tells us ki'If you don't crack these exams, your life is worthless and you won't be able to do anything in life. I am asking this question because I have seen thousands of students ending their lives after failing these exams and hence even I get thoughts of ending my life.",
            "Hey I am looking for a therapist, preferably online, for my anxiety. It would be great if you have already had experience with them and found them helpful.",
            "Please tell me if this is really fine\n\nI had worked day and night to get into one of the top 5 engineering colleges in my city. After coming to college, I was still in the same mindset of my jee prep days. I didn't make any female friends in college in my 1st semester. I was just doing the same hustle. Later on I realised I had to enjoy my college life as well. I wanted to get into the main group of my class but which had the popular girls and boys but it was too late. I am currently in a position where I talk to all of them but I am not able to get too close with any girl. I tried hard but was of no use and I was even having the doubt that maybe I may look too desperate as well. I still regret the decision why I didn't do the same thing in my first semester when everything was fresh. I am finding it too hard to make any close female friends in college. I am stuck with a boys group of 5 where none of them are really interested to get female friends and are quite boring in nature. I am feeling is it a waste of my college life if I don't have any female friends in my close group because all other groups are a mix of both. I know I will do fine with the placements and stuff. Its not that I don't really talk to any girl. I do but nobody became too close. Idk how could I even explain this to anyone so posted it here",
            "Hi, I am really upset today, I forgot my office laptop password that I use every day. I cannot imagine how my brain can become so poor that something I use everyday, I will forget?\n\nI am thinking if I have medical issue that I need to talk to a doctor. I also forget my own mobile number at times and have to think couple of times when someone asks what it is?\n\nWhat medical problem it could be?\n\nAs a risk mitigation plan, after this today, I wrote a detailed note about my bank account and loan details etc, so that my wife can access it incase I forget them as well. For office laptop, I need to go to office to get it reset.",
            "Need recommendations for therapists (mental health) for someone I know. Please do not advertise yours or your friend's business.\n\nThis someone is very close to me. They're not known to be very vocal about their feelings and 200% sure will oppose to the idea of seeing a therapist but I still want to try.\n\nPreferably someone who can do online sessions, and don't immediately jump to prescribing meds.",
            "Desi’s are always the butt of jokes and it’s because we have no self respect. \n\nhttps://www.reddit.com/r/india/s/kARb7ZA4KJ\n\nlook at this post and comments section for example \n\nthe post in summation asks “i am a white guy why are desi’s douchebags sometimes?” \n\nFirst of all this post should not have gotten this much attention. Second of all look at the comments section, why are you all so ready to berate your fellow desi’s instead of showing this person the door? what kind of bullshit question is that? every culture has douchebags in them. Instead everyone in this comments section decided to describe their hatred for other desi’s and shit on the condition of your own country. Disgusting. This person asked the stupidest question and all these people responded with no self respect. Examples like this are why i hate being desi. Stop bending over for every outsider that has something to say.",
            "06c6c6f6y6c0",
            "Hello, does anyone know of any DBT-trained therapists in India? I'm based in Pune but am OK with online consultations if the therapist is in another city. Thank you so much!",
            "\n\nHello people.im in my late 20s,has been going through some health issues which obvio affecting my mental health too.is there any support groups available ?",
            "How do I stop masking and feeling guilt? \n\n\n\n\nI got kicked out 2nd grade for being aggressive and poor in studies, When I was in third grade, teachers gave me homework in 4 to 6 subjects.  If I don't finish them, the teachers hit me.\n\n\n\n  I usually avoid doing homework because it's difficult.  I always feel guilty and anxious when entering the classroom.   Time passes, grade by grade I avoid going to school more and more.  \n\n\n\n I want to escape from anxiety, at the age of 13(I'm 15 now) I go to school once a month, yes my parents yell at me, I talked about this with my parents about that 'I can't go to school, I don't know why I I feel a little anxious about not being able to do homework and study for exams, I forget everything that I can't mug up  I have a hard time remembering things\", my parents laughed at me and told me: \"you are being a child\", \"look at the other children\".\n\n\n\n After that, the relationship between my parents and me is bad, they usually yell at me saying things like \"I did everything to you but you are not doing anything to me\", \"look at other kids, they got a lot of grades, you have more privileges than them, how\" \"You didn't get grades\", \"why don't you act like other kids, look at it\". normal they are\", \"what's wrong with you\", \"stupid and mentally ill child\" and the most traumatizing phase is \"I'm not like other children\". (My parents still guilt trap me)\n\n\n\n\n\nA year passes, my parents changed the school to nios although everyone is calm there , I still feel anxious and guilty for no reason, I can't stop masking myself, I feel like I'm not like other children, I try to adapt to the norms copying the body's moments and the way they speak (accent). feel like an alien. \n\n\nMy psychological history according to my parents: poor eye contact, behaviour problem such as head banging using hands poor attention and lack of social contact from the age of 3. delayed speech milestones, did not cry immediately after birth, and was diagnosed with learning disabilities with emotional and behavioral issues.\n\n\nHow do I stop masking and feeling guilty? \n\n\nI apologise if my English is bad",
            "Mujhe neend na aye, chain na aaye.",
            "I am feeling very depressed. nothing is going right with my life. I want to just never wake up.",
            "Can anyone help me to find a job in field of CUSTOMER SUPPORT or bpo (wfh)\n5 years i tried n I'm tired, if you you any hr or consultancy please give me contact, don't try to scam or ask for I'm really.. thinking to end it i can't take it anymore but I am still up for a last try",
            "Hey, do anyone have any tips for how to deal with political stress. It is my first time voting and keeping with all the news related to election, but I am getting anxious day by day, overthinking what going happen next. I can't concentrate on any of studies.",
            "I’m not able to sleep due to worry/anxiety. Any counselors who help over zoom or Google meet calls? I saw [this](https://www.reddit.com/r/india/s/38XjJvIODF) but maybe now there are more ways to interact than just a phone call.",
            "hey i am a researcher currently doing a survey research on a topic related to cyber crime it would be great if you can fill this form\n\nThank you for taking the time to participate in our survey. Your input is valuable and will help us understand the impact of cyber-related human rights violations. Access the survey by clicking on the provided link [https://docs.google.com/forms/d/e/1FAIpQLSd1VamcVYfgwaYeqf472c5S3EO5vwXRJqtkqGPJleDYJ7dFvQ/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSd1VamcVYfgwaYeqf472c5S3EO5vwXRJqtkqGPJleDYJ7dFvQ/viewform?usp=sf_link) Respond to each question accurately. If you encounter any difficulties during the survey process, please don't hesitate to reach out to us. Your participation is crucial, and all responses will be kept confidential, used solely for research purposes. Thank you for sharing your experiences with us. Note: Only respond if you have personally encountered cybercrime.",
            "I am writing this comment for no reason",
            "[removed]",
            "  \n\"When Love Turns into Obsession: My Story of Devotion and Betrayal\"  \n  \nShe is a close relative of mine. One day, her father had to be admitted to the hospital; it was a life-and-death situation. I was with her during that time, spending day and night at the hospital for four months. During this period, we grew closer and eventually became inseparable. I tried to end the relationship three times, but she begged me to stay, cried, and became emotional, so I stayed. She was becoming obsessive over me, getting angry over small things, and arguing for days. She questioned my every action—why do you do this, why do you talk to that person, why do you go there—she asked me to block people, and I did everything she asked. I never told her she was being obsessed.\n\nBut then, after her father recovered and was brought home, she started creating distance between us. By then, I was deeply in love with her. I cried and begged her not to leave me, but she didn't listen. She said I had become obsessed with her, and she couldn’t tolerate it anymore. She said she couldn’t make everyone unhappy just for my happiness. I wondered why she didn’t realize this earlier when I tried to end things, why she stopped me then. Why didn’t she realize this when we became intimate so many times?\n\nNow, I am broken. I am depressed. I have attempted suicide twice. I lost my job, my family has distanced themselves from me, I am in debt, and I am completely ruined.\n\nOn the other hand, she got a promotion and is partying every other day. When I went to her house to see her father, I found out she was out of town for a week, celebrating.\n\nAnd now, it’s just me left...alone.",
            "Just got cheated on 😍",
            "I got scolded by my mum and I knew what she was saying is right so I got angry on myself and probably cried hardest I've had so much so my hands and legs started shaking and felt numb afterwards and I kinda hit my head when I get sad/angry but this time I hit a little too hard and now I have a bump and it hurts, any idea how to make it less painful?",
            "I am bored with WFH setup 👋",
            " am 16Y (F), someone has created a fake account of me on instagram and has been using my pictures as pfp and post in a very wrong way with disgusting captions and bio as \"service available\". This has overall effected me in a very bad way, I don't know who exactly is doing it but I suspect a guy. I will be in very serious trouble if my family finds out about this, and considering my parents are with conservative and old generation they will not understand when I try to explain that it is a fake account. I don't know how to get the account deleted. I REQUEST SOMEONE TO PLEASE GUIDE ME ON HOW TO GET THE ACCOUNT DELETED, PLEASE CONSIDER THIS AS A PLEA FOR HELP.",
            "I've quite a lot of issues.... It'd be great if someone dm'ed",
            "Seeking some advice on dealing with childhood trauma. When I was in my early twenties I always thought I'll will treat my childhood trauma once i have money and now i feel like I do but I don't know where to start. Please advice.",
            "I'm a young F trying to pave my way everyday through  the verbal passive aggressive environment of my home. Where my mom and my brother's wife are at war I'm the one who is being used as a common asset to be targeted. His wife keeps spying on me to catch me doing illegal stuff like having a bf. Always being compared yelled at asked to behave in a certain way all while in trying to study to crack this exam. Small initial fights have blossomed into a full blown mental health issue and nobody cares nobody will budge. Mom has decalred that I'll be married off after getting a job and I'm just 22. Home feels like a prison and I think it's all because my brother married the wrong person who herself has numerous serious issues. Anyone out there who has been through this or a toxic household in general how is life now? Does it get better?",
            "https://www.change.org/p/replace-the-offensive-symbolism-on-massachusetts-state-flag I need help signing this petition for my mental health",
            "Project Aamdani  by Saday sadev helps women get employment by teaching then the neseccary skills to make handicraft items, then sell them in online and offline markets. https://youtu.be/huSko-eAqCI?si=izbx42MZgJFmZP0Z\n\nTheir Project Dhairya targets mental health issues in the society.",
            "I'm really really anxious about the future of this country and if the exponential rise in hate will cause a genocide like it did in the past. I'm very scared for my family's safety and well being. How can I deal with this? Please help.",
            "I really need support and guidance!\n\n\n\nI am too afraid of Cancer\n\nSo i have been having so many different symptoms(but unrelated to each other) and i am not taking diagnosis, thinking it will turn out to be C.\n\n1. since a year i have pain around tailbone which is not going away, i have tried everything and at the end i was suggested to get an MRI i was extremely afraid and overthought that they will find C. I read about chordoma once and since then i could not gsther courage to face it! I  still suffer till date. :(\n\n2. Now few months back i had a bad chest infection, i had blood in sputum as well. I was asked for xray, after gathering so much of courage, finally i went ahead with xray and even tho it was not completely normal but nothing like C was there too. Then the doctor asked me to do a TB test and Ct scan, but i never did the ct, symptoms subsided and i never went for it. For TB test also took a lot of courage to go for it.\n\n3. Now, i had a nasal congestion, doctor put the scope inside my nose and said its nasal polyp, but still i am afraid of C. He asked me to go for ncct pns. I am so afraid again :(.\n\n4. Now i have a dental appointment for a wisdom tooth extraction. For that also i cannot gather courage for an xray, thinking some abnormality will come up.\n\nI am tired of this. Tired of getting afraid and making myself suffer. I am tired of being such a coward. My social life is fucked up. My stress is all time high. \nI don’t know how will I survive like this. Sometimes I feel like to end it all and suicide. Please guide me. I really want to get out of this mental trauma.",
            "[deleted]",
            "So, I was playing tennis and was hit by a racquet, which caused tilting of my upper right incisor, so I went to the dentist the next day. I was not in any pain before attending to the dentist, but the dentist corrected the tilting using a foreceps and anesthesia. My teeth began to hurt after that. Now I dread that something went wrong.",
            "Hey, stay strong!\nIt's not my place to ask but are you divorced/separated or something else?\n\nI'll see if I can find a job posting internally. Send your resume in via DM.",
            "While I don’t have a solution to your problems, I share your agony and frustration. I am in kind of a similar boat where the parents who I thought were fairly progressive have regressed somewhat and it’s causing emotional turmoil in my relationship and affecting both me and my spouses day to day as well. We are in a cycle of every 3-4 months something happens that causes a day or two of emotional turmoil and then we are lucky that our parents don’t live with us so we are able to get back to our normal lives. The cycle keeps repeating.",
            "Hello\n\nI am a clinical psychologist and take clients for sliding scale and even free if i feel they need therapy and can't afford it. UnfortunatelyI don't have any slots right now. I may look for a referral if you still haven't found. (DM if you need)\n\n  \nPeople here have mentioned few good and few not so good/ethical places. So I recommend you do research on your therapist before starting. Try not to go with MA/MSc graduates with little experience. It will do more harm than good.",
            "Hey! Check out the website talktoangel.com they provide 15% off on every time you book a session. They have lots of therapists. Sadly my first experience was bad because my therapist turned out to be a teacher who judged me for watching shows but I am going to give it another try. \n\nFees varies from 700-1200 BUT with 15% off you can get it for as low as 595(my session costed this much).\n\nJust search the therapist very well before booking with them. Hope this helps.",
            "Hey, I am attaching a google sheets link of therapists \n\n[https://docs.google.com/spreadsheets/d/1NMIgVENJRTa-vM7cs3nETnGG5r42lyjPKAZ\\_cl0XFKk/edit#gid=646734042](https://docs.google.com/spreadsheets/d/1NMIgVENJRTa-vM7cs3nETnGG5r42lyjPKAZ_cl0XFKk/edit#gid=646734042)",
            "Just ignore him ?. He cannot do anything mostly. If you want, DM me with more details.",
            "I would not recommend preparing for the JEE at all. Apply to in-state colleges if you're in the US or Canada. Try to get as much financial aid as possible so that you don't have to rely on your parents. \n\nIt is next to impossible to get into an IIT unless you've been preparing for years. You will regret not putting your sanity before JEE.",
            "Hey man, that sounds like a really rough situation. I don't think I can help you out of this situation, but I feel I can offer some perspective as an EE grad from one of the top 3 IITs in india. \n\nFirstly the notion that if you'll be hot shit if you're an IIT grad is plain old bullshit. My college only saw a placement rate of 60% this year, the juniors I talked to feel quite helpless. But that is not sufficient ammunition to counter your dad.\n\nTruth be told you'll experience 'sangharsh' in life anyway whether you chose to pick it up or not. I mean look at you, you're already suffering. You feel like you're dad is forcing you into a decision that you don't fully understand. The proper way to face the struggles of life is not to go around pre-emptively looking for other struggles to prepare you what is to come. You can't predict struggles man, if you could do that you wouldn't have to struggle in the first place. And substituting JEE Prep for the real struggles of life is the biggest fucking fallacy embedded into the Indian psyche.\n\nJEE Prep doesn't prepare you to face the struggles of life and make something out of it. Hell-fucking-no . The vast majority of my peers, including me were largely clueless in college. There was no ounce of a purpose to be found in anyone. But there were expectations, expectations for us to become something by the time we graduate. With nothing else to do, we have to look for well-worn paths to success. The IIT-IIM pipeline, the IIT-UPSC Pipeline, the IIT-Software-Engineeering pipeline are some prominently chosen options. But with that sorted you still have problems. You kinda don't care about the classes: your degree and career goals are completely out of line/ the prof sucks/ the class seems obtuse and unnecesaary. But you are made to care about your grades because that hurts your placement. So there's a general sense of apathy that underscores the IIT experience. Note that I am generalizing here, most people grow out of this eventually and figure themselves, but that's normally only much later after graduation. Many people do good work, but that almost always comes after one has grown out of the morass of living to prove oneself.\n\nIf possible, try talking to your dad about how your specific choice of engineering is much better served outside india due to the limited facilities in here. Research fields in universities outside india covers a much wider breadth than they do here. The scope and funding for research is much better outside, and most important innovations are not done here (although IIT grads that have left the country are often involved, but you get the point). It is much better for you if you can build a better profile in the better research environment you have around you. A good plan to build your career outside india might be what convinces him. But I am not sure, I can't truly help you.\n\nIf you nevertheless have to take up JEE, I wouldn't say that it is impossible. Different people have different ways of doing it. What I would say is most important is to be crystal clear in your understanding of the material being taught. This is a game that proceeds as follows:\n\n1. Read the book until you can make sense of what is written.\n2. Look at problems to see of you can solve them\n3. Find a problem at which you fail\n4. Try using every tool you have to attack the problem. Try every approach you can think of.\n5. For every approach, see if you can grasp why it worked/ or why it didn't\n6. Rinse and repeat.\n\nJee prep is the above game repeated unto exhaustion. It is quite the rewarding endeavour if properly done, although it was very very difficult. It is quite effective at teaching you how to build your own tools to solve difficult problems, I think. I think JEE prep is well worth the effort just for that experience. It would be quite the productive exercise if everyone wasn't made to feel like their lives depended on it.",
            "IMO yes, she is making a better decision. She seems aware of her capacities which is always a good thing and it's not as if she is going to some random college either.",
            "I understand that he is your father and despite everything you are not able to abandon him but there is only one way out of this for you and your mother. That is to leave him or force him to get treatment (which i doubt will be possible here). There doesn't seem to be any other way out of this. At best you will get some emotional support. \n\n  \nThink things through and try making a decision.",
            "Tell them that their fights have affected your mental health. It might not reduce their fights but they are at least aware of how it is affecting you.",
            "Three things to do here two of which might backfire. \n\n\n1. Communicate with them about it - tell them how their fights are affecting you. Do it calmly, don't shout or get upset or be passive aggressive. Try to be as objective and detached as possible. If all goes well and your parents are progressive, may even suggest family counselling but that might be too far bc log kya kahenge. \n Cons: Many Indian parents will just use this conversation to guilt you instead of learning from it. \n\n\n2. Seek therapy - might go a long way towards you reconciling with yourself. Cons: might be expensive, stigma attached to it, you need a decent therapist for this to work. \n\n\n3. Leave home as soon as possible so you don't have to be around them all the time when they fight - Cons: expensive, if you love your parents it will be painful. ",
            "Used to be in the same boat...reach out if wanted",
            "bhai pehli baat toh highways k road cross hi nhi kiye jaate illegal h",
            "sue his ass and go for his money!",
            "+1",
            "Hey, I'm not Indian but I am a fellow human here who cares about how much you're hurting. I will spare you the guilt trips, I know from experience they only make things worse.\n\nI can tell you a few cool things about the bugs and spiders we share this speck of space dust with, if you want. Or about what other wild wonders abound in the stars above, if bugs aren't your thing. Or what lurks in the ocean depths. Whatever keeps your embers glowing, I will *find* something intriguing about it for you. ❤️‍🩹",
            "I don't expect you to dig into the root problems causing this with a total stranger from Canada, but if you ever do feel like talking about it....well, I can't promise I'll have answers (not being of your culture) but I can promise I will hear you out with support and without judgment.",
            "Not sure if I’ll have answers to your problems, but happy to talk to you and listen to you.",
            "If you can afford it, please look into therapy. Do you still have your job? Side gigs aren't that great in India unless you have specific skills, but you can try sites like Fiverr etc to try to find some freelance work. And apply for some side gigs even if they don't pay a lot just to tide you over while you try to resolve things. \n\n\n Always remember that even though things are bad now, as long as you're alive there's a chance they will get better. I hope things look up for you. ",
            "Do you have some hobbies and time to yourself every week? For example, you could take pottery or baking classes physically or try to seek out online communities (book clubs for reading, hobby forums etc) revolving around that hobby. Making friends is much easier when you have a common interest. \n\n\nI think there are even some apps nowadays that offer to match you with people for platonic friendships (I think Bumble had such an option) but I would NOT download such apps without first telling my partner about it bc if your partner mistakes them for dating apps it would create a huge misunderstanding. \n\n\nYou said you're a decent husband - do you and your wife have any common interests? Any stuff you two can do together or set apart some time to spend just the two of you so you can feel more connected? Same with the kids - do you all spend some time doing family activities or just hanging out together? Seems it's not just the lack of other friends but you might also feel a bit disconnected from your family. Sorry if that's not the case and my assumption is wrong. \n\n\nGood luck to you. ",
            "So you get close to someone when you share something about yourself that you actually care about or are able to be vulnerable with them. Or if you even just like them as a person you can take an initiative and just ask them to hang out and have a cup of coffee. This way you're being vulnerable and showing yourself and at the same time creating an opportunity for **both of you** to get to know each other. You can't control if you two would become close but you should still try. And you can still be close with someone without being in the same group as them. I would say don't **try** to be close to someone, get to know them and if you both vibe you'll get close. Taking action is the important thing here which is all you should care about.\n\nAlso it's not a waste of your college life if you're not able to do a certain thing. College life is an opportunity of being able to try different things and throw yourself in different situations, have new experiences, learn more about yourself and the world. Don't measure it by success in only one area. When trying to be more social and increase your interaction with the opposite gender, don't forget about the other aspects of college life, the other opportunities it provides you, whether it be having the time to try out different hobbies, being part of different clubs/societies, studying, knowing more about your field, knowing more about different fields other than your own, etc. You don't have to do all of this at the same time too!\n\nI would also say the things you do outside of college, whether it be talking to someone from a different college, being part of a different social group outside college, going on trips even if you go just by yourself, trying out a hobby for which there isn't a club for in college, are all part of your college life too as you would be able to do these things only during this time.\n\nYou had asked about a very specific thing but I think it's important to have a wider perspective for how you define a good college life. As a bonus of having a wider perspective you may also seem a bit less desparate and maybe have more success in the social area, but remember that's not the point.\n\nOne more thing, it's not bad to feel desparate but it's important to conduct yourself appropriately. Being desparate is a sign that you care about yourself and want to do things also, not like your friends who are maybe too satisfied in their comfort zone.",
            "How old are you?\n\nForgetfulness is pretty common now, especially with the information overload. So if these are isolated incidents, I don't think you need to worry. Especially if you realise or remember that you have forgotten something. With problematic forgetfulness, you wouldn't even be able to realise that you have forgotten. So if these are just sometimes or with certain things (like numbers or names), forgive yourself.\n\nBut, it can also be a medical issue. Certain mental health issues, like depression & anxiety, can cause memory-loss/difficulty to remember. If the memory issues increase, definitely go see a doctor. As an aside, does anyone else in your house/nearby have similar issues? Is there good ventilation in your house? There was a famous reddit thread where someone reported memory issues and paranoia, turned out to be that his house had dangerous levels of Carbon Monoxide. CO can be toxic, and fatal with time or quantity.",
            "Therapists can't and should not prescribe medications. Psychiatrists do that and any therapist who is doing that should be reported. Hope they found a therapist that suits them. \n\nIf not, someone here has posted link to a good list of places you can consult (some are not  good so do your research).",
            "They want to be accepted. It's thier own low self confidence they are projecting on rest of us.",
            "did you find any?",
            "I think these are the issues a therapist can only help. Although I have had some of these issues and I'm fine now, you are in teenage and there's a lot of hormones involved, better talk to a doctor and get better. But please don't skip school though, few days of leaves are fine but complete your studies till degree atleast.",
            "my advise would be avoid watching media at all ... and read news articles once or twice a week... whatever's happening is not going to change everything overnight, your priority right now is to study!!! ",
            "Same type of parents, same problem (my mother also used to do the same), my father although he never drinks(both side grandparents already dead). I am a single child and had gone through what you are going through right now. I can totally understand you. You have every right to be angry and upset about the situation and one thing there is nothing wrong with you. At time I also felt lonely and did not wanted to contact anybody even my best friend. Then one day I just sat down completely silent and judged the situation not as their son but as an outsider. Here what my realization was, \n\nThe first thing they too are people. They are not perfect. They can behave like shit as much as we can. Before you were born, before they even met each other they were completely different individual with different dreams, different live and different sufferings. God know what type of situation they faced, what type of unfulfilled aspirations regarding life these two had that may be now coming out as poison in front of you and your brother. But these facts alone cannot justify what they are doing to you and your bro's mental health.\n\n  \nSecondly, it may sound harsh, its your life that you have to take care of buddy and your bro's too. Just because they are your parents you cannot allow them to destroy your life and no need to sacrifice your life for them. Find what ticks you in life in a good and positive way. Its your life my friend do not loose this golden time try to focus on you own shit. Trust whichever God you pray to and keep on doing your good work you life is worth more than these petty fights.\n\n  \nIn my case when these fights erupted I was all alone. I had the same thoughts. I fought like hell in my mind no to focus on these bullshit and started building my own world. I realized that at the end of the day I was their son may also develop these patterns in life. Sat them down on a room. Explained to them how these guys are just destroying my life. They never listened so I went into my work and finally was successful to achieve my goal in my workplace. Got some new friends and slowly enough my parents may be saw my success and started to realize that they may be hindering with their petty fights and just like that they too are now trying not to fight.\n\n  \nNow my parents are retired from their job although they sill fight and still donot talk to each other for sometimes and mother still do the same thing. But now they have come to the resolution in their own ways.\n\nOne thing I noticed that job also plays a factor to play a role in terms of these fights. Who knows what kind of things that your mom and dad has to listen on their job and when they come home all they do is fight because there may be lack of emotional regulation on both the sides.\n\nAt the end brother all I want to say is it is how I manage to survive this war. You will find your own way around it. In no way I am a professional in domestic conflict issue I am just a fellow survivor who manage to save their parents(luckily) from this vicious cycle of hate. You will have your scars but in now way there is a problem with you or your parents the problem lies with how we all in our society handles the situation. Its just my opinion and story that I shared hope it helps brother. May God give you the strengths I pray and have the belief that things will get better you will find a better way.",
            "I got cheated on few months back I feel you",
            "Apply ice or ice pack on it ",
            "Buddy just calm down and ask your friends to mass report it usually takes it down",
            "[deleted]",
            "See a therapist. You seem to have hypochondriacal anxiety.",
            "May I know what you are charging for if it's just people talking to each other. And 500 for half an hour is more than what most psychologists are charging for individual sessions which isn't just talking to people without being judged.\n\nI request you to not exploit people already going through a lot in their lives just to make few bucks for yourself.",
            "Thank you u/kaipan15 ! I am sorry for your situation but also reassured a bit that I am not the only one in this boat. Just curious, are they any strategies for communication that you inadvertently or intentionally use during the emotional turmoil period for your folks back home? Also, not sure if this is applicable to your case but I feel less inclined to share my agony with my partner over time given the compounding effects turmoil has on trust. Feel free to DM if you do not want to respond publicly. No issues if you feel this is too personal and do not intend to share.",
            "Can you outline some steps or tips on what we should do to find the right therapist for ourselves?",
            "Actually I live in eu",
            "Sure gotta do it",
            "Yes I am looking for therapist but rn my workload is too high plus I got to make time for my dental treatment. I currently have wfh. Luckily my father is ok with paying for my medical bills so money issue is resolved for me. But my anxiety levels are going too high which is scaring me. I guess this is happening due to lot of medicines I'm taking for my dental treatment. But I'll handle it. I have left 2 wisdom tooth extraction, 1 implant plus 1 root canal. Good thing is my dentist is really really supportive of my situation. So I'm hoping for good things. Thanks for reply.",
            "Thank you so much. It helped a lot",
            "I am 40 now. Fact that I remembered password everyday and suddenly one day I forgot was a big surprise for me.\n\nMy life is stressfull due to my son's Autism condition. So, I do feel always worried for that. From environment wise I am lucky and have clean air and environment.",
            "Thank you. I am trying to avoid as much as possible now, my family is very pro politics so it is hard to maintain it. I wish I can tell them shut up 😭",
            "Feel free to dm me",
            "1- Preferably go for Clinical Psychologists (MPhil) over psychologists/counsellors (only MA/Msc). Not to say that Clinical Psychologists are superior as many counsellors I have seen can be better but it is safer bet because any random dude with Masters in psychology can practise as a counsellor regardless of whether they have ever been trained in therapy.\n\n2- Whoever you are going for make sure they are from a reputed college. Some good MPhil colleges are: NIMHANS, CIP, LGBRIMH, IHBAS, GMCH, KGMC, RML etc. If choosing a counsellor then: TISS and Ambedkar University (Delhi), but also look if they have done extra certifications (from reputed institutes) or have at least 3 years of experience or have a supervisor.\n\n3- Run as fast as you can if a therapist ever says anything resembling guarantee. That doesn't exist in psychotherapy and anyone who claims that is just asking for your money.\n\n4- Most importantly at times even a good therapist may not work out for you. A therapist and a client are like two pieces of a puzzle, who may fit or not. Don't completely give up on therapy if it doesn't workout first few times. (I have tried 5-6 psychiatrists and 4-5 psychologists to find ones that works for me)\n\n  \nEdit: 5- Avoid those insta psychologists you see in reels. Most of them are frauds.\n\nFeel free to ask any other questions if you have any.",
            "well it's still better than anything India has to offer. plus it's cheap.",
            "You're welcome. Feel free to DM if you want to talk more about it or anything else too.",
            "> Run as fast as you can if a therapist ever says anything resembling *guarantee*\n\nSorry, but I didn't understand this part clearly. What did you mean by \"guarantee\" in this context? Did you mean to say that some therapists will guarantee us a full recovery, just to entice us to use their services and thereby get our money?",
            "My dad won’t let me. I might Kill myself under depression if I go and do jee. I will have no choice.",
            "not just full recovery but any recovery. may sound bit extreme but whatever my understanding and reading of psychotherapy is, it's not advisable to even say to that the patient that they will get better.   \nOur clients usually ask us (especially those who have been suffering for a long time) whether they will get better with therapy and sometimes they plead to us to help them get better. In such cases a good therapist will instill hope without making it sound like there is surity of them getting better but a bad and unethical therapist will give surity.",
            "Understood. Thanks for explaining it very clearly."
        ]
    },
    "ST. BROSEPH AND FEMALE SOCIAL WORKER WERE ASSAULTED TODAY (22nd June, 2024)": {
        "title": "ST. BROSEPH AND FEMALE SOCIAL WORKER WERE ASSAULTED TODAY (22nd June, 2024)",
        "score": 533,
        "url": "https://www.reddit.com/r/india/comments/1dlsxvr/st_broseph_and_female_social_worker_were/",
        "content": "Recently, [u/St\\_Broseph](https://www.reddit.com/user/St_Broseph/), Dushyant had rescued a 23-year-old girl from Tiruvannamalai, a town in Tamil Nadu. He had saved her from a tyrannical family which was trying to control her and get her married off. Before leaving Tamil Nadu, the girl had recorded a video message of her from her own house stating that she is leaving home at her own accord and that she does not intend on coming back to her family. She then shared this video with all her family members, friends and relevant police authorities in Tiruvannamalai. She had also, upon reaching Bangalore, called the police control room and informed them that she is alive and well and had left at her own will. Yesterday, upon receiving information that a missing persons complaint was being lodged for the girl, the girl herself had contacted the Tiruvannamalai police and informed them that she has left out of her own will and even offered to video call them to show them she is okay. Dushyant had called the DSP and other police officers of Tiruvannamalai who didn’t receive his calls. He had then texted him to inform him that no missing person’s complaint should be taken because the girl was alive, well and safe. Broseph had even tweeted out to the Police authorities there telling them that he is not able to reach them. (Link to tweet below)  \n[https://x.com/St\\_Brosephs/status/1804183500645634108?t=KrcQ6QVIVjnA2jO6adco3Q&s=19](https://x.com/St_Brosephs/status/1804183500645634108?t=KrcQ6QVIVjnA2jO6adco3Q&s=19)\n\nAt around 2:30 AM today, 3 Tamil Nadu cops in civilian clothes along with the rescued girl’s parents, in a civilian car showed up at Dushyant’s doorstep. They did not show any identification apart from a picture of one of them in a policeman vardi. They asked him about the whereabouts of the girl and then attempted to drag him outside. He accompanied them to the main road where they proceeded to be abusive and aggressive. Then, still accompanied by these Tamil Nadu cops, he went to the Indiranagar police chowki nearby, where the cops were asleep.\n\nThe cops even after being awakened, were helpless and kept asking Dushyant to comply with the unreasonable Tamil Nadu cops. The Indiranagar cops along with the Tamil Nadu Cops and Dushyant went to the SBA Headquarters and started knocking on the door and ringing the bell. The Tamil Nadu Cops were still being extremely aggressive and by now had begun pushing and manhandling him when the people at Headquarters  weren’t opening the door because it was 4:30 AM ish in the morning by now. Frustrated by these things, these monsters tried to drag Dushyant towards the main road and put him into their civilian car. They used force and ganged up on him when he resisted this blatant abuse of power. They tried dragging him into a car and god knows what would’ve happened if he were to go with them.\n\nBy this time Janhavi, got here and tried to support Dushyant. The HQ people had woken up by now and opened the door because of all the commotion. Seeing the HQ open, the girl’s parents lunged inside. Janhavi ran to stop the girl’s parents from trespassing into the HQ and possibly making things worse. She tried to stop the girl’s father. This animal of a person, enraged by being stopped by Janhavi began to hit and punch her. This whole thing was further horrid because Cops from TWO JURISDICTIONS WERE PRESENT THERE AND DID NOTHING TO STOP JANHAVI FROM THIS ANIMAL EVEN AFTER THEY WERE ASKED TO. HE HURT HER SHOULDER, FACE AND KEPT GOING. Dushyant was near the main road and as soon as Janhavi pushed her head out of the door and screamed for help, he ran to her rescue while cops were still trying to restrain him physically. Dushyant had to physically move the assailant away from Janhavi to stop him from hitting her further. The Sub-Inspector of Indiranagar then got to the scene and asked everyone to head to the police station.\n\nEven after so much had transpired and such blatant disregard for law and order had been displayed, the cops at Indiranagar Police Station still tried to TAKE THE TAMIL NADU COPS’ SIDE instead of treating this case on its facts. They were asking Dushyant to not escalate this legally and to comply with them. This whole incident shows how disgustingly entitled cops can get in Tamil Nadu and the height of incompetence shown by Indiranagar Police.\n\nDushyant has decided to pursue this legally. They have gotten medical attention and have medico legal cases. We will hold these abusive cops accountable for their lack of responsibility and blatant violation of procedure. These cops need to be SUSPENDED and the man who hit a FEMALE SOCIAL WORKER MERCILESSLY NEEDS TO BE PUT BEHIND BARS FOR HIS ACTIONS. We will do whatever it takes to bring these cops down because if cops turn a blind eye to crimes, refuse to follow procedure and act in such a brutal and disrespectful manner, are they even cops? Are these shameless scoundrels charged with our safety and protection? Imagine being in this situation instead of a resourceful person such as Broseph, anyone else would have been further assaulted, beaten and persecuted. We cannot rest until the perpetrators are arrested and the cops responsible for this are suspended and for this, we need your help. Follow and amplify St. Broseph posts on this incident across social media, call your journalist friends and inform them about what’s happened, AMPLIFY THIS VOICE so that the law and order situation may improve and the next time a cop even considers doing something like this, they are reminded that **PEOPLE OF BANGALORE WILL NOT STAY SILENT.**\n\ntl;dr\n\nDushyant, a social worker, rescued a girl from a controlling family. Tamil Nadu police and the girl's parents showed up at his doorstep at 2:30 AM to take her back. They assaulted Dushyant and another social worker, Janhavi, when they resisted. Bangalore police did nothing to help. Dushyant is calling for legal action against the police and the girl's father.",
        "num_comments": 16,
        "comments": [
            "More power to Broseph and his team. I hope you guys have some CCTV footage. Broseph is a selfless volunteer, hope he gets as much support as needed for this.",
            "If you could make and link posts from more conventionally relevant social media accounts of u/st_broseph or related accounts, it would also help. \nAs there are a lot of people who do not really use reddit. \n\nReddit or Instagram posts maybe?",
            "Keep fighting the good fight, guys!",
            "Is there anything that someone who’s not living in Bangalore can do to help ?",
            "Shameful, Can't believe this doesn't have more traction already. I don't post much, but I have heard of STBrosephs always helping out people when and where they need it, and to have something like this happen to them is just sad.\n\nHoping something gets done and those fuckers get what they deserve.\n\nhave posted on twitter/ X",
            "How are they? I hope they are ok.",
            "The fate of being a woman in India. Can't trust a single male - not the father that is supposed to protect you or the cops who are supposed to help you when you're assaulted. Not allowed to take a single decision for themselves without elders with fragile egos losing their shit to control your life.  Pathetic.",
            "A few good people fighting this horrid system.... We must support them as much as possible.",
            "Commenting for Visibility.",
            "Yup cops should start being punished for abusing their power. Stories like this makes me feel like we are still in the colonial era.",
            "Hope you all go forward with this and file the case. I have read a lot about Broseph and how selfless he is. Hope this incident doesnt make him stop in his endeavours which have helpes so many people",
            "I am sorry to say this but nothing will happen to the cops no matter how much you try.",
            "They've done it in Twitter, link added to the post now, ig",
            "Not OP. You may share the tagged social media posts for better reach, maybe",
            "Spread awareness on other platforms"
        ]
    },
    "Indian Dies In Italy As Employer Dumps Body After Arm Severed By Machine": {
        "title": "Indian Dies In Italy As Employer Dumps Body After Arm Severed By Machine",
        "score": 1102,
        "url": "https://www.ndtv.com/indians-abroad/indian-dies-in-italy-as-employer-dumps-body-after-arm-severed-by-machine-5940041",
        "content": "",
        "num_comments": 137,
        "comments": [
            "A 31-year-old Indian casual worker in Italy has died tragically after he was dumped on the road without medical assistance by his employer after his arm was severed by heavy farm machinery, an incident that has shocked the country.",
            "The employer must be tried for murder.",
            "At a time when Narendra Modi is in Italy?\n\nWant India to escalate this issue.",
            "Every Indian Must understand, \n\nJust imagine how cruel it is. Even in a war, opponents are treated better. Imagine that poor worker bleeding in pain with arms cut off. Just imagine plight knowing that he won't even be admitted in a hospital. Very cruel. In human. \n\nWill you do this even to your enemy? NO\n\nOur Corrupt media tells - India very powerful in global stage, every country bows down in front of our prime minister, blah blah blah.\n\nEven Patriotic Indian Foreign Minister, Spy Agency, Other Business/Political Leaders kids are citizens of Western Countries. \n\nThis news shows reality of our global standing. If the worker was from any developed country would they have done this. NO NEVER. \n\nImagine a worker from Poland/Thailand had the same fate they would have been in a hospital. We are treated like dispensable. \n\n1. It was done only because he was an Indian. Indian, Somalian, Sub Sharan African, Afghani, Bangladeshi workers are treated in the same way.\n\nEven within India we are cruel,\n\nI am a South Indian but I am often disgusted by how people see Biharis within India. Biharis are your countrymen, they are Indians, they are humans. Often time we should also check ourselves. \n\nGo to any developed Indian state. You should see people hating on Biharis. To the extend that people from Bihar no longer disclose identity to avoid being looked down like non humans. \n\nForeigners see Indians who come for jobs the same way our people look down on most unfortunate. \n\n2. We have a massive unemployment problem. China created 40 crore manufacturing jobs. We hardly created any manufacturing job in part 30 years. \n\nCongress failed in creating jobs. BJP was worst at job creation. While world expected india to have a manufacturing boom post 2014 but that never happened. \n\nEven IITs are having placement crisis. Imagine who will employ millions of tier 3 college grads. \n\n3. Indians are now going to War Zones like Russia, Ukraine where we are treated as battle fodder by our own friend Russia.\n\n4. We are now topping illegal immigrants entering US even challenging Mexicans.\n\n5. We are very proud about our population. But that's BS. We now crossed Chinese population. We will soon reach 150 crore people. Just imagine the amount of unemployed youth, climate change and reduction in resources?\n\n6. For the Average Indians even a Shenghen or USA tourist visa is hard to obtain because they fear we will illegally immigrate.\n\nGlobal Standing means -\n\nHow your people are treated across the world?\n\nHow many countries allow visa free entry etc.\n\nIndia really needs to create 2 crore jobs per year to absorb the youth population boom.",
            "People are writing paragraphs here, so I'll shorten it for everyone else: Don't immigrate illegally. You practically have no protection if you end up in a lousy situation like this.",
            "We have to look into the reasons why people go to foreign countries in order to live as second class citizens at the mercy of their employers. \n\nThere's something horrible wrong here.",
            "It's a common trend in Western nations, this is another example of Indian laborers being treated as slaves / abused / not paid (in ISR, a fake ally): https://foreignpolicy.com/2024/04/25/israel-agriculture-india-palestinians-foreign-workers-rights/",
            "That is why it is very important to think about whom we vote for. The sons and daughters are made to suffer for the poor choices of their parents. \n\nThey kept electing Lalu though he was corrupt to the core and now they are electing Nitesh who cares only about being a slave dog from party to another to keep his position to loot. Unfortunately democracy comes with responsibility and being naive is not an excuse. \n\nI firmly believe no party should be having more than two consecutive terms in our political setup otherwise there is no way a state can develop. Bihar, West Bengal are the classic examples",
            "This is so sad 😞, the Italian legal\nSystem should punish the person responsible. GoI should escalate!",
            "I'm Italian and this happened not far from my home. \n\nI'm sorry for what happened but i think it's crucial to understand that work conditions in Italy are bad even for italian people with degrees.\n\nComing here illegally, with no degree and not much understating our language is basically coming here as a slave to these people.\n\nThese people, the business owners, they need to stop, but the only way they will stop is by cutting their endless supply of cheap slaves who are willing to work for less than the ones before them.",
            "Stories like these highlight the dark underbelly of global immigration. This comes just a couple of weeks after the Kuwaiti fire tragedy when dozens of poor workers huddled and locked in a 'camp' died. \n\nThose at the bottom of the pyramid try to escape poverty at home and end up exploited when they seek greener pastures.",
            "And pm busy mingling with meloni",
            "I can’t figure out why anyone would spend 30-40 lakhs to migrate to developed countries only to work as labourers, live in anxiety of being deported, live without safety net of police, hospitals, public services. \n\nIf you can’t migrate legally, why do you sell your ancestral land to migrate illegally? Why not work hard on the same land and earn for yourself? A life of dignity is a better life than a life of false prestige. ",
            "Power of Indian passport!",
            "Day 1024 of west showing that they don’t really care about human life",
            "Indians are the new Africans of the slave trade times.",
            "TIL Indian workers work in Italy.",
            "And then some what's app graduates are shouting \"Paw paw ne India ka danka baja diya world me\"",
            "Unfortunately no one cares, there is too much illegal Indians that can be replaced in Europe.",
            "Italy, the least India-friendly EU country.\n\nBut Meloni 😍",
            "We should stop pleasing countries like itlay than.",
            "India is a failed state. It's nearly lawless at this point.",
            "Lot of fucked up stuff coming out of that region",
            ">His employer Antonello Lovato has been charged with negligent manslaughter.\n\nHope they guy gets the maximum punishment.",
            "Ye sab kya dikha rahe मिलौड़ी meme edits दिखाओ l 🤭🤭",
            "European employers are nearly the worst",
            "Cant you guys just send another, what it'll cost like 15 cents?",
            "Follow up: \n\n\n- Italy’s Minister of Labour, Marina Calderone, said death of Mr Singh had been an “act of barbarity”.\n\n\n- The Indian embassy in Italy said it was “deeply saddened by the unfortunate demise of an Indian national” and added it was “actively liaising with local authorities.”\n\n\n- The Flai CGIL trade union has called for a strike of agricultural workers on Saturday to protest the death of Mr Singh. Maurizio Landini, the union's secretary general, said: \"We are faced with a situation of real slavery. The death of a worker - an undocumented worker - is of unprecedented gravity.\"\n\n\n\nhttps://www.bbc.com/news/articles/c066lxkmgdro.amp",
            "murder, as well as the usual negligence type thing (occupational health type).\n\nThe first will \"only\" ruin his life. ~~The second will ruin his business as well.~~\n\nEDIT: The second will enable safety at that organization and in general.",
            "The employer (Lovato) is now under investigation for criminal negligence and manslaughter.",
            "The two Italian guys that casually shot Indian fishermen got a free ticket back to Italy. This Indian government loves taking it from the back",
            "Did you even read the article?",
            "Question: I'm a foreigner. I'm aware that Indians in general view Biharis with disrespect. Why is this? Is it because they're poorer, or what are they viewed as lacking exactly? Are they viewed as being less educated / dirty / ugly or what? ",
            "This is the reality folks! Nothings been sugar coated here. We Indians are viewed as pests in foreign countries. Precisely the reason why I left the UK. While I love to bash India a lot lol, I still appreciate my country just as much.",
            "> Imagine a worker from Poland/Thailand had the same fate they would have been in a hospital. We are treated like dispensable.\n> \n> \n\nYou should stop talking out of your ass, son. I'm European, and I can tell you that the treatment Polish workers receive here is fucking horrendous. People have actually gone to jail for that, and the treatment the workers receive outrages people. \n\nThis has nothing to do with the poor man being Indian, it's just a shithead hiring someone and not caring about whether they live or die. \n\nAnd if you honestly believe that Russia is \"your friend\", you're severely mentally challenged.",
            "Wait Indians fight for Russia in ukraine? Whoa. I’ve never heard anyone say that before.",
            "Indians are an incredibly racist group of people. You create problems wherever you go. I hope all of you are deported from Canada.",
            "The so called developed world had cruel leaders that took them to where they are now. \n\nThe Indian subcontinent did not nurture such leaders. We were high on moksha and nirvana until shit eventually hit the ceiling. \n\nLankan here.",
            "The biggest problem now and always will be our population. For every worker there is dispensable one. The person knows he can get another Indian. The less the population fighting for that job the better the pays the better the jobs. When u dispensable nobody cares",
            "What you said is true. Systemic discrimination does exist.\n\n\nBut here's what happened after Mr. Singh's death: \n\n\n- Italy’s Minister of Labour, Marina Calderone, said death of Mr Singh had been an “act of barbarity”.\n\n\n- The Indian embassy in Italy said it was “deeply saddened by the unfortunate demise of an Indian national” and added it was “actively liaising with local authorities.”\n\n\n- The Flai CGIL trade union has called for a strike of agricultural workers on Saturday to protest the death of Mr Singh. Maurizio Landini, the union's secretary general, said: \"We are faced with a situation of real slavery. The death of a worker - an undocumented worker - is of unprecedented gravity.\"\n\n\n(*Look I totally agree with you. But this was irrelevant at best.*)",
            "thanks",
            "They're not seeking asylum or immigrating for no reason.  There's nothing for them at home",
            "This would have not come to this only if Congress and opposition would have done good job before 2000,",
            "Gujatat is paradise right? 😍",
            "Their hypothetical kids would probably get naturalised citizenship and get proper schooling amongst other things. I say hypothetical because they would somehow also need to bring their wives illegally.\n\nOr the job agencies they contact in India probably fool them they are getting to work legally, who knows",
            "When you don't get jobs in your own country, that's the main cause of migration. If you work as a laborer in india will you get dignity or respect? Not even you will get paid fairly as well. Don't just blatantly say black white stuff.",
            "Horrible action by the employer. Should be tried for murder. \n\nBut it's not like there's a difference between us and the west with respect to how we treat our employees. Infant as a general principle, labour laws in India are more exploitative than those in the west who apparently \"don't care about human lives\"\n\nYou think some rich slumlord turned politician would pay attention if some poor fucker injured himself while working for him? He would probably just tell his guys to \"take care\" of that dude.",
            "As if we are any better.",
            "what, only three years? \n\n  \nlol \n\n  \nCapitalism started before that",
            "My brother in Christ you'll definitely find a butter chicken place run by a Punjabi guy even in Tristan da Cunha, the most desolate inhabited place on Earth.",
            "Can’t keep politics out from someone misery? I feel sad for you.",
            "Bhai kabhi kaam bhi kiya hai europe me? On what base you're saying this?",
            "The worker union has gone on strike in protest.\n\nSomething like this happening there is shocking but it happens in India all the time with zero consequences. We have child labour and exploit the poor worse than most countries.",
            ">The second will ruin his business as well.\n\nThis may not be an entirely good thing if it also has has a collateral harmful effect on the other people working for this business.",
            "sauce",
            "I just referred to what would happen next.\n\nStatement ke baad kya hoga, I'm more interested in that",
            "Just want to blame everything on Modi.",
            "They are very very poor.\n\nAnti Bihar Backlash started in Maharashtra in 1970 (you can read on Wikipedia) \n\nBut that doesn't mean we should disrespect. Every human needs respect. We should treat everyone with kindness. \n\nInfact Bihar has lower GDP Per Capita, Human Indices than most sub saharan African countries.\n\nAfghanistan, Somalia has better indices than most Bihar Districts except Patna.\n\nBihar has a very high population growth rate and young population but no jobs. Very bad governance, Zero Investments.\n\nSo Bihari youth migrate to other states.\n\nThey are accused of everything because of Hatred.",
            "Bihar is to India what Florida is to the USA (at least in terms of crazy shit that happens). We'll it's worse because at least people in Florida get the advantages of being a US citizen. Bihar's issue is mostly due to lack of education, law & order and massive corruption that has lasted for decades. The state is still lagging behind in most metrics while rest of the nation is improving. As a result they form majority of the migrant blue collar workforce in the country and indians have a tendency to discriminate whether it be religion, caste, colour or language...",
            "History of poor governance and lack of development in that region.",
            "It aint that bad but for some areas btw(ofc everything aint bad or good)",
            "Just the usual immigrant hate, but by state. Meanwhile at country level, Indians hate bangladeshi immigrants",
            "Bihari's are known for their ability to steal jobs by offering themselves in low price.And most of them lives in group of men they have strong community which have a network where discussion are held to acquire skills and climb the corporate ladder while filling their vacant position by their close one . They were famous for their criminal activities done to their own  employers  . they are hated due to their past and present actions of producing multiple children and killing girl child. in 80 & 90 s there was a moment to control child birth by limiting the number of children to 2 , but Biharis didn't listen and produced like God will . They are also known for their tendency to betray people. Most of the Biharis have changed their surname and cast to avoid this but a experience person can identify Biharis even when they change their whole personality.they are known for identity theif lastly Biharis were also known for their purging actions in some states of India.\n\nAnd people of Maharashtra hate them most .\nTLDR :- Biharis stole future opportunities of many people in India by their amount of population.and there politicians were / are shitloaders .",
            "Bihar is like the Africa of India. Majority of Bihar's areas are much worse in every indicator than sub-saharan Africa. You can even say that Bihar is probably the poorest region of the world.\n\nIndian mind is extremely segregating. Social division has been rampant since thousands of years in India. So that doesn't help either.",
            "The fellow countryman is probably in the bubble of indian youtube geopoliticians and seeing everything with the lense of outrage. But he was being sarcastic about Russia being our friend, I must admit though that 90% of Indians do believe that shit. It's just the media being an ass licker and the boomers giving lectures while they themselves have done nothing in life except reducing their family's networth earned by the great-grandparents",
            "If you check some of the combat subs, you can find a couple vids of Indians in Russian camo pleading, hands together 🙏, with a Ukrainian drone not to get vaporized.",
            ">There's nothing for them at home\n\nIs India at war? Is the entire country bombed?",
            "At least you spared Nehru.",
            "Do you even read? \n\nThe people who spend 30-40 lakhs to migrate illegally do so by selling land they own.  They aren’t labourers. They are farm owners.\n\nLabourers in India don’t even have the privilege of dreaming to spend 40 lakhs. ",
            "This is politics.  The real one.   Not the election hungama.",
            "...an unsafe workplace must be examined.\n\nThe business' mistake was letting the arm get cut off in the first place. --> safety investigation.\n\nThe employer's mistake was dumping him on the street to die --> murder investigation.",
            "If the prime minister of Italy has already made a statement over it what do you want india to do ? Talk to God?",
            "Buddy how come every good thing is his doing as soon as bad shit happens he is out of it.",
            "Yes, if he’s taking credit for everything. We shall blame him for everything bad too. :)",
            "Ok but let's say there's a group of 20 Indians in an office, working in the US. 5 of them are Bihari. Would the other colleagues still be likely to practice discrimination? And if so, what exactly could they base the discrimination on?",
            "As a Texan if I said:\n\n\"~~Bihari's~~ Mexicans are known for their ability to steal jobs by offering themselves in low price. And most of them lives in group of men they have strong community which have a network where discussion are held to acquire skills and climb the corporate ladder while filling their vacant position by their close one . They were famous for their criminal activities done to their own employers . they are hated due to their past and present actions of producing multiple children and killing girl child. in 80 & 90 s there was a moment to control child birth by limiting the number of children to 2 , but ~~Biharis~~ Mexicans didn't listen and produced like God will . They are also known for their tendency to betray people. Most of the ~~Biharis~~ Mexicans have changed their surname and cast to avoid this but a experience person can identify ~~Biharis~~ Mexicans even when they change their whole personality.they are known for identity theif lastly ~~Biharis~~ Mexicans were also known for their ~~purging actions~~ drug dealing and raping in some states of ~~India~~ Mexico.\n\nAnd people of ~~Maharashtra~~ West Texas hate them most . TLDR :- ~~Biharis~~ Mexicans stole future opportunities of many people in ~~India~~ Texas by their amount of population.and there politicians were / are shitloaders .\"\n\nThen yeah, I would be believing in some racist ass shit.  Get your fucking shit together and unify yourselves, you'd be a great power.",
            "That sounds like racism",
            "But ok let's say a Bihari is educated and working with other Indian colleagues in an office in the US. They all have similar education etc.\n\n\nWould the guy still maybe face discrimination, and if so, what would he be discriminated against for? Seeing as all of them would have same education and socioeconomic standing, would it be likely he would face discrimination or he probably wouldn't?",
            "Who am I to comment on Nehru?",
            "Totally agree on murder and safety investigations.\n\nDon't agree on directly jumping to ruining that business before an investigation is done.",
            "Isn't talking to Modi the same as talking to god?",
            "Let the 'God's' cabinet not rest till justice is served. This is happening everywhere, with Indians being the victims.",
            "I don't know why you are getting downvoted because of stating facts. I guess the others think that you lack empathy or something. But in my books you've done your bid by sharing this and bringing it to so many other's attention.",
            "You so intelligent, I salute 🫡",
            "Yes of course, we have birth right to do that.",
            "Well I'm a Bihari myself. I'd say problematic things about us are so normalized that in a group of 20 people, someone can casually breakdown your confidence. Biharis usually have a different accent and a slightly different dialect of Hindi.",
            "People don't hate Biharis just because they are poor the problem is they usually won't adjust well. As there are not many educated in Bihar those who migrated to other states usually tend to work as manual labourers but the problem is the area they live started to become slums as they will have multiple kids within a few years which makes it hard for them to come out of poverty and any nearby streets which usually not bad or decent will start to effect because of having their slums nearby the neighborhood. That's why most people in india hate biharis, it's not their fault because that's the way they learned how to live.\n\nAnd coming to your question whether Indians hate educated Biharis which is mostly no. As most of the educated tend to be aware of their surrounding peers and act accordingly.",
            "[removed]",
            "Well if someone stole something from you and they theif while  have the tendency to do heinous crimes and having their past know for untrustworthyness  . I am preety sure you will hate them .",
            "In a typical working/formal education environment, probably no. But I have been to only a nice college and 2 startups with an excellent company culture so YMMV",
            "People are prejudiced against them. It has nothing to do with their education/ standing. However, a well groomed Bihari will suffer less prejudice. Its just like prejudice against blacks in US.",
            "Who are you to comment in general bro?",
            "Okay, you are a sane one. Congrats. (no sarcasm). I'll make an edit.",
            "No, there are victims of every race and color daily. Indians have lately started mass immigration so now their numbers of being victims will theoretically go up too. Ratio and proportion.",
            "Also why would india talk about let's say a Chinese being killed or a Nigerian in Italy or Croatia etc ? Wouldn't China speak about it or which ever origin country they are from ? You won't hear it cause you are in india. You will only hear of Indians dying overseas",
            "Yeah, we have the birthright to criticize the shortcomings of our elected representatives. We live in a democracy, duh",
            "The different dialect, are you referring to Bhojpuri ?",
            "Ok thanks, so are these slums generally dangerous / do the people engage in crimes? Or are they just very crowded or dirty?",
            "Ok. How are they uncivilized exactly? Are they generally more rude? Or do they have religious practices that are based in older Indian religious traditions?",
            "Your post has been removed because stereotyping a whole community, religion or any group of people based on anecdotal experiences is not allowed in r/india.\n\nFurther, quickly tarring an entire community based on the alleged actions of (under-investigation or convicted) persons of that community will be the basis for instant bans from r/India.",
            "A Person is a thief. An entire race of people cannot be blamed for the actions of some. That,  my friend,  is what racism is",
            "I'd like to ask, Who did t hey steal this job from, exactly? What gave you the right to the job above them?",
            "An Indian, an voter a tax payer not a free loader. \nDo I have to be someone else?",
            "And why exactly are they moving out of Vishwaguru during Amritkaal? 💀",
            "Yes sir you are right, yesterday at least 10 people got robbed in SF. I am sure Modi and the ruling Indian gov should be criticised.",
            "No no, it's like instead of 'mai' (ie, I in English), biharis say 'hum' (ie, We in English). It's Hindi only",
            "When in human history have slums not been linked to crime, density and disease?",
            "Dude jus read more things regarding Bihar in internet! Its free rather than coming again and again with same question",
            "They are uneducated.. the things that happen in bihar and the things that comes out of their mouth makes you think that they live in 15tj century.. they are rude.. they stare at women in a creepy way.. they spit on streets.. have no hygiene.. rapes.. sexual assaults.. if uncivilized was a place bihar would be it(along with north India)",
            "[deleted]",
            "Can't argue with you as I don't have words to defend myself hope u don't meet Biharis in your life . and if it makes me racist let me be RACIST to defend my self from what my people have experience.I will not forget what have happened.",
            "Doesn’t that also give you the right to comment on the first prime minister of the country in which you are a voter, a tax payer and citizen? What special exam do you need to qualify to comment on Nehru?",
            "They have been moving out since ever since they had the means, more people now then ever before has the means.\n\nOr are deluded enough to think people stuck around before because of grand economic opportunities of India ?",
            "Ask your cousins. How do I know.",
            "If those 10 were Indians, then it is the duty of our government to ensure that necessary remedy is provided to those individuals by the government of that country. After all, what is the use of foreign ministries, embassies and consulates if they are not vocal about crimes happening to our citizens.",
            "Ok, so on Wikipedia it states around 50 million people still speak Bhojpuri , do you think the number is probably less ?",
            "Is the number 4 one because they speak Bhojpuri?",
            "Bihar has this yin and yang phenomenon with education levels. Like Biharis usually aren't educated much at all but when they are....",
            "https://i.redd.it/2wypjrzlq28d1.gif",
            "Who said it’s not being done? Remedy comes after something happens. \nCriticising on the act to the ruling Gov 🫡",
            "Well my own mother tongue is Bhojpuri but my parents conversed in Hindi at home, so I never learnt it. Similar case with most of my cousins. I can understand it but can't speak it. In rural areas, it is still widely used. Given the population of bihar and jharkhand, 50 million bhojpuri speakers is totally believable, given there is an entire movie and music industry for bhojpuri. It has become really vulgar lately tho.",
            "Bhojpuri is dead. What remains of its mixing with hindi is the bihari accent. Bihar lives in the 70s of India. The caste based political divide broke that state. The politicians banged them so hard that they had to leave their states for a measly 15k job. For context a kilogram of wheat flour costs 35+ INR and an average indian consumes about 10-15kgs of it. and even the rents for the shitiest of the livable ghettos is 5k in the metros. So you get it. Things have improved a lot in the recent years but inflation has destroyed their futures. The state is overpopulated as disease and famines were widespread in the pre liberalisation perios so as the rest of the India reduced the fertility rate but biharis kept having lots of children and those children couldn't get access to quality healthcare or education. Biharis are genetically suppossed to be around 170cm but the whole state except for the middle class and rich is stunted. Their are no corporate offices in that state and is always neglected by even their own politicians. Their is a competition for resources which creates brutality. And imagine first being colonised for 200 years and forced into being a part of shared plantations for various crops. Then you get independence and the local goons get into the government and make it a Jungle Raj. This scenario has created a lot of problems and one could only dread of being brought up in that place. The generational trauma shows its results and a lot of people do retarded acts like stealing government property(These guys don't even leave bridges, yes they stole many bridges made of real concrete and steel). And a general lack of civic sense is also found in those people. The argumentative tone of insulting or devaluing an individual and the general urge to scam people. \n\n  \nThis is a brief intro if you want to have a true bihar experience then visit it and you will know. These are all the reasons for hate towards bihari immigrant workers by the locals of any given place in the country. It sets a stereotype in the mind of the average Joe.\n\nAnd also, there is a general competition of whose dick is larger in Indian society which creates a lot of hate towards even their own kin.\n\nThe solutions which I think will help the above case:-\n\n1. Lock up all the current popular political faces in Bihar forever with no communication to the outside world. Let them do their shit in a jail face-to-face with their political rivals.\n\n2. Reduce the population. Even though the vast majority of India's land is fertile and habitable, the population is just too much to bear. Our rail networks are reaching the maximum upgrd point with the current infra and civic sense and we aren't even able to provide clean water to our people. \n\n3. Start funding R&D and manufscturing. $20B were spent by indian govt. in 2023 while the chinese spent $450B.\n\n4. Start creating institutions in which people can lay their trust.\n\n5. Corruption.\n\n6. Regulation of food and safety in industrial spaces.\n\n7. Dealing with industrial waste. The capital is fucked up. It smells like piss in NYC? huhh. It smells like burning plastic, piss, sewers, rotten food, sulfur, etc. in Delhi. That abomination of a city drinks up the entire Yamuna River and then pisses it all downstream without any treatment. Their are millions of hectares of farmland that uses that piss to grow crops",
            "Well, if they can praise themselves for something they didn't do, might as well criticize them for it.",
            "Interesting, so would you also say Bihar tends to be more traditionally religious than surrounding regions?\n\n\n And also, what is this called in Bhojpuri: http://kingsjewelleryworld.com/product/14k-yellow-gold-cricket-band/ a men's bangle. It's worn in Indo-Caribbean communities (overwhelmingly of Bhojpuri(?) Bihari descent) by guys but it's always been called a \"cricket band\". Im wondering what the proper term for it is? "
        ]
    },
    "Pizza I ordered vs Pizza I got": {
        "title": "Pizza I ordered vs Pizza I got",
        "score": 326,
        "url": "https://www.reddit.com/gallery/1dlryq1",
        "content": "oh look at those toppings 😋",
        "num_comments": 99,
        "comments": [
            "Ordered this only because I had a 50% off coupon. It was full of cheese and tomato puree with only a handful of toppings.",
            "Bas 1920 ka farak hai, I mean it is possessed",
            "Food Pharmer needs to do some videos on fast food and restaurants. Let this kind of false advertising also be addressed and brought to attention on a larger scale.",
            "sedlyf",
            "Govt. cut it's portion before it got delivered.",
            "“Images are only for representation purposes. The original product might vary in appearance”..\n\nRestaurants have taken this so seriously, the product delivered does not even match 10% to the image 🫤",
            "I hate big pizza chains like dominos and pizza hut, quality is so poorly maintained, I'd rather suggest going for newly found chains since they'd have pressure to grow",
            "Be sure to trash them in the feedback link provided and share this on twitter. Btw this is typical big chain cost cutting , try to find local pizza places . They are far better atleast in tier 1 ,tier 2 cities.",
            "i mean... it really looks like a nice pizza, i'd demolish that like some sort of animal, each peice in 2 bites job, you know? the real savage kind, where who ever is in the room with you is never quite able to fully look at you the same again",
            "My local dominos is the same. Stopped ordering long time ago.",
            "Username confirms",
            "Yep, that's why I only make pizza at home. Besides i dont know if I'm the only one but dominos and pizza hut 100% give me a bad stomach every single time. Haven't touched dominos since 2017",
            "Seeing the ***Rant*** flag, I came looking for snakes, cockroaches or Rats... but it is just a regular rant /s",
            "At least there are a few chunks of even. Ever understood the pain of people who order Pepperoni or Kheema Pizza? Chilli Flakes and Oregano sprinkles are way more prominent than meat in these Pizzas!!\n\nCustomer bhagwaan samaan hota hai, woh bas Paisa deta hai aur dukandaar apne grahak ko sabak sikhata hai. Bas got to remember this. Humein C*** banne ka shouk hai aur dukandaar ko c**** banane ka shouk hai, that's the only difference mate.",
            "This is probably a different pizza, you should report it.",
            "There you go. 50% off on everything. Be glad they didn't eat half of it.\n\nJokes aside. It's a scam. I paid 900 for a pizza to get something smaller than my dinner plate.",
            "Who moved my toppings!!",
            "Pizzas in India are mostly a scam with horrible cheese and base.",
            "I've found that Dominos in India do not shy away from skimping. Their pizzas are often substandard in flavour, toppings, cheese and dough quality. Even the cheese burst pizza doesn't come with the same quantity of cheese and flavour that it did before Covid. With that kind of quality at the core their prices don't justify any of their products. Think they have taken the customers for granted. Time to find more authentic and better value for money pizzas!",
            "Dominoz will never learn",
            "Dominos sucks",
            "Oh yeah ordered the same pizza, was complete trash. But man I have understood that dominos tastes like shit. God knows why people eat from there. I am most likely never ordering from there after spending my 300 rupees in the wallet haha.",
            "Can anyone suggest me best pizza outlets to order... don't wanna use dominos due to these type of cases",
            "Username checks out 🥹",
            "It’s because you’ve turned on the enhance and magnify feature 😀",
            "I don't know man it kinda looks the same 😕",
            "Bold of you to assume that you will get exact food items as shown in figure.",
            "Maaf karna bhai mujhe bhook lagi thi that's why I nagged some of those hope you don't mind Jai Hind",
            "Write a complaint on fssai and consumer forum",
            "Man I miss Indian pizzas.",
            "Mojo pizza?? \n\nBro 7 years back i bought the meat eater for 600 and ate the whole thing myself. Best pizza I've ever had.",
            "You bought this shit for 500?",
            "Ye bik gyi hai gormint!! Abh iss gormint mei kch na raha ye saare milke pagal banare ** ke baache",
            "Both look appetizing 💯",
            "Unpopular opinion, but the pizza is decent. The picture is that of a regular-sized pizza, the relative size of the toppings therefore are much bigger and cover a larger amount of pizza while what you have ordered is a large size. the relative size of the topping will obviously seem a lot smaller in comparison. Not saying the picture is 100% accurate but not at all misleading",
            "Same thing happened with me when I ordered from Pizza Hut",
            "They use AI to generate images nowadays. Zomato uses stock images.",
            "Bhagwan kassam isne toh kat diya !",
            "It is the pizza you deserve but not the one you need right now.",
            "https://preview.redd.it/rinrq24t948d1.jpeg?width=640&format=pjpg&auto=webp&s=a5041cdb49b663d7a02ff3da2eda59e0f30f05a1",
            "They missed *Note: Items in image not to scale*",
            "Wasn't delivered along with dead rat or severed human finger \n\n10/10",
            "Bro got catfished",
            "Bhai domino's is the worst. If you are from Mumbai try Square Pizza. It's the best",
            "I remember the days when I used to order the Large Chicken Dominator from Dominos, and it used to come fully filled with Chicken pieces with no compromises.",
            "1000rs pizza you are rich brother 😶",
            "that's 4 serves? how many slices can one usually eat before feeling full?  \nI mean, pizza is my favorite food and I usually eat for 3 days at a time so that pizza right there is 2/3 of a day for me 🤣",
            "Tds katta hai sir enjoy the rest",
            "Buy the base, once in a while make my own sauce also. Else I mix pizza pasta sauce with the Chinese momo chili sauce, since the pasta sauce is too sweet.",
            "50% toppings off.",
            "Atleast you got cheese.... None of the pizza places in my locality even bother putting cheese",
            "Sorry u/SADDEST-BOY-EVER",
            "Gotta appreciate your wicked sense of humour 🙂‍↔️🤲",
            "Haha wth",
            "The Wordplay is amazing",
            "Shadi karogi? Khana bhi mai bnaunga safai bhi karunga.",
            "True. OP should post it in twitter and we can make it viral.",
            "Advertising???\n\nHe’ll flat out ask you to not eat this junk!!",
            "Brick oven proudly burns its pizza. So newer chains are not really consistent. But I agree Dominoes and Pizza Hut are shit.\n\n\nWish Papa Jhons. was still arounf.",
            "I would love to, but that damn feedback link appears to have an impact on the staff, rather than the company taking it as a feedback to improve their services. Their delivery people have told me multiple times that giving feedback gives them promotion (literally what they said). They have even sent me messages lol. I’m just scared if they get dealt with harshly from their higher ups.\n\nhttps://preview.redd.it/ldn5h2tkw38d1.jpeg?width=1242&format=pjpg&auto=webp&s=fe1fe6192bab1f17dfda4ac9a49ec0ed9489181c\n\nEdit : Would just like to add that KFC and McDonalds have said similar stuff when I raised complaints due to order related issues. They told me that raising complaints on their app would impact them negatively and told me to just call them if I had any issues.",
            "Literally me",
            "Us moment",
            "Do you make your own base too or buy a base? Because making a base is the most time taking task",
            "It does look like a different pizza. No way it has 5 type of chicken toppings. Can see like 2",
            "huh?",
            "Dominos.",
            "Plus taxes ~50",
            "Must be at ur Domino's cause I order this last week and it was full of toppings I mean i could bearly see the cheese",
            "https://preview.redd.it/ba4ame8g848d1.jpeg?width=1080&format=pjpg&auto=webp&s=0a2ec261cd8a643bad82c970031f398b09a31546",
            "Yup.  Cheese is replaced with cheap mayonnaise",
            ">safari bhi karunga.\n\nBacche karunga sune the, ye market mein naya aaya hai kya? 😂",
            "I mean...aren't the staff members the ones who prepared your pizza?",
            "I have gone through all this years ago don't fall for their emotional bs . They are the ones doing the cost cutting at the outlet level , your negative feedback will just expose them to the top management.  \nI started getting loaded pizzas after my nearest outlet got several negative feedbacks . And then they used to call and beg for positive feedbacks or the outlet will close . \nRanting or actually complaining whatever works for you i guess .",
            "I think most people buy a base",
            "Yeah, been there and this can be surely reported",
            "Bah these guys are only good for the pizza mania",
            "I hope You know Domino’s , McDonald’s and some other popular fast food joints don’t use real cheese ( it’s a non dairy product from vegetable oil or something)",
            "Yes I've noticed the difference. The quality differs by location. Like in tier 3 cities you'll get the pizza with lesser toppings while in a metro city, the same pizza will be baked and topped better.",
            "They call it liquid cheese",
            "Pls don’t buy pizza mania and those 100 rupee meals from domino’s. Pat the premium and get normal pizzas which don’t have that horrible “cheese blend” which literally feels like Mayonnaise",
            "Safai bhai, typo ho gaya. Itna jyada cars me busy rehta hu ki safai likhne gaya to muscle memory ne safari kar diya.",
            "okay then, no mercy this time.",
            "Which one? Most bases to buy are terrible",
            "That sucks too. Barely any toppings and full of cheese, or maybe I’m cursed 🤷‍♂️",
            "And roadside ‘ paneer’ is not paneer at all",
            "Thanks for this. Didn't know!",
            "more specifically palm oil, the most inferior type of oil these fast food chains serve us!",
            "Normally it's milk solids with more than half vegetable oils",
            "In my area there are 4 dominos  2 McDonald's 2 kfc and 4 subways. Exactly 50% outlets  for each chain are worth any  good.\n\nThere is a lack of consistency among outlets of same food chain. The outlets that are very busy or very rarely busy are just pathetic to taste. An outlet that has a middle ground will always deliver quality n fresh food.",
            "Idk man, i made pizza at home like once in my lifetime 😭",
            "It does but for 100-110 rupees, the chicken pizzas are alright.",
            "It costs 200 now 😭",
            "Pizza mania?? Since when? Just had it 2 month back and it was 110"
        ]
    }
}