{
    "Anime Questions Thread": {
        "title": "Anime Questions Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/JuJutsuKaisen/comments/1dk72mr/anime_questions_thread/",
        "content": "# Anime Questions Thread\n\n**All manga spoiler questions should be redirected to the MANGA Questions Thread crossposted from** r/Jujutsushi **each week.** ***This thread is anime-only.*** **Manga spoilers will be removed.**\n\n## FAQs\n\n# What chapter should I start reading the manga at?\n\n>The anime leaves off at Chapter 63, or the start of Volume 8.\n\n# Where can I read JJK?\n\n>If buying physical copies isn't an option...  \n>  \n>Officially: [**Shueisha**](https://mangaplus.shueisha.co.jp/titles/100034) \\- Only the first three chapters and the most recent 3 chapters are available. New chapters are released every Sunday at around 10 PM MST (UTC-7). [**Viz Media**](https://www.viz.com/shonenjump/chapters/jujutsu-kaisen?locale=en) \\- Only the first three and most recent 3 chapters are available for free, but for $2 a month, you can read the entire series (and every series on their site), including Volume 0, Jujutsu Kaisen's Prequel. New chapters are also released on the same day and time as on the Shueisha site.  \n>  \n>Unofficially, Google \"read Jujutsu Kaisen free\" and make sure you have an adblocker installed.\n\n# What is the movie about?\n\n>It covers Volume 0, a one-shot prequel that Gege wrote before writing the main series of Jujtusu Kaisen. Yuta Okkotsu is the main character and it the story takes place 1 year prior to the main series.\n\n# Should I read Volume 0? And when?\n\n>You can read it whenever you like, but Chapter 63 is a good point to read it. It explains some of the events and motivations that happen in the JJK storyline.\n\n# Where can I watch the anime and movie?\n\n>Legally on Crunchyroll. We unfortunately have to keep links to aggregate sites off of the sub or risk it being flagged for takedown. Otherwise, try Googling \"where to watch anime free reddit\".\n\n# Which chapters correspond to which episode?\n\n>u/HououinKyoma23 created an amazing guide that covers every episode:chapter in the series! Check it out [here](https://www.reddit.com/r/JuJutsuKaisen/comments/mfb16f/a_complete_animetomanga_comparison_chart_for/)!",
        "num_comments": 2,
        "comments": [
            "anyone know what the current wiki background is from? look to be some kind of promotional art. Unsure if there's a high quality download"
        ]
    },
    "Jujutsu Kaisen Chapter 262 Links + Discussion": {
        "title": "Jujutsu Kaisen Chapter 262 Links + Discussion",
        "score": 132,
        "url": "/r/Jujutsushi/comments/1dbvpp3/jujutsu_kaisen_chapter_262_links_discussion/",
        "content": "",
        "num_comments": 170,
        "comments": [
            "am I missing something? why was it so short",
            "At this point we need to bring Goku",
            "I wish Japan would just let these artists get proper rest. Or if it’s the mangaka insisting on still drawing the chapter, I wish someone would talk some sense into them. We are happy to wait! Health comes first!",
            "Seeing Rita crying like that just breaks my heart.\n\n\nEspecially since she probably only has the mental capacity of a child as she never grew up.\n\n\nIf he dies and DOESN'T reunite with her in the afterlife this manga is DROPPED. ",
            "Man, I hate chapters like this because they indicate genuine human suffering on the other side. I wish there was no chapter at all and the team could actually rest and recover properly. Being influenced by Togashi is one thing, but let's not go too far, you know?",
            "What happened to all of Yuta's injuries and blood?",
            "At this point id rather just not have a chapter. Let the man rest, this shit finna confuse the entire fandom for weeks until Gege returns lol.",
            "This panel with Rika and Yuta body is so sad... :3",
            "Damn really spent a whole week cooking up a tearful moment 💀",
            "idc yuta my goat",
            "Did they not explain the plan to Rika or maybe she doesn't have enough intelligence to understand it? She should be there with Yuta/Gojo (Yujo? Gota?) fighting Sukuna.",
            "Pretty short. Not much to talk about so I'll just say that I'm mad as heck about Facebook showing me a page that I don't even follow posting leaks of this chapter. Good thing I closed and blocked the page immediately, although the page led me to believe Yuta would lose in this chapter.",
            "I definitely think people are counting out Yuta too soon. Yuta holds a special place in Gege's heart. In the grand scheme of the fight \\[so far\\], Yuta really hasn't done too much to have an effect on Sukuna (pains me to say this because Gojo's my 1 and Yuta's my 2). So, I'm with you in the fact that I think Gojo will do something to help guide Yuta on how to take full advantage of Gojo's ability, fleshing out what Gojo said last chapter about how if it'd be real lame if Yuta doesn't take advantage of his extremely blessed lineage. I can also see Yuta showcasing his abilities and winning the domain battle, finally hitting Sukuna with IV. However, Yuta's timer will run out before he can act on Sukuna being flooded with IV. The domain will break, revealing Yuta on the ground and Sukuna just standing there. Without time to think too hard about the situation, Yuji immediately siezes this opportunity and black flashes the FUCK out of Sukuna. From that moment forward, Sukuna won't be able to use his Domain again because of the effects IV had on his brain again",
            "Ok so this is 100% gonna be redrawn for the volume release bc this shit looks *rough.* I don't mean that in a mean way, the man is sick but man oh man is that fact obvious. Hopefully he gets better, 7 pages and it looks rough. The juxtaposition of the opening sukuna/gojo illustrations and the art of the actual chapter is jarring",
            "Poor Rika.  Crying because it was only 9 pages",
            "Gege should the rest for a month until he gets better i know he wants to finish this manga but damned",
            "So the way I read the last two pages, is it to show that Rika thinks Yuta is dead and there's no way for her to see what's happening inside the domain clash?",
            "I don’t know where would be best to ask, and k just caught up on the entire manga this week so I’m sure things slipped my mind. When Gojo died, was there any discussion about whether he could pull off any RCT in his diced up condition? \n\nBy now we know he was for sure gone ofc but im curious",
            "Is it possible that Gojo will comeback in his body or Yutas in 263? Because in 262 there is that black scene pic and then Yuta is seen in Rikas arm. Gojo died in 236. Maybe a hint?",
            "Oof 7 pages and a month break lol. Rip. So close to the end only to get cucked.",
            "I feel like this chapter, even though it was short will bring to conclusion the “go north/go south” question. What are the chances that Yutas body is now hosting Gojo’s soul? He would be “reborn” as Yuta—going north. The key takeaway from 261 is that his wounds are beyond HIS RCT capabilities, gojo couldn’t heal because he had exhausted his own with the brain bleed. Yuta has expansive CE, maybe this is the course it’ll go? (Or this is just heavy copium)",
            "I hate when mangas have long ass, drawn out endings that undermine everything that made sense up until the end of the story. \n\n\nBut I feel like buddy jumped the shark several chapters ago and he's just ass pulling things.",
            "gege sick or not, post-Shibuya this series has moved from stepping over the shark, to jumping it, and we are now in the pole vaulting phase",
            "Still waiting when Sukina will do the world slash cut to mfs from Shueisha who axed Green green greens. This was such an inspiring manga and end was so beautiful. Now I understand why those dudes from Sakamoto days wanted attack Shueisha with bus",
            "Bro can just break limitless now",
            "im still a strong believer that kenjaku is gonna come back",
            "I have no clue what happened at the end there",
            "[https://postimg.cc/gXG1NrCt](https://postimg.cc/gXG1NrCt) My theory on what is possible to happen next, re-comment because link expired the last time and there is new one xd",
            "Let's see if what others say about this sub is true. I love JJK!",
            "Honestly, Yuta showing up is a mistake. Like Yuji was nearly about to end the entire thing. Like his hand was inside Sukuna's chest about to crush his heart, then comes Mr. Steal Yo Technique to cause a distraction.",
            "Please get better GEGE!! Take care of yourself!! Yuta caught off guard right out the gate, he better rebound fast",
            "Short ahh chapter 😂",
            "If you are reading on MangaPlus PC version then make sure you change the reading mode from the default vertical to horizontal or these double-page spreads won't work in any manga:\n\nhttps://files.catbox.moe/e188ax.JPG\n\nhttps://files.catbox.moe/gceo0z.JPG\n\nChange it by clicking any page and then the 3 dots that appear in the upper right corner. If the page order bugs out then just refresh your browser page.",
            "Did sukuna invade Gojos body. Next chapter sukuna is gonna have six eyes. #Freemegumi",
            "Whats happening to Yuta on the last page?",
            "3/5 excited for 263 already and i look forward to seeing rikas manifestation. the only part is **GEGE WAS SICK**",
            "1.55",
            "actually 3.5 i'm sorry for gege sickness but it really felt it was missing some panels",
            "So\nRika curses yuta's death just like yuta cursed her death and that makes yuta even stronger or something?\nAlso will gege explain why sukuna open his domain after making a binding vow to open his domain one last time?\nIt's going so downhill man",
            "why we couldn't get to see NOBARA in afterlife of GOJO? like geto, nanami and Principal were there but she was not...",
            "At this point we need gigglypuff so that she can get mad and start singing and Sukuna sleeps 🥲",
            "Why did it cut to Rika, and how is Rika even manifested if Yuta's \"dead\" and using Gojo's body/powers instead?\n\nWhat is the intent of writing \"Rika fully manifested, however...\" ?? Huh ?",
            "I can't really build much off of the new chapter based on how short it was, but the last page where Rika held Yuta's body was a nice detail. 3/5.",
            "Gegedging",
            "just 6 pages?????",
            "in my honest opinion i rate it -1 out of 5",
            "Honestly, this stretches for too long. At this point I would take unexpected crossover with Touhou, and have Reimu, Mokou or someone go kick Sukuna's ass and finally end it.",
            "No way we waited 2 weeks for a chapter that short",
            "9 page chapter and the art still somehow looks worse than ever these days",
            "So,  did sukuna yeat yuta back? Did gojo reactivate?",
            "Gege got sick.",
            "He's one last big troll before the manga ends.",
            "Gege edging us",
            "MF’er would throw Sukuna a senzu bean.",
            "at this point, Goku will hear about Sukuna being the strongest of all and will TP for a sparring match",
            "Nah get Future Trunks, he would waste no time killing Sukuna.",
            "But that would cause stonks to go down briefly.\n\nThat brief drop would make the shareholders cry and wipe their tears with millions of dollars on their yachts at their private islands.\n\nEven the solace of greater future gains can't wipe away the sting of those temporary lesser gain.",
            "Yeah honestly if Gege would have to switch temporarily to a 10 max page format to take better care of himself, I’d still enjoy the hell out of the manga, the fact that still there’s so much to enjoy in so few pages is amazing , even with the art quality that’s not at Gege’s quality",
            "They do... Also it's purely a weekly magazine thing. Weekly rhythm is really too much for most mangakas.",
            "I think it's not just a \"I'm sick\" leave.  It's the constant pressure of deadlines and constantly meeting them. Ever since the gojo v sukuna fight which was more than an year ago. I don't care about the how strong sukuna is. Gege is one strong mf to keep going this long. 💀",
            "Well if that happened, you'd drop it before the last chapter or so lmao",
            "wait I thought the kid rika spirt moved on at end of zero and this rika was the cursed spirit queen of curses ",
            "Don't worry, she'll take over Yuta's body and use him as a vessel. This is also how Yuta will survive past the 5 min mark. Similar to how Yuji died, but Sukuna was able to bring him back.",
            "The fact that we’ve made it here past the Gojo troll (from “he’s gonna win” to end one chapter to the next starting with his cleaved body on the ground or in the afterlife) tells me we’re pretty resilient.\n\nI will say that reading since JJK 0 (“Tokyo Metropolitan Curse Technical” when it was first released in 2017), I have a special attachment to Rika and Yuta’s relationship and I think a lot of other fans do too.\n\nAs with zombie Gojo, even if he doesn’t start Yuta’s death chapter (assuming he dies) with them being reunited in the afterlife, by the time the battle or manga is done (could be one in the same) I have faith that he’ll reconnect them or pressure will dictate that he does in an epilogue so it all comes full circle with the prologue.",
            "He also has shoes on now. Gege probably forgot cuz he is sick or they just cleaned Yuta up",
            "I presume Shoko & co. cleaned him up so that if they win, they can switch him back quick in a fairly fine body.",
            "I assumed that panel was just metaphorical. It isn't actually happening",
            "Bro’s getting ready for his own airport terminal scene 😔",
            "Did you read the chapter? The art is not up to the usual quality at all, much closer to a storyboard or early draft than a finished product. Clearly something went wrong irl.",
            "exactly my thoughts, love the man but why bother releasing this",
            "fuck yuta mediocre character at best",
            "I guess she probably just can't comprehend the man she loves is not in the body she recognizes him, so she must believe him to be dead",
            "Could be part of the strategy. Pull a SSJ2 Gohan, piss her off enough that she goes full strength against Sukuna, considering she does still have the mind of a child. Give her a reason to want to fight and kill Sukuna beyond Yuta telling her she should do it.",
            "Yeah I kept hearing Yuta was gonna lose with these pages. Leaks are horrible",
            "That happens to me far too often and I hate it",
            "The art literally looks the same as the other chapters, what are you talking about it looks rough??",
            "Pure copium.",
            "This is copium but an idea I honestly like because of how absolutely fucked it is",
            "i mean like bro is the final boss and he got jumped by yuta.",
            "If you mean the Rika bit. I believe she is wrapped around Yuta's corpse that he left behind when he transferred to Gojo's body.",
            "Hopefully the author can get a break",
            "Nah man, I didn't see anything like that happen lol",
            "Yeah but if they let another company take his ideas and give us a full chapter we get the dragon Ball super situation that made Goku go from someone who was a battle genius to an absolute moron.",
            "Here is sick, grow up.",
            "Neither, the ending was Rita wrapped around Yuta's remains, which would have been left behind when he transferred into Gojo.\n\nWill be interesting to see what she does now, either go full nuclear on Sukuna as a released CS or take over Yuta's body, maybe?",
            "Aw feel better soon Gege",
            "Nah he’s not feeling well",
            "\"Hey Sukuna\"\n\n\"What?\"\n\n\"Senzu Bean!\"",
            "Lol. I like how after the Moro arc, we've come to accept that Goku is more likely to help his enemies than his own allies just because he can't control his fight boner.",
            "Gotta bring Gohan for this one",
            "LOL!",
            "Man, if only japan have any kind of shit that resemblance the us union stuff, but their \"just work harder\" motto is simply too much lol.",
            "I hate that all that sarcasm are actually true",
            "People complain that boruto is monthly and that the kisbimoto isnt giving enough quality for that... They dont realize that artist pumping insane art every week is bad for them",
            "Still ain't dead bro. That's Yuta in there. Remember?",
            "You see her multiple times after the events of zero. You see her on the final page of the last comic cradling his body.\n\nI know something happened at the end of zero regarding her, but functionally she is still here. The cursed spirit still loves him.",
            "We dont know yet if he can survive forever in the body. It was just a speculation from tge characters, wondering how the techniqhe worked.\n\nBut knowing gege, yeah, he'll probably die",
            "Can't clean up that fast.  Also why would you bother?  You're in the middle of a fight, you can dress a corpse for burial after the fight is won.  Also why bother sealing Yuta's head back on if Yuta's brain is going back later?  What brain is currently in there?  The skull should slide off given the context if it's not resealed back on.",
            "If they could heal the body that quickly, why switch Yuta's brain over in the first place, is the question then.",
            "Not out of the question you're right, but it'd be very odd.  We've seen Rika a bunch of times, it's a little weird to showcase that in that fashion.",
            "What do you mean not up to the usual quality??  Did you not read the official releases?  The images are basically pristine it's fairly easy to tell there's no blood on Yuta's clothes or pooling on the ground.",
            "And lames support it by saying “leaks are expected in the manga community”",
            "No, it doesn't. This is clearly rushed and needed more time and you're flat out wrong if you disagree. Anyone with eyes can tell some of the panels in this chapter are rough.  There's a reason it's only 7 pages, he's sick and didn't have the time and energy needed to devote to it. People act like sub par art being pointed out is insulting to the artist. It's not, it's an observation",
            "True",
            "It’s the placement of that panel right after Sukuna punches him, does it mean he killed him there?",
            "L author jjk has no plot LMAOO shounen tards",
            "Oh okay",
            "getgoodgege",
            "Oof. What terrible luck for him. Right when the manga is at such a pivotal part.",
            "“He’s got that Post Gojo Exhaustion!”",
            "“Nuh uh! How could *I* ever threaten the whole universe?!”\n\n*Watch Dragon Ball Super banner rises up*",
            "Nah been since Cell",
            "[removed]",
            "nah man Gohan is also infected with Saiyan pride, he also starts getting arrogant and toys with his enemies whenever he overpowers them, which leads to some horrible outcome",
            "The US has utter garbage worker's rights. Japan has much *much* better workers protections and much stronger unions. There's definitely an issue with working culture but this comment is super wrong.",
            "I didn't say he died. Just your if he dies and doesn't reunite scenario.",
            "No I get like rika as a cursed spirit is still w yuta throughout jjk past zero \n\nBut I thought the human spirit that got trapped bc of yuta was freed at the end of zero \n\nIf that makes sense lol and the cursed spirit still loves yuta and is w him post zero ",
            "This is a clone functioning on autopilot. Kind of like an empty husk, moving on instinct",
            "Gojo Satoru brain is in there",
            "Not gonna lie, I was just thinking the same questions just now. I had to reread that chapter to make sure I wasn't seeing shit lol. Why dress up a corpse when you can do it later and especially  when you are fighting one of the most powerful sorcerer in history? It just dosen't make sense unless:\n\n1. They are keeping it clean and safe for Yuta to return whenever he wins or loses in Gojo's body. Maybe a brain stand in keeping it safe?\n\n\n\n\n\n2. Someone else is going to take over Yuta's body to fight Sukuna while Yuta fights in Gojo's body.\n\nEither way, it will get interesting.",
            "Also, come to think of it, it might be another brain in there  for Yuta to heal quicker. Remember, Gojo was cut clean in half by Sukuna and when Yuta took over his body, It seemed fully healed without help. Maybe Kenjaku's CT also heals his future victims from past injuries so it can make the body to its full capacity?",
            "1 Because Gojo's body is better. \n\n2 How long has it been between Yuta going through the procedure and him arriving?",
            "A brain dies very quickly without oxygen. Could have been necessary to avoid him becoming a vegetable.",
            "The funny thing is JJK is the one series I follow that I don't interact with on most social media. I follow OP and read leaks but I never see spoilers for it on Twitter or Facebook. JJK will almost always have a spoiler image on my timeline anyway.",
            "[removed]",
            "[deleted]",
            "What manga do you read?",
            "The manga chapters has ended at pivotal parts for months now",
            "Maybe we’ll get lucky and a good author will take over and not make the fights so confusing",
            "Even if you argue that Vell was a calculated move and he knew Gohan would handle it, Goku definitely risked everything on the chance that Goten and Trunks could defeat Buu.",
            "Your post was removed for breaking Rule #1, be kind and civil towards other users.",
            "Trunks then?",
            "I'd bring Android 17 in that case. He wouldn't waste time with any BS.",
            "Tbh?, Im actually happy that im wrong lol, good for them.",
            "Yeah that kind of mechanistic view on a being is the kind of dangerous idea that makes people dismiss the genuine pain of creatures and beings of all walks of life. It is dangerous perspective to have.",
            "I think it'd make sense for it to be preserving the body and such, or it was a mistake that still works- who knows- Might also have been Rika trying to clean her beloved in a twisted and confused way (There is a drain under them, so they might actually be in a shower)\n\nIt is most likely a mistake overall but still could work.",
            "Nah they said in the chapter before to Yuta to use max RCT as soon as the transfer was done to finish the healing touches on Gojo's corpse.",
            "Then whose brain is currently in Yuta's body?",
            "Honestly this raises all sorts of points.  Gojo's brain would be moved to keep Yuta's original body alive, which means Gojo's brain had to have been alive enough to take over and heal Yuta's body enough for it to be returnable when Yuta is done.",
            "That’s what kills me the most. I don’t follow any manga/anime pages on IG but I guess because I looked at some memes a few times the algorithm pushes leaks to “suggested for you” type posts. Honestly helps me stay off the app which is nice lol",
            "Your post was removed for breaking Rule #1, be kind and civil towards other users.",
            "Gojo revives in Yutas body and returns. Once the battle is over they use ui ui to soul swap them back is one I've been seeing posted a bit. Especially since it mentioned they soul swapped for training. Though I'm not sure where this is going with how it's been going",
            "Dude, we're clearly in the final stretch of the greatest battle the world has seen in a thousand years.",
            "That's a pretty fucked up thing to say about a guy who's really sick.",
            "You shouldn't be taking, all you draw is loli porn",
            "Which one?",
            "Just unleash Broly on them at this point.",
            "It's literally a copy made by the guy who's technique is copying",
            "bro its a manga (NOT REAL), go outside 😭😭",
            "That or to set up Gojo's revival. Remember, Geto did attempt to gain control even though kenjaku stole it, so maybe it is the case there?",
            "And RCT can be used as healing right? And for the last part, I didn't get that part. So what they meant was to use RCT on Gojo's body? I was a little confused on that part haha.",
            "It was how he said that I was confused haha. But now that you explained it, it makes sense! Thank you.",
            "Miwa. She finally found a use!",
            "It might legit be empty.",
            "[removed]",
            "The one that gets shit done. ",
            "But copying is Rita's technique. She eats a technique and that allows him to use it.",
            ">Gojo's body is stitched togheter\n\n>Yuta activates CT\n\n>???\n\n>Yuta is now in Gojo's body\n\n>Immediantly goes 100% in on RCT to finish healing any damage (Such as dead tissue, stitched areas, etc)",
            "Does this in fact eliminate the conditions of her thing she did earlier?",
            "Why bother reattaching the skull cap in any meaningful way or cleaning up the body and healing it in that case if it's now no longer brain-filled?",
            "Your post was removed for breaking Rule #1, be kind and civil towards other users.",
            "Oh okay Future Trunks",
            "LOL.",
            "No, it's Yuta's who channel it through Rika, like Yuki with Garuda, since he uses an external storage for his technique he can hold many more than Kenjaku's four. \"Rika\" has been left behind from Rika Orimoto to Yuta, so she probably carries her will.",
            "The other guy explained it haha. But if that could happen, why couldn't gojo hold on so he can use RCT and get back into the fight?",
            "Bacteria",
            "Talking about gt trunks",
            "He was split in half and by his own belief CE is stored in the gut which he now was separated from and unlike Yuta he did not have an insanely powerful shikigami to assist him",
            "Tbf the entire bodies are filled with bacteria 24/7, and also coated in it, regardless of Dead or Alive."
        ]
    },
    "Nobara🩷✨💚": {
        "title": "Nobara🩷✨💚",
        "score": 238,
        "url": "https://www.reddit.com/gallery/1dlr8au",
        "content": "",
        "num_comments": 26,
        "comments": [
            "**If this post does not have a spoiler tag, SPOILER TAG MANGA COMMENTS**, or you risk a tempban. Keep it secret for the anime watchers.  Please remember that vague spoilers count as spoilers such as \"do we tell them\".\nIf you're caught up on the manga, consider joining our sister sub r/Jujutsushi for catered, in-depth manga discussion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JuJutsuKaisen) if you have any questions or concerns.*",
            "Our girl look so prety",
            "Gege, when I find you.....",
            "So cute!",
            "Omg she looks soo pretty especially her eyes",
            "This truly made me realise how similiar Shoko and Nobara are",
            "Great painting",
            "Damn this is crazy good art,you should sign it so there won’t be people stealing from you or accusing you for stealing",
            "Amazing, loved how you also drew her picture with holding the 10 mark sign.",
            "Live, Laugh, Love Nobara 💯💯💯\n\nYou just haaaad to kill her, Gege",
            "Beautiful!",
            "Oh, this is so beautiful! Love the colors! Did you paint it on a canvas?",
            "She is so pretty fr😭😭 thank you!!",
            "Take me with u too",
            "Thank you!!",
            "Thank you!!",
            "Ooh for sure",
            "Thank you!!",
            "Oh okay, I'll do it from now for sure. Thank you!!",
            "Thank you!! I really liked that, it's super cute",
            "She coming back tho fr trust me\n(I'm perpetually Delusional what even is canon)",
            "Thank you 😭💚",
            "Thank you!! Yes, I did acrylics on canvas🩷",
            "The more the merrier, it'll be like assassination classroom, except no crying.",
            "You’re welcome !!"
        ]
    },
    "Very fitting that he meets his end being betrayed by his \"friend\" at his most venerable moment": {
        "title": "Very fitting that he meets his end being betrayed by his \"friend\" at his most venerable moment",
        "score": 1309,
        "url": "https://www.reddit.com/gallery/1dlg485",
        "content": "",
        "num_comments": 70,
        "comments": [
            "**If this post does not have a spoiler tag, SPOILER TAG MANGA COMMENTS**, or you risk a tempban. Keep it secret for the anime watchers.  Please remember that vague spoilers count as spoilers such as \"do we tell them\".\nIf you're caught up on the manga, consider joining our sister sub r/Jujutsushi for catered, in-depth manga discussion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JuJutsuKaisen) if you have any questions or concerns.*",
            "I miss Junpei so bad…",
            "can’t believe mojito did that",
            "You know you don't have to put spoilers on anime post. That's only for the manga.",
            "I don’t think he ever considered kenjaku as anything more than an ally, he looked more desperate than betrayed. If anything he already had some suspicions about him.\n\nI’m still glad he got what he deserved, don’t get me wrong.",
            "Venerable or Vulnerable",
            "Technically, he betrayed Kenjaku first",
            "I mean Mahito didn't exacrly trust Kenjaku in the first place and knew Kenjaku was planning on betraying the disaster curses.",
            "Kenjaku casually absorbing Mahito was so satisfying",
            "What \" disaster\" curse is he ? I thought he was something along the lines of deceit or betrayal. I think it is ironic in that sense .",
            "not so instant karma",
            "nothing more human than betray and be betrayed by others sdadasdsd",
            "I'm gonna miss Mahito I hate him so much and love him at the same time \n\nHe 100% got what he deserved and his screaming was like music but there's going to be a Mahito shape void in my life 😔",
            "Poor yuta",
            "Overall, Mahito never trusted Fake Geto at all :3",
            "spelling ms'stake",
            "scammer get scammed",
            "Yep",
            "Humanities hatred for itself really is born out the the betrayal of friends",
            "Kenjaku swallowed Mahito and went on to never use him again 😭",
            "I can literally count how many pixels the second pic has, did you even try🤣",
            "His dad will never know what happened to his son and ex-wife",
            "Same. his story breaks my heart",
            "As someone who was bullied really badly, Junpei's story broke me.  I wanted to see him happy with Yuji and the gang.",
            "Wdym he came back in gojos body",
            "Nah junpei is mid",
            "Me?",
            "Thanks for telling me lol.",
            "Mahito didn’t even do anything wrong he was just doing what he was born to do 😭",
            "> If anything he already had some suspicions about him.\n\nIt's not that he had some suspicious, he straight up knew. That's why he attacked him and said \"i always knew that, after all i was born of you humans\"",
            "Vulnerable. Thanks for the catching that.",
            "Technically technically Kenjaku planned to betray him first",
            "Technically technically mahito betrayed him because he sensed he was gonna get absorbed ",
            "Did he tho? He looked like he had alot of trust in Kenjaku specially in the football match and when Mahito just got out of a fight with Nanami and was alone in the sewer.",
            "Eviler than Thou at its finest",
            "He's the curse of humanity's darkness and evil. That's why he looks like a human whilst most curses don't (Jogo, Hanami, Dagon)\n\nMahito is literally a reflection of the horrible things humankind has done over the centuries. It's also why the \"I'm You\" speech is so deep, because not only is Yuji accepting what Mahito says earlier, but he's also accepting that Mahito is part of humanity's shadow, so to speak.",
            "Idk but I thought the Disaster Curses were named because of the similarity in their innate technique names (Disaster Flames, Disaster Plants, Disaster Tide) and Mahito’s Idle Transfiguration doesn’t fit that scheme. So I never really considered him a Disaster Curse.",
            "Yuta?",
            "He literally burned him out to start the culling games XD",
            "Mahito died after being used in the Uzumaki",
            "Yap yap. You can see it just fine ",
            "STOP IM CRYING😭",
            "I was definitely not bullied as much as you, but I just imagine someone talking and steering me using my angst as Majoto did to poor Junpei.\n\nChanging gears a little, I am so happy Junpei and his mom met Yuji before they passed. They had such an amazing time with him, I just wish it wasn't the first and last one!",
            "Perchance",
            "[deleted]",
            "r/Beetlejuicing",
            "He was nothing more than a silly guy",
            "Downvoted for telling the truth. 😔✊🏻",
            "Np fellow user",
            "He literally said \"I regret not getting Jogo too\". Dude was always going to betray them.",
            "Wait, when? I don’t remember",
            "Well that’s pretty early on. The scenes where they interact during the shibuya incident make it pretty clear that Mahito wasn’t unaware of Kenjaku’s planned betrayal. I mean mahito’s last words were even \"I knew\".",
            "Yep, he’s literally made of evil. As he tells Hanami, killing for cursed is the same as eating is for humans. It’s literally just part of their nature. Just like Yuji will kill curses with no remorse and save humans, Mahito will kill humans with no remorse and save curses",
            "~~I am thou, thou art I...~~\n\nWait wrong shadow\n\n~~You're not me!~~\n\nSorry again wrong shadow",
            "Yuone-a",
            "Mayhaps",
            "[deleted]",
            "And it was his birthday!",
            "Somebody has to take the fall for what is right",
            "I think the disaster curses knew that too I mean his CT is literally sucking them up (pause)",
            "Mahito said it before getting absorbed.  \nAlso he quote on quote wanted Jogo but Sukuna merked him before he could get to him",
            "> Mahito will kill humans with no remorse and save curses \n\nYeah that's just the bullshit prattling of a talking cure. Mahito is not actually interested in saving curses other than himself.",
            "Bro definitely misunderstood the question 💀",
            "Did they ever see him using CSM? I don’t recall a time where he really showed his CT.",
            "Sorry, replied to the wrong comment, I was wondering when Mahito mentioned that he plans to betray Kenjaku.",
            "Yet he literally saved Hanami from Haruta. Up until his death, Mahito was perfectly okay if he died so curses can live",
            "I thought it could be an “any of those” …? Sorry tho",
            "they probably saw him using curses as slaves or tools",
            "[shrug] Don't remember that.",
            "https://www.reddit.com/r/JuJutsuKaisen/comments/1cd08qi/mahitos_only_redeeming_scene_in_the_entire_show/",
            "LOL he wasn't risking his life there. It's only Haruta.",
            "It still disproved your point he doesn’t save other curses. The dude straight up charge at Gojo in the subway after he killed Hanami."
        ]
    },
    "Made this after I saw their first fight💀": {
        "title": "Made this after I saw their first fight💀",
        "score": 288,
        "url": "https://i.redd.it/lk5slv98s18d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "**If this post does not have a spoiler tag, SPOILER TAG MANGA COMMENTS**, or you risk a tempban. Keep it secret for the anime watchers.  Please remember that vague spoilers count as spoilers such as \"do we tell them\".\nIf you're caught up on the manga, consider joining our sister sub r/Jujutsushi for catered, in-depth manga discussion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JuJutsuKaisen) if you have any questions or concerns.*",
            "Do you think Mahito can shape shift extra limbs and mouths for extra freakiness",
            "I need karma🗣",
            "he can and he does",
            "Freakiest jjk character in history (kenjaku) vs Freakiest jjk character today (Mahito) ",
            "I think he can grow multiple dicks too. If r34 artists had brains, we would be cooked",
            "that demon guys sword from demon slayer but it's mahito's dick"
        ]
    }
}