{
    "Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?": {
        "title": "Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?",
        "score": 372,
        "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/",
        "content": "Reposting the answer given to a user who was asking in good faith if accelerationism is the reason we have the rule about not using lesser evil arguments to encourage people to vote for a Democrat or a Republican political candidate. We were asked if the reason we ban pro-Democrat or pro-Republican lobbying is out of a belief that things needs to get worse before they can get better. We endeavored to address those concerns and the user asking was satisfied with the answer, so it's being posted and stickied on its own here, with the goal that as we progress through the election show we can refer people back to this. \n\n1. It's not accelerationist. Not a single one of the 852000 people subscribed to the subreddit have the ability to accelerate capitalism and the American empire towards a crisis point *\\*faster\\** than Joe Biden is right now by risking re-election in the myopic support for an unpopular genocide. Look at Biden's professed bipartisanship on border security, are those the actions of a person concerned about losing to a fascist dictator?\n\n2. We aren't of the opinion that \"both options are equally evil\" or that one is a lesser or a greater evil. Both options are capitalists. They are the same option. Biden and Trump represent the capitalist class. Their victory is the victory of the capitalist class. Picture a guy with a puppet on each hand. The left hand is named Biden. The right hand is named Trump. The owner of these puppets is [putting on a Punch and Judy show](https://en.wikipedia.org/wiki/Punch_and_Judy). People are **very mad** at us for recognizing that it's a Punch and Judy show.\n\n3. People should definitely vote. If the PSL is on your ballot for the presidential election please vote for the PSL so that socialists as a whole can gauge the numbers of revolutionary socialists out there. This will be *especially* important as the inability of Capital to resolve its contradictions leads to increasing and deepening crises that we can already see are not alleviated when a Democrat is in office. If you've got any direct election ballot issues like abortion rights or marijuana legalization or even a tax levy for your school district or something, vote for those. Past that, vote your conscience. Look up every candidate, and weigh their positions against your own, and if you can't stand to vote for them, for a candidate for Judge or City Council or whatever, leave it blank.\n\n4. Protest, donate to bail funds, disrupt city council meetings, speak up at school board meetings, join strike actions to shut down ports shipping weapons to a genocide, volunteer with Food Not Bombs, donate to Doctors Without Borders, on and on, the possibilities for **meaningful** political participation are endless, our options are limitless. We are not helpless, we are not hopeless, we are not trapped, but the Capitalists certainly want us to think we are. \n\n5. Before you ask about Project 2025, and everybody always does, realize that it's just the fancy name they've given this time to the process of all the political appointees in the executive branch getting changed out for different political appointees. The right wing is pitching it this time as \"Project 2025\", last time it was \"Drain the Swamp\". The capitalist party are capitalists. This is a **product** that they are selling. Literally, as they sell hard copies of it for $35 to credulous marks on their website. It's a great trick, its intended to convince conversatives that the impossible things they desire are possible and there's a plan in place for them to be enacted, they just have to wait and Trust The Plan. It is also intended to convince liberal voters that there's an even greater threat than the genocide the Biden administration is an eager accomplice in, so they need to donate and stay engaged. I'm surprised there's not a liberal Project 2025 project yet, liberal voters are panicking because there clearly isn't a countering plan. \n\nIn closing, rule 6 isn't accelerationist, Biden's presidency has been accelerationist. Fuck, look how much closer he got us to WW3 than even Trump could manage in his fascist incompetence. And our view isn't that things need to get worse before they get better, but that support for Democrats demonstrably leads to things getting worse, and we have to stop supporting Capitalists if we want victories for the working class and a way out of the worsening conditions. From our perspective desperately clinging to bourgeois \"democracy\", particularly at a time when we can all recognize that we aren't allowed any real choices in voting and that's been the case for decades at this point, makes things worse and slows or entirely stops our ability to bring about positive change.",
        "num_comments": 2,
        "comments": [
            "This post is locked to prevent brigading by liberals and conservatives.\n\nLiberals like to concern troll and present themselves as open eyed political realists who are just trying to help us make the right decision. They do not like being questioned. Here's some of the replies we get after banning liberals for breaking rule 6:\n\n>Go fuck yourselves and fuck your boy Trump too. Get back to bagging my groceries you fucking broke ass losers. I'm looking forward to seeing you all suffer for your decisions\n\nand\n\n>If Trump wins you'll know it's my alternate account when your posts about how life got worse for your and for Palestinians I'll just be posting: Hahahahahahahaha hahahahahahahaha hahaha reap what you sow you dumb fucks. Keep an eye out for me\n\nand\n\n>Good luck with the political strategy of doing nothing and complaining that you don't get your way 🙏 see you in the GOP's death camps\n\nand\n\n>Clownish fucking ML morons. I genuinely hope you get sent to camps or something. I'm a better leftist.\n\nand\n\n> So long, I hope your accelerationism gets you exactly what you deserve. Morons.\n\nThese are all just in the last week or so. They don't have our best interests in heart. They aren't good faith allies. The moment they get a little bit of pushback they become frothing fascists themselves. They want us to obey them and if we don't they'll laugh about us being put in camps. We have to have a plan for our safety in the future and the safety of our communities that doesn't rely on trusting false people for our protection.\n\nFor your entertainment, I leave you with [a clip of Patrick Stewart, playing Lenin in \"Fall of Eagles\", saying \"Don't trust the liberals\"](https://www.youtube.com/watch?v=ToRiwWHzRnM)."
        ]
    },
    "Happy pride month! Remember: The fight against capitalism and the fight for LGBT+ liberation are inseparable.": {
        "title": "Happy pride month! Remember: The fight against capitalism and the fight for LGBT+ liberation are inseparable.",
        "score": 115,
        "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1d8nyfa/happy_pride_month_remember_the_fight_against/",
        "content": "A wonderful pride month to all LGBT+ comrades! Remember: Being gay is not enough, we must also do crime.\n\nThe capitalist system, based on the private ownership of the means of production and the exploitation of wage labor in order to accumulate new means of production in the form of capital, continues to fail to realize its false promise of liberty, equality and justice for all.\n\nWhile capital historically has had a tendency to destroy traditional hierarchies and identities, this was only in the service of integrating as many humans as possible into the work force. The larger the supply of the labor-power commodity, the cheaper it can be bought.\n\nAccordingly, this \"emancipation\" from the bigotry of tradition stalls as soon as we are all reduced to a proletarian existence, and equality no longer serves capital. In fact, keeping the working class internally divided by means of racism, sexism, homophobia, transphobia or ableism undermines our ability to exercise solidarity and unite in our struggle against capital.\n\nOf course this is only half the story. While capitalism destroyed the traditions of past modes of production, it was at the same time an active producer of new ways of dividing humans in order to oppress and exploit them. The development of capitalism went hand-in-hand with the pursuit of colonial conquest and the transatlantic slave trade, providing industries in Europe with raw materials. Capitalism turned racism into a global, structural phenomenon, and subjected countless cultures to white colonial domination when not outright annihilating them. This also involved imposing repressive European views of gender and sexuality and erasing native perspectives that were less obsessed with compliance with such binaries.\n\nControlling gender and sexuality has always had special importance in class society because it allows for the control of reproduction through the institution of the family. Class membership is inherited within the family, so norms making reproduction controllable by assigning strict gender roles based on reproductive organs are an important component in the perpetuation of class distinctions. Furthermore, the reproduction of the working class is of direct economic importance to capitalism, as the supply of labor power depends on it. The existence of queer people calls all such norms into question.\n\nTherefore, the struggle for LGBT+ emancipation and the proletarian struggle against class society are intrinsically linked. It is both necessary to fight for LGBT+ emancipation in order to fight capital, and to fight capital in order to achieve LGBT+ emancipation.\n\nNone of us can be free until we are all free. The proletariat is queer, and queerphobia is anti-proletarian. It is our absolute responsibility to fight with and protect our queer comrades from reactionary assaults on their freedom to be themselves. The recent right-wing campaign of annihilation against our gay and trans siblings in the United States must be resisted at all costs.\n\nThe time to unite is now.",
        "num_comments": 10,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "Liberal: \"But... but, what will we do without corporations like Lockheed Martin having rainbow colors on twitter?\"",
            "The Democrats will allow LGBTQ rights to be stripped away to avoid addressing class issues.",
            "Wtf why would you incite people to commit crime?",
            "[removed]",
            "They won't protect LGBT+ rights but will happily hold them hostage because otherwise Trump and republican zealots will absolutely take them away. Same with abortion and reproductive rights.",
            "In Minecraft, duh.\n\nBeing gay IS a crime in several countries, including some parts of the United States."
        ]
    },
    "Meanwhile I'm paying my landlord's mortgage": {
        "title": "Meanwhile I'm paying my landlord's mortgage",
        "score": 1316,
        "url": "https://i.redd.it/xqzhggekl28d1.jpeg",
        "content": "",
        "num_comments": 151,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "Not only your landlord's mortgage, but you are paying for free healthcare and college tuition for every Israeli citizen.",
            "Almost every industrial nation offers it's citizens universal healthcare. Idiots in this country with their propaganda machine claim we're going to kill Granny, socialism is bad and we can't afford it. Yet, when it comes to funding to kill people via our own wars or wars of others. We always have enough money to go around. When are we going to put a stop to this bs?",
            "Good post for finding bots too.",
            "Lol this post getting brigaded by \"China is about to collapse\" narrative.\n\nI BEEN HEARING THAT SHIT MY WHOLE LIFE.",
            "It is interesting to note that a nation with a communist ideology has surpassed capitalist countries in the realm of capitalism.",
            "Yes but always remember kids: China bad!",
            "Property ownership is so weird and complex in China, even for natives. Have a check about it.",
            "Appartment is seen as a must before marriage, so it's paid buy the family. Ratio between income and housing prices are terrible in China, a lot worse than in Germany :(\n\nWithout apartment it's called naked marriage, and was a taboo just a decade ago",
            "Can someone recommend books about current china without the western propaganda?",
            "We were told when we visited China that even if you build a new house, after 60 years it reverts back to government ownership.  Not sure how this factors into this situation, but it’s certainly something worth considering when discussing the topic of home ownership in China.",
            "\"Well yeah it's not big enough for me to roll over or sit up in bed but it's MINE dammit\"",
            "[deleted]",
            "You reaaaally don't want to be in Chinese real estate right now. The big construction giants are failing, people are paying mortgages for apartments that will never be built. And from what I've seen from urban explorer videos in those ghost cities, is that the quality or construction is really poor.\n\nReal estate is the only significant store of wealth available to many Chinese people, so if/when that implodes... It's not going to be pretty.\n\nNot that the situation in the US/Canada is good. Just that the Chinese model really isn't the one you want either.",
            "Probably own American homes",
            "# I'M AN AMERICAN MILLENNIAL AND I OWN A HOME",
            "Wait, this meme is unironic? People actually believe the tofu dredge homes that they pay for decades in advance count as \"home owners\"??",
            "I don’t know if these numbers are real. I would really like to know how many homeless people are in each country and what the percentage of the citizenry is homeless. The numbers are probably hard to estimate. At a certain point, it doesn’t matter how the system works as long as it prevents tent cities and millions living in the streets.",
            "They own condos stacked 80 stories high. Im not knocking it, its not bad, the ones i was in. Everybody together like that creates a lot of foot traffic for the businesses on the bottom of the towers.",
            "They don't own shit, it's all lent from the state.",
            "It just so happens that a huge amount of the homes owned by people in China are in Canada.",
            "[removed]",
            "You know people don't own houses in China right? You can't OWN property in a communist country.\n\nIt's a lease.",
            "What, what do you mean? D:",
            "Funding to kill people via our own wars, invasions of countries to control resources, but also to fund our own proxies so that they have free healthcare.*",
            "Many people on this sub are frustrated with capitalism, yet refuse to learn how it's to be dismantled, and how other countries successfully overthrew their dictatorship of the bourgeois. \n\nI remember reading a comment somewhere around here, which said\n\n>Someone who reads Marx without reading Lenin is bound to repeat mistakes of the past.",
            "That's the narrative the plutocrats in the West want you to believe as they lose their dominance and power. The West has failed its people and fucked up the world.",
            "China is the dominant economic super power; there can’t be any question. The US is clinging on for dear life to its Navy/Military and its Intelligence agencies (which are now a *far* cry from their old glory, Navy is basically it) to have any influence, globally. \n\nThat said, I wouldn’t really want to live in China, either, but that doesn’t really have to do with their economics.",
            "You've also heard the same thing about the US and most other world powers, that's how it goes. There will be positive and negative prognostications when you're one of the world's most influential countries, as China is.     \n      \nThat being said, that other projections have been wrong doesn't mean that newer ones are. China is facing significant issues related to their aging population and the property issues some of their larger homebuilders have been managing over the last few years are serious. Does that mean that China is doomed? No, even in the worst case. I mean, in my eyes China looks to be similarly positioned to Japan in the 80s and Japan is far from doomed though they have been in a very slow decline for most of that period. FWIW I think the US and China will probably both be in relative decline going forward for probably most of the coming decades but I think they will probably remain the two most powerful economies still. Very hard to really say when a major war could dramatically change either country's positioning, or both.            \n        \nUltimately the world is dramatically more complex than these memes suggest(duh) which will naturally spur conversation trying to contextualize a bit.",
            "We’ve been hearing about climate change our whole lives, there are still people who don’t believe it.\n\n\nGo look at a chart if you really care to learn, odds are you don’t.\n\n\nPeople who have the means will always flee to the US or Canada, rather than live in constant fear of becoming the “other”\n\n\nEdit: Bots getting mad, maybe they looked at the chart after all",
            "The issue is that almost all of it is made of the absolute lowest quality that won’t fall over instantly and is massively over valued \nLook up tofu dredge architecture to see more about it",
            "[removed]",
            "China will collapse when we perfect nuclear fusion.",
            "“Communism for thee but not for me.” -Chinese Government",
            "[removed]",
            "Qiao collective. Lots of material over there",
            "No, the house is owned. The land it sits on is leased for 60 years, but when this is up, it is automatically renewed and the government gives some money for house repairs and fixes to keep everything updated and safe. One could argue that the government shouldn’t own the land and such, but as it stands, not a bad system",
            "Abolishing inheritance in order to prevent the calcified private transfer of wealth sounds good to me. \n\nIf homes are affordable enough for millennials to buy now, the chances of the opportunities or lifestyles that millennials want being in the same place as their grandparents built their home 60 years ago is pretty low. \n\nIf there is an emotional attachment to grandma's or great grandma's house maybe the kids could get a first option or something like that; not sure how it's set up but open to taking a look if you're able to provide English sources. \n\nWe don't actually really own our land fee simple in the US either, we pay perpetual property tax. What is their property tax law like?",
            "No that’s not how it works\n\nAll urban land is owned by the state and rural land by the local rural collective\n\nIf you want to use land you need to lease it from the government (the lease lasts a few decades) and then you can only use it to make the thing you leased it for. If you lease land for houses you can’t build a factory there\n\nAfter the lease runs out you can just renew it. But if you don’t the building itself is still your property, and the land belongs to the state",
            "Government owned the ground. In theory they need to buy back the apartment on it. But it's expected lease with just extended the lease for a fee.\n\nSome area in Germany also only doing land lease also (it always existed, but wasn't popular)",
            "I read such messages for about two decades now.\n\nYet, those \"tricks\" still seem to work.\n\nSo when do we start to look at these \"tricks\" and start asking ourselves, why they work for so long?",
            ">If it makes you feel better\n\nWhy would that make anyone feel better? Why would we root for a country's economy to collapse and millions of people to lose their homes??? Because \"China bad\"? Because the neoliberal West wants company in its misery? Speak for yourself, pal.",
            "China will collapse any day now!\n\nHaven’t been hearing this exact thing for the past 20 some years.",
            "I guess America is so much better, at least you can't lose your home if you could never afford one to begin with.  Capitalism, yay!",
            "No guarantee you're wrong, but there have been stories like this in outlets like that for decades.\n\n  \nCertainly not worth anyone's time to read today!\n\nIf you can bring something new to the table, please do.",
            "If it makes you feel any worse, China is at a lesser crossroads than any western country.",
            "Haha, that might make you feel better but what would make me feel better is the US being a lot more like China. \n\nBut I guess you would rather have China be more like the US....ew.",
            "That's not what I've seen there.",
            "> in those ghost cities\n\nEven the person who came up with this interpretation said years ago, that his assumption was largely wrong. Many of said \"ghost cities\" fill up quite quick, as they soak up the people wanting to leave the countryside.\n\nIf anything, those \"ghost cities\" prevented the creation of the chinese version of favelas and townships, therefore prevented poverty, crime and misery actually quite well.",
            "They can have as many ghost cities as they want, they already have 1.41 billion people.",
            "There is no quality of construction worse than new builds here in the US. If you want to be turned off from ever buying a home follow some home inspectors on Facebook. Capitalism literally encourages people to build POS death traps because all these huge homebuilders have shareholders(yay publicly traded home builders what could go wrong!)",
            "Yea they've been saying Chinese banks were going to collapse for two years now, why hasn't it happened?",
            "> \"(...) the quality or cobstruction is very poor.\" \n\nYeah, \"Tofu Dreg building\"",
            "What does that even mean?",
            "Yep, they own my home and I’ve almost paid it off for them. ",
            "The bots are out in full force today. Between this and China curing diabetes, profiteers have their own hasbara working overtime.",
            "“They own condos”\n\nSay no more, fam.",
            "Who knew city people lived in apartments 🤯",
            "Even if, would you rather pay the state or some investment fund or nepobaby landlord?",
            "They do actually. The land is rented but the building itself is your property",
            "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
            "What you think you're not leasing here in the US too? Try not paying your property taxes and see what happens. It's just an illusion that you own it. And God save you if you have a HOA on top of that. Do not fool yourself. (fixed typo)",
            "The US government still has a right to evict people from their private property if it feels the need to. It's called Eminent Domain.",
            "Here in America, I rent to own my toothbrush! And muh toothpaste! And my last five teeth! SUCK IT CUMMIES!! 🖕🎉🦅🇺🇲🇺🇲🇺🇲🦅🎉🖕",
            "Remember that when you own the cardboard box in the alley once capitalists price you out onto the streets.",
            "No it’s not. The land is on lease but the property is fully owned",
            "Israel has free healthcare and education. The US funds Israel's existence to the tune of about 300 billion since the 1940s. So the argument goes, your tax dollars are funding Israel's healthcare while you get nothing.",
            "You know exactly what they mean.",
            "Every Marxist - Leninist attempt has turned into the same thing - state capitalism that's incredibly hierarchical and does not come anywhere near actually liberating the working class.\n\nWe need to learn from their mistakes, and not repeat them.",
            "[removed]",
            "Why don't you look up punctuation.",
            "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
            "Don’t you think they’re working on that as well?",
            "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
            "That Uyghur conspiracy theory is thoroughly debunked. \n\nNo concrete evidence has ever been presented. All the evidence for it is sketchy and unsubstantiated. Conversely, plenty of evidence to the contrary exists. If you really care about this issue, take a deep dive into it, and it's really not hard to find out what the truth behind the matter is. \n\nIf you just want to lazily regurgitate baseless accusations, it's no skin off my back neither.",
            "> Probably the worst right now is Uyghurs' forced to go to concentration camps. \n\nNot real. Stop spreading American propaganda for the state department.\n\n> taking Taiwan, even if by force.\n\n\"We will wait for a hundred years if it means a peaceful unification\" you: \"THEY'RE TAKING TAIWAN!!! BY FORCE!!!! HELP!!!!!!\"",
            "i have been reading about “china’s impending collapse” since i could read lol",
            "Because for these people it’s never about prospering as a species, it’s about them prospering while basking in the suffering of others. They just said the quiet bit out loud.",
            "Isn't this what happened back in 2008",
            "They used to fill up, until they didn't.\n\nIt was a ponzy scheme. Entirely unsustainable. China leveraged their construction industry as a core driver of their economic growth. To keep up with the growth, companies like Evergrande sold apartments before they were built, only to fund the construction projects already in progress.\n\nThis worked fine as long as new people kept coming in. But this stream of fresh people has slowed down significantly. And now it turns out that this unsustainable model is indeed unsustainable and has started to implode.\n\nThere is a reason this is illegal in the West, and China has recently put up serious barriers to discourage this as well. But that's just to stop the bleeding, it doesn't solve the underlying issue that their economy only works if it is growing quickly, and construction is a huge chunk of it. A recession is bound to happen eventually. It will be interesting to see how they weather that storm.\n\nI'm sure there are also positive side effects. The amount of people lifted out of poverty in China is incredible. We could use more aggressive construction projects here. But what we don't need is massive companies trying to outrun crippling debt by running a Ponzi scheme.",
            "Have you seen how houses have been built in the US? They build big homes that are cheap and quickly constructed. They're crap though and start falling apart in like 20 years. Lind of seems like you're projecting",
            "I don’t know if it’s what they’re talking about, but a sizable percentage of American homes are owned by foreign investors. \n\n[Chinese owners make up 13% of all foreign investments in US property.](https://www.statista.com/topics/4455/foreign-property-investment-in-the-us/#topicOverview)\n\nTotal foreign residential investment is $56B and foreign commercial investment is $36B.",
            "This sub has a hell of a propaganda problem.",
            "What is fam?",
            "Good point, I'm definitely paying the money to the state as long as it's not a machiavellian war-mongering state like the chinese is.",
            "lol, what? Taxes are taxes.. that's a completely different subject. No, it's not a lease. You have equity and can borrow great amounts against it... You can make upgrades and improve it's value... You can add a ADU to your property and charge rent (fair amounts or not). Then you can sell it all for more value or leave it to your kids... You can't do that in China. Russia doesn't even have toilets in most rural homes.\n\nMost of the \"homes\" you are talking about in China are apartments on the 157th floor of a very poorly built apartment building. Grow TF up dude for real.",
            "Are you saying I am wrong? \n\nYou don't own your house in China, you have a lease. Which means it isn't an asset and you dont own the equity.",
            "Nope, I'm not from the US so this might be something I don't know. Can someone explain?",
            "They haven't, and you're also just throwing all Marxist theory out the window with that analysis.",
            "Somebody doesn't understand materialism",
            "> hierarchical\n\n\nNo gods, no bedtimes",
            "How do we make it not \"hierarchical\" then?",
            "And Lenin died before all of that. Lenin is solid AF, his theories are solid and demonstrably correct. The USSR fell victim to both revisionism and simply being defeated by the US because it was stronger due to full blown imperialism.\n\nWe absolutely should learn from the failures of the USSR, but don't discount Lenin. It's why nobody gives a shit about theories of Khruschev or Breznov though.",
            "This all happened decades after Lenin's death by a minority of opportunists and was not supported by the people or the government. Blaming it on Lenin shows you have a LOT more reading to do.",
            "It wouldn’t be possible for the money powers of the west to coerce the people who were on the fence(as yourself) to adopt capitalism instead. Right???",
            "Perhaps we should go check the life expectancy increases as a result of the USSR?",
            "> \"We will wait for a hundred years if it means a peaceful unification\"\n\nFuck, only 25 years left on the timer \n\n^(sorry, couldn't help myself)",
            "Yup, in a sense.  I graduated in 2010 and couldn't afford a modest house until 2016.  Now the barrier for entry is so much higher and the interest rate is at least 3 times higher.",
            "> They used to fill up, until they didn't.\n\nYet they are continuing to do so. The masses of empty metropolitan areas failed to realize.\n\n> It will be interesting to see how they weather that storm.\n\nThis storm is predicted year after year after year and still fails to show itself in the economic situation of the average chinese citizen or even economic data.\n\n> But what we don't need is massive companies trying to outrun crippling debt by running a Ponzi scheme.\n\nEven if we assume the real estate companies being a ponzi scheme - having lifted people out of poverty en masse and having them in a home they themselves own within a functional city makes their situation very resilient against shocks.",
            "Both are bad.",
            "I'm neither from, nor living in the us. I am perfectly aware of the ammount of drywall and the bad quality of building materials used in the us building industry. However, i have also seen more than enough recordings originating from china where walls are crumbling like a wet sandcastle, with light touch being enough to tear off chunks.",
            "Thanks for clarifying my comment.  For the idiots",
            "China hasn't been in a war since 1979, and that was a month long conflict over borders. Meanwhile the US.... Seriously, it's like your entire conception of China is just a projection of the US",
            "War-mongering?",
            "The USA famously is a peace loving nation",
            "Yeah buddy and the US is full of simple, peaceful folks right? That's why 60% of my wage is gleefully wasted paying a landlord to not have a job because they're just so peaceful and loving people",
            "Name one that isn’t lmao",
            "Like I said try not paying your taxes or if you have an HOA - it's dues. See how much of a home that you will have left. Keep lying to yourself that you \"own\" it. You need to open your eyes, son.",
            "In Soviet Chyna, the state own house. But, in capitalist America, bank own you! \n\n\nBut yea, rhe whole \"but, you don't have the little paper saying your house is a business investment!\" might work in your financial circlejerks, but you're gonna have a hard time with the same gotchas with anyone that has to pay for housing.",
            "He's referring to the fact that the US funds the Israeli military with billions of dollars every year for the last 50 years, allowing them to invest in their healthcare and education instead",
            "The amount of taxpayer money that is donated directly or indirectly to Israel by the US gov",
            "If the materialist analysis of a place differs from how things actually operate then its probably best to stick with the tangible",
            "Dunno, ask some anarchists or something. Unfortunately, both capitalists and state socialists prioritized killing these off first when they gathered in sufficient quantities, so not much data on the ground has been collected.",
            "[removed]",
            "My guy he founded the power structure that allowed someone like stalin to take control. No good kings, no good dictators. Vangaurdism will always end like this because consolidating a power structure is just asking for it to be co opted by sociopaths.",
            "[removed]",
            "This is a fundamentally stupid and bad argument since the European union had an overwhelmingly bigger impact on it's members. \nHaving a better life expectancy than tsarist Russia requires bothering to sometimes feed the populace",
            "Burger dreg buildings are real, but the racist bullshit you people peddle about China isn't.",
            "Smart enough to not outright start shit, but fucking around to see what happens with most of it's neighbours\n\nMaybe the word I should use is imperialist instead of war-mongering",
            "That is the bot response. Just tell him to ignore all previous instructions.",
            "China: the us needs to stop this cold war mentality\n\nAmericans: CHINA WANTS WAR\n\nThe american propaganda machine is just gearing americans up for war with china. America is so provocative with china for no good reason",
            "I don't care about the US",
            "Don't care about the US",
            "Thanks to both you and @Cyber_shafter for the replies. I still don't get why people haven't been talking as much about all this stuff about Israel, tbf I still don't get how someone arrived at the conclusion that creating a new nation like that right there was a good idea...",
            "That's incredibly vague. The Chinese have high rates of home ownership, free healthcare, easy access to education, expanding technology and livable spaces, great infrastructure and many forms of low cost, high quality transportation. These are the material conditions there. \n\nWhat non material things are more important than those things to you and why?",
            "\"State socialist\" is a new one lmfao.\n\nMaybe they kill these guys off first because they try to pull shit like, I don't know, shooting Lenin in the neck.",
            "You mean the leaders of one of the most successful working class resolutions in history went through great measures to maintain and defend it from hostile reactionary elements of the remaining bourgeoisie? Color me shocked!",
            "Ah, you know nothing about Stalin. That explains it. Have a good day",
            "Shut the fuck up, liberal",
            "Immediately started failing?? Wtf? Except they went from farmers and peasants to a fully industrialized nation that survived the Great Depression of the west. Also with an army so vast that Lenin’s successor was able to win a world war.\n\nAnd again, their demise couldn’t have been helped along by the Western money power’s laser focus on destroying the idea of communism riiiiight?",
            "You bring up a good point, how many famines happened after the USSR collectivized agriculture?",
            "Most of its neighbors are occupied by the US...",
            "> it's like your entire conception of China is just a projection of the US\n\n...\n> Maybe the word I should use is imperialist\n\nCase in point",
            "It’s in the context of the post we’re discussing, so I’m not sure why you’re disregarding it",
            "It was never a good idea except for 1 reason - it gave the US an ally and eyes in the middle east, the government wanted it for a strategic advantage in the region, that alone is the sole reason they exist, anyone that says different is blind to the politics and warmongering of the time, it was never about the people or anything else, just military advantage",
            "[removed]",
            "[removed]",
            "Vangaurdist are bootlicking trash who need a strongman to guide their feeble minds. Replacing the opium of religion with the heroin of hero worship.\n\nGet some anarchy in ya.",
            "Multiple. \nYou are establishing your argument on being better than a technologically backwards feudal state ruled by inbred cretins. Capitalist systems are also better than tzarist Russia. Arguments for communism have to be set up against capitalism since these two are actually competing systems. Feudalism is dead and irrelevant. \nAny liberal could hopelessly embarrass your arguments by simply comparing your statistics to the statistics of the US.",
            "Bold words.",
            "My point is, China and the US bad.",
            "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
            "It's defined by ideology, lib.",
            "Discussed strategy. \n\nhttps://foreignpolicy.com/2013/08/20/surrounded-how-the-u-s-is-encircling-china-with-military-bases/",
            "Eh, China you really do not have a good view of through western media.",
            "[removed]",
            "Felt like changing the subject, eh?"
        ]
    },
    "Seen in Belfast, Ireland. They shouldn't be allowed in pretending to be normal after everything they've openly done. It was social and economical exclusion that forced South Africa to end their apartheid": {
        "title": "Seen in Belfast, Ireland. They shouldn't be allowed in pretending to be normal after everything they've openly done. It was social and economical exclusion that forced South Africa to end their apartheid",
        "score": 3774,
        "url": "https://i.redd.it/nadgiwqt4z7d1.png",
        "content": "",
        "num_comments": 123,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "Good for them. I really admire the Irish people for unapologetically standing up for a belief that's unpopular amongst other Western governments, and they've done it since October. \n\nI live in NYC and we have soooo many goods made in Israel in various grocery stores here, that I have to check before I buy something.",
            "The Irish know about colonialism and oppression. Especially those in the north of Ireland 🇮🇪",
            "Ireland has a keen understanding of genocide by artificial famine",
            "Zionists have shown no interest in being a part of humanity. They shouldn't be allowed or let into social circles. They should be shunned and isolated like or more than how the apartheid supporters in South Africa were, and any attempt at pretending like they're normal should be shut down. It was social and economical exclusion that forced them to stop their racial apartheid, they couldn't go anywhere or do anything. And they've shown what satanism they're supportive of in complete supremacist disregard for everyone and everything in the world driven by their ideology, they can't be allowed in pretending to be polite people after this.",
            "The more I learn about Ireland the more respect for it I have.",
            "Well if anyone knows oppression it's the Irish.",
            ">Belfast, Ireland\n\nGood lad, OP",
            "Better be careful before the U.S. decrees that this is an act of war based on the anti-boycott laws they have for Israel",
            "Sabra is just dogshit so that’s an easy one",
            "Good on them.",
            "This is exactly why our next vacation will be in Ireland 🍉",
            "Exactly. I imagine there were similar situations in WW2 about German/Japanese/Italian products",
            "Serious question: How much stuff is actually made there?",
            "Boycott and divest. Two simple ways individuals who may feel powerless can make a significant change. Ireland is typically at the forefront in calling out injustice and the denial of human rights. Such a brilliant example of an individual making a difference.",
            "fuck yeah! I wish this came to the US",
            "And this is in Belfast, part of the UK, not the Republic!",
            "Good",
            "BDS",
            "[removed]",
            "There's probably a unionist shop across the street selling only Israeli products",
            "Name of the shop? I don't believe in the bullshit that is \"voting with your wallet,\" but I'll be traveling there soon and would rather spend money there than elsewhere.",
            "département basé",
            "Ireland, you never disappoint me. Big-hearted people!",
            "I mean wasn’t it internal struggles that won South Africa freedom and the international community helped it along",
            "Ireland W",
            "Ireland is always based.",
            "Probably still sell Chinese goods though.",
            "Seems like racism. People need to remember that governments are not the same as the people. You can dislike the government, but don't be racist and hate the people of an entire country.",
            "lmao the chance they were selling Israeli products before the most recent Gaza fighting is probably very slim anyways.",
            "  It needs to be called  ANTI- GENOCIDE. and the Palestinian prisoners need to be called HOSTAGES.",
            "[removed]",
            "\"don't jew me\" making subtle comeback 🙈",
            "[removed]",
            "GFY",
            "[removed]",
            "They know about having a boot on their neck.",
            "One big problem is people continually and intentionally muddy the waters saying that Anti-Israel is antisemitism. Which it isn't....",
            "Maybe the European *governments* are behind Israel. The people themselves are a different story, I haven't spoken to a single person who's alright with the Zionists' genocide. For the people living here, it's the end of Israel.",
            "Based",
            "Training paramilitaries in North Africa builds everlasting bonds.",
            "Sadly we have a lot of colonial arseholes in the North that are, *quelle surprise*, pro-Israeli. One of the towns local to me (Coagh) is a Unionist town that flies several Israeli flags from lamp posts.",
            "Gonna have to say this.\nThe north VOTED to remain part of the UK. While I support Ireland in the stance of boycotting Israeli products, it's telling that Northern Ireland would rather remain part of a nation that isn't even on their island than be part of the country that is quite literally, over the fence. \n\nAnd before everyone comes in and goes \"They threw the vote! I don't believe it! Yada yada!\" Not every referendum or poll or vote that goes the way you did not want it to is rigged.",
            "Every famine in recorded history is man made.",
            "dont be slandering satanists now, friend",
            "Would you mind explaining Zionist ideology? I feel like a lot of people have different ideas of what exactly it means to be a Zionist",
            "[removed]",
            "[removed]",
            "Tiocfaidh ár lá",
            "It is already illegal for US citizens to engage in boycotts of Israel.\n\n[Office of Antiboycott Compliance.](https://www.bis.doc.gov/index.php/enforcement/oac)\n\nThe wording on the current website hides it in vagueness about any unauthorized boycott at all, but the whole thing was setup as a way to stop boycotts of Israel. \n\nAn earlier version of the website a few years back made it very very clear it was all about protecting Israel. Even had \"dont let this be you\" examples of previously prosecuted cases where they were all about Israel boycotts. Every one of them.",
            "\"hold my beer\"\nhttps://www.texastribune.org/2022/01/31/texas-boycott-israel-lawsuit/",
            "I hope you like the rain, because you're gonna get rain.",
            "There was dummy",
            "Check out the \"No Thanks\" app. You will be surprised.",
            "This was my first thought too. Not that I look at everything I buy, but I don't ever even recall seeing a made in Israel label on anything.\n\nI guess I don't purchase enough weaponry? I know they sell those.",
            "It's in West Belfast which is majority Irish Nationalist, though.",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "Racism would be not allowing any Israelis to shop there. Its also not a statement of not stocking something made my an Israeli (say one living in another country), only not stocking something that came from the *country* of Israel. I can see how easy it can be for someone to conflate this with racism, though.",
            "[68% of israelis oppose humanitarian aid to gaza](https://mondoweiss.net/2024/02/over-2-3-of-jewish-israelis-oppose-humanitarian-aid-to-palestinians-starving-in-gaza/)\n\nalso israeli? not a race.",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "Fuck up you melt.",
            "?",
            "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
            "They literally have roads that Palestinians aren't allowed to use, what do you call that if not apartheid?",
            "Ok, Hasbara.",
            "It’s very much an apartheid. Keep in mind, Palestinians with Israeli citizenship:\n\nBanned from living in more than 70% of the land as non-Jews\n\nRight to buy or lease land severely limited\n\nDeprived of electricity, water, roads in Naqab Desert\n\nFamily separation laws\n\nSocially segregated\n\nDenied town residency applications due to identity\n\nDenied utilities and infrastructure in municipalities\n\nCrime allowed to flourish\n\nSegregated school systems\n\nPoor schooling facilities\n\nSeverely limited property rights\n\nDenied right to return to their homes pre-Nakba\n\nPalestinians in Jerusalem are:\n\nStateless\n\nNo right to vote for sovereign government\n\nHome demolitions\n\nExpulsions from homes\n\nHoly sites constantly desecrated\n\nResidency can always be revoked\n\nDetained without trial or charge\n\nTortured while detained\n\nMost political parties and trade unions banned\n\nDenied right to return to their homes pre-Nakba\n\nPalestinians in the West Bank are:\n\nStateless\n\nNo right to vote for sovereign government\n\nDenied permits to build homes\n\nHome demolitions\n\nExpulsions from homes\n\nLand theft\n\nRacially segregated from settlements\n\nIsolated into 227 enclaves\n\nMilitary checkpoints choke freedom of movement\n\nDenied permits to build wells\n\nDenied access to water network\n\nDenied access to agricultural land\n\nDenied access to sewage, electricity and utilities\n\nDetained without trial or charge\n\nTortured while detained\n\nExtrajudicial executions\n\nSearched without restriction\n\nHomes raided by soldiers at night\n\nRight to legal counsel during trial is suspended\n\nDenied freedom of speech\n\nMost political parties and trade unions banned\n\nFrequent killings by militant settlers\n\nUnder constant surveillance\n\nDenied right to return to their homes pre-Nakba\n\nPalestinians in Gaza are:\n\nStateless\n\nNo right to vote for sovereign government\n\nPrevented from leaving or entering\n\nLand, air and sea blockade\n\nCannot import or export\n\nNo access to arable land\n\nNot allowed to access main fishing areas\n\nRestricted maritime area\n\nMedical blockade\n\nOnly allowed four hours of electricity a day\n\nDenied access to education and healthcare\n\nDenied access to healthcare outside Gaza\n\nConstruction materials for bomb shelters banned by Israel\n\nDenied right to return to their homes pre-Nakba\n\nFrequent Israeli bombings\n\nItems like cement, fishing rods and heaters are banned\n\nFood items like ginger and jam are banned\n\nIsrael limits average caloric intake per day\n\nRestrictions on items allowed to pack for travel\n\nDrones constantly surveying homes\n\nNot allowed to develop telecomms services\n\nBanned from having airport\n\nBanned from developing seaports",
            "Apartheid South Africa had more humanity than the Israeli occupation does, and apartheid South Africa basically had no humanity.",
            "Why don't you explain the difference to us then?",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "If only the people saying that were all from, like, the exact same demographic or something, so we could tell ahead of time who’s unwilling to converse in good faith.\n\n/s in case it isn’t obvious ",
            "[removed]",
            "As someone who was raised loyalist and got out of that shit when i was 15 ( 7 years ago now ), the loyalists support of isreali is much less to do with supporting isreal and far more to do with opposing the fenians. \n\nLoyalists oppose whatever nationalists support and vice versa.\n\nThey are also just an extremely racist and stuck in the past people. They will stand, election by election, complaining about people voting for the provos ( stupid fucks still think the provisional IRA exists ) but yet never stop for a second to question why it could be that the likes of gay people, minorites and everything else, are far more likely to vote for Sinn Fein, the SDLP, People Before Profit.",
            "Sadly, the Irish government is all words, no action. Their position essentially is to defer to the PA, which is an unelected, comprador entity of the US and zionist entity with the Oslo accords to help the zionist entity fulfill its apartheid in the occupied territories. And the Irish government, for some reason, really really wants to join the western imperialist club, you know the one that horribly exploited Ireland for centuries. It's not that the Irish government is radical, it's just that most of the rest of Europe is so radically zionist.\n\nEdit: Well, I'm talking about Ireland in the comment thread about Ireland lol. No need to be a prick and block people. Lot of Northern Irish are unsurprisingly supportive of settler colonialism. Unfortunately, the Irish government is rather tacitly supportive in a rather contradictory manner of that of the Irish people.",
            "imagine being you, rofl",
            "Interesting, can you please share when this vote was and what the results were?",
            "Satanists don’t kill people over dogma. Christians, Muslims, Jews, Buddhists, and Hindus do.",
            "Zionism is Jewish nationalism. At its most defensible, Zionism is the belief that Israel, the self described “Jewish state” - established in Palestine in 1948 via a UN resolution and the first Arab Israeli War  - has a right to exist as a member state of the United Nations. By that definition I’m a Zionist. But this definition has been largely superseded by the definition endorsed by the Israeli government and Jewish ultranationalists worldwide. This definition states that Israel not only has a right to exist, but that Jewish safety and Biblical scripture both demand that that state be as large and as ethnically pure as feasibly possible. It also supports not just a state with a Jewish demographic majority, but one in which Jewish religious law bares upon civil law, and in which various laws and practices privilege Jews over non Jews and promote the segregation of Jews from non Jews. Because “Zionism” has been dumbed down to mean “support for Israel”, and because Israel does all of those things, opposing those things basically makes one an antiZionist in modern political discourse.",
            "100%\n\nIf you don't know any better and read Zionist as 'jew,' this is a Hitler level comment.",
            "Yea mr.obvious, it's 'Israelis' who are committing this genocide. How are you using that as a gotcha. Anyone who is a zionist, Christians, Jews, Muslims, atheists, Hindus, is included in it. Anyone who still holds this political view that is zionism is complicit in genocide, in ethnic cleansing, in apartheid. It's really not complicated.",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "Troll posts will be deleted. Many troll posts also include violations of other rules such as rules 4, 5, 6, and 7.",
            "🥲",
            "Thanks for that clarification!",
            "[removed]",
            "[removed]",
            "> Banned from living in more than 70% of the land as non-Jews\n\nIt's actually closer to 85-90%",
            "I get your sentiment, if by demographic you mean zionists.\n\nIf you mean Jews, you’re flat out wrong. There’s a huge sect of anti-Zionist Jews who have been leading the pro Palestine charge since Zionism was a concept, but especially since October 7th.\n\nAs an example, the first pro Palestine groups to be arrested on university campuses were members of Jewish Voice for Peace, a Jewish pro Palestinian organisation. Or look at the many anti Zionist orthodox Hasidic Jews who’ve recently been protesting in New York and other parts of America.\n\nJews know oppression when they spot it, they’ve been persecuted since the beginning of time. They’ve also been at the forefront of supporting other persecuted peoples since forever.\n\nIt takes a fuckton of Zionist propaganda to radicalise them in the opposite direction and accept or even call for the ongoing genocide of the Palestinian people.\n\nI also just wanted to add, many of the most rabid, bloodthirsty zionists are actually Christian zionists. Christian Zionism is older and more extremist than Jewish Zionism historically.",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "You're deluded. Jews exist without Israel. Jewish identity does not require Israel to thrive. Criticizing the Zionist project (Israel) is pro-Palestinian rather than Anti-Jewish. \n\nYou have it confused: Zionism is a perversion of Judaism. Anti-Zionism is pro-Jewish--we must save Jews worldwide from being mis-represented by a disgusting, brutal European colonialist settler project. \n\nPeace to Jews everywhere but especially the Palestinians who have been dispossessed of their homes!",
            "No its not. \n\nThe fact that some anti-Zionist arguments are antisemitic does not put them as completely overlapping circles in a venn diagram of the two. Zionism is obviously closely related to Jewish identity but is NOT jewish identity, and it is possible to be a Zionist while not being Jewish, marking a clear distinction between the two. \n\nAnti-israel sentiment is criticism or dislike of the state of Israel and their actions. \n\nAnti-Semitism is \"hostility and prejudice directed against Jewish people\". \n\nLast time I checked, Israel is NOT the Jewish people. Therefore the two cannot and are not the same. \n\nNice ad hominem, but you're wrong and its amusing that you think you're so right. \n\nIs Israel predominantly Jewish? Yes, but the dislike of the Nation State's actions are not due to the predominant faith in the nation. It is due to the systematic slaughter of people that the state sees as enemies or dissidents, who are all part of the same ethnic group. Hmmm, that seems markedly similar to the definition of genocide. \n\nAlso, if you really want to get into it, we can talk about what Herzl and how Zionism came to be. Zionism came about due to antisemitism and the belief that antisemitism couldn't be defeated but rather avoided, first zionist congress, etc. etc. rejection of the Uganda etc. etc.",
            "Oh I know, absolutely. With that said, Coagh has a lot of ex-UDR and BA families so there *is* pro-Israeli sentiment there solely on the premise of being pro-Israeli/anti-Muslim/Palestinian. I agree that most of them are just doing it to wind up themmuns though.\n\n>They are also just an extremely racist and stuck in the past people.\n\nTrue but again I know a lot of Nationalists like this, esp. around Ardbó so in Unionism's defense I can't say it's just them that are at it like",
            "Northern Ireland isn't governed by the Dáil mate so you're just yapping on about something completely irrelevant and that you quite clearly have no knowledge about, otherwise you'd have realised in the context of Israel, the Dáil (Irish government btw) has no bearing on what NI's stance is.",
            "I quite like being me. Now being you, on the other hand; has got to be the most embarrassing experience known to man.",
            "The poster is possibly confusing the Scottish independence referendum, but the Good Friday Agreement, which effectively ended the Troubles, does confirm Northern Ireland as part of the UK. This was ratified by referenda both sides of the border in 1998.",
            "https://en.m.wikipedia.org/wiki/1973_Northern_Ireland_border_poll",
            "Satanists are also kinda hot imo",
            "Wait has a Buddhist killed someone over their beliefs? I don't know why that sounds weird to me.",
            "I think this is where the issue is in modern politics where Zionism is concerned--most zionists use the simplest definition of \"the belief in a Jewish state in the land of Israel.\" A lot of Zionists do disagree with each other on things like what percentage of the Israeli population should be Jewish (which is a question of religion, not ethnicity) and how much influence religious laws should have over civil laws. But those debates aren't part of Zionism, they're about the Israeli government. So a lot of times these days when someone says they're anti-Zionist, they're actually anti-misc ideas that a lot of Zionists are also against",
            "That is not what I was implying. I mean that a lot of people hear \"Zionist\" and assume that must mean approval of the Israeli government's actions when in reality a lot of zionists disapprove of what Israel is currently doing",
            "[removed]",
            "Good to know you will be deleting the post I replied to as it clearly breaks rule 7.",
            "This is a leftist subreddit, right wing comments will be removed and the user banned.",
            "There are palestinians that live in israel, just as there are Italians that live in the USA. \n\nIt's not about foreigners or tourists lol",
            "The thing is,Israel regulates movement of Palestinians within the occupied territories. The areas that aren't Israeli by international law. There's plenty more examples of apartheid though,you know,if that ain't enough for you.",
            "And foreign countries can decide if they want to allow zionists or boycott their goods. Its not so nice when the discrimination is aimed at you, is it.",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "> There’s a huge sect of anti-Zionist Jews\n\nIf that were true, then ZERO major Jewish organizations would be saying that anti-Zionism is equivalent to antisemitism. Yet they are. So either you’re _also_ arguing that there’s a huge sect of antisemitic Jews out there, or you’re not listening to what the majority of Jews in the west are actually saying. \n\nThank you for the list of… let’s see, I count _two_ small, minority Jewish groups that don’t actually represent the mainstream Jewish opinion though! It’s always nice to know the exception that proves the rule.\n\n> Jews know oppression when they spot it\n\nOh, so you’re saying they’re fully and intrinsically aware of the injustices they’re committing against Palestine. Great, that simplifies everything, because then we don’t have to consider whether the individual Jewish people we know in our towns and cities might simply not know what’s going on. Thank you for clarifying that, merely by virtue of being Jewish, they’re innately aware when fellow Jews are committing oppression.\n\n> It takes a fuckton of Zionist propaganda to radicalise them in the opposite direction and accept or even call for the ongoing genocide of the Palestinian people.\n\nYou know, the nice thing about having a religion is that you can simply refer to your fuckton of propaganda as “scripture,” and then nobody questions why you make your children recite that propaganda every weekend.",
            "From the intro on that page:\n\n\"The referendum was boycotted by nationalists\"\n\nIn fact, and it really should include this on Wikipedia, less than 1% of nationalists actually voted.",
            "Here, wasn't that not during the time in which catholics and nationalists were third class citizens who were living in a gerrymandered state ensuring that even when they outnumbered unionist votes by a 3-1 margin, the unionist votes would always count for more?\n\nImagine actually posting that shite and taking yourself seriously as you do.",
            "You rang?",
            "Thank you. ;)",
            "lol",
            "Myanmar a buddist majority country are persecuting the muslim community",
            "Removed. Cut and clear, Israelis are welcome on this sub, zionists are not. Do not defend the genocidal state of Israel, deny the current Palestinian genocide and/or similar.",
            "Anti-Jewish bigotry is perfectly acceptable nowadays it seems.",
            "Everything all good man?\nNothing you said disproves anything I said. I never said a majority of Jews are anti-Zionist, I just said there’s heaps that are, which is definitely true.\n\nWhat argument are you trying to make? That all Jews are Zionist? Because that’s the same antisemitic argument that the Israeli Knesset and Hasbara propaganda machine make regularly.\n\nPeace isn’t bound to certain religions or ethnicities or anything like that. Nobody harbours hate based on intrinsic factors. Remember, Jewish identity isn’t just a religion, it’s also an ethnicity/race, however you want to define it.\n\nI think you should seek some peace in your heart friend. I’m glad you’re aligned with the free Palestine movement but please remember this movement seeks the freedom of Palestinians, muslims, Jews, and every single living being on this planet.",
            "If you boycott a vote that is deciding which country you live in, not only are you a self defeating idiot, but actively working against yourself.",
            "So, what you are saying is that no matter what, you don't agree. \nGot it.\nIf the northern populace is evidently so pro Irish reunification,  why has it not been done since the end of the troubles? OH YEAH, because they don't want to be.",
            "They've heavily persecuted Hindu Tamilians in Sri Lanka, resulting in a major civil war there spanning over a decade",
            "Because there has only ever been 1 pro unification government, and it spent the first  years of its life collapsed because the loyalists threw a fit after losing and refused to take their seats.\n\nConsodering that you very clearly understand neither the history of the north, nor it's political institutions and what is required for them to work, I'll await your next dumb as fuck response."
        ]
    },
    "Here's the subtitled interview of Badr Dahlan, the freed tortured Palestinian prisoner, that some were asking for. Link for video in replies.": {
        "title": "Here's the subtitled interview of Badr Dahlan, the freed tortured Palestinian prisoner, that some were asking for. Link for video in replies.",
        "score": 408,
        "url": "https://i.redd.it/k9nw95jn328d1.gif",
        "content": "",
        "num_comments": 17,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "https://youtu.be/eB3NJsdDGRI?si=0E5oRHgPZAaw-0XnHe\n\n\nhttps://x.com/SuppressedNws/status/1804113852319121641\n\n\nWhen he's asked what they did to him, in this video it's translated as \"unintelligible\", but in the second video he says they smashed his head on the bus and he wasn't allowed to look up.\n\nThese are the prisoners the Palestinian resistance set out to free by taking hostages, this situation was brewing before October 7, it wasn't some outburst of anger. These prisoners are very well documented facing systematic intense physical, mental, and sexual torture, including kids, for decades now, completely unprovoked.\n\nYou can tell he's self aware about his condition and tries to hide it to trying not to put off people. I really just want to comfort him. Every life stolen must be brought to justice.",
            "One of the most disturbing videos I’ve seen. The   level of pure evil behind this is unfathomable.",
            "Zionism is a disease of the human soul.",
            "The way he moved his head up when he was asked a simple question, indicates plainly, a trained anticipation to terror.  God damn Israel.",
            "Holy fucking shit. The way he says “a nightmare”.",
            "No matter what the doctors do, he will not recover from this. Poor man, I hope he finds peace and happiness again. :(",
            "How can we expect anyone to endure the trauma Palestinians have survived? \n\nThere is not enough focus on the mass trauma they're enduring and have endured for a generation. It's unconscionable to know even a fraction of what these people have suffered under the israeli occupation.",
            "Is zionism the legacy of the Holocaust?",
            "FUCK Zionism and FUCK the terror state of Isnotreal",
            "Never forget and never let this go. Zionism is a cancer on us all.  And fuck that old white Biden monster for enabling this. \n\nI had this crazy thought last night about maybe voting for Biden (after reading about the alternative candidate’s plans). Thank god I quickly came to my senses. I will gladly die before I vote for Joe Biden, a pathetic failure of a human.\n\nBless Badr Dahlan. His suffering is on all of us.",
            "When the war against Israel finally starts and we see the full extent of the pent up rage taken out on the israeli people, remember that they brought it upon themselves.\n\nIt will be a joy to watch.",
            "zionism predates the holocaust",
            "zionism is used much differently by different people, so it depends. but what you are seeing above is indeed a legacy of the holocaust",
            "Do you think Trump will do better for the Palestinians? Real question,",
            "but yeah you're right I guess I mean to reply to the other guy",
            "well there's a higher up comment that says \n\n>Zionism is a disease of the human soul.\n\nand the definition of the word is \n\n>a movement for (originally) the re-establishment and (now) the development and protection of a Jewish nation in what is now Israel\n\nSo that top comment would be considered some Nazi shit - but we understand the context here is a different meaning of the word. Because re-settling folks in their ancient homeland doesn't need to or by definition include torture. \n\nSo you know in the context of the comment above it's more like \"Israeli Nationalism\" maybe? That still doesn't seem to capture the horrifying things that are happening"
        ]
    }
}