{
    "I swear this is some of you": {
        "title": "I swear this is some of you",
        "score": 510,
        "url": "https://i.redd.it/i7kzrkq0ky7d1.jpeg",
        "content": "",
        "num_comments": 28,
        "comments": [
            "I am a white guy with a beard. Am I Linus?",
            "Took the meme right out of my brain.",
            "To be fair, some of the photos that were posted here looked insanely similar to Linus. One of them was so similar to him for the first couple seconds I actually thought that was Linus before I read the captions.",
            "The joke has been so overused at this point. It's ridiculous",
            "Is the producer of the WAN show not Linus?",
            "Since when does Linus Torvalds have a beard?",
            "YES, EVERYONE IS LINUS, LINUS IS EVERYONE! JOIN THE LINUS RELIGION!!!!",
            "its as bad as the family guy \"Its Jackie Chan!\" \"look Its MAtt Damon!\" skit.",
            "Maybe this is the real reason he got rid of the beard, at least for a while.",
            "Only counts if you see them in Burnaby",
            "I remember the post about the hammock guy on the bus that looked like Elijah.",
            "Caught Linus delivering Christmas Presents on a magic flying sleigh last year",
            "It's me.\n\nI'm your Linus.",
            "any white guy with a beard *and long hair:*\n\n“Is this Penguinz0?”",
            "This must be a bot repost, stolen meme, considering Linus has shaved weeks ago.",
            "why did you have to make this racist?  Its messed up bro",
            "Title thinks we are noob here",
            "You could be Luke, maybe Dan",
            "No you are Koenyie",
            "Do you also wear thigh-high socks?",
            "Do you reckon you might lose appeal over it one day tho?\n\nMaybe some people have been here for years and it genuinely isn't even interesting anymore. You could show me a legit doppelganger with 99.9% likeness and it wouldn't create a single neuron reaction inside our minds at this point. \n\nIts also just an obvious side effect of too much binge watching... When its basically the only show you've watched for a whole week, everytime you see a skinny blonde man with a beard, your brain will obviously try to find an association with whats its been doing lately. Been there. Just didn't feel the need a make a reddit post everytime it happened.",
            "That's Bread Linus",
            "Ethan Hawke",
            "High praise, indeed.",
            "thigh high socks?  is this femboy Linus?\n\ni thought linus wears at most knee high/mid shin high socks",
            "God forbid people have fun or make jokes.",
            "Who's saying you can't?\n\nOr is someone saying maybe lay off the exact same joke being made over and over and over and over again.\n\nHate me all you want, but you'll either think just like me one day, or be that guy that's amazed by the same knock-knock jokes in his 50's"
        ]
    },
    "I don't remember that quote, was it in a DLC or something?": {
        "title": "I don't remember that quote, was it in a DLC or something?",
        "score": 17,
        "url": "https://v.redd.it/h7c3upv5q38d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "I think that's what everyone does when they accidentally go down the legion quest line and enslave the Mojave."
        ]
    },
    "Justifiably Idiotic Merch Now!": {
        "title": "Justifiably Idiotic Merch Now!",
        "score": 29,
        "url": "https://i.redd.it/v1oz8o1zn28d1.png",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "linus tech tips": {
        "title": "linus tech tips",
        "score": 211,
        "url": "https://v.redd.it/2zfuc7ep0z7d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "TIHI",
            "It's all Linus....... always has been.",
            "Linus sex tips",
            "u/auddbot",
            "That's just you, I love it.",
            "real",
            "**Song Found!**\n\n[**Ghosts N Stuff** by deadmau5](https://lis.tn/GhostsNStuff?t=79) (01:19; matched: `100%`)\n\n**Album**: Azuli presents Global Guide 09. **Released on** 2013-11-20.\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon. Music recognition costs a lot)",
            "It's literally his most famous work .. there's one he released with another DJ about how to produce dance music it's pretty funny",
            "The acronym didn't mention you at any point"
        ]
    },
    "Surprise WAN show ": {
        "title": "Surprise WAN show ",
        "score": 223,
        "url": "https://www.youtube.com/live/eoInGDRVkYc?si=X_P0CXuBSxQk8NSD",
        "content": "",
        "num_comments": 77,
        "comments": [
            "In case people missed it, at the end of the previous episode, Linus announced that this week's episode would be early, due to a funeral in the afternoon.",
            "Did Linus lose his sister? \n\nJust a comment he made about the shirt he was wearing [1h50min] made me think",
            "if there are shops in China that will reball mobile Nvidia GPUs to desktop chips, I don't see why they couldn't make a framework compatible one (other than will/monetary incentive, volume and support)",
            "I’m not religious at all, but thoughts and prayers* go out to his family. Funerals are rough, unexpected funerals are even worse. Especially when it’s close family.",
            "was actually nice to have the WAN show air earlier, usually miss it because when they're live its like 2am for me",
            "Didn’t know surprises were announced multiple times up to a week ahead of time.",
            "On the enterprise licencing discussion at the beginning: this really is standard practice, not an Adobe specific thing. You negotiate the number of seats you'll need at the beginning and then you can increase it throughout the year if needed. To decrease the number of seats you need to raise this during the annual renewal negotiations. It works like any other business negotiation - you can't really make comparisons to the consumer market, it works very differently.",
            "Why is he in the office! Go be with your family!",
            "Not a surprise lol",
            "[deleted]",
            "Thanks for this. Not that it's any of my business, but I was super confused when I saw LTT live on YouTube and Floatplane chat was at least a little confused as well.",
            "Was going to say, it wasn't really a surprise. They discussed and basically planned it live last week.",
            "They also posted the early start time to their Instagram.",
            "Based on his story, I would assume so. Well wishes to Linus and his family.",
            "He seemed to have a hard time keeping it together during his story involving his mother and sister, when Luke gracefully offered to take over/change the topic. His heartbreak is clear for whoever has been lost, and it seems it may be his sister. They are still here through who he is.",
            "Based on the preshow going a bit more into that story, yeah.... Seems like it.",
            "Maybe, don't speculate. If he wanted to talk about it publicly he would have.",
            "US sanctions on Chinese imported boards for one.",
            "Yeah, it definitely was not a surprise",
            "Poor guy getting downvoted but it's not like they didn't post this on every social media page they have throughout the week, including YouTube",
            "Especially since it's still on the same day of the week for close timezones.",
            "If a rapper says he's gonna drop an album on this date and goes ahead and does that, does that count as a surprise release? Actual morons downvoting you here.",
            "His point is literally that if that ten dollars means so much to you that you can't just give it away, he would rather you keep it and use it for what you *need* instead of investing in a parasocial relationship in hopes that he *might* respond.",
            "If you are that poor maybe stop giving money to rich people on YouTube? Just a thought",
            "\"Whaaa, Lord Linus won't take my money because he cares more about my well being than I do.\" \n\nLook, I get it, but if you want to send a merch message, save up so you can do a 10 dollar gift card, do that a few times, then use the collected gift cards to make a purchase of some actual merch. He doesn't want to be responsible for you giving him your last 5 bucks and now you can't eat for a day or can't get your cat some treats. Linus wants you to take care of yourself before you throw money at the screen.",
            "That's your takeaway? \n\n\nLook man, spend your money how you want, but his take on just throwing money at your screen just to give it to someone who's much better off is probably the coldest take Linus could ever have. ",
            "What a weird take to get from this.",
            "He did later talk about how a lot of a anger comes from misunderstanding. I think he was right.",
            "Based on the comments he made last week, he got the news earlier in the day Friday and was kinda struggling to keep it together during the show.\n\nHe also clarified that it was family, but not the wife or kids: close enough that it shook him, but not so close that he was going to take a week or more off.",
            "Yes, but it was mentioned right at the end of the show so plenty of people may have missed it.",
            "That's rough!\n\nLast week I assumed it would have been someone elderly in the family!",
            "Do you think it’s the same sister that was featured here? https://youtu.be/AOdp09SYhCc",
            "I fully understand that he wouldn't want to talk about it. \n\nIt's just the way he talked about the t-shirt made me wonder\n\nThis is coming from a place of concern",
            "Not American, but I had no problem sourcing a 3060 mobile chip in a desktop GPU recently, and they're actively sold on Aliexpress, so I doubt that. Pretty sure the export controls are sending high power compute or silicon making equipment to china, not the other way around",
            "It’s surprising people were surprised by the announced surprise",
            "they didn't post the time though.",
            "[deleted]",
            "Yes that is his whole point with that comment. If you can’t afford it save your money!",
            "[deleted]",
            "[deleted]",
            "I mean, that's more than enough to share. I hope Linus and his family is doing well.",
            "Based on his comments today, it seems like it was his older sister. Rest in peace.\n\nLoss is never easy, and everyone grieves differently. My heart goes out to Linus and the loved ones involved.",
            "he mentioned that the sister was older but got the driving license at the same time as him, but i think this is the younger sister, but i may be 100% wrong.\n\neither way, i would be a broken mess so...",
            "Could be",
            "I mean, today is my first day off since Monday *last* week (and I technically worked today, since I worked an overnight shift), so I haven't even had time to watch last WAN. Was very surprised when I saw the notification.",
            "To be fair, it's not like that would have mattered given the WAN show's rep for starting at it.",
            "He didn't say you can't, he said he doesn't want it. He can't tell you how to spend your money, and you can't tell him how to value what he gets.\n\nLitteraly all he is saying is that he doesn't need the money, and doesn't look down on anyone who doesn't want to give. Basically you're mad at him for not thinking he is owed our money, even if we cant afford it.\n\nWhat i will say is that if you frivolously give away money, yet struggle to put food on the table, you're an idiot. Especially if your giving it to litteral multi-millionairs with porsches.",
            "If you really just want to give the YouTuber a dollar, you still *can* leave a $1 super chat.",
            "spend your money the way you want, just realize these youtubers and such have no obligation to want it. if someone doesn't want to view comments on one platform they are free to do so.",
            "Stay Poor but be happy find your balance",
            "you only get happy from donating money to millionaires? that’s a weird existence, man",
            "He did mention the shirt he is wearing was made by his sister and asked if it would be appropriate for some later event.",
            "That would have made me take a few days off. I hope he isn’t too obsessed with the algorithm to take time to grieve.",
            "Linus calls Bella his little sister at the beginning so it’s probably not her.",
            "Still a surprise",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Yeah, he said \"that's the memorial I'm going to today\" after sharing the story, so I'm guessing that's who it was. Feel bad for him. Wouldn't matter *who* in his family, it would suck, but I've got a bunch of sisters so it hits close for me.",
            "I gather his one of his sisters passed away, that's rough.",
            "You have to remember that the WAN show is largely just a way for Linus and Luke to hang out and talk tech as friends, they just do it with an audience. I'm sure he actually appreciated the break from thinking about things that WAN would have given him.",
            "Sometimes you need a break in your own mind about grieving, work can help.\nputting off the grieving process too long would probably be worse in the long run",
            "Maybe that's the reason there was only 1 LTT this week. They might be saving up because Linus might need some time.",
            "I can’t imagine doing a podcast the morning of my sister’s funeral. But different people grieve in different ways…",
            "yeah, likely someone we never seen before.",
            "If your entertainment budget can't handle the $10, then maybe you need to save for a couple paychecks.",
            "If your entertainment budget is that low then you seriously need to re-evaluate your financial situation and Linus doesn't want to contribute to your issues. Hence he will not facilitate or reward taking your money.",
            "If you’re that poor there’s probably still needs to be met when you get there. I’ve been there, you can go a couple years without entertainment and fun if you have a plan.",
            "are you really trying to force your choice on someone else right now. he has said multiple times he doesn't support there chat system.",
            "Lol your ego is so hurt.",
            "Platforms make the majority of their revenue from ads, not donations... And most pple can enjoy their creator's content without donating... Unless you're saying you get sole pleasure from just the act of donating? If that's the case, then, heck dude, give your money to me instead lol",
            "Yeah, it would seem to be his older sister (so not Bella who appeared in a video a couple of years ago). I hope all goes as well as it can for the family later.",
            "No one would fault him for taking a break from the wan show",
            "I hope he feels better. ",
            "Makes me think of Wierd Al doing a concert the day after learning both his parents had died unexpectedly.",
            "[deleted]",
            "[deleted]",
            "AI linus? vtuber and 3d animated",
            "The \"streak\" is so fucking toxic.",
            "They have a streak and the refuse to end it. \n\nPeople were actually calling for it to end because they miss guest hosts.",
            "For a long time my entertainment budget was in the same ballpark - the difference was I saved up the budget for bigger stuff that could last me longer than subscription.\n\n\nTo this day a subscription or transient purchase is too much of a luxury for me - YouTube premium being the only one I have that's for entertainment.\n\n\n\nAnd spending on LTT has always been an extravagant deal for me.",
            "dude he wasn't. he just said he doesn't want you to give your money to him. never said not to give to it to other streamers or anyone else. i saw in a earlier comment you would subscribe to floatplane for bit, much better use of your money for the value if you enjoy the content. No shame in how you spend your money, it's your money after all, Do what makes you the most happy.",
            "Streak has been over for a while. Gamernexus killed it.\n\nEdit: \"iT wAS 7 dAyS lATE\"",
            "I've been going back and listening to older episodes and I go for the ones with guests hosts specifically. It's nice to have different views every so often.",
            "They have no streak. The streak ended back when they imploded from gamenexus video and they cancelled that weeks wan show.\n\nThey just said “its extra delayed wan show” to “continue the streak” and with that logic the streak wouldnt end no matter how many times they cancel it.",
            "Nahhhh, they were just 7 days late :p"
        ]
    }
}