{
    "Frequently Asked Questions 2.0": {
        "title": "Frequently Asked Questions 2.0",
        "score": 51,
        "url": "https://www.reddit.com/r/linux_gaming/wiki/faq",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Here you go: \n\n# [Frequently Asked Questions 2.0](https://old.reddit.com/r/linux_gaming/wiki/faq) \n\n…expanded from the previous incarnation and wikified for convenience. \n\nStill a work in progress, naturally… thinking about putting up some “under construction” GIFs. \n\n**This thread isn’t meant for asking questions!** (though it’s always possible someone might respond)\n\nSuggestions? Please post them here! ↓↓↓",
            "Steam doesn't create proton prefix for some games in the ./local/share/steam/steamapps/compatdata/ directory\n\nFor example Disco elysium appid 548430 folder is non existent in that directory and steam doesn't even launch the game, it just stops after 2 seconds.\n\nDeep rock galactic works fine and has a folder 548430 in the above directory.\n\nAny ideas how to force steam to generate the prefix files?\n\nTried reinstalling the game, moving it to different drive, different proton versions, some launch command I found googling and nothing works.\n\nI can run the Disco elyisum exe thought Wine command and it launches fine.\n\n  \nEdit: In case anyone is having the same issue. Solution was that the other drive weren't EXT4 type. When I formatted the SSD to that type, proton worked as usual.",
            "Game closes within 1 sec as I hit play in lutris, what to do, using wine 7.2",
            "I just got nvidia drivers working on Fedora 40 Plasma 6 using the rpmfusion guide.\nTheres a lot of flickering in apps etc, when can i expect any kind of update to help this?\n\nWill it be Fedora updates or Nvidia updates i should watch out for?\n\nAlso any fixes?",
            "Is there an explanation why some game runs better on linux? I tried Alan Wake 2 on windows, encounter frequent texture popping switching between mind place, map, real world. Viewing notes or opening supply cache, I have to wait for the textures to properly load for few seconds. Sometimes, the textures simply won't load properly.\n\nBut on Linux, I didn't encounter this problem. The game load time also faster. The character dialogues during cutscene/loading screen is in sync perfectly - on windows the dialogues somehow was out of sync. Running on Fedora 40, RX7600.",
            "I tried very hard but just can't understand this part of FAQ 2.0:\n\n>Java  \n  \nJava exists.",
            "How do I combine the offline installer game files on gog to make the exe file game in linux? what tools will I need? I have wine, lutris, and nvidia proprietary drivers properly installed on fedora gnome.",
            "whats the difference between official/gnome/KDE versions of nobara? what do those even mean?",
            "how does EAC and all that realy work on linux. I get that its using a native EAC client but that deosnt work as good as the real one ofc, because it doesnt reach kernel level if im correct. So if i say im hwid banned on Fortnite by an example i would get kicked out of the game but if i install linux and go play there will i still get kicked by the same error as on windows? or can i play as usual again?",
            "Baldur's Gate 3 crashes within about a minute on wayland, but runs fine on x11, anyone got any clues?",
            "With Nvidia 555 adding explicit sync, does this mean gamescope-session is more of a viable thing on Nvidia now? I remember a lot of distros implying you can't use it unless you have AMD.",
            "I have a problem with Steam: the library/store pages work fine, but if I ever try to open the friends list Steam throws a tantrum and freezes up and eventually crashes, however only the \"interface\" bit of steam crashes, it loads back up in a new window right away. What could be the cause?",
            "I installed Proton GE, but I cannot find where I extract its contents to on steam. What folder do I need to find to make it a proton version?\n\nThank you in advance.",
            "When will Battlefield 2042, Call of Duty Modern Warfare (2019), FIFA 23 gonna work?",
            "You can get more info by right clicking the game in Lutris and selecting 'Show logs'",
            "just install [https://flathub.org/apps/ru.linux\\_gaming.PortProton](https://flathub.org/apps/ru.linux_gaming.PortProton)",
            "I have had similar problems in Mint, in my case I solved it by changing the kernel and using another version of the drivers.",
            "For some games Linux works better due to more efficient memory allocations, or better tunability of memory allocation. However this is more likely to effect simulation games like Factorio or Cities: Skylines.\n\nAnother possibility: Sometimes Linux users and developers just care more, that is the programmer responsible for the linux port might have made more effort to fix issues, and the linux users make better issue reports.\n\nAnother possibility and the one responsible in this case I would guess: bloatware on windows interfering with the game or general system configuration problems. While popular perception is that Windows \"just works\" and Linux distros need more tweaking, this is not necessarily true, in fact generally you're more likely to have to uninstall bloatware and install drivers on Windows, while a Linux distro is more likely to be configured to just work. Also package managers on Linux can help ensure everything works together while software management on Windows is much weaker.",
            "Oh, sorry, that’s just placeholder text right now.",
            "You don't have to combine them. Just run the first one and it'll find the .bin files (provided they are in the same directory) and extract the game to a location of your choosing. Works just fine with Wine.\n\nIf you just want to unpack the game without running the installer, you can use a tool called \"innoextract\".",
            "In Lutris:\n\nClick top left + button\n\nInstall a Windows Game from an executable\n\nType in game name, you can find the game name from the lutris website so you get the logo\n\nClick Install\n\nClick Install again\n\nSelect your install directory or leave it as default and then click continue\n\nWhen it asks for a setup source file, find the setup.exe file from your GOG files\n\nFollow the rest of the instructions and feel free to leave everything to default\n\nIt should just launch the regular gog game installer, once that's finished, launch from Lutris and enjoy!\n\n  \nLet me know if you have any more questions",
            "Gnome and KDE are desktop environments.  This is essentially the GUI for the OS and the suite of system applications that support config and various utilities.\n\nMany distros come in various DE options to accommodate user preferences.  \"Official\" probably means that is the default option that gets the most support.",
            "Probably never. They don't care about Linux gamers, easy as that",
            "~~Ah thanks, i'll try the drivers first , first real linux system and everything else is A++, so annying haha~~\n\nI got the glitches fixed - had to Fedora enable test Updates in the Discover and it comes with Plasma 6.0.5 and its flicker free!!\n\nArticle here - https://9to5linux.com/kde-plasma-6-1-beta-released-with-explicit-sync-support-on-wayland",
            "A little late but additionally I think Windows has a fixed FPS on everything and Linux doesn't.",
            "Maybe Linux people can make a way to mimick the NT kernel?",
            "Why would they want to?",
            "To play Kernel based Anti-Cheat games, duh.",
            "Kernel based anti cheats will never exist in Linux. just dual boot windows if u want to play that crap so bad",
            "Why is that? I mean it could be open-source and look at the codes and shit. And close it when you want.",
            "yeah good luck getting anti-cheats developers to open source their cheats 🤣🤣🤣🤣 that defeats the whole purpose of anti-cheats.\n\nand I say that they won't ever exist in Linux is because kernel level anti-cheats are... well... Kernel level. They're ring 0 basically. You could call them spyware (i.e. valorant's anti-cheat) because they run with your system and monitor everything you do on your system.",
            "I'm sure it could be done, but no one seems interested in doing it because it's such a terrible idea.\n\nEven if someone made it I can't see it getting accepted into the kernel or even into distros' repos, because it's such an obvious security hole (both in terms of being surveiled and getting hacked), so it'd likely have to be installed very manually.\n\nI know the responses you've been getting are a bit dismissive but they're not wrong. It's just such a *dumb* idea - totally disproportionate and inappropriate to the problem - that no one seems willing to do it.\n\nAnd honestly I'm glad of that, as I think others are. Glad that we draw a line where Windows should but doesn't.",
            "It's gonna be like Wine. You will close it after you done with the game.",
            "I'm not sure that it's possible to do it that way. I'm not saying it's *not*, this is beyond my knowledge. But if it were, then presumably you could just emulate it on Windows too, which would negate the whole thing."
        ]
    },
    "Getting started: The monthly-ish distro/desktop thread!": {
        "title": "Getting started: The monthly-ish distro/desktop thread!",
        "score": 17,
        "url": "https://www.reddit.com/r/linux_gaming/comments/1ddap0j/getting_started_the_monthlyish_distrodesktop/",
        "content": "Welcome to the newbie advice thread!\n\n If you’ve read the FAQ and still have questions like “Should I switch to Linux?”, \n“Which distro should I install?”, or “Which desktop environment is best for gaming?” — this is where to ask them.\n\nPlease sort by “new” so new questions can get a chance to be seen.",
        "num_comments": 51,
        "comments": [
            "installing Bazzite this weekend on my desktop. pretty confident, but I'm curious if people have a checklist or something that they like to run thru to make sure that a fresh install is working properly and try to catch any issues early on instead of in the middle of actually using it.\n\ncompletely unrelated to gaming, but any RDP client suggestions? that's the piece of the puzzle that I'm the least sure about. I'd be okay with keeping a Windows partition for just that purpose if needed since it only comes up a handful of times per year at my current job.\n\n**EDIT:** still haven't attempted RDP yet, but gaming on Bazzite has been nearly flawless right out of the box. super impressed so far. still need to tweak and tune KDE, but I think I'll shed the Windows dual boot as soon as those new nvidia drivers are official (assuming that fixes Discord screen sharing).",
            "Absolutely done with microsoft so I'm gonna dive straight into linux. I've prepared everything and I feel completely ready to switch, but I'm still not too sure how to. I've got two PCs with VERY different use cases so I'd assume I would need different distros but some people have recommended to use the same for both? \n\nMy desktop is where I usually game but I do some video rendering/audio editing on it every now and then because of it's beefy cpu/gpu (amd). I've been thinking of installing either Bazzite or Nobara as I've heard those are pretty good. \n\nWhile it has a really good 13th gen i7, I mostly use my laptop to read articles, watch videos and write notes, not that much really. I've seen that mint is usually recommended for cases like this, specially because I'm not a programmer.\n\nDo these seem like good distros to pick? Or should I just do something like mint on both? Maybe once I know more about linux I'll give arch a try too, but I don't think it'd be the best idea right now.",
            "I'm considering switching to Linux, but I have a couple of concerns:  \n1- Is there a lot of messing around to try and get games to work, practically speaking? I wanna be able to just play whatever game in my steam library.  \n2- I heard having an Nvidia GPU isn't great for Linux. Is that better now? I have a 3050, and I'm curious whether people have figured out the drivers for the card already if Nvidia hasn't cooperated yet.",
            "Not sure this belongs here, but. Just upgraded from Fedora 38 to Fedora 40. Booted up Overwatch 2 installed via Steam from a flatpak. Before, it worked fine. Now, it is extremely laggy - 30s FPS at best, teens when there is action, and what feels like huge input lag. Any idea what this might be, or how to diagnose or fix it?\n\nI thought it might be cached shaders, so i tried \"clear download cache\" in Steam, but that didn't help. I'm not sure this actually clears cached shaders though. I haven't seen fossilize_replay running at any point.\n\nI'm on a Thinkpad with discrete graphics, and i've configured it to always use them, never the integrated graphics. glxinfo tells me \"OpenGL renderer string: NVIDIA GeForce GTX 1650 Ti with Max-Q Design/PCIe/SSE2\". I'm using Cinnamon for a desktop; XDG_SESSION_TYPE is x11.\n\nEDIT: Not sure this is gaming specific. Just using a browser feels sluggish. For my own reference, in Firefox:\n\n* [Speedometer 3.0](https://browserbench.org/Speedometer3.0/): 8.78 ± 1.1\n* [MotionMark 1.3](https://browserbench.org/MotionMark1.3/): 235.46 ± 9.70% @ 60fps\n\nMeanwhile, on my Pixel 7a, in Firefox for Android:\n\n* Speedometer 3.0: 6.93 ± 0.39\n* MotionMark 1.3: 443.99 ± 19.77% @ 60 fps\n\nI would say that is pretty sus.\n\nHowever:\n\n* Unigine Heaven 4.0: [62.41 fps](https://openbenchmarking.org/result/2406190-NE-PHORONIXT84)\n\nIf i'm reading their stats right, that's bang in line with a couple of other GTX 1650 results (although those aren't GTX 1650 Ti).\n\nRunning the benchmarks on the same hardware, but booted into Ubuntu 20.04.6:\n\n* Speedometer 3.0: 3.80 ± 0.25\n* MotionMark 1.3: 706.38 ± 3.02% @ 60fps\n* Unigine Heaven 4.0: [62.4649 ± 0.35% fps](https://openbenchmarking.org/result/2406203-NE-UNIGINEHE96)\n\nOffice desktop (Ubuntu 22.04.4, beefy hardware, running in a half-screen window):\n\n* Speedometer 3.0: 4.62 ± 0.22\n* MotionMark 1.3: 692.31 ± 3.38% @ 60fps\n* Unigine Heaven 4.0: [29.4049 ± 0.88% fps](https://openbenchmarking.org/result/2406207-NE-FILE5720098)",
            "i am currently using ubuntu 23.10 as my main OS, but its getting to to point where i should probably do a clean install and im thinking about maybe swapping to a different distro. i have had a tinker around with endeavor and it does seem interesting. so what distro would you recommend to a intermediate skill level user for gaming and day to day usage",
            "I run a RTX 3080, and plan on gaming on a 4k TV @ 60FPS with Vsync (or Fast sync, if that's available?) \n\n1. I've heard CachyOS is the \"best\" in terms of performance/optimization/input lag. Would it be completely foolish to jump into CachyOS, with no experience in Arch or Arch-based distros? \n\n2. How tedious is it to take a base distribution, such as Fedora or Debian, and optimize it for gaming? If I install a custom kernel, how difficult/annoying is it to keep the kernel up-to-date, and set as the default? And could it lead to system breakage when the distro updates?\n\n3. If I want to use Wayland, should I wait for the 555 drivers to go into stable?\n\nThanks for any help.",
            "I used to daily drive Linux between about 2006 - 2014, usually Kubuntu, after which I mostly switched to W7 tho I kept using some Linux and BSD distros in a VM. Not for a while tho, since I've not had a PC of my own for the last few years. Occasionally using Termux on Android.\n\nMy favourite DEs were KDE3/Trinity and LXDE, usually with OpenBox tacked on. I don't like using cli if I can avoid it, tho it's fine when I need something specific. I like the layout style of Win9x with important stuff in the corners and in the bottom. The less transparency and tacky effects, the better. I just want to use stuff without much tinkering or distractions, but still want to set up stuff my way.\n\nI've not kept in touch. I don't quite understand what docker is or what installation method is preferred these days. I keep hearing about flatpaks and how the opinion on them varies.\n\nI used to use Wine extensively, incl. maintaining some apps. But I see that the Wine site hasn't changed in 20 years, not quite sure what state development is at... I hear Proton is all the rage these days? I'm not too obsessed with PC gaming, but I'd like to revisit some of my oldies, up to 2010-ish. In particular I wouldn't mind using a steering wheel (haven't picked up one yet) for racing.\n\nAlso, I don't and won't use Steam or anything with DRM. Will use my discs or stuff from Gog.\n\nSo where do I begin again? I hear Fedora is the most popular, but it seems a tad different from Ubuntu (tho I'm sure that has changed a lot in the last decade). And what about the other developments I've missed?\n\nEd: Also, what's the preferred boot manager these days, still GRUB? Is there any major difference between distros when it comes to hardware compatibility? And just wondering, how's FreeBSD/OpenBSD, is anyone using those as a user system?\n\nThanks.",
            "Which distribution do you recommend for primarily playing games on Steam and _treasure from sailing the high seas_?",
            "What's the best distro for an old laptop with some old i3 processor and integrated intel graphics that's too slow for modern windows? I want to play some older games on it at lower settings, and do stuff like Youtube",
            "I have a Steam Deck, and would like to give Linux a try on my Desktop PC, Steam-specific customizations aside what Distro will be closest to the Steam Deck Desktop mode, so that things I learn to do in one machine (mostly) work on the other? I'm thinking Endeavour OS with KDE",
            "Hey, i'm interested in a good budget laptop that works with linux and can support basic gaming. I play a lot of VN and the most demanding game i play is Yakuza.",
            "When I install Pop OS will it install Linux versions of previous software I had or will I need to reinstall everything?",
            "Hi, I am currently using Linux mint on my one of my setups. I mainly play Dota, so it's very smooth, maybe even better than Windows. But now I want to install a different distro for my other setup which I use on weekends, and probably play more games. I want to experience Wayland (and maybe also KDE, because I wanna tryout the wallpaper engine plugin). I heard Fedora was good, but I wanna hear your recommendations.\n\nNote: I have the GSX 1200 soundcard, I managed to get it running on Pulseaudio on mint, but had troubles with pipewire on Bazzite.",
            "remmina",
            "I quite liked the Thincast client when I used it, is a lot more feature complete than Remmina IMO. Shame it's only in snap and flathub.",
            "You might need to give something like [Vesktop](https://flathub.org/apps/dev.vencord.Vesktop) a try regarding Discord screen sharing. The official Linux version of Discord doesn't stream audio and there doesn't seem to be any public statements on when (if ever) it will be added, while community clients like Vesktop have workarounds for getting it mostly working. It can still be a little finnicky but it's worth a try if screen sharing really matters to you!",
            "I am assuming that based on you mentioning Nobara and Bazzite you are interested in gaming? Honestly, you can do pretty much anything on just about any distro. I would ask you two major questions; Are you pretty tech-savy? Are you wanting stability or the newest of the newest packages?\n\nIf you are pretty tech-savy and want stability I would recommend **Debian.** It is tried and true and been going strong for 30ish years. Debian gives great stability but if you have a super new GPU (like I do) you might run into issue. Debian offers you free reign to install and tinker to your heart's desire. \n\nIf you want stability but just want something that is \"windows-like\" and just works out of the box without tinkering a whole lot, I would go with **Linux Mint** as you mentioned. \n\nIf you want or need newer packages, you can go with **Nobara**. Its a good distro and GE does a great job. The issue that I have with Nobara is that its based on Fedora and uses DNF. \n\nIf you want newer packages but don't want to go crazy trying to learn Arch, you can always use something like **EndeavourOS.** It will allow you to use arch without having to get too worried about Arch. \n\n  \nI switched about 2 years ago and the one thing that I can teach you is that 90% of distros is all personal preference. You are going to be able to do 99.9% of the same stuff on Nobara/Bazzite that you would on Debian, Arch, Linux Mint, Ubuntu, etc. Tinker around and find something that you like. \n\nPS. One thing to remember as well, if you like a distro but not the main Desktop Environment that it comes with you can always download a different one. This isn't Windows. Welcome to the Penguin.",
            "I can't stress this enough: as a brand-new user, pick Ubuntu or an Ubuntu-based distribution. Pretty much all Linux software is available for/supported on Ubuntu. Support on Fedora-based distros is much worse. Stay AWAY from Arch, Manjaro, Gentoo, etc.\n\nThere are a few main desktop environments: GNOME, Cinnamon, KDE Plasma. There are definitely others, but these are the main 3. Look up each one and decide which DE you want to use. Cinnamon is great for being good out of the box at a Windows-like experience. KDE and GNOME are probably more customizable. KDE is pretty Windows-like. GNOME is taking things in a different direction, but has a lot of extensions to completely change the interface. I use GNOME but with several extensions to give a Windows-like experience, which I would not recommend for a beginner.\n\nAfter picking a DE, select a POPULAR distro that uses one of those by default. I.e. Ubuntu or PopOS for GNOME, Linux Mint for Cinnamon, Kubuntu for KDE. There are a million choices out there, but you won't go wrong with a popular Ubuntu-based distro.\n\nI would strongly recommend picking the same distro for both machines. No need to mix it up. Laptop driver support is way better than it used to be, but some hardware is not supported well. Do some research to make sure your laptop is well-supported under Linux, or just try it out with a dual-boot setup first.\n\nGood luck!",
            "Proceed with caution with Nobara - as u/crosseyedCOBRA says, its based on Fedora and that's not nearly as popular as debian/ubuntu based distros, which means support is less.\n\nIt's also maintained by a very small team, there will be no support, you'll be on your own entirely - although you can use discord to ask for help.\n\nThe distro you pick is such a personal choice, I've tried so many of them, it's crazy.\n\nI used Pop\\_Os! for a while, but found it too opinionated and customised, so I settled on Mint.\n\nYou really can't go wrong with Mint and the Cinnamon desktop - it's crazy easy to use, if all you want to do is get gaming with Linux.\n\nThere's TONS of support for it, because it's so popular.\n\nGaming with Steam is as simple as installing drivers, via the Mint driver manager, installing Steam and optionally, setting compatibility for each game - something which Steam is starting to do automatically now.\n\nWhatever you do, go for the most popular distro if this is your first time.\n\nAvoid Debian unless you want a LOT of extra work getting the latest packages.\n\nYes, it is possible to get up and running with the grandaddy of Ubuntu, but there's extra steps. \n\nTry Mint first - I can see you are already leaning that way, give it a shot.\n\nThe only thing you'll lose is some time and you may have fun doing it anyway.\n\nIt'll take you I reckon 90 minutes tops to have your first game up and running, from downloading the ISO, to installing it, to getting the drivers setup and steam installed.",
            "1- Many, or most, Windows Steam games work right away with Steam Play/Proton activated; some required a different Proton version; some require more tinkering than that. You can check on https://www.protondb.com and https://areweanticheatyet.com and see what experiences people have had with the games important to you. As for me, I just expect stuff to work at this point and don’t bother investigating in advance – but it’s probably worth checking when it comes to AAA games with fussy extra launchers and anticheat complications.\n\n2- I haven’t used Nvidia in a while, but it shouldn’t be hard to install the drivers through whatever your distro’s driver/software manager thingie is called. It’s *less* convenient than with AMD and is or at least used to be less functional with Wayland than with Xorg (the “traditional” display server; Wayland is a newer display protocol that enables features like running multiple monitors with different DPI scales or different refresh rates… though it has some drawbacks as well until all is ironed out; ymmv).",
            "I switched to Bazzite this weekend and it's been incredibly low fuss. I have an ancient GTX 970 and had no issues with the Nvidia driver included with Bazzite except for some rare flickering in inactive apps and being unable to screen share in Discord. (edit: using X11 instead of Wayland seems to be the solution for both of these until the new nvidia drivers come around)\n\ndefinitely check your main game(s) on protondb and/or areweanticheatyet before taking the plunge. you've got nothing to lose if you have some space for an extra partition on your hard drive to give linux gaming a try.",
            "Me too",
            "1. yeah, probly don't do Arch as a first distro unless you're willing to reinstall\\* and treat Linux as a hobby to be learned as you go.\n2. with Debian honestly don't bother. even if you install a custom kernel and manually install Nvidia drivers there's still other stuff in the system that is just getting more and more dated by the day. Debian is on a two year release cycle. people will bring up Debian Testing and Sid.. but like.. why bother. For Fedora there is Nobara, which is more or less a preconfigured Fedora gaming distro. it's debatable whether or not Fedora & Nobara are good beginner distros. (if you try Nobara update with the update app, not the terminal or software store.\n3. people will argue, but yes. you want to be on 555 (or newer) with wayland on nvidia.\n\n&#x200B;\n\n\\* keep in mind that reinstalling Linux isn't a big deal. you can install your /home directory on a separate partition and reinstall the system to the system partition and keep your stuff. the pain in the ass is reinstalling your apps and signing into everything.\n\nthere's also a program called Timeshift that does more or less what the name implies. my current solution is dual booting debian and cachyOS. i have a full Rsync backup of my cachy install on a separate drive, so that if cachy dies and i don't feel like fixing it i can just boot into debian and apply the backup. ez.\n\n&#x200B;\n\nall that said, my advice is to just install Ubuntu or an Ubuntu based distro until you've wrapped your head around how linux works in general. it's not the most performant but it's reliable, highly compatible and there's lots of support.\n\nanother thing to keep in mind is a lot of articles out there are outdated or just outright bad advice. beware the third party repo, ppas and .debs. flatpak is your friend.",
            "1. CachyOS is *nice*, but it wouldn't be my first recommendation. If you want to go with an Arch distro, I would suggest Garuda. The forums are responsive, and up front it takes you through an installer that offers so many different tools that you might be looking for.\n\n2. It can be incredibly tedious to do, depending on where you start. If it's base Fedora or Debian, it may be a bit uphill. Consider something like [Bazzite](https://bazzite.gg), it is Fedora with all of the tweaks that Valve made for SteamOS.\n\n3. Probably, leaning towards yes.",
            "Wine is still very much supported they just don't like updating their site apparently. \n\nAs for things like gog you would be using lutris, bottles or heroic games launcher since they're really nice GUI front ends. \n\nLogitech steering wheels work out of the box with no issues. \n\nDistro seemingly doesn't matter much these days since flatpaks are a thing so you can get the latest software that way so I would use what your comfortable with so if that's Ubuntu then go for it. I myself enjoy Opensuse & that's been my main distro for awhile but I wouldn't suggest it to a new or returning Linux user. \n\nGrub is mostly the default still & BSD is good & getting better but still not as good as Linux in terms of compatibility. Look into ghostBSD as it's a great beginner BSD.",
            "Things have moved on MASSIVELY since 2014 - you'll be so pleasantly surprised.\n\nJust download a popular Ubuntu based distro, get yourself setup with Steam and some games and take it from there.\n\nValve have nailed things in terms of simplicity - as have the maintainers of popular distro's. \n\nIt's way easier than it used to be - I'm totally an OG on this, my first Linux experience was RedHat 4.2 in 1996.\n\nNow I can't be bothered hitting my head against desks and brickwalls - the easier the better - the problem for most people who don't want to be compiling kernels for obscure hardware these days, is which distro to pick - there's frikkin' thousands of them.\n\n90% of them are just a riff on Debian or the more popular Ubuntu :D",
            "https://bazzite.gg\n\n\nSteam executables are preferred, run with steam",
            "hmm.... i would argue Nobara or Bazzite, depending on which one of these vibes best with you - but its more of a preference thing than anything. they have both their Pros/Cons which i personally weight as \"more pros than cons\".",
            "You could try OpenSuse Tumbleweed with the LXQt desktop environment. The UI will feel old, but it's the lightest DE I can think of. There's also XFCE, but it's a bit heavier (it uses a few hundred megabytes of RAM more).\n\nNote: If you are or will become proficient with the Linux terminal, you can also try a window manager (e.g., i3). A window manager is not a desktop environment but a component that opens and arranges windows. That would be the lightest option.",
            "Endeavour sounds like a good choice to me. \n\nYou could also take a look at Garuda Linux, an Arch-based “gaming” distro (also with a KDE flavour). Never used it myself, though.",
            "Hey, thank you for such a detailed response.\n\n1. I'm cool with learning how to keep proper backups, but yeah, it's probably smarter to get into the general flow of using Linux itself before I commit to something bleeding-edge like Arch.\n2. Gotcha. I knew Debian ran with dated packages, but didn't know it was that bad. I've been told that if you're gonna use Sid, you might as well just learn Arch or another rolling-release distro. Thank you for the tip about Nobara.\n3. I figured. I've been looking at feedback of 555 and it seems like there's still some kinks to be worked out, so I'll likely wait for the stable release. From what I've seen, it's not really worth the headaches that come with using the previous drivers.\n\nI've got a couple drives in my PC - putting a backup partition on my secondary and keeping a live distro on a USB stick/external drive should function just the same, right? I'm assuming the important part is just being able to access and install the backup from a working environment.\n\nI've considered various flavors of Ubuntu, but I've heard terrible things about Snap - especially the Snap version of Steam, and some problems it can have compared to the non-Snap version.  I've also heard anecdotes about Ubuntu potentially replacing non-Snap programs with the Snap versions. Don't know if that's true - as you said, a lot of information isn't so reliable.\n\nMint seems to have all the benefits of Ubuntu without as many downsides, so I'll probably give it or Nobara a try, unless I feel like setting up a proper physical backup and learning CachyOS the hard way.\n\nAgain, thanks for the thorough response, I really appreciate it.",
            "[deleted]",
            "Thanks. Looks like Linux is still in a good place. Never really had any problems with it as long as I took care picking the right hardware.\n\nI was mostly annoyed with how some distros and DEs kept changing things, like KDE3 to 4 was a disaster and got me scrambling for the next few years.\n\nI also really enjoyed FreeBSD, even in a VM it was stupidly fast, I just never had the courage to install it on a physical disc due to the weird (to me) file system and various limitations.\n\nAny idea if Logitech wheels are good within Wine too? Like if a game only uses Dinput or Xinput or supports the wheel model directly, will that work with Force Feedback and stuff? I found some guides/opinions, but mostly regarding native games.",
            "Yea I was looking at some stuff yesterday and I'll probably just stick with Ubuntu, I still have muscle memory for apt-get and such...\n\nYou know what confuses me... As I said, I was using Linux for quite a while and never really had any major problems, maybe with the exception of one very particular sound card. It was honestly uncanny how everything just worked, it was almost disappointing.\n\nMy first experience was when I had a flu in 2006, so I had a week to kill. So I figured I'll check out this Linux thing, maybe I'll never get anywhere and just spend a week bashing my head, whatever, I might learn something. So I borrowed a random laptop from work, burned an Ubuntu Live CD and ran it on that laptop... And everything just worked?! But like, everything. Display, sound, network, printer, Bluetooth phone features over USB... Everything. Just needed 3 clicks to install proprietary drivers for something and maybe Flash or whatever that was at the time. This was still the XP-Vista era when one needed discs with drivers or a web dive for everything  Anyway I installed the thing, set up everything I needed and was done in a day or two. No weird geekery. Eventually I learned to do more oddball things, but I never had any significant problems finding solutions for everything I needed, even when I fucked something up. A simple web search would always get me the answers I needed, with steps how to do even the more complex system stuff.\n\nNo more difficult then using cmd and regedit on Windows, and more convenient with the centralised package manager and so many options.\n\nAnd yet, whenever even the fairly experienced techies try Linux *these days*, they almost always bitch how they can't find this or that or they need to paste a command into cli or how things are named differently or whatever... Like Linus Tech Tips for example, not that I think too highly of them but I wouldn't say they're complete morons.\n\nAnd I tend to see this everywhere, first semblance of something different and they bitch and give up; yet they accept all the bullshit and changes Microsoft/Apple/Google throw at them.\n\nAnyway, so since I've not had a PC of my own for a while and am kinda out of the loop, these stories made me wonder if things have gotten worse... But I guess people are rather just dumb.\n\nAnyway anyway. My plan is to buy a small factor PC and a used laptop, and obviously I'll make sure beforehand that everything I get is Linux compatible.",
            "while both are based on fedora, bazzite is based on fedora atomic, it's an immutable os which means it's root file system is read only.",
            "Sadly I never heard about them, but I'll go and look up them.  \nMy original idea was Debian, and [people said it should be fine](https://www.reddit.com/r/debian/s/krE3H0kWjH), which should be with Steam and maybe Proton, but I'm quite unsure about the programs from the _high seas_. I used Ubuntu for a brief period of time with Steam with great success, but I don't have experience with the _unconventional methods_. Do you think it would be as seamless as on Windows? Or should I set up dual boot just to be sure? Or does Nobara and Bazzite have something unique/special in this regard?",
            "Ah it's for my little brother to play games and watch youtube actually, so terminal only is a no go. I appreciate the Opensuse tumbleweed suggestion though, I'll check it out",
            ">I've got a couple drives in my PC - putting a backup partition on my secondary and keeping a live distro on a USB stick/external drive should function just the same, right? I'm assuming the important part is just being able to access and install the backup from a working environment.\n\nsure. that can work.\n\nMint isn't a good choice for gaming. to be more specific Cinnamon isn't a good choice for gaming. KDE Plasma is best for gaming but Gnome is a close second. you want one of those two. know that the compositor needs to be manually disabled in Plasma x11 for games and sometimes video to avoid stutter. Gnome disables it automatically.\n\n  \nusing Linux for general use / gaming isn't really outright hard, it's just the sheer amount of crap you need to be aware of to have a good experience that seems like a lot at the start.",
            "Base Ubuntu is okay if you remove snap from it and use the official steam installer which is what I personally run (I've been running ubuntu for like 15 years so didn't feel like hopping distros when those changes came around) - granted that requires a little manual tinkering (and probably some upkeep whenever the next distro update comes around to remove it again) so it's not so much easier than just using stuff like nobara anyhow. (Though if you like KDE Kubuntu is still on the older KDE 5 version until the next release in october .)\n\nMain downside with Ubuntu derivatives like Pop!, tuxedo or Mint for gaming is that they are based on the long term release of Ubuntu only so the base system tend to get a bit outdated, especially right now since they are on a release from 2 years ago and 2-3 months before updating to the one from this year. They do get some updated, more so Pop! than mint but it can be worth to manually update kernel/drivers depending on system if you use them. (This might change for Pop! Os once the next version is released later this year.)",
            "Is gamescope working on NVIDIA? I wasn't aware if this had changed, but that would be a requirement for the gaming mode.\n\nAs for KDE, Bazzite allows you to choose GNOME as an option as well! Budgie is currently being worked on to be added as a 3rd option.",
            "I have a Logitech wheel but never used it through wine just steam.",
            "KDE3 -> 4 was a disaster indeed. But ever since plasma 5 and now 6 it's probably the best complete DE to use. Excellent defaults, works so good with games and overall very good experience.   \n\n\nIf you are quite experienced with Linux (seems like it given your description, I would suggest Arch@KDE.",
            "debian will be fine, but bazzite for example has an option to use the pc like a steam deck. it has steam, drivers, and everything you need already setup, including things like lutris (last time i checked) where you can just run (or install) your treasure from the high seas.",
            "Just installed bazzite last week, but I'm a relative newbie to Linux outside of messing around with Ubuntu 11 years ago so keep that in mind. Your second use case is still on my list of things to do (my partners one of those weird Sims 4 fanatics and finally switched to pc to avoid the crazy DLC expense) and from what I've looked in to so far it seems to be no more or less complicated than any other distro, you do the same as you would on windows but inside lutris or similar.",
            "[deleted]",
            "Oh right, I still haven't decided with which distro to start again. Ugh. What do you like about Arch?",
            "Yes, and the Deck UI that it boots into is the same one used on the Steam Deck that Valve developed. That requires gamescope support. If they need it as an HTPC, they can set it up so that once in their DE of choice, Steam will automatically launch into Big Picture Mode. Outside of that, there's no real way to get the Steam Deck experience with an NVIDIA GPU anywhere to my knowledge.\n\nI'm sorry you're not having the best experience with Bazzite, a fair amount of distros (Bazzite included) come with certain tweaks that the devs like/believe should be in the DE by default that can sometimes break the experience for some users.",
            "Simply the way it is. Repos, constantly updated (rolling release) and the fact I'm using it for so long that it's natural for me. \n\nAnd it turns out it's quite good for gaming, when even Valve based their Steam Deck on Arch(SteamOS is Arch based) + KDE :)",
            "Arch wiki and community is also really good. You can find literally how to do anything on it.",
            "[deleted]",
            "Thanks. I'm myself curious what I'll end up with.",
            "That's also nice to know.",
            "Well I'll be damned, it does. I'd be curious to see if anyone has gotten it running, as I know ChimeraOS completely removed NVIDIA support due to it having performance issues with Gamescope. Supposedly it's looking good with driver 555(?), but I've yet to see or hear much. I haven't had an NVIDIA GPU in years, so I lack the hardware to test any of this."
        ]
    },
    "Any linux game recommendations for a 40mhz 486 machine with 28megs of ram ?": {
        "title": "Any linux game recommendations for a 40mhz 486 machine with 28megs of ram ?",
        "score": 84,
        "url": "https://www.youtube.com/watch?v=BvlpdACNTUU",
        "content": "",
        "num_comments": 80,
        "comments": [
            "doom",
            "28mb of RAM?\n\nWhat would you even DO with all that memory?!?!",
            "Rogue\n\nAs in \"Roguelike\"",
            "Nethack",
            "Doom, nethack, rogue",
            "Doom, Doom 2 and Quake 1 compiled against SVGAlib since no way in hell you're running display server on that thing.",
            "supaplex!",
            "Zork",
            "Neofetch",
            "Tetris ❤️\nbut what kind of tetris...",
            "I dreamed as a teenager of a 486 to upgrade my 8086 @8mhz , which could hardly run Ultima VII - The Black Gate",
            "nsnake",
            "Pacman",
            "Lucasarts adventure games.",
            "I really think MS-DOS or Windows 3.1 is the way to go here.",
            "Dungeon crawl.",
            "Heroes of might and magic, I have played it on 16MB",
            "[https://zdoom.org/downloads](https://zdoom.org/downloads)",
            "I'm disappointed that nobody has mentioned XBill.",
            "I wonder if it runs UQM.",
            "BatMUD",
            "Nethack (probably the original one).",
            "I'd install original ms-dos too",
            "Cities skyline 2 or DCS! \n\nNow seriously, back in the days I had a 486 too, I remember playing games like Prince of Persia, Doom, Lemmings, worms, Another World. I think DOS will be a better option to run these games than Linux. \n\nAs for Linux native game, perhaps openTTD could run. You may try it.",
            "Ancient Domains of Mystery",
            "bash2048",
            "Stunts",
            "OS2 Warp",
            "Bards Tale",
            "Quake 1",
            "I remember playing \"Under a killing moon\" on my mates 486 dx2 66. He had 16mb of RAM which was so sweet, he could run the game with the higher textures. Damn, those days were fun lol.",
            "Nethack",
            "Diablo2",
            "Stunt driver\nPrince of Persia\nThe broken sword\nLarry\nAlone in the dark 1,2 and 3\nKyrandia\nMonkey Island \nIndiana Jones and the fate of Atlantis.",
            "The original doom.  Or leisure suit Larry.",
            "Doom",
            "xsoldier, trek, koules, nethack, angband, empire",
            "Well now I need to know out of pure curiosity: does Proton work well with machines this old?",
            "Doom and monkey island",
            "If you'd still love to feel FOSS, I'd rather install FreeDOS...",
            "Rogue",
            "[Abuse](https://www.gamingonlinux.com/2023/11/building-a-retro-linux-gaming-computer-part-34-abusing-the-system/page=2/).\n\nIn fact, I think you'd like to read the entire [Building a Retro Linux Gaming Computer](https://www.gamingonlinux.com/2021/03/building-a-retro-linux-gaming-computer-part-1-dumpster-diving/) series.",
            "Wolfenstein",
            "Wolf3d",
            "Will openrct2 run on it?",
            "Rollercoaster Tycoon would be my first try. Not sure if it would work, but yeah.",
            "With DOSbox, you can run any number of old DOS games on such a machine.",
            "Cyberpunk 2077 /s",
            "I'd gut the interior, install a Pi4 then game on that.  Have a real sleeper.",
            "No !",
            "Obviously elden ring. The fact you have 28megs might just make the game easier.",
            "I think my calculator is more powerful than this...",
            "T/2 SDE linux actually. A distro built for very old architectures by René Rebé. Boot the installer off another IDE hard drive because it is kinda big and 486s don't yet boot off ATAPI DVDs or CDs for that matter \n\nOtherwise, an old version of Debian or something (notoriously hard to install).",
            "With a little bit of elbow grease you might be able to get crysis running on it",
            "Dwarf Fortress, OpenTTD, and of course the old school gems like Lemmings, Perhistorik, Wolfenstein, Roller Coaster Tycoon, Bomberman...",
            "This is the only correct answer.",
            "Doom has a number of total conversions and a ton of mods as well (Heretic, Hexen, etc etc). Should be interesting to see how many of them run. I'm guessing build engine might work as well.\n\nDescent recently went Open Source too right?",
            "Download more ram!",
            "Games and stuff",
            "Awesome suggestion, I will see see if open-supaplex will compile on i486.",
            "My 386 was having a terrible time running Full Throttle even though I had recently upgraded to 8 megabytes of ram from 4. My disappointment was immense.",
            "I don't think any Lucasarts adventure games were released for Linux and it's unclear ScummVM can run on the specs the OP mentioned.",
            "Stunt, test drive 3, Monkey Island, Heretic, Quake…\n\nI feel a teenager again!",
            "Dosbox needs X11\n\nBut you can try DOSEMU, it had tty mode, if I remember correctly.",
            "you're joking, right?",
            "Definitely not running dwarf fortress, pretty unlikely to run OpenTTD either.",
            "Pong? 🤣",
            "`40mhz 486` - means no descent :)",
            "Also Skyroads!!",
            "ScummVM (when stripped down) can run on Motorola 68000 systems like the Atari ST, which is quite a bit slower than this laptop.",
            "*I'm Guybrush Threepwood, a mighty pirate!*",
            "DOSBox can run a lot of games and a lot of those ran on 486, I can attest from my own childhood\n\nThe q is whether you can run DOSBox on Linux",
            "DOSbox runs just fine on Linux and many, many, many DOS games are now in the public domain and available free online.",
            "Not Prehistorik either, that game is a keyboard rage smashing trap and you can't easily replace ps/2 keyboards these days",
            "The OG “but can it run Doom?”",
            "Now that’s a name I haven’t heard in a long time",
            "> The q is whether you can run DOSBox on Linux\n\nOf course you can, but not on a real 486 (quoting its manpage, \"At present, dosbox run on a 1.7 Gigahertz PC is roughly the equivalent of a 25MHz 386 PC.\").",
            "Windows task manager port of doom.   \n  \nSomeone made the number of cores in windows task manager a 896 pixel display for doom and then made pics happen by spiking each core. Dude has a lot of patience to make this happen and a shit ton of cores apparently. \n\nhttps://preview.redd.it/k5d8w02qu38d1.png?width=640&format=png&auto=webp&s=e2278e7ef7fbdc3857f1a4e0cf23abd3d5a57880",
            "thanks, TIL",
            "https://preview.redd.it/a90m8uvzu38d1.png?width=640&format=png&auto=webp&s=ca976044ff3cca422e1543d362e0547061a9ba1c"
        ]
    },
    "Shadows: Awakening free on GOG( it's Gold on Proton)": {
        "title": "Shadows: Awakening free on GOG( it's Gold on Proton)",
        "score": 75,
        "url": "https://www.gog.com/en/game/shadows_awakening",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Cheers!",
            "Marvellous game too. Tom Baker's voice acting is excellent!",
            "Yeah, they're an interesting studio.  Their story guy is also interesting, haha.  Like the indie Chris Avellone.\n\nChris Bateman:\nhttps://onlyagame.typepad.com/\nhttps://blog.ihobo.com/\n\nI've been meaning to find time to make my way through Kult: Heretic Kingdoms before I tackle Shadows: Awakening though.",
            "Thanks mate.",
            "Thank you!",
            "Good looks, I collect ARPGs like rare trinkets",
            "r/suddenlycaralho ?",
            "You're welcome!",
            "No problem!"
        ]
    },
    "Linux gaming on the high end is frustrating": {
        "title": "Linux gaming on the high end is frustrating",
        "score": 24,
        "url": "https://www.reddit.com/r/linux_gaming/comments/1dlkymg/linux_gaming_on_the_high_end_is_frustrating/",
        "content": "A bit of a rant but nothing that's not been said here many times before. I've been PC gaming on computers for over 40 years, Windows PC for over 30 and ran my first Linux setup in 1997. I love PCs and PC gaming. \n\nBuilt my current main rig originally in January 2023 with a Linux drive in tow (currently Garuda) and have been running a Linux distro since the day I built it at least a couple of times a week with Windows 11 being the main host.\n\nI've been dealing constantly with the \"bUt MuH hARDware\" problem from the beginning with this rig like I have many times over the years with Linux on various devices. This past Tuesday I added second OLED QHD wing monitor to my main 4k screen, and under Garuda it was a disaster. Enabling HDR on both monitors consistently crashes the ENTIRE OS! \n\nThe most ironic thing about all of this is that I can ger PLENTY to games to work under Linux, even VR stuff. And it'll perform amazingly on this hardware. But then so much just flat out doesn't work easily, reliably or at all. Not that everything is perfect under Windows but at least the OLED HDR works?\n\nOf all of the hardware I've used over the years on PCs with both Linux and Windows, I am a bit shocked that something that's not even proprietary like HDR support has been so problematic on Linux for this long. I couldn't care less about anti-cheat working on Linux. But yeah, I'd like the $900 monitor I just bought to not crash the OS. \n\n",
        "num_comments": 133,
        "comments": [
            "Isn't HDR on Linux still experimental and relatively new?",
            "I understanding the frustration. I usually check the compatibility before buying my hardware.\n\nLike, a friend bought a HDR Samsung monitor to play a few games. If he sets Windows 11 with HDR, all the colors are washed out.\n\nIf he tries to boot with the HDR still set, both of his monitors stay black at the login screen...\n\nCompatibility is a bitch sometimes.\n\nSo, for my part I am just skipping HDR right now. \n\nGood luck with it. If you find a solution to your problem, tell us?",
            "Keep in mind HDR is news on Linux just now and the KDE implementation is currently in beta and will probably stay beta until 2025, so that might be the reason for such a bad experience.\n\nVR is also not as good as Windows even with ALVR, but Valve is constantly working on getting things a lot better.",
            "I’m not saying it will 100% fix your issues. But I have ran Arch for months now. I have a 5600X (currently) and a 7900 XTX. Arch works beautifully. There was an issue this month where I had to reinstall Plasma, but with the way Arch is built it was as simple as reinstalling and having it drop back into place, all configs and apps still present. I also have a HDR monitor, it works fine with what I want it to but I agree it’s very very finicky and experimental right now. You also need the VK_HDR_LAYER or something like that for video games and you need to enable it with commands and stuff. With plasma 6.1 there should be more support for hdr even in apps that don’t support it iirc.\n\nThe reason I say this is because the crashing appears to be more exclusive to Garuda. Why? My partner runs it, and recently there was an update so bad they needed to reinstall the entire OS. Same crashing issue and I saw someone even post about it. (I forgot about snapshots at the time). My arch install just didn’t experience it. There’s a lot of things that get preinstalled that may cause problems. Honestly it’s up to the person to decide what’s best.",
            "It sounds like you are trying to do cutting edge and experimental things.  Why are you not on Fedora?",
            "Jeez Luiz, just use whatever suits you. Who cares if it's Windows or Linux. Life's way too short.\n\nIf you don't want telemetry or ads or whatever Windows is throwing these days there are plenty of tools to disable those things, one that I know of is Chris Titus Debloat or something.",
            "Linux users know that they have to wait before to use latest high tech hardware someone write drivers. Did you verify your hardware was supported on Linux before buying it? Is Linux an OS that answers your needs? If not, use Windows.",
            "I got a 3440 x 1440 oled with HDR. I'm using a display port cable on AmD for both gpu and cpu. I think the only game I play constantly with HDR support is Ow2. I can see a minor difference. \n\nU using display port cable and what gpu you using ?",
            "Can't repro the crash.\n\n- 7900 XTX\n- 7800X 3D\n- VA panel with HDR enabled on KDE\n- Display port",
            "How do I unsubscribe from your blog?",
            "Is this a troll post?\n\nOver 20 years of Linux and then using Garuda which is full of buggy (not broadscale tested) niche settings? Strange. Next thing you tell us that you run an Nvidia card.\n\nVR is bad on Linux. But apart from that I am at least currently very happy with all games I care for on a high end setup.",
            "Use Windows then.",
            "HDR sucks on windows as well. I disabled it everywhere and it's just fine :D",
            "what desktop environment are you using?",
            "I wouldn’t say it’s frustrating on high end. But it definitely can be on NEW hardware.\n\nOpen source devs are constantly working on making everything work but they don’t usually have an opportunity to make it work before a feature or a piece of hardware is released, so it can involve quite a bit of waiting to get everything out of a new GPU or something on Linux.",
            "I want to remind you that linux distro's are free and not backed by Microsoft, and they don't send your personal data to 3rd party companies.",
            "HDR on PC (Windows or Linux) doesn't work as seamlessly as you might think.\n\nThe last time I tried HDR games on Windows 11 with an AW3423DWF, the colors looked awful compared to SDR content on OLED. As an amateur photographer with a color-calibrated workflow, I am sensitive to color deviations. The truth is that SDR content on an OLED monitor already looks incredible compared to the half-baked implementations of HDR we have today in PCs.\n\nI don't think HDR gaming on PC is quite there yet. It's mostly a hit-or-miss feature depending on the game and how the OS feels that day.",
            "> but at least the OLED HDR works?\n\nHDR on linux is in unfinished state. This is just one of these things linux is very far behind windows.\n\nThankfully HDR support is being actively worked on - experimental support exists alredy, but it might take another year before it works out of the box",
            "It's simple. Wanna use multi monitor setup with VRR and/or HDR? Use Windows instead of Linux.",
            "Running a aorus 48 oled with hdr10 and I enable it on nobara linux it seems vibrant to me.",
            "Yeah hdr support is in its infancy so no wonder there",
            "HDR ain’t ready yet and won’t be for a while",
            "I gave up on HDR in general in any device, can’t see the improvement and only gives me headaches. On series X and my samsung 120hz tv looks like garbage and most of the games look awful. \n\nWindows the same, I have an ultrawide 2k 144hz monitor and hdr looks washed out and cannot make it look right calibraring it, disabled looks better. I tried using it on my main distro endeavouros and it’s the same waste of time, cannot see any improvement in games.\n\nI just see it as a waste of time to use it, I just disable it directly on everything I have and move on, not worth it at all",
            "There's a note that says feature is still experimental, so if it was causing your system to crash, you should disable it.  Valve and KDE are working together on that, so just be patient for a bit longer.\n\nLuckily for me, I haven't made it crash in KDE, though it makes everything really dark so back to SDR.  Just glad that I can finally use the whole 144Hz on my monitor.",
            "I have the experience the other way around...\n\nSwitched to endevouros at the start of the plasma 6 beta because always having HDR on on windows just looks dogshit. And ever since my experience in that regard has been golden.\nI have 3 HDR schreens connected, 2 of them in roughly 5k one of those is oled and one in 4k.\n\n\nTHE ONLY THING THAT DOESNT RELIABLY WORK IS VR\nAnd I'm still dualbooting because of that🥲",
            "hdr is not considered high end gaming really.  but 4k gaming is",
            "So all this crying is about HDR not working? I thought that Linux murdered your entire family and raped your mother, with the way you were crying. HDR is an experience enhancer. So no need to cry. HDR is under development in Linux, with free labor.",
            "So, from your perspective linux gaming is bad because HDR doesn't work? Gaming experience it's another story, HDR can enhance , but it certainly doesn't work miracles, most of us play without it, or maybe there are people who play without even the variable refresh rate (VRR experience with a GSYNC monitor, nvidia reflex, etc are certainly better features that increase the quality and experience of the game compared to HDR)",
            "The best thing about Linux is that you don't need to wait for some corpo to fix the things for you. You can roll up your sleeves and help with the building of the HDR support (as it is still in beta, but you can help speed it up).",
            "Resident Microsoft shill using Linux to take a dump on Linux.\n\nAt the end of the day, if Windows works better with your specific configuration, the answer is simple - Use Windows. Just be sure to leave the rest of us Linux users alone, and don't bang your ass on the r/Linux_gaming door on the way out.",
            "HDR has been a complete mess on Windows too up until VERY recently and it's still relatively new, so, yeah, it's going be jank because it's still experimental on Linux. I've had an HDR monitor since my most recent PC build, pairing it with Windows 10 as my main OS up until recently, and I almost always just turned it off. The darker portions in the image were always too dark no matter what you calibrate it to, color accuracy isn't largely discernable between SDR and HDR, and the image was always too damn bright. I use dark mode on everything for a reason. I don't need to get actually flashbanged IRL if I get flashbanged in-game.",
            "Surprise, surprise who would have thought, that billion or trillion dollar companies don't support the 2% linux gaming community with proper vendor drivers. Sorry but how is this the fault of Linux? Would you blame windows if microsoft was the underdog? It is strange how on windows when a gpu driver for instance is not working the user always blames the gpu vendor. But on Linux bad support is not the fault of the vendors but it always has to be the fault of Linux. This is applying double standards my dude.",
            "Linux isn't a consumer product, when something you want do not work there's no company for you to complain. \n\n\n\n\nBut the beautiful thing is that you are free to fix the problem, or if you don't have the skills, to pay someone to do it for you, or even help sponsoring the people who are already doing that, so that they can invest more time, or if you cant pay even giving a good bug report can help a lot, but since you are shedding so much on hardware, you may have some to contribute to people making a ton of great software for free.",
            "What exactly doesn't work? \n\nI read all of the post but I couldn't see examples of things that don't work.",
            "I think it's a Garuda problem, because I've seen other people on arch using multiple high quality monitors with hdr, such as myself",
            "why are enabling HDR on linux... support is still quite not there yet.",
            "Short answer: Hardware mostly and especially games work flawlessly on windows. But back when I was daily driving Linux, I had to dualboot windows because the only game that did work well or just worked in general in Linux was Minecraft Java Edition 💀. Even bedrock dosent work being the \"cross-platform\" version of the game.And I've ever only used a laptop which had no problems with external monitor but I'm not sure about Linux. I may recall using a monitor with Linux before...",
            "wait do you require HDR for OLED monitors? I thought as pixels would be lit individually there is no need for HDR. I'm not that familiar with OLED but I thought about buying one in the near future so I wonder if the experience without HDR would be good",
            "I had to install windows for building my desktop app for windows and decided to game a bit too. Ranked up at CS2 immediately. Linux is good but you do play competitive gaming at Linux level.",
            "Yeah well... It is really annoying if the equipment you want or have or bought doesn't work on Linux, but you can always buy the one that is supported as a work around. On top of compatibility issues, I hate how so many companies treat Linux like an unwanted child and I can't shut up about this. Because, there are too many games that should just work. Like, I was playing last epoch today and the minimap is invisible and buggy which makes the game extra difficult and takes the fun and I must say that this is also a native game that devs promised it'd be supported on Linux while taking our money. Project zomboid is another game that gets buggy especially during cross play with windows and you gotta run the windows version with proton to fix it. Remember the fallguys nonsense and shadow of mordor? They dropped the support for no reason. It is so stupid. These games/softwares should have been supported as well as windows if not better.",
            "At least it's not the resident troll's/shill's monthly \"lInUx mArKeTsHaRe lOw\" posts.",
            "Its not Linux thats the problem here buddy, its shitty software and arguably shitty hardware",
            "Anti cheat has been downright the most frustrating things in modern day when it comes to linux gaming. I started using linux back in 2017 and back the there where not as many games supported natively.  Messing with wine was a must. And i had setup a vm with gpu passthrough +vfio. Unfortunately the vm method no longer works for Easy anti cheat games because it checks for vms. (Like there are so many easier ways to cheat than using a vm) Its frustrating. \n\nFortunately many games do work with proton but it's still not as great as running it on a vm or baremetal.\n\nImo linux gaming has gotten more delicate.",
            "Few notes that you might not be aware of (I know, I don't bring value to this thread):\n\n* CachyOS has superior performance for gaming due to optimizations (some tinkering is needed, but most of the stuff is out of the box)\n* BazziteOS is one of the best choices for handhelds and home theater TVs for gaming using controller on your TV.\n\nI suggest trying to use gamescope as a \"desktop manager\" as it should have superior HDR support.\n\nAlso HDR is relatively new in Linux, so only latest Plasma DE and gamescope (might be more, idk) have it.",
            "Exactly, and even though OP claims to have spent 40 years gaming, he didn't acquire the skill of reading it seems",
            "Very.",
            "^ This is the only correct answer.",
            "Exactly, and even though OP claims to have spent 40 years gaming, he didn't acquire the skill of reading it seems",
            "Experimental on Linux. But in the real world there are real HDR monitors that are not cheap. But they are amazing when used properly.",
            "Same experience here; Enabling HDR on Windows 11 gave all kind of trouble on my machine. Washed out colours, flickering, disrupts VR hardware etc.",
            "Exactly simply force the vendors to support linux properly by voting with your wallet. It is really that simple.",
            "I get that HDR is new on Linux. But HDR is far from new.",
            "I fully agree with this. I have also a 7900xtx with 7800x3d and I’m playing dota2 with vulkan.\nThe game looks much more smoother and locked always with 240fps.",
            ">I’m not saying it will 100% fix your issues. But I have ran Arch for months now. I have a 5600X (currently) and a 7900 XTX. Arch works beautifully.\n\nAppreciate the advice. There's one aspect to this setup where an nVidia GPU comes in handy on Linux. I'm using all the ports on my 4090 FE, all three DPs and the HDMI which I need 2.1 level support for with the new LG monitor and its 240hz 1440p capability.  \n\nI know it's not Linux's fault that HDMI doesn't allow their 2.1 implementation in open-source, but that doesn't change the fact this a nice monitor that I simply want to use. That's all this is about to me. Just being able to use good PC hardware. These OLED monitors, what an improvement over anything I've used in 40 years sitting in front of a screen.",
            "TLDR but I BURST OUT LAUGHING when I read \"Arch works beautifully\" 💀",
            "No reason, just trying whatever I thought was a good idea from Linux users in various forums? But there's no expertise with these kinds of setups. Plus, half of the responses are screaming about how an AMD GPU would solve my problem, not realizing that I need HDMI 2.1.\n\nI guess part of my frustration in all of this is how so many Linux users talk about how fools like me just stick to Windows but then have never tried to get a $15K US rig to work under Linux.",
            "Question is why is he not on Windows the dude is concern trolling this subreddit for years now how Windows is better and Linux is lacking this and that.",
            "It's called Winutil for anyone interested",
            ">Jeez Luiz, just use whatever suits you. \n\nAgreed. It's a dual boot rig. It's been fascinating to see the differences. And by fascinating, how bad Linux is on this kind of hardware. But I love to try it. Not everyone that uses Linux is going to love it, just like Windows.",
            "So single OLED monitor? Not when I started having crashing issues.",
            "Plenty have recommended Guruda for HDR.",
            "Well you're meant to only enable it when consuming HDR content, not 24/7. You also are meant to have a OLED or FALD monitor and not some £200 amazon special monitor.",
            "Garuda Plasma 6.1 Wayland, latest nVidia drivers. I'm gonna wipe it. Every time I add something to this rig the Linus distro freaks the fuck out. Windows is WAY better at dealing with added hardware after initial setup.",
            "Exactly the reason I am still, and will probably be for a very long time, bound to Windows.",
            ">Switched to endevouros at the start of the plasma 6 beta because always having HDR on on windows just looks dogshit. \n\nI have HDR on all the time on the desktop under Windows 11 and no issues with the 5 HDR monitors I'm using.",
            "I can't even get both OLED VRR/HDR monitors to work with those features enabled initially without the OS hard crashing, blue screening in Windows terms.",
            "Definitely not its just HDR can be questionable on linux in general, i wouldnt say its a garuda issue mileage varies in all distros",
            "Why is Linux so behind on a feature that has been common and standard for so many years",
            ">why are enabling HDR on linux... \n\nFor me, the reason is because I have $2K US of OLED monitors on this desk using a dual boot rig. I'd have NEVER bought these monitors exclusively for Linux use. And no one else would now.",
            "Until there are cheap HDR monitors, I don't think HDR would be as widely supported.\nThe tech itself is quite fresh.",
            ">But in the real world there are real HDR monitors that are not cheap.\n\nwell that's just it. what percentage of desktop linux users are using HDR monitors do you suppose? my bet is around 5%. it's just not much of a priority.",
            "i gotta be fair here, HDR Implementation on Windows is funky too. the only system ive seen which reliably had HDR working was macOS.",
            "HDR exists since a couple of years. But on Desktop it was never that popular to begin with, and so nobody bothered implementing HDR on Linux. Especially since a couple of years ago everybody was using Xorg and nobody wants to work on the mess that is the Xorg code.\n\nSo for HDR to even begin to get worked on on Linux, a lot of things had to happen:\n* HDR had to start getting traction on desktop displays\n* Wayland needed to get stable enough to add experimental features to it.\n* Funding and interest for HDR on Linux needs to exist (Valve, Red Hat)\n\nThat means that HDR only started to get worked on 1-2 years ago, with *experimental* support hitting the public just a couple of months ago. So yeah expect issues.",
            "But we're talking about Linux... HDR is literally in beta infancy state, and while that does suck and take away from Linux even a tiny bit of research would tell you this. HDR is just really expensive atm so not many care about its support on Linux, this doesn't mean hdr is bad or not worth it if you can afford it, but it's the reality of the situation",
            "And of course, man-child u/outofobscure banned be as soon as we found out that he is a Windows-only developer, who seen nothing outside Visual Studio. What are you doing at r/linux_gaming, then? Trolling?",
            "Yeah, but OLED isnt really real HDR",
            "As you can see from these ridiculous replies and the downvotes, these people don‘t live in the real world and it will always be a pain in the ass if you have slightly above average, no above bare minimum, expectations for what should work. As time moves on you might get support for whatever feature was standard on windows and osx a decade ago already, but by that time you‘ll just wait for the next new thing… this will never end, and with people thinking that mass adoption is when something costs 50$, well you can guess what their time is worth: 0.",
            "Downvoted and reported for wanting a feature to be supported by your operating system",
            "It's far from new in relation to home theater, where HDR was released as far back as 2014. When it comes to PC gaming, HDR support began in roughly 2021, and it was far from ideal (in many ways it's still not ideal, even under Windows 11).\n\nIn the grand scheme of things, PC HDR support is definitely in it's infancy. Therefore, the fact that HDR support under Linux has issues is in no way surprising considering KDE gained the HDR toggle literally a few months ago. To believe otherwise at this point in time regarding Linux HDR development is somewhat naive and unrealistic.",
            "Despite HDR being a decade old standard, no one took the task responsibility to help Linux get support on its graphical stack. Fortunately Valve did, and with Wayland replacing Xorg in recent years that was possible, so I think that self explanted things.",
            "Instead of complaining, you can put your skills together and help implementing or donate to accelerate the development of",
            "There is your problem: Nvidia still sucks.  \nWait weeks/months for the needed critical update, until than you are out of luck.",
            "I mean it works pretty well, doesn’t it?",
            "Well yeah 99% of people can't relate to that issue.",
            "Why do you need HDMI 2.1? VRR? I use DP here, works well, and even with HDR. Most screens (with the exception of TVs) support DisplayPort nowadays. I recommend reading about HMDI, and you'll definitely want to use DP or buy a screen that supports it next time.\n\nTo be fair, even experimental, KDE, and gamescope HDR implementation looks better than W11 one in my hardware.\n\nYou don't seem to understand that HDR is old but not on desktop. Not even Windows is doing it properly. It might work well with your rig, but it doesn't with mine.",
            "I've got a 7950X3D and 7900XTX, one of the recent 240HZ 4K QD-OLED monitors, and 1440p 165hz monitor. I've never tallied up the price to compare with anyone else, but I guess the total value is probably comparable. And, I've got HDR working fine on this monitor. So I know that getting 'a $15K US rig to work under Linux' is possible.\n\n> AMD GPU would solve my problem, not realizing that I need HDMI 2.1\n\nUnfortunately, nothing in life is perfect. You have to compromise sometimes. If that means using Windows, then that's your call. If it means missing out on HDMI 2.1 support for potentially better Linux driver support, that's your call too.",
            "So...Linux is 'so bad' on your hardware because you can't run a second HDR monitor on a system running a 4080Ti 'for gaming' as well as a 3080Ti that at last count had three monitors specifically connected to it for 'office use'.\n\nSounds like an edge use case 99.9% of users will never experience. Also sounds like a complete waste of money when you could connect those three monitors to a cheap Dell 'for office use' that you could pay for by selling the 3080Ti.",
            "Both wayland and HDr are pretty new for the nvidia drivers, same for KDE. I wouldn't call it stable. You might have less hiccups with sticking to X11 for some time on nvidia. Too many things in the equation that can lead to problems right now.",
            "Ah, I meant SDR content. The gamma curve that's used on windows just constantly looks washed out to me. And I really don't want to have to turn off HDR for it to look right again",
            "Yeah. I don't have OLED, but for me multi monitor system when VRR for gaming works pretty well. NVidia updates sometime causes issues (e.g. resuming on suspend fails one monitor randomly) but those quickly get sorted with patches.\n\nHDR isn't something I've tried yet. I believe it is under active development and should get better this year. (I know it already works very well on Gamescope.)",
            "Because realistically it hasn't been common and standard for so many years. It's only recently becoming more prevalent in mid-range monitors\n\n If no one bothers to implement it it doesn't get implemented and we're only now at the stage where it's common enough to affect a small but significant percentage of users.",
            "but still you are just checking a box that has no support in any of the software you are actually running besides the window manager under linux. Sadly linux requires compromises. i killed windows a few days ago because i don't want to risk having recall on my pc, it's the proverbial drop, i'm tired of seeing my cpu being heated up while playing by 15 to 20° and that can't idle lower than 50°.",
            "It depends on what you call cheap I guess. I bought some MSI 1440p monitors that were roughly £220 each and they have HDR support.",
            "Only way how Linux display stack works properly is if you have single 16:9 display connected via DisplayPort. Otherwise it is cursed since forever. You add monitor, refresh rates get broken, HDR gets broken, VRR gets broken. They said wayland will get this fixed, they said it like 10 years ago, it's still broken. You have nvidia? Good luck with wayland. You have AMD? Good luck with HDMI.",
            "(German prices)\n\nOLED are still very expensive (700€ or more)\n\nBut there are a couple of cheaper Full Array Local Dimming displays, which can come very close to OLED contrast and get even brighter (around 350-500€)",
            "Also, this isn't a corporation, it's a community : if 5% of the population has access to hardware, then 5% of devs will actually care to feature it and test it earlier than something else. Development will probably kick in once the hardware becomes the norm. Until then, OP should learn how to code and do it himself, just because he *can*.",
            "That's a pretty entitled statement. You've paid for nothing here and I would venture to say that you've probably contributed nothing either. \n\nSo let me break it down for you Barney style. \n\nLinux DOES NOT EXIST TO SUPPORT YOU!  Developers who spend their personal time working on FOSS do so to create the things that THEY want to use. We aren't your personal dev team. \n\nA lot of things you complain about, especially HDR, are extremely complicated. Microsoft pays a lot of money to a lot of people to make them happen. \n\nSo either install an editor and start making the things YOU want or learn to deal with the fact that Linux, especially Linux gaming, is a community driven labor of love and will lag significantly behind Windows in new features.",
            "Nvidia 555 beta drivers are pretty good though",
            "No? I used to daily drive arch. Currently on w11...",
            "Totally get that. Linux fans love to talk about the freedom that Linux gives them. You will not see that freedom on something like this rig.",
            "He said bad on this kind of hardware and yeah Linux is bad in general.",
            "How is this possible when you can't drive more than 1 VRR display with nvidia?",
            "Seems off to me. I’ve had my lg b9 for 5 years already and it was midrange and not super expensive when it came out.",
            ">but still you are just checking a box that has no support in any of the software you are actually running besides the window manager under linux.\n\nI could go one about things like OneNote, streaming, etc. from a software perspective. The point here was about hardware and two very good monitors not working like they supposed to under Linux. But I've got keyboards, mice, devices like a Stream Deck, VR headsets, etc. that ALL have some big issue under Linux.",
            "\"Can find a used one for 150$\" kind of cheap. When you can find it for 50$, it'll be \"popular and present in every home\".",
            "i doubt those will be \"true\" hdr since they mostly likely will not be able to reach the brightness necessary",
            "as i already said in other replies: i'd happily PAY for a distro that actually gives a shit about supporting anything but the bare minimum.\n\nthis is the problem with you people: you expect everyone to be a cheapskate like you. as a software developer myself, i know that our time has value, so i'm prepared to pay for someone doing the work,\n\ni know it's not trivial and i actually know what's involved in getting this to work, but i will certainly not waste my time working on this myself, unless i get paid for it.\n\nbut gain, i'm willing to pay for a distro that finally frees me from people like you who just endlessly go on about how \"linux is not there to support you\". fine, then i'm not here to use it,\n\nAnd i'm certainly not here to try and understand what drove you to have these absurd ideas about how software development, user friendliness and support should work, according to you. I'd rather pay more pragmatic people to deliver something more sensible.",
            "That’s not entirely true. A lot of things like distros and programs are made by entire organizations that DO generate money to keep existing and SUPPORTING THEIR USERS. - Ubuntu, for instance, isn’t just some little program by some person just because they want it to exist. It’s a widely used piece of software and the developers are in a position of responsibility for it. If not, leave Canonical I suppose. - But in any case, HDR is one of many widely used standards, even by the average consumer (and not as niche as some people here try to make it out to be) and should simply be built into operating-systems by now. - I too can’t believe it hasn’t been figured out and standardized by now. It has been years.",
            "I don’t wanna seem rude and to be fair, I don’t know what problem you had/have. I too have been daily driving arch since January (of course switching to windows a few times too) and have so far had no actual issues.\n\nActually, Arch was my first ever distro, so as a complete rookie, I can say it’s pretty good. Any problems I had were easily solved with the wiki and most of them were my own screw ups. Of course, this probably won’t apply to the majority but yeah",
            "in arch, you build your perfect system yourself, you literally start in an empty shell forced to choose each package you install.  \nits your fault it broke.",
            "Brother, all you have to do is wait, as many people have said, HDR is new to Linux. Give it a bit and it'll get added just like every other popular feature does. If you can't wait, you're already dual booting, so use windows in the meantime",
            "Yeah....Except no, no it's not.\n\nIt's all a matter of perspective and use case - And his use case is something 99.9% of users don't care for.\n\nThe only reason he mentions his PC is for bragging rights. Which, once again, no one care's for.",
            "True, but you're also a sample size of 1 and TVs tend to get faster feature support because they're easier to make. I'm not sure if that was the case with HDR but it's still easy to find HDR-less monitors at the midrange today (or really bad HDR support). I got an HDR monitor only about a month ago.\n\nThe other main reason would be that it's only recently become possible with the rapid progress of Wayland. Now all the foundations are in place I don't expect it to take much longer to get HDR out of the experimental state on Linux but time will tell I guess.\nI'm glad it's finally being pushed, it did always seem like a  sore spot.",
            "Oh Gawd, he's pulling the OneNote card again...\n\nI don't know of A SINGLE PERSON that actually uses OneNote. Not ONE - Perhaps that's why it's called ONEnote, because you're the one person that actually uses it.",
            "True but not sure it's that far off as these were new at that price.",
            "Correct as they're not rated afaik. Still cool you can at least get support for that price range along with 165Hz on an IPS panel",
            "Tbf we will be waiting a few more YEARS at least to get stable HDR support. Look at VRR, it only bearly works now.",
            "Sounds more like you are just jealous or can‘t even think about any use case other than the mentioned „office“ type work, which by the way is 99% non-linux for everyone out there in the real world doing real work. You and your low expectations are part of the problem.\n\nThe point is none of these -should- be edge cases if you want any kind of serious adoption. They all need to be considered basic use cases, just like on a commercial OS.",
            "The topic is about high end gaming, an edge use case. So what's your point in pointing out that it's about an edge use case?",
            "they might be rated vesa hdr400 but all you're really getting is 10 bit color and not high dynamic range.\n\ngood enough to not having to see colorbanding but not good enough to have the colors really pop and have lots of detail in very dark or very bright sections",
            "VRR works fine? It just doesnt work well with x11 and nvidia because x11 is old and nvidia doesnt properly support wayland...\n\nLiterally, been using it for years now. Like at least 4-5 without issue with my AMD cards. All the problems I see with VRR are x11 and/or nvidia users and in both cases, that makes sense...",
            "Which is understandable. Maybe if we had more people asking \"how do I help contribute to HDR on Linux\" instead of \"when HDR\" it would get finished faster",
            "Using 2 HDR monitors is not what I think as a basic use case. As other commenters said, even Windows has problems with this.\n\nAnd please, tell me why software development and almost anything that has to do with servers isn't \"real work\".",
            "First of all, it's not \"99% non-linux\", [take a look](https://en.m.wikipedia.org/wiki/Usage_share_of_operating_systems).\n\nSecondly, I do love how you all are boasting about \"doing real work,\" while we both know it's still about gaming. I'm a software engineer (enterprise web, backend). Linux is the best possible workstation for me, as the entire environment is native and production-like. Is my work not real to you?",
            "The edge use case is HDR gaming with two monitors, not gaming in general. Having an HDR monitor for gaming is something relatively new (2021 I think was the start of windows supporting it as a feature), both OS have problems with the technology as seen in other comments and I think we can agree most people do not drive dual HDR setups on PC.\n\nAnd if you have doubts on the gaming in general, even OP said that they can run most games well and even VR.",
            "I don't think the layman, or even the average linux user, could contribute anything meaningful to HDR implementation on Linux. Have you contributed anything?",
            "This is linux gaming, not servers, and yes 2 hdr monitors is a perfectly reasonable basic use case in 2024. It works well enough in windows, i know because i have 3.\n\nThis is the problem with you guys, i‘d happily pay say 200$ for a distro that aknowledges that not everyone has the same low expectations as you people who think a monitor should cost 50$ and only then it‘s worth supporting. I‘d even accept binary blob drivers as long as you provide hardware support on par with windows. \n\nMaybe microsoft will get the idea one day and just put their HAL and APIs on top and call it a day. Apparently nobody in this space gets that this would be in demand, so it will take a commercial vendor.",
            "For desktop usage („office“) you suggested, yes it‘s 99%, this is not servers or mobile.\n\nAlso, it should be common sense to understand that -you- are the edge case, not all the other users for whom linux is still not a viable alternative.\n\nI‘m a software engineer too, and my time is worth much more than putting up with sub-par hardware support of an OS that‘s 5 to 10 years behind what 100$ can buy me. \n\nI‘d happily pay 200$ a year for a distro that realizes this and works to bring support up to par with windows, but apparently nobody in this space even understands that this would fly.",
            "I haven't. But I also respectfully disagree with that statement, bug reports are contributions, obviously we'll have to wait for a pre release/beta build, but average users can help with detailed and consise bug reports",
            "No one is forcing you to game on Linux.",
            "> For desktop usage („office“) you suggested, yes it‘s 99%, this is not servers or mobile.\n\nDude, at least take a look at the article. Can you spare some of your precious time for that?\n\nHere, I'll post it for you:\n> For desktop computers and laptops, Microsoft Windows is the most used at 72.22%, followed by Apple's macOS at 14.73%, desktop Linux at 3.88%, and Google's ChromeOS at 2.45%. Since ChromeOS is a Linux based OS, it can be added to the total desktop Linux share bringing it to 6.33%. 0.01% is FreeBSD and the remaining 6.7% is likely obscure Linux distributions. \n\nAlso, as a professional, I fail to see how spending some time to make your workspace efficient is a waste. Are you telling me that you can buy any non-Linux machine and start to code out of the box? Do you code in Notepad++?",
            "Of course you fail to understand that tinkering with an OS is not productive use of time, i prefer to write software on an OS that works out of the box and with an IDE that is fully featured: Visual Studio, for which there is no free alternative either that comes even close.\n\nEndlessly tinkering with and babysitting your OS honestly gives off a lot more „script-kiddy“ vibes than „professional developer“."
        ]
    }
}