{
    "/r/Malaysia daily random discussion and quick questions thread for 22 June 2024": {
        "title": "/r/Malaysia daily random discussion and quick questions thread for 22 June 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/malaysia/comments/1dld5n6/rmalaysia_daily_random_discussion_and_quick/",
        "content": "This is [r/malaysia](https://www.reddit.com/r/malaysia/)'s official daily random discussion and quick questions thread. Don't be shy! Share your joys, frustrations, random thoughts and questions. Anything and everything is welcome.\n\n>*Jom tengok DT pada awal pagi*  \n>  \n>*Semoga semua monyet sihat*  \n>  \n>*Nasi apa yang orang suka bagi?*  \n>  \n>*Sudah semestinya bagi nasihat*",
        "num_comments": 41,
        "comments": [
            "\n**Minor announcements:**\n\n* [monyet.cc](https://monyet.cc): Check out our Malaysian Lemmy community! ([why?](https://www.reddit.com/r/malaysia/comments/14cmnaj/rmalaysia_and_the_blackout/))\n* [SPM Megathread](https://www.reddit.com/r/malaysia/comments/s58t8m/spm_megathread/): Updated 2022 with SPM resources such as trial papers, modules, notes and more!\n* [Mental health wiki](https://www.reddit.com/r/malaysia/wiki/mental_health/): A list of mental health services in Malaysia\n   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/malaysia) if you have any questions or concerns.*",
            "work tried to contact me several times since morning. had enuff, f them. I'm not scheduled for today, and nothing on my contract says anything about needed to be reachable during offdays. ![img](emote|t5_2qh8b|26563)",
            "If I have an unlimited medical claim from my office, which clinic should I try to get the most 'atas' experience even for simple sickness like fever and cough? Is there such thing as luxury clinic for the T5 people?",
            "why shower gel always have refills,but shampoo only comes in bottles ?",
            "anyone has air asia asean explorer pass? worth it or not?",
            "Does anyone know if the majlis perbandaran handles the following:\n\n-  replacing the missing road number signboard in my taman, after it was knocked off by a passing lorry\n- removing the roots of the big tree in front my house (planted on public land) that’s growing across and starting to block my front gate\n\n.. and how to submit a request? Thanks!",
            "what's the best hacks to earn airasia/enrich points other than buying ticket flights?",
            "https://preview.redd.it/ql5efnap128d1.png?width=1125&format=png&auto=webp&s=84063984feb7d7be170ed8d1f7bf7c34eea6de44\n\nDoes anyone know what hair product out thr that can help me achieve this look (combed to the side but really flat as well). I want the hairstyle to stay for long",
            "Anyone has experience buying expensive stuff from eBay? Any problems with their returns/refunds or the authenticity of the products?",
            "OneXOX Validity - so no more 28 months? Now have to top up 30rm every 120 days or 25rm for 12 months?\n\nthe heck?",
            "How do I find an internship. So far i have applied through linkedin and job street with no luck. I have to work as an intern for 3 months to graduate. I am a foreigner and my cgpa is a bit below 3.",
            "https://preview.redd.it/d0qg9dgbo38d1.png?width=1058&format=png&auto=webp&s=4b22e75c538bb3944ad677a3ea3206e3abdf90af\n\n# I did not violate the rule 9, but my post was still deleted.[How can I restore my post?](https://www.reddit.com/r/malaysia/?f=flair_name%3A%22Politics%22)\n\n[https://www.reddit.com/r/penang/comments/1dje9sq/penang\\_to\\_hat\\_yai\\_travel\\_pitfall\\_guide/](https://www.reddit.com/r/penang/comments/1dje9sq/penang_to_hat_yai_travel_pitfall_guide/)",
            "Nyets I have a dumb thought: Yall think those GPUs on Taobao are legit? <RM5k for a 4080 sounds too good to be true.",
            "if u get an overseas scholarship for a masters program, can u continue to work/live at that country? do all scholarship require u to continue working in malaysia?",
            "Has anyone here ever bought a Dockcase USB Hub? How was it? I need a hub that can be used for USB A, C, and HDMI.",
            "any cordless vacuum you guys would recommend, doesn't need to be super high end, but good enough to make it more efficient than regular sweeping (and can handle cat hair).",
            "https://preview.redd.it/q7j7d0nol48d1.jpeg?width=1440&format=pjpg&auto=webp&s=975f65a7db4e3517671c6934e30d41f44600744e\n\nAnyone have this problem on their Xiaomi phone? MyJPJ is listed as a launcher app on all of the Xiaomi phones I've had... Sometimes it soft bricks my phone as I can't use gestures as navigation when for some reason it changes the launcher to MyJPJ",
            "Put on your fedora, and hold your katana, you euphoric edgelords, for I have a question : \n\n\n**What would be a secular logical reason to stay alive?**\n\n\nIf one is miserable and would make others miserable, and there is no cure for their psychological condition of being a miserable asshole, would they qualify to be euthanized?",
            "https://preview.redd.it/9d2o6rq4yz7d1.png?width=1080&format=png&auto=webp&s=3ae1780f399420e2662ef414ebb0263abd4f6ad5\n\nIgnore this if you don't like political shit\n\nOh no calling people as Zionist and Type C and .... K :p",
            "[Nobody knows where they might end up...](https://www.youtube.com/watch?v=ksasuf2qals)\n\nOne of the lessons  in my journey of drifting from one IRL community to another and having them all differ greatly, is that nobody can perceive a quality that they don't already possess or were modeled for them by a parental figure. \n\nFor example, I had a friend who trusted everyone because he would never lie. So he assumed everyone to be like him. \n\nAlso, imagine a shoplifter. They got away with stealing, but they would get paranoid as they marched to their car as they imagine everyone is suspicious of them, when in fact, the mall workers are tired and preoccupied with the idea of clocking out. \n\nPicasso once said that art is the lie that reveals the truth; whatever we imagined is unique to the artist, but the viewer or the reader can only extract meanings relevant only to the context and experiences they already have. \n\nThis is why the purpose of an artist or a writer is actually to ask questions, not answer them, even if the work or literature is posed as a statement.\n\nBtw, this concept is called projective identification. People can only perceive others as deep as they can perceive themselves, so if they have difficult emotions that they want to avoid, like feeling shame from being chronically online and not achieving much in life, they may accuse others of doing so in order to avoid looking inward. It's easier to feel angry and attack someone who's doing the same crime you do than reform yourself internally, and you might as well compulsively engage with this person by provoking them to further reinforce the dyadic relationship.",
            "Good.\n\nThey want weekend support, they can pay for weekend overtime.",
            "A lot of high end clinics. Just google maps and look at reviews/pics. My gf recently went to one women's clinic in TTDI . The owner also runs a resort(!). This is how it looks like inside\n\nhttps://preview.redd.it/2p6ukoq2c28d1.png?width=382&format=png&auto=webp&s=4336d857bf19a74c2fa9af63fc42a2e12e352f5f",
            "if hosp also covered, hop on down to PrinceCourt Medical centre",
            "Japanese shampoo's come in refills, can find it at don donki or the beauty store just for japanese products in sunway pyramid.",
            "I've seen shampoo refills at Watson. Gf buys them all the time.",
            "I travel a lot and I bought it. Here's some things you should take note of:\n\n* You can only book 14 days in advance to be eligible for zero fare flights.\n* You can only book zero fare flights on specific days that are low peak travel. This usually means unpopular days like Tuesdays or Thursdays.\n* You won't know which days are eligible for zero fare until you are searching for it and they will lead you to a page with a list of dates you can purchase. Unfortunately the page is not available until you have paid for the pass and are actively searching for the route.\n* Free airport ride is only applicable for prebook rides that cost more than RM90.\n* You cannot use it if you skip 3 flights that you purchase via the explorer pass.\n\nHere's why I regret purchasing it:\n\n* As an impulse frequent traveller, I usually book last minute (less than 14 days) flights.\n* Rescheduling flights cost means they will charge you full rate even though the dates are applicable for zero fare. Oh and this counts as you skipping your flight bought on explorer pass.\n* In 1 month, usually there are only 3-5 dates available for zero fare. None of the timing and dates fit my schedule which are usually Thursdays. You need to follow AirAsia's schedule basically.\n* I live the other side of KL from KLIA2\\* yet my airport ride costs RM55-60 on the app. Who's trip costs RM90? Are they going straight to Genting?\n* When I pre-book, 100% of the time, drivers call me to say they cannot accept my time and ask me to reschedule my ride. When I say no (because I have a fucking flight to catch), they cancel. By that time, I am no longer eligible for pre-booking because it's too late to pre-book.\n* Since I purchased the Explorer Pass in April\\* I have only flown a flight under explorer pass once, and rescheduled the other one (which means I have \"skipped\" it). For reference, since April I have flown more than 15 international flights.\n\nTLDR: Overall, not worth it for me.",
            "1. See if signboard has JKR or PBT logo on it first, but its usually a PBT one in housing estates.\n\n2. Trees that are not fruit or food plants tend to be considered PBT property too. \n\nComplaints system depend on PBT. Klang Valley tend to use app or web portal for complaints, smaller PBT like say in Kedah just have the Whatsapp number to send pics too.",
            "I think you can get points if you make payments via AirAsia's bigpay.",
            "A lot of products can do that but you need to understand your hair type first so try to experiment with different products. Thicker hair type may require stronger hold, but if you have thinner hair type, using a looser hold is just enough so it doesn't weigh your hair down and it looks more natural.\n\n  \nFrom loose hold to strong hold: hair oils, hair clay, hair wax, mousse, pomade, gel, hair spray. Note that stronger hold products can make your curls more prominent depending on the technique you use, which you can use to your advantage if you like your curls. All products you can get at any watsons, guardian and the like. Follow the instructions on the label on how to use.",
            "your university don't have any resource to help you?",
            "Millsre and Colorful got local distributor already. Yeston and the waifu card got decent rep, but still kinda expensive.",
            "The short quote is, \"If the door is open, why grieve?\"\n\nThe long quote is, \"Has someone made smoke in the house? If it is moderate, I'll stay. If too much, I exit. For you must always remember and hold fast to this, that the door is open\" \n\n— Epictetus.\n\nThis is to say that you can take your own life at any time. If the situation requires it, then do it. But if it's not the most urgent thing, you can live another day and see how much worse it can get. You can always kill yourself after that exam, or after you declare bankruptcy, or after you really are old and completely alone. \n\nThere is also:\n\n“It is not worth the bother of killing yourself, since you always kill yourself too late.”\n\n― Emil Cioran, The Trouble With Being Born.\n\n**Someone being an asshole is not one of the conditions to consider euthanasia. Even the death penalty is in the process of going away in Malaysia.**\n\nShould we kill you if you were an asshole who made a lot of miserable posts?",
            "How miserable? Give an example, like a physically or mentally?",
            "well I could claim OT if I were to work today, but I don't want to. It's my offday & I just don't want to work. ![img](emote|t5_2qh8b|26556)",
            "can cover hospital, but do hospital take patient with simple sickness?",
            "tq for the tip , rarely see the refills at the usual supermarkets",
            "[https://www.reddit.com/r/malaysians/comments/1dloek1/i\\_bought\\_the\\_airasia\\_asean\\_explorer\\_pass\\_and\\_this/](https://www.reddit.com/r/malaysians/comments/1dloek1/i_bought_the_airasia_asean_explorer_pass_and_this/) i reposted this and wrote more in the comments",
            "Tysm! Very informative",
            "Yes there's a list of companies. I have applied to more than 50% of them but didn't get any response.",
            "Mentally they're incapable of having a healthy mindset, so they're a nightmare to everyone around them. They may not be violent, but the BS they have in their head and the things they say, would make you not want to be around them. They are also incapable of taking in new information (either by low intelligence or simple arrogance, or a mental disability) so hypothetically, no amount of counseling would help them.",
            "Supermarket's not that am aware, but Guardian has it for 1 brand of Japanese shampoo. That is the closest to mass retail shop, i suppose."
        ]
    },
    "SPM 2023 Results Megathread (Check pinned comment for a list of 50 Nyets who have volunteered to answer any career enquiries regarding different fields/areas)": {
        "title": "SPM 2023 Results Megathread (Check pinned comment for a list of 50 Nyets who have volunteered to answer any career enquiries regarding different fields/areas)",
        "score": 69,
        "url": "https://www.reddit.com/r/malaysia/comments/1cvd1zo/spm_2023_results_megathread_check_pinned_comment/",
        "content": "This thread is for all SPM related discussions, may it be results,  universities, courses etc. The intention is to help school leavers talk about the SPM in one central spot on the subreddit.\n\nFor both public school and private SPM candidates, you can check your results online at [myresultspm.moe.gov.my](https://myresultspm.moe.gov.my) or retrieve via SMS by sending SPM < space> IC number  <space> Examination number (Angka giliran) to 15888. Example: SPM  000527031234 WY189A123\n\n**Mental health resources**\n\n* If you are feeling intense emotional distress and need someone to talk to, please call (a) the [Befrienders Suicide Hotline](https://www.befrienders.org.my/) at +603-79568145, (b) [Talian Kasih](https://www.kpwkm.gov.my/kpwkm/index.php?r=portal/full&id=NGtVYXZIMjRqM3diWmV2K005Mm9Hdz09) at 15999 any time 24/7, or (c) the [Buddy Bear Childline](https://www.facebook.com/buddybear.humankind/) at 1800-18-BEAR (2327) if you’re under 18\n* [More mental health resources](https://www.reddit.com/r/malaysia/wiki/mental_health)\n\n**Links to relevant post-SPM posts**\n\n* [Why aren't there many SPM graduates enrolling in government politeknik or TVET?](https://www.reddit.com/r/malaysia/comments/13pb2rd/why_arent_there_many_spm_graduates_enrolling_into/)\n* [A Discussion on Should You Take a Degree](https://www.reddit.com/r/malaysia/comments/xlwks7/a_discussion_on_shoud_you_take_a_degree/)\n* [Almost done with STPM and here's my experience if anyone is interested in it](https://www.reddit.com/r/malaysia/comments/10xr888/almost_done_with_stpm_heres_my_experience_if/)\n* [I feel completely hopeless after secondary school](https://www.reddit.com/r/malaysia/comments/vzpciv/i_feel_completely_hopeless_after_finished_my/)\n* [It's been almost 2 years since I got straight As for SPM](https://www.reddit.com/r/malaysia/comments/tyxuwo/its_been_almost_2_years_since_i_got_straight_as/)\n* [More posts](https://www.reddit.com/r/malaysia/wiki/spm/)\n\n**For young Nyets who are interested in TVET (Pendidikan Teknikal Dan Latihan Vokasional):**\n\n* [Apply to TVET courses](https://www.instagram.com/p/C49U9xjMdAX/) (Pendidikan dan Latihan Teknikal dan Vokasional) offered by 7 different ministries and over 15,000 spots through [https://mohon.tvet.gov.my/](https://mohon.tvet.gov.my/)\n* [Skills For Life programme by Youth and Sports Ministry](https://www.instagram.com/ilkbs.bpkb/p/C1qzkeBJAca/) that offers basic skills training to local youth through short-term courses. [Registration link](https://docs.google.com/forms/d/e/1FAIpQLScMr4ZDxeVaUA09pkLFSzQfcDhNrGm2-8x_F866wEZh4JZl1g/viewform)\n* Apply to SKM (Sijil Kemahiran Malaysia) courses. [Check out Group SKM on Facebook for opportunities](https://www.facebook.com/groups/507375412972162)\n* [Program Latihan Kompetensi Kemahiran Belia](https://akademibinaan.com.my/program-latihan-belia-kompetensi-kemahiran-pembinaan/) - **sponsored fully** by CIDB (Construction Industry Development Board) in 6 campuses; Kedah, KL, Johor, Terengganu, Sabah and Sarawak\n\n**Education Fair Dates**\n\n* [TheStar Education Fair in Penang, KL and Putrajaya ](https://www.thestar.com.my/edufair/?fbclid=IwZXh0bgNhZW0CMTAAAR2c60VyIaS1eCX-HIK5oV_N4m5xCT-8IWeylsMbgkHeTyn_mWqIQaCKviQ_aem_AU4-jEYrm6W4jXLTRbcel3RSzDBmSNS9PQ1K05-378R8pKEf9yKvDBR2ZYRDwcf8jc6lFQbpQMT15o-bBekszNNF)\n* [StudyMalaysia Education Fair in Sabah and Sarawak](https://www.facebook.com/studymsia/posts/pfbid0cfueBfyuwLDnkyHDNdZUbTw9ta28BfbnsPhn6iaBYDdG1Lu7vrjgPT4nHNkUQiJhl) - (22-23 June and 29-30 June)\n* [SureWorks Education and Further Studies Fair in KL and Johor](https://sureworks.info/fairs)\n* [Jelajah Jom Masuk U](https://www.instagram.com/p/C6aIRhpJZeQ/)\n\n**Free courses to explore new/existing interest:**\n\n* [National Training Week (NTW) 2024 from 24 – 30 June](https://www.facebook.com/events/668333955396314), when up to 150,000 free training courses covering essential life skills, future readiness, creativity, financial literacy, and sustainable development\n* [e-Latih - free e-Learning platform for Malaysians with over 1800+ courses](https://elatih.hrdcorp.gov.my/courses?order=None&categories=&levels=&languages=&start_duration=&end_duration=&content_provider=&ratings=&version=&start_price=&end_price=)\n* [Free digital tech training by MDEC](https://mdec.my/letslearndigital?fbclid=IwAR2mZ-ywGsQswaac66wI08HVCeiEjANsJbqcoBL6QH8H-z-vd9XfRdXyCBk)\n* [42KL - Learn to code for free (F2F classes)](https://42kl.edu.my/)\n* [FreeCodeCamp - Learn to code for free](https://www.freecodecamp.org/)\n* [EdX](https://www.edx.org/) (choose free audit track)\n* [Coursera](https://www.coursera.org/courses?query=free)\n\n**Volunteering/internship after SPM:**\n\n* Kechara Soup Kitchen [\\[Link\\]](https://kecharasoupkitchen.com/general-volunteer/)\n* SPCA Selangor [Link](https://www.spca.org.my/what-you-can-do-to-help/volunteer/)\n* MNS (Persatuan Pencinta Alam Malaysia) \\[[Link](https://www.mns.my/volunteer-with-ucf/)\\]\n* WWF Malaysia [Link](https://www.wwf.org.my/jobs/volunteers_and_internships/)\n* MyKasih [Link](https://www.mykasih.com.my/site/food-aid-programme/volunteer-with-mykasih/)\n* Free Tree Society [Link](https://freetreesociety.org/index.php/volunteer/)\n* AIESEC [Link](https://aiesec.my/malaysian-youth-volunteer/)\n\n**General Scholarship info links**\n\n* [Telegram channel for a list of scholarships, constantly updated](https://t.me/BiasiswaMalaysia)\n* [Telegram channel for any questions regarding UPU, matriculation, STPM,asasi](https://t.me/jawapanbukutekst5kssm)\n* [Afterschool.my](https://afterschool.my/scholarship)\n* [International Scholarships for Malaysians](https://www.scholars4dev.com/tag/scholarships-for-malaysians/)\n* [FB Group: Biasiswa Dalam dan Luar Negara (for undergraduates, Masters/Postgrad and PhD)](https://www.facebook.com/groups/494599987258759)\n\n**Fully Sponsored Overseas Scholarships**\n\n* [Yayasan Khazanah Scholarships](https://www.yayasankhazanah.com.my/scholarship-programmes)\n* [ASEAN Scholarship for Malaysians](https://www.moe.gov.sg/financial-matters/awards-scholarships/asean-scholarships/malaysia)\n* [SHELL Scholarship](https://www.shell.com.my/careers/students-and-graduates/scholarships.html)\n* [Hungarian Government Fully-funded Scholarships for Bachelor's, Masters and PhD. Malaysia is one of the partners](https://stipendiumhungaricum.hu/partners/)\n* [Government of Japan Scholarships](https://www.my.emb-japan.go.jp/itpr_en/scholarship.html)\n* [Studying in Egypt and Jordan Scholarships](https://dohe.mohe.gov.my/timurtengah/)\n* [The Belt and Road Scholarship (Study in Macao)](https://www.mohe.gov.my/en/broadcast/announcements/tawaran-biasiswa-the-belt-and-road-scholarship-2024-2025)\n* [Indian Council for Cultural Relations Scholarship](https://jknperak.moh.gov.my/hsmanjung/v2/index.php/berita-terkini/ayush-scholarship-scheme-offered-by-the-indian-council-for-cultural-relations-iccr-for-the-academic-year-2024-25) - 3 slots for Malaysians\n* [Global Korean Scholarship](https://www.studyinkorea.go.kr/ko/expo/nationExpo.do?expo_no=103&img_se=NATI)\n* [The Kingdom of Saudi Arabia Scholarships](https://studyinsaudi.moe.gov.sa/)\n* [CIMB ASEAN Scholarship](https://www.cimb.com/en/careers/students/cimb-asean-scholarship.html)\n* [DAAD Malaysia: German Academic Exchange Service](https://www.daad-malaysia.org/en/)\n* [MOE Taiwan Scholarships](https://www.roc-taiwan.org/my_en/post/7090.html)\n\n",
        "num_comments": 111,
        "comments": [
            "Our older Nyets have very kindly offered to answer any questions you have on various fields, scholarship advice and working abroad :) Anyone is very welcome to ask, even working Nyets!\n\nIf you would like to volunteer to answer enquiries, let me know in the comment section!\n\n**How does this work?**\n\nDM any of the volunteers or ask questions in this thread (be sure to tag them), up to you!\n\n# Post-SPM Advice\n\n**General career guidance**\n\n* u/snel_\n\n**UPU/AUSMAT/Matriculation/STPM/A-levels/SACE advice**\n\n* u/kayristar - advice on UPU and public uni experience\n* u/baokaliao - A-levels\n* u/afyqazraei - General Academia pathway\n* u/Emotional_Bedroom152 - Matriculation\n\n**Scholarship Advice**:\n\n* u/SnooCauliflowers4828 - Scholarship/funding opportunities (local and abroad) and volunteering\n* u/Localvity - Scholarship advice (former Yayasan Khazanah scholar)\n* u/Repulsive_Rip_898 - Advice and tips on how to look for & prepare for scholarship applications\n* u/stuffsurgeon - Singapore ASEAN Scholarship and STPM experience\n* u/afyqazraei - Japan MEXT Scholarship\n\n# Career Advice (arranged in alphabetical order):\n\n**Arts and Creative Industries**:\n\n* u/Tomichin - Illustration, Animation\n* u/Iguessthisisfine7 - Working Artist (Animation, Motion Design, Illustration, Storyboarding, Freelancing, Merchandise Making)\n* u/Donnie-G - 3D Games Industry\n* u/midobim - 2D animation Games Industry\n* u/Fun-Rhubarb-874 - Graphic design\n* u/sevenfourfive  - Graphic Design\n\n**Construction and Property Development:**\n\n* u/imaginelizard - Architecture, Town Planning, Landscape Architecture, Interior Design\n* u/mrpokealot - Property Development (Marketing, Sales, After Sales, Business Development/Land Acquisition, Retail Management)\n* u/BedrosBoost - Mechanical and Electrical Engineering, Consulting for Civil & Structural Engineering, and Architecture\n\n**Data Science and Machine Learning**:\n\n* u/Kind-Grapefruit4404 - Data Science, Machine Learning/AI\n* u/Unique-Prompt8158 - Machine Learning, Natural Language Processing, Research\n\n**Economics and Business**:\n\n* u/acausa - Economics\n* u/Localvity - Economics\n* u/mattiKari - Mass Communications, Business Writing, Journalism, Banking\n* u/yuiop19 - Sustainability/ESG (Environmental, Social, Governance)\n* u/Sultanified - Finance industry\n* u/Shenlong727 - Research in finance industry\n* u/exroshann - Accounting, corporate finance and data science\n* u/Super5toner - Economics, Business and Corporate Administration\n* u/dotsip - Human Resource Management\n* u/h3ret1c - Commercial Analytics, Management Consulting\n* u/c-fu  - Enterpreneurship\n* u/Mag_careeradvice - Economics & Finance, Corporate Finance/Strategy\n\n**Education and Training**:\n\n* u/charlesbytes85 - Education, TVET (Technical and Vocational Education)\n\n**Engineering and Technical Fields**:\n\n* u/icemountain87 - Chemical Engineering\n* u/HummingHamster - Computer Engineering, Software Engineering, Physical Design Engineering\n* u/InterestingBake8358 - Engineering with insights for edible oil, oleo chemical, oil & gas, industrial gas, and green fuels\n* u/stuffsurgeon - Semiconductor industry, Electrical engineering\n* u/somehuman03 - Mechanical Engineering/General Engineering\n* u/RaY_OF_HoP3 - Software Engineering, computer science (ML/AI, Sentiment Analysis, NLP) and DevOps engineering\n* u/dynamohenshin244 - Geomatic Engineering and land surveying\n\n**Information Technology and Computing**:\n\n* u/tophthemelonlordd - IT (Automation)\n* u/gileotak - General IT career advice, IT Operations\n* u/The_XiangJiao - IT (Quality Assurance; Manual/Automation), IT-related internships\n* u/BlazeX94 - Software Engineering\n* u/stuffsurgeon - Computer Science\n* u/mortarteam91 - Computer Science\n* u/depguymy - Software engineering and internship opportunities\n\n**International Study/Working Experience**:\n\n* u/stuffsurgeon - Studying/working in Singapore and USA\n* u/baokaliao - Studying in the UK\n* u/Unique-Prompt8158 - Studying in USA\n* u/Fun-Rhubarb-874 - Studying/working in Australia\n* u/icemountain87 - Studying in Singapore\n* u/mortarteam91 - Working in USA and New Zealand\n* u/afyqazraei - Studying in Japan\n\n**Law**\n\n* u/baokaliao - Law (transitioning from a STEM background)\n* u/mooglehentai - Law and Litigation\n\n**Marketing and Advertising**:\n\n* u/ZzLow96 - Digital marketing, advertising, influencer/entrepreneur and ACG\n* u/Localvity - Advertising\n* u/afaz77 - Advertising/martech/consulting or agency life on a whole, with emphasis on\n\n**Medicine and Health Sciences**:\n\n* u/Nic8318 - Medicine\n* u/jkuddles - Medicine\n* u/cryinginlibrary - Biomedical research, labs, and clinical trials\n* u/Not_FamousAmos - Veterinary medicine\n* u/SnooCauliflowers4828 - Psychology\n* u/fishiefisho3o - Veterinary Medicine, Animal health and Husbandry, Vet school interview\n* u/skull_gey  - Pharmacy\n\n**Miscellaneous/Niche Professional Fields**:\n\n* u/snel_ - Counselling, psychology\n* u/Mrsourceplz - Librarianship, library-specific software, public relations\n* u/RhinneXChronica - Astrology\n* u/TempoMinusOne - Aviation e.g.questions about flying and life as an airline pilot\n* u/Weekly-Supermarket40 - Ancient History and World Heritage or general humanities related queries\n* u/sevenfourfive - Customer Service\n* u/Practical-Lady2021 - Social work and evidence based intervention\n\n**Science and Research**:\n\n* u/BadgerFig - Astronomy and Astrophysics\n* u/Elk_Upset - Astronomy\n* u/jaip93 - Wet Lab, Infectious Disease, Cancer Research\n* u/raidpanda - Actuarial science and Statistics\n* u/Accurate_Ad_1826 - Actuarial science\n* u/karlkry - Marine & environmental science\n* u/afyqazraei - Physics, specialising in particle physics",
            "Wow wish I had this during my time",
            "If some kiddos want to have a future in the automotive industry, [Mercedes-Benz Malaysia has an apprenticeship programme](https://www.mercedes-benz.com.my/passengercars/brand/mbm-apprenticeship/mb-apprenticeship.html).\n\nI'll be happy to answer some questions and give advice on the programme.",
            "I can try to provide help for anyone having questions on:\n\n- University Malaya & PASUM\n- Physics (especially, Particle Physics)\n- Japan MEXT scholarship\n- KPT MyBrainSc scholarship \n- General academia pathway (i.e. want to become researcher/lecturer)\n- General studying in Japan\n\nI may not have all the answers, but I have multiple contacts I can ask to",
            "I recently got my result and am proud of myself\n\nhttps://preview.redd.it/mm68aazq7o3d1.jpeg?width=1080&format=pjpg&auto=webp&s=5f2e5ead36f308590620eb3e0c0e040a833620e7\n\nNow I can get into a diploma for a lot of stuff, I'm more interested in these ones (These are the top three I'm going for):\n\n1. Diploma in Computer Science\n2. Diploma in Accounting\n3. Diploma in Sains Matematik Anything about these diplomas I should know more of?",
            "this is one of the reasons why r/malaysia is so much better than r/bolehland. there's actually things like this readily available.",
            "Hi guys, feel free to ask me anything about Enterpreneurship. add my name lah OP. These are the things that what I have done and are still currently doing for 20+ years:\n\nmusic - first and longest drumline group, most show performed by a music band in msia, teacher  \nmedia - tv and film producer, director, (ex) actor, etc.  \ntech - storage specialist, AI, iot, automation  \nmining - one and only company with a processing factory in msia  \nbus - first (and only?) local branded aircond manufacturer in msia last time (for intrakota, proton waja, etc)\n\n  \nthere are a few more, but just tag my name and I'll probably have an experience in that field- eg. valve, petrochemical complex, taxi/bus, water telemetry). Some of the FAQs that I got over the years:\n\nSo you suck at SPM. game over right?  \nHeck no! a kampung guy in (almost) all sense of life metric a loser, is one of the very, very few expert metallurgist IN ASIA in kuantan - the kind of guy who can tell you the % of Carbon in coal just by looking and feeling.\n\nSo you're nowhere near big cities. game over right?  \na friend who flopped hard on spm, turned his life around by following the tvet road, is now a contract worker doing welding and diving every few months earning 6 digits in a few weeks of work. \n\nHow important are academics to be successful in life?  \nNot related to be honest. Being good academically, or being good in working life, both don't need to be related. Not all successes are measure-worthy, this is the key takeaway point. My grandmother only was in school for a few years, have rm20+ in the bank, but raised 14 kids on her own, and have 6 figure assets in terms of gold and diamond luxury accessories around her body for trading (now), keeps the gold and cash in her room and her bra. doesn't care about politics, doesn't care about causes, doesn't care (too much) about the environment, just care about upbringing. since only us and her buyers know about the gold bangles and necklaces and shit, in all metrics she is a failure in life.\n\nSo what good is SPM then?  \nmy own opinion after 40+ years of living, is that SPM is really good to instill good behaviour, long-term and CONSISTENT learning - consistently doing something over and over and over again to reach a long-term goal that's only measurable in the form of time (makin lama makin near the goal). that's the only metric that you need to evaluate yourself, not the grade. this is the most important life skill that you can have. so if you fail this, now what? you have lots of chances after - college, uni, work, etc. it's not the end of the world.",
            "Currently doing pharmacy (student), anything related can ask me 👽",
            "Can I join the list? I am an actuarial science graduate",
            "https://preview.redd.it/rpcwhcwjun5d1.jpeg?width=900&format=pjpg&auto=webp&s=e2a9146f1551892a36ec6b6a8b200051e44aae1d\n\nCan I post this scholarship opportunity here?",
            "Hi guys, if any of u have questions about matriculation can dm me ok? Especially since i just finished my journey today heheh",
            "After getting SPM result. Checked which course i should head for. But in the end only art related course seems to pique my interest... I have absolute confidence and motivation for it. Wanna go for 3d modeling and animation but theres doesnt seems much use in this country ( like finding job)even my parents are worry bout it and suggest to choose other course.\nCan help? Like is there any other better options or theres actually ppl hiring these which i particularly dont know bout. Art has been my passion from the start. Thanks in advance .",
            "Hi, I'm looking at my options, and honestly I don't qualify for many scholarships, with requiring 7/8As not including A-s.\n\n\n\nI got 3A+ ( BI, Math, Sej ), 2A ( Add Math, Physics ), 3A-  ( Chem, PI, BM ), and 1B ( Biology ). Interested in more stuff leaning towards Engineering +/ Technology related.\n\n\n\nUPU applied for first choice Kolej Mara Kuala Nerang, for Asasi Engineering and Tech feeder into UTM. Will try applying for YTP Mara and The Star scholarships. But I'm unsure on YTP Mara, trying to find more info on it, like how it's not an actual scholarship, more towards Pinjaman Boleh Ubah? My family isn't that well off, so I don't wanna apply something I'll regret in terms of cash problems. Plus the experience overseas and all. Whether worth it or not. All that stuff.",
            "Would love to be a part of the list. Social Sciences.",
            "Just posting here. \n\nBursaries/Scholarships to get AAT (Association of Accounting Technicians, UK).\n\nFrom AAT itself: [https://www.aat.org.uk/qualifications-and-courses/fees-funding/bursary](https://www.aat.org.uk/qualifications-and-courses/fees-funding/bursary)  \nYayasan Peneraju Pendidikan Bumiputera (Training Provider is SSTC): [https://sstc.com.my/yayasan-peneraju-pendidikan-bumiputera/](https://sstc.com.my/yayasan-peneraju-pendidikan-bumiputera/)   \nMITRA (Training Provider is SSTC but closed for now, wait for new intake):  [https://sstc.com.my/mitra-scholarship/](https://sstc.com.my/mitra-scholarship/)\n\nSSTC also offers 50% scholarship depending on your result for SPM. Do check with them directly. (Email: info@sstc.com.my)  \n  \nAll the best! AAT is just another alternative route into the accountancy field, after AAT you will gain exemptions from ACCA, CIMA, ICAEW, etc. AAT solidifies your foundation in accounts and was helpful for me in my CIMA papers.",
            "I got 9A and 1B(Add math) for spm but still couldn't manage to get into matriks so I did rayuan. Does anyone know how long it would usually take and do I have a chance to get the opportunity. I feel quite discouraged because I saw many people with results not as good good as mine but still manage to enter. I'm a non bumi btw. The people I mentioned are also non bumi.",
            "https://preview.redd.it/cocrv18qs53d1.jpeg?width=1080&format=pjpg&auto=webp&s=406e15164dfdf798e61e538e3382df2876639014\n\nWhat do I do? I got my results yesterday and I'm pretty disappointed and clueless. I don't know what to do now? How do I apply for government universities even if the chances of me getting in is very low? What so I have to study now if I want to pursue my education in psychology in the future? Do I study foundation in arts? Please help me.",
            "so my SPM results came back, and I got an A+ in BI, A in math and science, C in moral, and the rest were just passes (D and E).\n\nI was gonna take a foundation for a compsci/cybersecurity degree, but pretty much all of them require me to get atleast 5Cs, but I only have 4 credits.\n\nSTPM and A-level are also out as they require 5Cs too, and STPM has a mandatory pengajian am subject which I don't think I'll be able to pass easily, let alone get a good grade in.\n\nWhat do I do now? So far, it seems like I could apply for public unis, but I don't know whether I'll be accepted into the courses I want since I'm non-bumi.\n\nI could also just go to work as an intern for a networking related company, and collect certificates, but this route forces me into that field of technology, though those certificates and experience could be useful in other fields.\n\nOr is it possible to apply for private unis anyways? I got As for the important subjects, but since SPM grades fluctuate based on the average performance, and also because I didn't take addmaths or was in the science stream, I'm not sure if I could negotiate my way in as my grades aren't particularly impressive in the first place.\n\nI could also retake BM, since I got C in my trials, but the chances of me getting that grade is kinda 50/50.",
            "I applied to recheck my result, how long does it usually take to be processed?",
            "im contemplating between pursuing ACCA or science comp/ IT. which choice is better ?",
            "what is the best pathway to vet medicine after pursuing matrikulasi?",
            "Anyone in music?",
            "helo ppl i just want to ask if one can retake spm after skipping the first spum \n\nheres my situation: i have 5 creds in spm currently but my bm is a D. i want to retake spm so i can potentially get better results and get a C on my bm. But the spum this year is in oct which will be two months time from now. i would like more time to study so thats why i would rather like to retake spm next year. Is that possible?",
            "Hello, [](https://www.reddit.com/user/Kind-Grapefruit4404/)! I'm currently a Form 5 student, but I would like to know how you got into Data Science, and how the job market/industry is nowadays, especially in Malaysia, thank you :)",
            "I am about to finish my computer science honors in 2 years at same time also given opportunity to do MA in education. I'm intrested only if it can get me a job as teacher or even assistant researcher/professor at university level. Please let me know as your guidance can save my alot of worth while time or it can not be useful at all at university levels.",
            "hii im planning to continue my degree study in geophysics but ive read somewhere science course not that worth in malaysia (job opportunities, salary etc). i hope someone can enlighten me cz i really wanna study geophysics but at the same time kinda scared if i cant get job in future :(",
            "I took my SPM during the mid 2000s and I remembered to be given similar informations by my Boarding School and I was pickup by JPA domestic scholarship. \n\nTbh, this was biggest advantages of Government Boarding Schools is the alumni and the number of scholarship that we could apply using our trial SPMs.\n\n\n\nI also remembered my junior went back post 2015 to our alma mater to give career talk and gave a very passionate talk to not pursue medicine unless you are passionate because field of medicine was and is a shit show. ",
            "Thanks! Would you also like to make a post to share about this programme for more visibility?",
            "Thanks! I added you to \"Science and Research\", \"Scholarship Advice\" and \"Working/Studying Abroad\".",
            "Nak lab report dan tutorial PASUM pls. 👉👈 You probably don't have it anymore, but it won't hurt to ask. 😬",
            "Could you tell me more about the MEXT scholarship application process? Thanks!",
            "Computer science is a relatively competitive field. You'll need to do alot of self study and projects to succeed. Only enter it if ur truly passionate",
            "Thank you! I have added your name to the list :)",
            "Thank you, added to the list!",
            "Ofc! Added you to the list, thanks so much!",
            "Thank you and sorry for the late reply, added to the list! \n\nCongrats on completing the journey!",
            "Interestingly, Malaysia is actually quite well known for their 3d modelling and game design outsourcing iirc. We have many game and animation studios around that are constantly looking for new talents to join, as u/a_HerculePoirot_fan pointed out, please do reach out to the Nyets in the industry for more colour and advice. All the best man!",
            "My sister is a full time animator and she talks a lot about how animation studios outsources their labor on countries like ours. There's definitely a potential for a job",
            "Hi! Please check the pinned comment and the list of Nyets under \"**Arts and Creative Industries\".** DM them if you have any questions!",
            "Can't tell you whether YTP Mara is good or bad. But if you want to know what's Pinjaman Boleh Ubah, I believe it's a form of loan payment reduction. This is a rather unique form of loan repayment whereby the amount of loan that you have to repay depends on your CGPA (or academic performance). The better your academic performance, the smaller the amount you have to pay back. The reason why it's not a scholarship is because, well, you still have to pay back some amount of money that you have loaned. Excerpt:\n\n**Apakah yang dimaksudkan dengan Pinjaman Boleh Ubah?**\n\nPinjaman Boleh Ubah (PBU) bermaksud keseluruhan pinjaman pelajaran yang diterima boleh dipertimbangkan pengurangan bayaran balik berdasarkan prestasi akademik pelajar setelah tamat pengajian, tertakluk kepada dasar yang ditetapkan.\n\nKadar Pengurangan Pinjaman MARA berdasarkan CGPA\\*\n\n◾3.5 - 4.0   - Bayaran balik 15% dari jumlah pinjaman\n\n◾3.0 - 3.49 - Bayaran balik 20% dari jumlah pinjaman\n\n◾2.5 - 2.99 - Bayaran balik 25% dari jumlah pinjaman\n\n◾2.0 - 2.49 - Bayaran balik 30% dari jumlah pinjaman\n\n\\*Tertakluk kepada perubahan\n\n  \nSee: [https://www.uniassist.my/post/biasiswa2024#viewer-dt3gw62](https://www.uniassist.my/post/biasiswa2024#viewer-dt3gw62)\n\nYou can outright ask the officer from MARA what the latest rates are, and how the scheme works. Just email them or call them.",
            "Yup it's a pinjaman boleh ubah but the repayment is in installment and there is no interest on the principal amount so I believe that it is worth it on itself and I'm sure the repayment could be negotiated for it to be manageable for you.\n\nAs for the experience overseas, it is also worth it. It may changed your perspective towards different parts of life and you can experience things you may not be able to in Malaysia. Down the line when you felt like living overseas is not for you, you can always come back home.",
            "Thanks! Any specific branch?",
            "Remember that there're only 10% of the matrikulasi seats made available to non-bumis. I hope you have a backup plan, and start thinking of alternatives if you didn't manage to get in the first time. It's rather unlikely that your rayuan will succeed, because you're banking on any of the 10% of non-bumis who got in dropping out to give you a \"seat\" (knowing how difficult it is to get into the program for non-bumis, and how easy it is to secure a seat in local university in your program of choice after finishing the course, it is highly unlikely for anyone to drop out).\n\nI don't think there's any reason why you should feel discouraged. Academic achievement is only one of the criteria that matrikulasi looks at for admission, but they also place more emphasis for folks who come from the suburban rural areas, families with poorer background etc. The system is rigged against you, and there's nothing you should feel ashamed or discouraged about.",
            "Am happy to help share some information on studying psychology, feel free to ask if you're having any questions on this.\n\nI do however wish to ask, are you familiar with all the different post-SPM options i.e. STPM, A level, foundation etc.?",
            "There are only 4 paths to get into local public universities if you insist on getting into one. I'm going to call a spade a spade and list the 4 of them from the easiest (in terms of course material) to the hardest. Options:\n\n1. Asasi (foundation), but this route admits almost 100% bumi only. Almost guaranteed to get a spot in public universities (unless you majorly screwed up). \n\n2. Matrikulasi (matriculation), but this route admits almost 90% bumi only. If you're non-bumi and you manage to secure a spot within the 10% of seats in matrikulasi, please take it. You're almost guaranteed a spot to get into local university. Course material is also relatively easy. \n\n3. Politeknik (polytechnique), if you're non-bumi, this is honestly your most realistic shot to get into local university. Course material is also relatively easy. However the odds of you getting into local university is not as high as Matrikulasi or Asasi.\n\n4. STPM (formerly known as HSC), if you're non-bumi, this is an alternative to politeknik. I took STPM, so I can tell you right away, it contains the hardest course material out of all of the alternatives presented to you. At least back in my day, it's harder than Cambridge/Edexcel A-levels, Australian matriculation, IB, Canadian Pre-U etc. Without accounting for the Chinese Gaokao (which is on another difficulty level), STPM is probably on a similar level of difficulty to IIT JEE (India) and Singapore A-levels internationally. The only other pre-university path that has similar difficulty level to STPM in Malaysia is the UEC (Chinese independent exam). Because of the difficulty of STPM, I generally advise against taking it, unless you're absolutely sure you are going to work hard. Otherwise you will suffer. Also, there's no guarantee that you'll get into public university even if you get good grades (unlike Asasi or Matrikulasi). \n\nNow, if you're interested in psychology and public university locally, your best bet is politeknik. I honestly wouldn't even consider STPM an option based on your SPM grades, unless you work really hard. Another option is to go the route of private local university if you're open to it. You'll need to pay, but there's always PTPTN loans.",
            "Have u considered stpm?",
            "First consider what your main interest is.\n\nThen, find out all the possible routes to that interest and quantify the cost for each route. Shortest route is normally the most expensive one.\n\nFinally, find out what's the best possible route that you can afford.",
            "i suggest you to retake maths, because that E is not even credit which most universities requires their students to at least have.",
            "Go to Politeknik. You will only need 3 credits (including Maths) to get in. Fee is RM200 per semester. Hostel is RM2/day.\n\nStudy for 3 years. While there, consider what track you want to specialize in. Tracks may include software engineering, networking, infosec etc.\n\nDo well in it, and use your diploma to enter uni. Will take you longer, but who cares as long you get there in the end.",
            "30 days from the closing date (26th June)",
            "Someone DM'ed me and asked me a similar question. For the benefit of all the other students who want to ask a question like this, there's no such thing as which choice is \"better\". Better in terms of what? There are so many angles that you have to look at in order to say which is \"better\".\n\n  \nRather than asking which one is better I urge all the SPM leavers to think about 3 things when picking a course/career path:\n\n1. Think about what interests you. The last thing you wanna be doing is studying a course that you are not interested in. No matter how good of a student you are, spending 3-4 years studying something you dislike will burn you out.\n\n2. Think about what career do you want to pursue, and if there are prospects. This requires you to look at current market trends, and project out to the future when you graduate. Do you want to go into the industry/market? Do you want to be in academia? What kind of work do you want to be doing?\n\n3. If the career you really want to pursue doesn't have prospects in Malaysia, are you willing to move to anywhere else on earth in order to work in the said field?\n\n  \nLook, do I have friends who picked a course in university/college, but ended up doing something completely different upon graduation? Sure, I have seen many. But is this the ideal way of picking a course/path to tread on, probably not. Everyone is adaptable, but if given a choice, I would say that ideally any individual would want to try to pick a course/career path that would match their interests. Then, you let market forces determine whether you switch careers later.",
            "If u want to go for vet med after matrikulasi u can aim for upm or umk in upu. \n\nWarning tho cause veterinary is a highly competitive course since it's very limited in this country. So u will have to grind hard to even get an iv. Also, make sure u get into sains hayat module (preferably) but i think sains computer module is also able to pursue veterinary but try to check again the requirements",
            "Ask the relevant authorities in the school you want to retake. They would give more useful, specific advice compared to the general advice we can give. But in theory, even if you had full A in every subject you should be able to retake. Grades should not be the problem here.",
            "I can't speak to how the market/industry is in Malaysia. I can tell you in general there are a couple of different paths to get into data science, but most data science positions in companies that I know of usually will require an advanced degree (Masters or PhD), or otherwise will require many years of work experience.\n\nI'm going to give you a run down of different paths to getting into ML related positions/work in general:\n\n1. Computer science degree with a focus in AI/ML. This is probably the common path.\n2. Data science degree. I'm starting to see some universities offering undergraduate data science degrees. Not sure how the market will be like when these folks graduate, but I still think that most companies will hire those with advance degrees only for ML positions. Most data science degrees today are at least Masters level and above.\n3. Applied Math/Statistics degree. Since ML is heavily steeped in statistics, usually folks in stats are extremely well suited to do data science.\n4. Engineering. There are 3 engineering disciplines that tend to come into contact with ML. Industrial Engineering/Financial Engineering/Operations Research is one of them, since they are heavily steeped in quantitative analysis. Biomedical engineering, specifically those who work on bio informatics since it has the most usage of statistics. Finally Electrical Engineering, specifically those who work on Signals and Systems (telecommunication, robotics, computer vision etc. fall under this category), since this is the discipline that uses the most amount of statistics.\n5. Physics/Chemistry/Biology science degree . You may think this is surprising, But usually if you're in one of these 3 sciences and you are working on modelling molecular/atomic or quantum behavior (eg protein folding, drug synthesis etc.), you're very likely to have some knowledge of ML algorithms due to the nature of your work.\n\nHonestly it really depends on what kind of data science job are you into. You can DM me if you want more information about how I use AI/ML in general in my work.",
            "unless you want to go into oil and gas, it isn't really worth it",
            "On top of what another reply said, there are two fields that comes to my mind which need geophysics. One of them is oil and gas (most lucrative), the other one is mining. This is from a private sector side of things. If you want to be in academia then the answer is different, since people go into different fields in academia for purposes beyond monetary gains, and most of them end up in their fields because of passion or an interest to serve a greater purpose.  \n\nThis is more personal, but my advice to students who are interested in fields that are in the niche areas, is to look beyond the boundaries of Malaysia. Unless you have a strong fear of being mobile, you should not restrict yourself to opportunities in Malaysia especially if you're really interested in a particular field. But this is really up to personal choice and preference.",
            "Sure",
            "Me to my tutorials, right after I left PASUM:\n\nhttps://preview.redd.it/y878xcm8ea3d1.jpeg?width=620&format=pjpg&auto=webp&s=accc41f94bdd0177988fe9174257f9b3dddb7d3c",
            "The application round for 2025 embassy recommendation intake is over, so your best bet for an undergraduate application is for the 2026 intake\n\nApplications usually open around March/April every year, but it is very competitive and less than 5 students per year get to go (for postgraduates, it is up to 25 people per year for embassy recommendations)\n\nYou will be eligible to study in basically any university in Japan that can accept you, though the given scholarship is not as generous as JPA/Petronas ones but the positive aspect is there are NO bonds or requirements to pay back (i.e. its a free scholarship)\n\nMy advice is to go through standard pre-university first (e.g. foundation, matriculation, STPM) and then apply next year\n\nIn any case, you should know the result before your degree starts in 2026 and still have a back-up plan in case you didn't get it\n\nActively check the Japanese Embassy website for more information especially around February\n\nIf you come from a family with good finances, there are multiple other routes you can explore to study in Japan",
            "Can I be added as well. Economics & Finance graduate. Career experience in Corporate Finance/Strategy",
            "Thanks for the replies both of u. Will look further into it. Thanks again.\nThose who are reading this and able to help pls do so, really need more advice. Really appreciated.",
            "Note also that for First Class or the CGPA equivalent, they are open to considering appeals to forgive the 15% remainder (effectively converting into a full scholarship).",
            "Social work and evidence based intervention!",
            "I see thanks for your insight. I'm also waiting on for UPSI to see if I got in there but so far I'm joining STPM cuz both the rayuan results and UPSI results will be announced late. I have another question as well. If I got a spot in UPSI and found out a week later that I managed to get rayuan for matriks can I stop my education in upsi and still join matriks?",
            "I thought about it and decided that I don't want the high school environment again",
            "oh, i didn't even know that was an option. thanks!",
            "Thanks!!",
            "hmm i think sc is also viable since the requirement for vet med needs at least grade B in biochem, both of which are present in scicomp module. i'd very much prefer sains hayat though since that's what i'm most familiar with huhu idk how matrikulasi placement works\nand thank you btw!",
            "Wow thanks! I didn't know that most Data Science jobs needed masters, as I heard that the CS industry accepted bootcamps and just basic degrees. Now I might consider doing statistics, but I really don't know. Thank you so much for the details & advice! It really helps me get a better perspective of what I might need to go down this path. I'll be dm-ing you on how you you AI/ML in your work, thank you once again!",
            "Thank you, added!",
            "Thank you, added to the list!",
            "You can always drop out of one course and join another. Just ask UPSI student services and registration. Because UPSI is a public university, they'll likely understand. When I was in lower sixth form the class was initially double its final size, but eventually people started dropping out to go for IB, A-levels etc. This happens more often than you think.",
            "Good luck!",
            "Once you've registered they'll randomly give u a module but you can always apply to change it. You're welcome btw!",
            "Just to be clear. Data science jobs can mean anything. There are folks who work on database management and data cleaning. Those are critical roles when it comes to data science. But if you want to get into the more algorithmic side of things then that would usually require advanced degrees or many years of experience. This is because in order for you to derive meaning out of data, you need insight and experience, which can only come with time.",
            "Okk thank you so much ^^",
            "I see, but when I mention data science, i was more of referring to the finding & communicating results/data part of the job, not sure if it is algorithmic per se.",
            "Finding data usually falls into the area of subject matter experts. If you're talking about marketing data, or business data (like surveys etc.), that would fall under software engineering for data collection and maintaining a database of user feedback. If you're talking about other kinds of ML like obtaining data from simulation of protein folding, satellite data for weather forecasting, or other kinds of data like device (IOT or edge hardware) performance data, these usually require some level of subject matter expertise. There's a reason why being a subject matter expert + having knowledge of ML techniques is a combination of skillset that's heavily sought after in the market. \n\n  \nCommunicating results usually isn't a separate role. The researcher who's involved with designing algorithms to sort and analyze the data usually presents the results/insights. Ask yourself, if I did all the work to design a methodology or visualization of the data to obtain a conclusion or insight, why would I need someone else to present the said results? Wouldn't the person who was involved in the analysis be the best person to communicate the results?"
        ]
    },
    "BRUHH!! That's why soo many people are at TRX today": {
        "title": "BRUHH!! That's why soo many people are at TRX today",
        "score": 298,
        "url": "https://i.redd.it/6morbsil538d1.jpeg",
        "content": "",
        "num_comments": 79,
        "comments": [
            "That who they are scalper mindset remember their face",
            "knowing malaysian culture\n\nnot surprising\n\npaperbag mcd newjeans pun resell balik harga scalper lol",
            "Yes, they just q for this 😂",
            "Typical display of excess consumerism",
            "Suddenly hustlers now instead of boikot",
            "Rm20 take it or leave it lol",
            "Desperate fckers",
            "When a tote bag costs RM 200, you know it's marketed to fans only.",
            "sow high many many",
            "and dumb people will pay for them 😌",
            "RM 0.99 bag, RM 299.01 the brand 💀",
            "If I owned a luxury brand company, I would just slap my logo to a pair of slippers, price it RM1000 and call it a day. Ez money",
            "Rm550 wth",
            "Lmaoo 2 hours just for this, do they really dont have better things to do?",
            "What is totbag?",
            "Damn it should have gone and queue",
            "WOW I also wan to go now",
            "So what? It's just a free tote bag, not a free iPhone. 🙄",
            "People are queueing in order to sell bags? I'm so confused",
            "Why would anyone buy that from them? 😑😑😑",
            "You gotta be dumb as a motherfucker to buy any of that shit 😂",
            "Dumb SHEEPLE",
            "I swear to God. Sometimes I feel like Apple consumers are just a huge cult.",
            "Not a bad thing to do on a weekend actually",
            "When B40 people does it, It's scalping. When T20 people does it, It's investment. 😏\n\nT20 people go out and buy houses, calls it an investment, then flips it for profit later on. It's the same shit.",
            "Buat gi kelas kt uni mmg nampak terpaling cool",
            "Do people actually buy?",
            "Fcking knew this was gonna happened 😭😂😂",
            "What the actual fuck",
            "Just for a damn tote bag?",
            "All those God damn people",
            "End stage capitalism doing its thing baby.",
            "This thing only worth piss whoever buy this must been an odd",
            "Lol i still prefer my ikea bag",
            "so whos at fault? suckers who bought them or those just finding quick money?",
            "When there are still stupid people. Even a shit can make a fortune",
            "Thanks for answering this question in my head all day 😂",
            "lol Apple saves on packaging materials for iPhones etc only to use extra cardboard for a tote bag",
            "These mf are the reason why a simple hotwheels proton saga went sold out and the current price is between rm50 to rm80. if our currency is not that bad, i would have bought one from the states lol.",
            "Like a moth to a flame",
            "Orang Malaysia desperate dah Sia 💀",
            "Xpelah, bagi percuma pun tak nak",
            "Try very hard.",
            "who actually buys this for rm200-300 lol",
            "Expected 🤷‍♂️",
            "Filthy punchable scalpers selling to blind and ignorant Apple sheep\n\nWhat harmony",
            "Time to report them and get them banned 😋",
            "Herd mentality.",
            "Scalpers ate so good throughout 2020-early 2022 that they are now delulu",
            "What if I don't give a fuck\n\nAn apple tote bag worth more than a Dior tote bag? I don't think so.",
            "Is the bag free?",
            "Better simpan",
            "I'll hold of for the Tote Bag Pro or Tote Bag M4 Max",
            "Waste of my brain memory. Just don't buy scalped items",
            "look it's a new me, switched it up, who's this? paperbag newjeans, not fresh, not clean",
            "I think it's a worldwide thing. People will always buy limited edition things and sell it at outrageous price",
            "Queue*",
            "\"Best I can do is twenty bucks and I am taking a risk here\"",
            "I dont think they would disagree with you. If they make minimum wage this is a decent opportunity for their time.",
            "only fans you say?",
            "And apple fans are infinitely more brand-stupid with deeper wallets.",
            "i’m sure those luxury brand company didn’t think of that…u’re a genius",
            "If you do own a luxury brand company, you can slap your logo to a pair of slippers and price it rm1000 and make ez money fo sure. Now, you actually owning a luxury brand company? Report back when that happens",
            "Well..thats just the reality.\n\nPeople that can afford it dont give a hoot how absurb it is. Just for that brand value its worth it for them.\n\nRemember supreme? They sell a literal brick for thousands of dollar and people still buy it",
            "Large, open bag, normally with 2 large handles. Normally made of simple, durable material. Like those bags that people use to carry their own grocery at the supermarket.",
            "Those recycle bag, but branded.",
            "Bag kain",
            "It's a basic white bag with JOM and Apple The Exchange TRX written on it. Only one bag per box.\n\nhttps://youtu.be/lqjFRtHCWoY?t=9m2s",
            "+1",
            "Yes, free for the first 100 people who came to the store opening today.",
            "Errr…. Thanks?",
            "Short form, brother",
            "get a load of this guy",
            "Higher credit card dept."
        ]
    },
    "Who is visiting the Apple Store in TRX today?": {
        "title": "Who is visiting the Apple Store in TRX today?",
        "score": 430,
        "url": "https://v.redd.it/zj2f0jl0f18d1",
        "content": "",
        "num_comments": 236,
        "comments": [
            "people going there for tiktok and instagram value\n\nweeks later dont give care edy",
            "Are they giving out free phones? Why are people queuing?",
            "Apple Store by itself is not that special. everything you want can by in reseller like Machines or Switch. \n\nBut having an Apple Store means Apple is considering ASEAN an important enough market that they will bring out all of Apple products and services to ASEAN in general and Malaysia in particular. \n\nWe didn't get the HomePod, Vision Pro, Apple services like News+, Apple Watch Hermes edition, and offers like back to school, etc. \n\nApple Store itself, is just a nicer Machines, but it means that Malaysia is now in their global rollout plans.",
            "Malaysian complain ekonomi tak baik, tapi so many people cannot wait to give money to Tim Cook.",
            "Just an update for those that might care: they ran out of totes a while back and now there’s no line",
            "Laughs in Android\n\n![gif](giphy|10mzF0YmVmZNuw)",
            "Would not subject myself to a possibly 3 hours line to see the same old boring products. Not even if they’re generous enough to handle a voucher is worth it. Queue for what? Selfies and a tote bag? Embarrassing. Typa bs only poor people like doing",
            "everyday I thank god I am not a brand loyalist\n\nalso to the top comment; case of member hutang nak beli iphone untuk showoff kat soc med lol. losers",
            "Of course .... New toilet Mah... Everyone wants to warm up the seats before it getting cold especially those social media content creator ....",
            "i honestly don’t get the appeal — all stores look the same because it’s supposed to be minimalist and clean. i went to the famous apple store in shanghai (the one that opened at the old microsoft space), which did have quite a lot of people milling around, and it felt the same as an apple store in singapore.",
            "How many of them are actually B40 by salary and still haven’t owned a house yet?",
            "Luqman Podolski saw the future of Malaysia back in a day. History repeats itself.",
            "To see the same iphones in Machines and switch... 🤔",
            "[\nApple Matches Donations to IDF and Illegal Settlements, Employees Allege](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://theintercept.com/2024/06/11/apple-donations-idf-israel-gaza-illegal-settlements/&ved=2ahUKEwjB763hnO6GAxXmlK8BHY9OAbAQFnoECBoQAQ&usg=AOvVaw0AueW90H2MLCa3-pCjgAH5)\n\nSurely this must be a boycot? /s",
            "People really work 5 days a week and wake up on a saturday to go to a mall and stand in line for hours for some some free shit ahh? If i told my parents this, they would give me 2 tight slaps for even thinking such dumbfuckery.",
            "People got a lot of free time for sure",
            "It’s insane how much a following Apple has cultivated. Apple stores have become a tourist destination of sorts lmao.",
            "Nope because I'm ✨broke af✨",
            "What are the pros of using Apple products compared with Android? Is it practical and convenient for work? There was one time me and my colleagues were having a gathering in office. I realise I was the only one with Android phone. The rest were Apples. \n\n\nEdit: if you leave the Apple brand out of the equation.",
            "unless theyre giving out free phone for the first 100 people i dont want to be associated with apple.",
            "I went to changi one. Can’t see what so awesome with it. Oh, but the changi got a stage in the middle where there was some lady from Apple teaching people how to take pictures using an iphone. Quite nice.",
            "Aiyer why all the comment here so salty one ![img](emote|t5_2qh8b|26554)",
            "Terpengaruh benda keinginan menjadi benda keperluan. Bila bandingkan diri dengan \"influencer\" yang menunjuk2 hidup mewah, kau rasa macam kau tak cukup. At least tu pengalaman aku sebelum uninstall Insta.",
            "Watching this video while online ordering my next iPad 😂🙄",
            "Just replaced my iPhone last year, no need for all this chaos🙃",
            "Is it all apple stores have the same products?",
            "Free recycle bag",
            "Apple Temple opened its door to Malaysia",
            "Two types of Malaysians: \n\n- those in the queue \n- those watching those in the queue",
            "I am a Samsung user, but I must admit, this Apple store is so beautiful and spacious 😍",
            "it's much smaller than I thought... I genuinely expected it to be way bigger",
            "I’ll go there maybe after a couple months when the hype has died down.",
            "I can understand the crowd, just as when the first Apple Store opened here in Singapore back in 2017.",
            "Can't you buy apple online??",
            "Those who genuinely want to buy something, you might want to consider reserving a shopping appointment with a specialist for priority service among the sea of onlookers.\n\nhttps://preview.redd.it/arkeopwuu38d1.png?width=2752&format=png&auto=webp&s=38c2d9a6ce82fa89629690d7b10caddadf0352b0",
            "Went there 2pm, no more queues dy. Can come in, see the products, then left. Same same, no discounts for me to purchase.",
            "Isn't this store the same as any other apple reseller stores? Is there anything special about this store besides the free door gift? Why are people lining up like it's the first store that sells apple products?",
            "If you guys can count the number of people there today, you can sleep extra sound tonight knowing that is exactly at least how many people you are better than.",
            "I cant imagine queuing up for a fucking phone that is more expensive than a good desktop pc (some phones can reach up to 4 thousand MYR)",
            "Guys relax. I wouldn’t mind going because they have free workshops too. So get all your heads out of your ass and high horses and maybe go find an Android Store that has this. I don’t gaf.",
            "1000 go in. 1 come out with apple product. The rest there to contribute their part to congestion.",
            "Imagine if something goes wrong, satu kali can reduce the number of manusia bangang at one go. Same people who bitch about prices increase in Nasi Lemak bungkus but happy to pay for an overpriced gadget.",
            "While me who doesnt even yet go to TRX. I think its a luxury mall only for rich people hahaha.",
            "The apple worhsiper",
            "People hv turn to be so dump now day... u spend ur money to be treated such away... customers are taken for granted for the sake of brands...",
            "So fucking cringe. Mcm banyak muka2 melayu acah2 boikot je. Lembu.",
            "\"Apple Tu tak same mcm McDonald's. Kami takde alternative!\"\n\nhttps://preview.redd.it/gqhy0b48t18d1.jpeg?width=749&format=pjpg&auto=webp&s=4471ae9beebb66f7a4e4678d29f7b269410e60e5",
            "Are the ones in baju hitam employees?",
            "Expected",
            "aku heran dgn orang yg sanggup beratur panjang utk dpt diskaun/free gift tak seberapa\n\nbagi aku, masa aku lebih bernilai dr segala2nya & kalau mmang urgent, aku willing utk bayar lebih sedikit utk jimatkan masa. kalau tak urgent, better sabar sekejab tunggu bila tak ramai org",
            "Oe oe i know cultism and hired actors to artificially create a queue.",
            " They’re just there for the hype, snap a few pic for their social media then exit. What a waste if effort and time. What a laugh",
            "Why the author of the video is there? Did he get the free gift as well? ",
            "While I don't hate their products some of their decision is genuinely interesting to me, like the most recent is the ability to sort application literally anywhere on their iPhones",
            "It's great. Bring more people to the balconies, and specially, keep on piling against the guardrails. You'll find out just what were the engineering tolerances and how much construction codes enforce them.",
            "Yo, all of TRX is full?",
            "Apple users think they’re so great. I’m tempted to bring in my Redmi Note 13 Pro to the store and show them what they are missing. \n\nNothing special about Apple. Samsung store is much better as it is ANDROID. We are the smart bunch. \n\nMy friend has an iphone and he may have a gf, but the pride of android can never be beaten. Android and proud! We are not sheeps!\n\nI am not jealous!!!",
            "this looks kinda fucked up. so cultish to dance and sing like a worship song for the brand. please tell me those are the staff paid to do it and not the customers",
            "Lots of judgemental fucks here. It’s their time and money let them do what they want. What’s it to you? People have weird obsessions and interest is that so hard to understand",
            "I wouldn't visit an Apple Store even if it's a 5 minute walk from my house.\n\nThe only thing they got going are the Macs with unified memory which allows you to run large AI models without having to buy enterprise GPUs. Other than that? Just locked down garbage.",
            "gila babi perak jakun",
            "lol sheeple, rather go take a nap than standing just to enter the fancy gadget store",
            "Malaysian: boikot produk Israel dan USA\n\nAlso Malaysian:",
            "I don’t get the hype. It’s just an Apple Store lmao? If this was the FIRST Apple retailer in Malaysia (I’m talking no such thing as machines, switch, etc), then MAYBE I can understand by people will flock there. \n\nPeople are sheep man. One person hype everyone wanna go. 🤷🏻‍♂️",
            "My office buddy says \"abang skan bertambah hansem kalau ada iphone\". Donno if he was joking or not 😋",
            "The FOMO is real.",
            "FOMO at its finest",
            "Ultra cringe hshdhd",
            "Apple fans pilgrimage",
            "Oh god. Suka hati la orang mau pegi. What’s the problem?",
            "It's a cult at this point",
            "Tim Cook is gay !",
            "Android forever🗣️🔥",
            "Sheeps",
            "Waste of time. Ridiculous",
            "Just a bunch of people who are into branding",
            "Way overhyped.",
            "tomorrow in marketplace\napple tote bag 100% original unused RM10k",
            "Stupid Malaysian will boycott or not? Lol",
            "Terpaling Boikot",
            "So many isheeps and apple shills",
            "People are dumb.",
            "We officially have more sheep than New Zealand now",
            "Lol do people there still live in trees?\n\nWhat is the big deal about an Apple store.",
            "Apple no boikot meh?",
            "They are there to boycott",
            "context why?\n\nNew iphone best?",
            "Ramai orang Malaysia kat sini Anwar dah kata tak boleh bertegas sangat pasal putuskan semua hubungan dengan syarikat yg berkaitan dengan Israel?? Baru sedar kut",
            "How many of them are even gonna buy something from the store?",
            "Play Elden Ring DLC better than queueing for some dumb bag",
            "Jakun",
            "The FOMO is real in this video, like apple not even giving out free phones or anything.",
            "People with a very low IQ.",
            "Malaysia is like 15 years late to the apple cult party.",
            "Stupid people",
            "What is this? A cult?",
            "🐏",
            "Apple phone should be taxed more lol",
            "They're supporting the war in Gaza by buying Apple.  Fact.",
            "queue for hours just to take a video to post online to get internet points instead of spending your time on something better lol",
            "look at all of them. like herded livestock.",
            "Boleh boikot Mcdonald..takpi nak iPhone. Pura pura nak boikot isreal produk ..fakers",
            "Sheeples lmao",
            "Its so sad when ppl talks serious abt boycott now they just got bribed by a shirt only wtf",
            "What the... Why?",
            "what is Apple TRX\n\n  \nI know I can google this, but I want to hear from everyone here",
            "Thank you for helping to increase Apple's share price 🤑💰💰",
            "People are wasting their money on unnecessary gadget. That thing cannot even be repaired",
            "Poor people.",
            "Why the fuck would you line up to go to a phone shop?",
            "What's the hype here? I don't really understand",
            "More like the next day noone care alr",
            "Best to go after grand opening. Cant stand large crowds it looks interesting but being there such a headache LOL",
            "Exactly same like opening of TRX",
            "For a freaking tote bag. The fuck?",
            "Because Apple fans (disclaimer not all apples user are apple fans)\n\nThey will buy Steve Job toilet paper if they could",
            "cant wait to see some dumbass try to sell that tote bag on shopee or something for stupid price",
            "For a freaking tote bag. The fuck?",
            "New toilet syndrome",
            "this guy ~~fucks~~ understands",
            "Service levels at Apple Stores cannot be compared to what you get at Machines, which is a typical meh experience.",
            "Um, actually, we do get HomePods in Malaysia. In fact, Siri even speaks Malay. News+ availability is very limited (US, UK, Canada and Australia) though. But they've pretty much made all iCloud services available here from the get go except carrier dependent features on iPhone (Maxis took YEARS and the last telco to enable Wifi Calling and VoLTE). \n\nThen since 2022, Apple started offering more retail related services like Apple Pay, trade-in credits and AppleCare+ warranties. Next launch in 2024 is local Apple Maps, so excited.",
            "> back to school\n\n\nBut recently my wife bought a macbook with student discount? Is it different?",
            "You forgot Apple care",
            "ASEAN is always important. But I can't think the same of Apple, I don't think they are important enough to even consider buying their products",
            "Tim Masak*",
            "Yang complain is the poor people, you don't see me complaining 😒. Besides malaysia has 33 million people, here's like what 2K at most",
            "Tim Apple*",
            "Do they know Tim Cook is gay?",
            "You mean Tim Apple? Whose this Tim Cook guy?",
            "W taste",
            "Way better",
            "120 hz with only RM 700 babyy",
            "I'll keep my resizable keyboard, better notifications and universal clipboard thank you.",
            "1000000% correct.",
            "This. Scarcity mindset in action.",
            "I queued up just now, took 20 minutes or so to get in. Maybe some guys arrived at 7am or something but that’s on them. The painful wait is to find a staff to serve you and then waiting on their runner to fetch the items from the back but you need money to buy stuff for that to be an issue so perhaps not relevant for you.",
            "Too many to count bro. I love seeing B40 owning the latest iPhone while at the same time complaining about their financial problems",
            "Let see,around 70%. Give or take,plus we already have tons of Apple certified shop. Like switch",
            "Lmao the duplicity of the boycott movement. At least I cannot go without food for 6 days max.",
            "The fact that Malaysia hosted US arms companies that literally make the weapons that kill Palestinians shows it's all just virtue signaling. \n\nI actually feel better knowing that politicians unwilling to loose FDI while pacifying the public.",
            "It’s because of the esthetic look and architectural style.",
            "Based and honest",
            "True multitasking. IOS just freezes your app when you switch foreground app. Android can run it in the background.\n\nAnd connectivity. Android can Bluetooth to anything.",
            "More face. More brags. FOMO.\n\nAn Android can do what an Apple can, sometimes 10 times better for WAY less money. Apple products are literally created for the sheeps. Easy to use, and holds social value.\n\nAlso, a lot of Apple users are actually low tech in my experience. To them, Apple is like the pinnacle of technology.  I also know hi tech people who switch from Android to Apple and swear by them.",
            "Some of the benefits of having an official Apple Store are the genius bar appointments you can make, the workshops that apple arranges for customers to attend to make the most out of their product (the one you mentioned) and the official Apple refurbished section, which can be quite cheap and they are often last year's products in basically new condition \n\nHope they'll have it here as well",
            "Those are free workshops, I’ve seen those when I was in Apple Park in US",
            "Right? Just let people do their thing lol \n\nPeople here genuinely love to complain and judge others",
            "terpaling rilek pun lowkey seeking validation dalam internet",
            "Tbf the after sale services are practically non-existent in other reseller stores, whereas you can get Apple Care coverage if you buy from the official store. I heard the services/repairs turnaround time is much better, too.",
            ">  Is there anything special about this store\n\nIt's the FIRST Apple Store in Malaysia.",
            "it's not even for the phone...for tote bag",
            "TBF if your PC isn't more expensive than iPhone, it's mid.",
            "I think I heard this statement from PAS regarding Mercedes",
            "Found the Apple user! \n\n😂😂(am Apple user)",
            "Well according to your comment, people can also comment whatever the fuck they want to",
            "with the 8gb unified memory? hehe",
            "5 minutes?\n\nI wouldn't even go there if the store in INSIDE my house. Hahaha...",
            "u would know that wouldnt ya",
            "Good for him I guess?",
            "Cepat boycotttttt /s",
            "Ingenious. The queue will deter actual shoppers from visiting.",
            "First apple store in Malaysia, many iPhone store u see is actually a reseller",
            "next few hours to be exact\n\nno need to wait tmr",
            "That is the stupidest reason for a queue ever lmao.",
            "Ya rabbi, ppl lining up for uniqlo free tshirt today at pilamid, some ikut from yesterday 🤷‍♀️. Demi sehelai tshirt random.",
            "Probably will resell for such a high price on Mudah, Carousell.",
            "I thot only retirees with time on their hands to line up for free door gift.",
            "Exactly, just a tote bag.",
            "The genius of marketing over priced stuff directly to the dumbest in society.",
            "Can confirm, I am an Apple user and I detest the company. Trouble is they are the best for no hassle use. \nBut this is pathetic, a waste of time and energy.",
            "Steve job bath water?",
            "iPhone 6 onwards no longer have spirit of Steve Jobs, only taste like capitalism",
            "Not so dumb when they earned the free cash",
            "On Carousell more likely.",
            "The staff at machines will stare at you as if you’re going to steal their products.",
            "Apple memang have special education pricing for students/teachers, but right now Apple official store also have additional back to school promo where buying any iPad gets you free Apple Pencil and any Mac gets free AirPods\n\nSo if you buy from Apple official store you can stack the promo with edu discount. From reseller, you just get the normal edu discount",
            "Team masak",
            "#Biar Abang Masak",
            "Stim Masak",
            "Exactly",
            "To be fair though, there's probably a sizable fraction of what can be considered B40 in that queue",
            "Humblebrag I see LMAO",
            "I don’t have money because I don’t waste 20 minutes of my time to buy something that is readily available online or in other physical stores. Alright bud I guess you’re right wow you cracked the code",
            "Why tho\n\nLike genuinely why\n\nWhat do you get from buying there instead of like any other store selling apple products and you don't have to queue?",
            "iPhones are in the same category as Luxury Watches and Cars. If my Samsung A52 is a Casio watch, the iPhone is a Patek Phillipe.\n\nI have people told me straight in the face, not even joking, that an iPhone is a \"bare minimum\" essential item. Essential meaning to create a good first impression with people.\n\nI've never rolled my eyes so hard.",
            "My friend literally asked to borrow money from me to buy a new iphone while he was literally leeching off his friends because he couldn't afford to rent his own place.",
            "They’ll be complaining that house prices are too high and say the prices will go down soon. Newsflash, they won’t go down, it’s either you buy a smaller house or somewhere far and secluded.",
            "Apple Authorized Resellers after sales service is shit unless you buy a ton of stuff like accessories as well.",
            "People shopping at TRX and Apple aren’t really the ones protesting 99 Speedmart",
            "that BDS org talking about how they're selecting for companies that contribute the most to the israel regime and then you have these kinds of people. plenty of people with hijab there from what i can tell who i wont be surprised have palestine flags on their twitter/x handle. jokers, the lot of them.",
            "i got judged for going to mcd after arriving from a flight by a hamas supporter iphone user, i will continue to judge lmao.",
            "Right? \n\nI mean I didn't bat an eye when incels flooded KLCC cosplaying Sailor Moon. Jfc.",
            "Boomer still think it’s mid 2010s and it’s cool to hate on Apple.",
            "I'm not against people checking out the store. I just don't understand who in their right mind would be willing to wait so bloody long, just to check out pre-existing apple products.",
            "Jesus fuck tote bags can be gotten for free in any grocery store, why specifically queue for HOURS for a apple one??",
            "Who needs a 4 thousand ringgit phone besides circle jerking",
            "Here’s your trophy 🏆 What a W",
            "Who’s stopping you lol? I’m just bringing awareness on how salty some of y’all are",
            "Y'know I think that's justified because it's a free Uniqlo shirt.\n\nI got gifted one and damn they're really nice and comfy",
            "Its already going at RM300 to RM550 on carousell. As expected. XD",
            "I used to remember whole families lining up to get free Olay cream last time.. Poor uncle kena forced by the wife.",
            "Reminds me of an old uncle and auntie couple, I always saw them at any conventions, they'll go to every stalls to get their freebies/door gift.",
            "Yeah. I use iPhone too since their first launch in Malaysia. But this is just waste of time. What's the point of queuing overnight to get in the shop? Take some pictures...and then?",
            "Also recent regulations made them better",
            "Indeed, it’s like my wife put it, stupid people friendly.",
            "U mean corpse water cuz he ded",
            "Is it worth though? Imagine the people at the end of the line waiting hours just to get some bag when they could be doing something else",
            "Yeah I saw one for 220 hahaha",
            "This is only the first day crowd that's why. In general Apple stores function is to make it an easy buying experience for the customer. That's why the way it works is that you go and play the laptop/phone you want, then the worker goes to you and handles your enquiry, all the way to payment and setting up. Literally you don't have to move, they do everything. \n\nThat's why they come to you, they run to the back to bring the gadget to you, and they all have wireless payment terminals on them to make the transaction there and then. \n\nAs for the crowd, usually in normal times the amount of staff to customer ratio is nearly 1:1. Sometimes there are even more staff than customers, that's their goal",
            "Maybe when yam cha sembang that time can say \"eh i beli ni from first official apple stor in trx\" \"woahhhhhh\"",
            "Tbf the after sale services are practically non-existent in other reseller stores, whereas you can get Apple Care coverage if you buy from the official store. I heard the services/repairs turnaround time is much better, too.",
            "Jesus, being poor isn't a crime, but having such a poor mindset?!?!",
            "They're literally sucking up to China right now despite the way China treats the Ugyhurs. Says a lot about the movement.\n\nWhy do you think the neighbouring arab/muslim countries aren't taking in the palestinians? Compared to how Europe took in Ukrainians at the start of the Russian invasion?\n\n\nhttps://9gag.com/gag/aZD5LW6?ref=android",
            "What the sigma are u yapping about",
            "Probably FOMO lol. Personally I'd never subject myself to the long wait even if they're giving out free phones, let alone a tote bag.",
            "To flex that they can afford 4k phone. It's really that simple. Nobody really cares about features, there's only so much a phone can improve.",
            "But it’s not worth the time.",
            "Aiya some ppl feel it’s fun ma. Hurts no one so let them lo",
            "If they sell for RM100-200 is definitely worth for 1-2 hour queuing",
            "Damn..",
            "Yea sure but thats not what I'm asking, I'm asking what's the point in queueing for the day 1 opening lol",
            "Regardless what's the point of queueing on the first day of opening?",
            "The poor stays poor that way",
            "Itulah sanggup dia orang. I will just pay for the darn tshirt lol. Some more it's random size and pattern.\n\nThe 1st lady in line apparently ikut from 2 malls cause she missed the quota of that day. I mean 2 malls parking, 2 lunches, petrol - price of the free tshirt. Just buy the damm tshirt already 😭🤣",
            "The first day in line people are those who want the socmed clout. \n\nGet ready to see a flood of social media posts “I got into Apple Store TRX”.",
            "Yeah, like if there is 50% discount offer going on or free phone then I can understand why people que there...",
            "Probably FOMO lol. I personally have removed most socmed from my life (only Reddit left), so FOMO affects me less nowadays, but I do remember the anxiety I felt with the constant stream of posts on the latest trend and hot stuff in town when I'm still browsing Facebook and whatnot on the daily.\n\n\n\nStill wouldn't have subjected myself to the long wait even back then though."
        ]
    },
    "Ouchh, Don't use mobile phone while driving ": {
        "title": "Ouchh, Don't use mobile phone while driving ",
        "score": 319,
        "url": "https://v.redd.it/iomwrguxq18d1",
        "content": "",
        "num_comments": 58,
        "comments": [
            "That's an exit only gate some more.",
            "Waze/Google Maps: ***Turn Right. Turn Right the f\\*ck NOW.***",
            "Thank god most new cars have a front collision alert, it's such a useful feature for incompetent drivers.",
            "Her car was still in drive when she came out. What the brain dead thinking is she doing.",
            "The arrow on the road clearly shows it's one-way lol.",
            "asal time memandu nak main fon? aku tak faham betul la puak ni",
            "I love that during the collision, her Toyota logo fell off",
            "Siap tunjuk muka lagi, as if the other person yang salah.",
            "Nice song bro",
            "Is this dashcam recording from your car op? If yes, Im dying to know what the other car driver excuse was.",
            "Hiyaaaa. 🇦🇺",
            "9761. Can thank me later",
            "bro wanted to 1v1 so much he exit the car before putting it in park lmao",
            "Music was dope",
            "banger song tho",
            "\" I like your sketchers, you like me , my Gucci shoes \"",
            ">Ouchh, Don't use mobile phone while driving \n\nwho? OP or the other driver? clearly this is other driver fault cuz she didn't pay attention to the road sign language 😅 how did op know she playing with her phone inside the car? WE didn't see her play with phone other than op camera lance pov 😅",
            "terpaling multi taska",
            "bawak balai? don't tell me not settle yet",
            "Family guy's asian women driver stereotypical behaviour.",
            "Sketchers",
            "When is there a rap version of sketchers lmao",
            "light light up skechers",
            "Can’t wait for RON95 to hit RM3.20 per litre.",
            "Remind me of one incident that happened near my house. This old man was driving a motorbike, without helmet, while carrying/having a gas cylinder on his motorbike (he was cradling it like it is a kid). To top it, he was talking on his phone loudly ![gif](emote|free_emotes_pack|disapproval)",
            "Wouldn’t it make sense to honk continuously to get the other cars attention? Why go through the hassle of polis / insurance?",
            "Can anyone tell me the dope song title",
            "Playing phone while at junction is murdering",
            "Definition of \"Even if you do everything right, there's always that poor fool that will messed everything up\"",
            "Ok but like interesting song lmao",
            "Typical dumb auto driver cannot let go the phone for 2 seconds. Why we let these morons still driving on the road? Should cancel their license if collision like this happened. Banned them from the road before they end up killing someone. ",
            "![gif](giphy|ZBEnmms00tJt6ZlFtF|downsized)",
            "Skechers",
            "Yup. Noticed that too.",
            "😂",
            "I wished mine was more discriminating with BOB motobikers. Small scare each time the car suddenly stops because a BOB motorbike ride beside the car.",
            "But kinda annoying if cars at the back cucuk2 especially at traffic lights. Sensors keep beeping left and right cause motorcycles also like to selit2 at the side 🤣",
            "Trust me, Human are design to overwrite such rules...",
            "The fact we need that is prove there’s too many stupid people exist.almost outweighs the competent and rational peeps",
            "Your first problem is assuming she thinks.",
            "That's true bro. But in mesia, everything ok, everything takpe......until accident like this happened 😛",
            "Addiction, adhd, etc anything to counter the boredom. Unjustifiable..",
            "Deserved",
            "Lmao that’s so cartoonish\n\nCar’s like: i don’t know you anymore don’t call me your Toyota i don’t know you",
            "generally these assholes will blame the other driver",
            "Tengkiu tengkiu. Mau pegi toto later.",
            "What road sign language? That other car suddenly go in the wrong side of lane.",
            "\"I turn now, good luck everybodyyyy\"",
            "She even opened the door and got out like she was in the right lol",
            "I've told my friends multiple times not to use their phone. Still don't get it. It's literally facts that you endanger everyone on board by doing so. Everytime I get behind the wheel, I throw my phone into the side door pocket or backseat to ensure I don't accidentally gatal2 pergi tekan. Security > short term dopamine hit\n\nEven 1 kawan kena saman for the phone habit, 1 week later still back at it. And he vented for a few days over the loss of money from the saman too. I thought he would change his ways. smh",
            "This.",
            "Thank god for dashcams then. The arrow on the road showed it was a one-way exit",
            "She was in the right though, if she was in the left she wouldn’t be driving",
            "Yes. If Im a passenger and someone texts with their phone or browse social media while driving, it tells me your need to use a phone is more important than my life. I’ll find someone more considerate as a friend",
            "She was definitely going the right way that’s for sure"
        ]
    }
}