{
    "Olive or Linen Bedding?": {
        "title": "Olive or Linen Bedding?",
        "score": 179,
        "url": "https://www.reddit.com/gallery/1dlkx4f",
        "content": "",
        "num_comments": 75,
        "comments": [
            "Olive",
            "Olive all the way",
            "Your headboard is a cool gray I would not do warm linens",
            "Olive the clear winner, immediately lit up the dull looking bed.",
            "Olive for winter, linen for summer",
            "Olive gives more contrast to the room (with curtain) while linen makes the room feel more empty (with white walls)",
            "Both look good. You could have both on hand and mix and match",
            "Linen",
            "Where’d you find the olive one? It’s nice!",
            "Olive bc it's color. Counteracts the blandness.",
            "Both are fine but I like the Olive better",
            "Olive",
            "olive",
            "linen",
            "Olive looks best IMO,if you go with linen, you could get some cushions that are patterned or coloured to go with it.",
            "Olive no doubt about it",
            "Both look fine but Olive looks way more inviting.",
            "One of each, then alternate",
            "I actually really like the olive! It’s a closer shade to your curtains :))",
            "Olive love",
            "Both… then when you wash it, you can put the other immediately after taking off the used one so you can lie on your bed immediately.",
            "whatever the first one is i think okive",
            "Olive is a fine color but I don't like how it looks here",
            "Olinen",
            "Star wars bedding. Always.",
            "Olive",
            "Olive goated",
            "Linen with olive pillows",
            "Linen",
            "Neither really work but olive out of these two.",
            "Linen I like the color",
            "With that rug. Olive.",
            "I like the second pic",
            "damnn where is this",
            "Olive is better but you also don’t seem to have matching pillow cases for the linen, and it’s not done up as nicely \n\nIMO if those things were fixed it would be ok too ",
            "The second one",
            "Olive but match them with warmer colored pillows so that they go right with the flooring. The current palette of yours is too neutral. Use this [color guide](https://simplykalaa.com/interior-color-palette/) and [cushion arrangement](https://simplykalaa.com/how-to-arrange-pillows-on-a-bed/) for help. Also I'm only suggesting if you like the current look, which is fabulous too, you don't need to read these 😊",
            "no",
            "Olive, but I would pair that with something like a burnt orange or a rust linen bedding instead of the white you have. the room is kind of grey so the sheets are an easy addition and would look good with the olive duvet and shams.",
            "I'm usually a fan of raw colors. But this olive seems to combine really well with your interior.",
            "Neither fits",
            "OLIVE",
            "olive",
            "O L I V E",
            "I prefer linen with maybe an olive throw blanket if that's an option for you. By the way, what bed frame is that?",
            "Olive. Linen looks a bit bland.",
            "Olive",
            "2nd pic",
            "The darker one",
            "Olive",
            "olive all the way",
            "Linen",
            "OLIVE!",
            "Need to change that picture",
            "Olive",
            "Olive",
            "Olive is one of the ugliest colors in existence, IMO. Not to be critical...",
            "Linen is better for hiding cum stains",
            "It’s the entire bed frame, sadly, otherwise it’d be an easy fix switching out the headboard. He either needs a new bed frame or to go for cooler colored linens. If set on one, I’d go with olive sheets/pillows and try a black duvet with a pattern that coordinates with the rug, maybe something along these [lines](https://www.cb2.com/kamet-organic-cotton-black-king-duvet-cover/s442806?a=501&campaignid=10363910351&adgroupid=103409810619&targetid=pla-1677790286343&pla_sku=442806&pcat=HSW&scid=scplp442806&sc_intid=442806&gad_source=1&gclid=CjwKCAjwydSzBhBOEiwAj0XN4Dugn0rVU85fn-SWA87eWHMKc9lHKHygf6ZrNBlTHW1r4Bb1spIhjRoCTZ8QAvD_BwE). It would tie into the bed frame and painting better.",
            "Thats the way",
            "preach",
            "This right here. You should have an alternate in rotation",
            "Can you finish the rhyme please",
            "Only a Jedi doesn't deal in absolutes",
            "It’s barely color. It doesn’t add much to the blandness",
            "That’s my thoughts as well. If I go with Linen probably want to change the art for some color too.",
            "I think the second is olive",
            "Yes that was what my point was. That both colors which are warm are not suitable for the headboard. So he should consider trying an entirely different set that is cooler colored.",
            "we do I go to get great advice like this before I buy stuff",
            "Good idea 👌✨️",
            "Was agreeing with you as that’s the biggest problem OP is having and you were the only comment to mention it.",
            "Yeah trying to find some ideas. Thinking larger prints as well",
            "oh gotcha, I thought YOU thought I was saying he should change the bedframe but yeah would be more expensive than just trying different bedding. I do kind of wish he could swap it though just to avoid the whole grey on grey on grey thing that's so trendy and soulless",
            "I completely agree. So sick of grey. The olive would look fantastic with a wooden or even linen bed frame.",
            "Honestly if OP is handy they could reupholster it probably pretty easily but they're probably not looking for a huge project. It's a shame though the other elements could go warm, the curtains are very greige, the artwork has some brown in it and the nightstands are wood."
        ]
    },
    "How can I improve my bedroom? (Literally a closet)": {
        "title": "How can I improve my bedroom? (Literally a closet)",
        "score": 712,
        "url": "https://i.redd.it/n39zckjshy7d1.jpeg",
        "content": "",
        "num_comments": 297,
        "comments": [
            "That’s a spacious closet (as a closet).",
            "First weld galvanized square steel to the wall with screws borrowed from your aunt. Then cover in eco friendly wood veneer.",
            "Get a scar on your forehead",
            "If that's literally all you have access to, then I'm not sure there's much you can do.  Maybe a poster or thin print to have *something* on the wall?",
            "Can you get new bedding?\nI'd do a solid- print makes it look messier than it needs to be. A light gray maybe? Matching shams. 1 decorative colorful pillow.\n\n\nAmazon has wireless rechargable sconces. I'd get warm white bulb ones and stick 2 in there, one on each side of your pillows. Then you have some mood lighting vs a blaring overhead light.\n\n\nAre you hanging clothes where the hangers are? Is so disregard this- but id get a neutral landscape print and hang centered on that wall- like a mountain scape or something. Large- not puny. It'd open the space up a lot visually making it feel bigger.",
            "why",
            "Bro it's Pride 2024, it's ok, you can come out of the closet now. ",
            "That's not a bedroom. \n\nBut it could be a bed nook if you can manage to dismantle the closet built-ins and refinish the walls so there are no traces of the closet. That would be an instant improvement. Then, use the closet doors elsewhere and hang some heavy drapes or something. Or don't if you don't need privacy. I mean, is this closet in a bedroom or is this in a studio/efficiency apartment? Some context would help. At any rate, there's not much you can do with the built-ins in place except to get a solid bedding as u/Constant_Orchid3066 suggested. The sconces would be a nice touch too.",
            "A poster with a cat dangling from a tree with “Hang In There!” Text right below it.",
            "Remove everything in the closet. Paint whatever color you want. Hang some fairy lights. Put up shelves with books. Maybe put up plug in sconces above the bed. Replace doors with louvered doors so you get some air in there. Maybe replace the bed with a twin.",
            "OP - “I'll be in my bedroom, making no noise and pretending I'm not there.”",
            "plant",
            "put it on blocks so that you can have a place for activities underneath",
            "Get an acceptance letter to Hogwart’s and become a wizard harry",
            "Add mirrors?",
            "Get a single bed.  It will give you a foot of room along the side.  You’ll also be able to move around a bit and it would not feel so cramped.  You will have a bedroom one day with enough room for a double, queen or KING size bed.  But this isn’t it.",
            "I probably would have loved that as a kid...\n\nBut if your bedroom is literally inside the closet, what's the space outside of the closet currently being used for? Is it someone else's room?",
            "Some calming colored paint and perhaps some softer lighting would go a long way.",
            "So you're telling us, You come out of the closet everyday?",
            "Start tunneling to a bigger apartment",
            "Check out forums and news articles about people in Hong Kong living in similar sized spaces, some of those mad lads have come up with amazing ideas for small spaces 👍",
            "baby, its 2024. isnt it time you come out the closet?",
            "I hope this is a troll 😆",
            "Do you work as a soul reaper?",
            "Maybe a 85' TV?",
            "Maybe a futon and mount a tv on the wall, take the closet bar down and build an extra shelf up top. Put up little shelves either by your head or feet for a book shelf or just like a side table. \n\n[chair futon](https://www.bedbathandbeyond.ca/Home-Garden/3-in-1-Upholstered-Modern-Foldable-Convertible-Sleeper-Lounge-Chair-Sofa-Bed-for-Living-Room/39922908/product.html)\n\n[futon](https://www.ikea.com/ca/en/p/aelvdalen-sofabed-knisa-gray-beige-90530651/)",
            "That’s a pretty good way to combat the sun sleeping for night shift lol",
            "Get a VR headset",
            "So many questions, 0 answers. Wack.",
            "String lights ^_^ maybe some cool bedding. Get rid of the hangers and paint if you can? Try and make it feel like a nest rather then a closet.",
            "Can you try becoming gay?",
            "Don’t you post this months ago?",
            "HOW???????",
            "Get creative with LED or other type of lighting. Or maybe a really cool and bold light fixture",
            "Well Harry, move to Hogwarts as fast as you can. They have more space there..",
            "What is this a 90 Fiancé crossover episode?",
            "carbon monoxide sensor",
            "Move to a city where you can work and actually afford an apartment.. really.",
            "try putting the bed outside the closet",
            "Holy shit. Nah man I can’t give advice for this. How could you be comfortable sleeping like that?",
            "Invest in TARDIS technology",
            "Get something moisture wicking because it may get dank in there",
            "You're a roommate, Harry",
            "A fan so you get fresh air?",
            "Get an owl and a red headed friend with a flying car.",
            "Borrow some structural screws from your aunt.",
            "Soft warm Christmas lights wrapped around the shelf. One of those body pillows that you lean back on to support you leaning into the corner.",
            "Not many pictures to actually show the space but I’d consider a single bed, solid color bedsheets, a bedside table with one of those lamps that project the sky on the ceiling. \n\nAlso think about ventilation. Add a silent blade less fan to e sure you have enough fresh air when sleeping inside. It can boost the quality of your sleep enormously. \n\nIf there’s money, you can consider a single bed that folds up when not in use. Some wall art with landscapes could make it feel more roomy as well. \n\nNot sure if you use the hangers for clothes.",
            "r/malesurvivingspace",
            "Drugs",
            "You're not alone in the closet bedroom situation.  There's a girl (I think bestdressed) on YouTube who put her bed in a closet too.  Of course she designed to her gender but hopefully it inspires you that youre not limited in making your space cozy.  \n\n\nWallpaper the walls and ceiling. Hang a pendant light or get a small chandelier from a vintage store. Put up some shelving .. especially by the side of your bed to act as a nightstand (or a c table that tucks under your bed against the wall.  Run a power strip into the closet so you can charge ur phone while still in bed.  \n\n\nYes, the jokes are easy. But you came with a serious request for help.  Hopefully this helps.  And it does get better.  U do size up.  It's not defining. It's just the circumstances for your now, and it's proof you can adjust and that you have perseverance.  \n\n\n\n\nEdit: adding video link.  The best vid I can remember covers her bedroom situation.  She films as a vlog and her stream of consciousness is political and sarcastic and girly and funny... but there is a bed in a closet. Hopefully she's tolerable for you, but if not, hang in there.  It's good.  https://youtu.be/yRnnAAUJB3o?si=FIh1RMOiGBxHmTlK. -- and remember just because it's done in a specific style or for a specific gender, it can be flipped and things can interchange.   Pink turns to steal metal cool.  Frills truns to solid lines and tucked in sheet edges. Just be inspired and shape it to your personality and needs. ☺️",
            "Find a family that loves you",
            "Honestly it's not a small bed so you can close the doors get totally dark and comfy. It'd try to put a small TV in there if yabcould. Other than that, shut the door it's too bright out!!",
            "In Hong Kong they call that a coffin home",
            "Get a lady in there.",
            "Do you have a separate area for clothes or will they be hanging up? \n\nDo you have space under your bed? \n\nYou’ll need to maximize every nook and cranny up in this bitch. \n\nCut out a square of drywall and install some shelves, cover the hole with a tasteful poster. Like the “hang in there kitty” poster. Lol \n\nJokes aside, get a clip on fan for some air movement or something\n\n\nEdit: on the inside sliding closet door, if it’s magnetic stick some of those dollar store locker storage things on them. \n\nIf it’s not, get some of the really strong suction cup things with that J hook on it that you push down to give it more auction. Put some dowl rod across them and use that for things",
            "Remove everything, add mirrors to all 6 sides and put a fake candle onto the floor. Your bedroom will look MASSIVE!!",
            "Not sure if this is serious but if it is... adjustable wifi bulb. Not just for rbgness but also you can adjust brightness to be darker and more calming. \n\nIf you can't fit in a headboard you could get those peel and stick upholstered panels to soften up the nook.",
            "Get a letter from hogwarts",
            "How good are you at knot tying?",
            "Wait for the flying envelopes to come whizzing through the post.",
            "Simple source some organic square steel, some eco friendly wood venire and some screws borrowd from your aunt and bam an extra 7500 sqft at your leusure",
            "Idk why... But I'm surprised no one else thinks this is pretty cool hahaha \n\nIn my head, dude has definitely just put his bed in his closet for comments, and if you're not a stage of having bedroom company, looks like such a great place to block out the world as a bednook!\n\nBut so far that's just me hsha",
            "You’re a wizard!",
            "Nice lighting ? Put a shelf above the bed?",
            "Needs ventilation!",
            "use galvanized steel, eco friendly wood panels, and check to see if your aunt has some screws you can borrow",
            "expelliarmus",
            "Squat rack",
            "I think the word \"room\" is doing a lot of heavy lifting here, OP. It's more \"a place to put the bed\".\n\nThat being said, I think removing the doors is probably your best bet, if that's an option",
            "Ah, I see you live in Brampton.",
            "So, first yo have to get some galvanised square steel beams",
            "Galvanised steel bars and some screws from your aunt",
            "That pretty cool I think, do you have a wall mounted tv in there? That would be nice",
            "Christmas/fairy lights. Some posters on the walls or placing things or clothes you like aesthetically in the space.",
            "Take down the shelves and closet rods",
            "That'd be a really awesome closet.  That thing looks huge.  Maybe you could try mounting a light on the wall by the head of the bed and put in a few small shelves.",
            "Make your bed everyday!",
            "A long mirror would make it seem more spacious, but it would also be a constant reminder that you sleep in a closet so...",
            "Vr headset",
            "2000 dollars a month",
            "You gotta move to a different room in your house if you are serious.  Living in a closet is unsafe, and can't be mentally healthy.",
            "It’d be cool if you could install a shelf at the foot of your bed to use as a desk. Put a laptop there or something.",
            "How tall is the closet?  I would look at a loft bed and use underneath as a crash pad.",
            "first of all you're wardrobe is going to have to be streamlined. get rid of the hangers and fold your clothes. set them on the shelves. If you can add more shelves that will be your best bet to add any decor aside from a poster. you may be able to hang a small 13\" tv at the foot of your bed. look up Chinese coffin apartments because that's what you're dealing with.",
            "what is… what is outside the closet?",
            "Hi man, how comes you are in the closet? My guess is you have kids \n\nMy idea would be to have vertical storage on one wall \n\n2 sides clear, your headrest could be the cosy area of the room \n\nWhat's your opinion on having a VR headset? Might be pretty good for movies, work and light gaming \n\nI kind of like Post like these, because 6 months down the line people post with big improvements\n\nAnyway hope your situation improves👍",
            "Be English and hang out with a mophead looking dude who can fly his beater-ass car and jerks off with a magic wand.",
            "Put a quidditch poster up",
            "When your income doesn’t match the expensive city sometimes this is all you have to work with. I slept for some time in studio apartment with one other person in a closet very much like this. It wasn’t great but it was perfectly serviceable given the circumstances.\n\nOP, I would recommend starting with painting the walls something evocative. You could go with a dark gothic theme, a bright theme, or a calming pastel theme. If you don’t want to or can’t paint, consider some stick on wallpaper tiles. You are not going to be here forever so have fun.\n\nIf you have shelves above the clothes rack, that would be a good place for some plants and maybe a speaker or a psychedelic light to project cool patterns onto the walls\n\nAdd some fairy lights and it could be a really cozy nook",
            "Put things on the walls, art, a small shelf, a blanket, hanging plant that don’t need much light, get led lights if you like them",
            "Receive some special mail",
            "Get a portable monitor or small TV for entertainment",
            "I'm actually really impressed that you were able to fit a bed in there.",
            "add a very small shelf for a bedside table, fairy lights or a low wall sconce will be cozier, remove the hangers and rod to make it feel less like a closet and get under-bed storage for your stuff.  add some fake plants if you have space, don't put in a TV on the wall, this space is just for sleeping.",
            "Move out",
            "Tv on the ceiling",
            "Where's the body?",
            "Hopefully you arent paying for that. \n\nIts not even legal to do.",
            "Ditching bed for a futon but make it feel more spacious",
            "Little tv on the wall at the foot of the bed",
            "Bar cart",
            "Turn the mirrors the other way so it looks bigger hehehe sorry.. im leaving",
            "I don’t know if this is by necessity or by choice man but I’m not going to lie, I kinda want to know what it’s like sleeping in there. I think it looks kinda cool, like safe and cozy.",
            "How the fuck do you fit a bed that I'm assuming looks like a full size bed in a closet?",
            "Make sure the bending robot in the other room is the gold one, not the fog hat gray one.  And you might wanna lock up your toothbrush.\n\nI’d put some color-changing LED lights on top of the shelf (pointing up) to get some cool mood lighting.\n\nReally awesome would be a power sliding door!  A weight and a pulley might at least make it self-closing.\n\nI think I’d also (immediately) make a louvered panel with a fan to go on the left side of the opening, so you can close the door without closing off your air supply. (Actually…if you hung a curtain, or a pair of blinds, you might be able to easily motorize it…)",
            "A fan?",
            "move into the bedroom",
            "WHY WOULDNT YOU PUT IN OUTLET AND SHELVES IN FIRST",
            "I would start by moving it out of the closet.",
            "If you want to improve that space, the first and best thing you can do is remove all the closet shit from in there and treat it like a loft bedroom or a bedroom in a tiny house. \n\nPaint the inside, maybe even do a mural. Mount a floating wall shelf, hang some art, maybe even some tiny lighting. Treat it less like a closet and more like an inset daybed.",
            "I would kinda love this setup (assuming I have the rest of the room for other things). Imagine being able to get into bed, slide the door closed, and block out all the light and noise or the rest of the world.",
            "Get a robot roommate…preferably named Bender.",
            "I would say put a mirror in that wall? So it’s give you an idea that you a king bed and a bigger closet",
            "Remove the hangers, paint the walls, hang a small picture or poster. Small steps for starters. Maybe some strobe lights lol",
            "Hang clothes in it",
            "Loft bed",
            "Get a cozy blanket",
            "Roof projector.",
            "New bedding. Something that looks fancy with some good pillows.\n\nA lamp. Imho along with diffuser and the right colored light makes everything looke more homey.\n\nA good solid picture. Not some anime chick. Like a landscape that matches the bedding",
            "Make your bedroom a closet.",
            "Window unit and a tv",
            "I say this with 100% sincerity: that's fkn dope.\n\nI'm a really light sleeper, and I imagine you'd get such a peaceful sleep in there. Keep it up Dracula.\n\nOh yeah, and add some nice string lights. Please tell me the rest of the room is yours too tho...",
            "As someone who actually enjoys sleeping in tight spaces, this looks like a dream",
            "Sounds like you got those r kelly blues. Trapped in a closet.",
            "Levels. Get a really big desk and put it in and have your bed on top. Then have a lower level where you can have a microwave fridge tv little couch.",
            "Lights xmas lights",
            "🤣",
            "Ummm, decide that this sucks and you'll do whatever it takes to put yourself in a position where you'll never have a bedroom closest again.",
            "Some pictures would be good! Or maybe leds, depending on what vibes you want. Things that don’t take up space but let you decorate the walls so you feel better, ya know?",
            "Try the laundry room",
            "A bong",
            "Best sleep of your life I bet",
            "Jokes aside, that doesn’t have access to a window or vent and is illegal in so many ways. \n\nIf this is your only choice… \n\nNew doors for the closet. French doors. Maybe with a vent on the wall above and a fan if you’re not renting. If you are, maybe temporarily replace those doors with some that you can get a fan hookup to. You need air in there when you sleep. \n\nOtherwise, look for inspiration with alcove beds. \n\nI’m a big fan of number 5 here: https://www.apartmenttherapy.com/small-bedroom-solutions-cozy-bed-nooks-241801\n\nAnd 6/7 both use drapes instead of doors. \n\nI like the idea of shelving at the front and back of the bed, and a good variable light (bright and one that has amber) so it can be double duty. A small air purifier and fan on the shelves, accent wall with something vertical, nothing cluttered, and think hygge and i think you might actually have a working sleeping nook.",
            "Make it look like the inside of a tent with sheets, hang some fairy lights.",
            "Question. Are you in the closet of someone else's room? As in, do you have to go through someone else's sleeping space to get to the washroom?",
            "Don’t spend any money improving this space. Not worth it. It’s a closet. Just save everything you can and move ASAP.",
            "Tv on wall.",
            "Move if you can.",
            "Wait so what about the rest of the actual room? Is that someone else’s territory? I’d be freaked out if my roommate lived in my closet lol.",
            "By coming out of the closet",
            "You'll need to start by using some galvanized square steel frame and eco friendly wood veneer, and then maybe borrow some expanding screws from your aunt?",
            "Get a plant that is easy to take care of and produces a lot of oxygen. You have no airflow and that’s bad for your health. Let it sit in the sun during the day and hang it in the closet before bed.",
            "Knock down the wall. Install drawers under the bed. Put in glass sliding doors. Put in a television at the foot of the bed. Take out the hanging bars and install shelves. put in plants and a spray system on the top shelf. install an air conditioner and a dehumidifier. Put in soft lighting under each shelf with LED lights and Bluetooth control. install curtains along the glass doors. this will give you a perfect captains bed with a wonderful environment that you can set exactly like you like.",
            "Can I ask (respectfully) why your bedroom is a literal closet?",
            "I guess you are technically, correct that is a bed in a room",
            "Airflow",
            "Tom Cruise?",
            "I lived in a closet for awhile when I got kicked out of college. Put the mattress on the floor to open up space. Use shelving and vertical space to get what you need in. I also got a lap desk, a clip lamp for the shelf  and added a thin piece of 1/4 in wood on the wire shelf to make a solid surface, which is better than the wire. Decorate with Posters and flat art. When you crawl in it should feel cozy and well ventilated with a small tower fan on the shelf to keep air circulating. Have your head pillow and big supportive throw pillows or a wedge or “husband pillow”. Soft blankets help too. I actually liked my closet and it prepped me for a tiny house as a tall man.",
            "Get a ventilator",
            "Ngl I dig the closet room",
            "Watch Beat Dressed YouTube video where she turns a closet into a bedroom!",
            "Where is this? How much does it cost per month?",
            "$750/mo here in Toronto.",
            "Ventilation. I always wanted a nice cool closet bed like this, but they are usually stuffy and get humid.",
            "Tiny portable projector mounted above your head? As long as you don't mind 1080p,they  are getting pretty decent and affordable.",
            "I guess cool lighting? Like strip lights or something? mount a tiny Michael-Scott-style TV?",
            "Is it possible to remove the hangers and the pole and make it feel less like a closet",
            "Forehead scar or move out if new york.\n\nOr take down a wall since it always makes it feel more open.",
            "Some cool tapestries or fabric (even big flat sheets would work) from the thrift store draped under your shelf (maybe hung w/ tacks) so it's more vibey and you can still use your shelf storage. A nice big extension cord that you can tuck under your bed so you have an \"outlet\" in your room! \n\nAlso maybe some twinkly lights like old xmas lights so when you're hanging in bed you can feel like it's more /your/ spot, not just some closet. Some fun pillows which are less for sleeping and more for propping yourself up if you wanna hang in bed. Maybe a fuzzy blanket too.\n\nI feel like this basic closet is a great canvas for a cozy little cubby you could make for yourself!",
            "It's like the prayer closet from Carrie.  It's also a place to hide your dirty pillows.",
            "Get Bender to live there and you move into the spacious closet.",
            "I don’t understand how you convince someone to fuck in there 😂\n\nPerson: so where’s your bed? \nOP: opens closet door",
            "I lived in closets a couple of times in my 20’s to save on rent. I always just put a futon mattress in and used it as a place to sleep.\n\nHowever, if you think you’re going to be entertaining guests in there maybe set it up like a sci-fi spaceship bunk like in FireFly or a neo-noir style akin to Blade Runner",
            "Get a bedmate of your preference  to move in with you.",
            "As far as beds in a closet go, this is a bed in a closet.",
            "why are you sleeping in a closet?",
            "A 15 inch sub to start....",
            "How much galvanized square steel and eco friendly wood veneer does your aunt have?",
            "is this literally all you have access to? or is this a choice and you have access to whatever room this is in? the answer changes depending.",
            "You could rent this out for $350 per week in Sydney",
            "Idk why but that seems such a comfortable and safe space to sleep. I can just imagine closing the closet door at night and getting a good night's rest.\n\nMaybe add some LED's to the closet, and maybe have some shelving for books and such.",
            "What about a floating shelf and a plant",
            "Depressing American version of HP right here",
            "Don’t worry, I’m sure your invitation to hogwarts is on its way",
            "In college one of my friends had a bedroom on a patio. It was smaller than this.  At least you are indoor.  I would make sure to use some matching bins or baskets on the shelf.  And probably a mirror on the wall at the door of the bed, or I guess on the back of the doors. Some hanging fairy lights might look cool on the bar, if you like things like that.  I agree with the idea of using some nice stick up lights so you don't have to have the overhead light all the time.  I bet there are some great ideas on Pinterest as well as Reddit. I've seen several cute closet bedrooms on there.",
            "Yer a wizard, Harry",
            "Move to a different house",
            "Could you get a smaller bed? A twin might give you enough room to stand up up, with a mirror and  a tiny nightstand/narrow shelf",
            "That's $900-$1000 rent in San Francisco. A closet you can sleep in.",
            "What’s the room that the closet is attached to like?",
            "I hope you save on rent, i would count it worth it if you do 🤣",
            "You're good",
            "Why do you live in a closet",
            "Downsize the bed for starters",
            "Get one of those beds that has a desk underneath. Make sure it fits. Get a nice setup under with a chair. If you have some space add a small closet to the right and you'll have more storage because of the desk as well. You will have to remove the closet stuff. Add LED around the walls corners and get some big mirrors for each side of the wall. The mirrors will give it the illusion of space. This will make this bedroom very versatile and not just a bed",
            "rgb lighting. Get moody",
            "this literally beats evil spirits, they come out the closet so your safe and the cameraman never fies",
            "Could add some art or painting to the wall",
            "Get a twin XL bed frame and mattress.",
            "Hogwarts will be sending letters soon Harry!",
            "You need to start plotting to take over the house",
            "Can you remove the current shelving and put new ones in? I think some more cohesive less closet-looking shelving could help, then book some\nbooks or personal items on display as well as for storage of course. I would paint the wall against the bed to anchor it.",
            "Just wait for hagrid to deliver your letter",
            "[Put this on the wall.](https://www.amazon.com/Hang-There-Cat-Poster-Unframed/dp/B0CLM2VJHJ?th=1)",
            "Use galvanized square steel bars",
            "Not sure if you’re trolling but incase you aren’t, i found that if i put my toys at the foot of my bed at least it gave me a sense of companionship. I also hid my favorite ninja turtle under my pillow to make sure my mom’s crackhead bf didn’t get to it, and get rid of it somehow.. \n\nThat or maybe a plant or two",
            "Is your name Little John? \n\nPerhaps some galvanized square steel",
            "well there’s a few things you can actually do\n\nuse the shelves for plants, knick knacks, whatever kind of decor. get LED lights to tuck under the shelves so there’s like an under light, this way you don’t need to use the overhead light. maybe smaller photos for the wall but you could also get mini floating shelves off amazon to put into the wall so you can treat them as little “night stands” to put water, your phone, or whatever. oh and get rid of the hangers",
            "That’s it. It’s a wrap. I got nothin for you man.",
            "Make bed?",
            "Wall mount a TV infront of the bed and one of those cushions with arms to sit up on",
            "First get a bedroom",
            "Hagrid will be over soon",
            "LUXURY! We used to live in a shoebox in the middle of the road\n\nWe used to 'ave to get up out of shoebox at twelve o'clock at night and lick road clean wit' tongue. We had two bits of cold gravel, worked twenty-four hours a day at mill for sixpence every four years, and when we got home our Dad would slice us in two wit' bread knife.",
            "Narnia ?",
            "Bro have iq200",
            "A rug will tie the room together",
            "Get a pet owl",
            "move",
            "Step 1. Improve your bank account",
            "Assuming you’re serious:\n\nTake out the bar and hardware. You don’t need it.\n\nGet some fairy lights or a light strip that has a warm, yellow tone to it. Get some fluffier pillows  have one longways against the back, so it looks like a cozy cubby. I’d consider moving to maybe some warm solids, like a dark green fluffy duvet with some cream-colored sheets, very “tucked away” library corner.",
            "Stop pretending you're Harry Potter and move out the closet and use it as a closet",
            "Did you just come out of the closet?",
            "get a smaller bed first?",
            "Go to Hogwarts. Hope this helps ❤️",
            "Should add a couch",
            "Some fairy lights would make it cozy.",
            "Lose the bed and set up a slot machine I LOVE GAMBLING",
            "That’s a closet",
            "Home gym?",
            "Naked chicks all over the bed?",
            "Time to come out the closet OP",
            "I'd hang a tapestry or something else on the ceiling to make it look more comfy (making it look kinda like clouds) and put some light strip on the wall. And more pillows.",
            "Bro how f...k can you live there?",
            "Lose the bed. Get a sleeping mat(Japanese type set up). Might find it better for your back. Your room requires a minimalist approach. Good luck.",
            "I honestly thought that was VR headset hanging on the rail",
            "assuming this makes the living area more useful i don't think it's so crazy an idea.  i would try to make the bed lower and smaller - someone mentioned a japanese style sleeping pad, but that may be too much.  i would also be worried about moisture, odors and dust - so at the least leave the doors open for a few hours every day and try to be as tidy as possible.  i assume it's rented?  otherwise replace hangers - which seem pointless there - with shelves.",
            "I’d take out the coat hangers for a start.",
            "Mount a TV to the ceiling.   Remove the bar.",
            "Take the closet doors off and store somewhere if this is a rental.  Remove the closet pole.  Add a curtain  for privacy and mount battery operated lights.  There are motion sensor lights, rechargeable lights that mount with magnetic strips.",
            "So what are you all having for lunch today? I have hot pastrami on Jewish rye with a side of chips and a slice of strawberry cake for dessert.",
            "Imagine sleeping and all the clothes on hangers are just overhead touching blankets. I cant",
            "One of my first thoughts. That looks like a full size bed not a twin.",
            "I’ve never seen a closet so deep (that wasn’t a walk-in)",
            "My efficiency apartment has a closet and a walk in closet. No idea how they call this an efficiency.",
            "wow that brainrot has spread far. i love it but i feel so stupid watching basically the same video over and over lmao",
            "This <3",
            "What is this a reference too? I am kinda scared to ask",
            "Where am I storing out of season quilts?",
            "Damn even Harry had room for a couple of shelves in his room",
            "You’re a poor, Harry!",
            "💀",
            "Why is this sooo funny. I laughed for a few minutes 😂😂😂",
            "Maybe some chess pieces to play with",
            "Thank you for solid actually advice and not dumbass jokes",
            "Yes!! To all of this.",
            "It’s possible he lives in Canada.",
            "But only during June. I’m sure some corporate will shove ya back in that closet come Canada Day",
            "Op, do this ☝️ and removable wallpaper would be affordable in this area and it's renter friendly, oh and strip lights instead of fairy, but that depends on personal preference.",
            "It’s making no noise and pretending I don’t exist",
            "Yeah and maybe a rug to tie it all together",
            "id do this in a second  \n[https://hirshhorn.si.edu/kusama/infinity-rooms/](https://hirshhorn.si.edu/kusama/infinity-rooms/)",
            "imagine waking up in the middle of the night to your face in the mirror....",
            "Absolutely, this. Makes the space feel so much bigger.",
            "They live in a closet.  You think they can afford a new bed?",
            "Good one!",
            "Rukia is that you",
            "Ty!! I appreciate the actual advice",
            "Also, run a cable to your room and an extension cable to it for more plugs. Add sound dampening material to the back side of the doors",
            "Might feel like you're crossing over to Narnia instead",
            "Daww it’s like a baby crib mobile! Calming & cozy lol",
            "Are we whispering? (Why are we using this symbol?)",
            "it's *deeply closeted*",
            "Please explain?",
            "What the actual fuck. The one I saw goes “remove the outer walls and rebuild using square steel frames.”",
            "it’s a reference to a guy on tiktok who makes animated home reno videos except nothing makes sense",
            "Just a hardworking chinese man making the most of his living space",
            "https://knowyourmeme.com/memes/galvanized-steel-and-eco-friendly-wood-veneers\n\nIf you want many many examples, one of the accounts spreading the meme is @visionofluxury08 on instagram. I don't use TikTok so I can't show you examples from there, but the knowyourmeme page has those.",
            "Didn't he have a smaller bed, though?",
            "Imma whut!?",
            "Or get tranquilizer. You can get high playing chess in the ceiling. And if you got a canal between your eyes, you might be Anya Taylor Joy.",
            "I am getting international student vibes off this.",
            "Am Canadian, can confirm. His tent is probably 1900/month (utilities not included)",
            "The closet is where house hippos sleep.. maybe he doesn't have one",
            "🤣 This genuinely made me laugh so hard I teared up.",
            "That wasn’t the question, Chief.",
            "What about feels like living with evil cousin and wait 11 yrs in it till some dude say \"yer a wizard\"?",
            "Yes (I don’t know why)",
            "its a tiktok",
            "Search ‘coffin house remodel’ on YouTube",
            "I love the “mom won’t hit heads” as her head is partially clipping through the fucking ceiling bahahaha",
            "Also lived under the stairs so he had a vaulted ceiling!",
            "Wild but alright i dig it",
            "there would be bunk beds",
            "Also Canadian here, can confirm. That's probably at least $2K, not including anything else. Hahaha ahh....god it's a mess up here.",
            "1900 CAD is like $50",
            "(You don’t want your closet to hear you complimenting another closet)",
            "(I also like whispering )",
            "They are in the room adjacent.",
            "Landowner tried but this was the absolute limit before he ended up violating 4 building codes for over-occupancy. With this, he only hits 3 infractions and the local government will only give him a slap on the wrist if he gets caught.",
            "You realize exchange rates are really easy to look up? You’re not even remotely close to being right",
            "(shhh, you might wake up my sexy flatmate)",
            "was (apparently bad) joke. I have a bunch of canadian friends and this is how I troll them",
            "Should prolly go back under the bridge"
        ]
    },
    "If you were a single guy living in a 2 bedroom apartment what would you do with the second bedroom?": {
        "title": "If you were a single guy living in a 2 bedroom apartment what would you do with the second bedroom?",
        "score": 884,
        "url": "https://www.reddit.com/r/malelivingspace/comments/1dl5vw1/if_you_were_a_single_guy_living_in_a_2_bedroom/",
        "content": "I think most people would say put your desk and computer there but there is enough room in the master bedroom for those",
        "num_comments": 1598,
        "comments": [
            "This will be me and the 2nd is going to be a home office",
            "Separation of space is for sure the right answer, make it a kickass chill out room. Or a hobby room?",
            "I would do it anyway, it’s nice to have your work/play and sleeping areas separate.",
            "Office. Keep your work out of your bedroom. Maybe a nice reading chair to fill empty space in your bedroom.",
            "For me, it would be a music room for my guitars and computer so I could record. \n\nSo I would say, use it for a hobby room, whatever that hobby may be.",
            "I'd turn the second bedroom into my masterbatorium. Have a nice big beanbag chair in the middle. Next to it would have a little table with the lotions, strangulation tools, vr headset and a nice leather glove. On the wall I'd have a toilet roll holder with a 24 pack of toilet rolls on standby. A 56 inch flat screen mounted on the wall. I'd have my wifi rooter in here for a solid internet connection. The room would be sound proofed and painted black. Any windows would be removed and bricked up. The door to the room would be replaced with a fake book shelf. Inside one of these books would be a biometric door access fingerprint and eyeball scanner for access.",
            "Sex dungeon",
            "Guest bedroom",
            "Sim racing/ gaming room for me. or just extra storage",
            "I live alone in a 2 bedroom condo.\n\nThe second bedroom is mostly empty. I use it for storage and hang-drying clothes.",
            "I’m in this situation, I use it for storage, extra furniture, my bikes in winter, the leaf for my dining room table, pet supplies, vaccuum, luggage etc…. It’s either that or pay $200 for a storage unit 3 miles away",
            "1) Rent out the second bedroom. Sometimes it’s nice to have extra money.\n\n2) Extra closet room.\n\n3) Hobby or gym room.",
            "I filled mine with music gear. If I had the money I’d fill it with pinball tables.",
            "horticulture",
            "Turn it into a sex den.",
            "Gym + home office.",
            "That would become the “smash-room” for all of the pussy I’m not getting. Would also keep a box of tissues in there and don’t ask why brother.",
            "I'm a single dude with a 3 bedroom house. The second is my office/library, the third is my hobby room.",
            "Dedicated VR room",
            "Neither single, nor a guy, but:\n\nI have a spare room and I made it into a hobby/guest room.\n\nI got a bedframe and mattress that roll up, and can be stored in the closet. I have several storage containers and a work area on wheels so I can switch between bedroom/hobby room and put the extra in the closet. I got a Secretary desk, which has a fold out top and a dresser underneath. And I got a comfy sitting chair. \n\nI can read a book on a cold winter day, work on my computer, knit a scarf, repair a keyboard, and offer a friend a comfortable place to crash for days or even weeks.\n\nHighly recommend. ",
            "Work room or hobby room would be the way to go. Great if you collect figures and what not, it could be displayed and perhaps you can go all out with posters of your interests in the room too.",
            "Game room/office. Even if there is room in the master bedroom  for a computer that room should only be used for sex and sleeping.",
            "Do whatever you want with it. I once rented a 2 bedroom because SO MANY people said they’d visit, so I made a guest room\n\nNo one visited. Do what you want with room. People that want to spend time with you will find a way to do it regardless of whether you have a guest room or not",
            "mines a gym.",
            "Home office / gym / growroom",
            "I’d have a female alter ego and that would be her room. With feminine decor and a makeup area",
            "Minimalist Gym (just a multi functional hack, maybe a pair of dumbbels and a bed to press), and if has some extra space, Id put my PC too",
            "You're supposed to fill it with your nerd collections and funko pops",
            "I have always rented 2BR places when I was single. The other room was a home-office/additional storage. I dont want my computer room in my bedroom.",
            "I'm a musician so it would a home studio",
            "Why do people put desks and computers in their bedroom?  You don't live with your parents anymore.",
            "I love the seriousness of this thread, I assumed that Goon Cave would be the top comment as this is Reddit… haha",
            "- Pull down bed in a wall if possible, or a nice couch with a fold out bed (futons are easier, but I’ve never actually slept on a comfortable futon - I’m sure they exist, I’ve just never experienced one)\n- Basic office/desk setup\n- One of those low and wide entertainment centers\n- Sound system and short throw projector\n- a few posters, et voilà\n\nStereotypical, tropey, basic, but functional. It’d be a “temporary” spare bedroom that’d also be an office and theater.",
            "Masturbatorium",
            "Hobby/crafting/painting studio. \n\nI live in a small one bedroom flat, and I’m sick of always having to tidy things away, otherwise things become quickly chaotic.  I like a tidy home, but I also like making a mess. Perpetual conflict.",
            "This is me. \n\nI work from home so making it an office was a no-brainer. \n\nBefore I worked from home it was still an office. I wanted it to be a guest room with my computer desk, but the room is a big too small for that. \n\nIf you’ve got nerdy or space consuming hobbies, I’d definitely relegate them to a spare room.",
            "It'd be my workshop",
            "Gaming room, of course!",
            "Masturbatorium",
            "Make it a guest bedroom so you can have guests stay the night if you have a get together",
            "Airbnb it a few nights a month so you can live for free",
            "Room for recreation/hobby/pets etc",
            "Library/study.",
            "I am and I do WFH office / laundry hanging room\n\nI like to keep my bedroom for sleeping or shagging only, don’t need that negative work energy",
            "In this situation and I converted it into an office cause I work from home a fair amount. Have a futon in there, when I did have a girlfriend she'd come over and knit or read there while I worked plus it's extra sleeping once I convert it into the bed.",
            "Home office or gym.",
            "Grow room 🤷",
            "Fart room",
            "That's me! One room is sleeping, nothing but bed, nightstands, dresser and TV. The other room is a desk for gaming, book shelves, a comfy chair for visitors and an elaborate cat tree for my cat.",
            "When I was living in a 2BR townhouse, I kept my computer in one room and my tv and Xbox in the other room. I got better sleep plus if my son came over to play Xbox, I could game on my computer.",
            "Open office/bedroom",
            "Home office normally",
            "I've got a 2 bedroom condo and the second room is a home gym. Best decision ever",
            "Love Shack, baby",
            "Gaming room",
            "Currently a single guy renting a 2 bedroom.\n\nI use its closet for sheets and backup cleaning supplies when they go on sale, as well as out of season coats. The rest of the room itself is a hobby room. I have a dresser in there that I keep heavier cloths in when spring and summer rolls around, and vice versa for cold months and shorts.\n\n2 desks, one for building and painting, the other for a resin 3D printer setup. A few shitty bookshelves for holding unopened kits, built but not finished models, or fully finished models.",
            "Single Male 25 / My second room acts as a walk-in closet/game room\n\nI hated living in a 1bedroom because I didn’t have a separation of space. My bedroom is for sleep, living room for when I’m cooking and living lol. The walk in closet is where I play music, video games with friends and etc. This works for me :)\n\nJust don’t turn it into a guest room haha",
            "Man cave, inside the larger man cave.",
            "Similar to “Don’t shit where you eat.” and “Don’t mix business with pleasure.”.",
            "Fungeon",
            "Masturbation station",
            "“Batin’ Booth” obviously",
            "When I was 19, my landlord was pretty decent, there were locks on our doors. I asked if he could just lock up the 2nd bedroom and we count it as a 1 bedroom apartment.\n\nHe took 125$ off a room I was never going to use anyway, so I thought it was well worth asking. But this was back in 2013 and he admitted he had the 20 unit building paid off. So missing out on 125$ a month to make a youngen like me have a little extra spending money was a easy decision for him.",
            "Sex dungeon ",
            "Sex room. Fuck bench. Sling. Small\nDresser for lube and supplies. A toy chest. And obviously a TV for porn. And color changing LEDs.",
            "Gym",
            "Fap room",
            "pur personal zen and hot yoga studio.",
            "Guinea pig fight lounge",
            "I sleep and fart in the second bed room. It’s my closet too, where I keep my hamper with dirty closes. It’s a bit of junk room I store shit. \n\nThe master bed is where I keep it nice and super clean abs smelling good. ",
            "A Twister board and a Crock-Pot full of baby oil.",
            "Poker room",
            "Gaming room",
            "I have a 5 yr old son, it’d most likely be his bedroom.",
            "use it as a place to set goals and plan ways to achieve them. like getting a 3rd bedroom.",
            "Go all out on the best battlestation and hobby room ever.",
            "Goon cave",
            "I did this once, 2nd bedroom was the foster animal room, took kittens with ringworm in for a safe space until they were healthy enough for adoption.",
            "Rent it out",
            "Personally, Id make it a guest bedroom with a heavy office vibe. \n\nI don't mind having guests or helping out a friend in a tough spot, but I don't want them to have an excuse to be a persistent leech. If it's my office, I can always have the excuse to be in there early or say they need to focus on their next move if it's been too long and they are seemingly taking advantage of the situation/me.",
            "Gun room",
            "I'm the kind of guy who likes being welcoming to others. I'd probably do it up as a guest room.\n\nI have no need for a home office as a pilot.",
            "Dungeon",
            "Sex Dungeon, all of my BDSM stuff goes in there and it’s padded.",
            "It was empty other than my WFH set-up. I wanted to get furniture and turn it into a guest room/office, but didn't care enough to spend the money.",
            " First room: gaming and VR room \n\nSecond room weightlifting/powrlifting setup with a huge ass mirror.\n\nI’d sleep either on the floor of the gaming room (I already sleep on the floor much of the time currently I find it comfy and love it) or on the couch in the living room that a 2 bedroom apartment would likely have.\n\nIn my ideal setup in an apartment like that I would not own a bed.",
            "Masturbate room",
            "Turn it into a home gym.",
            "A friend of mine lives in a 3 bedroom house. He used one as an office and the other he rented out. Then his girlfriend moved in and they decided to get rid of the tenant and just have a spare room for guests. Then she left and took the cats and now he just kind of rattles round on his own. I messaged him back in April to ask if he could help me out when my apartment building caught fire and I was homeless and I never heard back. I guess he's just happier there on his own with the memories.",
            "office and fitness",
            "I'd put a trampoline in there",
            "Office / desktop game room.",
            "Easy. Brothel.",
            "Game Room obviously",
            "My second room is full of brick-build models ... to be honest, the bedroom too.",
            "LEGO Room",
            "One bed to sleep the other to fuck.",
            "Sex dungeon",
            "I turned mine into a “study” with a desk, daybed and frame tv on a large format bookcase from Room and Board. It has French doors to my living room so it makes as a perfect extension of the living room for entertaining and I can close the doors and have guests stay on the daybed as well.",
            "Rat room. Get a bunch of rats. No cages just let them free roam in the room.",
            "Where do you live OP? What’s your rent like?",
            "I would fill it up with strippers",
            "Coming from a single guy with a 4 bedroom house. Home Office, or if you don't need that library/games room.",
            "Sex dungeon",
            "Office space. I’m a dude who works from home",
            "One as an office, the other as a recreational area, because I can't work properly in a place meant for recreation",
            "Use it for laundry 😅",
            "BDSM room 100% all day long",
            "#Music Room.\n\nAmps, guitars, drums, recording equipment, etc.",
            "Sex room",
            "sex dungeon (never used; preserved even, for future archaeologists, although not by choice)",
            "Turn it into a goon cave",
            "I'd sleep in the living room. Turn bedroom one into a hobby room. Turn bedroom two into a work room.",
            "I had that situation when I moved into my grandparent's house. The second bedroom is now a cozy reading room with an armchair",
            "I’d fill it with bicycles 🚲 🚲 🚲",
            "Pad it from top to bottom for wrestling matches with my friends",
            "I have a couple extra rooms. One is furnished as a guest room and i also have my weight equipment and stuff in there because I don't actually have guests. The other is really just for some of my plants that need a specific temperature and humidity level and it's easier to contain that to a single room. I've also got my desk and bookshelves in the plant room so it's a cozy little tropical library",
            "My setup room.",
            "Hobby/computer room.",
            "Office / man cave / film room",
            "I'd cover the walls and ceiling with mirrors and turn it into a tripping room, that's just me though",
            "I’m not a WFH person. But that second bedroom is my office.",
            "Weights",
            "2 chicks at the same time",
            "I'm renting it out and putting the money towards a down payment for a house.",
            "Whatever you do with it, put in a NICE spare bed. That way, when you have a girl over, you can offer it to her if she stays the night. That usually has an opposite effect on the woman",
            "Rent it out, make some extra $$.",
            "Definitely a home office as I don’t want to work in my bedroom. But other uses could be a music room with my guitars and equipment, an art studio with an easel or a home gym (if there are no neighbors below me.)",
            "I’d make it a hobby room, for whatever hobby (or hobbies) you have. Maybe set it up in a way that can double as a quick guest bedroom if you have a lot of long distance friendships.",
            "A room dedicated to Games Workshop LoTR miniatures, a worktable where i paint and assemble, miniature landscapes and dioramas and shelves filled with miniatures, paint and material for landscaping. \nEither that or fill the room with plastic balls.",
            "I was this way for a long time. I had my home office and a twin bed in there for if someone needed a place to pass out.",
            "I use mine as a spare bedroom for guests/storage room",
            "Guest room / office / outdoor gear room (what I did)",
            "Computer and desk with a couch n stuff in there second room. If you have any instruments it can double as a sesh room. \nI understand that your computer and stuff fits in the master but I have found it makes sleeping easier when there’s one room for gaming and another for sleeping",
            "One thing that helps with sleep routine is making your bedroom solely for that. Sleeping. Even if I could fit my computer desk in the master bedroom, if I have the space and a second room, I would put my office/computer in there. Beyond putting your desk, you could make this room more of a chill/man cave like space, put maybe a couch/pull out bed for a guest room as well, etc etc.",
            "If you work from home, make one room the office and productivity and let bedroom be for relaxing etc. It’s healthy. I’ll be doing that in like 2 months.",
            "I do this:  Guest room & home office for paid work. I'm considering some gym equipment as well, but haven't pulled the trigger\n\n\nSecond desk outside the room is used for unpaid work ",
            "If you dont often host guests than you won’t need a guest room. Maybe add a pullout couch for redundancy. \nBut other than that a work room or just chill room would work. \nIf neither of those option suit you than storage or just a gaming type room.",
            "A guest bedroom for family and friends who stay over.",
            "Over flow wardrobe storage and second office.",
            "Guest bedroom cum gym yoga cum office if need be",
            "I have this problem, but with a 3rd extra room. (Single, no kids)\n\nRoom & Home Office are must-haves, leaving an extra 3rd carpeted room.\n\nI'd like to downsize from 3 bed/1 bath to 2 bed/1 bath, but this market doesn't even make sense to do so.",
            "Exercise equipment, home office, gaming room, hobby room or guest room if you're the type of person that invites friends. I use my second bedroom as an office and a storage room.",
            "If I worked from home, it would be an office space. \n\nI don't work from home, so it would probably be a less permanent hobby room. Big workspace and lots of wall storage. Set up my 3d printers, and have workspace for finishing projects and such.\n\nI like to dabble in hobbies so I wouldn't want anything in there to be too permanent a set up for me to change stuff around, but that's would kind be the vibe I think",
            "Sexnasium.",
            "Music room",
            ">there is enough room in the master bedroom for those\n\nJust because you can doesn't mean you should",
            "Home office one one side of the guest room and music or gaming or hobbies on the other side ",
            "Grow room for sure. Best decision I ever made. 1. Make that room pay rent. 2. Smoke or eat mushrooms for free 😎👍🏼",
            "(I play an instrument and Live in a 3 bedroom apartment, also single) \n\nI made 1 bedroom to sleep\n\n1 a home office\n\nAnd the last one a studio to practice",
            "Minimalist Gym (just a multi functional hack, maybe a pair of dumbbels and a bed to press), and if has some extra space, Id put my PC too",
            "I might make a podcast studio.",
            "Definitely home office with reading nook. I‘m having a 2 room apartment at the moment and the desk in my bedroom really annoys me.",
            "Dojo",
            "Office",
            "Office, with a side of \"listening room\" for my audio setup.",
            "definitely a sweet office/spare room with a futon or something so someone can spend the night comfortably. a manly library. nice shelves. plants. books. nice lighting",
            "Turn it into a combo den/work area/hobby room if it's big enough.",
            "Play room.",
            "Office.",
            "Do not put your office in your bedroom. Bedrooms are for sleeping, getting ready and the sexy time. Not for Minecraft, spreadsheets or emails.",
            "Do it anyways like others are saying. Otherwise, I'd personally just make it a big ass walk-in closet cause I never have enough closet space but maybe not everyone shares my pain.",
            "Office or gaming room",
            "Depends on the size of it. Ideally, a rack of some sort where I can do pull ups, bench press and squats, as well as a treadmill and assault bike. This would be what is called, a home gym.",
            "I have a very large baseball collection that id love to transfer out of my main bedroom/office into a separate space. Been collecting since I was a kid, id just display all of my collection and kick it in there like a lounge type vibe.",
            "Home office/ gaming/ reading room.",
            "Office and home gym. Stationary bike trainer, yoga mat, kettlebells, trx if able to setup. \n\n\nIf room, futon or sleeper sofa, guest room mode. ",
            "My second bedroom is home office/game room",
            "Made mine into a home gym. Same situation as you where I can fit my computer desk in the master (I wfh). Having a dedicated exercise room makes me more prone to actually popping in there and working out.",
            "That's my current situation. Moved in to this place and then my car took a shit and I keep having to pay medical bills. So now I just have an empty room and my lease is almost up lmao",
            "Maker's space/workshop. Electronics work station, 3D printer, vise, tools, materials, etc. The kind of stuff I'd use a garage for if I had that instead.",
            "Listening room for music",
            "I wouldn't want my desk and PC/Work in my bedroom. Either I'll set up the second room as office space or make the living room half work and the 2nd bedroom be a rehearsal space for my music.",
            "I have a spare room and I rent it out",
            "Home office &/or hobby space. I have an infinite amount of hobbies and no space to do them and the problem is the more \"packed away\" stuff is the less likely I am to use it.",
            "100% put your desk and computer in the 2nd bedroom.  Turn it into an actual home office.",
            "Gaming room, or home office (which is code for gaming room)",
            "One bedroom, one office or gaming room.",
            "Home office , keep those out it the bedroom you sleep in, it will drastically improve your sleep",
            "That would be my vr room.",
            "Bar room.",
            "There would also be room in my bedroom for a toilet and a stove, but that doesn’t mean I want all those in there either. Separating your from your bed is absolutely the move",
            "I was a single guy in a 3 bedroom. \n\nSleep in the master, put a set of double Freedom (french) doors connecting the bedroom that shared a wall with the living room and made it an office. Got a shitty bed set from IKEA for the third, made it a guest room… closed the air vents and the door and never used it until the now wife moved in.",
            "Music room!",
            "Music listening room",
            "Do you not want a separate relax room and work room?",
            "Office/game room",
            "Get a roommate cause rent’s fuckin outta control.",
            "If it was me, I would keep my guitars/music stuff in there and make it a hobby space. Make it into a space for whatever you’re into, like your own fun room.",
            "I’m a single guy living in a 2 bedroom apartment. It’s my man cave/gaming room.",
            "Library / reading room that doubles up as guest bedroom when needed.",
            "Since I am a musician and have a few other hobbies, that second bedroom would have all my gear. I sort of have a room like that in my house now. It’s what I wanted that room to be which is a room I could go to when I want to jam out, but sadly it has just turned into a storage area.",
            "Opium den",
            "Guest bedroom/office space is actually my goal for a living space.",
            "Goon cave",
            "I’d get my desk and computer out of my bedroom to be honest. You sleep there. Fill that area with a couch or something cozy. \n\nFor the other room, I’d do office with a Murphy bed.",
            "My second bedroom is a guest room/office and sometime gaming den.",
            "Turn it into a music studio",
            "Currently living like this. 2nd room has a twin bed that can pull out to a king size for visitors. Otherwise I have my music production desk/computer and guitars in there.",
            "I’m a single guy with a 3 bedroom house.\n\nOne of the bedrooms I basically use as a home office/video game/music room.  I used to work from home but I really don’t anymore so I just have a big L shaped desk with two monitors, my computer and ps5 and even another table with some speakers, mpc and turntable, and then a book shelf with a ton of records and video games and display stuff on top.  \n\nThe other one is basically a big ass closet right now with shoeboxes and piles of clothes but eventually I’m gonna turn it into an actual guest bedroom.",
            "Even if the master bedroom has enough room for your desk space, consider moving that stuff tot he spare room.\n\nSeparating the places where you work and sleep, drastically improves how quickly and how well you actually rest.\n\nIf that's a non-issue to you, home gym 💪",
            "Computer desk and storage. It's not pretty but it saved me $260 a month on a storage unit.",
            "Second room would be my man cave",
            "An entertainment room. I would prefer not to have any electronics in my bedroom or common spaces.",
            "Music room",
            "Make it a library. Maybe add an office desk but make it a library I say.",
            "I'm a single guy living in a 5 bedroom 4 bath house. all but two are empty and not in use. One is my bedroom and the other is a work area room where I do fun little projects.",
            "Theater/game/pc room.",
            "Realistically storage, but I'd love a library.",
            "Tea party room, pink af, and lots of MLP and as much Desu Desu as  you can.",
            "Office, gamer room, workshop, project room, studio, movie room, storage",
            "Definitely an office/study room",
            "If it were me, I’d put the bed in the smaller room because the only thing I’m doing in there is sleeping and use the bigger room as an office/studio. I’ve been stuck in a one bedroom forever and I really want to have a space dedicated to music and video creation. ",
            "Gun room",
            "Office and guest bed are obvious. If neither is needed, I’m setting it up as my gaming room. Keeps the living room a little classier.",
            "Office /library or whatever your other interests are. \nOr perhaps a game or movie room",
            "Grow weed",
            "Home Theater",
            "If you WFH I think it's really good to separate your work environment from where you sleep. It's so beneficial to just be able to close the door at night or during the weekend and just forget about work instead of being reminded by it when you go to sleep. At least for me YMMV",
            "Office with TV and futon for friends.",
            "Home office/guest room/game room.\n\nOr if you’re light on cash, rent it out",
            "First bedroom is where I sleep, live and do activities. \n\nSecond room is where I take ladies and keep well maintained.",
            "Easy. Music Studio place.",
            "if you are not planing to rent it, make sure there is no lying places. Even possibility to place  mattress, sofa, hammock.   \nif you are fine with what you have right now, just dont over complicate. live it alone, once you need it you do what you want.   \ngreenhouse room. I'm serious.",
            "Man cave as a girl or partner is moving in soon",
            "Library!!",
            "Office/work space. Even if there’s room in the masters I’d say don’t work in the same space where you rest.",
            "Any kind of room where I can make a profit from home",
            "I’m a married dude with an extra room. It has become a guest bedroom that never gets used/ my sim racing and computer room. \n\nI’d probably just do that even if I was single lol. Nice to have an extra spot for whomever if needed. We don’t use it much but has been extremely clutch when we have needed to.",
            "Study/ office / workroom",
            "Boardgame room, aka LVDVM.",
            "Gaming/working room",
            "Considering I'm not the \"work from home\" type, probably a dedicated hobby room, where I set up my racing sim and a work bench for RCs/Model cars, probably with display cases and posters up on the walls",
            "Office + yoga mat",
            "I have mine as the work out room/guest room. Have a bed/dresser in there but normally leave my folding bench out and just have some adjustable dumbbells. Doesn’t take up much space.",
            "Tattoo studio/music studio",
            "Rent it to me for free\n\nPls",
            "Home office but id keep a futon or something in there for guests needed. If you dont have a reason to work from home i still say home office. Bills, mail, and general organization for important things. Heck i sit at my desk to write grocery and to do lists.\n\nA spot to delegate productivity helps",
            "Hobby/ office / gaming room, with an air mattress available to put down for any guests! Keep my PC and tech in there, D&D stuff as well.",
            "Hookers and cocaine",
            "I'll make that my gaming room/ man cave for sure.",
            "Gaming room.",
            "Office/craft/hobby/gym and guest bedroom combo.",
            "grow room",
            "I’d make it a study, and I would include a desk, computer and printer, and a TV.",
            "at minimum put a nice futon in there. can be a couch for whatever you do in there, plus can fold out if someone needs to crash for the nite.",
            "Office/Guest bedroom",
            "OP, i am that guy. The extra bedroom is where i have all my hobbies stuff. Gaming tv and all my consoles, comic books, bushcraft gear, etc",
            "Turn it into a personal library for my expensive books",
            "Without any question in my mind, I would absolutely be removing my desk & computer from my bedroom and putting it in the spare room. If you have family/friends that visit, the 2nd room can be an office and guest bed combo. Otherwise, maybe an office and home gym combo?",
            "A triathlon paincave.",
            "I bought a 2 bed thinking - if times get tough I can rent out the second room.\n\nFor the first 3 years I kept a double bed in there plus my desk. This year I removed the bed and got a fancy blow up mattress because I LOVE having the space and I can still host people whenever I need to, too.\n\nIt's great having a space to sleep, a space to relax and cook, and a space to work.",
            "goon cave",
            "It’s not just a space thing but a psychological thing. Associating your sleep space with where you work or your work place with where you sleep will change the way you feel about the space. You will never feel disconnected from work, and you might associate work with feeling tired. \n\nAn office space can easily be multi use. I have an electric piano, a corner chair, a tv, and a putting mat in my office. I also have a second computer / monitor set up that’s for personal / gaming. All in an 11x10.",
            "Jerk room",
            "Wall it off. No one needs to do that much walking back and forth",
            "Office/Lego room",
            "Studio/work area, I play piano and paint.",
            "Floor to ceiling, tools.",
            "Office and/or hobby room. Like if you like music it can have listening equipment.",
            "Don't put the computer in the bedroom.  Keep the bedroom a screenless room.  No computer, no tv.  You have the space, so your bedroom should be for sleeping and intimacy only.  The second room can have a desk with a computer on one wall, a couch with a pullout bed on another for guests without turning the whole thing into a guest room, and you can also keep workout equipment/mats there and turn it into a workout space.  \n\nPlus, you can use that closet for storage of bigger things.  The bedroom closet should exclusively be clothing and bedsheets.  The main apartment closet can be towels/rags and cleaning supplies, and the second room closet can be literally everything else.",
            "Lots of people saying to separate your work space but that assumes you use your computer primarily for work. If you work from home then yes, 100% move all your work stuff to that room. But I think the typical single guy may be using his computer for entertainment more than work, in which case it can be in the bedroom, or the living room, or whatever. \n\nBut I do think there's value in making your bedroom a restful space rather than a hangout space. You've got 2 bedrooms and a living area, I don't see much reason to even have a TV in your bedroom unless you really love watching TV in bed.",
            "Bunch of cat trees for my cat",
            "You’ll sleep better and impress partners by keeping your office separate from your sleeping area. Enjoy the extra space in each.",
            "I have a second br and it doubles as a guest bedroom when friends stay over and an office / extra storage.",
            "Sex dungeon. \n\nOr weed farm.",
            "Fishin stuff and a half-assed library of fishing and car mags.",
            "I had a bit of a FWB arrangement with a guy who lived in a two bedroom house.  The second bedroom was the sex bedroom.",
            "I'm a single guy in a 3 bedroom house. I do a bedroom, a hobby room, and a rec room. Bedroom is obvious, the hobby room has my guitars, computer, and keyboard, and the rec room has a pool table (4x6 not full size), a futon, and lots of alcohol. Granted you probably don't have that much space but an extra room for hanging out is always fun",
            "If you work from home, 100% an office. Great to be able to leave work, close the door, and not think about it anymore. \n\nIf not, maybe a computer/game room. Have all your tech and nerdy shit in there, then leave your living room clean and adult looking.  Also better than having a big ol’ computer set up in your bedroom - could be off putting to women you’re trying to bring to bed. \n\nFinally, if you don’t care about either of those, maybe a guest room and/or workout area. Throw a bed or your treadmill/weights in there so it’s not out in the main area.",
            "I made it my computer room hooked up a third monitor, played The Witcher 3 and watched football at the same time for one glorious season.",
            "Office + Treadmill + Trundle Bed couch for guests",
            "That's a personal question as it depends what you're into. The easiest answer is generally, anyone can use that as a guest room. If you're not someone that expects to have guests ever, the next logical answer would be a home office. If that also is of no use to you, then that's where it breaks down to being personal as far as what you're into.\n\nFor myself, I would use it as a music studio. A friend of mine would use it as an art studio. Another friend would use it as a gym/small exercise room. Shouldn't be too hard to figure out unless you don't have any hobbies. Which is also ok.",
            "Put your desk and computer there\n\nThey absolutely should not go into the primary bedroom unless its your only room.",
            "The Hobby Room.\n\nYou can cultivate your interests and have a dedicated space to enjoy it.\n\nWhen my girls moved out and the wife left, it was fun to put down the Mega Supremacy map out and have the guys over for drinks and gaming.  The cats had fun with it also, but that's why you have cats.",
            "Convert it into some.aler of studio and start hosting",
            "Actual home office. Don't care what I'm doing for a living at that moment. Suddenly a portion of rent is a tax deduction.",
            "Install a drain in the floor so you don't get their blood all over the rest of your home.",
            "Here’s what I did with mine.\n\nhttps://www.reddit.com/r/malelivingspace/s/1q9IrGRAI9\n\nHome gym/sauna/sex dungeon/trip cave/guest room. \n\nSince that post, I’ve also built a little cubicle with lighting in one half of the closet for my partner to work from home. So add office to that list.",
            "My office",
            "SEX DUNGEON DUH",
            "Make a walk-in closet for all your outfits and shoes and accessories.",
            "Office. duh.",
            "(Have that now.)\n\nComputer / Desk and (small but usable) photo studio for small projects.  (Still life / Macro / . . .)\n\nIf it had something other than carpet . . . it'd probably be the \"sourdough bread experimentation and prep\" area too.",
            "Either a fitness room or a library/media room",
            "I used to be a single woman living in a 2 bedroom. (Still living there, I'm just married now.) \n\nThe second is partially the cats' room (litter box and cat tree) and partially my workout room (bench, dumbbells, bar/plates). I also have my computer and desk in there.",
            "Home Office",
            "I used it for my home office, but if I could do it over again I'd put a mechanical bull in there.",
            "Spare bedroom for guests?",
            "Office / Guest Bedroom. Why would you want your work set-up in your primary bedroom, if you could avoid it? Put a reading nook in your bedroom instead",
            "I would need to know more about you to give a good answer",
            "office/art studio/music studio/gaming room/home theater/listening space. basically my hobby room.",
            "Home gym/office",
            "I’d put a tent and 6 plants in it.",
            "Christian Gray",
            "Game room",
            "iracing rig and Lego",
            "Hobby shop.  Art studio.  Adventure room-  (all your outdoor gear and bikes, not shades of grey).",
            "Hobby or work room depending on what you do for work/hobbies. I would also throw a bed in there for if a friend is spending the night",
            "Goon cave, weird you would need to ask?",
            "Projects, hobbies, guest bedroom.",
            "Not single but my 2nd bedroom is close to what i’d want. Dart board, Desk with cpu setup. Just would move gfs desk out for a Squat rack/bench and a weight tree. I’d be good to go",
            "Man cave",
            "it's not about the space, it's about separating the place where you sleep from the place you have your activities in front of a screen",
            "Office/game room/hobby room",
            "My 2nd bedroom is a Guest room/storage. Just a small twin bed and lots of shelves. Where some of my furniture goes to die. \n\nI’d use it for an office instead of my bedroom. I’m able to use my living room for an office, so that’s why my 2nd bedroom isn’t. Your brain will thank you for separating your bedroom and office. Make use of the space you have, no need to pretend you live in a studio.",
            "Storage room / office room is what i did",
            "Bedrooms are for the S’s\n\nSleep\nSex\nSick\n\nWork, hobbies should be in another room.",
            "Had it till the baby was born (not single but had spare room to do whatever I wanted). There was a couch that can become a bed from the ikea and a pc desk with dual monitors and all that.",
            "Gym or my personal dream of having a gear room so I can lay out all my camping stuff",
            "Man cave",
            "Theatre or music room for me. I've done both.",
            "With costs the way they are I’d get a room mate to share expenses",
            "Gimp storage",
            "Grow a bunch of houseplants, indoor greenhouse, put pc in there because it would be nice to not have it in the main room but if not just turn it into a chill room with no distractions. Good audio setup comfy seating nice art",
            "office with a futon/couch with pullout bed for potential guests",
            "Work space setup and Murphy bed for guest",
            "Judging by my current situation. Leave it empty other than a bass drum I don’t know what to do with",
            "Either rent it out or use it as a closet.",
            "That would be a nice problem to have. I split my living room up into a living area and woek area as I work from home. \n\nIf I had a second bedroom, I'll think about getting a hot model GF so that we'd have a bedroom for the baby. But since I'm too much of an introvert, I'd use it as a guest bedroom for family and / or storage.\n\nOr maybe I'll move my work desk in there, add a TV and couch. And then I'll move back my couch in the living room, resdesign the layout, and get a bigger TV for the living room.",
            "Grow weed",
            "Computer/Work desk.\n\n2nd bed for guests.",
            "This will be my situation in a few weeks...\n\nI got a second bedroom for the following reasons: \n\n- Office / Gaming Desk \n- Storage of moving boxes until they can be sorted\n- Place to air out my hockey gear without stinking up the rest of the apartment",
            "You should not work where you sleep. 2nd bedroom is office and guestroom or home gym or music practice area for most folks I know.",
            "For me it’s a music studio and a listening room for my records",
            "Office. Keep your work stuff out of your bedroom. That's for sleeping and sex only.",
            "Game room",
            "as an European, I want to say that the American habit of counting any room besides kitchen and bath as BEDrooms is weird. We just call them rooms, as you decide anyway how they are used.",
            " Since i am going all in on streaming and content creation probably work room/office",
            "Cat room",
            "Second room is where I keep my turntables and records and storage for my bikes. Also had a sofa bed in so if guests stay.",
            "Dungeon.  Breeding bench,  noise deadening foam, etc.",
            "Storage or guest room.... or storage/guest room!",
            "Gym",
            "Office; gaming room; storage; make it a guest room;",
            "All things going to plan this is what I'll have by the end of the year.\n\nSecond 'bedroom' will be a studio - space to store all of the guitars and other hardware and the synths/pedals/amps I most frequently use set up and ready to go, because nothing is worse than sorting through power supplies and cables for 30mins just to record a few ideas. \n\nLiving room will double as an office because what idiot bothers with a TV when a PC with large monitors is possible?\n\nGuests can sleep in the bath.",
            "I'd do a gym.  Sound proof the walls and have a decent sound system to play a gym rat playlist.",
            "Girl here but - 2nd bedroom could be home office…art or hobby room…plant growing room with indoor greenhouse and lights…could make into small chill / moody library with shelves from ikea and plush seating for books and music listening… if you are a sneaker or fashion collector it could be a great dedicated dressing area with clothing racks and large mirror, add floating hat hooks on walls etc…so many options!",
            "Planetarium",
            "Model railway",
            "Office / Gym",
            "I did this, I turned it into an office/game room/mancave due to its size. Loved it",
            "I just stored shit in it",
            "Home office or a maker lab",
            "Office, weights, music stuff.",
            "Gym/office/workshop for hobbies",
            "Office/study/hobby room. Bedroom is only for the S's.",
            "Library and leisure area.",
            "Storage / home office combo, nicely organized. I have various activities that require gear, and it's choking the psychological life out of me in my current space because I'm not a hoarder and it's too much stuff in too small a space, and I'd love not to pay for a storage closet elsewhere.",
            "slime pit. Huge one",
            "Grow tent in 2nd bedroom.",
            "Office if it’s needed, gaming/hobby/art room\n\nA messy room!!! A place where you can work on projects and leave it out and messy while you are mid process",
            "Listening room with a set of great stereo speakers for sure.",
            "I would make it a gaming room",
            "Office",
            "Office/guest room. Currently my office is the tiny \"dining room\" of my small 1 bedroom apartment. Then I could have a real dining room. But I'd have to set up my office in the dining room temporarily if I had a guest staying over. Which isn't very often, luckily. \n\nI'm just 100% against having my office in my bedroom. It keeps the bedroom for rest/sexy times only.",
            "Get that shit out of your room dawg sleep sanitation is key. \n\nSecond room is for work and hobbies.",
            "Roommate and cut the bills in half",
            "I had the second bedroom in my place be a workout room. I had a legit squat rack, cable machine and a bunch of free weights in there. Was expensive to get up and going initially but I liked not having to leave the house and being able to fit a workout in much easier during my down time.",
            "Guest bedroom! Not just for guests, but also because sometimes I like sleeping in a different place just for variety. Also can double as a trip cave if you’re so inclined. 🍄✨",
            "I wfh -- i set up my desks in my living room and use my second bedroom as a library. I put a nice chair in there and a few book cases. living alone in a 2 bedroom is pretty dang awesome.",
            "It’s my daughter’s room lol.",
            "Half office half gym",
            "Leave it pretty much empty. Set up room to kinda block it. Share room with my friends dad. Also share the bed with this guy.",
            "I made it into a spare bedroom/creative workspace.  Also, apparently the room where all the succulents go",
            "grow room",
            "Game room, home office, guest bedroom, storage, entertainment room, pet’s room, home gym, arts and craft room, library, greenhouse….",
            "I put workout equipment there.",
            "Roommate. Split costs.",
            "My second bedroom is currently my closet/e-drum room.I can't modify the closet storage, so instead I bought some standalone organizers and more or less extended the closet out into the room. The other half of the room is where my drums are set up.",
            "Work/ office during the day, convert open floor to workout space when you dont want to go to the gym",
            "it’s an office but i don’t use it as an office. i’m going to turn it into a stretching and weight bench room",
            "Absolutely worth separating where you work and sleep",
            "Nothing cooler than a legit home office.",
            "This is my plan!  \n\nI'm downsizing once the kids move all the way out (they're adults doing this already) and one room will be my bedroom, the other will be the computer room / office for WFH.\n\nI could fit my computer in my bedroom now, but I love having the separate spaces.",
            "Yep, moving into a condo in a few weeks, 1 bed plus den (with doors!), den will be my office.",
            "100% this.",
            "I worked from my bedroom for 2.5 years and began to subconsciously avoid it. I would find myself sleeping on the couch and not bother going to bed when I woke up.",
            "Yes. Home office, combined with workspace for my hobbies, library, and perhaps man cave.\n\nIf you’re single, you need to keep your bedroom decently clean and presentable, in case you have somebody coming over to share the bed with you. The other room can be however you like.",
            "Same, mine would be a listening space as well for my records. Throw some chairs in there and you good.",
            "that's what i did with my extra room.  even had enough space for a fold out couch for guests.",
            "That's my plan. Don't need a true home office, but gaming computer, large TV, gaming consoles, comfortable couch, mini fridge, etc. And some underused exercise equipment in the corner",
            "Hell yea! Art/music studio, game room, workout room. Man I wish a had an extra room just so I could get a futon and have a place for friends and family to stay over comfortably without being on the living room couch.",
            "Thats mine.\n3D printer, soldering/electronics bench, model train bench, computer desk.\nFills the 4 walls nicely, and i can keep my headset on and talk on discord while i do whichever hobby.",
            "Exactly this. You have spare space in your bedroom, either buy some sex furniture or make it into a relaxing-but-awake space. Also, an office doesn't have just a desk and computer, it can have space for any hobbies you have, or the aforementioned relaxing space. If you have pets, it can also be their little corner of the house.",
            "Yes, don't work where you sleep if at all possible.",
            "I agree with this. If you bring a date over, they may be turned off by having a computer in the room they potentially are going to be intimate in. I can imagine a person thinking they may be recorded by a webcam and not want to take a chance even if you don't have a cam.",
            "That’s what I did. Guitars, bass, keyboard, all the rest of my music gear, my fiancé’s art stuff, a ton of posters and cool shit I’ve gotten over the years, and a beer fridge",
            "I dream about a 2nd bedroom or room for my vinyl records.",
            "This guy did not struggle during COVID",
            "The window won’t be the only thing bricked up",
            "The GOON ROOM",
            "🤣 Bruh I was just gonna say \"Jerkroom\" but then I saw your beautiful Tolken-esq description of a masturbatorium and bro, you got it.",
            "Thanks for the inspo",
            "Why not put the tv on the ceiling so you can lie back in the bean bag chair and just look straight up?",
            "The only weird thing about this post is you spelled it \"rooter\".",
            "I gotta have my TOOLS!",
            "I think you might wanna keep a window to air that bitch out 🤣🤣",
            "Yeah, but why would I need a *second* masturbatorium?",
            "Building a literal goon cave.",
            "Or more realistically, a masturbation station",
            " The Bate Cave 🦇 🍆 👋 💦",
            "i mean hello",
            "Anyone have a Violet Wand 😏😏😏",
            "Sounds kinky i'll bring the toolbelt",
            "It's a little crazy to me that you're the only one that said this lol.",
            "I live in a 2br and turned my spare bedroom into a guest bedroom and absolutely love it. I have my desk in the living room but barely use it anyway, my version of work from home is my lap top on the couch while watching Netflix lol.\n\nWhenever a friend is in town and I offer them my spare bedroom they are really thankful and I feel so fancy. Friends from across the country visit more often because of it too since they have such a comfortable space instead of crashing on a couch. \n\nWould highly recommend it to anyone with a spare bedroom!",
            "In a house maybe, but an apartment..?",
            "The things I'd do for a dedicated sim racing room...",
            "My thinking exactly. I'd much rather spend $250 more per month on an extra room directly attached than something similar for a small unit offsite.",
            "Wild that you’re the only one so far to suggest a roommate. I’m in my late 20s and have had at least one roommate since I moved out of my parents’ place immediately after college. The ability to split bills and decrease your cost of living is HUGE. I also became best friends with my roommate though, not everyone is that lucky. But as an introvert, the forced socialization was good for me, especially during Covid",
            "Renting it out to a friend or someone you vetted through your friends is a good way to get passive income that helps pay for the rent.",
            ">sometimes it's nice to have extra money \n\n\nWhen is it not nice to have extra money?",
            "Shroom room",
            "I need to have sex first to have a dedicated room for it",
            "Living the dream!",
            "This is da way",
            "\"If you need me I'll be in Holodeck Four.\"",
            "#AIRBnB that shit. Live rent free.",
            "Considered doing that with my basement but instead I rented the area out to a friend to make into his own little living space. Still not 100% certain I shouldn't have just gone with the fight ring",
            "This is the real answer. Let someone else pay your rent. Better if you own the place",
            "Waking up on Saturday and Sunday to the view of the desk I work on is the worst.",
            "I work so much better when I'm not constantly tempted by my bed",
            "Ditto. Never put a workspace where you get rest.",
            "The first time I got Covid all I really experienced was random waves of fatigue. Pretty quickly got stir crazy and wound up ordering materials from Home Depot and building a wall to wall shelf with desks in the spare room in between collapsing on the couch. Even scored a big leather law office looking chair on the side of the road a while after, felt like a baller even though I only worked from home occasionally.",
            "With many leather bound books and furniture made of rich mahogany",
            "There’s an absolute ton that’s cooler.",
            "It's kinda funny when your background is your bed and closet and clothes rack.  ",
            "Probably don’t need the mini fridge. The regular fridge is very close if it’s only a 2br apartment!",
            "Feel like the mini fridge is just gonna run up electric. If you ain’t using the gym equipment the least you can do is walk to the fridge",
            "Wtf is your living room going to be used for?",
            "I love how the two options are \"sex furniture\" or a relaxing boho bungalow .",
            "Defintiley don't want to bring over your crush, start getting intimate, but realize you're broadcasting it to your entire high school is is also watching.",
            "Hahaha, Im sorry. How old are you? I cant imagine anyone my age (30) or younger having those concerns. There would be absolutely no hooking up during university if that was the case... \n\nPlus, most people would suspect a small, transportable (hideable) device to be used, like a cellphone or camera.",
            "Computers and their furniture are quite ugly and mess with the rooms Aesthetic. I’m planning to get a computer build with a custom wooden case so it looks a bit better in the living room. I just wish I could have one of those TVs that disappear into the wall when they’re not in use.",
            ">strangulation tools\n\nIt sounds like he struggled a little",
            "The jack shack",
            "He stole it from the show the last man on earth\n\n\nhttps://youtu.be/TUJj5PaT-d0?si=l6z053eN0XpXzlgK",
            "If you squirt the tv, you’ve won at life. 💦",
            "It amused me because in Aussie slang ‘having a root’ is another word for sex",
            "A masturbatorium 🤓",
            "Goon station",
            "Masturbation cavern",
            "*And it ryhmes!*",
            "Depend on how expensive rent per sqm is. I am not gonna save one room for some potential guest than enjoying it myself. Took my 30 yrs of living to get a second bedroom.",
            "I get the impression Millennials and Gen Z aren’t into hospitality the way our parents and grandparents are. Not to say that we’re not hospitable to guests, but we don’t designate guest spaces the way boomers do.",
            "You’d love my loft 😂",
            "i have a dedicated desk to clamp my wheel on haha",
            "Honestly, I'd never want a roommate unless it was my partner. Having to put up with someone every day is not something I look forward to. I know their habits will be different than mine and there's going to be something they do that drives me insane.",
            "I just moved out a few days ago, and the entire time I was looking for a place people were suggesting a roommate. I'd shoot it down before they could even finish the sentence and respond the same way every time. \"Why would I move out just to move in with someone else that isn't a significant other?\" Especially a random person I don't know. So, I don't think it's far-fetched to think others share my train of thought.",
            "Buy a room that comes with sex.",
            "Build it and they will.. come?",
            "My managers would send emails and Teams messages all weekend long and I hada habit of forgetting to shut my laptop off so I'd wake up to pings thinking I was late for work. Or after I realised it's the weekend I'd still take a look at the message because I figured it'd make my Monday easier. \n\nGetting a separate office was amazing. Bigger separation from work. I no longer hear pings and don't look at the messages unless it's my work hours. My life is not my work and my work is not my life.",
            "In my head my work desk is my gaming desk since that was its original purpose. I hide my work lap top so my brain doesn't see it.",
            "I love you",
            "But I want to feel like I'm in a mansion ok?",
            "But I already own the mini fridge. So it's not really our of my way and I can just stock it with drinks and alcohol.",
            "Sometimes you just want to reach out and grab an ice cold Wild Cherry Pepsi",
            "Ok mom",
            "Don’t listen to this guy, get a mini fridge, live your best life",
            "Modern Mini fridges don’t use a ton of electricity. I keep one in my bedroom like a little mini bar. It’s great but having to go downstairs for a cold drink or even to the upstairs bathroom for a faucet drink.\n\nIt’s a nice little self indulgence.",
            "I mean, I'm sure other people may have other ideas, but those are the ones I can think of off the top of my head. =p",
            "Yeah that guy fucks lmao",
            "It would be even worse if Blink-182 were watching it while hanging out with a monkey",
            "I hate it when that happens.",
            "This man American Pies",
            "As soon as you’re out of college and living without roommates, having a desk with a computer in your bedroom when you have a perfectly good spare comes across as a bit immature.",
            "That’s assuming the tools are for him",
            "The classic masturbation station",
            "Still a beautiful description imo",
            "I'm seeing so many references to this show lately and it makes me happy. I loved it.",
            "\"just the right amount of purchase\" is so genius",
            "Still bummed that show got canceled. Fucking cancel shit when there's a cliffhanger and I'm sure covid made sure it stayed dead.",
            "Goon lagoon",
            "You can still use it as an office when there are no guests, really the only difference is a sofa bed",
            "My parents have practically a frickn hotel suite for guests, nicest bedroom in the house, pillows galore, my old classic dresser, big mirror, windows w a view, stack of fresh towels, I love going to visit them",
            "I think we just realise that hotels exist for a reason",
            "I'm in the garage, except not really because I can't stand to be out there in the summer heat right now.",
            "*Let me in I'm tryna fuck!*",
            "It doesn’t work for me. I still hear the pings.. relaxing on the weekends *ping.* driving to work *ping ping.* Watching a movie *ping ping.* right as my eyes are about to close and fall asleep *ping ping ping.* In my dreams.. *pingpingpingpingopingpingpingpingpjbg* I’m looking at my dog right now and he’s barking but all I hear is *PING PING PING*",
            "> I hada habit of forgetting to shut my laptop off so I'd wake up to pings thinking I was late for work\n\nI literally never sleep my work laptop, I only turn it off. Specifically for that reason. My time is my time. They can pay me to be on call if they want me to be on call.",
            "Same here, my office is still the man cave. I got a laptop holder for the side of my desk to keep it out of the way on the weekend.",
            "lol me and you do the same thing. I put all my work stuff into a box and in a closet once I am done on Friday",
            "I mean, those are the options I would choose from",
            "It's a major red-flag. May as well put the litter box in your bedroom closet too. Endless Redditors will say that's perfectly fine.",
            "It's a masterbatorium, who else would they be for-?",
            "My fav show <3 I was so sad when it was cancelled. I wrote to Fox and Hulu lol",
            "A sofa takes too much space sadly. It is a small bedroom and I can either choose to fit two desks and a bookshelf for ourselves, or a queen bed with a dresser. Still very grateful for a separate room to put desk in.",
            "I think you need a stronger mind or at least a vacation",
            "Oh man why didn't I think of putting it on the side of my desk? Then I'd never see the damn thing. It just sits there like a black box on weekends. This is basically my gaming desk that work rudely took over in 2020.",
            "I just close the laptop but it's hidden behind a monitor, I put everything on top of it and pretend it doesn't exist until Monday",
            "It sounds a little like a murderatorium lol",
            "If you want to watch Tandy be a totally unhinged sex crazed psychopath, then the mcgruber stuff is still the same type of humor, just violent and crass.",
            "They make cabinet murphy beds now. They're remarkably compact when folded away.",
            "The sad reality is that there is really no space to let the Murphy bed lower down. European houses are really small :/"
        ]
    },
    "Back with my parents after inpatient care 🥲": {
        "title": "Back with my parents after inpatient care 🥲",
        "score": 221,
        "url": "https://www.reddit.com/gallery/1dldhkx",
        "content": "Hi all,\nI’m moving back into my parents place after beginning my recovery at inpatient care. Looking for some advice on creating a chill environment/sanctuary. Out on disability for now so I have plenty of time on my hands.\nCheers, thank you (:",
        "num_comments": 21,
        "comments": [
            "I’d say already, your space looks like a sanctuary. I love the amount of natural light you have a the wooden furniture is nice. \n\nSome simple arranging of furniture and better storage solutions would do wonders, as well as a larger rug and some different lighting options. Get yourself some vibrant, green plants and visual decor pieces that interest you.",
            "your windows are to die for omgggg.\n\nI think your biggest thing is you need storage that conceals. I.e. a laundry hamper that doesn't show the laundry inside. decorate boxes/baskets that you can put some of the smaller things into so they're not all in view. I am a huge \"keep flat surfaces clear + clean\" person. \n\nalso, lamps. i say this on 100% of the comments i make on these threads but for some reason men have no sense of lighting LOL. Floor lamps, desk lamps, whatever works- but warm light at various levels. NEVER BIG OVERHEAD LIGHT.\n\nI love your view so much. This is actually so serene, just tidy it up and conceal the \"junky things\" and this is bliss.",
            "Why do I feel like I’ve seen this exact bedroom on facebook",
            "looks great! good luck to you on your recovery. only thing missing is a furry friend!\n\nand maybe a few plants?",
            "Great room. In the corner where the golf bag is, put a comfortable upholstered armchair and either an ottoman that comes with it if you’re buying new or, if you’re at a resale or thrift store, then an ottoman that complements. Pick up a floor lap to put beside the chair and a crate or cube or small table to be an end table next to the chair. You’ll then have all the elements of the most comfortable hotel rooms: bed, desk & desk chair, arm chair for reading, enjoying the view and marking your progress.",
            "That's a cool room",
            "That's a lot of windows!",
            "Great natural light. Decluttering will help. Storage that conceal will also help. Bigger rug. Plant. Some sort of translucent window treatment would be nice. Thin linen or sheer.",
            "😍",
            "If it’s in your budget/desires, a larger bed would work here. If not, more plush/textiles would make a cozier space. An armchair or ottoman would work in the corner next to your desk, especially a storage ottoman to help declutter. A tapestry above the bed would also help. \nAll the best!",
            "Consider incorporating music into you room. Nice speakers? I wish you well.",
            "I know it's become cliche to suggest plants on this subreddit, but plants would THRIVE in that much natural light.  Im really jealous!",
            "I love your room. it looks like a space i’d live in. those golf clubs look enormous lol",
            "Love the windows! I would add long sheer white curtains, large rug, plants, nice frame over the bed and get dresser/cubby for storage as well as a comfy chair. \n\nWishing you a speedy recovery!",
            "Even if you’re not a plant person I’d suggest at least one or two with all these windows you have. Plant grow, you recover, good connection.",
            "It's such a nice feeling moving back into your parents' place, when you could use their love and support. I've been there.\n\nI wish you all the best.",
            "Such a cool room… just a thought: move the desk to where the golf clubs are and facing the room (so your backs to the door)- having a commanding position like that will make your working space feel a lot more comfortable. And move the chest of drawers to the back left so it opens the room up (tall furniture in the back)\n\nGet a plant or two with so much light!",
            "Agreed. All those windows and natural light is such a good mood booster! Wishing you a speedy recovery",
            "Haha hopefully it’s not on Facebook",
            "Onlyfans?"
        ]
    },
    "What Microgenre of Modern Interior Design is This?": {
        "title": "What Microgenre of Modern Interior Design is This?",
        "score": 71,
        "url": "https://i.redd.it/vudhytiny08d1.jpeg",
        "content": "This image is but one example, but elements of this interior design style often include: walnut wood furniture and millwork, natural stone, black marble, natural materials, high-tech, funky/pop street-art (Kaws, brickbe@r, Alec Monopoly), subversive consumerist themes, warm light, cove lighting, metal finishes (bronze, copper and black), dark, masculine. I realize it is generally modern or contemporary, but if “Fraserbane” exists as a microgenre of interior design, then certainly this has a specific name too?..",
        "num_comments": 24,
        "comments": [
            "This is west coast evil villan lair core. Your not exactly faulting your wealth but but only an evil villain has that much space on the west coast.",
            "Would say it’s just straight up mid century modern.",
            "It actually looks very Scandinavian modern.",
            "This is “if you don’t get it, you’re too poor” design",
            "A rich one.",
            "What are these brown chairs?",
            "Malory Archer’s office",
            "For a large room, I like the green curved sofa and the two caramel chairs, but that's about it. Oh, and the ceiling-to-floor windows.",
            "Modernized mcm",
            "Is that a sliding whiteboard hiding a TV? Looks like someone wanted to bring mcm into the office environment...",
            "Not welcoming, sorry. Also, the characters on the shelves are scary.",
            "Absolutely not mid century, but does take inspiration from it.",
            "Could it be the cute dolls on the wall or that the tv can play peek a boo?",
            "B&B Italia Husk",
            "Yeah I also find floor-to-ceiling windows with big comfortable seating options and warm wood tones very unwelcoming.",
            "Are you sure I can’t sell you one?",
            "Eh they’re just low res. It’s those Lego man mouse statues for sale in every sneaker store.",
            ">but does take inspiration from it\n\nSo like modernized mid-century?",
            "I hate the bear bricks decor trend with my gut",
            "More like mid-sized modern century.",
            "I would just say modern. The mid century design isn’t there as much as it uses similar elements.",
            "The who what now?",
            "Clearly, you are blind.",
            "Hypebeast home decor bullshit"
        ]
    }
}