{
    "What manga have you read this week, and what do you think about it? - Week ending June 16, 2024": {
        "title": "What manga have you read this week, and what do you think about it? - Week ending June 16, 2024",
        "score": 34,
        "url": "https://www.reddit.com/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/",
        "content": "*This week = the one that ends/ended right now, past seven days.*\n\n---\n\nThe reason for this thread's existence is the fact that both requests and suggestions became kind of stale. It's supposed to bring out more manga that is not RTed or recommended. Also, it's quite useful for the discussion of not so current titles.\n\nPrevious weeks: [First 72 weeks](http://www.reddit.com/r/manga/search?q=author%3Agladiatorua+What+manga+have+you+read+this+week%2C+and+what+do+you+think+about+it%3F&restrict_sr=on&sort=new&t=all#page=1) and from [June 28, 2015 onwards](http://www.reddit.com/r/manga/search?q=author%3Aautomoderator+What+manga+have+you+read+this+week%2C+and+what+do+you+think+about+it%3F&restrict_sr=on&sort=new&t=all).\n\nAlso, not a rule or any kind of criticism, the more interesting part is not the list of the stuff you read, but your impressions of it.\n\n----\n\nYou can get /u/Roboragi to reply to your comment with links to MyAnimeList, MangaUpdates etc. series pages for the mentioned series. Using this format \"<Manga Title> like so anywhere in the body of you comment. For example:\n    \n    <Dorohedoro>\n    <Golden Kamuy>\n \nWill have /u/Roboragi reply to your post with a comment like this:\n\n\n\n**Dorohedoro** - ([AL](http://anilist.co/manga/31133), [A-P](https://www.anime-planet.com/manga/dorohedoro), [KIT](https://kitsu.io/manga/dorohedoro), [MU](https://www.mangaupdates.com/series.html?id=209), [MAL](http://myanimelist.net/manga/1133))\n\n^(Manga | Status: Finished | Volumes: 23 | Chapters: 191 | Genres: Action, Adventure, Comedy, Fantasy, Horror, Mystery)\n\n**Golden Kamuy** - ([AL](http://anilist.co/manga/86559), [A-P](https://www.anime-planet.com/manga/golden-kamuy), [KIT](https://kitsu.io/manga/golden-kamuy), [MU](https://www.mangaupdates.com/series.html?id=113608), [MAL](http://myanimelist.net/manga/85968))\n\n^(Manga | Status: Releasing | Genres: Action, Adventure, Comedy)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/kl85b3/what_manga_have_you_read_this_week_and_what_do/ghe3ssl/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)\n    \n---\n\nThis helps users find links to series pages for the series you mention on list tracking sites without you having to manually do it yourself\n\n----\n\nLastly, don't forget to use [spoiler tags](https://www.reddit.com/r/manga/wiki/guide#wiki_spoilers) and to make sure to report any untagged spoilers.",
        "num_comments": 49,
        "comments": [
            "Toshokan No Daimajutsushi\nIt's the best read I had this year, and I don't say it lightly. It's a fantasy world following a kid who wants to be a librarian. I can't do it justice by describing it, so I will say that it's well written, the world building is great, it's nothing like your isekai trope. The more you read the more you discover the world, societies, the lore, the problems that will rise in the next chapters. It would do a great adaptation in anime",
            "I finished <Non Non Biyori>! It's a cute series. I think the Renge chapters and the Natsumi chapters were my favourite, Renge because she was such a goofy kid (and later on attempted to be an older sister figure, which shook things up a bit) and Natsumi because she was such a screw-up lmao. I didn't particularly love the series, i don't think it stands up above the other slice of life type stuff, but it was a good read-through.",
            "**My Wandering Warrior Eating Disorder** aka **<Meisou Senshi Nagata Kabi: Gourmet de Go!>**\n\n\nIn this part of the gripping autobiographical graphic novel saga by Nagata Kabi (*<My Lesbian Experience with Loneliness>*,*<My Alcoholic Escape from Reality>*, etc. etc.) it goes into more detail of, well, if the english title isn't a dead giveaway, her eating disorder issues that coincided with/stemmed from the rest of her psychological and depressive issues that she went on at length about in her previous books. This one is much much shorter than the other entries though. But still, if you've read and like me have been impressed by her works thus far this entry is here to read as well.\n\n\n**<Skeleton Double>**\n\n\nI liked this. I really did. Interesting base for the use of powers in this story. The Cypress lady was great. And once they characterized the MC he got interesting. But oddly, beyond a lot of those surface level thoughts on this one, I don't really have anything more succinct to say about it. Though the rushed final conflict with all the potential story elements crammed in there at the end on top of the overall feel at the end probably didn't help in that regard.\n\n\nIt didn't really do anything wrong in it's execution, and like I said I enjoyed it. I just find myself without much to say about it beyond, \"well that was cool\" a lot of the time.\n\n\n\n**<Daddy and Buddy>**\n\n\nWell this sucks Beavis, another decent series came to a sudden end. Not that I couldn't foresee this series being one of those cases from the get go but still.\n\n\n\nWell in any case. The mature emotional throughline of this series really gave this one it's chops.\n\n\n**<Dear Anemone>**\n\n\nAnd this one didn't last long now did it. Not that I was expecting this poor mans version of *<Jigokuraku>* to anyways. And it went out on a very cheesy note.\n\n\n\n\nWell, the artwork certainly did it's job though here can't deny that. Got some mild enjoyment out of reading it. But it will ultimately not be missed.\n\n\n\n**<Futari no Lion>** aka **The Two Lions**\n\n\nIt was short and there and I was bored with no better ideas for things to read so whatevs.\n\n\n**<Ore no Imouto ga Konnani Kawaii Wake ga Nai Comic Anthology>**\n\n\nDamn was I bored as fuck with no better ideas for something to fill an hour with enough to read this...",
            "Yakuza Reincarnated, it had a good premise but I am still checking if it does wonders. Hopefully it doesn't turn into a shitshow that is Re:Monster",
            "Caught up to <Bokura No Kiseki> literally one of my best reads of all time. Why is this manga is underrated? A large cast who is so, so wel written, an amazing plot with rich lore and amazing plot twists? It's an amazing series.",
            "Started <The Apothecary Diaries> and caught up with <Blue Lock>. \n\n\n Apothecary is pretty fun, and I adore Maomao for her little cat appearances and the way she's just so unphased by Jinshi sometimes. Also, her inner gremlin coming out when medicine is involved, very cute. The mysteries are pretty intriguing, quite like how some (maybe all, I have bad memory) cases have little hints that relate to the answer Maomao comes up with. For example, >!when the woman woke up before the dude she poisoned, without much help, which did play into what Maomao came up with as a solution!< while she was visiting her home.  \n\n\nQuite good overall, and the art is great. I'm only on Chapter 35.1 though, haven't caught up yet. I'm mostly curious if Maomao is gonna take any major losses by drawing a wrong conclusion during a case in the remaining chapters, I think it would be a good shake up. \n\n\n Onto Blue Lock, I really enjoyed the U-20 game. Isagi's goal at the end actually made me yell. On the other hand, my eyebrows were raising reading just about everything Shidou said during the match. \n\n\nThis whole arc was just plain awesome and chaotic: Rin going boogeyman mode, Shidou, the Itoshis, Ego actually showing a hint of happiness for once, Aiku, \"Make us win, you shitty four eyes\", Reo and Nagi actually working well together after a while, Nagi's fist pump, and Isagi's puzzle coming all together with the \"luck\" piece. \n\n\nThe 2 follow up SoL chapters were a great break from all that, pretty cute and chill.\n\n\nThe current training/selection games(?) with the top players have been good so far. I do think they're a little worse than U-20 quality wise since it's been >!Isagi brainblast sweep moreso than usual, and Bastard beating Ubers and Manshine felt a little bleh IMO.!< I do appreciate how some underutilized dudes got some screentime though, namely Raichi and Hiori. Also Kurona, kind of, but so far he seems like a bit of a pass bot.\n\n\nOn the flip side, Kaiser has also been jobbing as a \"rival\" compared to Rin tbh. He was annoyingly good at first, but now that everyone is getting awesome moments and >!Isagi has been out smarting him most of the time,!< he kinda sucks. Sure he'll >!probably score the next goal, but I don't like him enough to get hyped.!<\n\n\nTo finish on a more postive note though, I've been loving the character interactions this whole arc. Reo and Nagi >!getting back together for an awesome stars aligned move!<, Charles and Shidou >!instantly becoming besties!<, Reo and Isagi just generally being friendly compared to \"What the fuck is this guy talking about\" two arcs ago, and the top players continuously making fun of Noa only for him to \"🗿\". Also, I laughed extremely hard at >!Rin and Kaiser breaking down after Isagi scored in the PXG match.!<",
            "I recently caught up on a few manga I stopped reading a while ago, or even years ago in tha case of <Kaiju No. 8> and <Spy x Family>.\n\nI got lucky with my timing. Kaiju No. 8's latest chapter is the climax of a long arc. I probably wouldn't have enjoyed it as much if I was reading the chapters as they came out, but I think the pacing is good if you read it in one go.\n\nSpy x Family doesn't have any arcs that long but still had some very tense moments. I am glad I didn't have to wait two weeks after every chapter to see how >!school bus hijacking!< would end.\n\nI also caught up with <Oshi no ko> and <The classroom of a black cat and a witch>\n\nOshi no ko is entering the last arc and I am curious to see how the antagonist is going to react to what Aqua has been doing.\n\nClassroom also just finished a major arc with >!Spica finally getting her first win against Aria!<. Followed by some good chapters deepening Spica's relationship with Claude, and a chapter in which a major character >!licks their own but.!< That last one made my laugh out loud several times and made me remember why I loved this manga in the first place. Definitely planning to keep up with this one again going forward.",
            "just finished You and I are Polar Different, I think I would love the new couple <3",
            "Hey! I need a favor. What’s the name of the manga with the little orange dragon that rides on a roomba? There’s a little purple dragon as well. They both serve a guy in a modern day hunters thing with gates and all that. Also, I was hoping to find this manga where the guy gets reincarnated as a side character, in a modern day hunters/guild/gate type thing. He also has a skill that makes him stronger the more famous he is. He was known for being ungrateful and bad, but now is a good guy. If anyone can help I appreciate it!",
            "I've been lazy and I'm still trying to get through my Demon Slayer set :/",
            "The newest issue of Rising of the Shield Hero appeared, and the artwork is great. There's a lot of scenes with \"beautiful singing girl\", and \"crazy with panic\" giant chicken.\n\nThere was a large update of the Ascendance of a Bookworm manga translation, and I'm working my way through it. Time to read, praise to the gods!",
            "I'm reading Kitchen Princess for the first time! I'm having fun, it's very soapy in a way that I always get a kick out of, and the art is absolutely beautiful. I absolutely love early 00s shojo art - it's probably my favorite manga art style, especially with the splash pages. Kitchen Princess in particular has some of the prettiest splash pages I've ever seen.\n\nPlus, I'm teaching myself how to cook more, so reading about people cooking is just kinda fun.",
            "just finished Solo Leveling. Im not even the biggest fan of action manga/manwha but it was incredible",
            "[Smoking Behind the Supermarket with You](https://smokingbehindthesupermarketwithyou.com/) - Not sure if this is the correct place to post a question but can anyone suggest manga similar to this? It's romance, seinen, slice of life.",
            "I finished <Rough> this week. It definitely got more fast paced and dramatic towards the end, which made me realize how the first half or so had parts that were a bit disjointed (or maybe there's connections/foreshadowing that I didn't notice right away). But overall, easy and enjoyable read.\n\nI also finished <Koroshiya 1> that I had to use A LOT OF WILLPOWER not to just binge in one night or else I would not function at work the next day. Quite gory, very intense characters, intense scenes. There were parts that I felt a bit uncomfortable >! Ichi's past... I was shaking my head with his perception of the bullying and sexual harassment!< but I couldn't stop reading either way.  The plot imo tied in quite nicely.\n\nI also finished <Adam to Eve> because I was browsing other works of the creator of Koroshiya 1. The idea of having each of the men represent a sense is great, I wish it were developed more? But at the same time, I'm fine with what it gave. Also pretty gory and intense scenes.\n\nFor new reads, I am in c7 of <Korisenman>, I will probably have more to say about it next week.\n\nI am also in c88 of <Futari wa Daitai Konna Kanji>. I am enjoying it a ton, it is a well-done SoL GL so far. It is very wholesome and heart-warming, but it isn't afraid to delve into the more >!sexual topics of the various characters!<. Excited to read the rest of it this week (✿◡‿◡)",
            "Started reading <Beat & Motion> this week and have since caught up. \n\nTL;DR: Really interesting so far, the latest chapter was especially good. \n\nWhen I say I caught up, I mean I binged all released chapters in about an hour. Very good read that I started after watching the Gigguk recommendation. The story is about a (college?) student working out his own dreams and actually doing something to chase it. The pacing was done really well, but the last chapter is a bit concerning as far as serialization goes.>!Things were a bit rushed in the latest chapter; it felt sudden as if some plot points sudden and a bit forced into the chapter, and it kinda seems like the series is gonna get axed soon. !<I really hope the adaptation will bring more attention to the manga so it does better in Japan.",
            "#New this week!\n\n**<God Bless the Mistaken> volume 1**\n\nI heard about this quite recently, and learned even more recently that it was getting TL'd in English. Ordered volumes 1 and 2, and just finished reading volume 1. Given that I'm not Nio Nakatani's biggest fan AND that she's more known for writing Yuri rather than Sci-fi SoL/Iyashikei, I kept my expectations low. But boy was I impressed. It's definitely an ac!d trip at times, but it really was interesting. **9/10**\n\n\n#Ongoing!\n\n**<Bocchi the Rock!> volume 2**\n\nVolume 2 was pretty solid. Better than volume 1, actually. But for some reasons, it took me *hours* to read this, despite the low page count. Yeah, 4-komas tend to give me trouble for some reasons. **8.5/10**\n\n**<I can't beleive I slept with you!> volume 2**\n\nVolume 2 was great, bugh *highly* predictable, when you consider that the series only has 3 volumes. Despite it's predictability, it was nonetheless a better volume than 1, which was pretty solid itself. **9/10**",
            "Been enjoying my read of <Call of the Night>. I went in pretty much blind knowing almost nothing about the series. It’s a strange one for sure but I appreciate weird titles like this still coming out. I expected <Seraph of the End> in the real world basically but got something totally different.\n\nCall of the Night Spoilers >! I’m enjoying the discovery of Nazuna’s past and the development of the relationship between Ko and Nazuna. I am excited to see what the conclusion of the story ends up being: who is Nazuna really? What’s the deal with these vampires? Why does Nazuna like Ko? Who is Nazuna’s mother really? !<\n\nOn the other hand, after this I’ll already queued up my next manga, which will likely be me FINALLY reading something I planned on reading over a decade ago <Suzuka>. I’ll try to go in mostly blind to that one as well.",
            "I was recommended <Bakuman> a while ago, so finally got stuck into it.\n\nIt's interesting, in how it gives you a slightly more realistic view into how the sausage is made, while still offering some silly scenarios and situations. The character of Hiramaru is basically my favourite (A disgruntled officeworker turned mangaka), doing everything he can to avoid work, with his editor using all kinds of tricks to get him to turn in storyboards on time and meet deadlines.\n\nBut I do struggle to get through the arc of Nakai's character. Nakai is basically a 35-year old fat slob working as an assistant at first, then getting his own publication. He's also got an extremely disgusting view towards women, thinking that he can get with the most beautiful girls many years younger than him. Eventually he even starts to threaten a girl with rape.\n\nThat's fine (I mean, not the rape of course), but how some of his fellow artists keep sticking up for him is just... incredible. Especially one of the protagonists, Mashiro, keeps wanting him to come back. I'm not sure where this is going - is it depicting Mashiro's naivité, is it setting up Nakai for some kind of redemption later on or the opposite, his final mistake?\n\nI'm letting it rest for a few days, to gather up the willpower to read more about this horrible piece of shit, but I do hope the story eventually moves away from him.",
            "Lately I like reading oneshot, there are so many that I have read, one of them is usemono shigashi. I'm interested in reading jump giga 2021 summer because there are some of my favorite artists but I can't find the download file.",
            "Just caught up with Grand Blue Ch. 94. Holy crap.",
            "Started reading 2.5 dimensional seduction, it's about cosplay and as a Cosplayer I found it really good",
            "I just finished Yofukashi No Uta. I'm really a newbie when it comes to this romance genre but I'm wanna get hooked to this type of reads.\n\nAre there any suggestions for me related to that manga? \n\nJust looking for something that makes you feel, \"real\".",
            "Got around to finishing [Baki part 5](https://myanimelist.net/manga.php?id=115749). Kinda underwhelming, probably the weakest part. For one thing, after Musashi and a god damn cave man, Sumo is just... tame. Even with all that over the top Baki narrations and comparisons, the Sumo fighters were nowhere near as interesting as any of the previous fighters from earlier parts. For another, it also felt rather directionless. Even the ending has this 'huh, that's it?' sort of feel to it.",
            "I picked up <Sometimes Even Reality Is a Lie>, which I remember skipping over so many times in the past few years. Judged it solely on a basis on the crossdressing tag, which I often avoid, but yeah, I have to say it's the best manga I've read in a while. From now on a really solid goto when recommending romance manga to people. It reminds me a lot of Ookami Shounen wa Kyou mo Uso o Kasaneru, which I loved as well.",
            "[deleted]",
            "I am dropping Sun Ken-Rock, at least temporarily. The humor and serious tone just dont work together, just makes the whole thing seem odd. It's not that it's bad but things just don't fit. Realistic art mixed with ecchi and the classic big eyes and this time on women only, just gets freaky. \n\nSo far I haven't seen anything like showing the side of the police gaining awareness of the MC's group or something, that lacked. But mostly, the series should be a shounen. The demands and limitations of shounen would do very well for this series. The logics behind some fights happening are just so shounen... \n\nThe elements of this series just don't fit together.",
            "Noa-senpai wa Tomodachi manga like this one? Preferably longer or finished.",
            "Been on a romcom kick for a minute. Just finished up ‘Even if You Slit My Mouth’ and ‘I Belong to the Baddest Girl’ and I’m currently 5 chapters from the end of ‘Extremely Straightforward BF/GF’. All 3 have been absolute joys to read and are pretty short if anyone’s interested. Slit was the longest at around 80 chaps. and the other 2 are sub 40. Highly recommend if you enjoy the genre",
            "<I Am a Hero>\n\nThe ending was.... something. But overall, a good read.",
            "G and Ultra Heaven by Keiichi Koike. I really liked these longform manga by him. Though the differ in plot and setting, thematically and visually they are very similar. Loads of psychedelic imagery, overstuffed with detail pages, inventive panel layouts, repetitions with slight variations, and a hero on a quest to expand his mind. G was also full of what I believe to be Koike’s specialty - graphic match cuts and use of repetitive, almost trance-inducing, visual refrains.",
            "Does anyone have a good aggregator site to use?  Isekaiscan and now Mangakik have gone down and I don't have a good backup.",
            "Reread Love Me For Who I Am. It is honestly as good as I remembered. It's a surprisingly wholesome story about a crossdressing cafe that actually discusses many different types of people with basically 0 fanservice or fetishization. And, this is not a spoiler, the mc is canonically nonbinary ✨ ",
            "Boruto, TG & Usogui",
            "\n\n**Non Non Biyori** - ([AL](http://anilist.co/manga/47552), [A-P](https://www.anime-planet.com/manga/non-non-biyori), [KIT](https://kitsu.io/manga/non-non-biyori), [MU](https://www.mangaupdates.com/series.html?id=25706156623), [MAL](http://myanimelist.net/manga/17552))\n\n^(Manga | Status: Finished | Volumes: 16 | Chapters: 126 | Genres: Comedy, Slice of Life)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8xzmps/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Meisou Senshi Nagata Kabi: Gourmet de Go!** - ([AL](http://anilist.co/manga/134364), [A-P](https://www.anime-planet.com/manga/my-wandering-warrior-eating-disorder), [KIT](https://kitsu.io/manga/meisou-senshi-nagata-kabi-gourmet-de-go), [MU](https://www.mangaupdates.com/series.html?id=44973192779), [MAL](http://myanimelist.net/manga/133773))\n\n^(Manga | Status: Releasing | Genres: Slice of Life)\n\n**Sabishisugite Rezu Fuzoku ni Ikimashita Report** - ([AL](http://anilist.co/manga/87459), [A-P](https://www.anime-planet.com/manga/my-lesbian-experience-with-loneliness), [MU](https://www.mangaupdates.com/series.html?id=35878738529), [MAL](http://myanimelist.net/manga/99969))\n\n^(Manga | Status: Finished | Volumes: 1 | Chapters: 6 | Genres: Drama, Ecchi, Psychological, Slice of Life)\n\n**Genjitsu Touhi Shitetara Boroboro ni Natta Hanashi** - ([AL](http://anilist.co/manga/113168), [A-P](https://www.anime-planet.com/manga/my-alcoholic-escape-from-reality), [KIT](https://kitsu.io/manga/genjitsu-touhi-shitetara-boroboro-ni-natta-hanashi), [MU](https://www.mangaupdates.com/series.html?id=75353262580), [MAL](http://myanimelist.net/manga/122691))\n\n^(Manga | Status: Finished | Volumes: 1 | Chapters: 13 | Genres: Drama, Psychological, Slice of Life)\n\n**Skeleton Double** - ([AL](http://anilist.co/manga/154047), [A-P](https://www.anime-planet.com/manga/skeleton-double), [KIT](https://kitsu.io/manga/skeleton-double), [MU](https://www.mangaupdates.com/series.html?id=7353861737), [MAL](http://myanimelist.net/manga/150912))\n\n^(Manga | Status: Finished | Volumes: 5 | Chapters: 39 | Genres: Drama, Mystery, Supernatural)\n\n**Daddy de Buddy** - ([AL](http://anilist.co/manga/169537), [A-P](https://www.anime-planet.com/manga/daddy-and-buddy), [KIT](https://kitsu.io/manga/daddy-de-buddy), [MU](https://www.mangaupdates.com/series.html?id=13521446839), [MAL](http://myanimelist.net/manga/162936))\n\n^(Manga | Status: Finished | Volumes: 3 | Chapters: 20 | Genres: Action, Comedy, Supernatural)\n\n**Dear Anemone** - ([AL](http://anilist.co/manga/174545), [A-P](https://www.anime-planet.com/manga/dear-anemone), [KIT](https://kitsu.io/manga/dear-anemone), [MU](https://www.mangaupdates.com/series.html?id=48142219058), [MAL](http://myanimelist.net/manga/167424))\n\n^(Manga | Status: Releasing | Volumes: 3 | Chapters: 17 | Genres: Horror, Supernatural, Thriller)\n\n**Jigokuraku** - ([AL](http://anilist.co/manga/100994), [A-P](https://www.anime-planet.com/manga/hells-paradise-jigokuraku), [KIT](https://kitsu.io/manga/jigoku-raku), [MU](https://www.mangaupdates.com/series.html?id=10294535868), [MAL](http://myanimelist.net/manga/112318))\n\n^(Manga | Status: Finished | Volumes: 13 | Chapters: 127 | Genres: Action, Adventure, Mystery, Supernatural)\n\n**Futari no Lion** - ([AL](http://anilist.co/manga/109791), [A-P](https://www.anime-planet.com/manga/the-two-lions), [KIT](https://kitsu.io/manga/futari-no-lion), [MU](https://www.mangaupdates.com/series.html?id=70220499763), [MAL](http://myanimelist.net/manga/114065))\n\n^(Manga | Status: Finished | Volumes: 1 | Chapters: 8 | Genres: Romance, Slice of Life)\n\n**Ore no Imouto ga Konna ni Kawaii Wake ga Nai Comic Anthology** - ([AL](http://anilist.co/manga/82131), [A-P](https://www.anime-planet.com/manga/oreimo-comic-anthology), [KIT](https://kitsu.io/manga/ore-no-imouto-ga-konnani-kawaii-wake-ga-nai-comic-anthology), [MAL](http://myanimelist.net/manga/52131))\n\n^(Manga | Status: Finished | Volumes: 1 | Chapters: 13 | Genres: Comedy, Drama, Romance)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8zhr0d/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Bokura no Kiseki** - ([AL](http://anilist.co/manga/46686), [A-P](https://www.anime-planet.com/manga/bokura-no-kiseki), [KIT](https://kitsu.io/manga/bokura-no-kiseki), [MU](https://www.mangaupdates.com/series.html?id=35568446396), [MAL](http://myanimelist.net/manga/16686))\n\n^(Manga | Status: Releasing | Genres: Fantasy, Mystery)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8y1xv8/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Kusuriya no Hitorigoto** - ([AL](http://anilist.co/manga/99022), [A-P](https://www.anime-planet.com/manga/the-apothecary-diaries), [KIT](https://kitsu.io/manga/kusuriya-no-hitorigoto-manga), [MU](https://www.mangaupdates.com/series.html?id=15124812002), [MAL](http://myanimelist.net/manga/107562))\n\n^(Manga | Status: Releasing | Genres: Drama, Mystery)\n\n**Blue Lock** - ([AL](http://anilist.co/manga/106130), [A-P](https://www.anime-planet.com/manga/blue-lock), [KIT](https://kitsu.io/manga/blue-lock), [MU](https://www.mangaupdates.com/series.html?id=42866050067), [MAL](http://myanimelist.net/manga/114745))\n\n^(Manga | Status: Releasing | Genres: Action, Drama, Sports)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8y3iha/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Kaijuu 8-gou** - ([AL](http://anilist.co/manga/120760), [A-P](https://www.anime-planet.com/manga/kaiju-no-8), [KIT](https://kitsu.io/manga/kaijuu-8-gou), [MU](https://www.mangaupdates.com/series.html?id=19101650311), [MAL](http://myanimelist.net/manga/127907))\n\n^(Manga | Status: Releasing | Genres: Action, Sci-Fi)\n\n**SPY×FAMILY** - ([AL](http://anilist.co/manga/108556), [A-P](https://www.anime-planet.com/manga/spy-x-family), [KIT](https://kitsu.io/manga/spy-x-family), [MU](https://www.mangaupdates.com/series.html?id=67814124606), [MAL](http://myanimelist.net/manga/119161))\n\n^(Manga | Status: Releasing | Genres: Action, Comedy, Slice of Life, Supernatural)\n\n**Hoshi no Ko** - ([AL](http://anilist.co/manga/112876), [A-P](https://www.anime-planet.com/manga/oshi-no-ko), [MU](https://www.mangaupdates.com/series.html?id=59800246010), [MAL](http://myanimelist.net/manga/88368))\n\n^(Manga | Status: Finished | Volumes: 1 | Chapters: 7 | Genres: Romance, Slice of Life)\n\n**Kuroneko to Majo no Kyoushitsu** - ([AL](http://anilist.co/manga/146181), [A-P](https://www.anime-planet.com/manga/the-classroom-of-a-black-cat-and-a-witch), [KIT](https://kitsu.io/manga/kuroneko-to-majo-no-kyoushitsu), [MU](https://www.mangaupdates.com/series.html?id=74599978927), [MAL](http://myanimelist.net/manga/144829))\n\n^(Manga | Status: Releasing | Genres: Fantasy)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l90m0tb/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "[https://mydadistoostrong.com/](https://mydadistoostrong.com/)",
            "\n\n**Rough** - ([AL](http://anilist.co/manga/31184), [A-P](https://www.anime-planet.com/manga/rough), [KIT](https://kitsu.io/manga/rough), [MU](https://www.mangaupdates.com/series.html?id=46124862627), [MAL](http://myanimelist.net/manga/1184))\n\n^(Manga | Status: Finished | Volumes: 12 | Chapters: 119 | Genres: Comedy, Drama, Romance, Sports)\n\n**Koroshiya 1** - ([AL](http://anilist.co/manga/30932), [A-P](https://www.anime-planet.com/manga/ichi-the-killer), [KIT](https://kitsu.io/manga/ichi-the-killer), [MU](https://www.mangaupdates.com/series.html?id=11324625176), [MAL](http://myanimelist.net/manga/932))\n\n^(Manga | Status: Finished | Volumes: 10 | Chapters: 113 | Genres: Action, Psychological)\n\n**Adam to Eve** - ([AL](http://anilist.co/manga/96124), [A-P](https://www.anime-planet.com/manga/adam-to-eve), [KIT](https://kitsu.io/manga/adam-to-eve), [MU](https://www.mangaupdates.com/series.html?id=25303178373), [MAL](http://myanimelist.net/manga/93432))\n\n^(Manga | Status: Finished | Volumes: 2 | Chapters: 15 | Genres: Action, Drama, Supernatural)\n\n**Korisenman** - ([AL](http://anilist.co/manga/105184), [A-P](https://www.anime-planet.com/manga/the-fox-and-the-little-tanuki), [MU](https://www.mangaupdates.com/series.html?id=32716580982), [MAL](http://myanimelist.net/manga/125546))\n\n^(Manga | Status: Finished | Volumes: 7 | Chapters: 48 | Genres: Comedy, Fantasy, Slice of Life)\n\n**Futari wa Daitai Konna Kanji** - ([AL](http://anilist.co/manga/114475), [A-P](https://www.anime-planet.com/manga/the-two-of-them-are-pretty-much-like-this), [KIT](https://kitsu.io/manga/futari-wa-daitai-konna-kanji), [MU](https://www.mangaupdates.com/series.html?id=53555862870), [MAL](http://myanimelist.net/manga/126932))\n\n^(Manga | Status: Finished | Volumes: 4 | Chapters: 104 | Genres: Comedy, Romance, Slice of Life)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8yoa7x/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**BEAT&MOTION** - ([AL](http://anilist.co/manga/160880), [A-P](https://www.anime-planet.com/manga/beat-and-motion), [KIT](https://kitsu.io/manga/beat-motion), [MU](https://www.mangaupdates.com/series.html?id=62236200826), [MAL](http://myanimelist.net/manga/156308))\n\n^(Manga | Status: Releasing | Genres: Drama, Music, Romance)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8yreak/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Kami-sama ga Machigaeru** - ([AL](http://anilist.co/manga/139700), [A-P](https://www.anime-planet.com/manga/god-bless-the-mistaken), [MU](https://www.mangaupdates.com/series.html?id=883188750), [MAL](http://myanimelist.net/manga/140671))\n\n^(Manga | Status: Finished | Volumes: 4 | Chapters: 22 | Genres: Comedy, Sci-Fi, Slice of Life)\n\n**Bocchi the Rock!** - ([AL](http://anilist.co/manga/111258), [A-P](https://www.anime-planet.com/manga/bocchi-the-rock), [KIT](https://kitsu.io/manga/bocchi-the-rock), [MU](https://www.mangaupdates.com/series.html?id=31629433150), [MAL](http://myanimelist.net/manga/118568))\n\n^(Manga | Status: Releasing | Genres: Comedy, Music, Slice of Life)\n\n**Ichido dake demo, Koukai Shitemasu.** - ([AL](http://anilist.co/manga/110530), [A-P](https://www.anime-planet.com/manga/i-cant-believe-i-slept-with-you), [KIT](https://kitsu.io/manga/ichido-dake-demo-koukai-shitemasu), [MU](https://www.mangaupdates.com/series.html?id=9548015456), [MAL](http://myanimelist.net/manga/120716))\n\n^(Manga | Status: Finished | Volumes: 3 | Chapters: 20 | Genres: Comedy, Romance, Slice of Life)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8ywbho/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Yofukashi no Uta** - ([AL](http://anilist.co/manga/111233), [A-P](https://www.anime-planet.com/manga/call-of-the-night), [KIT](https://kitsu.io/manga/yofukashi-no-uta), [MU](https://www.mangaupdates.com/series.html?id=57601415104), [MAL](http://myanimelist.net/manga/121480))\n\n^(Manga | Status: Finished | Volumes: 20 | Chapters: 200 | Genres: Comedy, Psychological, Romance, Slice of Life, Supernatural)\n\n**Owari no Seraph** - ([AL](http://anilist.co/manga/73661), [A-P](https://www.anime-planet.com/manga/seraph-of-the-end), [KIT](https://kitsu.io/manga/owari-no-seraph-m), [MU](https://www.mangaupdates.com/series.html?id=60210408032), [MAL](http://myanimelist.net/manga/43661))\n\n^(Manga | Status: Releasing | Genres: Action, Drama, Mystery, Supernatural)\n\n**Suzuka** - ([AL](http://anilist.co/manga/30430), [A-P](https://www.anime-planet.com/manga/suzuka), [KIT](https://kitsu.io/manga/suzuka), [MU](https://www.mangaupdates.com/series.html?id=7005558556), [MAL](http://myanimelist.net/manga/430))\n\n^(Manga | Status: Finished | Volumes: 18 | Chapters: 166 | Genres: Comedy, Drama, Ecchi, Romance, Sports)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8yzdnu/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Bakuman.** - ([AL](http://anilist.co/manga/39711), [A-P](https://www.anime-planet.com/manga/bakuman), [KIT](https://kitsu.io/manga/bakuman), [MU](https://www.mangaupdates.com/series.html?id=34780720357), [MAL](http://myanimelist.net/manga/9711))\n\n^(Manga | Status: Finished | Volumes: 20 | Chapters: 176 | Genres: Comedy, Drama, Romance, Slice of Life)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l8zbu5b/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "\n\n**Real mo Tama ni wa Uso wo Tsuku** - ([AL](http://anilist.co/manga/113076), [A-P](https://www.anime-planet.com/manga/sometimes-even-reality-is-a-lie), [KIT](https://kitsu.io/manga/riaru-mo-tama-wa-uso-wo-tsuku), [MU](https://www.mangaupdates.com/series.html?id=39755015301), [MAL](http://myanimelist.net/manga/124209))\n\n^(Manga | Status: Releasing | Genres: Comedy, Romance, Slice of Life)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l967cnn/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)",
            "You would watch the anime instead even if the anime is an incomplete adaptation?",
            "I don't know what it's \"rival a manhwa\". \n\nSince you mentioned Ajin, a manga recommended in mal's recommend section for Ajin is Fire Punch, I haven't watched or read Ajin but I read Fire Punch.",
            "\n\n**I Am a Hero** - ([AL](http://anilist.co/manga/44440), [A-P](https://www.anime-planet.com/manga/i-am-a-hero), [KIT](https://kitsu.io/manga/i-am-a-hero), [MU](https://www.mangaupdates.com/series.html?id=50892522580), [MAL](http://myanimelist.net/manga/14440))\n\n^(Manga | Status: Finished | Volumes: 22 | Chapters: 265 | Genres: Action, Horror, Psychological)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/l9ei2u3/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)"
        ]
    },
    "[DISC] Even a Cat's Paw can be Useful (Nekotete) - Chapter 198": {
        "title": "[DISC] Even a Cat's Paw can be Useful (Nekotete) - Chapter 198",
        "score": 429,
        "url": "https://i.redd.it/owzrz4a7938d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Maybe he gave the ability away to some poor cat he saw on the side of the street and felt sorry for.\n\nIt's a power he didn't ask for anyways, and he wasn't getting acclimated to, or interested in, being human anyways.\n\nMaybe this ties in to why fmc's dad gave his power away?",
            "Owner: Out of the way, I'll take care of this.\n\nOwner: *Opens eyes*\n\nOwner: Alright, I'm out of ideas.",
            "Now he really only has one single orange brain cell.",
            "And this is how our resident catboy becomes a regular (orange) catcat.",
            "This series feels a bit dark now. And also a bit random. Not sure what I’m supposed to think or expect.",
            "He didn't even flinch much to the owner's open eyes and just stare blankly.\n\nMaybe he's already satisfied and doesn't want to get revenge anymore because he met good people and made the ability disappear from him 🤔",
            "I am betting something happened to the person who gave him his powers?",
            "I really hate that this isn't being uploaded to MD or any scan site anymore. I'm just not on reddit enough to follow the consistent releases here",
            "Or maybe it was always a time limited transformation?",
            "He had been trying to learn to human though, seems like it just expired",
            "Owner should have tried an optic blast smh.",
            "Don't hate. Our sole uploader to MD has been very sick and overworked IRL. Don't say \"anymore\" as if it's permanent. I know readers on MD have been waiting for 3 days worth of updates which is why I created a Mangadex account even though I don't use MD. I didn't want to see MD readers coming to reddit/discord to... complain. \n\nI've uploaded chapters onto MD before this but since it's a new account, the chapters need to be approved by MD moderators (takes 1-2 days) instead of showing up right after uploading.",
            "That seems like the most boring conclusion tbh.",
            "My bad then, due to a tachi extension mixup I wasn't aware there had been any uploads to MD since assscans also stopped uploading to their site back in april.  This isn't the first time I've complained on the reddit thread, I never saw any MD link in the comment either anytime I checked reddit by chance. \n\n\nEdit: hope your uploader gets well soon btw",
            "Maybe it’s like a motivational thing, like if you stop wanting to be human you just lose the power.",
            "No problem, I hope I wasn’t too harsh. The previous uploader is still very busy so I’ve now taken over uploading on MD too. Once my account is vetted, daily chaps will be on there. We’re near another NOBEL hiatus though!",
            "Cat man 2. Wait for Cat man 3 where bully tigger appears as a character that will be memed for years to come",
            ">We’re near another NOBEL hiatus though!\n\n\n Lucky me who has 50+ chapters if catching up to do"
        ]
    },
    "[DISC] Day labor dungeon of alcohol and cigarettes - Ch 1": {
        "title": "[DISC] Day labor dungeon of alcohol and cigarettes - Ch 1",
        "score": 422,
        "url": "https://www.reddit.com/gallery/1dlpkgl",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Panty and Stocking, fantasy edition. \n\nAnd I am *all about this series*.",
            "That guy is probably expecting to be involved, when it will probably just end up in Yuri. \n\nOr them breaking the door.",
            "[Mangadex](https://mangadex.org/chapter/dd4e3fbb-0762-4d3a-827e-7b52092496d0)\n\nSynopsis\n> The story follows a pair of adventurers: one who is an alcoholic and one who is a heavy smoker. The two enter ancient dungeons to embark on bounty hunting and house-hunting. -ANN",
            "Lucky guy.\n\nWell, I have the feeling they gonna go scissors and left the poor man out.",
            "those thighs could kill a trex",
            "I wonder what other kind of bad habbits this manga will show us next. Illicit sexual relashionships? Unhealthy diet? Drug abuse? Forgetting to take out laundry from the washing machine? Keeping too many tabs open in your browser?",
            "Slightly a stretch but from a big Dark and Darker game fan this has fun parallels.",
            "Well they look adorable. And they also look like they could kick my ass. Double points",
            "Eh pointless cliffhanger, either say gex and I leave or threesome and I stay.",
            "Or... There's a third *hidden* option",
            "Look at the guy.\n\nIf the author wanted him to be involved, he wouldn't be designed like that.",
            "Or they just nut from drinking and smoking somehow and it works ?",
            "Or the octopus familiar gets involved.",
            "The author better not be a chicken and gives us a threesome.",
            "Which one pegs him first?",
            "Both of the onee-san are traps, and it suddenly becomes yaoi? ( ͡° ͜ʖ ͡°)",
            "He's the dungeon boss shapeshifted.  \nWhy have a Room that doesn't open unless they have sex if you can't use it with hot adventurers?",
            "As long as they dont regret their choice and retcon the entire premise 4 chapters later just to draw a threesome… ahem.",
            "I'm sorry. Rosen Garten is that way",
            "Are you making a reference? Don't get it.",
            "\"I like you who can have sex with anyone.\"  \n  \nThe premise is the virgin MMC likes a very, very sexually adventurous girl, and not only is does he have a massive thundercock but he's able to keep step with her libido. She is starting to catch actual feelings and doesn't like it.\n\nIts a very gonzo near parody of romcoms at this point. The FMC deals with this concern by trying to get the MMC to hook up with another girl so she won't feel monogamous urges. He's against it because he only loves the FMC (even if his boner springs up at a gentle breeze) but she gets her half sister gets involved.  \nIn the original run, he only hooks up the FMC and there's the fall out of that with some brewing NTR shite.\n\nThis was the will of someone else, Mangaka kicks back demands to be allowed to draw a threesome. So he retcons the arc and re-leases the chapters where now MMC fucks FMC and her sister. The main issue is that post-threesome the whole \"I only want to sex with the FMC\" plot by the MMC doesn't exactly work as well. And then Mangaka introduced childhood friends for both FMC and MMC that they have mutually better chemistry with.... so who the hell knows what's up.\n\nto tl;dr:   \n\"Did you get a threesome with a cute girl and her half sister?\"  \n\"Yes\"  \n\"What did it cost?\"  \n\"Everything related to the plot and character development up to this point\""
        ]
    },
    "[DISC] A Cool Girl and a 12cm Promise - Ch. 16": {
        "title": "[DISC] A Cool Girl and a 12cm Promise - Ch. 16",
        "score": 1009,
        "url": "https://mangadex.org/chapter/581aab1d-8ba1-4709-85e1-4e74e7f02b4d",
        "content": "",
        "num_comments": 26,
        "comments": [
            "The release schedule of this has be checking back constantly lmao. Don’t tire yourself out",
            "Thanks random friend with way too much life experience for the lesson",
            "[Mangadex link](https://mangadex.org/chapter/581aab1d-8ba1-4709-85e1-4e74e7f02b4d)  \n  \n> Tomo doesn't see gender.  \n  \nYes, Taka knows that Tomo is not dense in THAT way, just kind of lost considering he needed to grow up early after his sisters were born in order to take care of them, that's why he's always attentive with Ibuki when something's odd, like in Chapter 9 when Ibuki had had her period.  \nHe just need to sort out those feelings he has with her and come up with a definite answer.",
            "See? Ibuki, when assertive, can frazzle him and get him to blush. She just has to be nonchalant about it. He likes her. He just doesn't understand why or how yet, but he does.",
            "God bless our wingmen o7\n\n[](//#grateful)",
            "Shes so cute ",
            "So hes closer than we thought. He just doesn’t understand what to call that feeling, but hes clearly super into Ibuki",
            "While not as direct as Kuma, Taka's wingmanning has advice that can be applied even outside of sorting out one's feelings for someone. Man's got all those stats in wisdom.\n\n\nAnd this is also a good development, cause Tomo's actually actively trying to work out his emotions, and has an understandable reason for being \"dense\" compared to other so-called dense protagonist.",
            "Ahh a perfect pickmeup to go with my breakfast!",
            "Well this guy better figure out his feelings fast or he's gonna have a worse case of Head Pigeons than the FMC from Hiyokoi.",
            "I'm so glad his friends are letting him figure it out on his own instead of outright telling him and then having the feelings sprout. It always rubbed me the wrong way when characters did that in Heisei",
            "Oh hell yeah! I remember this series when it was just a webcomic on dex\n\nI had no idea it was actually serialized \n\nDamn, thanks for posting this",
            "I quite like this series but this kind of development, a kind of protagonist so dense that they come off as a robot trying to process human emotion, is far from my fav. I think it’s a bit beneath this manga which overall has mostly avoided cliches",
            "I love it. The series is pretty great so far. They shouldn't tire themselves out tho.",
            "Who needs sleep when one has sugar?\n\n(This is not good medical advice, please rest properly).",
            "Seriously where was this kid when we were all 14-16? Jesus. It's a great trope done right though.",
            "That's an aspiring novelist right there!",
            "Reminds me of one Harry Potter fanfiction, when characters went through something traumatic and someone suggested therapy one character (muggleborn) was like, well of course I'm in therapy already, you're not? 'You find out you're practically different species and that you will outlive everyone you know and love by like, a hundred years, and your parents don't think you need some help with that?'. Everyone went 'oh so that's why you're so thoughtful and well-adjusted even though you're 11!'.",
            "Always love that guy",
            "I think that's a good chunk of it, but also, he's never been interested in other girls at all. He's had to deal with his sisters, and he really only hangs out with Ibuki, which is the only girl he's close friends with. I don't think the thought ever occurred to him. She's not a sister to him. He knows that, but they're more than friends. This was an important chapter despite not having a lot happening.",
            "Chibi version stay on top.",
            "In the corner and only speaking up when someone talks to them, I imagine.",
            "he also has a lot of feminine traits for a guy and he doesnt seem to have anxiety over that or like he has internal pressure to be more masculine. he seems pretty happy to just be the way he is",
            "Of course I know him, he’s me",
            "I don't think it's necessarily that. I think that he's just used to being around his sisters, so I guess he's just more considerate and understanding. I have 3 sisters, so I was the same way."
        ]
    },
    "Source?": {
        "title": "Source?",
        "score": 601,
        "url": "https://i.redd.it/8bzdsjvu118d1.jpeg",
        "content": "",
        "num_comments": 68,
        "comments": [
            "Boy's abyss\n\nYou're better off not reading that.",
            "[deleted]",
            "Boy's abyss.\n\nPlease don't read it. At this point I'm in it for the sunk cost fallacy.",
            "She is beautiful. Why is the artstyle so familiar\n\n>Sees the sauce in the comment\n\nOh... That manga. It all makes sense now",
            "A dark, dark place.\n\nBoy's Abyss.",
            "It's boys' abyss",
            "Boys abyss. Used to be really good but about half way through its just misery for the sake of misery instead for a story",
            "OP look, I love how messy and fucked up the story is and know many hate on it for their reasons which is valid, but if you want you can read it and make up your own mind. There are many manga, shows, movies, etc. I liked which people hated and I'm glad I didn't listen to them.\n\nAlso it's pretty fast paced so it won't take long to read. \n\nJust don't let other people dictate how you should feel about something you haven't experienced yourself, that's all.",
            "artstyles are amazing, imagine having a style so recognizable your fanbase hates everything you produce whilst at the same time knows it by heart",
            "The source is Boy's abyss.\n\nAn edgy manga that wants to shock you and be taken seriously so hard that it goes full circle to become a clown parade. An absolutely hilarious read of you like involuntary comedies",
            "Boys Abyss, not for the faint hearted. It is fucked up most of the time.",
            "\nBased on the title of your post, it appears you're looking for a forgotten series. **When you find the series** you are looking for, it would be appreciated if you added the title of the series as a Flair by leaving a comment that says `solved = series name here`. That way others will know that the answer has been found. This also allows others that have become interested based off your description to try the series for themselves. Do please avoid adding additional formatting to your solved comment though as I read based off the source of your comment rather than like a human being. \n\nIf you're looking for a hentai/pornhwa, please take the request to /r/HentaiSource as this subreddit does not allow porn series as top-level posts. If you suspect it may be, please try /r/HentaiSource instead of gambling here.\n\nThanks for taking the time to read this.\n\n[](//moelord3k)\n\nIf this comment has appeared for a post not asking for identification of a series, please report this post and Aruseus493 will be around shortly to adjust my filter. \n\nMoelord3k was brought to you today by the keyword/phrase \"Source?\" in /u/Puzzled_Jackfruit621's title.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/manga) if you have any questions or concerns.*",
            "Another one",
            "Don't",
            "That's hell you're walking into.",
            "No don't. Save yourself",
            "Comedy story",
            "There is no sauce, go to church",
            "boys abyss good read to past the time",
            "Nah-nah, it's a great unintended comedy up to a point.",
            "Boy's Abyss is what people on Twitter think Oshi no Ko is.",
            "Yeah, guessed that, whenever I see a type of Manga girl I like, it's mostly dark stuff for some reason...",
            "Why?",
            "What’s the character in the picture?",
            "this chako after",
            "Boy's Abyss AKA Rosen Garten Saga except the degeneracy is just cringe and not funny.",
            "Is it still ongoing? I stopped on the backhround story of her mother lmao",
            "It's still ongoing lol?",
            "I stoped when translations died down at around chapter 90\n\nHow is it still going ??? I thought it was close to the end so I decided to read once its finished translating but aparently its still going??????",
            "To be honest I'm still reading to see how it would end and I know the story is convoluted as hell to the point it tried to be serious but turned into a comedy. But I still enjoyed a trainwreck that I've been reading since 2021",
            "I found this manga randomly and it always surprises me how much people hate on it when I see it mentioned here. Of course it's dramatic but so are lots of other manga. It's like a much less refined version of pun pun. Bit bored with the current part going on but I liked the rest.",
            "I love Boy's abyss, is fucking hilarious",
            "also if you don't like it might i interest you with blood on the tracks",
            "can you elaborate?",
            "Every single character, without exception, belongs to a mental institution. That is the entire plot.",
            "One of the most \"\"\"normal\"\"\" characters is a yandere teacher who popped the MC's cherry, stalks him despite a restraining order, kidnaps the love rival, I think tried to blackmail MC's mother into selling him to her? 10/10 the best yandere I've ever seen\n\nIf this sounds like a trashy romcom then remember, this series takes itself seriously as a psychological drama",
            "Her name is Chako. \n\nShe looks completely different in the first few chapters btw.",
            "w8 this ie chako ? not the teacher?",
            "God RSG is so peak",
            "Yes though it feels like it's probably in it's endgame",
            "5 chapters before ending, apparently",
            "Yeah. I think it's in the final arc though...\n\nUnless they decide more suffering is needed.",
            "It's on chapter 180 lol.\n\nYou're gonna have to wait a bit to binge. Looks like it's in its final arc but from past experiences with this manga it could end in 10 chapters or a hundred more.",
            "It's supposed to be this super dark story, but it's so packed with outrageous plot twists delivered for more drama that it circles around to being funny. It's like a soap opera, everyone is someone else's secret something, has a dark crime in the past, has an unrequited forbidden passion, and a dozen other things at once.",
            "Its misery porn. Thats it. Thats all there is to it. The abyss in the name is the abyss of misery, which is the mc(boy) himself. The general arc goes like this, character meets misery man aka mc, falls in his misery, life is destroyed, done. No happy ends for anyone. Ever. At start, it seems like the story will eventually get somewhere but it just doesn’t.\n\nSo like, at some point, you just gotta laugh at the ridiculousness.\n\nAnd as the other guy said, best stay away from this, it got me weirdly anxious while reading it, i kinda just dropped and never looked back. 100% would not recommend to a depressed person",
            "True. Its one of the best depiction of yandere like a real yandere unlike a romcom yandere",
            ">One of the most \"\"\"normal\"\"\" characters is a yandere teacher\n\nEasily my favorite character in that story mainly because every time she goes yandere mode you know some funny stuff is going to happen and is one of the few people who constantly push the plot forward.\n\n\n\n>this series takes itself seriously as a psychological drama\n\nThat's the absolute best part of that manga, the fact that not only it lacks anything resembling self awareness but it also takes itself so seriously that I'm physically incapable of reciprocating that seriousness and instead enjoy the ride as a really funny involuntary comedy.",
            "Thin Chako yeah.",
            ">but it's so packed with outrageous plot twists\n\nMc's mother's backstory where >!her boyfriend sees the middle aged man come out of her house!< was the final straw for me even though we could see it coming from a mile away. I was very calm at that moment because I knew I was done with this manga and won't look at it again.",
            "for real, friend recommend it for the fucked up ness but a lot of the scenes were so absurd it was hilarious. that said i dont even remember where i stopped reading.\n\nshould look it up.",
            "it has \"peak\" around certain chapter but afterward it just dragging out just for unintentionally comedy",
            "\"wE caNT eScAPe tHiS cUrSEd tOwN\"",
            "When I was reading it, that's what I was thinking too. Why do every chapter needs to end with a twist? After a while, it just became too ridiculous for me to take it seriously.",
            "Reason why i stopped reading it. It was good until the gay admition part but it went downhill after",
            "damn I always mistook her with the teacher",
            "It's not even that that specific thing would be unbelievable, dark as it was. It's that it happens in the same story in which >!the teenage MC had sex with *two* different adult women just in the first five chapters, Yandere Pedo Teacher is a main plot driver, his best friend actually murdered his dad and may be gay for him, his other best friend tried to seduce this old novelist dude who was actually his mother's sweetheart when she was a teen prostitute,!< and a bunch of other incredibly contrived connections and over the top dramatic occurrences that make the whole thing feel like some kind of misery harem.",
            "Generally, when a story wants to characterized a location the story would take the time to make you familiarize with the place, it would have something unique, a particular architecture, some traditions, anything to make that place stand out. That's why it cracks me up how much the double down on the town being evil and shit but then the location itself is so generic that it doesn't even has interesting locations, even the suicide river a lot of characters wax poetic about looks generic",
            "Plus the entire time it feels like >!his mother wants to fuck him at any given moment.!<\n\nYeah, I'm amazed at myself for reading 94 chapters, 2021 me was a different person.",
            "WTF\n\nSo happy i felt pretty early in the story that it would be trash and stopped reading it!",
            "Also the >!the best friend murdering the step dad under order of the mom is because he has gender dysphoria with him idolizing the mom's beauty and popularity (because she's been the town bycicle since highschool), and later attempt to rape and force mc's childhood friend (that also has a crush on him) to marry him because if he can't get mc's dick, noone can. Then the three of them goes to Tokyo together anyway!<",
            "To be fair, isn't it all of this because of some type of curse in the city? But then this curse is never elaborated too.",
            "Yeah, felt like the mother was hinted to want to fuck him but then it turned out to be a bait and switch either because they decided it was a step too far or maybe they just forgot it. It's like the plot has ADHD, all that matters is that each chapter ends on a SHOCKING CLIFFHANGER, and who cares if it makes no sense. Plot threads get abandoned or forgotten all the time. Reminds me of another (now mercifully axed) manga that while being not quite as edgy had the same issue, \"The Ichinose Family's Deadly Sins\". After a while you didn't even know WTF was going on any more.",
            "The part where >!he's just tried to rape her and then they just all merrily chat away about running to Tokyo with him *still on top of her* is so fucking surreal. Top comedy.!<",
            "Is this a literal thing in-universe? It really mostly feels like a fan theory.\n\nEven then, Junji Ito wrote \"Uzumaki\" about a town cursed by eldritch forces and turns out you can actually execute on that concept much better than this shit.",
            "It's a curse, a real one, as in real life, not fantasy magic curse curse. Back in the emo days and a lot of music still, they sing about how they're gonna leave this town and never come back but never manage to take a step outside. The curse is generational poverty and abuse that just repeats over and over with each generation.",
            "Then >!when they make it to Tokyo the girl just fades into the darkness and disappears like a a character with superpowers.!< Impossible not to laugh.",
            "> Is this a literal thing in-universe? It really mostly feels like a fan theory.\n\nIt is \"a thing\" but not literal, but something the characters talk about sometimes. Nothing confirmed though.",
            "Poverty begets poverty, and trauma is spread through the generations."
        ]
    }
}