{
    "Weekend Free Talk and Index Thread - New and fresh every Friday!": {
        "title": "Weekend Free Talk and Index Thread - New and fresh every Friday!",
        "score": 29,
        "url": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1dl5q9k/weekend_free_talk_and_index_thread_new_and_fresh/",
        "content": "[](https://i.imgur.com/eKZXttG.jpg)\n\nWelcome to the Weekend Free Talk and Index thread!\n\nYou can post whatever you want here - unsubstantiated rumors you heard, fan theories, random shower thoughts, or even musings that are unrelated to the Marvel universe.\n\nAnything goes - please just follow the [Reddiquette](https://www.reddithelp.com/en/categories/reddit-101/reddit-basics/reddiquette) and **above all else treat each other and those that contribute to this subreddit with respect.**\n\nPotential points of interest:\n\n* [X-Men '97 - Official Discussion Index](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1cehvri/index_xmen_97_season_1_discussion_thread_index/)\n* [Echo - Official Discussion Index](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1925et0/index_echo_discussion_thread_index/)\n* [Madame Web - Official Discussion Megathread](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1aqa31x/worldwide_release_madame_web_official_discussion/)\n* [Previous Movie Megathreads and TV Show Discussion Indexes](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie-megathreads-and-show-indexes)\n* [MSS MCU Project Ratings](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie_tiers) (VOTED BY YOU!) - Make sure to vote during our project rewatches as well as in the new release megathreads.\n* [Archive of Stickied Posts](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/sticky-archive)\n* [Sub Wiki - Rules of the road](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/)\n* [Source Accuracy Tiers](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers) \\- Not sure what sources people consider trustworthy? Start here! (Note: This list changes and is not infallible - use this as a general guide only)\n* [Source Accuracy Database](https://docs.google.com/spreadsheets/d/1RpGBi4duCDeiXUtSh_1x15VJ67vPRZ1LWu6A3ieGTjs/edit?usp=sharing) \\- Our database designed to catalog scoops and provide accountability",
        "num_comments": 395,
        "comments": [
            "[Benedict Cumberbatch confirms that he will film an ‘AVENGERS’ movie next year.](https://x.com/NexusPointNews/status/1804176315735548269?t=k_u3Yk_xeANOtsk5eEqwXg&s=19)",
            "2024 is probably going to be the best year for superhero animation *ever*. \n\n*Invincible* season 2, *X-Men ‘97*, *My Adventures with Superman* season 2, *Suicide Squad Isekai*, *Batman: Caped Crusader*, *Creature Commandos*, *Eyes of Wakanda* and possibly even *Friendly Neighborhood Spider-Man* as well.",
            "[Don’t fuel my “Giancarlo is playing Paladin” theory anymore, the gods are pointing at it](https://x.com/classicmarvel_/status/1804188381376553066?s=46&t=zYcgLaa5LZGq3IgzlBR_wg)",
            "I feel like Avengers 5 is going to be a lot like Infinity War with everything going on. Sam will probably have his earth based team set up at that point (no I do not believe that Alex Perez tweet about Wong coming in to recruit Sam considering it was pretty clear in hindsight that AtlantaFilming was just speculating because Benedict was in Atlanta at the time), with Strange being confirmed his side is coming in as well, Wong has his team with Shang-Chi, Katy, Hulk and Carol.",
            "This might sound weird, but I feel like X-Men ‘97 portrayed Magento too favorably. Done get me wrong, it’s a good portrayal, because a lot of people haven’t watched the original series or read the comics, they’re  forgetting that this man openly calls for genocide on people he deems genetically inferior. He is in no ways a good guy. He’s Hitler if Hitler was created by Hitler and used that as a justification for his genocide. \n\nThe worst thing he does in ‘97 (disabling the power grid) is almost danced over. They don’t deal with the fact that he almost certainly killed millions of innocent people. Every car in the world crashed; every plane fell out of the sky; everybody on life support immediately flatlined; and they just ignore it. So people spout unironically “Magento was right” as if he isn’t completely insane.",
            "Reading Claremont/Cockrum's Uncanny X-Men run for the first time (really loving it). I'm surprised how much I like Banshee. He's the team's glass cannon: easy to take out in a fight, but his sonic blasts have more raw force than any other power on the team (until Phoenix appears).\n\nBanshee also acts as an older, world-weary rogue with a heart-of-gold: unafraid to call out Xavier/Cyclops' bullshit, but willing to die for his friends. This is normally Wolverine's role, but right now he's a trigger-happy psycho everyone hates. I'm guessing Banshee will eventually be written out of the book so Wolverine can grow into his role.\n\nI waffle a lot about wishcasting the MCU X-Men. But I wouldn't be disappointed if they just copied the Uncanny team: Cyclops, Storm, Colossus, Nightcrawler, Banshee, and Wolverine. Really fun dynamic.",
            "I’m sad about Blade no longer being set in the 1920’s. Aside from being a cool aesthetic alongside the alternate universe 60’s of the F4, since seeing the flashback in Eternals, I’ve been very intrigued by the past of the MCU. \n\nHaving Blade set in the 1920’s gave me the impression that they not only set up stuff for the future moving forward but also are building the historical past of the universe.\n\nIt would’ve been cool to see an Eternal or 2 pop up in Blade, a crossover happening before we followed the MCU in the modern world. There was that tidbit about the Eternals having helped the previous Avatar of Khonshu take down Ammit’s last avatar in the past but the idea was scrapped due to budget for Moon Knight. Which imho is unfortunate.",
            "[Ralph Ineson says that the script for Matt Shakman's 'THE FANTASTIC FOUR' is \"cool as fuck.\" \n](https://x.com/The_MovieDweeb/status/1804194197026611417)",
            "Please get Kendrick back for the BP 4 soundtrack, Coogler. 😢😢😢\n\nEdit: imma leave that 4 too. 😤",
            "While I enjoyed this season of *Doctor Who*, I can’t help but feel it was too short. 9 episodes (counting the Christmas special) just isn’t enough to get to know this Doctor and Ruby Sunday, compared to past seasons with ~13 episodes. That’s an almost 3 hour difference. \n\nSo is it wrong for me to say that for some shows, I’d rather have ~20 episodes seasons with lots of filler than 8, good episodes? For serialized shows (like Stranger Things) 8 episodes is plenty, but for episodic television like *Doctor Who* and *Star Trek*, 8-10 just isn’t enough.",
            "I hope, with Benedict confirming Strange is in Avengers 5, that Clea also has a decent sized role in the movie. Always liked Clea as a character from the comics, think she’s super cool, and there’s a lot they could do with her. Also Charlize Theron is a great actress and one of the best action stars out there, and it would be weird if we didn’t see her again after the MoM post credit scene. ",
            "Oscar Isaac is in talks to star in Beef Season 2 (which currently hasn't been greenlit yet).\n\nLooks like it's gonna be a long time before we see him as Moon Knight again.",
            "https://variety.com/2024/film/features/bad-boys-4-directors-adil-bilall-box-office-will-smith-slap-joke-1236043906/amp/\n\n>Well, a lot of people would like for you to visit Spider-Man’s New York instead, as possible directors for “Spider-Man 4.” Thoughts?\n\n>El Arbi: That’d be cool, if they allow us. If they ask us.\n\n>Fallah: We love Spider-Man and we love New York.",
            "Tough look for Alex Perez, he’s been saying forever that Strange won’t be in Avengers 5 cuz he’ll be off world with Clea. As if Marvel wasn’t gonna have one of, if not their biggest, remaining stars in the next Avengers movie. His credibility drops by the day. ",
            "If we ever *do* get Harry in the MCU, I think the route they’re going w/ him in the new Ultimate Comics would be perfect for him and Peter.\n\nThe Goblin starting off as a vigilante is a cool way to differentiate him from Dafoe’s version and there could be some great tension from Peter dealing with and potentially befriending a heroic (yet semi-shady) variant of his biggest enemy. It could be a bit like Clark and Lex’s dynamic in *Smallville*.",
            "[DiscussingFilm on X: \"James Gunn confirms he will not be attending SDCC this year as he will still be filming. https://t.co/qDNGC96x2o\" / X](https://x.com/DiscussingFilm/status/1804277752025223247)",
            "You know shit is crazy when the highest grossing movie of this past May is a Planet of the Apes movie that hasn’t even made $400 Million.",
            "I suspect the users on a sub like r/horror are more representative of Blade fans than here or r/marvelstudios, but I'm really hesitant to share the THR article over there.",
            "When do we think the teaser trailer for *Captain America: Brave New World* will be released? I think it won’t be out until D23 in August",
            "MTTSH is claiming A5 shoots in January, which would be fuckin strange. I have a feeling this is gonna be a looong shoot, given the scale of this film",
            "I do believe that Ali is frustrated with the production of Blade (mainly because a trade literally said he's frustrated with the production of Blade) But I maintain that people saying that the fact he accepted a role in a Jurassic Park movie is a sign that an announcement of him stepping down from the role is an any-day-now thing are wrong.\n\n\nThat'd be like saying that because Chris Pratt got more roles (funnily enough , one of them being another Jurassic Park movie) and did them while they were waiting in that time when they had fired Gunn is a sign that he was ready to step down in solidarity,",
            "Some villains for the X-Men movie that AREN’T Magneto (love the guy, but Fox really shoehorned him into every storyline, and I think the MCU should hold off on him for the time being)\n\n- [Mr. Sinister](https://marvel.fandom.com/wiki/Nathaniel_Essex_(Mister_Sinister)_(Earth-616)) (duh)\n\n- [The Hellfire Club](https://marvel.fandom.com/wiki/Hellfire_Club_(Earth-616)?so=search)\n\n- [Arcade](https://marvel.fandom.com/wiki/Arcade_(Earth-616)?so=search)\n\n- [Shadow King](https://marvel.fandom.com/wiki/Shadow_King_(Multiverse))\n\n- [Fenris](https://marvel.fandom.com/wiki/Fenris_(Earth-616))\n\n- [Omega Red](https://marvel.fandom.com/wiki/Arkady_Rossovich_(Earth-616)?so=search)\n\n- [Mojo](https://marvel.fandom.com/wiki/Mojo_(Mojoverse))",
            "With it being the week of Juneteenth, my brothers and I finally watched *The Blackening*, and it’s always a little funny watching a Tim Story movie and remembering “this guy was given the F4” lol.\n\nWhile I think the short it’s based off of was funnier, we had fun with this one. The back-and-forth between the cast (especially Jermaine Fowler) definitely carries a lot for it.",
            "I feel like this MSS subreddit is loosing its charm\nThere are not enough posts and when there are, they are very late",
            "One of the dumbest things about post Endgame Marvel is saving the Avengers movies for the end of sagas. I get wanting to get people a break and time to miss those movies, but movies are inevitably delayed and that just turns into multiple years without an Avengers movie. We were supposed to get more Civil War like movies, but since 2018 the only one we got was Spider-Man No Way Home and that was just Dr Strange, so that didn’t happen. A Young Avengers movie would’ve been great. Just something to show there’s a new team or anything before we get to what’s going to be whatever Kang Dynasty is going to become. For me, it’s just really disagreeable planning all around on that front",
            "there's a lot of stuff im looking forward to this summer but the Born Again trailer is probably my crown jewel, just feels sorta surreal knowing the fact i've been fantasizing about how this show is going to look for the past like few years now and the first proper taste is on the horizon. wonder if it's going to be the exact same trailer they showed behind closed doors recently, definitely wouldn't complain seeing as it sounded awesome between the glimpses at Frank, Dex, Foggy and Karen as well as the praise for the cinematography. the latter is something im especially excited to see for myself, all the talk of how it seemed as if they set out to match the visual style of the original series is seriously so delightful.\n\nhttps://i.redd.it/s00hizln118d1.gif\n\nonly one or two months 🙏",
            "Words cannot describe how excited I am for *Batman: Caped Crusader*. A mature, modernized B:TAS, from Bruce Timm, set in the ‘40s has the potential to be greatest Batman show ever. I’m so glad Amazon picked it up after WBD decided to drop it.",
            "What are the odds that we get info/news/updates about Armor Wars at Comic Con?",
            "People are talking about The Marvels on twitter again, okay.\n\nI’ll just say this, the 105 minute runtime feels less like an active creative choice and more like a studio choice to “trim down the fat” for better or worse (which makes me wonder about the reshoots it underwent, that recent THR article made it seem really expensive and extensive but I swear I heard nothing about them before that article). It moves far too fast",
            "Collider reports when DP&W happens in the MCU timeline.  \nhttps://collider.com/deadpool-and-wolverine-timeline/",
            "Shang-Chi, Multiverse Of Madness, Quantumania and The Marvels post-credit scenes will all be followed up on in Avengers 5. Bookmark this",
            "I’m not dying for a Guardians Vol.4 cause Vol.3 wrapped up things perfectly and it wouldn’t be the same without Gunn, But IF Marvel ever does a Vol.4 with the new team at the end credits of Vol.3..\n\nI think Judd Apatow (40 Year Old Virgin, Funny People, etc) would be a great director for Vol.4.",
            "X-men 97, Deadpool and Wolverine, Agatha, Venom last dance, Kraven and friendly neighbourhood Spider-Man all in 2024! Marvel fans are eating good this year.",
            "I wonder how much of characters not showing up as much as RDJ and Evans is due to the actors literally wanting to do/having other projects outside of just the MCU. Not that they don’t like it just to avoid burn out. I know most of it is them for some reason not committing to a core cast but just a thought.",
            "Modern Spider-Man adaptations keep winding up at Ultimate's door, imo is because:\n\n* The OG Ultimate was made when a Marvel under Avi Arad was asking the question: Is it easy to adapt? I don't think 616 was easy to adapt beat for beat, so the cinematic nature of Ultimate lends itself better to being turned into scripts.\n* Whatever came after that aren't exactly up to par given that they were, and are still being made under the \"Is it easy to adapt **for me**?\" mentality adopted by a Marvel led by David Maisel. The for me part is very important.\n* I can't really think of a standout Spider-Man story that is just him and his supporting cast first and foremost in modern day other than Life Story. That's pretty much the trickle down effect caused by Marvel's shifting priorities.",
            "Don’t sleep on the Agatha show it’s actually pretty good",
            "Man Blade is really over if Mahershala Ali leaves.",
            "Let’s have a friendly wager: will Thor still be alive at the end of the Multiverse Saga?",
            "So, if it's true that MCU Spider-Man films always have to feature a-listers as villains, I wonder who will be the a-lister in Spider-Man 4. Keaton again, perhaps?",
            "I don't know how I missed this considering how excited I am for this show and I don't know if this was posted here already, but I was looking on Wikipedia and they cited Production Weekly last month as revealing that Noir is going to start filming this September in L.A. under the working title 'Old Fashioned'.",
            "What do y'all think of [this BGR speculation](https://bgr.com/entertainment/im-convinced-that-i-know-when-marvel-will-release-spider-man-4/) that Spider-Man 4 could replace Blade as a Fall 2025 slot?\n\nI remember hearing awhile back that the Spidey 4 script should be getting close to ready, and I can see Sony's push for a quicker release date being a part of negotiations with Marvel. But I also have no idea how reliable BGR is and I haven't been following all this terribly closely",
            "I have a theory for how Cyclops’ Role (played by James Marsden) will be in Deadpool and Wolverine. I actually think he will have a role similar to Lylla in Guardians 3. \n\nSo it was MTTSH (yes I know she’s full of shit but a broken clock can be right twice a day) that said that Cyclops bugs Logan to wear the yellow spandex and Logan does so after Cyclops and the X-Men presumably die.\n\nSimilar to Lylla, I feel like Cyclops will only appear in flashbacks as an emotional core to Logan’s character and, just like Guardians 3, I think we will get flashbacks in the middle of the movie, where it’s with Logan hanging out with Scott and some other X-Men, with Scott having the biggest role out of the X-Men NOT named Wolverine. Well, one flashback shows the aftermath where Wolverine is controlled (probably by Cassandra Nova) to kill all the X-Men (which is where he let his world down) where Scott is like the last one standing. He tells Logan to stop and remember, with maybe an action fight between the two. After the fight and a quick talk with Scott, Logan thinks about it for a second but kills Scott (afterwards he realizes what he’s done cause he’s now free from Cassandra as he has now killed every single X-Men in his universe)",
            "Do you guys have any theories on how the MCU will last? Like how many phases it will have before it just stops..\n\n\nAlso, any guesses to the final MCU movie",
            "Do ya’ll care if the Avengers became like Justice League: Unlimited. I don’t really see the point in arguing about if Dr Strange, Spider-Man, Daredevil  is an Avenger or not. Just because they aren’t gonna be hanging out at the Avengers Mansion doesn’t mean they aren’t Avengers. The team shouldn’t be this exclusive. \n\n\nYou should be able to be apart of multiple teams Moon Knight can be apart of the Midnight Suns and be an Avenger, Luke Cage can be a Defender as well as an Avenger. Dr Strange while doing shit alone can still be a damn Avenger. Young Avengers, Midnight Suns, Thunderbolts, Defenerds, etc can she their own teams while still being apart of The Avengers. \n\nI guess there can still be a core group if you really want to have that AOU feel but there is simply too many characters now I don’t they will be doing that much if at all.  Everyone will probably be doing their own thing with their own issues until shit really hits the fan. \n\nIt’s all of Earth’s Mightiest Heroes connected through Earth, Cosmic Side, Supernatural, Street, etc",
            "That Cumberbatch Avengers 5 post already starts with a comment trashing on the current characters 🙄",
            "Thinking about Spider-Man 4, one element that has been getting tossed around by scoopers is that Sony wants some multiversal aspect to the film. And a lot of fans want something a bit more street level, with Daredevil and Kingpin etc. Devil's Reign gets brought up a lot. And as others have pointed out, Devil's Reign does have a multiversal element. With Doc Ock summoning alternate versions of himself through the multiverse. \n\nI think they could replicate this aspect with Liz Allan. Not Liz summoning alternate versions of herself through the multiverse. But Liz working for Kingpin on a multiversal gateway. Kingpin wants it for his own uses (maybe he fucks over his family in BA and wants to get them back, idk). But Liz wants it to bring her father back. Hence we get Liz bringing Vulture back into the MCU, and maybe a few other villains. \n\nThe majority of the movie is still about Fisk's mayoral reign and sending his Thunderbolts after vigilantes in the city. But there is still that multiversal element and a machine that can send people through the multiverse, which leads to Avengers 5.",
            "I know Fantastic Four is 1y+ away but I can’t wait for it. I hope we get some cool concept art for d23 or sdcc!",
            "MyTimeToShine is doubling down on the fact that Wesley Snipes will be in DP&W. Add in the fact that DRPK is agreeing that he'll be in it with John Campea  also saying he doesn't know much about the film but can say for 100% fact that he'll appear I'm now starting to believe that he will be in it. I'm not sure how to feel about it though with all the allegations surrounding him. I was also surprised Ryan would want to work with him again.",
            "Once again I'm asking, what do you guys think the Ultimate X-men suits would've looked like If, for some miracle, marvel hadn't decided to go with the black leather prevalent in X-men media at the time? And what do you think a merged 616 and ultimate X-men, taking the best of both worlds, would be like? Please, its for a fan project, I don't have much knowledge about the X-men and I wanna do something the fans would like, basically Ultimate X-men without the mistakes.",
            "Since the current writer for Miles Morales’s comics says he’s gonna create more original villains for him, \n\nmaybe Marvel Studios should wait a few years to introduce him, until there’s a wider villain selection.",
            "The Dune popcorn bucket single handedly saved Part 2's box office. That's the sole reason it succeeded. /s",
            "The more I think about it, the less I believe that they’re casting Miles Morales. Spider-Man 4 doesn’t even have a director, and there’s no indication of them beginning production anytime soon. And if it’s for a Sony project what would that even be? There’s no movies coming after Kraven, and Miles isn’t gonna be in the Noir show. Plus this is coming from Jeff Sneider, who’s credibility has fallen off a cliff lately, so I just don’t believe they’re actually casting Miles. ",
            "To my surprise, one of my friends said he considers Shang-Chi to be one of his favorite MCU films of all time.",
            "So when is beyond the spider-verse coming out ?",
            "So I watched the first episode of that Fallout show tonight. It's honestly extremely good, if not, great so far. Love the worldbuilding and how they got the look, feel, and esthetic down to a tea, and it actually felt like watching the video game come to live. The characters are also actually very likable. Lucy, especially, is probably my favorite so far, with the Ghoul as a close second. Don't really care much for Maximus and his story though. At least for now anyways, the Brotherhood of Steel stuff is cool, it's just his story I don't find that investing but that's okay. Though the teaser at the end seems to imply all three of there stories will converge at some point, since it seems like there all going after the same thing.\n\nAlso, the opening was honestly extremely well done. So yeah, overall, absolutely love the first episode. Can't wait to watch more.",
            "Why are DCU fans* so obsessed with the characters ages? I swear every day there’s “how old should *x* character be in the DCU” posts as if it’ll actually matter. These people do realize that Reeves and Gunn’s Batman could be the exact same age and at entirely different points in their careers, right? Age is a non-factor. \n\n*can you be a fan of something that doesn’t exist yet?",
            "Michael B Jordan just enrolled in Jared Leto’s acting class on how to play a vampire properly, \n\nto prepare for Ryan Coogler’s vampire film.",
            "What do you think \"Your Friendly Neighborhood Spider-Man\" will have of interesting, so it doesn't  become just high-school Peter Parker again?",
            "With F4 being set on a completely separate Earth from the main MCU, I wanted to ask, are there any movies you think should've been set in their own continuity from the main MCU timeline?\n\nPersonally, I always thought it would've been cool and interesting if Eternals was set on its own Earth separate from the 616. With this Earth also consisting of Werewolf By Night, Blade, and maybe even Moonknight. It be good way to explain why those projects feel so disconnected from everything else in the MCU, and Jack, Teddy, Blade, Merc/Steven, Elsa (no, not that Elsa, Bloodstone Elsa),  Lylla (not the otter, the other lylla), and Whitman are already a pretty stellar Midnight Suns lineup on its own, so why not? All that's missing is Johnny Blaze Ghost Rider, played by Nic Cage (not the same one from his movies, though), and we're set.\n\nI also had a pitch for a Nova that was set within a different continuity, mainly the one Defender Strange from MOM comes from. With the movies, basically a Top Gun Maverick inspired story about an older Richard Rider training a young Sam Alexander, with flashbacks that are essentially an origin story for Young Richard Rider. The reason for this is because there are no hints that any Nova Corps survived the Xander attack or if Richard Rider even exists in 616, and much like with F4, it be nice worldbuilding for the Multiverse.\n\nFinally, I'd love to see a D+ that's essentially a The Boys inspired loose adaptation of the Ultimates. Now, that would be epic. But, what do you all think?",
            "HE HAS ACTUAL TRUNKSSSS!!!! 💜💜💜💜💜🤍🤍",
            "I read that the reason Edward Norton's Hulk didn't looked much like him is because they had the model ready long before he signed up. Had they gone with Ruffalo for TIH, like they originally intended, do you guys think they would've still changed the design for Avengers 1? I feel like the recast gave Whedon much more room to reimagine Hulk.",
            "What's your preferred Midnight Sons lineup?",
            "I like The Boys, but damn, we’re not going to kill Homelander for another series? Alright. Another one in the bag.\n\nAt least Frenchie is interesting.",
            "Marvel could look at the *Blue Beetle* situation and continue the *Eternals* storyline in animated form. They could maybe go for an anime style series since Chloe Zhao is a big fan.",
            "So if you don't remember a while ago, I gave a pitch for an animated adventure film titled \"Lost and Found: A Love Story.\" Which, especially since i really dont feel like recapping the story, I'll leave a link to the original comment here: https://www.reddit.com/r/MarvelStudiosSpoilers/s/HlhBqliUQ6\n\nBut it's been going good so far. I am already 45 pages into it, and it's coming by very well. Granted, it's a first draft, and some stuff will need some work. But as first drafts go, it's turning out great.",
            "https://www.reddit.com/r/Fauxmoi/comments/1d9k9u5/comment/l7eeqnt/\n\n\n\n\nTake it with a grain of salt, but apparently Rachel Zegler came close to joining an upcoming Star Wars project, but it might happen later on.\n\n\n\n\nSide note: She met with James Mangold for his Bob Dylan film “A Complete Unknown” but also lost the part, but at least they know each other. ",
            "I feel like if The Marvels hadn’t flopped, they would’ve made Kamala the main protagonist/POV character in the MCU’s X-men film. I don’t think they specifically made her a mutant if she wasn’t gonna be a big part of mutant business.\n\nBut since it bombed, and there’s no way Iger is greenlighting a project with her as the lead anytime soon,\n\nI think they’ll introduce Kitty Pryde, or Jubilee, or even X-23 instead.",
            "After years of parodies, and “deconstructions” of Superman archetypes, it’s time for a reconstruction; it’s time for him to reclaim his title as THE superhero. \n\nAnd I love that this is PART of the film’s story",
            "I hope BTSV doesn't lead to Miles breaking up with Tiana in the comic in the most convoluted way possible because in the previous two instances surrounding a Spider-Man trilogy, well things happened.\n\nAfter Spider-Man 3, One More Day kicked off.\n\nAfter No Way Home, Zeb Wells happened.",
            "Keep thinking about this Spiderman  guy Sony wants to do a movie of, did a little research, something to do with Kraven I think...",
            "Rewatched Star Wars The Last Jedi after almost 18 months and still think it's the best Star Wars movie(and probably the best \"blockbuster\" movie of all time!?).This is Rian's Magnum Opus imo. Almost everything is about it is really great acting,writing,visuals etc. Thanks to this movie Rey is one of my favorite characters of all time(and maybe best SW character!?). Genuinely can't wait for her upcoming movie.While I'm not the biggest fan of  Sharmeen Obaid-Chinoy because her Ms Marvel episodes were okay to me but everything she has said about Rey movie in her recent interview makes me more optimistic and pairing her up with Peaky Blinders writer hopefully the movie is great and does well critically and financially and we get another Rey Trilogy. Still want Rian to make another SW movie(ik the chances are low) after Knives Out 3 before he moves on to make original projects,poker face etc.\n\nhttps://i.redd.it/ftvvxqelxx7d1.gif",
            "What are some characters we should NOT expect to see in Avengers 5? (Besides characters who obviously are done and retired or dead, like Drax or Tony though I think Tony is for sure coming back in Secret Wars) \n\nObviously, I don’t think Wasp will be in the film or any of the Eternals. She Hulk is debatable because apparently the actress pissed off Iger",
            "\"But how are they going to assemble all these heroes for a new team and face the villain of the saga?\"\n\nThere was a little-known movie from 2012 called *Avengers* that seemed to do it pretty well. They did it another three times too, if you can believe it.\n\nWhy do so many people overcomplicate this next Avengers movie?",
            "RTD is officially a hack writer like Rian Ruin Johnson! Moffat is officially king of Doctor Who!",
            "I think a lot of big Hollywood productions are gonna avoid 2026 release dates, cuz in terms of movies, \n\nshowing solidarity with a potential SAG and WGA strike is gonna be the focus of that year for a lot of people.",
            "It’s weird to me when people talk about how racist and awful Ike perlmutter was and how it’s his fault and not Disney/marvel as a whole for there only being movies about whit white for the first 10 years of the mcu yet don’t bring up that he wasn’t fired until 2023. Like Disney and marvel execs sure seemed to like having him around! Must not have hated him like all the mcu fans claim they did!",
            "Do you think MCU Spider-Man starting out as a high schooler was a mistake? Or maybe he stayed in high-school too long? I don't completely agree, but that's often used as an example of Marvel not letting Peter grow up",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "I know they said this will be a full on ensemble and there won't be any leads but I really feel like Doctor Stange will play a major role, especially since DS3 doesn't seem to be happening at all.",
            "Another thing about the “grounded threat” portion is that I don’t think you can have Dr Strange in an Avengers movie and have the villain be “grounded”",
            "Hit Monkey too",
            "also What if 3!",
            "Kite Man too",
            "Yeah I'm like 99% sure Giancarlo's Paladin, he fits the bill of everything we've heard about his character so far and it makes sense for him to be in multiple projects as he's encountered other Marvel characters in the comics before.",
            "Has there ever been a Cap comic where he has fought a Hulk rogue or Hulk himself?\n\nNot counting Avengers comics",
            "Yeah, I can already see it. Captain America and his team, along with other earth based heroes fending off an attack on earth while Strange and Clea deal with Incursions and Captain Marvel, Wong and Shang Chi figure out the ten rings and bangels while trying to bring back Monica. We just jump between them through the movie. They probably cross paths by the 3rd act through Multiversal shenanigans either ending up in the void or another universe(most likely the one Monica is in)\n\nI can also easily see The Fantastic Four being involved",
            "what about a space based  team",
            "I love Magneto and I think the show handles him better than other examples of the well-intentioned extremist trope, but I feel like many gloss over that he’s not meant to be *wholly* in the right.\n\nPart of why I think fans overlook his shadier traits is b/c they really relate to his rage against oppression, which is understandable. But while he’s right that the cycle of violence against oppressed will persist unless action is taken and his rage is IMO justified (especially after Genosha), mass genocide isn’t the right answer to injustice either.",
            "I don’t disagree, but had he not shut down the power grid, Bastion’s plan would have succeeded. The global shutdown was crucial to their defeat of him, even Cyclops prevented Charles from stopping Magneto prematurely.",
            "The 97 Magneto Was Right defense is that he saved the mutants from Bastion. His primary goal with the EMP was to stop Bastion, it wasn't to kill humans. The humans were just unintended collateral damage.\n\nThis is different from Ultimate Magneto whose sole goal with the shift of the planet's magnetism was to kill everyone.",
            "> There was that tidbit about the Eternals having helped the previous Avatar of Khonshu take down Ammit’s last avatar in the past but the idea was scrapped due to budget for Moon Knight. Which imho is unfortunate.\n\nI didn't know that! A true shame indeed as it would've made both projects feel less isolated. Even if they couldn't show it due to budget, a mention would've been nice.",
            "Why not BP3",
            ">BP 4 soundtrack\n\nWe skipped a film there",
            "Fuck it, let's have a Namor disstrack in there",
            "> So is it wrong for me to say that for some shows, I’d rather have ~20 episodes seasons with lots of filler than 8, good episodes?\n\nNo, we really missed the boat when we let these things disappear.\n\nHawkeye should have been in a Xena-like budget and working on its 3rd season, 60th episode by now.",
            "the main reason why the changed occurred was covid, season before that had SIX! episodes! while they only had THREE! the following two years you would think that in 2024 that they'd go back to being 13 episodes, but there is a HUGE cost of living crisis in the UK and that indeed affects the budget, even that of a high prestige show that even the damn KING AND QUEEN of Great Britain loves that has just gotten a huge cash influx  from a major american company. if you REALLY want to see more Who on the  silver screen, id say wait a few years when the UK's economy recovers. Until then Big Finish and Books (comic and regular) are you're friends as these guys have very little budget yet they manage to make it FEEL like an episode of the show come to life!  in fact i believe THREE books courtesy of BBC's book's  department featuring 15 and Ruby are coming out as i speak!",
            "avengers 5 is all we're gonna get \n\nbut hey a 5 mins cameo ain't bad compared to nothing",
            "When there's no plan for the character, stuff like these happen.",
            "I'm excited for Beef Season 2. I really liked Season 1 and Oscar Isaac and Carey Mulligan going toe-to-toe sounds fun, I'm curious to see how they might differentiate things from the first season.",
            "Just fucking give it to them Sony. What the hell!?",
            "Now is the time MakeMindMarvel’s strikes against Alex Perez actually makes sense. In between his Doom nonsense, he had a point about Alex Perez. He accidentally found him out.",
            "It was Alex who put out a report about Strange's future in the middle of a fucking writers' strike, also he keeps insisting that WWH is happening, despite Rufallo's comments. Like Shine, he used to be reliable. Now it's just he passing his theories as scoops.  ",
            "Oh, that be pretty cool actually. Though, I haven't read the new Ultimates run, but I'm assuming they skip over Norman?",
            "Without the Iron Man connection hopefully. It would be so hilariously sad if MCU Harry also has ties to Iron Man.",
            "I swear I remember Gunn saying at some point that there are other places besides SDCC where they can reveal stuff. That alongside him stating multiple times that he won't be at SDCC kind of leads me to believe that DC may not have a huge presence there come next month.\n\nI only say that because I've seen some thinking around it before (he'll show up in a video call or send Safran instead or something), but I'm not fully convinced on that. I could very well be wrong and I'd be delightfully surprised if the DCU does manage to have something to show there this year, but I'm cautious about it for right now.",
            "I mean yeah, but on the other hand, it seems like these Inside Out screenings have ditched seats and just started outright printing money in the multiplexes.",
            "And it will be Disney's lowest grossing PG-13 blockbuster since... when was the last time then?",
            "I'm not so sure about that. Like sure they probably like a good vampire movie. But Blade is still very much a comic book character and his fans are comic book nerds. When horror fans are discussing horror classics and their favorite characters, they're not really talking about Blade I imagine. A comic book sub is going to probably a bit more representative of Blade fans.",
            "Idk I FEEL like attaching it with DP3 would be the best move but that probably ain’t gonna happen",
            ">When do we think the teaser trailer for Captain America: Brave New World will be released?\n\nProbably around 6 months before it releases. So D23 does seem like a good time to debut a teaser.",
            "D23.",
            "January is already the rumored start date, according Production Weekly and RPK. That’s when Infinity War started production so it makes sense A5 and Secret Wars would start then as well and last through out the rest of the year.",
            "If it comes out in 2026, that seems possible. Maybe not January exactly, but early 2025 for sure. As for the other rumored films, SM4 is supposed to start filming in 2024 and Shang-Chi 2 is probably filming and coming out after Avengers 5. I don't see any other movies that need to film before it and would conflict with that shoot.",
            "Same.",
            "Depends, they can film it in 6 months at most, but if they’re filming that and Secret Wars at the same time then they’d stretch it. However, it does seem like that May 2026 date is locked ",
            "I’d say 6 months",
            "I don't think it's a sign that he's stepping down. But people are remarkably against the idea that Ali could leave the movie. People act like it's not possible or that there can't be a Blade movie without Ali. And that's simply not the case.",
            "Sinister is definitely on the top of my list of X-Men villains. Shadow King would be a great  choice for a villain in a Solo Storm project. Omega Red would be ideal for a Wolverine project. I'm not sure what project Fenris would fit in, but I love to see them in one. I could totally see them being like the X-Men's equivalent of Stormfront from 'The Boys'.",
            "All of them would be great to see, Sinister especially is top of the list for me.\n\nShadow King would be perfect if we ever get a Storm-focused project and [I mentioned before](https://www.reddit.com/r/MarvelStudiosSpoilers/s/6c5rMFIbUL) how I think Arcade has potential to be a great villain.",
            "Personally, I feel like Magneto is the absolute nemesis of the X-Men. So even if he’s not the antagonist, he should still be present.",
            "I do expect more news in July",
            "🎻🎻🎻",
            "I think the first Phase 4 movies should have been Captain Marvel 2, Captain America 4, Black Panther 2 and Doctor Strange 2, then the new characters' like Shang Chi and Eternals. Introducing so much characters was their biggest mistake. ",
            "wait really?!? we think we're getting a trailer this summer????",
            "Assuming it’s still happening (and there’s no reason to believe it isn’t), then they should talk about at either. SDCC or D23. It’d be really weird if they didn’t.",
            "I adore the movie as it is, but we know about several things that were changed. There was a fight scene, where the rest of Dar-Benns Fleet is destroyed(before the final fight), which was clearly cut. They also went to Hala in a previous cut(as we see in one of the trailers).",
            "I believe they also made Waititi cut down on Thor 4’s runtime which left a lot on the cutting room floor (especially with Gorr).",
            "Extensive reshoots for the film were already mentioned before and Dacosta talked about how she wanted a short film which may or may not be true but i don't think it matters, the longer versions probably weren't good either and that's why the studio, Dacosta or both decided to shorten the film",
            "I always thought the shorter runtime was \n DaCosta’s choice but upon learning it was the studio’s decision, it makes it all even worse. Why would they shoot themselves in the foot like that? The movie really bombed because of them and they should totally take all the credit for it. I still believe they did Carol dirty. So much for setting her up as one of the major players of the new saga.",
            "#releasetheDaCostaCut!",
            "So presuming it takes place in July as well, that slots it between FFH and Eternals. Interesting that this would also set it before Loki s2 tho👀",
            "Nice!",
            "Multiverse the one with Clea and the dark dimension? \n\nShang Chi and Quantumania seem kang related and Marvels if that also leads them into incursions and other universes. But also throwing in a trip to the dark dimension seems difficult.",
            "I still think my list is a good bet either someone with very close ties with Gunn (Travis Knight, David Yarovensky) or someone who has a very close style to Gunn (Mike White, The Duffers)",
            "If Judd Apatow directs then we’ll probably get Seth Rogen in the MCU, who would he play? He’d probably be a voice role like Rocket and Groot",
            "Meh, I think they need to go for a completely different vibe. Not Guardians Vol 4, but a new guardians franchise. Let’s see someone else’s vision instead of trying to replicate Gunns\n\nLike Suicide Squad to The Suicide Squad",
            "As a CBM fan in general I am also looking forward to The Penguin and Creature Commandos",
            "It’s probably because Marvel has moved away from multi-film contracts.\n\nDuring the Infinity Saga, RDJ, Evens and Hemsworth were signed on for multiple movies at a time, which meant they’d show up every year or two, but it also limited what other movies they could do. Between 2015 and 2019, RDJ only played Iron Man. \n\nBut now Marvel is only signing actors on for one or two movies at a time. So when they’re not under contract, you kinda just have to wait for them became available again, which makes regular appearances a lot harder. We’d have almost certainly gotten Spider-Man 4 by now if Marvel wasn’t waiting on Holland and Zendaya.",
            "I think it’s also because Ultimate Spider-Man was written as a jumping on point for new readers, so the people working on these adaptations were introduced to Spider-Man comics through Ultimate. That’s *their* Spider-Man. \n\nIt also doesn’t help that there’s just not a lot of good modern Spider-Man runs to pull from. The ‘90s and JMS’ run are convoluted AF, and everything after One More Day is tainted by what happened in One More Day. \n\nThat really only leaves Ultimate Spider-Man, and anything from before The Clone Saga. There’s been good comics since then, but not enough consistency for anyone to pull from outside of a few characters and moments.",
            "drop some juicy Born Again stuff and then we'll talk",
            "I'm excited about it introducing Billy and continuing to set up Young Avengers. Hopefully, a lot more expansion of the Mystic side of the MCU that can be used later. Definitely a ton of world building potential there, which I love. I'm looking forward to it",
            "What about 'Your Friendly Neighborhood Spider-Man'?",
            "Guys we got a new leaker, mods add them to the database",
            "Is it? Looking at recent events, I think Marvel is all in on Blade, while some of Ali's involvement in the movie has lessened. According to THR, Ali's handpicked director, Demange, has left the project and Marvel (not Ali) is searching for a new director. Ali is filming a Jurassic World movie. The new writer for the movie is Pearson, a Marvel in-house writer who has worked on a ton of their recent projects. Thats all stuff confirmed by trades. Meanwhile, some rumors suggest Green, who was writing the script, is now writing Midnight Sons for Marvel, which is supposedly connected to Blade. \n\nTo me, it looks like a decision has been made NOT to make Blade a standalone movie and to connect it to other projects going forward. If Ali leaves, I don't think it actually impacts the project that much. It's not like the creatives are there because of him. Ali's handpicked director is gone, and Marvel's new favorite is working on the script. If Ali walks away, Marvel probably forges ahead with the team they have. And given Ali is filming a different movie right now, I'd say he's got one foot out the door. I wouldn't be at all shocked if  Ali and Marvel part ways but Blade keeps moving forward.",
            "I don't think so. I think at this point it would have a better chance of releasing if he did leave",
            "Ya I don’t see the point in keeping it if he decides to leave",
            "If love and thunder was good I would have said no but because it wasn’t I want to give him one great final movie as a send off",
            "Yes. But first he'll die.",
            "Yes, absolutely. Hemsworth is still open to playing the character, and he's still young. There's literally no reason to get rid of his Thor",
            "Yes. Cause I want another movie.",
            ">So, if it's true that all MCU Spider-Man movies have to have a-listers as the villain,\n\nWhere's that coming from?",
            "Idk if that's actually true or not. But if it is, and I really, REALLY want a Fisk created Sinister Six as the main villains, Chris Pine as Hydro-Man. (Alongside Keaton Vulture, 2nd Shocker, Mando Scorpion, Glover Prowler, and Gyllenhaal Mysterio).",
            "I feel like Sony would veto Keaton as the villain given that it contradicts Morbius and ruins their Sinister Six plans. Unless Spider-Man 4 involves the multiverse, I guess.",
            "It’s more likely fantastic four is moved into that fall 2025 slot.",
            "6 months would be a pretty short turnaround time. /s\n\nBut I do think it's possible. Unlikely, but I would be glad to see it.",
            "Sony sets the Spider-Man release dates, not disney, so this automatically doesn’t make a lot of sense",
            "I wonder if they’re gonna do to James Marsden what they did to Bill Murray and shred his role in the editing room.\n\nI heard Bill Murray was supposed to have a lot more screen time in Quantumamia, before he got Aziz Ansari’s movie cancelled.",
            "unlike lylla bc he's James Mardsen, we won't feel any sorrow for him after what he did! (he excused the monster Brian Peck's actions!)",
            "It'll last forever. After Kevin's death, his AI will take the company over. ",
            "I feel like we’ve got at least another good 10-12 years. We still haven’t gotten the Fantastic Four or the X-Men, and the Spider-Man movies will continue with Miles Morales. Beyond that, there’s still so many more characters that could fill out the next decade, like Nova, the Inhumans, Ghost Rider, Power Pact, Squirrel Girl. and Moon Girl and Devil Dinosaur.",
            "I don't think it'll ever truly stop unless Marvel Studios itself goes belly up.  Maybe they focus less on an overall narrative and do more standalone films coupled with far lesser output.  Albeit, the rumors of the next saga being mutant and X-Men-centric are probably true and their mythos provide more than enough material for the next 10 years post-Secret Wars.  So I don't expect them to pivot just yet.",
            "I imagine after this Phase they'll take a break, then after a few years press the soft-reboot button, set in the new timeline.",
            "It's already been like that tbh. Only the first film had a true official team.",
            ">The team shouldn’t be this exclusive.\n\nCouldn’t disagree more. Making every single hero an (official) Avenger just defeats the purpose of the whole thing. If everyone present in Endgame, for instance, is an Avenger now, then what’s the point?\n\nAlso, like another person said, Marvel already has a tendency to homogenize characters to make them fit. Up to this point, the MCU is actually the Avengers Cinematic Universe and Marvel has so much more and different to offer than make every character fit that bill, even if just by name\n\n>I guess there can still be a core group if you really want to have that AOU feel but there is simply too many characters now I don’t they will be doing that much if at all.\n\nI don’t know man; for me, this is the entire appeal of a team dynamic, especially the Avengers. Unlike the other Marvel teams these people come together from damn near their own universes and part of the point of that is to see how they bounce off each other. \n\n\nMaking Avengers movies exclusively “look at how many fucking actors we have!!!” is only going to go so far when it comes to satisfying interactions",
            "I think this is exactly what they're doing going off of the trades report. And I honestly don't mind it. I'd definitely prefer a core team because it really was the interactions between this family-like group of heroes that made the past Avengers movies so great imo. At the same time, having just a ton of different characters and perspectives, exploring all corners of the MCU in one movie sounds insanely cool too. I think a balance of both would be perfect. Although for Avengers 5 it's definitely far to late to have this core team.",
            "I think it's a bad idea. A very common criticism when it comes to the MCU adapting characters who aren't associated with the Avengers is that they're forcing them to fit that Avengers-shaped mould. For many, it's a \"square peg in a round hole\" kind of situation. Fans of other characters/teams/corners also don't like it when Marvel indicates the Avengers are higher priority than their favorites. In the comics, there's no hierarchy and it's a very loose, decentralized universe. There's room for alternate continuities like Ultimates or out-of-continuity stuff like MAX and Epic.\n\nSo far, this is not the case with the MCU.\n\nSo, going back to your *Justice League: Unlimited* example, imagine if DC said, \"Justice League is the *only* DC you will ever get.\" No Vertigo, no *Watchmen*, nothing like that. Yes, I realize DC has hamfistedly forced *Watchmen* into its regular superhero line and Vertigo has always had some overlap, but there's still some *very* out-of-continuity, out-of-the-mainstream stuff there.\n\nI think, if Marvel were to double-down on the Avengers being the end-all-be-all, it would feel less like a universe full of exciting possibilities and more like one of frustrating limitations.\n\nEDIT: Actually, that point about DC forcing *Watchmen* into its regular line is EXACTLY the same concern people have with Marvel and its Avengers.",
            "Those comments are so tiring. I read that one and immediately exited out.\n\nUsing She Hulk and Carol as examples of characters people don’t care about seems a little unfair considering the hate campaigns against them that often dominate online discussions. And why say Falcon? I’m guessing they forgot Sam was Captain America.\n\nThere’s hype for more characters than Strange and Spidey. I can think of at least 6 more superheroes with hype around them (Thor, Star Lord, Moon Knight, Kate Bishop, Daredevil, Shuri). I think people forget that the first Avengers film only had 6 heroes. Hawkeye wasn’t too hyped at the time and The Incredible Hulk didn’t do great financially or critically.\n\nWe’ve only really lost Tony, Steve, Nat, T’Challa, and Wanda. There’s enough hype from new characters to fill that gap.",
            "So basically you want to shove in a live action remake of ITSV into this film.",
            "Here’s the thing; I don’t think Marvel can even use *that* version of Blade, since he’s owned by New Line Cinema.\n\nYeah, the film rights to Blade reverted back to Marvel, but those movies are still owned by New Line (hence why they’re not on Disney+). It’s the same reason they can’t use Speculator Spider-Man despite owning the rights to Spider-Man.  \n\nIdk, maybe I’m completely wrong, or maybe Mavrel worked everything else behind the scenes. I don’t know, it just doesn’t seem like something that could happen IMO",
            "I feel like it’d have been closer to the costumes in X-Men Evolution. A blend between the black leather and the classic comic looks. Kinda like the suits at the end of X-Men Apocalypse.",
            "Here you ever seen those rejected costume designs Alex Ross did? I think it was for \"New X-Men\" . They're really cool. Black with a big coloured 'x', different colours for each character.",
            "So far, the latest runs have been doing a pretty good job of expanding on Miles’s rogues gallery. Could be fun to see him develop a big list of enemies like Peter.",
            "He’s already established a good amount, Rabble could probably be a movie’s main villain and I can see Frost Pharaoh or Bumbler working as an opening villain",
            "Miles being cast in the MCU has joined the ranks of World War Hulk, Henry Cavill in the MCU, and the constantly fluctuating rumors for Avengers 5.",
            "Sony could be developing a Miles movie entirely separate from Marvel. I have a feeling they know the first Miles movie will make a lot and they don’t wanna share the pot with Marvel when they already share the OG.",
            "Maybe for a small cameo/gag in Spiderverse 3. A follow up to live action Prowler.",
            "Sounds like you have a cool friend.",
            "What's surprising about that? Shang-Chi was great!",
            "It’s definitely top 3 for me, love it",
            "I think the only thing we have to go on is that a musician by the name of D4VD claimed it's coming next year. I don't think he's actually confirmed to be working on the movie, but he's hinted at it.\n\nWhether it's Beyond the Spider-Verse or Holland's Spider-Man 4, I imagine Sony's aiming to get one of them out next year, but that's my own speculation.",
            "Probably either 2025 or 2027. \n\nNo way they’re releasing that in 2026 during a potential strike year, after the story about the treatment of animators on the second film.",
            "After you die. /s",
            "Honestly I was the same way at first then I started to dislike the Ghoul and Maximus grew on me more",
            "It’s like Deadpool said in Deadpool 2: “We need to build a fucking team. We need 'em tough, morally flexible, and young enough so they can carry this franchise 10-12 years.” Of course, he said that as a joke, but there are people amongst both the DCU and MCU fan bases (the Pedro Pascal as Reed Richards discourse is a prime example of this) who’ve taken that line as a unironic foolproof blueprint when it comes to fancasting, and that any deviation from said blueprint is box office poison.\n\nIn short, it’s yet another example of Redditors viewing these movies/shows as cynically as possible in their time spent LARPing as armchair film producers.",
            "It depends for the story being told and the ages of the actors. A story of Hal Jordan as a young, rookie Green Lantern would be pretty different from a story of him as an older, veteran Green Lantern. \n\nThat being said, I don't think specific ages are gonna be that relevant for the DCU's story telling but the age ranges would help show where these characters are at in life during these movies and shows.",
            "Tbh, it's one of only things I care about regarding adaptations",
            "founded by Sir Christopher Lee",
            "The Norman mentor angle and how that changes the story (along with Peter’s friend group being other supes)",
            "Assuming it gets more than one season, \n\nI think FNSM is the only piece of media where we might get to see Peter’s relationship with the Fantastic Four on-screen. \n\nI don’t see how they could do it on 616/199999 at this point, with the MCU struggling to juggle so many characters, and having to constantly change plans with actors not wanting to stay on longterm.",
            ">It be good way to explain why those projects feel so disconnected from everything else in the MCU\n\nThere is nothing to explain. Having projects that are set in the same universe but also feel unique in terms of narrative and tone is good actually. Gunn has been talking about things like that for the DCU too. I hope Marvel uses the Spotlight banner for this stuff in the future.",
            "I don’t think any movie should be set in an alternate universe unless it absolutely has to be for the story to work, like The Batman and Fantastic Four. So far, Marvel hasn’t released a movie that made me think it’d have been better if it wasn’t set in the MCU. Eternals wouldn’t magically be a better movie if they removed the references to the wider MCU.",
            "Eternals, Midnight Sons, F4, Annihilators, Illuminati, X-Men reboot, Young Avengers all should be AU properties. They won't be, but they should.",
            "You could kinda make them out in the official photo, but it is nice to see them in their glory. \n\nSide note, I just love the way Superman is posed in those pictures. Like yeah, that’s Superman.",
            "MCU Wolverine should have his iconic blue trunks to set him apart from Jackman's Wolverine. And Cyclops his yellow trunks.\n\nThe Trunkverse is back!",
            "I just need Dr Strange and Scarlet Witch in it to be the magic mirror of Steve and Nat of the Avengers. The other members can follow suit - Moon Knight, Blade, Jack Russell, Elsa Bloodstone, Man Thing and Black Knight. If Ghost Rider is introduced by the time the movie comes out then I’d defo want him in there too.",
            "Blade\n\nGhost Rider\n\nMoon Knight \n\nElsa Bloodstone\n\nWerewolf by Night \n\nMan Thing",
            "Doctor Strange\n\n\nBlade\n\n\nBlack Knight\n\n\nMoon Knight\n\n\nScarlet Scarab\n\n\nWerewolf by Night\n\n\nElsa Bloodstone",
            "I mean we know it's ending in season 5..\n\nI trust them to bring it all together..it would be problematic if we didn't know when they would be ending the show.",
            "The difference is Blue Beetle is going to be part of brand new universe and its very doubtful the movie will be 100% canon. ",
            "Agree 100%. It would be the perfect move for something like She-Hulk too.",
            "She lost to Monica Barbaro for the Bob Dylan film its seems.",
            "It’s not going to be good when the Rachel Zegler Snow White bombs, the discourse will be so annoying. I hope she can be in the new Hunger Games. I can’t stand a great actress/actor that Hollywood banks on being shunned because box office receipts are bad.",
            "Hopefully it's true would love to have Rachel Zegler in Star Wars.\n\n![gif](giphy|CeC8h4Za2nPGtl3Q1t)",
            "I would love that so much.",
            "I feel like The Marvels set Kamala up more as the POV for the Young Avengers rather than the X-Men.\n\nI do think she might meet the X-Men in the MCU, though I can also see her taken Wanda’s comic role as the Avengers’ mutant member (showing not all mutant heroes are X-Men).",
            "by the time that xmen film would have come out she's gonna be in her mid to late twenties, i feel like for the pov character would be someone younger either in late teens or early twenties so they could stick around for a long while like what they did with tom holland",
            "They called her a mutant because they found out making a Muslim character a Djinn was problematic. It was never going to amount to anything even before she underperformed twice.",
            "I admire your optimism, rival.",
            "I think it would be weird if they didn't offer a conclusion to the eternals,or atleast include some of them in the movies.\n\nAnd as for the she hulk thing,I think some clarification is required,as she didn't say the show failed. She said it was too expensive for a TV show.\n\nI think feige said that she hulk would move from the tv show to the movies as early as 2019.. obviously things could change but I feel like iger won't dissuade feige from adding she hulk.",
            "I think you're right about Eternal and The Wasp. Not so sure about She-Hulk. Ignoring the actress' comments about Iger I think she'd be one of the most likely to appear actually. \n\nOther than that, I don't think the Spernatural/Mystic side will be brought up. Characters like Werewolf By Night, Man Thing, Elsa Bloodstone, Agatha and all the other Witches I'm pretty confident won't be showing up.",
            "Your point stands in general but imo the first half of A1 is clunky. The film doesn't start clicking until Thor finally arrives and everyone is on the Heicarrier.",
            "Rian Johnson is not a hack, he made knives out\n\n![gif](giphy|llhCZgGFccWqvR7uUB)",
            ">Rian Ruin Johnson\n\nRent-free for *seven* years. What a steal.",
            "I don’t think either side of that spectrum can really afford another drawn out strike",
            "The studios are on the opposite end of that battle, their bottom line is financials, not the welfare of the workers on strike. In the event a strike happens again and they have films ready to go for 2026, I imagine they'll release them in 2026 regardless.\n\nWhether they're *able* to *if* a strike happens (filming/post-production halted and not completed) is another question entirely, but just like last time, they'd still keep it moving as much as they can.",
            "[deleted]",
            "Yeah, he wasn’t formally fired until last year, but by then he had most of his power stripped away. He used to be above Kevin Feige until 2015, when he was told to report directly to Iger instead.\n\nThen in 2019, Marvel TV was shut down and restructured into a division of Marvel Studios, and Feige was named CCO of all of Marvel Entertainment, which meant Perlmutter had virtually no power left and was just waiting to be fired. \n\nIt’s pretty clear he had severed all of his relationships in the company, or else they wouldn’t have siphoned all of his power away before firing him.",
            "Perlmutter wasn't in a position of power to control the MCU after 2016 when Iger did corporate restructuring to have Feige report directly to Horn (the chair of Disney at the time) instead of Perlmutter.",
            ">Do you think MCU Spider-Man starting out as a high schooler was a mistake?\n\nAs a fan of the early MCU’s clear inspiration from the ultimate universe, no",
            "I don’t think so. I mean, I think it’s clear they cast Holland cuz:\n\na) he looks like Peter Parker from the Ultimate comics, and \n\nb) he was young enough to possibly stay in the role for 3-6 solo films, possibly spanning from high  school, to college, to adulthood. \n\nI don’t think Peter’s identity being wiped out by magic was part of the original plan.",
            "would've liked if they started directly from college",
            "Maguire’s Spidey was the only one solely based off 616.\n\nGarfield and Holland both felt like they were adapting Ultimate Spider-Man.",
            "Personally, I wish they'd continued with Garfield's version, at least in broad strokes.\n\nI know that's not a widely-held opinion",
            "Your obsessed with the British royal family, why",
            "“I’m going to give people some hard truths”\n\n*Proceeds to spew the most mild opinions imaginable*",
            "Paul being the villain isn’t even an opinion, that’s the explicit point of the story. ",
            "Is the Blade 1920s one really a harsh truth though? I’ve seen some people pretty disappointed by that not being the case anymore.",
            "Idk about the rest but I agree that Pepsi is SO much better than coke.",
            "Civil war is the weakest in the Cap trilogy, and your first take is a dud",
            "harsh truths that will slowly come out !",
            "This is just to bait people into another one of your anti-labor rants, isn't it?",
            "Why wouldn’t it come out, marvel is giving that movie its time for a good reason",
            "For a while the rumor was that DS3 would be Time Runs Out, leading to A5. Considering we aren't getting DS3 beforehand, I imagine Strange's role will be what it was in Time Runs Out. Traveling the multiverse to prevent the incursions.",
            "Hell yeah!",
            "I edited that twice. I hate typing on my phone. 😭😭😭",
            "😌",
            "also another reason, 20 episode seasons are usually for AMERICAN shows and usually they have a VERY low budget, think you're NCIS's and Grey's  and all its rare these days to have 20 episode big budget shows, it's why the Marvel ones are also of that length!",
            ">but hey a 5 mins cameo ain't bad compared to nothing\n\nEh, I dunno. I think I'd prefer nothing, haha.\n\nIf the MCU isn't going to use Moon Knight then at least let other people use him, you know? Whether that's animation or video games or something. But right now he's just kind of on hold because they *might* use him.",
            "For sure it's great that Oscar Isaac's getting a lot of these roles, especially in an acclaimed show like Beef. \n\nIt's just also another reminder that maybe Marvel shouldn't have been so focused on introducing as many characters as possible without having consistent plans on when they become relevant in the MCU again.",
            "Alex Fan Fiction Perez\n\nMy Time To Scam Hello",
            "In the Ultimate run, Norman is killed in an attack orchestrated by the Maker’s group and Harry becomes the Goblin instead.",
            "Yo, DC Fandome is coming back!",
            "Actually, I see Blade come up more over there, and with more positive context. He rarely comes up in comics subs (right now, r/comicbooks is mostly complaining about Marvel's \"red band\" gimmick for the new mini-series) and half of the MCU Blade discourse is about how \"it's never coming out\" and \"just cancel it already.\"\n\nHe's a comic book character but not in the same vein (ha) as your typical superhero, and seems to be much more aligned with horror fans. He was originally created for Marvel's horror comics and not their superhero ones, after all. A lot of fans of the Snipes movies probably don't even know it's a Marvel movie.",
            "Oh you talk about the poster with the flying guy above Deadpool and Wolverine ?",
            "What about SM4? And every other movie that needs to come out b4 this film?",
            "> I don't think it's a sign that he's stepping down.\n\nI mean...\n\n\n > And given Ali is filming a different movie right now, I'd say he's got one foot out the door.\n\nI agree with your other point, but, as the kids would say:  This you?",
            "That’s a good analysis, I’ve always gravitated towards Arcade being the first villain, idk why.",
            "Oh definitely, he should have a lingering presence",
            "I always noticed that the months with the most Marvel news are July and October.  That’s how it was in 2019, 2021 and 2022. \n\nFor 2019 and 2022 it was because of Comic Con. Probably why it wasn’t like that last year or in 2020.",
            "I agree. Phase 4 should've been about setting up all of the remaining Phase 3 heroes onto new paths for this saga with some new characters being introduced and then Phase 5 can go all in on introducing new characters. \n\nPhase 2 only newly introduced the GOTG and Ant-Man while it was mainly about showing the next chapter for Cap, Iron Man and Thor and then culminated in a new Avengers movie. \n\nI honestly would've just had Shang-Chi and Yelena newly introduced in Phase 4 since they cross paths with other existing MCU heroes. Maybe Ms. Marvel too if The Marvels would still be what Captain Marvel 2 is in this scenario.",
            "+ Black Widow should have been a TV Show.\n\n+ Loki should have been a film. FATWS should have been CA4.",
            "Don’t forget gotg 3 too",
            "No chance, lol. They don't do extended promotional runs for the D+ shows. They'll definitely show a private trailer at D23 but for the public we'll have to wait till December at the earliest.",
            "Dar-Benn also held Kamala hostage. There are stills of her interrogating Ms Marvel aboard the Kree ship.",
            "Gorr, Jane and Valkyrie.",
            "Part of me thinks they really just wanted to get to Ms. Marvel but they knew they couldn’t make her a fangirl of Carol without showing Carol first. \n\nThe timing of the first movie seemed kinda last-minute too, especially as Carol wasn’t really as much as a presence in Endgame like previously thought.",
            "The longer versions of the film were probably also bad, which is mostly Dacosta's fault. For what other reason would they cut so much stuff from a film if it would have been good to begin with?",
            "Loki S1 and S2 take place outside of time. There's no \"before\" or \"after\".",
            "Clea was talking about fixing incursions. That lines up perfectly to me.",
            "I think Apatow has a pretty close style to Gunn in a way.",
            "Yeah that’s exactly what I was thinking too. A new member of the Guardians or a character they meet up on the way.",
            "wellllll they can easily make a new multi film contract for the rest of the saga!",
            "> There’s been good comics since then, but not enough consistency for anyone to pull from outside of a few characters and moments\n\nI never thought heavily about it, but yeah, there aren’t really many post-OMD runs/stories that are really in-demand to be adapted. *Superior Spider-Man* is the only run that comes to mind and even that story would probably need to be heavily condensed if it became a movie.",
            "> The ‘90s and JMS’ run are convoluted AF, and everything after One More Day is tainted by what happened in One More Day. \n\nI agree. Madame Web is what happened when you try to bring the convolutedness of 616 on screen without someone smart enough to untie the knots. Meanwhile, Ben Reilly in ATSV is purposefully written the way it is because the writing room doesn't want the baggage of Clone Saga dragging them down.\n\nEven Marvel Studios themselves knew what to do with One More Day.",
            "Ironheart is also going to be slept on. Add me to the database as well",
            "If Ali leaves, then we know this movie will likely be crap. He’s the only thing stopping it from devolving into schlock",
            "I think you're right, to an extent. Ali is clearly passionate about the project and has some ideas he wants to see executed. Whether or not those line up with Marvel's vision... I think if Ali left Marvel would just recast him and proceed with the creative team they have. Without Ali's input, they'll just make the movie they want. For better or for worse.",
            "Well most actors eventually price themselves out of the roles so that’d be a reason from business standpoint.",
            "I mean…stakes lol.  Or not so much that, be really just a thining of the herd.  We’ve got so many damn characters, it wouldn’t hurt to lose a few.  And that’s coming from someone who likes having a lot of characters.",
            "I remember reading it somewhere, back when Far From Home was releasing, and tbh, it kinda tracks, given the villains we had so far",
            "Kind of is broken already, no?\n\nYes, they got Keaton just off Birdman, so he could count as an A-list\n\nBut Gyllenhaal to me has for the longest time been in that Armie Hammer (and now Glen Powell) situation where Hollywood really wants him to be a thing more than him actually being a thing.\n\nAnd, yes, people do love Defoe and Molina, especially as these characters, but I don't really think you can call them A-listers either.",
            "I don’t think they’re pursuing those plans anymore after Morbius and Madame Web both flopped. \n\nand Feige reportedly keeps vetoing Tom Holland having any involvement in their movies.",
            ">6 months would be a pretty short turnaround time. /s\n\nhttps://i.redd.it/8kp1wqk50y7d1.gif",
            ">6 months\n\ni cant take it anymore",
            "Ha! Thx for catching that",
            "Yeah there's no way it would take that slot. But it could be a fall film, which Marvel might be more open to if Blade is delayed.",
            "I don’t think Marsden is gonna be a main character, but more similar to Lylla like I said in my theory where he only appears in flashbacks. \n\nIf that’s the case, I don’t think there would be much to cut cause Murray’s character in Quantumania was in the main narrative and not in any flashbacks or where he was only a 5-min cameo. \n\nIf my theory about Marsden only being in flashbacks somehow ends up similar to what actually happens in the film, then I don’t think they would cut much of his role since it would only be Flashbacks.\n\nAlso, not excusing Marsden at ALL, but what Marsden is in hot water for was something he did 20 years ago. Murray got in trouble for doing something pretty recent.",
            "If something like my theory comes true in the film, I can definitely see some r/shittymoviedetails memes or memes on Twitter about that tbh. Like I can see some people saying how they felt like sad but also felt like cheering for Scott’s death cause of some people not being thrilled what Marsden did.",
            "Yep. Also, after the shit he did to Lylla on Dead To Me.",
            "They already have release dates booked soon after Secret Wars' current release so I don't see them taking a break, but I think we could get the X-Men reboot to indicate the start of the MCU soft-reboot.",
            "Yep, these comments are so annoying",
            "We haven't lost Wanda.",
            "No. I don't particularly want or not want anything. But what I'm suggesting is Devil's Reign. But with Liz instead of Doc Ock.",
            "IIRC it's the same scenario with the Thomas Jane Punisher film. But the Russian villain from that film will be in D&W.\n\nIf the Snipes cameo is true, I think it'll be Snipes as Blade with slightly different sunglasses and a slightly different leather coat to be on the safe side.",
            "I've always been under the impression/assumption that they could use someone like Wesley Snipes' Blade in new projects, but they can't distribute or promote the films he originated from. Or at the very least, you're absolutely right and they can't use him, but they'd have to make some sort of special deal to use him. Like a one-time payment to New Line asking \"hey, can we use this guy in one of our movies real quick?\"\n\nI don't know, I'm sure there's certain intricacies to these rights issues that we're just never going to know about as outsiders, so I guess we'll know when we'll know, if ever.",
            "Sure they could make a Miles movie, but they wouldn’t cast him without hiring a writer, director etc. Casting traditionally happens later in the process. ",
            "2025 is already pretty packed so I think Sony would benefit from saving them for either 2026 or 2027. \n\nThis is also my speculation but Sony recently confirming themselves that Uncharted 2 is happening makes me think Tom Holland’s gonna end up filming that before Spider-Man 4.",
            "I would say 2027",
            "a potential strike year that might never happen bc of politics",
            "From the concept art, Norman kind of gives off CW Reverse Flash vibes.",
            "Why?",
            "Ageee with Eternals, Midnight, Sons, F4, and X-Men. But how would Young Avengers and Annihilators work as an AU project exactly? Also, split on Illuminati.",
            "There is something so satisfying about seeing a character like Superman done right\n\nIt just feels awesome",
            "I think they could do Ghost Rider before his solo outing. The character is popular enough to work without a solo setup. Give him the spiderman/blackptanther in civil war treatment",
            "I’d replace ghost rider with black knight so we could actually see him in action",
            "Imagine if Kripke left at the end of season 5 and others took over and continued it for 10 more seasons.",
            "She can't be in the next HG movie considering it takes place 40 years after the last movie.",
            "It's you again, my unofficial rival. /s",
            "This is a very unpopular take but I dont mind seeing Scott and Jean (or even Storm) as someone contemporary to Kamala in terms of age.\n\n What matters most is now how you portray them. You can have 30+ Cyclops with perfect actor to play it and its still ended up being terrible if you write them just the same as FoX-Men iterations.",
            "Oh ok. Well, I’ll edit my post about She Hulk then. \n\nEternals definitely needs closure or something with their arc. I think an animated show would be ideal and then have them in Secret Wars.",
            "It’s gonna be rent free till he apologizes",
            "Dude, your anti-labor and pro-insanity",
            "Yes, but when everyone talks about how he’s an awful racist and everyone at marvel hates him, it feels strange to know he was still on the payroll for millions for several years",
            ">I don’t think Peter’s identity being wiped out by magic was part of the original plan.\n\nCan you elaborate on that?",
            "I wouldn’t say Raimi’s was solely based off of 616. Just off the top of my head - the genetically altered spider (instead of radioactive) + knowing Harry and MJ in high school were inspired by Ultimate. There’s set photos you can see of Tobey and Raimi reading the Ultimate books too.",
            "> Maguire’s Spidey was the only one solely based off 616.\n\nEven then, Raimi’s Spider-Man still unintentionally had a lot in common with the Ultimate Spider-Man comics. \n\n* Peter knowing Harry and MJ in high school and not college\n* The “radioactive spider” being a genetically engineered spider, as opposed to a common house spider dosed in radiation. \n* Norman turning himself into the Goblin as an attempt to (re)create a super solider. \n* Spidey and Goblin’s origins being tied together narratively and thematically. \n* MJ being thrown off the bridge and caught instead of Gwen.",
            "I love Holland's Spidey and Homecoming is one of my top Spidey movies. But I totally think Garfield's Spidey was salvageable, especially if he joined the MCU. Garfield's Spidey showing up in Civil War would have been wild. Or even if they waited until Infinity War and had him join Banner and Tony in the fight against the Black Order in NYC. There was a lot of room for him to grow as a character and I sometimes wish we had gotten to see it. But I wouldn't trade it.",
            "honestly its just a one off out of left field one in a million casting choice a \"but what if\" my number one pick is still Tati Gabrielle",
            "Some more harsh truths:\n\n* My mom > my dad\n\n* Being nice to me > being mean to me\n\n* Rainy days > sunny days (but only sometimes, like if the rain isn't that bad and the sunny day is extra hot)\n\n* Not making fun of me > hurting my feelings 😢\n\n* Benedict Cumberbatch is good as Doctor Strange but I think other actors could have also been interesting\n\n* Cuddling my cat > cuddling my dog... just kidding. They're both equally good\n\nSorry/not sorry for these edgy, controversial takes.",
            "Then why do I keep seeing people online argue whether or not he is?",
            "[deleted]",
            "[deleted]",
            "I hope so. For the next Strange's movie I want a storyline more grounded with Nightmare as the villain. ",
            "I don't think Dr Strange will die in any Avengers movie if DS3 doesn't come out in Multiverse Saga. DS3 is definitely happening like any studio would make a sequel to an almost billion dollar movie. It's possible DS2 Post credit leads directly into Avengers movie. Also the fact that Marvel wants to bring every character back after Soft Reboot SW just to get iconic interactions of Iron Man, Prof X, Black Panther etc I really doubt they will kill DS plus Benedict has said he has no plans to stop playing Strange in the MCU. If DS3 happens after Multiverse Saga ends I hope they still bring Raimi back.",
            "😂😂😂",
            "all of the scoopers are fanfic writers except mayyyyybe RPK imo",
            "Oh, that's interesting. I could see the MCU doing that if they went the route of the recent Ultimate run.",
            "Honestly, the first Fandome was some of the most fun I've ever had in the DC space. Just this day-long convention full of trailers and presentations, and I ended up buying a few shirts and a Lego set at the end of it. 2020 was friggin' rough, through and through, but that was a *fun* day.\n\nEdit: I honestly didn't know Fandome was disliked, but I wasn't suggesting they necessarily bring it back or anything. I'm cool with whatever they choose to do, as I am with almost anything nowadays. I was just reminiscing on a solid good memory during what can only be described as the hellish past 4 years of my life.",
            ">A lot of fans of the Snipes movies probably don't even know it's a Marvel movie.\n\nBut they know its a comic book movie. Blade is great and all, but he's not a horror movie character in the same way that other horror staples are. I'm sure he is brought up by horror fans. But I doubt very many of them are unaware he's a comic book character. \n\nYes MCU fans are bitching about Blade a lot and saying just cancel it, but they're also going to be the most reliable fanbase for a Marvel Studios movie. I'm not saying horror fans can't be Blade fans, and Marvel should definitely try to appeal to them. But at the end of the day, comic nerds know a hell of a lot more about Blade and are likely more passionate.",
            "I don’t know. I feel like Marvel is still figuring all of that out. It seems like their goal is to get the Avengers movies out in 2026 and 2027. Everything else will probably release around them. I can’t imagine they’d delay A5 just to accommodate for Blade or Spider-Man 4. \n\nIf I had to guess I’d say this is what they were aiming for, although with Blade probably getting delayed again, I don’t know what’ll end up happening. \n\n2025\n* Brave New World\n* Thunderbolts\n* Fantastic Four \n* Blade\n\n2026\n* Shang-Chi 2\n* Avengers 5 \n* Spider-Man 4 (set before A5, like Ant-Man and the Wasp was set before Infinity War)\n\n2027\n* Armor Wars \n* Avengers Secret Wars \n* Uncanny X-Men (possibly 2028, idk)",
            "I guess I misused the phrase. I was referring to the production side of Blade. While Marvel is looking for a new director and has a writer, Ali is filming a different movie. He's not running the show the way some people seem to think. \n\nBut I didnt mean that Ali can't shoot Blade because he's filming something else. Just that it doesn't look like Blade is the Ali-led movie people keep saying it is. Because he's doing something else while Marvel is working on the film. I think Ali has taken a step back from the film's production. Maybe he leaves, maybe not. But I think people should prepare for the idea that this is a Marvel Studios movie, and Ali may be the star.",
            "Ms. Marvel being a Captain Marvel fan and not a Black Widow or Wanda fan never made sense in the MCU continuity.\n\nThe Captain Marvel merch in-universe inspired by her appearance in Captain Marvel made no sense either since nobody in-universe saw her.",
            "business, one of their biggest criticisms in phase 4 is that the movies are too long. personally in favor of their movies being long because the stories they wish to tell thrives off of it. Besides the shorter a movies runtime the more showings they can squeeze in within a day, translates into more money made.\n\nThe only logic I can figure out is that they noticed immediately how The Marvels tonally hearkens to the MCU movies of the Infinity Saga, so they went with runtime to go with it.\n\nAs someone who generally enjoyed The Marvels, the longer cut is defo better, for starters it’ll tell a more complete story, also benefiting characters,  Dar Benn as a character would be less one dimensional of a villain and Prince Yan would be more than a glorified cameo to please Korean fans.",
            "While true, the official Marvel timeline has s2 taking place after everything else released so far minus WI? s2 and X-Men ‘97",
            "How so? And yeah if they fastrack it till at least after this saga they can get him!",
            "It’s not that simple. Marvel moved away from these multi-film contracts for a reason. I’m sure the actors don’t like being all but forced to play the same character every year. I wouldn’t be surprised if RDJ left because he felt trapped by only playing Iron Man for years on end. Holland, Hemsworth and Cumberbatch’s contracts are being renewed on a case-by-case basis as well, so clearly they didn’t like it either. \n\nI wouldn’t be surprised if Marvel tried to lock the new X-Men cast in a multi-film contract early on since they’re going to be the face of the MCU, but that’s just a guess and is years away from actually happening.",
            "Superior is just as controversial as OMD and the Clone Saga. It requires every supporting character acting like an idiot and a ton of plot conveniences to justify Otto keeping his cover for 31 issues.",
            "I think the reason they went the multiverse route for Miles Morales’s films is cuz the entirety of Bendis’s run, he was mainly used as a crossover character, and didn’t have many of his own villains or supporting cast at the time ITSV was developed. \n\nSo they had two options, either: \n\na) do remixes of Peter’s storylines altered to work with Miles, or\n\nb) think outside the box.\n\nand they went with the latter. \n\nIt seems like Marvel is finally fixing the problem now and recognize the need to develop Miles as an individual.",
            "Maybe, idk. But that's not my point. My point is that Ali leaving doesn't mean they don't make Blade. So many people seem absolutely convinced that Blade only gets made with Ali on board. But I think its wishful thinking to assume that Marvel just drops the movie because Ali leaves. They're a billion dollar company and Blade is a popular character. If they're planning to make this movie and are going forward with a new writer and director, I don't think they'll dump the whole thing because of Ali. \n\nI think a lot of people are confusing what they think should happen with what actually will happen. Maybe Marvel should drop the movie if Ali leaves. But based on everything that's happening, I don't think they will. \n\nPeople need to wrap their heads around the idea that Blade might happen without Ali, whether or not they like it.",
            "If anyone is gonna keep on living its the literal god (small g, son) that is hanging around with the puny humans.",
            "There are different definitions of A-list. With the more serious industry version (the one with lots of money involved), Gyllenhaal is A list or close to it. High profile directors want to work with him. Studios want to work with him. With the exception of the Bernstein biopic, his name added to a project means the project will be made. He's got high profile product endorsements, etc. That's before you get to awards and his family connections.\n\nYou can fall in and out of being high status. Glen has moved up. If his projects continue to hit well, he'll stay there.",
            "> And, yes, people do love Defoe and Molina, especially as these characters, but I don't really think you can call them A-listers either.\n\nJamie Foxx is definitely A-list though.",
            "I think it’ll depend a lot on Kraven’s box office. If that film does well, I could see a Sinister Six movie starring Keaton with Kraven and Morbius making a lot of money, especially if there’s a version of Spider-Man in it.",
            "yeah like a swapping of the words or whatever though i find one far superior especially given the actors involved, too the other",
            "ironic!",
            "LMAO I didn’t think of That connection till you mentioned it.",
            "He better say “some motherfuckers are always trying to ice skate uphill”",
            "Yeah, it's hard to tell completely at this point until someone official decides to update us on BTSV's status and we start hearing more about SM4's production schedule. I do think that Spider-Man would take priority over Uncharted though, at least when comparing the two franchises' last installments.\n\nAnd the back-end of 2025 isn't as packed as the first half. If they went for an October date for BTSV, it'd basically have the whole month to itself now that The Batman II moved out of there. I'm not sure how well Tron would do when put up against it, but even so, Spider-Verse has a pretty good following itself.",
            "Another strike wouldn’t cancel another spider verse movie if they are striking, they have a good reason for it",
            "Because they are complex groups who need a fresh template to effectively explore their traumas and motivations without being encumbered by 25 movies worth of lore. ",
            "The Spidey and BP treatment in Civil War is a solid one. I’d love for Ghost Rider to be in honestlt.\n\nAlso this was the same treatment I wish they gave Wasp in Civil War upon learning she was meant to appear there suited up for the first time but was taken out to reserve her debut in AMATW, which was fine, except they ain’t used her properly since.",
            "Do we know what Black Knight is supposed to appear in next? The Blade post credit alludes to Blade appearing along with him so.. Midnight Sons is the only thing that comes to mind",
            "![gif](giphy|CCmypX3WXHrxGe0piz)",
            "For what, he made one of best whodunit in recent years and made pretty good Star Wars movie compared to what came after it.",
            "![gif](giphy|dC9DTdqPmRnlS|downsized)",
            "I dont want us to back to that drought of trailers and content",
            "[deleted]",
            "He basically had a job in name only, no real power",
            "I think him showing up in Civil War, somewhat weary and broken-hearted, could have made for some great storytelling. I understand why they wanted a clean slate, though, even though I'm not crazy about Holland's Spider-Man",
            "I don’t think guardians are coming back anytime soon",
            "Good one u/SuperCoenBros\n\nhttps://i.redd.it/jtr65konwz7d1.gif",
            "Because people have always been dumb. Frank Herbert wrote the first sequel to dune just to outwardly stated the purpose of the first book, because even back then most people did not understand some of the least subtle storytelling you can get while still being subtle. \n\nThe truth is, the story is about the danger of falling for a charismatic leader, but most people would fall for a charismatic leader. So the point of the story is lost on them, because they fall for Paul. The charismatic leader. ",
            "Because you hang out with teens because that's who you are.",
            "Why, your anti-labor rants show your insanity, workers deserve to be paid well and not have to deal with bad work conditions.",
            ">no ith not just about labor here\n\nOh, so it is, then. 'Kay.",
            "Have you been outside lately? Take a break from the internet. Go, you know, socialize and stuff. Pick up a fun new hobby.",
            "I read this like we didn’t start this fire. Dude, where do you read this shit, I am history student and I can tell you strike is more likely than that shit",
            "Same.",
            "Ngl at least RPK seems to have some sources, even though most of his scoops fell like bs to keep his patron. ",
            ">But I doubt very many of them are unaware he's a comic book character.\n\nI don't know of any polls or anything that could back this up, but I remember a lot of people being very surprised when the new *Blade* was announced. They legitimately had no idea.\n\nBlade's also not a character who has a large presence in the comics.\n\n>But at the end of the day, comic nerds know a hell of a lot more about Blade and are likely more passionate.\n\nWhen using the phrase \"comic nerds,\" are we including people who have only seen the movies? Because most MCU fans don't appear to be very knowledgeable about Blade or the Midnight Sons at all, which is probably why the scoopers are able to get away with as much misinformation as they do. Just enough interest to get the clicks but not enough familiarity to get called out—perfect for a scooper.",
            "I think Shang-Chi will be between Avengers movies.",
            "I think Avengers 5 moves to Christmas 2026",
            "Fair enough then. I agree that Marvel seems like they want to make the movie, and they wouldn't just throw it all in the garbage if Ali steps down. \n\nBut even with that said, I think it's anyone's guess just how much is or isn't Ali's hand on the wheel, but it's not like not being physically there would mean that he couldn't be involved still.\n\nWith that said, the Pearson hiring is IMO much stronger evidence to your point than him being on the set of another movie.",
            "I agree with you there, Captain Marvel was barely present at the Endgame final battle where Kamala apparently started being a huge fan of her. Unless Captain Marvel taking down that entire ship herself was enough to make her a superfan (which I doubt the recorded footage would've properly captured), I don't see how she isn't a big Black Widow fan instead.\n\nI could buy Kate Bishop's reasoning for being a big Hawkeye fan way more.",
            "This is why CM2 being SI and a civil war situation was best for me, they can have Kamala’s fandom make sense by having Carol being on earth before the SI story begins and giving them the interaction through having her join the pre-lim new avengers team Carol calls upon in the movie to assist with the final fight, they can then do this again with CA4 : BNW. In between they could be off screen interaction between Carol and Kamala and I’d still be able to buy into her fandom of her.",
            "Not sure what are you talking about. There was not criticism about phase 4 movies being too long.\n\n\nMore showings doesn't matter if people don't want to see the movie. No way home and Black panther 2 were close to 3 hour and they did well.\n\n\nLije i said The marvels was probably cut cause it wasn't good to begin with, not cause \"bussiness\"",
            "He’s done well praised comedy movies like 40 Year Old Virgin and Knocked Up but also movies that use comedy and serious matters like Funny People and The King of Staten Island. \n\nThose works from Apatow are similar to Gunn in a way IMO as Gunn is known for his sense of humor (which can be gross out humor sometimes) and serious moments balanced with comedy without the serious things holding the plot together being forgotten about (looking at you Taika!)",
            "Do you think the Fantastic Four cast got a multi film contract?",
            "look i think this si a mistake, not locking em in to a new contract screwed them, if they had done so, then they could have made Avengers 5 earlier, so in this reworking of the studio, they could say that there bringing back those contracts and telling everyone to sign theses new contracts",
            "He was definitely the third wheel n the group though. It'd be like if Vulture was esteemed character actor Bill Nighy, but Shocker 2 was Tom Cruise.",
            "well dont worry they will make sure it will not happen..... i encourage you to look up the Taft Hartley act",
            " Beyond the Spider-verse will never be cancel at any point ever.",
            "It wouldn’t cancel it but I could see them not releasing it the same year SAG and WGA have to re-negotiate their contracts again to avoid drama/prevent renewed public interest in the situation. \n\nFigure Sony might also be making Lord and Miller re-read the ethics code too, and do workplace conduct training too.",
            "Id really like a story set in the past featuring the old antman and wasp duo, right up to the point wasp gets set into the quantum realm. Maybe an animated feature film.",
            "7 in 10 Americans support unions, they already support unions \n\nhttps://www.afge.org/article/new-poll-shows-7-in-10-americans-support-labor-unions",
            "We’re in a cost of living crisis/recession with this economy, where the average citizen is more politically conscious and extra sympathetic to labor unions.\n\nSo I think they’ll get even higher support next time than they did in 2023.",
            "Oh no! Anyways",
            "If he was still getting paid, it wasn’t “in name only”",
            "EVEN in Avengers 5 or Secret Wars ?",
            "Yeah, that sadly checks out.",
            "Bro deleted all his comments 10 minutes after 💀",
            ">When using the phrase \"comic nerds,\" are we including people who have only seen the movies? Because most MCU fans don't appear to be very knowledgeable about Blade or the Midnight Sons at all, which is probably why the scoopers are able to get away with as much misinformation as they do. Just enough interest to get the clicks but not enough familiarity to get called out—perfect for a scooper.\n\nSure. But if the MCU fans all know Blade from the movies and the horror movie fans all know Blade from the movies, that still puts them on equal footing, it doesn't make horror fans automatically bigger fans. And you are much more likely to find an actual comic book Blade fan in an Marvel sub than in the horror sub. \n\nIf we're talking purely movies, then yeah either fanbase is going to be worth appealing to. But I don't think Marvel is trying to make a Blade movie to emulate the Snipes' films. So maybe they go more of a horror angle and take a risk on non-Marvel audiences. But I find it much more likely they prop up their brand and go for Marvel's Blade.",
            "I can see how Kamala became a fan from the battle of Earth but there really should be more feats of Carol on earth AFTER as well, this is why Im in full support of having SI be CM2, where we find that shes been back and forth space and earth since the snap, endgame and after it.\n\nThey could’ve done the expositio but from The Marvels as CM3 and have CM go cosmic there.",
            "hmmmm Marvel should get  out a call to Judd then asap if they want to continue it which they should! he's also not problematic from what i've seen so thats a bonus!",
            "Those multi film contracts made it seemed forced on the actors, marvel started to move away from them in 2016 or so for a good reason.",
            "Same! It actually blows my mind how this was not one of the shows they came up with for D+!! The de-aging must cost them alot I guess. Like it’s only fair they give the OG comic Avengers a chance in the forefront, esp after cutting their original flashback opening for AMATW. Another missed opportunity!",
            "[deleted]",
            "The actors have moved on",
            ">But if the MCU fans all know Blade from the movies and the horror movie fans all know Blade from the movies, that still puts them on equal footing, it doesn't make horror fans automatically bigger fans. And you are much more likely to find an actual comic book Blade fan in an Marvel sub than in the horror sub.\n\nBut what I'm saying is that this is my exact opposite personal experience. I see a larger concentration of Blade fans over there than here and they do appear to be more enthusiastic. And while you are more likely to find a comic book Blade fan in a comic book sub, that doesn't necessarily make them fans of the wider Marvel universe. They're probably more likely to be fans of other horror comics or, if we're limiting ourselves to superheroes, non-Marvel characters like Spawn.\n\n>So maybe they go more of a horror angle and take a risk on non-Marvel audiences. But I find it much more likely they prop up their brand and go for Marvel's Blade.\n\nI see significant risk on both sides of the equation. I can see a Blade movie alienating MCU audiences as well as an MCU movie alienating Blade fans. I don't know which scenario is riskier, only which I would personally prefer.\n\nEDIT: Got over my initial reluctance and decided to [test the theory.](https://www.reddit.com/r/horror/comments/1dl84l4/why_blade_cant_cut_through_development_hell/)",
            "well we should bring them back! otherwise they will do too many other projects and that dosent work imo the ONLY legitimate blockbusters should be Marvel! we need to kill all other franchises (except for maybe the disney owned ones!)",
            "The de-aging cost is my main reason for making it a fully amimated film. A film with Peggy, Howard, OG Antman and Wasp involving Hydra and the early Agents of Shield.",
            "Just stop, people support unions",
            "not the studio nor the fans",
            "What the hell, mods need to ban you like yesterday. There should be a wide variety of films especially with blockbuster, actors do other projects to work with specific filmmaker, wanting to join a franchise, and producing their own films with many actors owning their own production house",
            "*you \n\nactors have the finally say on whether or not, they come back.",
            "well who the hell wants to see a film about having a threesome for example! nobody! this is WHY marvel is declining don't you see! eliminate the competition!",
            "well but the studio can budge them into coming back! they ca incentivize them!",
            "This is why antitrust laws exist for this stupidly. Mods, do it now.",
            "There are many occasion of actors turning money down because they were done with the characters"
        ]
    },
    "[Marvel Rewatch] X-Men: Apocalypse - Rewatch Discussion Thread": {
        "title": "[Marvel Rewatch] X-Men: Apocalypse - Rewatch Discussion Thread",
        "score": 45,
        "url": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1czk6pm/marvel_rewatch_xmen_apocalypse_rewatch_discussion/",
        "content": "This week's rewatch is  ***X-Men: Apocalypse*** (2016). Feel free to share your thoughts on what you enjoyed and didn't like. Discuss the best and worst scenes, moments, quotes, characters, or ideas that resonated with you. Or, embrace the nostalgia and engage in some lighthearted \"release day\" shitposting. Respectful discussions are encouraged, so feel free to delve into anything and everything under the sun related to the film.\n\n \n\n***X-Men: Apocalypse*** is a 2016 American superhero film directed and produced by Bryan Singer and written by Simon Kinberg from a story by Singer, Kinberg, Michael Dougherty, and Dan Harris. The film is based on the fictional X-Men characters that appear in Marvel Comics. It is the sixth mainline installment in the *X-Men* film series and the ninth installment overall. It is the sequel to *X-Men: Days of Future Past* (2014) and stars James McAvoy, Michael Fassbender, Jennifer Lawrence, Oscar Isaac, Nicholas Hoult, Rose Byrne, Tye Sheridan, Sophie Turner, Olivia Munn, and Lucas Till. In the film, the ancient mutant En Sabah Nur / Apocalypse is inadvertently revived in 1983, and he plans to wipe out modern civilization and take over the world, leading the X-Men to try to stop him and defeat his team of mutants.\n\nThe film was announced by Singer in December 2013, with Kinberg, Dougherty, and Harris attached to develop the story. Casting began in October 2014, while principal photography commenced in April 2015 in Montreal and ended in August of the same year.\n\n*X-Men: Apocalypse* premiered in London on May 9, 2016, and was released in the United States on May 27, 2016, in RealD 3D, IMAX 3D, 4DX and Dolby Cinema formats by 20th Century Fox. The film received mixed reviews from critics. A sequel, titled *Dark Phoenix*, was released on June 7, 2019.\n\n&#x200B;\n\nListed below are examples of some previously ranked projects. \n\n* Tier S - Excellent - Avengers: Infinity War\n* Tier A - Very Good - Black Panther\n* Tier B - Good - Ant-Man\n* Tier C - Average - Black Widow\n* Tier D - Acceptable -The Incredible Hulk\n* Tier F - Unacceptable -Thor: The Dark World\n\n[**To see our current project tier ranking, including where X-Men: Days of Future Past ended up, click here.**](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie_tiers/)\n\n**What would your rank** ***X-Men: Apocalypse*****?**\n\n[View Poll](https://www.reddit.com/poll/1czk6pm)",
        "num_comments": 59,
        "comments": [
            "I’m considering watching this. After my X-Men 97 high, I was wrestling with the fact that I hadn’t seen the last few Fox X-Men movies. \n\nMe? A lifelong X-Men fan has skipped several live-action films? How could I truly let this be? Sure, the reviews had turned me away but I love the X-Men and have to see for myself. \n\n15 minutes into Dark Phoenix, I was rudely reminded of why I had abandoned the Fox X-Men universe, with few exceptions. There’s a lot that feels off but the way Mystique takes center stage is just bizarre as a longtime fan. Primarily because it doesn’t feel natural to the story, rather you can tell it’s a star power thing.\n\nSo is Apocalypse better?",
            "Some action scenes were really cool (especially the Quicksilver scene) and some of the performances were pretty strong, Fassbender’s being my favorite.\n\nMy big issue that the movie felt unfocused. I like when the X-Men don’t have a *sole* lead, but it felt like many of the arcs didn’t get much time to cook or get enough focus to feel satisfying. A lot of the time it feels like they’re fighting for screentime (still think the Weapon X plot was unneeded).\n\nI will say though, there were some neat brief character moments like Kurt praying for Alex or Peter joking with the others on the plane or the deleted scenes with the young cast at the mall.",
            "The action scenes where amazing in this movie especially the magneto awakening one",
            "EVERYTHING THEY BUILT WILL FALL!",
            "- Wolverine should’ve been one of the Horsemen and that’s how he gets the adamantium and comic suit/ mask in the new timeline.\nMaking him the product of the Stryker’s Weapon X program again fucks the significance of Stryker not being Stryker at the end of DoFP.\n\n- Giving the X-Men black armor that they randomly found at Alkali Lake was a braindead move. The movie was made in fucking 2016. They conveniently found a fancy black jet to go along with them too. \nThey should’ve found a way to have them wear the comic suits from the end earlier in the film.\n\n- Apocalypse was too big a threat for newbie X-Men in the 1980s. \n\n- I love that we got back to back X-Men films with musical continuity.\n\n- This was somehow a better Mummy movie than the one that came the following year staring tom cruise",
            "This movie had so much potential and they fucked it up. The way Wolverine was included really pissed me the fuck off. Why even bother with the little tease of Mystique as Stryker at the end of DOFP? Obviously, the implication was new timeline, new rules. \n\nApocalypse should’ve been the one that gave him the adamantium in this timeline. He didn’t even need to be a major character, just a horseman, handled with meticulous care to ensure he’s respected, but ensuring that the new characters get a chance to shine.",
            "This movie is rubbish, but has a couple of aspects that bring it up from F tier for me. \n\nMichael Fassbender is incredible, even if his story feels recycled. \n\nThe Quicksilver scene is fun but suffers from crazy tonal whiplash given that Havok dies in that scene. \n\nApocalypse is bad, though not as bad as Vuk. No villain is as bad as Vuk. \n\nThe best scene is the Wolverine scene, but it doesn’t make any sense with the ending of DOFP and that whole section of the movie feels inconsequential and out of no where.",
            "the horsemen should have been first class members so basically magneto, mystique, beast and alex summers\n\nI get angel is a known horseman but he's barely developed here I'd rather have him join the team",
            "There's a scene in this where magneto psychically talks to Charles and in the background Apocalypse is using his powers to put armor on archangel, full body, while psylocke stands next to him without pants. The movie has the worst costuming in the franchise the biggest issue of course being Apocalypse himself.  Sort of an ugly sonic situation:  everyone told them it was bad when it was revealed but they went ahead with it any way. The movie continues the worst I clinations of the franchise which is to include X-Men characters as like a checklist but without actually including anything meaningful about their characters or personalities.  It's especially sad when it comes to nightcrawler, who actually does look great in this, but can't come close to matching the heart alan cumming brought to the role.",
            "Uh. Jean uses the whole Phoenix thing against Apocalypse at the end, but in the next film, she dosen't seem have any of that going on until the incident with the space shuttle? Uh, ok.",
            "The biggest injustice this movie does to Apocalypse is that it makes him the first major villain a bunch of novice X-Men successfully fight back and win against. Apocalypse is literally the kind of villain that would bring together the mutant community regardless of perspective against due to his sheer power and influence. He has the ability to essentially transmute every atom in his body at will to give himself basically any ability he can imagine, he converts vulnerable mutants into his underlings in order to exercise his \"the strong willed will survive\" philosophy, and he can also interface with practically any piece of technology at his disposal with technopathy that's way stronger than the likes of Cable or Bastion\n\nThe fact that a bunch of teenagers are able to just punch him to death on their first try is such a criminal disservice to the prominence his comics counterpart would command to mutants. He is their Thanos in a lot of ways, arguably even more imposing\n\nAnd that's only one problem with this movie. It's actually baffling they took the time to use First Class as a way to address a lot of the character building and interpersonal dynamics of X-Men stories that were left out of the initial trilogy, only to hire back the guy responsible for doing away with that very personally-driven drama aspect of the books and essentally regress the films back to being a very surface level political drama with extreme emphasis on one or two characters over an ensemble, in this case Xavier and Mystique. X-Men just didn't mature in a time where all of its contemporaries learned not to treat their audience like they were too inept to understand comics and their complexities. There was one potentially really good scene on the table with Cyclops, Jean and Jubilee going to the movie theater and the arcade, establishing a really cool character moment of mutants just having fun doing things that teens do, and of course THAT was what they chose to scrap",
            "Oh man this movie is wack, Apocalypse is a boring villain, the writing is not that great, so many recognizable Mutants gets wasted especially Psylocke, and the story is so cookie cutter.\nHeck I don’t even liked the casting of Jean since it just the actress didn’t feel right for the role.",
            "This movie is the second worst thing associated with Bryan Singer.",
            "it still bothers me that quiksilver didnt tell magneto he is his son",
            "Evan Peters is thr 1 thing I enjoyed.",
            "[deleted]",
            "I liked two things:  \n1) Xavier accepting Jean's powers instead of blocking them.  \n2) Jean going full Phoenix with fiery raptor.  \nEverything else was average.",
            "Erik turning in as a good guy first in \"Days of Future Past\" then retconning it in the same movie, then saying he turned in again as a good guy just to get his family killed off so he could then be manipulated into joining Apocalypse. What did he even do alongside Apocalypse? The only thing I remember was when Apocalypse went way out of line and out of nowhere he suddenly becomes the good guy again. THAT IS THE ONLY SEQUENCE WHERE HE'S SHOWN PLAYING HIS CHARACTER.   \nNot much of an appealing movie for me.",
            "This is such an average movie, the pacing and the action scenes make it a fun watch and the third act is really entertaining but script and the whole storytelling itself is just bad imo.",
            "I didn't like how horsemans got beaten, I think they got beaten very easily. Just look at the black order in infinity war, they had very good fight scenes and didn't get easily beat after a few minutes.",
            "You had ONE JOB, Fox.\n\nSaoirse Ronan and Elle Fanning were presented on a silver platter, and you cast Sophie Turner.\n\nSuch a shame that now Ronan apparently has closed the door forever for Marvel.",
            "This is a weird movie. It has some truly brilliant moments. I mean like peak Fox X Men stuff. Quicksilver scenes, the absolutely incredible Magneto in the forest scene, the concentration camp scene, Archangel’s birth, the opening action scene, the Weapon X scene, etc. It’s all absolutely incredible stuff….\n\nbut the movie is just…. not great. it’s like a collection of S-Tier scenes wrapped up in a D or C-tier movie.",
            "This movie has some truly brilliant moments and standout performances, especially from characters like Quicksilver and Magneto. However, it leans heavily on powers, CGI, and action, overshadowing the elements that make X-Men comics compelling—character depth, personal relationships, and drama. The casting choices were generally strong and added depth to the film. However, Bryan Singer's approach to the source material was questionable; he seemed to disregard established character arcs in favor of his own vision, likely in an attempt to appeal to a wider audience. There are multitudes of iconic panels from the comics they could have lifted to adapt into iconic scenes, but they chose to ignore them all. While certain elements, like the swift dispatch of Apocalypse, felt rushed and unsatisfying, there were still memorable moments such as Quicksilver's slomo rescues, Archangel's transformation, Wolverine's cameo, and Magneto's revenge. I also appreciated Psylocke's moment and the great casting choice of Olivia Munn, who was invested in the character's backstory from the comics. However, I wished she had a larger role and joined the team, leaving her feeling underdeveloped and underutilized. Additionally, Jean Grey's transformation into the Phoenix offered a tantalizing glimpse into her power, but the buildup in 'Apocalypse' was undermined by the subsequent 'Dark Phoenix' film. Overall, while 'X-Men: Apocalypse' had its highlights, it fell short of fully honoring the rich source material, resulting in an average superhero film that lacked substance and left me feeling indifferent, and Singer's legacy tarnishes it heavily.",
            "This movie feels like a parody of the Avengers, down to the cheesy \"next time on...\" ending that is meant to make you leave happy, except the movie is so overly long that it is more like a \"THANK GOD\"",
            "Lol! The costumes at the end have a very \"assembled in a day, use once and throw away\" look to them. ",
            "This was the first one with the new cast in which they all looked like they would rather be somewhere else.   Jennifer Lawrence didn't even stay in character in the last act.",
            "Ive always thought if they actually launched even 1 or 2 of the nukes, it would be so much easier to connect Logan and Deadpool movies and create an actual AoA cinematic universe.",
            "Absolutely the most atrocious in a series of atrocious movies. Here's hoping the MCU can fix what Fox broke.",
            "I left the theater so angry.",
            "It's fun this sub is doing a rewatch but why the Fox films? This is a Marvel Studios subreddit.",
            "It's disgustingly bad, it misunderstands pretty much everything about the source material and everything about these characters we've established over the last chunk of films\n\nI'm trying to think of if it has anything good in it. The best scene in the movie is just a rehash of something great about the last film so I can't even count that. I think the only thing I actively enjoy in that film is this portrayal of Nightcrawler. I think he was cast well, even though he got nothing to do. \n\nAtleast the next movie has that animé ass fight scene on the train where they just wreck SHIT up.",
            "If you watch the Fox X-Men movies in chronological order beginning with First Class, the emphasis on Mystique makes sense. They chose to highlight her and build her character early on. Whether they should have gone down that road is up for debate. But I would think if you watch them then you would understand her character in Dark Phoenix.\n\n\nApocalypse was better to me because the big bad was closer to the comics than the random alien species villains in Dark Phoenix. Dark Phoenix was also originally planned to be two films, but the acquisition by Disney forced them to push it out. It hurt the storyline from the villains, to Quicksilver being sidelined due to scheduling conflicts. Behind the scenes Dark Phoenix was a shit show. The only likeable part of the film for me was the train scene.\n\n\nAll that to say, still don't expect Apocalypse being much better. It's basically passable when compared to other entries in the series.\n\n\nStill nowhere close to X2 or Days of Future Past or the Wolverine movies (excluding Origins of course).",
            "First class is quite good. Days of Future past is my favorite X-Men movie. Apocalypse had some cool scenes (especially the Quicksilver one) but they dropped the ball on the titular vilain and his costume design was fuckin’ awful. He looked like Ivan Ooze from the Power Rangers movies. \n\nI don’t even wanna talk about Dark Phoenix.\n\nEdit: Apocalypse should be at least Thanos Size and built in live action.",
            "the focus on Mystique reeks of studio pseudo-science with focus groups and graphs that say having star power is more important than a good movie; Jennifer Lawrence was massively popular, so this was an attempt to jump on that train.\n\n  \nLike these movies have fantastic casts, but are so terribly written.",
            "Apocalypse isn’t the best but it’s way better than Dark Phoenix imo.",
            "I honestly think Dark Phoenix is \"better\" than Apocalypse (not counting the Quicksilver scene)",
            "AND FROM THE ASHES OF THEIR WORLD... WE'LL BUILD A BETTER ONE!",
            "Big UP on the Wolverine comment. That legit pissed me off from the beginning. That tease of mystique as Stryker is meaningless and amounted to fuck all happening. \n\nI guess it does circle back to Beast’s comment about time and how it ripples, but that was a big implication that Wolverine would not be going through Weapon X.",
            "That would have made a much more interesting conflict because we already know these characters, and it would be harder for Charles and Scott to go against them since they're all people they care about, instead of only having Charles (once again) torn about Erik's choices.",
            "Does he have any lines of dialogue at all?",
            "That was explained to be psychic energy from Jean's mutation, not the Phoenix Force. Jean in the comics was also doing that before becoming Phoenix (shown in Classic X-Men #42).",
            "100% agreed. I only like specific scenes (Archangel's transformation, Wolverine cameo, Quicksilver moments and Magneto's revenge) but outside of them it's the most tasteless and lazily made film of them all",
            "Magneto was commanded to drill to China or something. You don't remember all the brown CGI smearing across the screen for 5 minutes?",
            "[deleted]",
            "Lead-up to Deadpool & Wolverine basically.",
            "We often use the Rewatches to allow the community to engage in related film discussions prior to a film release (almost like a \"catch up\"). In this case, it's Deadpool & Wolverine, so the ones we are focusing on right now are the X-Men and Deadpool Fox films now that they've established they're part of a greater Multiverse within the MCU.   \n  \nPerhaps we should add a list of the upcoming films we have scheduled whenever we do these Rewatches? I can list the reasoning for the films we've selected in the future, as well.",
            "> If you watch the Fox X-Men movies in chronological order beginning with First Class, the emphasis on Mystique makes sense\n\n\nRespectfully disagree. It makes *more* sense but it never really comes together. The post-First Class movies treat her like she's bordering on the level of Xavier/Magneto in terms of being a mutant leader/icon/symbol and challenges their authority, but the movies don't come close to justifying that in the narrative. Outside of maybe the 15 minute assassination sequence in DOFP, where she does almost seem unstoppable in a way that other mutants could be in awe of. \n\n\nThematically she's basically a stand in for comic Cyclops right? Xavier's oldest \"student,\" they have an adopted family relationship, Mystique even briefly leads the team in battle in DP, they both eventually become disillusioned with Xavier, grow out of Xavier's shadow, become mutant icons, and find a place between Xavier and Magneto's ideologies to inspire others...\n\n\nBut the thing they're missing is, Cyclops earned that in the comics after decades of earning other X-Men's respect as their team leader in battle and in Xavier's absence their leader overall. He literally was doing Xavier's job, better than Xavier, since Second Genesis. So when he levels up in importance in the 00's it's a natural progression of how things had already been going. \n\n\nThat's what makes that story work. Not necessarily the \"decades\" part, but the integral step of seeing this character functionally be the leader everyone relies on, with a skillset (leadership) that truly can rival Xavier and Magneto. \n\n\nIn this franchise Mystique isn't shown to be powerful enough to physically rival Xavier/Magneto, or enough of a team leader to make sense that everyone raises her on a pedestal. She spends most of her screentime being a loner and squabbling with people. So her continued (growing over time) prominence does come off as very forced, imo.",
            ">but the acquisition by Disney forced them to push it out.\n\nThat wasn't exactly the reason why the sequel was canned from what I've read. According to Josh Boone (director of New Mutants), the new studio head didn't want to make more prequel films after Apocalypse's reception.",
            "Idk how fake the rumor is but I think The Rock would actually make a good apocalypse. Still needs some effects but even so.\n\nI mean it’s not like we’re gonna get Daniel Day Lewis to play him so I think that’s actually promising. ",
            "I’d love to see Apocalypse played by Shaq",
            ">Apocalypse should be at least Thanos Size and built in live action.\n\nHe never anywhere near as bad as Thanos in the comics though. He was at best Marvel's version of Vandal Savage.",
            "the challenge is a lot more tougher since they are going up against a previous xmen team, this would force the rookies to come up strategies on how to beat their predecessors since they have clearly for experience than them.",
            "Agree. Personally, I didn't care for the direction they went with her character, and there was no consistent character building with her from movie to movie. It's almost like the writers just chose her to be bad or good based on how it best shoe horned into the movie. But because they did make her essentially 3rd in the character pecking order in the reboot films behind Professor X and Magneto, the role she has in Dark Phoenix isn't surprising.",
            "> Mystique\n\n\"Mutant and proud\" then goes back into human form for the majority of the prequel movies..",
            "Why? Cuz he’s big? The Rock is not a solid enough actor (read;bad) to be a villain that significant with potential to appear in multiple films.",
            "They should've gotten Christopher Judge (Teal'c on Stargate SG1) to play Apocalypse",
            "Being big is part of it. It’d be nice if we could have scenes and shots that don’t rely on effects.  Close up shots where we can actually see a real physically intimidating version of the character. \n\nAnd if you want that, there aren’t many guys with arguably legit acting experience out there. \n\nI suppose I’m also not counting on Apocalypse having as much range as someone like Magneto. I’m hoping he’s written well but being physically imposing has always been one of his defining elements. He’s pretty “stone faced” often. He’s a force of nature in a sense. \n\nMaybe there is a stronger vision for Apocalypse out there. I mean I’d choose Javier Bardem, personally. \nThen again, can Javier play Magneto instead?",
            "I think Benny Safdie's \"Smashing Mashing\" will be a good litmus test for Dwayne's dramatic acting potential.",
            "I personally think by the time they get around to live action apocalypse again, the technology should be good enough to do a cgi or mostly cgi character and can make it a voice role.",
            "They should get someone who can actually act. There are plenty of big guys who can act. And again you dont have to be big anyway to be shown big. I never once thought of Apocalypse as stone faced as he has some pretty machiavellian moments."
        ]
    },
    "Ralph Ineson says that the script for ‘The Fantastic Four’ is “cool as fuck”": {
        "title": "Ralph Ineson says that the script for ‘The Fantastic Four’ is “cool as fuck”",
        "score": 629,
        "url": "https://x.com/the_moviedweeb/status/1804194197026611417?s=46&t=S4bfAHtB3ulQCj9viG4edA",
        "content": "",
        "num_comments": 84,
        "comments": [
            "The premise sounds pretty fun. \n\nWorld famous super family fails to stop eating alien from consuming their world, flees to another version of Earth where culture is completely different and you aren’t famous at all.",
            "This sounds like a guy who thinks the script is actually \"cool as fuck.\" Not the usual \"it is a great script, and we have a great director and great cast.\" This guy sounds genuinely excited.",
            "This is the first time I’ve heard Ralph’s voice and now I totally understand why he specifically was cast as Galactus.",
            "News has been so dry lately, I guess something like this is better than nothing",
            "That's probably because the Fantastic Four, when done properly, are cool as fuck.  \n\nIt's an incredible property that's been handled abysmally in movies.",
            "I can’t wait for the headline reading: breaking news: actor says script for upcoming movie he’s in is “fucking garbage”",
            "For all the Eric Pearson haters out there. ",
            "Really hyped but trying to keep my powder dry. The enthusiasm like this and small bits of insight we've had are super encouraging though. With the recent Marvel misfires, I think they are putting a lot of care into this film, especially as the premise/cast will be around for a while so it needs to be shit hot.\n\nI must say, the casting is so good thus far, personally it's impossible not to get a bit giddy.\n\nI look forward to promo once they've filmed. It's on par next year for how much I'm looking forward to Deadpool & Wolverine this year.",
            "Ralph Ineson as Galactus? I couldn't be more excited. I've always hoped he'd go get himself some bigger roles",
            "W!",
            "I cannot wait for this movie",
            ">cool as fuck\n\nThat's also one of my answers. \n\nSo this guy and I have the same taste. \n\nSo if he loved the script, I will love it.",
            "This is sounds exciting \n\nHis sons 25, knows everything about marvel and has been teaching him the past few months?\nYh bro is about to crush this role he’s definitely been explained and showed all the cool Galactus moments.\n\nKnowing and enjoying the lore is what makes a character so authentic rather than a cardboard actor playing the role for a cheque and to go home",
            "This has to be the most anticipated for me. My FF bias aside I cannot wait to see Galactus on the silver screen",
            "Ralph Inneson is getting better and better later into his career. He voiced the Character Cid in Final Fantasy 16 that came out last year and he was fucking fantastic.",
            "I hear him saying this in Cids Voice 😅",
            "I just can’t get behind caring about any of this until I see a trailer at this point. same for blade, brave new world etc. lotta talk and rewrites. show don’t tell",
            "Galactus, bloody good rep",
            "\"Once I figured it out it became cooler than fuck\" (paraphrasing) but still..\n\nThis guy is gonna knock it outta the park.",
            "Yeah okay..",
            "I mean he’s not going to say it’s fucking shit like lol.",
            "A “cool as fuck” script would explain why we’re getting so many big names cast in, what would seem to be, small parts.",
            "![gif](giphy|pD7YIQoUwgb9cnX3FJ)",
            "GALACTUS IS NOT FROM YORKSHIRE.",
            "It’s going to be bad everything sucks",
            "Well, obviously he’s not gonna say it’s a piece of shit",
            "oh wait is that actually the plot? that sounds pretty cool",
            "The fantastic four are probably celebrities in their world with them probably being close with the Kennedys",
            "Ok this makes them being from an alternate universe sound a lot better",
            "This sounds genuinely fun.",
            "Wait, have they made me interested in seeing this film now? This actually sounds quite potentially good!",
            "Or they end up in the quantum realm or the void and it’s left on a cliffhanger for kang dynasty/secret wars or something",
            "My only problem is that it really should leave them depressed for the whole movie instead of having a fun discovering a new universe.",
            "Ralph is a top bloke and genuinely down to earth, so I share his excitement too",
            "I agree, I really think Marvel projects are a fun thing for non-pretentious actors who are actually open minded and love their job. Like, I get to make action movies about iconic characters within this sandbox of films with other super talented actors? AND it’s a big paycheck? Yeah I think I’ll sign up for that",
            "Okay, dumb question I know(I haven’t kept up with MCU news for a while now) Who is this guy playing?",
            "I agree. This isnt a generic crap.",
            "I got the opposite impression. Sounds more like he doesn't have any strong feelings on the script, so he just pulled out to most whatever compliment cause he can't say it's bad or just fine",
            "You gotta check out 'Green Knight', one of my most favorite movies of all time, bit of a slow burn tho",
            "He was an instant favorite in Assassin's Creed Black Flag and Final Fantasy XVI purely for his voice",
            "I’ll always know him from The Office, he was incredible in that and it’s always been so great to see him do well. Was thrilled to see him in The VVitch.\n\nAlso a phenomenal video game voice actor.",
            "As much as I hate it being so dry, it's good that we're not getting whole script leaks and endless fake rumors from leakers.\n\nBut Comic Con is coming then D23.",
            "Seconded.",
            "I'm only familiar with the movies. How are they cool as fuck in the comics? Genuinely interested.",
            "Dakota Johnson enters the chat.",
            "Isn’t this basically the news with blade",
            "Literally, in this case.",
            "He was great in Assassin's Creed 4",
            "Fantastic four had 1 round of rewrites",
            "Blade isn’t going to happen in the timeframe we all want it. I think they need to figure out a new angle with an actor who isn’t 60 playing an immortal",
            "The rumors make it sound extremely different",
            "[removed]",
            "Rumored to be, at least!",
            "I mean it makes all the sense in the world from the standpoint of what we've been shown (so far) \n\nI'm excited.",
            "We don't know yet.  We do know that it takes place in an alternate retro futuristic 60's since the cast announcement came with artwork  that points to that direction.",
            "This and what Jamie Taco’s arch nemesis said have me excited\n\n![gif](giphy|BPyHNCQPs3pg2WyCOq)",
            "Not dumb at all. I had to Google it and I check this place multiple times a day. Galactus",
            "You don't know much about Ralph Ineson I guess",
            "Nah this is line with him. He isn't some up his own arse actor he actually likes all this stuff, he even does a fair bit of voice acting for video games as well and does a bloody good job of it.",
            "I always forget his name, so whenever he pops up I say, \"Oh shit, it's the dad from the VVitch! 'Thomasin!'\"",
            "If they ever do a remake or sequel to Soul Reaver, Id definitely want him as an Elder God thing",
            "Ian McShane enters the chat.",
            "I mean at least she waited until after the premiere to say it lol",
            ">I think they need to figure out a new angle with an actor who isn’t 60 playing an immortal\n\nRecast with Paul Rudd?",
            "![gif](giphy|kCoIap1RrUqE1f0fKu)",
            "Your comment was removed because it did not meet our criteria for appropriate conduct. Please review the subreddit rules before continuing to engage with other users on the subreddit. Repeated violations may result in a ban.",
            "So I, uh, auditioned for Fantastic 4… and I got the part??",
            "Which one did he not like?",
            "Uhhh she dropped her agent after just the trailer dropped ",
            "Haters gonna hate. Log off.",
            "Credit for using John Candy gifs, 99% of this sub probably don't even know who that is.",
            "Mcu elseworld story taking place in retro futuristic world.",
            "Ballerina. He said the reshoots are because, [“they want to make it better. Because they have to protect it.”](https://x.com/Adam_Khan100/status/1760749582588297625?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1760749582588297625%7Ctwgr%5E2382657ae5c23154c79cd96c5a770c1f078beab4%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fscreenrant.com%2Fballerina-john-wick-spinoff-delay-ian-mcshane-response%2F)",
            "I mean that’s still better than saying anything public, most people will not notice that 💀",
            "![gif](giphy|13myk3dLB25KYE|downsized)",
            "![gif](giphy|l0HlFMJs4zzmD0cAE|downsized)",
            "![gif](giphy|jH6s9HMMi53dSdI73r)",
            "I fucking love Ian McShane haha. Most underrated actor ever. Put him in everything!",
            "[removed]",
            "He’s amazing in Sexy Beast if you haven’t already seen it",
            "Your comment was removed because it did not meet our criteria for appropriate conduct. Please review the subreddit rules before continuing to engage with other users on the subreddit. Repeated violations may result in a ban.",
            "I'll check it out!",
            "Sexy Beast is awesome"
        ]
    },
    "Benedict Cumberbatch seemingly confirms that he will be filming Avengers 5 next year.": {
        "title": "Benedict Cumberbatch seemingly confirms that he will be filming Avengers 5 next year.",
        "score": 702,
        "url": "https://x.com/jordnjnes/status/1804181087641292994",
        "content": "",
        "num_comments": 252,
        "comments": [
            "Marvel thinking they could get away without an Avengers movie for about 2 phases is wild. At least have 1-2 entries that are lowkey Avengers films like Civil War was. Captain Marvel 2 Secret Invasion could’ve totally been that movie.",
            "I'm curious to see how they end up balancing things out here. I could see them shooting stuff with Ian McKellen and Patrick Stewart - for this and what comes after - right now or in the near future, due to both of them being up there in terms of age.\n\nI guess this also indicates that they have a handle on the screenplay for whatever the movie ends up being.",
            "Would be weird if that Clea storyline happened offscreen and he’s just back like that.",
            "Very interested to see how they market an Avengers movie with how the MCU is doing right now and the lack of a clear roster. Can’t see hype building around Falcon, Carol, She-Hulk and anyone other than Strange and Spidey.\n\nOntop of that, I wonder how close in filming dates this will be to the inevitable Spider-Man 4 and Doctor Strange 3, since they are both heavily rumored to release before Secret Wars. Same for Shang-Chi 2.\n\nThat’s a lot of filming Benedict, Tom, and Simu are going to be doing.",
            "Love that he says he genuinely enjoys playing Doctor Strange and that by playing the part it allows him to bring less commercial project to fruition.\n\n\nHopefully we can see him pop up a bunch more before they retire the character.",
            "Finally! The Avengers are coming back 🤯🍷🗿",
            "Wait so that means :\n\n- Dr Strange 3 before Avengers 5\n\n- Or maybe the Incursions/Clea plot is actually a subplot in Avengers 5\n\n- Or he's just there for the Post-Credit Scene :/",
            "My hopes for the leads are as follows:\n\nSpider-Man\nDr Strange\nWolverine\nDeadpool\nBlack Panther\nThor\nCaptain America\nShang Chi\nCaptain Marvel\nMs Marvel\nDaredevil\n\n& then maybe just a couple others u could really pick anybody cuz the MCU has like 300 characters now",
            "Weren't some scoopers saying he wouldn't appear in avengers 5 but in 6.",
            "Let's gooooooooo",
            "LFG!! AVENGERS 5 HERE WE GO!!",
            "Of course this sub isn’t excited for this news and thinks it will suck! Of course \n\nNo one more miserable than you all",
            "But where is Dr Strange 3? Honestly I would much rather have that. ",
            "Nice!",
            "Dope.",
            "Hopefully secret wars will also be filmed back to back with it.",
            "Lmao what about his third Doctor Strange movie?",
            "The fact we haven’t had an Avengers style team up movie since Endgame is absolutely fucking wild imo.",
            "Hell yeah! So he's in Kang Dynasty\n\nI wonder if the rumoured Doctor Strange movie is still going to happen though.",
            "If they want to get most hype they can, they have to use Wolverine, Spiderman, Dr strange and (insert any famous mcu character here). ",
            "Comic lore nerds, do incursions have anything to do with Secret Wars? I was little when the og SW happened and don't remember, and I didn't read comics when SW2 happened.",
            "Looks like he's recovered after his long break past MoM",
            "Just get Charlize. Her costume and makeup was perfection!",
            "Dr Strange being the Nick Fury of the new avengers does make perfect sense. Though the fact DS2 ended on a cliffhanger and won't have it's own resolution is super jarring.",
            "We honestly can only speculate what Avengers 5 might look like and I enjoy reading all the theories.\n\nI’m happy Doctor Strange seems to be a central figure in it and that gets me excited. Benedict is great as Strange.",
            "But I thought this was a “grounded”, “small-scale” film?",
            "Tbh I thought that Dr.Strange and Thor wouldn't have been in Avengers 5 because off world. I imagined Dr.Strange3 and Thor5 released between Avengers5 and 6, but maybe it's not the case. \n\nThey originally said that Kang Dynasty was more grounded so I imagined a smaller team such as Cap, BP, Carol, Hulk and Shang-Chi, but maybe they want a bigger team now. \n\nRemember that this movie changed the writer, from Loveness to Waldron (who will write SW), so this movie could be more Multiversal than before.",
            "I just wanna know if Don Cheadle is in it.",
            "Sherlock. He should make more Sherlock. One can wish…",
            "We need an Avengers movie with Daredevil in it",
            "Clea as a character really needs to be explored in a different movie before being tossed into a massive ensemble like A5. \n\nI imagine most audience members are gonna see her and be like, “Who are you again and why are you here?”",
            "1 of 60 confirmed :D",
            "So we are getting A5 un May 2026?",
            "To the surprise of whomst exactly?",
            "I never realized the Marvels and Secret Invasion could have easily been one project.  And if it had been a mini Avengers movie it easily could have made 800 mill probably more",
            "I think they're afraid of doing a small scale Avengers film again after Endgame's box office, which is such a shame. Avengers 1 and 2 have aspects that you just don't get in something like Infinity War and Endgame. Now its looking like they want to reserve Avengers movies for big cross over events where mostly everyone is there. I don't think we'll be getting a smaller, more focused Avengers film again. At least not during this saga.",
            "_Avengers: Secret Invasion_, then _Captain Marvel and the Marvels_ is how they should've done that.\n\nIntro her as the team leader alongside Sam Wilson. Then you put both of them at more of an advantage for both her movie and _Captain America: Brave New World_ instead of hoping that your audience has a Disney+ subscription.",
            "Kevin Feige to Patrick Stewart and Ian Mckellen:\n\n![gif](giphy|ko8HPo4iQxcZi|downsized)",
            "It could also easily be the first act of Avengers and like IW he’s the main character but off-world for the majority of it",
            "You’re assuming they won’t just tie that storyline in with the next avengers movie.",
            "Avengers 5 would probably take place shortly after Clea finds Strange. \n\nKinda like how Infinity War opened shortly after Thanos and his crew approached the Asgardian ship at the end of Ragnarok and continued from there.",
            "Considering The Marvels essentially did a 5 minute expo dump on what should’ve been Carol’s second movie, yeah this could happen",
            "I think it'll be fully addressed in Avengers 5. I can imagine Clea as a member of The Avengers.",
            "Clea will probably be back in avengers 5",
            "It would be so fucking funny if all the Strange post credit scenes are just resolved off-screen",
            "It’s almost like they have no fucking clue what they are doing lol",
            "Somehow, Strange returned",
            "It's not like it's unusual for Dr Strange.",
            "Star Lord? Pratt is one of the biggest draws Marvel still has and Vol.3 said he would return.",
            "Am I the only one that thinks this could be an awesome idea if executed correctly? The world needs the Avengers, none of the existing heroes know what to do, and the pressure to not only save the world but also to collaborate with conflicting personalities and live up to the legacy of the first incarnation is super cool in my opinion.",
            "I'm not sold on Doctor Strange 3 coming out before Secret Wars, tbh. We haven't heard any reputable reports about it in a long time, and given how chaotic Marvel's production schedule is right now with other projects, I don't see them secretly developing an entire Doctor Strange sequel before 2026. The Strange-Clea-Incursion stuff will just lead into the opening for Avengers 5, and Strange will have his own subplot dealing with that.",
            "At this point, I see this movie being the _Avengers: Age of Ultron_ of this Saga and they do a two-part take on _Secret Wars_ that's kinda/sorta related to this but it's more of its own thing than a direct sequel. They **need** to establish an Avengers team and they should've done it sooner, but they can kinda make up for lost time if this one is a winner.",
            "The 5 leads will probably end up as: Wolverine. Spider-Man. Deadpool. Dr Strange. Wanda.\n\nWith Thor, Captain America, Captain Marvel, Hulk, Ant-Man, Shuri, Clea, and Shang Chi rounding up the roster but not as prominently featured. Their screentime would be equivalent to Bucky or Drax in Infinity War: bigger than a cameo but not a main character.\n\nWasp dies offscreen or onscreen with a fully helmeted Wasp. I wouldn't bet on the Disney Plus characters (Moon Knight, She-Hulk, Ms Marvel, Hawkeye 2) to have major roles.",
            "They just need an interesting enough story. Like world war hulk with some multiverse stuff thrown in",
            "There was that report about 5 being a take on Avengers Forever.  That could be the one off movie that brings back Chris Evans, Scarlett Johanson and RDJ.",
            "Daredevil would be a smart one to throw on the team too people love him",
            "Still can’t believe they didn’t do a smaller low stakes Avengers movie between this and Endgame, it’s genuinely insane that we have no Avengers team heading into a massive event film",
            "Hype around them *alone* wouldn’t be there, true. Now, hype around them fighting the X-Men…👀",
            "I think Falcon/Captain America could definitely build up hype. He is a beloved character. Captain Marvel probably not, though. Her last movie proved that both casual audiences and die-hard Marvel fans are pretty much done with her. I think if they center it on Spidey, Strange, Cap, Hawkeye, and Hulk, they have a good shot at getting people really excited",
            "Very true",
            "How the mcu is doing right now? You mean on the back of xmen 97 and Deadpool/wolverine about to break records? \n\nThis sub hates marvel more than anyone I’ve ever known it’s so wild",
            "Lol if the avengers line up was Falcon, She Hulk, Carol and Strange I have 0 interest. ",
            "I actually think most of the MCU actors enjoy playing their characters. While I think some performers have express some trepidation about being in the MCU at times, I do believe a lot of actors like their characters and enjoy getting a big fat check alongside it.\n\nIt just that most actors want to do stuff besides the MCU, which is why it's important for Marvel to give these actors breaks and let them do other projects.",
            "Yah after infinity war I felt his character had great potential then they f it up by sidelining him in his own movie. wish they went with Scott’s version of doctor strange 2 with the villain nightmare and strange dealing with the death of his sister.",
            "I doubt that they retire any character permanently. The entire point of the multiverse is that anyone can do anything with this franchise going forward.",
            "Benedict already said this before: he'll do avengers before going back to DS3 so definitely option 2. There's no way he'll be saying this stuff if he's just there in post credit scene.",
            "It's definitely option 2",
            "Or the Clea tease won’t pay off until after Avengers 5",
            "I feel like Wolverine or Deadpool would fit better as leads in Secret Wars instead of Avengers 5. And if the Young Avengers movie ever happens, I'm sure Ms. Marvel would be one of the main leads of that alongside Kate Bishop.\n\nHere's the most likely roster of the New Avengers:\n- Spider-Man\n- Dr. Strange\n- Captain America\n- Black Panther\n- Shang-Chi\n- Captain Marvel\n\nHere are some possible bonus members:\n- Ant-Man & Wasp\n- Thor\n- War Machine\n- Vision?\n- Hulk and/or She-Hulk?\n- Star Lord?\n- Yelena Black Widow?\n\n\nOn another note, I really hope we get to see the establishment of the Avengers Mansion in Avengers 5 as well as some connection to the Thunderbolts and the Young Avengers.",
            "Scoopers know jackshit about Dr Strange, let's be real. None of them knew anything when back in 2023 he said he'll be in a new marvel movie, they also didn't even try to include him in avengers movie roster.",
            "Scoopers know nothing now, its best to ignore them",
            "For one thing, we’ve known about this movie for about two years now. We know it’s slated for 2026. We all figured Doctor Strange would be in this. Not necessarily exciting news\n\nFor another, Marvel has done a piss-poor job getting people excited for this movie. Can’t be mad at people not… being excited",
            "This might be after that",
            "Probably happening at some point. My guess is that they use it to directly set up _Avengers: Secret Wars_ with the _Time Runs Out_ plot (kinda making it the _Captain America: Civil War_ of this story) instead of _Avengers 5_ doing that like it was originally going to. They'll give themselves a little more time, and maybe two movies for _Secret Wars_, to compensate.",
            "Why does that obviously have to come before Avengers 5?",
            "They have everything to do with Jonathan Hickman's _Secret Wars_, and the _Avengers_ comics that he wrote leading up to them.",
            "I feel like Wong fits more of a Nick Fury role so far than Dr. Strange. And speaking of Fury, I hope we get to see him again in either Avengers 5 or the Young Avengers.",
            "About the multiverse.\n\nAs I said earlier: _Avengers 5_ will be a realistic, down-to-earth movie that's completely off the wall and swarming with magic robots.",
            "Emmy-Nominated Actor Don Cheadle?",
            "No we don't. Not every character needs to be an Avenger.",
            "I would make him thee Main character.  \nBeing seriously, he is too popular to be not  used right now, but being as a temporal allly is good enough. We could see more potential interactions with spiderman.",
            "Probably November 2026 cause the article that said that Shawn Levy was in early talks said Marvel pushed the film back.",
            "They prolly thought of it as one project initially (like i choose to believe there are brilliant minds in Marvel that thought of this) but decided to split it into 2 separate things to fulfill the D+ mandate. You can picture them concluding it as a good idea to do CM2 as The Marvels instead cz then they can have Kamala go from her D+ show and straight into the movies to pair up with Carol in it, vice versa with Monica from Wandavision.\n\nBoth can still appear if CM2 was Secret Invasion too.",
            "The series already showed us why Secret Invasion would never work within the MCU. A Secret Invasion Avengers movie as the next thing after Endgame would've been a disaster.",
            "I see the vision but let’s say go with Marvel being adamant about not doing an avengers movie until Avengers 5 - they could totally have a Civil War situation where its a lowkey avengers movie with Captain Marvel : Secret Invasion in Phase 4 featuring a prelim New Avengers team to assist in the big fight and then do it again with Captain America : Brave New World in Phase 5. That’d be seeing the New Avengers team twice before Avengers 5. \n\nAs a Carol Danvers fan I am completely fine with The Marvels never happening. If they do CM3 and it features the expo dump in the Marvels as a plotline they can totally feature other characters in the story. I get needing to pair up Kamala with her the soonest they could but Carol needs to be on earth beyond Endgame first for Kamala’s massive fandom to be believeable in the first place, having Kamala be part of the prelim new avengers team in  CM2:SI and CA4:BNW helps with that.",
            "In all seriousness, I really hope Feige doesn’t commit elder abuse on them.\n\nI haven’t been getting good vibes from Feige in a long time personally.",
            "Yeah but the first act of IW was really well executed. There was 5 months in between the two movies and the story picked up at the same place than the post credit of Ragnarok. I think that not showing the Dimension and just have Clea and Strange pop out of nowhere nearly 5 years (in real time) after MoM post credit would not have the same impact. A Dr Strange 3 movie with their adventures just before A5 would be awesome.",
            "This sounds awesome. Give him a Thor-like journey and have him return in Act 3 changed and ready to turn the tide.",
            "Or third cz Secret Invasion totally should’ve been Carol’s second movie which then sees her leaving Earth at the end to deal with Dar Benn and the collapse of the Kree because of her past actions.",
            "I mean I welcome it totally. Charlize Theron with the Avengers? Im not complaining",
            "They do like to do that.  I hope not. That would be worse than the Captain Marvel treatment in EG. She literally has appeared on screen for 5 seconds and delivered a line of dialogue, it would be ridiculous to have her appear in any major way in A5",
            "It’s usually more a Captain Marvel situation ngl",
            "Pratt is the least interesting person in Guardians 2 or 3, and his movies that don't have a loved Marvel *team*, dinosaurs, or Mario to lean on underperform, just look at shit like Passengers or Garfield that were really relying on his star power alone. He isn't the draw.",
            "I personally think that we're gonna get two _Secret Wars_ movies at this point, with _Doctor Strange 3_ bridging those and _Avengers 5_. I feel like that makes more sense than doing it all in one movie when they've changed what _Avengers 5_ even is so much from what they initially had planned.",
            "We're getting 60+ characters in this, it's definitely not gonna be on the scale of Age of Ultron. \n\n> they do a two-part take on Secret Wars that's kinda/sorta related to this but it's more of its own thing than a direct sequel. \n\nThat would be the smart thing to do but it seems like they want the same director for both Avengers 5 and Secret Wars so I think that's still our 2-part culmination.",
            "I can agree with this take",
            "I don’t think Wolverine and Deadpool will be part of the 5 leads for that movie personally; I definitely think they’ll be in the movie as part of the greater team, but the 5 leads you want in an Avengers movie are the people that are going to be the Avengers moving forward and I don’t think Hugh is going to remain Wolverine after the Secret Wars run is over, unless they plan on doing exclusively Old Man Logan type of character.\n\nAnd I also don’t think Deadpool would be a longterm Avenger because you’d have to severely nerf his character’s personality and dialogue to PG-13 in every non-Deadpool movie, and while I think it’s fine for him showing up every now and then for a big thing like Secret Wars, I think it’s better for them to keep him in the R rated side and have them sprinkle in Deadpool Cameos rather than be a full fledged Avenger, and I think it harms both IP’s if you just have Deadpool in everything.\n\nMy predictions for the main roster are : Dr. Strange, Spider-Man, Shang-Chi, Sam Wilson, and Wanda\n\nwith the supporting “Avengers” being Deadpool, Wolverine, She-Hulk, Moon Knight, The Thunderbolts, The Young Avengers, plus everyone who’s left from the previous lineup i.e Thor, Captain Marvel, potentially Starlord or Rocket.\n\nand that’s before we even get to all the potential cameos.",
            "i don’t see deadpool and wolverine being big leads in avengers. i think they set shang chi up to be the biggest completely new hero to join the avengers. i’d go strange, spiderman, shang chi, carol, maybe antman/wasp, possibly shuri, and sam wilson.",
            ">The 5 leads will probably end up as: Wolverine. Spider-Man. Deadpool. Dr Strange. Wanda.\n\n\nIf these 5 characters have to lead a movie called \"Avengers,\" then that just shows how much of a fumble marvel has done setting up its newer characters. \n\nDeadpool and Wolverine are X-Men characters, Wanda and Strange should be more on the supernatural side of the mcu, and Spider-Man is a street level hero. Captain America, Captain Marvel, and maybe Thor should be the leads in this, but thanks to Marvel screwing up their project's that's not happening.",
            "That lead roster is hilarious. I hope you don't actually think that will happen",
            "I’d swap Wanda and Shang Chi. Olson doesn’t seem overly pleased with Marvel. With Marvel trying to pivot recently, it would insane if they don’t put Shang Chi into more of a prominent role with how many people have been yearning for a sequel.",
            "Captain America is definitely going to be a top 5 character in terms of screentime and importance. The rest seems plausible.",
            "What about Star Lord?",
            "Where is i Ron man",
            "why would Wolverine or Deadpool be the leads?",
            "Hugh Jackmam probably won’t participate at least not as a lead. Deadpool’s a cameo.\n\nI would say Shang Chi, Captain America, Spider-Man, Captain Marvel, Thor as leads.",
            "> that brings back Chris Evans, Scarlett Johanson and RDJ.\n\nFeels too early tbh, we haven't even gotten an Avengers movie without them. Even Fast & Furious has the patience to wait at least one installment to bring people back from the dead lmao",
            "No as the main avenger but have a decent screentime should be good enough, even better with punisher ( as crazy it sounds)",
            "I could see the New Avengers fighting either the Fox X-Men or the 838 X-Men + Illuminati. I feel like both have to factor in somehow into Avengers 5.",
            "My guy, we are talking about an Avengers movie.\nYou just named two projects that take place in other universes. One of which is confirmed to be its own thing.\n\nWe have no idea where the next Avengers movie is going. No team. No plot. No real set up like every Avengers movie before. We knew the Avengers were forming, why, and who will be in it. We met Loki. We knew Ultron and Thanos were coming. There are so many different versions of Kang (that we’ve seen be killed already) that this is different, and not in a good way.\n\nAvengers 5 is a totally different Avengers movie than before, which wouldn’t be so daunting if it wasn’t for the reasons listed above. That’s even before mentioning the reception to Phases 4+5 and gap between the last Avengers.",
            "I mean actors tend to be big kids playing pretend, sure some do it for the paycheck but others do it for the simple childhood fun of playing superhero",
            "But it makes the stakes meaningless.",
            "I would be so damn happy if we finally get Avengers Mansion after all this time. I mean, they do need a new headquarters after Endgame…",
            "Oh god I hope its not just a set up for the Avengers movie. Strange’s comic mythos is so underused! I just want a stand alone with Nightmare. And hopefully we don’t have to wait another 6 years for it",
            "Well in that case, can't either DS3 lead into Avengers SW, or the first act of ASW mostly focuses on Strange/Clea and the incursion stuff and acts as a mini DS3? I see posts acting like they're surprised and previously like no one expects Charlize to return, but the MoM stinger seems to segue right into this neatly without missing a beat, no?",
            "Feels like they’re trying to have there cake and eat it too.",
            "Why yes as well as Grammy award winner Don Cheadle.",
            "Where is this article? Nobody has even mentioned before that it already got delayed",
            "At first it seemed like they knew what they were doing by choosing to have it done as series but nobody wouldve guessed that they’d do it like THAT. Their tv show format is broken and severely flawed. They need to overhaul it if they’re thinking of making more.\n\nEither do it as a full blown tv show spanning several seasons or a trilogy of movies. Would’ve been a great sub arching arc in the Multiverse Saga whilst building upon the main bigger one with Kang. Proves they had zero direction planned and you’d think they’d do that after having gotten super lucky in the Infinity Saga.",
            "I disagree. If you knew what you were doing, then you could make it _Captain America: The Winter Soldier_ on a larger scale and with a bigger ensemble instead of \"HADURRRRR, BIG CGI FITE!\" at the end. (This also ended up being a problem with _Black Widow_, just not to the same degree.)\n\nThe problem was that _Secret Invasion_'s entire format was simultaneously overlong and undercooked. It would've been fine if they had sufficiently set the stage for it - which they started to do with _Spider-Man: Far From Home_, _WandaVision_, and potentially _The Falcon and the Winter Soldier_, and could've done throughout Phase 4 - before they completely ignored all that set-up and we got whatever it was that we ended up with.",
            "They are both rich enough and old enough they can deny any offer Fiege gives them. It won't be a problem because they will be working on their own terms, doing what they enjoy",
            "Feige is a hollywood exec, it's not got a strong track record, but I've not really seen anything to suggest he's a cunt or anything?\n\nStewart and McKellen can handle Feige anyway.",
            "You're not wrong but that's just where we're at with almost everyone. We're gonna be at 3 years since Shang-Chi's release this September and we still don't know when the announced sequel is actually coming out.",
            "I'm convinced it was meant to be Captain Marvel 2 early-on. There's heavy focus on Fury and Talos (similar to the first movie) with Talos even being killed-off and that final battle with Emilia Clarke vs. Super Skrull kinda looked like how a Captain Marvel vs. Super Skrull fight would go.",
            "God I completely forgot about Secret Invasion. I’m convinced that was planned to be a whole phase (since it would make a hell of a lot more sense than a flash in the pan D+ series) before someone at the head office gotta drunk on the idea of the multiverse",
            "I mean in terms of the movie actually establishing a team, or rather, teams. It's going to be a longer, more bloated version of _Avengers: Infinity War_, but then again, so will its follow-up(s).\n\nWith all they're doing and planning, I can't see them wrapping it all up in just two _Avengers_ movies.",
            ">are the people that are going to be the Avengers moving forward\n\nI doubt it.\n\nThe leads of Endgame were not the same leads as those of Infinity War, the overlap was not super significant.\n\nSpidey, Gamora, Starlord and Strange were 4 of the leads in IW but they weren't part of The Avengers team in Endgame. Thanos was the lead of IW but he only had a small antagonistic role in Endgame.\n\nA5 is more likely the prelude to Secret Wars and not the foundation for the next Avengers team. We won't see the proper next Avengers team until SW ends.",
            "Shuri too",
            "After The Marvels, I imagine Carol role to be super small. Probably on a sidequest to the X-Men Foxverse to find Monica before passing the mantle to her.",
            "Wolverine and Spider-Man were part of the best-selling Avengers run of all time.\n\n[https://marvel.fandom.com/wiki/New\\_Avengers\\_Vol\\_1\\_1](https://marvel.fandom.com/wiki/New_Avengers_Vol_1_1)\n\nDeadpool, Strange and Wande have all been part of The Avengers roster too.",
            "This is called the multiversal saga. Every one of them has ties to the multiverse. Spiderman and Dr Strange are part of Secret Wars. I suspect Wanda will be a nexus being.  \n\nI also think that Wanda will not start out as an avenger. It is likely that Kang or more specifically Immortus will want her powers so he will seek her out.",
            "Besides Deadpool all of these guys have been or are avengers , and even Im unsure if Deadpool has been an avenger",
            "Putting the most popular MCU characters as the leads of the big crossover event film is natural. Remember that Disney is a for-profit company.\n\nThey were all part of The Avengers roster in the comics too. Wolverine joined The Avengers over 20 years ago. Wolverine as an Avenger predates the MCU.\n\nWho do you think they'll put as the lead? Carol? Sam? lol LMAO even.",
            "Elizabeth Olsen has constantly said that she wants to come back. She just wanted to take some time off to do other things. It would be insane not to bring Wanda back and a lot of people want a solo movie for Wanda as well.",
            "An all-male main roster is not happening. Wanda is the most popular female MCU character.",
            "I think people are playing up her supposed disdain with marvel s bit too much",
            "Add Shuri there",
            "Steve Rogers? I imagine he'll be back for Secret Wars but not for A5.",
            "Who?",
            "Forgot about him. I guess he will be a supporting character, maybe some scenes with Thor.",
            "Plus the new Guardians team!",
            "What about him? He's not an Avenger and is the least interesting character in his movies.",
            "Dead.",
            "Post credit scene alongside Evans Cap to tease Secret Wars.",
            "[https://www.forbes.com/sites/paultassi/2024/05/23/deadpool-and-wolverine-has-set-an-all-time-pre-sales-ticket-record/](https://www.forbes.com/sites/paultassi/2024/05/23/deadpool-and-wolverine-has-set-an-all-time-pre-sales-ticket-record/)\n\nFor this reason.",
            "After The Marvels, Captain Marvel won't lead anything ever.",
            "I agree 100%",
            "Avengers 5 will be a Multiverse movie. The two projects mentioned taking place in other universes shouldn't be dismissed. They're taking place in different universes for a reason. We have about as much of an idea of where the next Avengers movie is going as we had with the previous ones at this point. We don't know if there has been any set up for it and we won't know until it releases.",
            "And that's the issue that comes with the appeal of getting to see Tobey Maguire and Andrew Garfield again. You sacrifice stakes for thrills.",
            "Stakes where meaningless when Phil Coulson came back. It’s not like death has ever stopped Marvel from bringing characters back in some form. The multiverse just gives them the easiest way to do it.",
            "With how they're going, I think that they'll do more of a _Captain America: Civil War_-type movie involving lots of characters (I added this to my previous post but then I saw your reply, so I dunno if you saw it). I think that the MCU version of the Illuminati that they've set up will factor into it.\n\nI personally imagine that Benedict Cumberbatch will be sticking around for a while, so we'll eventually get more standalone _Doctor Strange_ stories. Right now, that's not what this movie is specifically calling for.",
            "It could also be a quick fix - you could pull what _The Fast and the Furious_ did with Han and have an entire film set between the second movie and the post-credits scene.\n\nWill they do that? I'm not so sure. Probably not. But it's a fun thought.",
            "https://www.hollywoodreporter.com/movies/movie-news/marvel-eyes-shawn-levy-to-direct-next-avengers-movie-1235913871/amp/\n\nIt says in the article: \n\n“There is reason for some caution. Marvel previously — and quietly — offered the directing gig to Levy in mid-March, but at that point, the filmmaker turned it down. Scheduling was the concern at the time, as Levy is moving from various duties on Deadpool & Wolverine, which opens July 26, to the last season of Stranger Things. He is due to direct two episodes of the Netflix series, and has other exec producer duties on the show, which would take him into next year.\n\nOriginally that timetable didn’t work for Marvel, but sources say the studio has pushed the film by several months, opening the door of opportunity”\n\nSo it seems all but confirmed that it’ll be a Late 2026 release. I feel like they’re waiting to confirm it at SDCC.",
            "A trilogy of movies would just make the problems people had with the series infinitely bigger and harder to ignore. Making it a series was a blessing in disguise because now it's easier to pretend it never happened.",
            "Other than the bad CGI, that final sequence is lowkey the coolest part of Black Widow. \n\nNow that you mentioned there was a bit of set up that went unresolved in the actual show. Still, the big problem would be people turning out to be Skrulls. You can't do that in the MCU where you have extremely limited time with each character, especially now that they're cutting back on output. We all saw the reaction to Skrull Rhodey. It was either too predictable, not impactful enough, or awful character assassination because of his previous emotional moments. That's how it would be for almost every MCU character. So yeah Secret Invasion can't work in the MCU",
            "Well that’s good to hear. But I have a feeling Feige always wants his way and won’t settle no for an answer IF Ian and Patrick don’t want to come back. \n\nBut if Ian and Patrick want to come back, then that would be wonderful. Their chemistry and performances as Erik and Charles are top notch.",
            "Luckily the MCU has been set in the future for a while now so they can drag out the timeline a bit to catch us up with them",
            "Agreed, then the D+ business plan kicked in and they said ‘y knw what, lets separate them and have SI be a tv show instead’, which judging by what the show ended up being, was a massive mistake. It’s a business plan through and through. They lost on  both fronts and in the process characters suffer (Fury in SI, Carol in The Marvels) and both contributed towards MCU’s fall from grace.\n\nBoth properties, stories and characters couldve combined to make CM2 : SI. Could’ve been the Civil War movie of Phase 4 in which it will be the lowkey avengers movie of the phase. Missed opportunities all around.",
            "It’s ok. It’s really like alot of us in the fandom collectively chose to forget it happened lmao cz 6 weeks of stringing us along and for what? \n\nEven if not a whole phase, several movies could’ve worked. I understand wanting to do it as a series but never the thought process behind doing it like THAT.",
            "> With all they're doing and planning, I can't see them wrapping it all up in just two Avengers movies.\n\nIt's probably gonna be a wrap-up for a lot of the older legacy heroes and the multiverse storyline in general. Just like how Endgame ended with the newly introduced Phase 2 and 3 heroes still being active, I think a lot of the newly introduced younger heroes like Ms. Marvel will still be sticking around for much more afterwards.\n\nIdeally the newer heroes would've been properly introduced and have a whole arc throughout the saga like the main heroes in the Infinity Saga but the overall multiverse direction shifted priorities.",
            "I think Endgame is different because it was the final Avengers movie in a saga spanning over a decade and most of the lead Avengers characters died, retired or the actors themselves moved on or wanted a break.\n\nAvengers 5 is first Avengers movie in an entirely new Saga, it would be like bringing the team together in Avengers(2012) only to split them up before they have any sort of real on-screen chemistry or give viewers any reason to be invested in their relationship with each other.\n\nGamora and Starlord are prominent in IW but they are on their own team, and also IronMan, Spider-Man, Thor, Dr Strange, Hulk, Wanda, Captain America are all stars in IW and are just as prominent.\n\nand then in Endgame we still have Cap, Black Widow, Ironman, Hulk, Hawkeye and Thor at the center of it all.",
            "I kind of include her in “Young Avengers” in a way because she does associate with Ironheart and I assume she’s kind of setup like the other young counter-parts.",
            "Good thing you aren't in charge then.",
            "*Carol died on the way back to her home planet*",
            "Almost every hero, anti-hero and even some villains have been part of the Avengers at some point. There's a reason why some are more staples on the roster than others.",
            "He has! Uncanny Avengers Vol 3 I believe",
            "Deadpool, Rogue and Havoc were part of the Uncanny Avengers under Cap's leadership.",
            "Wanda is \"dead\" for now and definitely not coming back until a solo movie, if ever.  Deadpool & Wolverine might appear depending on just how deep into the Multiverse the movie goes, but they have way too little association to the rest of the universe to be leads. Dr. Strange will absolutely play a big role if not be the central character of the movie. Unfortunately, so will Spider-Man probably just because of his popularity, but he's really much better suited for Street Level stuff. I would absolutely hate him to be a major player. Captain America will, without a doubt, be a lead too.",
            "Some might not like it but Wanda is flat out more popular than Shang Chi too.",
            "Isn't she dead?",
            "No thanks, I’m not a big fan of the character.",
            "No, Sam Wilson. I don't think there's any real chance they sideline the first black Captain America in his first ever Avengers movie. Presumably after his first solo movie just dealt with the lack of Avengers and how he needs to build a new team. \n\nHe might not be top 2 like Steve was in A1 but he'll be important.",
            "Legendary Outlaw!? Guys?!?",
            "She was not even lead in The Marvels, it was Kamala",
            "That’s exactly my point. We don’t know if there’s been set up.\n\nThat’s why marketing this seems difficult right now. That doesn’t make me an MCU hater like the guy I was replying to was saying.\n\nBut to say we have as good of an idea to what this one will be as to the last is 100% not true. We don’t know what the villain(s) will look like, what the team will be, etc and it’s been 6 years. We knew for a long time who would be in the Avengers, the SHIELD was getting them together, and that Loki would be the villain. Same for Ultron.",
            "All people like me can do is hope the general audience rejects this line of thinking because jesus christ",
            "Phil Coulson came back? I thought he only appeared in Captain Marvel, but that was in the 90s.",
            "I can see them giving a lot of movies going forward the Civil War treatment with how much they need to wrap up and how little time they have to do it. It honestly seems like the perfect solution to compensate for the lack of Avengers movies in phases 4 and 5.",
            "No way that’s happening. This movie IS going be Time Runs Out — given its scale",
            "It says that originally that time frame didn’t work before they pushed the film.\n\nThis might be talking about the delay from May 2025-May 2026. It is likely that it will be release in late 2026 though.",
            "The solution would be to have all the impersonations happen relatively recently in the MCU. They had the right idea with the Skrulls being radicalized after _Avengers: Endgame_. You could also use the opportunity to justify the out-of-character actions of, say, Sharon Carter. Easy fix.",
            "I'm not concerned about the in-universe timeline, it's moreso the consistency of these character appearances in general. Has someone like Shang-Chi appeared and done much in the MCU for whatever ends up happening to him in Avengers 5/6 to be impactful?",
            "I still remember when the trades used to call SI the \"untitled Nick Fury series\". \n\nIf they really wanted a Disney+ series related to this so badly, I would've just had done a side story as a solo Fury series showing what he's been up to since AoU and how he formed S.W.O.R.D instead of everyone around him moping about him not being on Earth for a while and then save the Secret Invasion storyline for a large-scale Captain Marvel 2.",
            "Secret Wars is going to be the last Avengers film of the Multiverse saga.\n\nI can already imagine Reed, Susan, Tobey Spidey, RDJR Iron Man, and Evans CAp to have main roles in Avengers 6 even if they're absent in Avengers 5.\n\n>Avengers 5 is first Avengers movie in an entirely new Saga\n\nIt's also the second to last Avengers film in a new saga.\n\nAnd Avengers 6 Secret Wars is most likely not going to be solely about the 616 Avengers since Hickmans' SW is the template.",
            "Carol, meet Rogue",
            "one of my favorite tropes on this subreddit is when people point to a singular instance of something happening in the comics as justification for it needing to happen in the MCU\n\nanother common one we see here is “Red Hulk was part of the Thunderbolts in one run of the comics that wasn’t even all that warmly received by Thunderbolts fans, so that means he’s a series mainstay and needs to be on the MCU team”\n\nanother one is “Echo needs to gain the Phoenix Force in the MCU because it happened once in the comics even though it sucked and everyone hated it”\n\none common theme of this is that people usually use these single instances to pretend like they are integral parts of the characters",
            "Wolverine and Spider-Man were part of the best selling Avengers run. Under what standards are they not staples?",
            "How did they handle him? Im actually really curious if would even work",
            "It would be stupid not to bring Wanda back. The fact is that the new characters that they have introduced are not very popular. She is one of those major IPs that they have left and wants to hang around.",
            "Do you seriously think Wanda died at the end of Mom?\n\n>Unfortunately, so will Spider-Man probably just because of his popularity, but he's really much better suited for Street Level stuff\n\nAh yes, the \"street level\" hero that defeated 1 of Thanos' heralds and fought Thanos on an alien planet in Infinity War.\n\nWell, Titan has streets so technically Spider-Man was street level there.",
            "I don't think anyone would disagree with that. Wanda is one of the most popular MCU characters ever",
            "They left it open enough with her little magical explosion at the end of DS2.",
            "No body found = alive.",
            "Well im glad they hinge it on your answer alone lol some of us like her",
            "Kamala and Monica were the co-leads. The lead was Carol.",
            "I don't think it matters whether we know if there's been set up at this point in time. We most likely will once marketing and trailers start, and that's when it will matter. We know Kang will be the villain. And it was already reported that there won't really be a core team. Obviously, it's not the same kind of set up as the 1st Avengers, which yeah maybe would've been better. But I wouldn't say it's the complete rushed mess people are claiming it is just yet",
            "Should’ve done this with Captain America 4 or Captain Marvel 2 (with a Secret Invasion adaptation).",
            "They're supposedly doing a _Doctor Strange 3_ and it seems readily apparent that we're getting a lot of pre-_Secret Wars_ stuff in the interim between projects. I don't see them ending on the cliffhanger of the multiverse being destroyed and then whiplashing back with a ton of unrelated projects. At least with AMATW and CM, both were prequels that tied into the film - but not everything that they're doing will tie in with _Avengers_.",
            "Yea exactly, it’s actually really easy on the timeline stuff. You could get Benedict Cumberbatch, Tom Holland, Anthony Mackie, Sebastian Stan, etc, you get whatever avengers you can, and if it doesn’t make sense with their last appearance, it’s fine because you can just reveal them to be skrulls. Since some of these characters are Mia anyway, it doesn’t really mean they have to be kidnapped or murdered either. You started with a stacked cast of MCU faces, and slowly widdle them down as they are revealed to be skrulls. \n\nThe whole theme and tone of the movie would be paranoia and deception, and bam, it’s mostly done. Even lets you get cameos from dead characters by having skrulls using them to mock people or whatnot. It’s just bodysnatchers or them, it’s a tried and true formula that would be cooler with a cast of well known characters.",
            "Reed and Susan are in the Fantastic Four and have their own movie right around the corner, will they be in Secret Wars? I think Absolutely, but as like the actual leads when they’ve barely been established as characters in Universe and in real life? I don’t think so.\n\nI’d imagine they’d be involved like Black Panther in Infinity War or Ant-Man in Endgame where they’re not in the movie from the start but show up and take up a prominent supporting role later, especially considering they are likely coming from another Universe and are not established in the 616 as the Fantastic Four yet.\n\nAs for Cap and Ironman, I’m sure they’ll be in it, but what versions of them and them leading from the start again, I’m not so sure about; 616 Tony Stark is dead, 616 Captain America is old and retired or also dead(we don’t know), whatever version of these characters we get will be a variant, he will not have the same relationship with the rest of the characters we know, or possibly even the same experiences.\n\nPersonally I hope they do something different with them, nothing crazy but give us versions of IronMan and Captain America that are distinguishable from the 616’s.\n\nTobey Spider-Man I have no issue with and think would be cool but I don’t know what that means for Holland’s Spider-Man who is very much still around and considered an Avenger, having both of them on screen all the time in a non-Spider movie seems a bit much.\n\nAlso for what it’s worth I’m pretty sure Secret Wars is reportedly being split into 2 movies and likely be a two parter like Infinity War/Endgame kind of are, so we will have 3 Avengers movies in the Multiverse Saga.\n\nAs for Secret Wars I’m pretty sure it’s been said that it would adapt elements of both Hickmans and Shooters Secret Wars but like the rest of the MCU it will be its own thing.",
            "Anna Paquin's Rogue showing up with Captain Marvel's powers would be great. She never had a lot of fighting scenes in the Foxverse films.",
            "I agree with you in general, but in this instance it feels more like \"there's at least one precedent of this happening before, so it's not too entirely strange\"",
            "[removed]",
            "Because they’re always usually not associated with the avengers. Wolverine is associated with the X-Men and Spider-Man is usually associated with street-level stuff. in what world is Wolverine a staple of the avenger? like what?",
            "Oh Absolutely. I remain of the opinion that \"killing off\" Wanda instead of immediately giving her a solo movie after the success of Wandavision is easily up there as far as Marvel Studios worst decisions of all time",
            "Obviously, Wanda will come back. That's why I said \"dead.\" It definitely won't happen in an Avengers movie tho, especially not in a way that would allow her to be a lead. \n\nI didn't like that they had Spider-Man doing all that in Infinity War either.",
            "Even with a body=might be alive",
            "And I find no fault with those that like her! I’ve just never been intrigued by her character/story shown so far. But, that doesn’t mean that I’m dead set against her. If I enjoy her in BP3, Avengers, or whatever project she shows up in next, I’ll be happy to be surprised.",
            "Nah black panther needs to come back she’s not it but she’s good for her role not a lead",
            "Right. For me she's the best lead character in MCU post endgame",
            "I am simply saying that Marvel didn't even give her a sequel. She would be main  lead in Avengers 5 but will simply just standing around doing nothing remarkable just like she has done in MCU so far.",
            "It absolutely does matter whether or not there’s been set up at this point. I can link 20 videos from IGN, Cosmonaut, Jeremy John’s, people who get millions of views and they’ll title a video “Where is the MCU going” or “Problem with the MCU”. Speculation is one of the biggest driving factors for hype. The more breadcrumbs they feed us the more we speculate and the more hype builds.\n\nThe best moment in the MCU was trying to figure out where the last two stones would pop up, and how Thanos would get each stone. If they had waited until Infinity War to introduce the stones the impact would’ve been much less.",
            "I still have hope they're doing it with Cap 4\n\nSecret Invasion would never work in the MCU tho. I think The Marvels is good enough",
            "I think Spider-Man 4, Shang-Chi 2 and Armor Wars might be the movies we get in between Avengers 5 and Secret Wars. \n\nWith how much is on Marvel's plate, I don't see how they also get a Doctor Strange 3 written and directed in time to release before Secret Wars unless Secret Wars gets a massive delay.",
            "There are no reputable sources reporting a Dr. Strange 3, not so much as a peep from the trades. And if it does happen, it can easily take place on Battleworld \n\nThis is not going to be some “filler” film ala AOU, this is going to be the next major event in the MCUS",
            "Secret Wars without Reed as one of the leads would be insane.",
            "Sorry, to thwart trolls your comment has been automatically removed as your account has negative karma.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MarvelStudiosSpoilers) if you have any questions or concerns.*",
            "Wolverine being on the avengers is way more comic accurate and on brand compared to whatever they’re doing with Hulk at the moment.",
            ">in what world is Wolverine a staple of the avenger? like what?\n\nIn the world where Wolverine and Spider-Man were part of the best-selling Avengers run.\n\nBefore the MCU, the 4 more popular Avengers were Iron Man, Captain America, Wolverine, and Spider-Man. Bendis' New Avengers run sold A LOT of comics.\n\nIt was the first time in Marvel's recent history that Avengers outsold the X-Men.\n\nPS. Wolverine and Spider-Man were also part of Hickman's Avengers:\n\n[https://marvel.fandom.com/wiki/Avengers\\_Vol\\_5\\_1](https://marvel.fandom.com/wiki/Avengers_Vol_5_1)",
            "> I didn't like that they had Spider-Man doing all that in Infinity War either.\n\n**You can't be a friendly neighborhood Spider-Man if there's no neighborhood!** \n\nPeter was great in Avengers, what are you on about? He literally had a space alien costume, keeping him solely street level is a waste and removes a great tool to contrast his smaller and bigger adventures. Going to space but also being a local hero who gets cats out of trees is the interesting thing about him.",
            "> It definitely won't happen in an Avengers movie tho, especially not in a way that would allow her to be a lead.\n\nWhy not?\n\n>I didn't like that they had Spider-Man doing all that in Infinity War either.\n\nYour opinion is in the minority. \n\nEveryone cheered when Spider-Man showed up in IW and Endgame. He's Spider-Man.",
            "I think once we give her something that isn’t vengeance or mourning, people will determine if she’s a good fit or not",
            "Bro she’s the black panther. Maybe later they can pass it to her nephew when’s he old enough",
            "Dude i went into WF thinking it was gonna be really bad and that Letitia would just ruin the legacy, but she did a really good job! I actually got teary eyed multiple times. She might have had her concerns about a vaccine being made so soon but man",
            "I'll say this, even though we have no genuine clue besides the \"secret wars\" angle they'll eventually get to with this whole multiverse mumbo jumbo, I gotta say that just makes me more excited for sdcc 24 and d23 laying out the newer plan and the fact that we are just in the unknown with everything. I take it as more of a good thing than a bad thing. I don't know how we'll get to avengers 5 but I am sure as hell intrigue and will be enjoying the ride however we come to the conclusion.",
            "They already introduced this Sagas equivalent to the Infinity Stones back in 2021 with Loki(literally one of the first projects of the Saga) then expanded upon it in 6 projects so far with at least 2 more coming before Avengers 5.",
            "Anything would have been better than The Marvels! If not SI team her up with Thor and Guardians and call it Annihilators or something. Even a straight up Cap Marvel sequel would have been preferable to whatever The Marvels was meant to be. ",
            "Which is part of the reason why I think that _Secret Wars_ could be turned into two movies. They have so much on their plate and will not be able to resolve it all in time, unless they deliberately push some stuff back.",
            "I mean….they were gonna do Kang instead of Dr Doom I feel like that’s equally as insane.\n\nI still think Reed will play a massive role, I just don’t think he will be starring front and center the whole time.\n\nthe difference between Secret Wars the comic and Secret Wars MCU is they had years to establish Reed as the smartest man and a known superhero and big influence in his universe, nobody even knows who he is in the MCU.",
            "[removed]",
            "True. but still, I don’t think Wolverine should be part of the avengers at least not without being on the X-Men first.",
            "Because a story like that deserves its own movie not to be rushed and shoehorned into one with 60+ characters dealing with the Multiverse where it'll be far from the main focus",
            "100%. I wasn’t a fan of her being the Iron Man fill-in (smart, snarky comedic) in BP and her vengeance quest in BP2 didn’t resonate with me. But, I did really enjoy her scenes with Namor… felt a bit like Star Wars, like the draw to the dark side. I’d really enjoy if they explored that more in her next movie.",
            "Same! Personally I like her as Black Panther more than her brother.\n\nI guess Shuri isn't well liked on this sub.",
            "What would that be? The TVA?",
            "I wouldn't say anything. A Thor team up does sound really exciting tho, that I'd be so down for",
            "Dr. Strange was 1 of the leads in Infinity War. And nobody he interacts with knew who he was in the MCU pre-IW.\n\nIW was the first time he interacted with The Avengers outside of a 1-minute cameo in Thor 3 (and he and Thor never interact in IW anyways).\n\nMaking Reed 1 of the leads of Secret Wars is super easy. It's a Multiversal crossover film.",
            "Sorry, to thwart trolls your comment has been automatically removed as your account has negative karma.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MarvelStudiosSpoilers) if you have any questions or concerns.*",
            "Yes, but this is multiverse Wolverine. Secret Wars for me is “what crazy fan service moments can we think of”, because we’re never getting this moment ever again. I’m fairly certain MCU will go through a light reboot after this film, so if we can get a crazy avengers team with Hugh and Toby, I say why not. Let this be a celebration of all the superhero films that led to this moment.",
            "He was part of the X-Men first. Remember this is a multiversal Wolverine and not 616 Wolverine.",
            "What story? She didn't die. She doesn't need a resurrection storyline. She's alive.",
            "She needs a redemption arc and she needs to do something pretty spectacular. Putting the world back together again would be pretty spectacular. A solo movie could wrap up WandaVision and be a prologue to Wanda's story in the multiverse saga.",
            "The Multiverse",
            "They should have done loads of mini team up movies. Midnight Suns, Annihilators, something with the street level heroes. Such a missed opportunity!"
        ]
    },
    "Sony might be currently casting its live-action Miles Morales (Jeff Sneider - Hot Mic Podcast)": {
        "title": "Sony might be currently casting its live-action Miles Morales (Jeff Sneider - Hot Mic Podcast)",
        "score": 112,
        "url": "https://www.youtube.com/live/MveqtGm_kqI?si=E80tImseponOyXHi",
        "content": "Topic is at 01:16:21",
        "num_comments": 79,
        "comments": [
            "# Jeff Sneider/The Hot Mic Podcast is a Tier 3 – Somewhat Reliable Source as decided by the community.\n\nFor **Marvel**, they had a **55.77%** accuracy rate from **47** leaks that we can currently verify out of **99** total.\n\n**Overall**, they had a **62.50%** accuracy rate from **78** leaks that we can currently verify out of **175** total.\n\nLast updated: March 22nd, 2024.\n\n| [Spoiler-Verse Accuracy Database](https://docs.google.com/spreadsheets/d/1RpGBi4duCDeiXUtSh_1x15VJ67vPRZ1LWu6A3ieGTjs/edit?usp=sharing) | [FAQ](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers/sad-faq/) | [Tiers](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers/) | [Latest Recalibration](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/18jaqqk/mod_post_2023_source_accuracy_recalibration_3/) |\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MarvelStudiosSpoilers) if you have any questions or concerns.*",
            "https://i.redd.it/fu38cr40308d1.gif",
            "Did Sony realize they can make movies with protagonists now?",
            "How would you feel if Miles Morales is the Sony Universe's Spider-Man?",
            "I’d rather a 2099 film. ",
            "They should cast Jack Black as Miles",
            "Lol how do you think people would’ve felt if Miles Morales was the Spider-Man of Madame Web, and the one Ezekiel was trying to stop from being born?\n\nand Ben Parker would be replaced by Donald Glover as Jefferson Davis, with him being revealed Aaron and him are identical twins. \n\nand Mary Parker would be replaced with Rio Morales.",
            "FUCK I THOUGHT IT WAS FOR THE MCU !",
            "Phil Lord and Chris Miller need to be the James Gunn of the SSU. They need to stop fucking around because they are sitting on a goldmine.",
            "I’d rather a 2099 film. \n\nMarvel Studios is doing nothing with Oscar Isaac as Moon Knight (or Apocalypse) anyway.",
            "Why is Jonathan Majors on the thumbnail? He's way too old for the part.\n\nI figure they'll cast a 13-year old who will grow up with the role.",
            "lol if Sony somehow fucks up Miles public perception by throwing him into the SSU of all places for his first live action debut I think I might just end it all. TOM HOLLANDS PETER PARKER IS RIGHT THERE TO EVENTUALLY MENTOR MILES, IT WRITES ITSELF, AARON DAVIS AND MILES MORALES ALREADY CANONICALLY EXIST IN THE MCU",
            "A Miles solo movie will do Black Panther numbers and that’s a straight up fact",
            "Didn't Amy Pascal say there isn't going to be live-action Miles Morales until two Spidey movies?",
            "Denzel, this is your chance",
            "They also might not be \n\nA non-article",
            "I wish whoever they pick good luck. ",
            "This is what they should have been focusing on instead of all those pointless villain movies. Could have had a nice milescentric universe built up by now",
            "Could Miles Morales appear in Avengers: The Stark Dynasty?! 🤯🤯🤯",
            "I would prefer a Peni Parker film\n\n![gif](giphy|ZdgGUEmDMtWqgoRLZX|downsized)",
            "For what?",
            "Wait so it's not for the MCU?!",
            "What if miles in beyond the spiderverse ends up in a real livr action world",
            "Hopefully its Ray fisher🤞",
            "Hire shameik moore to play older Miles, like Tobey older, with the voice he can sell it and get audiences on board with the Ben 10,000 version of Miles, not like other actors who have to imitate . ",
            "I hope we don't get Miles, at least as Spider-Man, until the end, or even after, the new trilogy of Tom's films get completed, or whatever. Assuming they don't advance his story in other properties, obviously. Miles feels like a character who relies on Spider-Man existing for a good while, and should be a mature adult when Miles gets his powers.  \nIf anything, I'd rather appreciate a twist where if, Miles gets introduced sooner than later, there's something where MILES is the older Spider-Man, and tutors Peter, even though I think MCU Peter's one of the stronger Spider-Men?",
            "Cast Lucas from Stranger Things",
            "The \"Ryan Gosling plays black characters\" joke will never cease to be funny to me lmao",
            "Literally me fr",
            "I'm really confused, who is spiderman? I know about Kraven, Morbius, and Venom, but who's this jobber spiderman? Hope we can get back to the good stuff like Madame Web 2",
            "[Live Sony reaction to that information:](https://youtu.be/JL2_T6hy6D0?si=gLSE4nOVLwiLAPYk)",
            "I hope so, now its marvel turn to realize they can make a standalone movie that doesnt need to set up an entire multiverse  and future succesors",
            "You mean heroes? The protagonist of the Venom movies is Venom. The protagonist of Morbius is Morbius. Protagonist for Kraven will be Kraven. A protagonist =/= A hero.",
            "I think this isn't a spinoff",
            "[removed]",
            "It's what they should have been doing from the beginning",
            "I don't think that there's gonna be a Sony's _Spider-Man_ Universe Spider-Man at this point. It feels like they're gonna fold in with Marvel Studios for future movies and spin-offs going forward. I just have a feeling.",
            "I don't think the SSU is a definitive single 'universe' at this point. Madame Web, depending on how the director's comments were interpreted, seems to be its own thing and Kraven doesn't seem to have any direct notable ties to anything else that we know of so far. Plus, Sony went and lumped BTSV and Noir into their SSU slate from that presentation they had a bit ago, so I'm more inclined to think that the SSU is just a label for any Spider-related projects they have planned in the future.\n\nWith that being said, I think it would just be a good idea in general to bring Miles into the Sacred Timeline and have his solo film take place there rather than having it tie to something else or be set in its own universe. It's something they could very well be naturally leading up to in the MCU anyway (he was already mentioned in Homecoming and they brought back a universe-displaced Aaron Davis in ATSV).",
            "I hate it. Because it's unnecessary in an unnecessary universe, and it's a waste of a character who deserves the spotlight proper in his live action debut, and it needlessly complicates what should be a background/supporting character with less known characteristics and lore. It should always have been Tom Holland and they kinda already did make it him in a roundabout way.",
            "Bored",
            "Honestly don’t care as long as it’s good. If Lord and Miller are involved I’d choose them over the Feige’s involvement without question.",
            "Would be amazing",
            "I wouldn’t mind as long as it’s good as spider verse",
            "At least nobody will complain that a Black actor isn't playing Miles.",
            "![gif](giphy|zvOEpYIomI8XlgZz6X)",
            "Don’t get too upset yet. Jeff Sneider’s accuracy rate is abysmal lol",
            "Spider-Man 2099 starring Oscar Isaac is such a no-brainer money printing idea that Sony would never go for it",
            "Assuming you’re not joking, Majors has also been in the news lately, he was given some award for standing up in the face of adversity in the entertainment business or something like that. I didn’t watch this video but I’m assuming they bring it up",
            "EXACTLY",
            "Isn't he 40?",
            "Bruh",
            "“The man who defied a nation”",
            "I don't understand why they focus on these multiple movies with obscure characters nobody knows about, while people are clamoring for a single El Muerto movie.",
            "Don’t be so disrespectful! I believe the term you were looking for is “enhancement talent.” ;)",
            "Hear me out: these characters were never protagonists before these films (except for Venom). Therefore, they are making movies without using protagonists.",
            "You make it a .50cal and I’ll make it a congo line",
            "This.",
            "I'm trying to understand how someone could care about SSU Spidey's identity that much. Help me out. \n\nMost people dgaf about SSU so presumably they wouldn't care who SSU Spidey is. And the people who do care, presumably already like the SSU as it is when it doesn't even have a Spidey, so it getting *any* Spider-Man is just a bonus. What's the venn diagram that results in giving this much of a shit? Lol. Are you a ride or die Peter Parker fan who doesn't care about SSU except as a potential vehicle for future Peter Parker films and that's all you've been dreaming of for 15 years?\n\nNo hate",
            "Your comment was removed because it did not meet our criteria for appropriate conduct. Please review the subreddit rules before continuing to engage with other users on the subreddit. Repeated violations may result in a ban.",
            "I’m sure the MCU has been pretty good lately and not be lazy in mid 💀🙄",
            "I mean, they’ve been openly saying these villains belong to Tom Holland’s Spidey since the start. The entire goal is to cast these characters before Marvel can and force them to use them.",
            "Doubt it, they’re still making spin offs that aren’t connected to the mcu. They’re never gonna give up. 💀",
            "Sony had Bad Bunny to star in it. Could have worked to an extent. He's a huge Latin star. Made a couple wrestling appearances for WWE. Even had a WrestleMania match. He was great. \n\nSince he became busy, eventually dropped out of the movie.\n\nI honestly hope they don't do the movie.",
            "Cool, that's not how that works though",
            "It’s not being a ride or die Peter Parker fan, it’s not having faith in the SSU to do Miles (or truthfully, any character) justice. It’s about how insulting it has the potential to be for Morales as a character to finally bring him to live-action only to relegate him to a universe full of terrible movies about C- and D-list villains and risk harming the character in the eyes of the public by making him seem like “the knock-off Spider-Man in the knock-off MCU.”",
            "It's the fact that it would be the biggest wasted opportunity in the history of live action Spider-Man if they put him in that universe. It's quite frankly boring and EMPTY.\n\nLike why would you do that when Tom Holland in the fucking MCU is right there and Tom's story is gonna be about finding himself in which Miles could help him after meeting him which would be a nice flip of the script.",
            "> Are you a ride or die Peter Parker fan who doesn't care about SSU except as a potential vehicle for future Peter Parker films and that's all you've been dreaming of for 15 years?\n\nI think you just described literally 100% of SSU fans. I don't think SSU fans that haven't been wishcasting hardcore for Andrew or Tobey to return even exist. Maybe there's a few Venom only fans who don't care, but SSU as a connected universe? Yeah, we all want Parker to show up and we wanted it since Amazing 2. Miles succeeds Parker, jumping straight to Miles is batshit no matter how much I like him.",
            "I don't care how bad the Secret Invasion finale was or how much people hated The Marvels or Love & Thunder. Nothing the MCU has done reaches the lows of Morbius & Madame Web.\n\nObviously, films are subjective, so someone will reply \"Uhm, actually I thought Morbius & Madame Web were entertaining\"\n\nI don't care. Just from an objective standpoint of overall reception and success, the MCU has not stooped to the SSU's level yet. The closest they've gotten was The Marvels, but even that crossed $200 million worldwide and has a mixed/positive critic score, which is something that neither Morbius nor Madame Web can claim.",
            "It's more like they wanted to try their hand at making that _Sinister Six_ that absolutely nobody wants, which Sony have clearly cooled their jets on after seeing that nobody's interested in their stuff aside from _Venom_ and maybe _Kraven_ if they're lucky.\n\nAnd they didn't \"force\" anything. Marvel pushed for Mysterio ahead of a proposed heist spin-off with him, and Sony briefly considered going back to doing one after they made _Spider-Man: Far From Home_... Only without Jake Gyllenhaal. So who they cast has no bearing on what Marvel does.",
            "Imagine believing any of that.",
            "Lmao you guys are worried about Miles first live action... that makes 100% sense, I don't know how I didn't think of that. Yes you're right to be terrified.",
            "Exactly, like I’m sorry but if they throw the first live action Miles into the SSU of all places it’d be arguably the worst move Sony ever does with the IP and that’s saying a lot \n\nYou have fucking TOM HOLLAND leading the single most profitable iteration of Spider-Man on screen ever with a story that not only has the moving pieces to introduces Miles Morales (i mean Aaron Davis quite literally mentions his existence in that universe in Homecoming) but also narratively is in a perfect place to start bringing Miles into the play. You have a lost and alone Peter Parker struggling with his identity, it’s like the most perfect silver platter thing ever to introduce miles with this version of Peter, you can’t ask for better circumstances",
            "That makes perfect sense, I agree 100%.",
            "Cope.\n\nThe SSU is more successful than the entire MCU.\n\nMorbius was SO successful that he was released TWICE in theaters !\n\n![gif](giphy|QREPIcqvIxCZ76VHxY)",
            "I agree with all these points except I do think Secret Invasion is pretty much on par with the SSU in terms of writing/editing etc",
            "I agree but Secret Invasion came way too close for my liking. That series is the X-Men Origins: Wolverine of the MCU for me. (Which is still better than Morbius and Madame Web.)",
            "![gif](giphy|y6Inkaz7omxAk)",
            "Definitely",
            "Only thing that elevated it from being on par was the performances, imo."
        ]
    }
}