{
    "Cringe Hall of Fame Pt. 2": {
        "title": "Cringe Hall of Fame Pt. 2",
        "score": 3370,
        "url": "https://i.redd.it/s7jzl3p5oysc1.jpeg",
        "content": "This is the 2nd set of reposted memes that consistently get posted and talked about being full of cringe. Pt. 1 and Pt. 2 are being pinned, so the next time you see them, it can reported and removed quicker. \n\nThis is not to offend you guys and shit on “fun moments” in the MCU. This is to help the community. If there are other cringe moments in the MCU, or consistently repeated reposts, let me know. ",
        "num_comments": 289,
        "comments": [
            "Secret Invasion made me so mad that it doesn't exist anymore in my head canon. Worst finale ever.",
            "Out of these four the only one I disliked was the skrull transformations, just such a lazy way to display the power changes, either full blown change or leave it out.",
            "Sacrificed what for them, her imaginary children that she trapped an entire town for?",
            "Yeah I would not put the goats as the cringiest part of Love and Thunder",
            "Ralph Boehner should be on this list. 🤮",
            "As much as I love Emilia Clarke, there is no way I’m watching Secret Invasion ever again",
            "![gif](giphy|BM0i93ul1MRW8EjMHe|downsized)\n\nWhat are those in black panther movie",
            "People act like the goats were in like half the movie and had 40+ minutes of screen time when they were barely in the movie",
            "Don’t forget “black girl magic”",
            "I actually laughed at the Dr. Strange one.",
            "How has nobody mentioned \"You gotta do better, senator\"?",
            "Monica’s line wasn’t very cringe, it just didn’t make sense.",
            "Unpopular opinion: I love those goats. I laughed every time.",
            "Shuri’s “what are those?!” line is pretty cringe",
            "They need to stop trying to make Strange funny. He’s clearly not funny.",
            "The goats weren’t nearly as bad as Korg face.",
            "Natalie Portman's girlboss moment of \"Eat my hammer!\" was worse than the goats screaming.",
            "“Illiumi-what-y” still pisses me off like what were the writers thinking that is a real very well known word",
            "Dr strange 2 was such a dissapointment",
            "The goats were awesome",
            "Jane slapping Thor in the face twice was more cringe than both of these. Domestic violence is not cool and Marvel should have known better.",
            "Ralph Boner should be in Doctor Strange’s place",
            "Secret invasion was so bad. It like they read the comic book story and just decided to ignore all of it and make their own. Often I think the producers, directors and writers hate being on MCU projects and want to wrote their own stuff",
            "I had other things to say that was slightly more intelligent but I will defend this goats till the end. They really weren’t that bad. Goats are funny right now. Some of the screaming wasn’t right but overall I didn’t mind them.  And Monica? Really? Wanda didn’t sacrifice anything other than letting go of her fake children and fake husband. That’s all, the goats weren’t as bad as people want them to be",
            "Will part 3 have the elegant \"Black girl magic!\" line?",
            "I still can’t believe marvel officially got in on the screaming goats meme….10 years late",
            "Wait y’all didn’t like those scenes? Y’all must be bigoted sexists who hate strong female characters or whatever the kids are using as cope these days",
            "No offence or no means to be sexist, I'm so glad I haven't seen Ms. Marvel or The Marvels. Ms. Marvel just looked like a Love Island type series like it was a series for girls and I didn't think it was meant for a Marvel fan like me. The Marvels looked basically like a feminist film like Madame Web. Just all woman superheroes and had corny humour. Nah, that's a lot of cringe. Apparently Marvel Studios are planning to do an Avengers team where it has so many women and Falcon is the only male superhero. Wtf, they'll lose so much money if they keep at this, they'll lose all the chad nerds especially myself. I like female superheroes like Rescue, Scarlet Witch, Wasp, Valkyrie, Captain Carter, etc. But that's just out of control.",
            "Cleaning up your own mess isn’t a sacrifice",
            "I fucking hate the MCU now, its like the rest of Disney. Absolute garbage.",
            "I like the goats and I'd like them on screen again",
            "We still taking Monica’s line from wandavision out of context huh? Lmao\n\nShe’s literally just saying that anyone who was in a position where they could bring back someone they loved only later having to give that up is in an extremely tough spot and doing so is very difficult emotionally. Yes holding an entire town hostage was wrong, Monica was never condoning Wanda’s actions. Only saying that Wanda’s desperation to keep the love of her life and the new family they created around, even if through questionable means, is something she can relate to and that the people of Westview will likely never understand what Wanda is giving up by letting them go. \n\nJfc it’s not that hard to understand",
            "Bottom right was the worst moment",
            "A number of people don't reading the post is amazing",
            "That’s what Kang wanted 🤣",
            "I found the goats funny",
            "I thought the goats were really cute, but I do wish there was more to them than “hey remember that sound effect from like 10 years ago from Vine?!?”",
            "I actually love when goats scream like that, I find it pretty funny",
            "I was tired of that ancient goat meme when they did it the first time and really annoyed the second time",
            "That Wandaviaion finale hurt, especially considering where her character goes from there. I think it's weird Monica tries to excuse Wanda's actions. \n\nDon't get me wrong, as a stand alone movie, I enjoyed Multiverse of Madness but I think Wanda's character was flattened and forced to retread a previous character arc of learning to let go. How many times does Wanda have to learn to let go of her ideal life because it harms others?",
            "I feel like Ralph Boehner was just one symptom of a larger issue with the handling of expectations in the series. They built up so many mysteries without having a clear plan to resolve them satisfactorily, which left a lot of us feeling underwhelmed and disconnected from what could have been a much more cohesive storyline.",
            "Thankfully the drax arm is the only cringe thing here",
            "Goats were the Only good thing in thor 4 .",
            "Secret Invasion was an overall badly written show\nDr.Strange MoM underdelivered \nThor Love and Thunder script was weak and overdone comedy trying to recreate Ragnarok\nWandaVision overall a good show but some lame bits like that..Also not really a fan of Monica.",
            "I thought the goats were dumb at first but honestly the longer the bit went on, the funnier it got to me.",
            "The goats were fucking hilarious",
            "That WandaVision one infuriates me to no end. She sympathized with Wanda because she was also dealing with grief, despite terrorizing a town for days if not more. Cool motif, still terrorism bro. WTF?! Who wrote that garbage and expected us to just love it? I hate it so much more because the show started off so cool and different. Then it went stupid.",
            "I feel like most of this fandom doesn't get WandaVision or Monica's line. Even Wanda dismissed the attempt of comorting admitting it was all her fault.",
            "Idk you gotta be pretty tasteless to not enjoy the goats.",
            "Is the bottom right from the solo leveling live action adaptation?",
            "Why do people hate secret invasion so much? I enjoyed it tbh.",
            "I loved those goats!",
            "I loved the goats, and never saw considered anything wrong with Wanda vision. 🤷🏼",
            "[removed]",
            "[removed]",
            "I don’t care what anyone says, I will defend the Love and Thunder goats.",
            "![img](avatar_exp|125037269|bravo)\n\n1stq z>•\\~s2\\~2222°×q 1 we 21qWA 1 1••÷2○☆,• wA12wzqze12•+++2a2`~°•q3~+~`22•222•+×2!2@2!",
            "Nah the goats weren't cringe, or do you mean the whole movie",
            " The goats were the only good part of Thor 4.",
            "You can fly, just use black girl magic",
            "I quite enjoyed the goats",
            "Ok but the \"Illumi-wha-ty?\" is kinda funny.",
            "The funny thing is that Emilia Clarke isn’t even signed on for more mcu projects right? Strongest character in the entire verse and she popped up in a terrible series never to be seen again lol",
            "Goats are the GOAT and no one can take that away from me",
            "None of these are even that bad.",
            "None of these were cringe.",
            "Dude goats are awesome",
            "Goat boat was awesome",
            "The Goats were the best thing to come out of the MCU since Iron Man",
            "Ngl, I thought the goats were really funny.",
            "Gm",
            "Oh my God! How could they make a comic book movie comic booky! How dare they?!",
            "Marvel fans think this is cringe but their favorite films are gotg and thor ragnarok which inspired marvel to do this garbage.\n\nIf starlord said Illum-what-y fans we be like \"hahaha peter quill is funny\"  when half of them is saying the dumbest bullshit \n\nWalking contradictions",
            "Where’s falcons speech",
            "The goats are GOATs",
            "The goats were the best I couldn't stop laughing",
            "What I hate is that people who constantly point out MCU or other comic book movie “cringe” forget that these came from COMIC BOOKS WHICH INHERENTLY MAKES ALL OF IT CRINGE ALREADY. Time to leave the basements and get some fresh air.",
            "Same here- it was a chore and eye rolls to get through it. I just consider it some alternate universe fever dream.  \nI mean tear down the smart powerful Nick Fury they built up over 20 or whatever movies, and then tear down whatever was left of the power-scale or groundedness with that OP super skrull.  \nAnd did they kill of their one good established Skrull, Mendelssohn?  \nAnd for what?! It went nowhere. There wasn’t even a significant secret invasion.  \n  \nAn overall bigger waste than destroying all the helicarriers in TWS.  \n  \nEdit, with more Secret invasion spoilers: I totally forgot they killed off Robin Sparkles, who was literally waiting for a good moment since Avengers 1. And they had Don Cheadle and totally wasted him also.  \nIt’s so poorly done, it’s inFURYating",
            "To be fair it doesn't seem canon either since Nick Fury runs away to space after he learns not to do that in the show",
            "The irony was that same year season 3 of Star Trek: Picard came out and it pulled off a way better shapeshifter-espionage-trust nobody-conspiracy story than Secret Invasion did.\n\nSecret Invasion should have been a slam dunk, but it never even really tried to be a mystery.",
            "Inhumans is worse.",
            "To me it's just part of the tapestry that is Marvel.  The comics have their share of embarrassing stories/art/moments, and so must the MCU.",
            "Wait, you didn't like discovering that tattoos are in your DNA?",
            "I mean, in their defence, that's how Super Skrull manifests his abilities, like just one arm or leg as he needs it.\n\nStill looked shit though.",
            "I didn’t really hate the transformations themselves but that you can get all avenger powers this easily. It doesn’t make sense at all.",
            "The goats were funny and not the reason that the movie fell short.\n\nI’ll see myself out.",
            "I have severe misophonia so I had to literally skip every part with the screaming goats",
            "I'm starting to believe that line is a holdover from a much earlier version of the script because it really doesn't make sense in context and i want to believe that MCU writers aren't dumb enough to think that loss somehow justifies what Wanda did.",
            "I just see that as a line told to calm down a maniac.",
            "The people you imprisoned, stole freewill, and stole their children from, will never know the pain of you losing imaginary children. That you knew for a few weeks.",
            "I don’t think she actually believes the line, she’s basically hostage negotiating and trying to build a connection with Wanda to get her to calm down and validate her feelings…whether those feelings are “valid” or not.",
            "Well, yea... That's how I understood it too. It's bad but it does kinda make sense if you squint a bit. Let me explain how I saw it.\n\nSo, Wanda is established as this overpowered witch that can manipulate reality to have the life she always wanted. Yet, she *gives up* all that to free the people.\n\nForget that she was the one who enslaved them in the first place. In a \"might makes right\" point of view, she's actually making a sacrifice so Good can prevail in the end... right?\n\nI mean, I didn't say it was good writing but that's what I got from it.",
            "Well, yeah.  They weren't imaginary to Wanda.  One of Monica's greatest powers is her empathy.  \n\nWhat makes it \"cringe\" is taking this moment out of context of the entire rest of the series, which makes it completely clear how much weight Wanda has put into this \"fiction\".  Yes, to an outside observer it's false and relies on depriving everyone else of their own auto omu, but giving it up is literally the biggest sacrifice Wanda can make.",
            "One of the lowest point...",
            "it makes sense in a \"jesus sacrificed himself for you\" kinda way.\n\nShe saved them from all the horrible shit she doing to them.",
            "Killing vision in infinity war to save the universe, ended being reversed in front of her eyes. Whats more is her attempt and part in the overall effort to save the universe wasn’t acknowledged by everyone as much as those by the others. The event is what led Wanda to the Westview mess in the first place. Wanda’s response makes it clear that she knows they wont care even if they do know because she had made a mistake in Westview. \n\nIts easy to mistake Monica’s line to mean the Hex but this is a cinematic universe which has callbacks to previous entries too. We went from entertaining the new rockstars stretching beyond the known universe for callbacks in movies to suddenly being completely blind with one.\n\nIll die on the hill of people completely misunderstanding Monica’s line.",
            "![gif](giphy|fCY3A6JhIsxu2mk4EM|downsized)",
            "I was so excited for X-Men Quicksilver cameo in the MCU and it was reduced to a Boehner joke.",
            "Clearly this is an unpopular opinion, but I actually thought that joke worked quite well",
            "You’re wrong that was incredibly based",
            "What, you wanted more?",
            "*scream time",
            "The goats were fine. It’s too much Korg that ruined it for me.",
            "Yeah and I didn't find the goats cringe at all. In any case, what's the point of reminding everyone of things they hate other than pure negativity. I don't want to see this shit, and the fact that it's pinned by the mods tells me that I really need to get out of this toxic sub",
            "They were way overdone. People have counted - 48 screams.",
            "That’s fair. It’s accurate to think of them as an “accent of bad”, sort of like a cherry on top of an already not-so-great sundae.",
            "You’re right. He should’ve put the whole movie poster instead.",
            "Indeed, but now go and rewatch the movie. They're annoying first time, unbearable on any consecutive rewatch",
            "But it's so dumb in context, Illuminati it's not an obscure word or concept, after all it's only one of if not the most talked about conspiracy theory in our time, Stephen shouldn't be a stranger to the word.",
            "It didn't even sound clever",
            "Jesus Christ that whole segment was fucking pathetic. \n\nIf they were gonna make a commentary on political officials fucking us over, don’t gaslight us into thinking it’s anything other than money and greed. I still personally think there was some corporate meddling on that part of the show. \n\nSad part is, that’s supposed to be his “becoming Captain America” moment - and it’s just ridiculously insulting to the character and to us. \n\n“You gotta stop calling them terrorists” is another one. Maybe don’t have the character perform terroristic acts then.",
            "Some people use it to slam on Monica, rather than the situation at the time.",
            "[removed]",
            "It definitely was at the time, but with distance from 2018 I honestly find it fine now",
            "Nah that was a fun little moment between a teenage sister and her older brother. Maybe it was a little forced, but it wasn’t out of place by any means. Shuri would say something like that.",
            "No way that line was funny.",
            "And the birth of Korg's people as well...",
            "Everything about her in that movie is so awful, it’s embarrassingly bad",
            "I blocked that out",
            "Disagree - they were way overdone.",
            "[removed]",
            "As a one time joke they would've been probably fine, even if it still a bit cringe to reference a 10 year old dead and buried meme, but they just kept appearing through the movie and each time was less funny than the last one.",
            "Because that's what heroes do.",
            "No need for a part 3. I figured the top 8 should suffice for people to report, if they see these reposts.",
            "Sir, your sarcasm is showing.\n\n![gif](giphy|LOVMoi1qYWJyw)",
            "[deleted]",
            "all the people in this thread defending these moments are making me laugh like holy hell can the bar get any lower",
            "Not enslaving people is not a sacrifice, no matter what. Neither is cleaning up the mess you made for people that don't exist",
            "Also it was stated _many times_ in the show that her family are completely real and alive/sentient, so one might understand her horror at having to kill them to free the town she controlled by a horrible ACCIDENT, even though it IS obviously wrong to hold them all hostage. Also her powers were clearly driving her insane before then. It’s not black and white. She’s still in the wrong, but she’s not a complete monster like everyone else here believes.",
            "leave it to a portion of the fandom to have a level of illiteracy and blaming the material for it. Im tired of this discourse about Monica’s line. Theres a good explanation to it which people missed the first time around and will never get not because they can’t but because they don’t want to.",
            "No thanks, I'll take a Bloody mary!",
            "Alright wizard, who are you and why should I care?",
            "The goats and Zeus’s hip twist then holding his skirt as he quickly went down the steps made me laugh so fucking hard",
            "Then immediately decided to use dark magic to take try and get back the kids she’s had for a week. You know instead of actually trying to track down the white respawn of her husband",
            "Right?",
            "Hi u/Dangerous-Fan-1885,\n\nYour submission was removed because your account is less than one day old.\nIf you feel that your account is older than one day, please contact the mods.\n\nPlease try again tomorrow!\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "Hi u/Prestonthegiraffe,\n\nYour submission was removed because your account is less than one day old.\nIf you feel that your account is older than one day, please contact the mods.\n\nPlease try again tomorrow!\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "The goats weren’t exactly cringe, but they did start to wear out their welcome as the movie went on\n\nUntil they crashed into that planet.  I laughed my fucking ass off!",
            "Noobmaster, hey, It's Thor again. You know, the God of Thunder? Listen, buddy, if you don't log off this game immediately, I will fly over to your house, come down to that basement you're hiding in, rip off your arms and shove them up your butt! Oh, that's right, yes, go cry to your father you little weasel!",
            "Starlord is a goofball who left Earth as a child, Stephen has a PhD. ",
            "I mean it’s not. Strange is the serious character. Star Lord is the funny character. \n\nAnd no they didn’t. Both GOTG and Thor Ragnarok got serious when needed. No one listed when star lord grabbed the stone. No one laughed when Hela kicked the shit out of Thor.",
            "Captain America’s*",
            "[removed]",
            "u know u didnt have to watch them lmao, its supposed to be entertainment",
            "The fact that there was *no* big reveal of a character who was a skrull for as long as or nearly as long as we had known them in the mcu is wild. That was a guaranteed hit moment pretty much no matter who it was, even if was silly like Luis from Ant-Man",
            "I haven't watched Picard yet, is the Dominion somehow back?",
            "Exactly, this was just a genuine 5/10. Inhumans was so shit the guy who played Ramsey Bolton blipped off the radar lol",
            "I had friends that were so excited for the show.  The second I saw her shitty red hair in a trailer, I knew it would suck.\n\n\nWe started to watch the first episode as a group and by maybe 10 minutes in, Dan (who was hosting and was the most excited) just looked so defeated. ",
            "That's fair, I'm a bit ignorant on super skulls.  The presentation of the arm during changes was cheesy.  Maybe something more streamlined during the action would've worked or adapting something different for this media type as not everything translates well.",
            "[removed]",
            "Yes, she’s a walking goddess. I hope they find a way to nerf her. Make the powers temporary, or something",
            "I hated the movie but laughed my ass off every time the goats appeared. Kind of like with The Last Jedi... I also didn't like it, but contrary to other people, Luke's portrayal was the one thing I enjoyed.",
            "The only time I found the goats funny was when they crashed into the planet. Every other time I only thought “why are they using a dead meme from 10 years ago?”",
            "I only found the planet crash bit funny. Other than that it just felt like a bland rehash of those screaming goat memes/vines from the early 2010s. It’s like putting numerous Harlem Shake references in a Hulk movie.",
            "Hopefully, that's the case.\n\nI'll be cynical and just think that the writers were dumb enough to think our empathy for Wanda would go as far as thinking even her victims would be sympathetic towards her plight instead of, y'know, think even that doesn't justify the horror she put them through.\n\nSympathy towards characters doesn't translate well when used in a real-life context.",
            "I've seen people actually defend the point that Wanda did nothing wrong, that she's the real victim",
            "I mean, is it a justification or just a comfort",
            "These same writers would have Mark say this exact same line to Nolan regarding him leaving earth.",
            "Yep, that was my take as well. An empty platitude.",
            "Ya I feel like it’s a hostage negotiation, you hype up the psycho.",
            "The swelling music and genuine delivery make me have a hard time believing this.",
            "Placation, yes",
            "I see what you’re saying, but that’s like stroking Homelanders ego by complimenting how good he is for not slaughtering everyone for not worshiping him and being so patient",
            "I don't think it really compensates for her crimes, not when she even started becoming hostile over people trying to break her delusion.\n\nIf things had been allowed to happen naturally, Wanda might've had a super-powered meltdown over her mind not being able to keep the fantasy any longer and killed everyone. No amount of weight put on her delusion can really compare to what she was doing to innocent people *knowingly*.",
            "I... Don't think that makes it any better.",
            "> Wanda’s response makes it clear that she knows they wont care even if they do know because she had made a mistake in Westview.\n\nA mistake is when Wanda wasn't even aware of what she was doing.\n\nShe was conscious of her actions on some level since literally Episode 1, and the moment she actually *does* snap out of her delusion is followed by her threatening people into NOT making her stop pretending it's real. It stopped being excusable when Wanda put her wishes over those of innocent people to the point where they even begged her to just end their lives.\n\nTragic life or not, acknowledgement or not, expecting the people of Westview to be forgiving of her even after she robbed them of their free will to construct her ideal fantasy world is a prime example of *Protagonist-Centered Morality*. Doctor Strange 2 even showed she didn't learn her lesson, which just makes Monica's comment feel even more insensitive.",
            "Heh. Boner",
            "That to me and the mandarin twist were the most absurd misjudgments by marvel.",
            "Yes! They are the GOATs.",
            "I laughed every single time those goats screamed. Every time. Not cringe at all for me.",
            "![gif](giphy|mqiq8aY84dnqAtVlnd)",
            "[removed]",
            "Yes",
            "The moment where they had a Korg death fake out was when I knew the movie was fucked whilst watching it.",
            "I want a Korg movie",
            "I understand your feelings, but did you actually read why it was posted and pinned?",
            "I've rewatched the movie. I'm still caught off guard when arriving in the black and white world and get a chuckle out of me. Other than that? Yeah, they're annoying, but not \"ruin the movie for me\" annoying.",
            "It probably weird for him to hear a group call themselves the illuminati. An actual illuminati wouldn't call themselves that lol",
            "Let's be real here, if you had someone walk up to you and say that, would you believe them immediately?",
            "Of course he knew what the word meant, he said that as a reaction to the audacity that a group of heroes would name themselves that.",
            "He’s doing it to mock them",
            "Does the MCU have an illiluminati politically? If I was an MCU Tinfoil hatter I’d be ranting about Hydra and shield.",
            "Im sure he does. Maybe he's teasing them?",
            "I interpreted that scene as Strange mocking them, and indirectly asking for them to explain themselves. \n\nRegardless of it having been done in the actual comics, a group *literally* calling themselves the Illuminati, is borderline insane. Strange is calling them out, and waiting for clarification.",
            "I don't think that conspiracy exists in the MCU hence why he is unfamiliar with the term",
            "He was definitely mocking them, because he thinks it’s a ridiculous name.",
            "I just took it as Stephen being a smart ass.  It's in his character.",
            "Not every joke needs to be clever.\n\nAnd Strange was shocked about a group of grown heroes calling themselves Illuminati. No one would say they are a Illuminati, but there they are",
            "Hi u/SinglePringle1992,\n\nYour submission was removed because your account has negative karma and as such, is considered a troll account.\n\nThank you for understanding.\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "It was also a big meme at the time. Shuri’s 16 in Black Panther. It’s 10000% on brand for her to drop a what are those",
            "The meme was sorta dead by 2018",
            "It was almost as bad as Hulk’s dab, to me. But I never liked the “what are those” memes even in their peak",
            "Hi u/SinglePringle1992,\n\nYour submission was removed because your account has negative karma and as such, is considered a troll account.\n\nThank you for understanding.\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "I do agree that they did start to wear out their welcome as the movie went on, but I laughed by ass off when they crashed into that one planet and screamed",
            "I thought they got funnier the more they appeared and It's my favourite gag of the entire movie",
            "Damn, Thor’s into that shit",
            "I may be an autistic loser but at least I don't call others names to find my worth in life and a basement? Never seen one of them before",
            "Idk if you’re being purposefully obtuse or if you genuinely dont understand what I wrote because nowhere in my original comment did I say that “not enslaving people is hard”. So again. Listen to what I am saying. \n\nImagine your life is filled with constant pain and trauma and one of, if not the only good thing, in your life is this one person that you love more than anything. Now imagine they’re suddenly ripped away from you and you could realistically never see them again. Or even if your life isn’t a complete shit show like Wanda’s was 90% of the time imagine a loved one, someone you can’t imagine life without, dying. Then imagine that you’re presented with a magical opportunity to bring them back into your life but it’s at the expense of others. Idk about you but I’d at least be tempted to do what Wanda did, if not follow through completely. \n\nWas what she did wrong? Literally yes, no one is justifying enslaving an entire town. Should she have found a healthier and less destructive way to cope. Also yes, that’s part of the realization she makes during the arc that carried over from this show into MoM. All I am saying is that Vision was one of the few bright spots in Wanda’s life and her soulmate. She saw an opportunity to be with him again and took it. It’s not the act of freeing the town from her mind control itself being hard, it’s what would come with it. She would be losing her idealic life, her partner, and the children she made with him and have to face the reality that she would never see them again. \n\nThis is something that Monica and anyone who has had to deal with a heavy loss in their life can relate to, that’s all that was being said during that ending dialogue from Monica to Wanda.\n\nEDIT: Keep downvoting me, nerds. You're the reason why media literacy is dead",
            "They're Americans. Getting mad for stupid reasons then opening fire is traditional",
            "![gif](giphy|QbwjcQWl1smKpTrBcl)",
            "[removed]",
            "[removed]",
            "You're oversimplifying and downplaying the situation which validates my point. MoM character assassinated her. In WV in the cut storyboard she was going after Cataract, but turned away in the last moment because she moved on from Vision and doesn't want to go into the same loophole as she did before. The same happens in WV, Wanda lets go of Vision and moves on in her own life, trying to control her powers better.",
            "Oh my bad, I forgot the GOTG were in it for a minute at the beginning. That was pretty cool.",
            "Would you like me to go further than the past two days?",
            "The show was literally called falcon and the winter soldier. \n\nHad I of put captain americas speech that wouldn’t of made sense",
            "Hi u/Opposite_Argument_79,\n\nYour submission was removed because your account is less than one day old.\nIf you feel that your account is older than one day, please contact the mods.\n\nPlease try again tomorrow!\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "Is this a joke or what? \n\nWhat are u even talking about",
            "Of course; as with many things that have a beginning & an end, I thought it would get better, or at least resolve some things.  \nGot to the end (I think) and it did not get better. It’s true though, in the end I did not even find it entertaining.",
            ">!Yeno. Sorta. !<  \nSpoilered the spoiler (obviously)",
            "A rogue faction in season 3. It was great.",
            "I totally understand. I had high hopes for the show as well. I loved Inhumans as part of Agents of Shield. To see them cut Medusa’s hair for basically the whole season for seemingly no reason was egregious.",
            "I think if she had transformed into a skrull, then done it, it would've at least looked cleaner. Cgi on cgi would look better than a real person suddenly getting a singular cgi arm. Looks more like Sky High graphics otherwise.",
            "Hi u/huntetrko98664,\n\nYour submission was removed because your account is less than one day old.\nIf you feel that your account is older than one day, please contact the mods.\n\nPlease try again tomorrow!\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "I stopped playing marvel snap because of the super skrull card. Totally broken and ruins the whole game",
            "They did.  They aren't showing her anymore.  That was their solution. ",
            "It's just a silly, stupid thing they did out of storytelling incompetence, just like the giant celestial statue that is probably tilting earth's orbit for a few years now. And just like the statue it will probably be forgotten and never brought up again. As it should be, because it is utterly stupid.\n\nI think the problem is the producers, who want the strongest, bestest characters in their project - think of 5 year old boys. New superman film? Great, it will feature his cousin Tuperman, who is like the best and strongest! He can do everything superman can, plus he is a millionaire in a bat costume! And he can totally do magic and transform and shit, maybe his cape has a mind of its own, definitely a mighty hammer, it's gonna be amazing!",
            "Wanda did A LOT wrong in WandaVision. However, why was one agency so worried about Vision (a sentient weapon) while no one thought to take care of Wanda (a severely traumatized living Infinity stone)? Clint could have taken her in for a bit and given her some good family atmosphere to get better.  Pepper could have helper her out. Literally ANYONE alive at the end of Endgame could have thought for a second and went \"Someone should really see if she's ok after all this\" instead of sending her off to NJ in a Buick.",
            "What kind of confort would that even be? \"Yeah, you probably psychologically scarred these people and hate you more than anyone in the world, but don't worry, that's because they don't know you had to delete your Sims save\"",
            "It's Monica telling Wanda that she understands what this means for her, even if nobody else will see it that way.",
            "That quote wasn't intended to say that the people of Westview need to forgive her. It says that they won't understand why she did all of what she did. The people in Westview just think that she is a monster, which for what she did, she is.\n\nBut they don't see what led her to do that, the loss of Vision, the people who were supposed to be her friends not caring about her, the house she was promised not existing. The government experimenting with Vision without any type of permission or notification, the fact that the Avengers didn't care about Vision either. Not even Hawkeye tried to help her through all of that.\n\nShe lost control of her powers and created a new and happy life for her with a town of mind controlled people. She didn't want to lose it again. But at the end, she understood that what she was doing was wrong. But again, the answer of the government she protected was to kill her, not to arrest her and give her the help she needs. She was betrayed by everyone she knew, she didn't ask for forgiveness, she didn't want to acknowledge the fact that she was torturing people. When she did, she gave up on her family (once again) to end it all.\n\nBut then, the Darkhold did its own favourite thing. Twist her to the point of MoM.",
            "For me it was\n\n\nFirst time: kinda funny \n\n\nSecond time: funny \n\n\nThird time: really funny\n\n\nFourth time: kinda over it\n\n\nFifth time: this is getting old\n\n\nSixth time: ok it's annoying \n\n\nSeventh time: funniest shit I've ever seen ",
            "I loved the goats!",
            "[removed]",
            "Hi u/AutobotJessa,\n\nYour submission was removed because your account is less than one day old.\nIf you feel that your account is older than one day, please contact the mods.\n\nPlease try again tomorrow!\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "Yeah, I think that having korg actually die there would have made the movie so much better. He was a good friend to him while he was going through depression. Thor has lost so much in his life. But sometimes you need to twist the knife a little bit to motivate a character.",
            "We need Korg to meet The Thing at some point.",
            "Oh, sorry. I still haven't gotten used to the new post layout on mobile and missed the text portion of the post",
            "I mean the OG Illuminati did.",
            "Yeah he has every right to be surprised, nobody’s calling themselves that usually",
            "Exactly what I thought. He was mocking them.",
            "Even in the comics the name is a mockery tony made. They themselves didn't used to call themselves that.",
            "I wish Micheal Waldron would just tell the world \"he was mocking the name\" so this argument can be put to rest.",
            "Very brave when they weren't even present, he said that to Christine.",
            "It’s pretty clear general audiences didn’t catch that the Illuminati wasn’t meant to be some hyper- intelligent Avengers, but actually a group of morons who think they’re better than everyone.",
            "Doesn't he say that to Christine?",
            "I think it was 2 years old by the time black panther came out tho",
            "Definitely was a dated meme by the time the movie came out",
            "There was one time my brother transformed himself into a snake...",
            "She could still create the hex outside of vestview",
            "Hi u/SinglePringle1992,\n\nYour submission was removed because your account has negative karma and as such, is considered a troll account.\n\nThank you for understanding.\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "Hi u/SinglePringle1992,\n\nYour submission was removed because your account has negative karma and as such, is considered a troll account.\n\nThank you for understanding.\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "I mean she does choose to use dark magic even after realizing it’s her fault at the end of the series. While I didn’t expect her to go full evil, it was being set up",
            "are u slow or did u just not read his comment?",
            "Also, they didn’t exactly work out the proportions on the arm. It literally didn’t fit.",
            "Lmao this is THE FIRST time i ever saw someone complaining about super skrull in snap",
            "Superskrull is hardly a consistent treat in snap. There are some rounds where he can be clutch, but not to an extent I/most players/the developers deem as problematic. Its hardly ever played",
            "Super skrull has basically never ever been a meta card. Its a counter card that only works against a specific archetype. If you took months to build the perfect ongoing deck, you shouldve taken a moment to realize that rogue and enchantress exist. Echo is available as well",
            "You asked me to stay, I'm staying!",
            "I mean if she believed they were her sim save that sure does sound like it would be stupid huh",
            "It's easy to make fun, but this wasn't just a simulation.  Wanda can literally remake reality.    For all intents and purposes *it WAS real*, and giving it up was no less real than it would be for anyone to sacrifice their own children.",
            "Yup, exactly. Other guy went right back to calling them sim saves since thats how others might see it",
            "Finally someone actually gets it.",
            "I had a high school teacher who would tell us the same bad jokes over and over. When someone pointed out that he only had three bad jokes, he was like, \"yeah, but there's a cycle to humor. The tenth time I tell these jokes, they'll be hilarious again\"",
            "That is the foundation of many of the jokes on Family Guy.",
            "Did Pickle Rick show up during the seventh time?",
            "Hi u/SinglePringle1992,\n\nYour submission was removed because your account has negative karma and as such, is considered a troll account.\n\nThank you for understanding.\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*",
            "How many catchphrases have there been?",
            "Thank you for telling me about the new layout! I kept wondering why some people were reacting so angry to some of these things 😂.",
            "The original real life group literally did call themselves that.",
            "Yup its goofy to call yourselves the illuminati lol",
            "No he says it to mordo.",
            "But Black Panther was set in 2017, so only 1 year old in universe.",
            "That was the point. Black Panther takes place not long after Civil War which was 2016. It's like playing Hendrix in a film set in the 70's. It's dated because that's when the film is set.",
            "Bro, that’s your brother wtf",
            "No she can’t, literally one of the stipulations of her freeing the town was that she couldnt recreate the spell that brought Vision, Tommy, and Billy to life. Because the original spell, while powerful, was flawed and broken as Agatha said.",
            "Set up by studios, not by the writers. Post credit scene ending is ambiguous and could be anything, as well as not lining up with conclusion MoM Wanda had. She isn't using dark magic, she is using chaos magic that she had before. Chaos isn't good or bad. \n\nThat aside she did more good in the past and sacrificed a lot more than any other Avenger, if one or two bad things are enough for fandom to consider her bad, then they weren't her fans or ever fair to her.",
            "You know you don't have to read their comments when they enrage you, right? This too is supposed to be entertainment, you dingus.",
            "I'm not complaining, I quit. Just like I don't go to mtg tournaments because everyone else is using super expensive decks they looked up how to build online, no effort just cash is not fun to me",
            "I spent months building an ongoing strategy deck, he copies all ongoing cards on my field. He nerfs my deck completely.  I have no interest in playing the game anymore, I have other decks obviously but this is the one I've loved working on and he just insta kills me, his text might as well read \"if you play this card anywhere you win\"",
            "My family has a rule we call \"the rule of three and eleven,\" where every joke is most funny the third time and the eleventh time. It has yet to fail us.",
            "He says it to Christine rich right before the Ultrons take him to the Illuminati.",
            "Even then, White Vision is still out there, with all of Vision's memories, whom she could try and locate. As for the children, they were just as real as the hallucinations of a scizophrenic, and to get children, there are loads of ways",
            "LMAO ill have what ur having",
            "Just out of interest. How exactly is skrull \"totally broken\", \"ruining the whole game\" or even expensive?",
            "I also have a deck heavily relying on ongoing cards (patriot, mojo, dazzler, mystique and sometimes onslaught if it works out) and I have 0 issue with superskrull. Mostly because most ongoing cards need a certain architype/setup to be useful. I understand cards like knull being countered by it, but I would hardly call it unfair",
            "That's why my parents had 11 kids.",
            "https://youtu.be/aFdsL47T4_I?si=s22F7vTCR1D_jm7O",
            "Um actually",
            " She has no idea that White Vision is still out there. Let alone that he has all his memories restored. The last thing she saw of him was him trying to kill her and her family and Hex-Vision flying away to fight and presumably defeat him. \n\nThose children were more than schizophrenic hallucinations and you and I both know that. But even putting that aside, they were real to her. She loved them, she raised them, and they’re a physical manifestation of the love that she envision shared. \n\nPlus imagine telling anyone who lost a child that there are “loads of ways” to “replace” their lost children. I’m sure that would fly over very well.",
            "As I said to the other guy,  I spent months building an ongoing strategy deck, he copies all ongoing cards on my field. He nerfs my deck completely.  I have no interest in playing the game anymore, I have other decks obviously but this is the one I've loved working on and he just insta kills me, his text might as well read \"if you play this card anywhere you win\". I never said skrull was expensive I was relating him being in the game ruins it the way money ruins mtg for me",
            "A child that never existed. She made them up with magic",
            "I don't think ccgs are for you in general. The card is a tech card that counters your archetype. You either need to know how to recognize the one singular deck that plays him (he is roughly seen in [3%](https://marvelsnapzone.com/cards/super-skrull/) of tracked matches and only good in living tribunal against rogue or mirrors) , or pack a counter tech like  rogue.\n\nIn general you have to expect that countering the enemy and playing around their counters is a key part of any ccg. If that is not fun for you that is on you and not the counter.",
            "Again, its about what the kids represent more so than the fact that they were real or not\n\nOn top of the fact that she legitimately loved them, they were a manifestation of the love that she had for vision, as well as a representation of the idyllic lifestyle that she wanted to have with vision. You’re looking at this from a very surface level point of view.",
            "I just don't like nerf cards. They banned raigeki in Yu-Gi-Oh almost as soon as it was created because with one card you can ruin a whole strategy. If skrull copied the abilities of one location that's fine because location is core game play, he just copies all my cards period, if I don't pack in a counter just for him as you said I'm guaranteed to lose and I do have rogue in my deck because of him, she's useless 99% of my games so I'm running an 11 card deck because of skrull. So I said f it and stopped playing. There's plenty of games out there so I don't need to be annoyed by something like that if I don't want to that's all. I play trading card games all the time irl including mtg. We just don't play with rude strategies or broken cards. I took apart my goblin rush deck because two of my friends were struggling with it terribly and I want them to have fun too. As opposed to my one friend who nobody likes playing with because he always runs a full counter strategy in his deck, which is annoying and boring in 1v1 and renders him helpless in multi-player which makes him whiny. Skrull sucks the fun out of snap for me, I don't want to play with him lol",
            "So she gave up a symbol of her love for Vision. Just as I said, giving up something that doesn't exist, is not a sacrifice, no matter how real you made them with magic. She never had an ideal life. She created it on the cost of others happiness. Taking something away to create something else and then reversing it is hardly a sacrifice (stealing and then giving it back is not a sacrifice)."
        ]
    },
    "Should AI artwork be allowed on the page?": {
        "title": "Should AI artwork be allowed on the page?",
        "score": 0,
        "url": "https://www.reddit.com/r/marvelmemes/comments/1dby5in/should_ai_artwork_be_allowed_on_the_page/",
        "content": "\n\n[View Poll](https://www.reddit.com/poll/1dby5in)",
        "num_comments": 7,
        "comments": [
            "Here are some examples of AI art posts: \nhttps://www.reddit.com/r/marvelmemes/s/JCh0Jmc6MX\n\nhttps://www.reddit.com/r/marvelmemes/s/wJE6Qt6aW7\n\nHopefully this helps with your decision making. Mods are always pushing to listen to the community’s thoughts on things.",
            "No.",
            "No",
            "https://preview.redd.it/k68q9grnbl5d1.png?width=474&format=png&auto=webp&s=2755e92cc0ca2d708677a0d12cb8fc2511af9553",
            "[removed]",
            "Wouldn't it be epic your little meme showed a fat Bugs Bunny instead of a regular one. Now that would be cool.",
            "Hi u/Least_Outcome4522,\n\nYour submission was removed because your account is less than one day old.\nIf you feel that your account is older than one day, please contact the mods.\n\nPlease try again tomorrow!\n\n/r/marvelmemes\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marvelmemes) if you have any questions or concerns.*"
        ]
    },
    "Good for Hugh": {
        "title": "Good for Hugh",
        "score": 5570,
        "url": "https://i.redd.it/y1splimgpx7d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "Honestly if that's the case it's for the better. BC health is important",
            "Hugh has a storied past with skin cancer. He's been through it enough times, good for him that he takes his health seriously.",
            "Seriously who gives a shit. \n\nJust be happy he’s back and in a Deadpool movie!!",
            "We're finally \\[FINALLY\\] getting a blue and yellow costumed Wolverine in a Deadpool movie and THIS is what people are worried about? \n\nFor fuck's sake.....",
            "Hugh has had multiple instances of skin cancer so anything that keeps him safe shouldn't be an issue",
            "People will find anything to complain about",
            "Oh GOOOOOD FOR ~~YOU~~ HUGH!\n\nhttps://preview.redd.it/x9dcgtm17y7d1.jpeg?width=1280&format=pjpg&auto=webp&s=322afdc8bd8d9e2612007cc9f12ab4644bad65cd",
            "I betcha Wolverine is uncircumcised.",
            "Imagine having neckbeards complaining that you're not risking to get skin cancer to please them",
            "Honestly I don't care even a little, that said if that's the reason they did it 100% agree and good on them for doing it. Hell that sort of thing should be normalized, do a skin cancer awareness campaign along with it. Not enough people take skin cancer seriously.",
            "This makes no sense.  Why would wolverines have bear arms, they're not even the same animal.",
            "Corridor Digital discussed this in their most recent episode of VFX React",
            "I mean I'm glad hes taking care of himself but can someone explain why sunscreen wouldn't work? You have a whole ass crew on films is there a reason having somebody with banana boat on the sidelines wasnt possible?",
            "Even if it wasn’t for that but because of the \"backlash\" against sleeves, so what?\n\nThe problem with most CGI nowdays is that the production don’t actually plan thigs and go in with a \"we'll fix it in post\" mentality (like the time suits in End Game) but there was a Wolverine costume made and they shot the movie with it. So them using CGI to fix up the costume a bit during editing isn’t a problem for me since there really isn’t an alternative for it besides reshooting the whole movie, or atleast Wolverine scenes.\n\nWho is actually mad about this?",
            "Jack for Hugh, Man.",
            "I mean a chunk of it was filmed on studio lots, so I wouldn't be surprised if he's sleeveless in all the scenes that were a set and/or green screen and all the scenes they filmed outdoors he's got the sleeves",
            "I didn’t mind Shazam’s muscle suit in the first film, never had an issues with cgi enhancements. Long as it looks good.",
            "Whatever works for Hugh.",
            "He already had skin cancer so this is valid.",
            "OH NO NOT CG, WHATEVER WILL WE DO",
            "It's not to protect him from skin cancer. He already has it. They are minimizing damage.",
            "The corridor crew guys suggest the CGI is actually the suit. It would explain why in the trailer he has short sleeves but had long sleeves in the early photos. They changed their mind and altered the look of the costume in post",
            "When I heard that I was actually happy. What's a little more gci? Even better if it's for health reasons. I am just glad we are getting another Deadpool movie.",
            "If that’s the case I don’t have a single issue with that and anyone who does is an asshole.",
            "I also thought that",
            "But his face is exposed?",
            "Oh please god don’t CGI his arms. Just let him wear sleeves. We do not need cartoon arms all over the joint.",
            "Is there a hole in the ozone layer where they were filming?",
            "Is he that sensitive?",
            "Or he could’ve just worn sunscreen or they could’ve kept the sleeves on",
            "Super hero movie filled to the brim with CG to the point where you could argue entire scenes are animated; somehow I'm suppose to get worked up by this?\n\nNext you'll tell me Deadpool's mask isn't actually that expressive.",
            "Thank you for explaining it. I was a little confused, I didn't know he ever had skin cancer",
            "Oh, but I can tell you one thing and it's a bit of a secret. In the sequel, we're gonna have Cable. Amazing character. Bionic arm, time travel. We have no idea who we're gonna cast yet but it could be anybody. We just need a big guy with a flat top. Could be Mel Gibson, Dolph Lundgren, Keira Knightley, she's got range, who knows? Anyway, big secret, ssshhhh. Oh and don't leave your garbage all lying around. It's a total dick move. Go. Chicka-chickahhhh.",
            "Comic fans are notoriously never happy.",
            "CG hysterics is the lamest trope in armchair film criticism.",
            "Whatever they did to me made me totally indestructible... and completely unf***able.",
            "Let's see Paul Allen's arms",
            "Most of the time.",
            "He’s not Jewish, so that’s a fair bet. Magneto tho….",
            "Question: if he *was* circumcised before his powers kicked in, would his foreskin grow back? Or is it permanent?",
            "Hell, yeah. Get that sensation King.",
            "What does this have to do with the second amendment?",
            "You were droning on.",
            "Probably much easier to us makeup that has uv protection on his face than coating his arms and keeping it consistent. He’d be wearing face makeup anyway ",
            "It’s a risk he was willing to take",
            "He's had skin cancer before.......",
            "He's has skin cancer multiple times",
            "He has had skin cancer and talked out against Aussie sun bathing culture. ",
            "Dude he's had skin cancers before, I'm sure he'll do whatever the fuck he thinks is best to not get it again",
            "Not sure if sarcasm but that’s not how skin cancer works lol",
            "Here, check it out. She's sending away for all these colorful clinic brochures. I'm sure they're all FDA approved. Chechnya, isn't that where you go to get cancer? You got China and Central Mexico. You know how they say 'cancer' in Spanish?",
            "Big cgi fight coming up!\n\n![gif](giphy|YiUUxhTBx1qlJskxiE|downsized)",
            "I feel like I'm missing a reference here.",
            "I feel healing based powers (unless magical) are based on genetics and making one whole according to their DNA not augmentation. This would also mean dental work, piercings, and augmentation surgery would be challenging.",
            "Sorry Mr. Pool",
            "Well, good for Hugh, indeed.",
            "Oh. That's bad. I'm happy that they did his hands with CGI",
            "What are you implying, exactly? Sun block doesn't block cancer causing uv?",
            "It’s the monologue after the credits of Deadpool 1.",
            "It's a bot who activated for mentioning he who I will not name. It rhymes with beddrool",
            "I’m not implying anything. Sunscreen only really reduces your chance at certain cancers by about half, which is still great, but there’s also dog shit chemicals in sun screens. I live in Florida and it’s 85+ for ten months out of the year and I’d rather wear a light sun shirt if I’m gonna be out in the sun longer",
            "What do I keep telling you, Mrs. Magoo? She wouldn't have me. If you could see me, you'd understand.",
            "Can you please use beddrool in a sentence?",
            "Yeah, it's like.... Ok.... A man, deep asleep, is suddenly woken  by a puddle of his wife's beddrool, which he momentarily dreamt were kisses, from his coworker crush. No one likes to awoken by beddrool.",
            "The madlad did it. He used beddrool in a sentence just to not say Deadpool. Wait. What have I have done"
        ]
    },
    "100 % I wasn't alone": {
        "title": "100 % I wasn't alone",
        "score": 1392,
        "url": "https://i.redd.it/bvq5039zpy7d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "When that happened it truly cemented just how badass of a dude thanos was. Dude just took  full force, full magic hit from storm breaker, took two seconds to process and was like \"yeah you fucked up bro, lemme shit on ya whole life real quick\". SNAP.",
            "yeah my heartbeat stopped\n\nhttps://preview.redd.it/rza3on7s3z7d1.jpeg?width=380&format=pjpg&auto=webp&s=c2a819aece5ef94af60e2b6c96773bfc3df25c58",
            "Now imagine if Thor immediately took the axe out and cut his head off before he snapped.",
            "Honestly for me it was the other way around. I hate it when truly threatening bad guys get easily dispatched by \"hero bullshit\". Then when he survuvded is was like YEAH THEY GOT HIM RIGHT",
            "Thor wanted Thanos to suffer, ended up costing him and making everyone around him suffer instead because of his decision to go for the chest.\n\nLearned from his mistake though.. went for the head in Endgame",
            "I cheered during both scenes",
            "Nah my reaction was\n\n\"YEAAHHH- huh? WHAT THE FUCK\"",
            "The chaddedness of such a sight would obviously blind mortal audiences. It was obviously a safety precaution."
        ]
    },
    "America’s True Avengers": {
        "title": "America’s True Avengers",
        "score": 1271,
        "url": "https://i.redd.it/x1rtfe7wuy7d1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "So, do they know they are cousins? She-hulk is pregnant, and Hulk is just smiling away. Shout out to old man Logan fans.",
            "Looks like an average day at Wal-Mart. Love the cousin-cest comic accuracy.",
            "Thems there the 'Murican Avengers",
            "Oh no sweet home old man logan",
            "Doesn’t hulk do that in the comics of Old man Logan. Bruce is Alabama incest grandpa.",
            "Ngl I kinda like that Hawkeye getup.",
            "The Avengers must be getting desperate if they let Billy Ray Cyrus and Papa Smurf join",
            "We just need widow and iron man",
            "Hulk looks like Brodie Lee. RIP",
            "No blackface panther?",
            "Bruh",
            "What are the avenging…tobacco?",
            "God bless them redneck Avengers.",
            "Is that \"thor\" from Adventures in Babysitting?",
            "\"Protecting the Red White and Blue and even some non Americans too, God bless those Redneck Avengerrrrrssss\"",
            "Any anime villains team",
            "You mean 'Murica's Avengers",
            "Look at that rug!",
            "Looks like some rock / country band.",
            "That Natsu in the background though…",
            "I'm pretty sure their cosplays are just ironic parodies",
            "Lmao the cousin Fing implications are hilarious",
            "You've heard of the Great lake Avengers, the West Coast Avengers, Young Avengers, now meet the All New All American Avengers!",
            "These would've been the confederacy avengers.",
            "Old Man Logan is such a great story, but it’s definitely weird.\n\n![gif](giphy|THTkGKQVGnGZmo6AJd)",
            "![gif](giphy|3JCaaiE2gcTbq)",
            "https://preview.redd.it/bodjnoufkz7d1.jpeg?width=960&format=pjpg&auto=webp&s=1585711f4a06ebb911368c2944245e37a6346949",
            "![gif](giphy|l4Jz4YXV0yU7oCOAg|downsized)",
            "It makes it even better",
            "r/Whoosh",
            "I can hear an eagle screeching just looking at it.",
            "She’s the only one who could handle the damn pace!",
            "They scraped Iron Man’s suit.  Black Widow took one look and went back to Russia.",
            "Iron man is there, he’s the 6 pack lol",
            "Blackface panther? He is in Canada. \n\nThey're afraid that Trudeau would sue them for copyright infringement.",
            "Glad I'm not the only one who remembers that one lol. Came here to make the same joke",
            "Cue the laugh track!",
            "Maybe you all are Hulkasexuals.",
            "Yep.\n\nLoved that run.",
            "But _akchuhlee_ eagles don’t screech like that"
        ]
    }
}