{
    "Guides/Combos + Questions and Help MEGATHREAD!": {
        "title": "Guides/Combos + Questions and Help MEGATHREAD!",
        "score": 1202,
        "url": "https://www.reddit.com/r/masterduel/comments/sve5fr/guidescombos_questions_and_help_megathread/",
        "content": "Ask Questions + Help Others In this Thread's Comments!\n\n# Master Duel Top Decks/Tier List/Guides: \nhttps://www.masterduelmeta.com/\n\n# 101k+ Members Master Duel Discord\n\nDeck-Type Channels, New Player Help, and More!: [https://discord.gg/masterduelmeta](https://discord.gg/masterduelmeta)\n\n# New Player Quick Tips:\n\n* **UR CP**(Ultra Rare Crafting Points) is the **Most Valuable** Resource in the game! Do not use without Guidance!\n* The **Duel Pass** is **worth it!** It refunds itself by playing the game!\n* The **Solo Mode** gives a **ton of Rewards/Gems!**\n* With **Minimal Playtime** and for **FREE**, you can have a fully, or close to, **Optimal Top Tier Deck!**\n* **What Deck should you use** and how should you build it? **The Tier List/Top Decks/\\[Name of Deck-Type Breakdown\\] page** will help guide you on [https://www.MasterDuelMeta.com](https://www.MasterDuelMeta.com)\n* Tier List: [https://www.masterduelmeta.com/tier-list](https://www.masterduelmeta.com/tier-list)\n* Top Decks: [https://www.masterduelmeta.com/top-decks](https://www.masterduelmeta.com/top-decks)\n* Make sure to check the Pack Sources of Cards! Some packs may no longer be available! **Secret Packs** Must be unlocked by crafting an **SR** from the pack!\n* Most popular Secret Packs are here: [https://www.masterduelmeta.com/secret-packs](https://www.masterduelmeta.com/secret-packs)\n* Use the Discord to ask for help! [https://Discord.gg/MasterDuelMeta](https://Discord.gg/MasterDuelMeta)",
        "num_comments": 35658,
        "comments": [
            "I have a bit of a personal rant...\n\nI have been playing with my friends since day 1 and have been the focus of negative comments and bullying on my deck choices. Let's take into account that 2 of us haven't played yu gi oh in years while one other friend has been up to date with the series.\n\nI will divide it by deck choices:\n\n1- Drytrons: I picked this deck since the secret packs had some galactic bears or something and I wanted to try those out. As I looked up for suitable decks with what I had, drytrons seemed like a popular choice so I went with it. I had no idea they were so broken, it was an honest \"mistake\". They wouldn't stop bashing me, saying how I only play meta decks and that its boring to play with me.\n\n2- Toon deck: I asked my friend if toons was a viable deck, since i didn't want to repeat the drytron situation. He said no, that it was gimmicky and non meta, so i went with it as they always looked quite fun. I absolutely destroy them with that deck. 3 turn kills, all BLS spam, they start saying its annoying, how I am a brain dead player with no strategy in mind.\n\n3- Monarchs: I once again ask, is monarchs viable as it seemed underpower with no extra deck and lots of tribute summons. they say its fine. I negate all their decks with my Domain. They are frustated that they can't have fun and use their extra deck\n\nAt this point I am tired, I have wasted all my gems and I am working on a Dragonmaid deck, because fuck them. I want to have fun playing this game but apparently all my choices are the wrong choices.",
            "20 deck slots? It’s the first month and I have 5 complete decks without spending a cent. \n\n30 bookmarks? They were full with staples the first couple days. \n\nReally hope they increase these ASAP.",
            "I don’t understand this shit and it’s making me nuts. How can I go on a 12 game win streak in platinum, then get one win away from plat 1 and go on a 14 game in a row losing streak. \n\nSuddenly my opponents always have perfect hand traps, make no mistakes, never scoop, and I can’t draw any of my staples or kaijus. Six kaijus in a 40 card deck, what are the chances I didn’t draw a single one 14 games in a row. It’s so frustrating. It’s like the game knows you’re almost there, and then screws you over on purpose. \n\nEvery time I get to plat 3, I face almost exclusively plat 1s. Then plat 2 finally. Drytron 5 games in a row.",
            "I put a win more card on my deck but I'm winning less, how could this be",
            "Ugh, maintenance. \n\nIs this what heroin withdrawal feels like?",
            "Would be nice if there is a \"in a nutshell\" compilation of what the meta decks are in the \"New Player Quick Tips\" section. Maybe it could be a new thread on its own? \n\nI suggest a format like this:\n\nDeck: Toons\n\nPlaystyle: Destroys opponents with monsters that can attack directly even when there are monsters on the opponents field.\n\nStrengths: Toon monsters can stay on the field even when destruction effects are activated and Comic Hand is a scary card that can turn the enemy's boss monster against them.\n\nWeakness: Without Toon Kingdom, the deck cries like a b\\*tch.\n\nThis could help players in choosing a deck they want to start playing with or find new decks to play with.\n\n(Note: Yes, I know Toons are not that hot. This is just an example).",
            "can we add a FAQ section? and include the \"guaranteed UR stays even if your secret pack expires\" to this FAQ? because it still gets asked 20 times a day",
            "made it to plat 1 with adamancipator.\n\nnow i can play my yugiboomer dark magician deck in peace.",
            "So I just clicked “claim all rewards” by accident…\n\n🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬",
            "They seriously need to do something about the animation speed in this game. I legitimately hate playing going second decks because people take 500 fucking years to do anything. God forbid you run into a combo deck that has excavation effects",
            "sometimes slow-play isnt slow-play. Ive set up flood gates before and have my opponent freeze for a good 2-3 minutes. But then they suddenly break my board after figuring out an extensive combo. I have respect for those kind of players. they were probably writing down the step by step solution.",
            "**NEW Guides Page:** https://www.masterduelmeta.com/guides\n\nLast Updated March 10th 2022\n\n**Latest Added Guides:**\n\n[Introduction to Dark Magician](https://www.masterduelmeta.com/articles/guides/dark-magician-guide-deruka)\n\n[Introduction to Code Talker](https://www.masterduelmeta.com/articles/guides/code-talker-guide-misplaymaker)\n\n[Introduction to Shark Kragen](https://www.masterduelmeta.com/articles/guides/shark-kragen-guide-jeirust-freakyfishskipper)\n\n[Basic Salamangreat combo for beginners](https://www.reddit.com/r/masterduel/comments/t74jcd/basic_salamangreat_combo_for_beginners/)",
            "This event has really opened the doors for me to pure zoodiac. Their strategy is stupid easy and it’s the only deck that has made me feel super confident going second. This is probably because 80% of the deck is hand traps 😂\n\nThe game feels sluggish going back to crazy combo decks now",
            "Seriously, HOW aren't sky strikers spells once per freaking turn",
            "Sorry if this was allready answered but ever since the new update i noticed that during the drawing animation while card is turning around towards to the player there seems to be some kind of \"freeze\" for half a second (not a whole game freeze since i can see the background effects work just fine)\n\n\nis this a personal problem or others have it as well?",
            "The past 5 games i've tried to play people forced closed when they lose the coin flip. Patch this now, because it's becoming worse daily.",
            "hot take: hitting card of demise to 1 would make both true traco and DD dynamite less obnoxious",
            "I've been feeling pretty anxious and depressed lately, but then I remember that Halq will be banned and I can't help but smile",
            "Stupid question but why won’t the replay show me what cards my opponent has in their hand? I want to know if I would have won",
            "Eva, revolt and block dragon gives too much advantage :(",
            "I'm going second against dryton for the 3rd game in a row, what's a good TV show to binge?",
            "Anyone know where to go to put in suggestions? I like this game but there are a few small things that bother me.\n\n1) I know I'm not alone about the card text being formatted weird. I would love if they broke up the text like on the card bc it's hard to tell when the condition ends and the action begins.\n\n2) in the duel pass screen, it always starts at level 1. Why not have it start at the current level? I know it's small but it's annoying to have to scroll through to see what rewards are coming up.\n\n3) this is REALLY minor, but editing the text for the title of a deck is weird on computer. It always defaults to having to rewrite the entire title rather than just one part.\n\n4) can we look at our cards WITHOUT going through the deck process? It's just tedious to have to go to deck menu, either create new or edit a current deck, all so I can just see if I do/don't have a certain card.",
            "Anyone else having a miserable experience since reset? I’m not having fun anymore in Gold",
            "Anyone else have a problem dismantling a Royal Finish card, no matter how unlikely they are to ever play it? I just...can't bring myself to do it.",
            "Why the fuck does anyone play Numerons? I know people throw the word toxic around pretty carelessly but to me that deck is the definition of toxic. Surely at this point most people who see {Terraforming} or {Numeron Network} scoop if they're going second and don't have the outs to it. \n\nAnd yes, I know that this is another in a long line of Numeron hate posts, but seriously, fuck that deck.",
            "1 game away from level 20. Wish me luck.",
            "Good job stupid ass Konami baning Gossip Shadow instead of Rhongo\n\nSurely the card wont be a problem in the future, right?",
            "Holy fuck I hate Marincess....",
            "Too many links on the OP, the older format with one link to the guides post was better IMO.",
            "Why does this game run so bad on the switch. It makes me and my opponents turns to take way longer then they need to be. is there a way to make it run less ass",
            "I’ve hit my limit for gem capacity, is it wise to just spend on a new deck, or wait for something new to release? I’ve got an optimised Virtual World so I’m not desperate for anything but I’d like to try something new out. I just don’t want to spend for a new deck only for something else to release that becomes a must-have.",
            "i bought the adamanicipator deck and idk what im summoning half the time",
            "Was having a good back and forth battle with a tri brigade duelist and once they realized they were about to lose they let the clock go out lol just lose with dignity fellow duelists…or at least surrender lol",
            "So fucking tired of control decks ruining the Xyz fedt",
            "Can we make a rule to attach a replay when asking about specific interactions?",
            "I fucking hate how this game randomly decides to d/c you.",
            "Y'all....\n\nI wish I knew how much fun Prank-Kids were from the beginning. Just started the deck and actually took it into Ranked for the first time today. Still learning, but I'm loving it!",
            "after reading the guides posted here and browsing some helpful threads, i finally managed to reach platinum with a not so meta but really fun deck\n\nthanks to everyone helpin out here",
            "Jesus christ, can block dragon fuck off already?",
            "It finally happened today. I Ash’d myself. Just wanted to put it out there. Another step taken along my MD journey.",
            "I become more unhappy and want to kill my self the more i keep playing Cyberdark.",
            "Did Konami change the UR drop rate? I opened 6 URs with 8000 gems. 3 times with 0 URs...",
            "fellow speedroid players. It has come to my attention that in the sword soul meta turn 1 hi-speedroid clear wing rider is actually a good option to consider. the 2 clear wings you can float into actually both have relevant negates you can use. They can't get over 2500 without dipping into the extra deck for a monster however fast dragon can protect you from one attack by dropping them to 0. Clear wing synchro dragon's negates are usually a bit too specific however they actually both come into play against the main threats of the deck.",
            "MD's entire game state is broken. 17 of my last 20 duels online have been against bots, we're still laughably behind the physical card game's card pool, legacy tokens are still useless thanks to its archaic card pool that we can't dismantle, despite being the main online duel reward.\n\nThe only things that are smooth are decent gem opportunities for a FTP (before the bot issue) and festivals. Even the festivals are littered with stuff completely outside of most themes ie: Time Lords/Draccos.\n\nIt's obvious Konami didn't anticipate near the level of success this release would get and didn't plan accordingly, which is weird for what's supposed to be the \"ultimate Yugioh experience.\"",
            "No rewards for lower ranks in New season?why am I missing out on rookie-gold rewards",
            "When will the adventure engine and brave token be updated in master duel? I'm having 5k gems and want to build a new deck but I heard that these new engines will change the meta a lot. Should I save up my gems for those or just building a new deck?",
            "Can we get flairs for preferred summoning mechanics?\n\nI.e.\n\nFusion fanatic\n\nSynchro savant\n\nXyz extraordinaire \n\nAnd then something for pendulums and links idk",
            "I can't believe people were complaining about Swordsoul meta.\n\nThe next season meta is going to be extremely unfun with Floow / Adventure PK (both) /Tenyi Adventure.\n\nBasically you have to either win the coin toss or draw the right handtrap and pray they don't have crossout/called by or it's a guaranteed loss.",
            "This game has hundreds of cool archetypes, and 99% of them are trash. Makes me so sad lol\n\nThe card pool size feels like an illusion",
            "I can't wait til I can finally dismantle all the banned cards lol. \n\nI never even really used IO and Vanity's...",
            "HOLY SHIT 5 SPELL/TRAP ZONES AND I SOMEHOW STUPIDLY ALWAYS MANAGE TO USE THE COLUMN THAT IMPERM WAS SET AND USED IN\n\nYeah the column highlight was a _huge_ nerf to the card 🙄",
            "Sartre was half right -- hell isn't _just_ other people, it's other people _in Platinum_. \n\nGods I hate this rank.",
            "Gah, I'm so sick of Sky Strikers. \n\nThat's it. That's the post.",
            "Sky Striker is hands down the hardest deck to play optimally I’ve tried yet. 1 misplay and you’re dead",
            "Just went 15-0 with True Draco to plat 1. I spent so many gems on other decks only for this cheapo deck to perform so much better lol. I think people just don’t understand how to play against it at all",
            "I swear there's a strong magnetic force that happens when you use a 'Pot of' card, you draw the other pot cards.",
            "i hate seeing my boi gustav max being used in eldlich decks as of late, but i also love seeing them try to activate its effect while they have skill drain active",
            "Why am I not able to choose activation order for shizuku and multirole? I have to play them in a nonsensical order that is not specified by the cards.",
            "hope I don't have to wait like 2 years to play Labrynth in master duel",
            "Just got to use Maxx C for the first time ever against a Galaxy Eyes player. It felt good until I realized he was the guy jerking off that got caught by his roommate - had 0 fucks to give, looked me square in the eyes and kept going until he finished.",
            "Just tried playing my first yugioh game in 15-20 years. I am so out of the loop and I am guessing ranking is busted but  my opponents first turn linked like 10 diff cards or so and special summoned a 9 star card. I killed it with a spell on my second turn and he ran out of cards in hand. I'm thinking I doing okay but his second turn, he was able to link 10 diff cards again and somehow special summoned two diff 7-9 star cards and killed me pretty much, while Im still in my beginner deck.\n\nIm exagerating the 10 linked cards but you guys prob know what I mean.",
            "Holy shit I have never hated an archetype more than these fucking fairies.\n\nThe loaner deck for the new solo missions are fucking impossible to use, and the mirror match makes the fight last forever.",
            "Wtf man. I just reached silver and I’ve lost to a deck that brings out a white spike ball (I think it’s called the ultimate herald or something) and it doesn’t even allow me to play anything, it negates every single fucking card I use. Is there a way to counter it?",
            "Are Toons & Relinquished decks worth building (separately, not together)?\n\nI really like Pegasus and wanted to build a couple of decks in his honor",
            "Why do people play Live twins? Not hating just really want to know what that deck tries to acheive? Every time I play against it they end on a weak board. Seems like a whole lotta nothing but its so rampant in plat.",
            "Do people normally use Millennium Eyes Restrict as another CBTG when summoned with Instant Fusion?",
            "If I didn’t get an UR in a 10 pulls of a secret pack, and 24 hours has passed, will I still be guaranteed a UR for the next 10 pulls I spend?",
            "Do the people that have played tcg, do noble knights get more support to make them viable in the future are there any archetype that is like them that will get released in the future? I remember someone telling me about something along the lines of dark knights that are better in the tcg but can't remember",
            "I haven’t played for a week until today. What the hell happened",
            "Bots have made it to Diamond 2. I'm about to do rank up to D1 Match and just sitting here.",
            "How do you counter Despia? My friend play those and I always lose against them. Currently on 4 games losing streak.",
            "Why can't the music be dictated by the field we buy from the shop permanently? There's one OST that sounds like it's from Neir and it's BEAUTIFUL",
            "It should be a sub rule that people can't ask about game bugs unless they post a replay.",
            "TIL you cannot imperm to negate a monster while skill drain is active. Meaning you cannot negate the skill drain with imperm except when it activates.\n\nReason # 2000 to hate that card",
            "any idea when the next pack will be that will include the rest of the exosisters?",
            "Not a question but if anyone is looking for a good(ish) solo gate to test stuff against, the last boss in the cyber-bugs gate just Maxx C'd me, Imperm'ed me, AND Lightning Stormed me. I actually had to doublecheck I was still fighting a bot when I saw that, lol.",
            "I just spent 4 hours dueling in diamond 3 and didn't go anywhere :/",
            "There is absolutely no universe where Grass and {Fairy Tail - Snow} should both exist at 3 -- Snow is absolutely an obnoxiously broken card.",
            "I tend to always be running out of my Magikey Mafteals... Between the fusion and ritual I never have enough. Am I doing something wrong?",
            "finally made it to duel level max with speedroids, the climb was a pain but I finally got blessed by the coin flip after getting hosed by it the other times I made it to level 19",
            "They should really make a secret pack(s) for swordsoul and other recent cards that were introduced. These new decks can be real expensive if you have to craft every UR",
            "does somebody have an adventurer dragon link guide?",
            "Why doesn’t the search bar in the the deck builder allow for basic Boolean operators like: AND, OR , NOT?",
            "Shoutout to the chinese players who saw my 'SYNCHRO PASS' nickname and let me synchro 15 times over 2 duels to finish the event missions. You the real Gs.",
            "Man the event is so fun i've finished the entire mission in one go without even realizing it, and went straight from silver to plat 1. My blind salamangreat are starting to struggles tho, so i probably need to switch to something else.",
            "Konami should add the sound effects of the original anime when losing life points.",
            "I tried out Master Duel a while back after only really playing Duel Links, but I was a bit intimidated by the decks because when it comes to the combo lines, I feel like an idiot. \n\nEvery deck either plays like a combo deck where you have to go through a long series of special summons to eventually get to an endboard, and that process seems too much for a new player who doesn't know the cards that well. I know there's basically walkthroughs for every deck but what decks are the most small-brain friendly? I'm mostly lost when it comes to Link summons to be honest, so are there decks that are less reliant on linking off several times in a row?",
            "I just encountered the Rongo/Sales Ban combo.\n\nFuck this shit.",
            "On a scale of 0-10 how good is this next Selection Pack? How good is Odd-Eyes/Magician with the support? What about Scareclaws?",
            "Over half my duels are Floo. What is the most anti-Floo deck I can play? I don't care if I lose to literally every other deck.",
            "> Rank up match for Dlv MAX\n\n> Wins cointoss\n\n> Opens absolute full Spright combo \n\n> No handtraps from the opponent \n\n> Gets hit by a Lava Golem\n\n> Gets hit by another Lava Golem\n\n> I have one Herald of Arc Light left\n\n> Opponent has Numeron Calling and Network \n\n\n\nI was never this close to uninstalling the game.\n\nEDIT: OMG\n\nnext Rank up.... loses cointoss... against Blackwing... FTK version!\n\nHowever, I open 2 Called bys, prevent the FTK BS and win the duel after 8 turns with 400 LP left LMAO.",
            "Just want to say I am so chuffed rn coz I got a buzzer beater Master 1 last night despite just starting playing last month, with Branded Bystial. Last month I just got to Plat1. Surprisingly Plat 1-Master5 is harder to push through than Master2-Master1. The latter is 90% Tear so maybe that helped in the predictability and what to tech in, whereas Plat is full of variety and like 50% Sprights, which is a lot harder for me to play against than Tear in my limited experience. They just have a gazillion extenders.\n\nPoetically enough I faced the deck (who is going to rank up too at that!) instead of the usual Tear in my rank up to Master1 but this time I am the 1st turn and he didn't have interruption. My intuition to set Retribution instead of Banishment paid dividends against Elf, and putting Baldrake instead of another Ash also greatly helped against Giant. It is sweet justice for how many times the deck has defeated me by going first.\n\nI still have a lot to learn, I am still intimidated by Maxx C which made me play unoptimally hundreds of time when I could have easily pushed through it and go for lethal. Shoutout to MDM, Vect0r and ShapestofSnatch for their videos and tutorials and decklists, really godsends in helping me understand the deck. Thats all and thank you.",
            "It's kinda annoying that certain decks (i.e. dlink) can't even play properly with a 300 second timer if you want to read your opponents card effects or don't have most of your combos memorized or need decision time",
            "Snow needs to be banned 100,000%, like months ago. It’s one of the few pure degeneracy enabling cards that has survived from the early days of md",
            "Tri-Brigate Revolt is such a BS card.",
            "Just wanted to say to all of you fuckers in here, since reddit is fun is going down and I'll probably never comment here again: good bye, fuck all you bastards, I hate and love all of you.\n\nAlso, floodgates rule, tcg banlist is shit, sky striker is the best deck, cope bitch Maxx c is never getting banned and rightfully so. Also, FREE HORNET DRONES, free Fraktall, free halq, free gossip shadow, free agarpain, free Elpy, free astrograph, free chronograph, free monkeyboard, Free Supreme king starving venom, free Electrumite, free VFD, free Celestial, and finally FREE ENGAGE.\n\nHappy dueling to all, and to all a good night.",
            "Is it just me or the amount of times madolche bricks is insane. The deck is great but it have awkward starters. \n\nGoingn second its awkward to hand trap coz you cant pettingcesseur. \nThat leaves anjelly and hootcake as actual starters. But you only have 5 of those (2 hoot cake, 3 anjelly)\n\nMagilleine is not even a starter here coz your only target to special summon is pettingcess which yknow first point if you handtrapped. \n Unless you get salon with magilleine but thats a two card combo. \n\n I know its a rouge at best but the deck is actually great once it gets going. Are there any consistency cards that can help? Aside from the pots",
            "hey guys.. so I'm not really into the meta right now but I'm creeping up on 10k gems.  Any opinions on an efficient way to spend the gems?",
            "I got to 20000 medals and am done with the Xyz event! Having wins be worth 500 medals made it much faster, even though that does unfortunately mean the number of generous suiciders decreased",
            "Do people report players who disconnect even if it's not done intentionally? Anytime I'm losing but the game disconnects because of my crappy Wi-Fi being overloaded in the weekend i feel like the other guy probably thinks I'm a toxic sore loser.\n\nSorry, I just needed to let this out.",
            "How should I go about obtaining multiple copies of 'Forbidden Droplet'? I'm not sure if I should just buy 3 of them with UR CP, buy a Super Rare from 'Deceitful Wings of Darkness', then open booster packs from that set, or buy 1 copy of 'Forbidden Droplet', then open booster packs until I get 2 more copies?",
            "Why is Floodgate Trap Hole not working against Sky Striker link monsters? My opponent summoned 3 of those monsters, and I didn't get a single activation prompt.\n\nedit: My opponent special summoned Blue Eyes and my void trap hole AND torrential tribute did shit. wtf?",
            "When will they release a new secret pack",
            "I'm running a thunder armed dragon deck and it's pretty awesome except when the opponent goes first and summons a monster that can't be destroyed by battle or card effects (like Number F0 Utopic Draco future)  \n\n\nWhat card can I add into my deck to help counter this?",
            "I wish the event lasted longer so I could build some random xyz decks without knowing they’ll be garbage in a couple days. I’m tired of playing zoodiac over and over lol",
            "I only got 1 UR from 30 secret packs FML.\n\nSorry it's not a question but I definitely need your help for better luck!",
            "Greetings everyone, I have a mix of couple questions while starting to learn this game, hopefully someone can help me clarify it, thank you in advance!\n\n\n1. Let's say, if I'm at gold 1 rank, and promoted to plat 5, then if I lost a lot of times on plat 5, will I get demoted to gold? If yes, will I be demoted to gold 1 or straight to gold 5? Also, how many losses will demote me back to gold? \n\n\n2. I have a question bout pot of prosperity, once I activated it, the animation shows that 6 cards were excavated to show me to pick 1 card to my hand, and while that happening, can my opponent see what cards were excavated and sent to my hand?\n\n\n3. About pot of extravagance, the card description stated as \"at the start of main phase....\", So what if, I activate a trap card that I set on my previous turn before activating that pot of extravagance, I still can't activate that pot card right afterwards right\n\n\n4. Last question I got is, about xyz card effect, let's say my opponent summoned a xyz card during their turn and now it's my turn, and the card has effect stating:\" once per turn, you can detach 1 xyz material..... \" does that  mean that the opponent can only activate it during their turn only, not on mine right? Unless the card effect saying \"during either player turn...\"?\n\n\nThank you in advance for reading this and trying to answer my questions. I just want to learn and trying to get confirmations even though my questions seems like silly questions. Thanks again and have a good day!",
            "I swear to God, Numeron players always get out their weird field spell on their first turn.\n\nEdit: bruh, this dude had 2 on their hand.",
            "Game is great but anyone else find that some duels just take too long? I ran into a virtual world player and he was literally comboing for 5 minutes straight on TURN 1 FFS.\n\nLike come on! some of these duels literally take like 30 mins",
            "Ok when I'm playing with the Mates, can my opponent see them? When my Borreload Dragon is yelling at them, I want them to _know it_.",
            "Hello there, i made an adamancipator combo guide (with pranks engine) and i was wondering if you could add it to the pinned comments\n\nhttps://www.reddit.com/r/masterduel/comments/sz44ns/adamancipator_with_prank_kids_engine_combo_guide/?utm_medium=android_app&utm_source=share\n\nHere's the post",
            "Any ideas when maintenance might be over?",
            "[deleted]",
            "I just lost to the default starting deck using my cyber dragons -.- Didn’t pull a single monster card, completely and utterly bricked. Tune warrior demolished.",
            "I'm not sure where the other megathread went, so I'll ask my question here:\n\nIs there a space limit to the gift box? I remember there was a limit in duel links but I'm not sure if there is on in MD\n\nI'm asking b/c I'm saving gems right now and I'm at 81 items in the gift box",
            "Don’t mind me just waiting for a guy to finish me off but he decided to flex taking up too much time",
            "Recently saw a tournament with only N and R cards. Someone played a generaider earth machine deck. Does anyone maybe have a decklist for something like that?",
            "Has anyone ran into this issue? For the last 3 days every time I play ladder I play against the same deck 2 times in a row with a different pilot. So I’ll play striker. Then play against striker again. Next match is drytron then I play against drytron again. Thought it was just unlucky but 3 days in a row seems like a bug right?this is 10+ matches daily",
            "Is there a way to disable right click to refuse activations ? I play on a trackpad with no clear demarcation between left and right click and sometimes I lose games because I skip my triggered abilities",
            "Anybody else loving prank kids? I’m almost close to mastering it and it does a good ass job as long as I don’t run into someone that sends my cards to the banished zone or dryton lol",
            "is people disconnecting and giving you a loss like a thing?  \nit seems to happen when i've got my win con out  \ni started playing today",
            "Could someone please do D/D/D? I know there are sheets out there, but a lot are outdated, or just not appropriate for master duel.",
            "Can someone acutely tell me wtf am I supposed to do going 2nd against Drytrons? I faced 5 this season I believe... all 5 without an exception started first, They all ashed my Maxx C, I Ashed their searcher (Some said Eva, some said Benten, so every time I would try a different one and still nothing) yet they still got their full board like Ash didn't even exist and 1 of them I had droplet and started my turn only to have that little cuck in his Hand that negates monster effects and another ash... \n\nLike wtf am I supposed to do? I am not exaggerating when I am saying this scenario happened like 5 times this season and I never started 1st against them there has to be a way to not just auto surrender against this garabge bullshit.\n\n(I may sound triggered, which I am beacuse this feels to me like a T0 Deck even tho everyone says it is not which I want to believe but I never seen it, brick, get stopped by Hand traps, always has a negate for something and these mofos always gets to go first)",
            "Is there some kind of bug going around where you'll attempt to activate an effect, and then the game just freezes everything except *your* timer, so you lose via timeout?",
            "The unfair advantage players get going first + the ability to force close the game at the coin flip to essentially void the game is a huge problem and needs to be addressed.",
            "do the danger! cards discard as an effect? If so, would discarding by a danger! card trigger luna light marteen's effect?",
            "I see cyber dragon lists running invoked mechba but they don't run aleister. how are they summoning it?",
            "Anybody else getting exhausted from the solo duel dailies? 😂😂",
            "I need some help yall, i started the game like a week ago and bcz im f2p i thought i should start with a meta deck, so i searched online and found a drytron/fairy deck, it said that deck was ss tier or something, i built it, problem is i dont know how to play it at all, its supposed to do long combos but im confused and i had quit yugioh since like 10 yrs old when i just summoned what i wanted whenever i wanted lmao, so i need some help on how to play this drytron deck",
            "So from what I understand, unless Konami apologized and then gave us the retroactive rankup reward from now on or just made rankup gems in Platinum higher, there's no difference between reaching Platinum I or camping in Gold?",
            "Most True Draco players don't use the earth one. What's wrong with it?",
            "To every Eldlich player who saw me first turn use Legacy of the Duelist, read the card and resigned immediately, I salute thee. \n\nI've been running out just because Heroes rarely need to set cards and dealing with back row removal is the big issue of the deck. The fact there's one card that just does everything and isn't once per turn is like you've gotta be kidding.",
            "No question. I just wanted to say I’m super salty because I just lost back to back duels with my opponent on 100LP. I’m still pretty new so I’m sure I made some suboptimal plays but it still stings a little.",
            "I'm pretty busy right now, so I'm looking for a deck that I can use for quick daily quest completions. \n\nIs Numeron OTK my best bet?",
            "damn, tri-lyri is so busted  \n\n\ni got plat 1 last season with tri-brigades/sky strikers, but with those decks they had very clear weaknesses and even if i won most of my matches i would still get very stressful losing streaks (and i was playing at the very end of the season because of time issues)  \n\n\nnow i just built a tri-lyri deck, went to ranked literally just to learn and ended up going from plat 5 to plat 1 in no time. i won 16 matches of the last 20. so opressive",
            "Did anyone try running this game on Steam Deck yet? How well does it run?",
            "God lol, spent 40 mins and 26 turns fighting against an Eldlich player with Sky Strikers. He set Skill Drain turn 1 and flipped it turn 2 on Shizuku, and my whole game afterwards was just stalling with Raye's graveyard effect giving me free bodies on board to block attacks while trying to draw outs by throwing Maxx Cs whenever he Special Summons stuff\n\nWas completely losing the game, since I couldn't really put up that much of an effective fight with Skill Drain on (TIL I can't even use Widow Anchor to steal his crap since I need to negate his effect, and apparently I can't negate if he is already negated kekw), and even got desperate enough to equip his Eldlich with my Hercules Base trying to prevent him from direct attacking. He even ran into my monsters with his Eldlich and giving me draws off the equip spell.\n\nHe could have won if he played more aggressively and kept running into the monsters I was desperately summoning to block his attacks, but for some reason he just let his two 500/1800 monsters stay on field in defense the whole time, even though he has two Pleiades he could go into.\n\nHe even sacrificed two tuners I had on the field to block his attacks (an Ash Blossom I stole from him using Shark Cannon and an Effect Veiler set from my hand since I ain't gonna negate his stuff or bring out Needlefiber anyway) for Lava Golem, and I'm like, ummmmm okay, I was struggling to beat over his 2500/2800, and he just hands me a 3000/2500 on a silver platter, plus with its demerit negated due to Skill Drain?\n\nHe eventually got sick of the Lava Golem and used his counter trap to kill it off, reenabling my spells and allowing me to finally search out an Afterburners with Engage to nuke his Skill Drain, and use Hayate to direct attack his 200LP ass to death =w=\n\nReplay available on my profile (737-456-532) if anyone is interested",
            "Yoo wtf is that DD. dynamite bullshit ftk.\n\nSeem to get it very frequently on plat now. Why are people playing this degenerate bullshit?\n\nAlso they had the combo EVERY SINGLE TIME I encountered them. Nothing I could do. Why are decks like these allowed to exist? Even Drytron is mire interactive lol.",
            "Question about dealing with awkward Dino hands!\n\nOpponent wins coin flip, picks second. I go first and open Petiteranidon, Giant Rex, Raigeki, Maxx C, and Lightning Storm. What's the play?\n\nSame situation but this time I go first and open Animadorned Archeosaur, Oviraptor, Terraforming, Lost World, and Ash Blossom. I play Terraforming and my opponent gets priority, passes back to me. What's the play from here?",
            "This event has got me completely obsessed with megalith to the point where I want to build a ranked deck with it. Is my best bet to build an adamancipator megalith deck? Or is drytron a better engine (probably because people would surrender thinking harald is coming)? In replays I’ve seen lots of block dragon plays.",
            "If we're doing the daily stacking thing, do we redeem the other 6 missions right now, or will there still be one day left of missions for the month?",
            "Huge thank you to the players acting as punching bags to help people finish the 100k damage mission in the NR event.",
            "[deleted]",
            "Eva when ban?",
            "I have a question but i don’t know if i can ask here. I’m leaning to play speedroid now, and i have a mecha phantom beast tetherwolf with a token on the field. So Tetherwolf level becomes 7, but then why can’t i make crystal wing with my speedroid red eye (level 1tuner)? Much appreciate if anyone can answer this one for me.",
            "Just waited for my opponent to lose via timer in the meantime they were refusing to respond after my incredible big brain unbreakable board turn 1 combo play strat of \"Normal Summon Sky Striker Roze.\"\n\n*People need time to make their plays, guys. It's punishing people who need more to think.*",
            "Looking for a new deck. Thinking either Spyral or Metaphys. \n\nCurrent fave deck is unchained, the play style is right up my alley. \n\nAlso enjoy infernoids and witchcrafters. \n\nAny one have any recommendations? Thanks!!",
            "Plat 1 with zombies baby lets gooo",
            "So Ive been building ThunderDragons cause the look cool and a friend helped me build one but can I get some suggestions on what to add and remove? I know Allure is good with them but I dont know what to remove\n\nMain:\n\n1x buster blader destruction sword\n\n3x Dragonmatrix\n\n3x Maxx C\n\n3x Ash\n\n1x Wyverbuster\n\n1x Collapserpent\n\n3x Lupine\n\n3x Thunder Dragon\n\n3x Dragondark\n\n1x Dragonhawk\n\n2x Dragonroar\n\n1x Nibiru\n\n1x Feather Duster\n\n1x Sarc\n\n2x TD Fusion\n\n3x Chaos Space\n\n2x Called by\n\n2x Droplet\n\n3x Imperm\n\nExtra:\n\n1x Colossus\n\n2x Dragon Titan\n\n1x Striker Dragon\n\n1x Heavenly Spheres\n\n1x Knightmare Phoenix\n\n1x I:P\n\n1x Cross Sheep\n\n1x Union Carrier\n\n1x Verte\n\n1x Knightmare Unicorn\n\n1x Soldier of Chaos\n\n1x Apollousa\n\n1x Code Talker\n\n1x Goddess of Closed",
            "Why is everyone playing burn and anti-meta now in the synchro event?  I’m not talking about true Draco.  This event has gotten worse and worse every single day wtf…",
            "As far as I know, when I use Knight Captain Roland and Charles' effect on the same turn, I should be able to choose which order the effects go off in EP. Yet the game almost always forces me to use Charles double equip first, and if I choose not to activate it, I don't get another chance to use it after Roland. A few times it let Roland pop off first, but how do I actually get to choose?",
            "How many gems on average does it take to make a new deck? Sometimes I feel like I have all the pieces after only 3k and others I will spend more and not have anywhere near close to what I need. Just curious.",
            "New player here. I am trying to make Cyberse deck, from Accesscode Talker I only lack Ladybug, Code Talker Inverted and Firewall Dragon.\n\nI have around 2000 gems left. SHould I keep pulling that pack or should I just use the Crafting points to get them? Maybe I should try pulling other packs?",
            "help me decide which deck to build! i have been playing Invoked shaddoll dogmatika since the begining and it's getting boring to use. so far these decks have my attention: phantom knights, Cyberdragon, Dinos and maybe synchrons",
            "I swear to God, I rarely play against 60 cards decks, but when I do, they resolve Grass every freaking time. \n\nAlso an undeniable truth, if they force you to go first, they have a kaiju in hand.",
            "Just a quick question, why’s Super Polymerization semi-limited? Also, why isn’t it limited? Is it not searchable? I hear Predaplants are based around it, but with HEROs I remember they can reuse it and that seems pretty good.",
            "# Red Dragon Archfiends\n\nBeen wanting to make a new deck but wasn't sure what. I hit the Synchro pack a few times and opened the Red Dragon Archfiend Secret pack. ***I was wondering if this is worth building and how expensive it is.*** \n\nI'm not shooting for anything crazy meta. I just want a nice fun deck to use. Doesn't have to be S-tier.",
            "I finally managed to clear the Drytron board and I felt really proud of myself....\n\nAND THIS MOTHER FUCKER CAN MAKE A COMEBACK? \n\nJesus Christ what the fuck is this deck? I thought  banishing his whole field would win me the duel but this mother fucker can return with a 4 material Zeus?\n\nHow is that fair?",
            "How to do you get gems effectively since login only gives me 20 gems now?",
            "When is Decode Talker Heatsoul gonna be in MD  if they continue release cards at this pace?",
            "I tried to log into my old account after deleting the game, but i got this warning message:\n\n“Already linked to another account.\nPlease note that if you continue, the linked\naccount will be overwritten.”\n\nHow can i do this !!?",
            "are there any versions of {system down} for other types? \n\ni love \"fuck you, specifically\" cards and this is probably the most ridiculous I've come across so far",
            "So I understand when my Harpies get skill drained, they're no longer considered \"Harpie Lady\" since that's an effect, so they don't trigger Harpie's Hunting Ground and I can't use Elegant Egotist if they're the only things on the field.\n\nWhile I know that the numbered Harpies are always considered Harpie Lady, so that can't be negated anyways, does something like Cyber Slash Harpie Lady count for things like activating Hunting Grounds with Skill Drain active, since she has \"Harpie Lady\" in her name already? Or does it need to be Harpie Lady exactly, and not \"contains Harpie Lady\"?",
            "[deleted]",
            "I saw a deck in ygoprodeck containing branded fusion is this card banned?",
            "Somehow I have 283 gems. How did my gems end in a denomination that's not 5 and how do I fix this?",
            "Finally got to Plat 1, now all I get is 80% Numeron matchups. Might be the most boring experience I've had so far playing this game",
            "Why is PK rongho considered unfair/op when it's not even listed on masterduel meta ?  \nDoes anyone know what's the next good meta deck coming with the nexet pack ?",
            "Gameciel or Kumongous in Adamancipator?\n\nGameciel is level 8, so if I can get a level 2 tuner and him on the field I can summon level 10 synchros like Baronne De Fleur, also it has the lowest attack.\n\nKumongous is level 7, which is an awkward level because I'm only running even number synchros and main deck monsters (tuners and non-tuners), but he is an earth so I can send to grave to summon block dragon and synergises with other earths like gigantes. It also has pretty low attack at 2400.\n\nSo which should I run?",
            "What does a Speedroid deck usually want to do with {Speedroid Rubberband Shooter} at the end of a turn? His effect is useful, but he can't be linked away for anything else since you're locked into Synchros by the time you use his effects. And leaving a 1000 ATK Link on the board is a tad awkward. Do you just leave him there in hopes to use his potent effects again next turn?",
            "I just found myself in this scenario\n\nOpponent has Eldlitch + Skill Drain on the field. No other cards\n\nI have 1 gren maju (0 atk from skill drain) on the field, and I could normal summon another\n\nWas there any xyz rank 3 that could do anything about skill drain? Or was it a lost cause?",
            "Hello, Im a new player reading through this.\nIt mentions buying secret packs, but when I go to that tab it's empty?\nMost CCGs have you buy packs for specific sets, but all I see is 'master pack'",
            "Thoughts on including 1 Zombie World in a non-zombie deck? My deck doesn't care about monster type and doesn't tribute summon.",
            "2 games today where I opened 3 maxx c + 2 ash. Something is off, because what are the odds of that",
            "Just built a Thunder Dragon deck, going the pure route + Ready Fusion for easy Baronne access. I'm starting to have a pretty decent idea of how to pilot the deck from just messing around in solos and in ranked, but what are the bread-and-butter openers and extenders? How can I consistently set up the Buster lock, or end on more than just a Colossus and/or Titan? I know Verte Anaconda is essential but some of the replays I've seen on YT don't really showcase using it.\n\nAlso I pulled an Iris Swordsoul from one of the packs while trying to make the deck, and it unironically seems like a good one-off to splash in (otherwise I'd just run a 3rd Matrix). Current decklist: [https://imgur.com/a/5982Cco](https://imgur.com/a/5982Cco)\n\nEdit: Master Duel Meta seems to have the Chaos variant as the more popular option, would like some opinions from more experienced pilots of the archetype on whether I should go pure with the fusions or go Chaos.",
            "I’m crying of happiness bc data miner revealed that Cyberdark support are already in the game.",
            "Sooo, I will ask in advance, how do you counter DPE?",
            "Gonna be wild as hell to see TriZoo, VFD, Buster Lock, etc duking it out against DPE Adventurer PKnights, Adventurer PKids, Swordsoul with Protos, Floo, Exosister and so on.",
            "Using overload fusion and getting \"FILE LOAD ERROR Duel/Timeline/Duel/Universal/Summon/SummonFusion/SummonFusion08_01/SummonFusion08_01\" anyone know what's going on?\n\nEdit: Summoning Chimeratech Overdragon using 8 materials. Also had it when using 6 materials.",
            "Getting cannot connect to server window, it doesnt want to start the game sometimes on ps4. It never happened before last 2 updates....and ofc thats counting as a loss to me if Im in the game or trying to start a match, and my connection is 70-100 mps. Nice just nice 👏🏻👏🏻👏🏻👏🏻",
            "https://imgur.com/a/gXZ78Yo\n\nMy current SS deck, I find it kinda hard to go past plat at this point, any improvements I can make to my deck. Also, I can only craft like 3 UR max for now.",
            "Any advice on the proper use of Prosperity in IDS? I'm not questioning its usefulness, but I have trouble to decide on what to banish for it, and whether I should ever use it for 6. Especially with the DPE package, every ED card except the fourth Shaddoll fusion feel too valuable to throw away. A few are only situationally useful, but on your first turn it hurts to remove them from being an option.\n\nEdit : Another IDS question : assuming both options are available, when one should go for DPE and when one should go for the Dogmatika-Schism line?",
            "Now that Lord of the Heavenly Prison is a thing, I was wondering if I could make one decent Egyptian Gods deck (yes, Soul Crossing). Doesn't need to be even rogue tier, just something that is not just a loss, with some annoying disruptions etc.",
            "Should i make ghost belle\nSuper poly\nPrankratops\n1 more effect veiler to get 3\nOr dark ruler no more?\nAnd how much do you recomend having for now?",
            "Aight, blew all my gems on the selection pack for Swordsoul, and managed to get three Mo Ye and a Chixiao. I’ve got 150 UR CP at the moment, and 90 of them are going to a second Chixiao, Chengying, and Baronne. Are there any other really big URs I should consider crafting specifically for Swordsoul?",
            "I’ve played against quite a few swordsoul decks using Imperial Order and I’m starting to believe y’all just enjoy being toxic as fuck",
            "Is anyone else having issues with connection? I’ve surrendered 4 games in a row due to connection issues on fusion event but have had zero connection issues when I played ranked instead. Is this a bug or something?",
            "How has it been for you to farm URs? I've opened like 10 packs within this month and only received about 60 UR crafting--and a handful of cards I need to build a deck. I'm thankful that I got a lot of SRs (cause most of the key cards are these), but I need 210 to get 2-3x Ash Blossom, Nibiru, Grave, and Crossout. 300 for IP. I'd dismantle to some URs, but I wonder if they'll be good with upcoming support, like Thunder Dragons, Rikka, or Darklords. \n\nSide note: I hate that we can't dismantle gift cards. I get that they don't want to abuse the system (especially with Structure Decks) but for the Legacy Packs/Tickets, it's really dumb that I have cards that I will never use, like 5x of Overmind Archfiend, 3x Barrel Dragon, and Pluto.",
            "This is dumb but can opponent's Slifer use my monsters as tributes? I checked the card text but it doesn't give me anything. They also had a slime that generated tokens on field. Again, nothing about using my monster as tribute like Kaijus. They just wiped my entire field and attacked for game. Needless to say, I am dumbfounded.",
            "10 fucking games and I never opened with Terrortop yet I managed to get Shade Brigandine and the D-HEROes in my opening hand four goddamn times.\n\n\nIf you have a bad day don't even try to play this game",
            "Noob question:  \n\nI summoned a monster that says cannot be targeted by card effects. Opponent summoned a monster that had some ability to banish a monster when summoned and was able to banish the one I’d summoned. What’s the mechanic here?\n\nI realize knowing exactly what card the other guy played would probably be useful here but I forgot to note the name. For sake of argument, if the opposing card had an ability to ignore other cards effects would that negate my card’s immunity?",
            "What's the quickest solo duel to play through for the daily achievement for 3 solo duels?",
            "Some cards allow you to synchro summon during your opponent's turn using itself and other cards as material. \n\nWhat are some of the best targets for your effect? I assume cards with effects that start with \"if this is synchro summoned\".",
            "When did the game start gaining these autolose afk decks? All of em have the same 5 card Extra Deck and timeout after the first moment of interaction.",
            "Is there some kind of bot pandemic going on? I've literally played 5 matches where my opponent does nothing and the game just ends.",
            "Just want to give a quick shoutout to the three stall bots that gave me a 3 win streak to hit plat for the first time",
            "I want some suggestions for decks that are meta as well as being fun to play .",
            "OK, I *really* hate the way that {Gozen Match}/{Rivalry of Warlords} prevents you from performing an extra deck summon of a monster, even if performing that summon could *only* be done by removing all monsters of other attributes/types from the field. If I only have a Water monster on my field, and the only monster I could summon is a link-1 Fire monster that must use that Water monster as material, what does the game *think* is going to happen when I perform that action? There's no card or mechanic that would allow both the Link monster and its material to be on the field at the same time. I would understand it if most extra deck summons worked like {Magnacarrier}, where you summon the thing and then attach materials/remove materials from the field. But they don't. If you negate the summon of an extra deck monster, the materials are still in the GY before that happens.\n\nYes, it's an official ruling, but it seems to me to be a *stupid* ruling that goes against the actual progression of actions in the game.",
            "https://imgur.com/a/W90zLT9/\n\nGood day! First time posting here and I’m a slight newbie. I just want to ask how did nibiru activate even though I have chaofeng? Reply will be much appreciated, thanks",
            "So many stupid cards in MD that deserve to be banned but haven't because then konami would need to refund UR dust. Ugh",
            "Do we get rewards since the season just ended for how far high we ranked ?",
            "Anyone have a Tri-Brigade Ferrijit wallpaper at 4k? I'm trying to find one of her card art at that size and can't find it anywhere. Thanks in advance.",
            "I wanna try masterduels but unlike duel links from what I’ve seen there’s so many different decks and card effects, idk how I’ll be able to keep track of all of them and that’s whats been putting me off. How do you guys do it? Do you just need an understanding of your own deck and do your thing?",
            "I have no idea if I'm fucking cursed or something but I manage to draw a destiny hero in my hand like every other game. I run two fusion destinies and one celestial and dasher and over a hundred games I've only seen fusion destiny like twice. I'd normally just chalk it up to confirmation bias, but I took a screenshot every time it happened and sent it to my friend. Idk, I just wanted to rant because I'm so pissed about drawing destiny heroes in my opening hand every game.",
            "How is everyone finding ranked using swordsoul this season? I’ve been seeing so many floodgates that completely stop anything I do. These opponents typically know to prepare for a vishuda, if I’m even able to use one at all. A couple days ago I wasn’t seeing nearly as many floodgates, but the past two days it’s been often enough that it has severely affected my winrate.",
            "wtf, how is there ALREADY an AFK bot in plat 2?",
            "i am making a dragon link that uses 3x of starliege seyfert, which can be found in the structure deck \"rage of cipher\". is it worth just buying 3x of that SD for 1500 gems or do i just use 90 SR points?",
            "I really want to rank up to diamond to get it over with but I know I'll regret it when an event is eventually announced because Konami's event banlists are a joke and diamond players are insufferable about it.",
            "Bruh I'm encountering alot of bots like for every 5 duel there is 1 real person this shit sucks",
            "My Master Duel initiation continues. A few weeks ago, after playing for 3 months, I finally Ash'd myself. Today, I played a spell in the same column where my opponent had literally just activated Imperm. I still won but it shouldn't have been close.",
            "I'm surprised that OP hasn't made a guide on Swordsoul, considering how prevalent it currently is.",
            "Is there anyway to look at a card close up? Just trying to appreciate some of the artwork",
            "With the new Cupid Pitch, I was trying to incorporate it to my auroradon combo in Swordsoul. However, the level modulation is really screwing me when I'm trying to go into Yazi. Anyone have any suggestions?",
            "Are the bots gone? Seems infinitely better than last week",
            "Anyone got any counters to DPE that aren't \"just draw the out\" aka Called by the Grave? Ideally something that fits into a reasonably generic extra deck.",
            "What's the difference between this game and Duel Links?",
            "How much time is left to complete the duel pass?",
            "What was that update on console today for?",
            "If I'm only interested in pot of avarice and utopia from the utopia structure deck, is it financially wiser to buy the structure deck or craft them?",
            "Can anyone tell me why this deck isn't ok in the only 1 event? I swear I'm not seeing any duplicates/forbidden cards, thanks in advance  \nhttps://imgur.com/a/QGV4kpl",
            "Not *really* a question/help but just a minor vent. I've been extremely unlucky pulling in the Blooming in Adversity pack. I wanted to build a plant deck for fun but it's costed me over 10,000 gems at this point and I've pulled:\n\n* Zero Aromaseraphy Jasmines\n* Only one Rikka Queen Strenna\n* Only one Teardrop the Rikka Queen\n* **Five** Aromaseraphy Sweet Marjorams\n\nI still need three cards to complete my deck (I ended up crafting one Jasmine just to play the deck in the event) and given that's three whole URs it's still worth pulling, but... Man, it sucks that I can't get the cards I want.\n\nI also got a Royal Finish Lonefire Blossom. Which is nice. I honestly would've loved if it was Staysailor Romarin instead though, her art is adorable :(",
            "is the new selection pack worth pulling? anything in there that might be meta soon ?",
            "Chaofeng in Swordsoul/Tenyi\n\nWhat scenarios/matchups would you say it thrives in? What does it do for the deck?",
            "Are all the random cards in duel rewards completely useless? I have yet to see anything from it that even stops at bad, bad is much too nice of a word.",
            "the good news: i finally completed my code talkers deck and it's tons of fun as well as quite decent\n\nthe bad news: i can barely play because my turn 1 lasts like 5 minutes and everyone gets bored and disconnects\n\nthe good news: free gems",
            "What's the easiest/cheapest deck to built from the universal cards (mostly links) from the Live twins deck? Example cards like; Unchained abomination, I:P masquerena, Mekk knight avra.",
            "[deleted]",
            "Can you use crossout designator to negate an opponents crossout designator?",
            "Swordsoul players, what's your most important extra deck monster? Definitely not asking for a ghost reaper target.",
            "Is it worth investing in the DPE package or do you guys think it will it banned before long and i  should invest my point elsewhere?",
            "9 games in a row going second and not having a single hand trap resolve. Is the game fucking with me?",
            "What's a good toolbox type deck I can try? I like non-linear decks with a variety of extra deck options that I can go for at any given time depending on what I need.\n\nFor reference, I play and enjoy speedroids and crystrons deeply.",
            "Returning players rolling a new account (haven't played for 4 months). What are the important things to know? Do they nerf Swordsoul?",
            "**PSA to sword soul players.** \n\nIf your opponent wins the coin toss and lets you go first, he's either a Numeron Player or a Kaiju Luna player.\n\nEither way, don't over extend your combo, make sure you get Protoss on the board, declare light and pop your own Chixiao.\n\nNumeron players can't summon Numerons, Luna Kaiju players can't OTK you with the Draglubion > Numeron Combo.\n\nAs long as you have follow up you win on turn 3.",
            "just took the maxx c challenge for no reason because I accidentally toggled off while I had crossout designator x.x",
            "Hey is the new forbidden droplet bundle worth buying?",
            "Maybe I'm missing something but for some reason I wasn't allowed to activate DPE's effect in response to Live Twin Ki-Sikil. Here is the situation:\n\n**First Chain:**\n\n\nChain Link 1: I activate Fusion Destiny\n\nChain Link 2: Opponent activates Trouble Sunny's effect to tribute her\n\nChain resolves:  \n1. Ki-Sikil and Lil-la are special summoned from the graveyard\n\n2. DPE is succesfully fusion summoned to the field\n\n**Second Chain:**\n\nChain Link 1: Opponent activates Lil-La's first effect\n\nChain Link 2: Opponent activates Ki-Sikil's first effect\n\nChain Resolves: Opponent draws a card and destroys my DPE\n\nThe game didn't give me the option to chain my DPE's effect. No other cards were in play, my opponent had 5 cards in his Spell/Trap Zone but they were all set. No Field Spell was active either and the toggle was set to \"Auto\".\n\nCan someone explain?",
            "What's the best way to learn how to play besides the app?",
            "Maxx C keeps combo decks in check yep, no combo decks use it the next turn after they make their board...",
            "Is drawing and adding cards to hand treated as different effects? If I'm under droll lockbird, I can't search cards, but can I still draw with pot of desires?",
            "Does anyone find it impossible to rank up this season? I’ve been playing since the game launched and have been max rank every season so far. Last season was way more difficult than previous seasons due to adventure being introduced, but I was still able to get max rank by mid month. \n\nThis month however has literally been impossible to even get out of platinum. No matter which deck I’m playing or hand traps/board breakers I’m using it doesn’t seem to matter most of the time. Literally every player is running adventure tenyi, eldlich, or floow. These will completely stop you in your tracks if you aren’t prepared, and their counters are completely different from each other so it’s impossible to build a deck around it.\n\nAdventure tenyi is by far the most popular and seems to end on an insane board no matter how many hand traps you negate them with. It probably doesn’t help that I haven’t been playing as much… but that’s mostly due to the fact that the game feels so repetitive and unfair, to the point of being unplayable.",
            "Anyone know what's the story behind cards like {{Fukubiki}}?.\n\nI also saw another card that was something like \"matching set\" where the little demon kid had a matching shirt with some old guy.\n\nI'm interested to know if there are any other cards about this guy's shitty day.",
            "How good is Beetrooper? The aesthetic looks super cool so I sort of want to build them but...I've never been so underwhelmed by the effects of an archetype's boss monsters. Maybe I'm crazy but it seems like they have no disruption whatsoever.",
            "Y'all...I have to share. I managed to pull off the seemingly impossible. Hang with me.\n\nSo, I'm at Dlv 19. Against my better judgement I decided to give the push to Max a go this morning. First game I get heads. Ad Pranks mirror match. Manage to pull it out.\n\nSecond game, get heads. Another mirror match I manage to pull out (I feel bad because it was their level up game, but I'll be damned if I'm giving up wins at this point).\n\nThird game....the coveted \"Level up\" banner comes on my side. I get nervous sweating. Coin flip -- Tails. Fuck. Opponent decides I go first. Triple Fuck.\n\nI get a shit hand, but I'd planned on passing anyway and praying opponent doesn't have {Limiter Removal}. They thankfully also pass. I draw my second Ash, pass. Then comes {Numeron Wall}. Do or die time. No Limiter, they hit me for 4000. They then go into {Number C1: Numeron Chaos Gate Sunya} and I play Lancea, killing their ability to banish.\n\nLong story short, I was able to turn it around. Was able to combo without interruption. Had Bow-Wow, Lampsies, Gryphon and Token on my side. Their turn I activate BW during Draw Phase, they Golem my Gryphon and Token, then activate Numeron Network. Their guys hit the field, I fusion Butler and activate his effect and they scoop! \n\nI hate Numerons and I was fucking ecstatic to be able to not only pull out the win, but do it on my Level Up game!",
            "Fam,\n\nPlease, sit down while I tell you the story of peak \"I did something so amazingly embarrassingly stupid I want to delete my account, bury my devices in a desert and never play Yugioh again\".\n\nSo, in anticipation of the upcoming banlist I went to see how many VFD I owned. 0. So, I thought I'd press my luck and see if I could craft one with a finish to get the crafting bonus after the banlist goes into effect.\n\nI got every Master Duel player's wet dream -- a fking Royal Finish VFD. THIS WAS AMAZING so I thought I'd craft 2 more just to see what I'd get because at worst I'd just get back the crafting points I used....\n\nEXCEPT I'M THE FUCKING STUPIDEST PERSON ON THE PLANET BECAUSE I FORGOT THAT YOU ONLY GET THE +20 BONUS ON COPIES BETWEEN THE CURRENT AND THE NEW BANLIST WHICH MEANS I ONLY GET IT ON ONE.\n\nSo instead of getting +20 I'm now -20 because I'm a fucking moron and I have so much shame.",
            "Any good Sky Striker guides? I feel like I dump my spells way too fast and cant do shit after",
            "Is Marincess a good archetype? Was considering building that on MD and in the TCG with release of one of the recent booster packs that has most of those cards. Would rather learn how to pilot the combos first in MD before I invest in the physical cards though. Any good combo guides for that deck?",
            "Do ppl consider bagooska as an oppressive flood gate? I’m using it in my live twin deck and I’ve saw quite a few ppl surrender after just seeing parallel exceed. I’m trying to limit the use of floodgate and I feel like bagooska is breaking the rule.",
            "Dear Endymion players, what is the common handtrap target to disrupt your plays?",
            "Can anyone help me with getting master duel on steam? I tried MD on steam when it first released but then didn’t play again until mobile. I created a new account and Konami ID to link/use mobile and since my steam profile already was used to play solo I can’t go back and link it. How can I link my mobile account to steam to have all my cards?",
            "what does snow rabbit counters nowadays? ive seen it on the masterduelmeta alot",
            "When i summon monsters like Borrelsword dragon, accesscode talker etc that requires 2+/3+ effect monsters to summon. Is it required to tribute all my monsters on the field? Can i tribute only the amount required for their summon?",
            "Can a zombie world deck without halqi be good? I like the  way zombie world decks play, but I'm not really willing to craft a halqi.",
            "Since Dogmatika Fleurdelis do not target, i can negate monsters who says \"this card cannot be targeted\" right?",
            "I'm a rather new player (started in June) compared to the rest and have a question about the community, this subreddit specifically.\n\nMaybe everything I'm about to say is completely wrong but I noticed that whenever new cards are being announced, people are getting really hyped about them and say that they can't wait to play with them when they release.\n\nBut once a deck becomes so good that it's meta thanks to the new cards, everyone suddenly starts hating them. Some people tend to go way too far and even hate the player for using the deck. \n\nThen if a new meta evolves and the deck becomes weaker, everyone goes to back to the old opinion and says that the deck is based and cool.\n\nI bet everyone says that playing Zoodiac Tri-Brigade is based now just because it's not the top meta deck anymore.\n\nA good example for this is the Branded/Despia Archetype. Mirrorjade will come out soon along with Branded Fusion and according to what most people say, it will become a very strong meta deck.\n\nI predict that in a couple weeks from now on people will start saying how toxic and unfair Mirrojade is and how it's not healthy for the game bla bla bla.\n\nLet's say this is objectively true, but if it is, why bother getting hyped about the card in the first place if you will inevitably hate it anyways?\n\nThis mindset seems so weird to me. And then after a couple of months you pretend that you never hated the card at all and start liking it again? \n\nCan someone explain the thought-process behind this?\nI'd be glad if a veteran player could share their thoughts about this too.\n\n\n**TLDR:**\n\nPeople are getting hyped about new cards, then start to hate them when they become part of a meta deck. After they fall off the meta, people like the cards again and say that it's cool and based to play with them.\n\nIs this statement true or false? And if it's true why do people have this kind of mindset? Seems weird to me.\n\n\n**Edit:** btw, I don't try to generalize the community. Of course this doesn't necessarily have to apply to anyone.",
            "Any good decklists for the new Branded Despia? I want to modify mine with the new support (2 Mirrorjades, 2 Lubellions, 3 Mercouriers, 2 of Branded Fusion and Lost is what I've gotten after 7 10-pulls). I can craft an additional BF",
            "I'm crying in the club so much rn. I keep pulling bozo vampires, blue-eyes and ghost tricks ffs. I just want 1 sinister please! I'm already down 15k!! 😭",
            "Why is mercourier only a 1-of in branded decks?  Lack of space?  It seems really good and has synergy with the deck",
            "The next deck I want to play with is Branded Despia.\nI was looking at the different combo lines you can go for with the deck.\n\nThere is always one point of the combo where you have Mirrorjade and Aluber on your field. \n\nYou want to activate Mirrorjade's effect to send Albion to the graveyard which allows you to set Branded in Red in the End Phase.\n\nI get all of that but why does every guide and video out there say that you have to banish your Aluber? If he is banished, he can't use his graveyard effect to negate.\n\nIsn't it better to banish Mirrorjade himself instead so Aluber ends up in the graveyard when used as Fusion Material next turn?\n\nAd Libitum can special summon Mirrorjade from the graveyard OR banished zone anyways and you have enough material to summon Guardian Chimera (Aluber+ Ad Libitum + Despian Tragedy).\n\nSo, is there anything I'm missing here? If yes, please tell me\n\n**Edit:**\n\nPleass forget everything I just said lmao\n\n I just realized that Branded in Red actually BANISHES the fusion materials. For some reason I though it sends them to the graveyard. \n\nIn that case it doesn't matter who is banished by Mirrorjade's effect.",
            "Can somebody help me find the nsfw image of gameciel getting rid of herald that was posted on this sub a while ago? You know.... for research purposes.",
            "Hey. I am looking for a new fun deck to start building. I keep seeing this Dragon Link deck and it looks interesting. Also I hope it wasn't just an abuse Halq deck and it will crumble? \n\nAmyone have any other suggestions. I play all deck playstyle, so I am open to anything.",
            "Can you demote tiers in the event? D5 to P1, P5 to G1 etc.",
            "I just won my first time because of the timer and I feel pretty bad for the opponent.\n\nGranted, due to the BS that is Maxx \"C\", I would have anyway, but still. I think the timer needs some adjustments, but I still appreciate how they tried new things cause the old timer was also just too long. There has to be a middle ground.",
            "What's the Marincess chokepoint? Curiosity if I ever get enough hand traps for it.",
            "Where tf is the choke point for Endymion? No matter where you disrupt it feels like they can extend forever",
            "I swear you either win all the coin tosses or lose all the coin tosses on any given day had a 5 game lose streak and then a 7 game win streak and another 5 game lose streak",
            "I need advice on what secret pack to go far.\n\n**(Details. Can skip if not interested)**\n\nI have minimum experience with normal Yu-Gi-Oh. I've played duel links and follow yugitubers like hard leg Joe, duel logs, and dzeef so I have a very basic understanding of how things work. \n\nIve played master duel for a week and made severe mistakes I regret so I'm starting fresh. I know what the top meta is thanks to the master duel meta site but I'm not concerned with top meta right now. \n\nI just want to play something I enjoy. I'll craft staples and meta decks later. It seems the secret packs let you built competent decks so I've looked through them all.\n\n**(Question)**\n\nWhat's the general power lvl of these secret packs/decks and which do you recommend?\n\nPearlescent Cyber Dragon/**Cyber Dragon Deck**\n\nDreadnought Advance/**Dreadnought Deck**\n\nGlacial Seal/**Ice Barrier Deck**\n\nGreat Shogun's Rule/**6 Samurai Deck**\n\nPlease and thank you for your time.",
            "Why would anyone play Floo in D1 bruh.",
            "Saw the post yesterday about Madolche being super good. I main Madolche but I still struggle to climb the ranks. Main deck is pretty much what's on masterduelmeta. I really only have the madolche cards in my extra, could that be the problem? Also how do I play past negates?",
            "Is six samurai viable in ranked, i really love the archetype but im not sure if they are good enough",
            "What am I supposed to ash when facing D/D/D's?",
            "Maybe we should have a separate thread for people looking to make teams?",
            "Why can't you dismantle cards that you pulled from a pack, when they are also part of a structure deck or a reward?",
            "[deleted]",
            "Decided to build Scareclaws so I'm planning on using all the gems from the upcoming event towards that, but I had a tiny amount of paid gems left on another platform and worked it out so that I could buy 3 of the new packs with the exact amount so that I'd get rid of the paid gems. Got 3, and on the last one I pulled a royal Tri-Heart. Cannot believe my luck right now :D",
            "dang just played againt marincess, i went second and he had 6 negates already LMAOOOOOOOOOOOOOOOOOOOOOO",
            "I just started the game today and I really wanted to make a cyber dragon and stardust dragon deck. I pulled one multi on their respective secret pack. I was wondering if it's dumb to dismantle every other card that I don't plan on ever playing so I can get mats to craft the cards I need. I'm mostly playing with friends who like me haven't really kept up with YuGiOh since the beginning of synchro.",
            "is branded despia too much of a reach to try to build for someone that just downloaded the game?",
            "My Branded Fusion just got negated by Marincess Argonaut, even though I had Branded Lost on the field, which I thought would stop it from being negated. Can someone explain to me why that is so?",
            "[deleted]",
            "Is the matchmaking in Duelist Cup using season ranking or duelist cup rank? I wanna know if I can rank up in both without the fear of getting my ass handed to me in duelist cup by plat players.",
            "Am I just a noob or is super poly actually kind of busted?",
            "Is there a visual/picture guide for quick reference for branded despia combos ?\n\nSimilar to the ones in the link I mean\n\nhttps://www.reddit.com/r/masterduel/comments/wr1tfv/combo_guides/",
            "Hello, new to the game here. Should i claim the bonus pack that needs the weird currency which I have 1 of?",
            "Are any of the structure decks worth buying?  I stopped playing for a while and came back to several tempting decks... I'm not in the know when it comes to meta for this game in fact my ranked deck is very much anti meta... But occasionally I want to try to play this the way you crazy kids do and I recognized the maid waifus, the cyber dragons, and the fire lizards... I also saw someone talk about ice barrier?  Like... Holy crap I loved that deck though I always thought it was bad. \n\nSo guys care to help this scrub decide if it's worth it?",
            "Hi guys, whats the best deck to counter the heavy spell decks in high ranks(ruinivk, despia,...)",
            "Where do people get the notion that any deck that isn't tiered is trash? Sounds like a skill issue...",
            "I was playing against Floowandereeze, and i summoned Despian Quaritis (with normal poly) to kind of bait apex Avian into using his negate. But i couldn't activate his effect at all.\n\nWhy is this? I didn't particularly pay attention to all his plays, but what can a floo deck do to stop my Quaritis from activating his effect, while the monster itself isn't negated with inperm for example.",
            "What is the combo using the three Vampire core cards? What if you have ghost and no other Vampire card? Do you use Uni to get the vampire plays started or would it be better just to set up Doomking?",
            "Maybe I am just not seeing the picture or have the extra deck but why is Cyberstein being run with Runic? Sorry if it's obvious but what's the general thought",
            "What cards \\[single cards\\] are ruining your Dueling experience? \n\nSuper poly for me. I had to fight incredibly hard to get into Diamond with a D/D/D deck \\[all monsters are dark\\]. By discarding a single card the opponent takes out my boss monsters. \n\nObviously Runick Fountain is the other. And Skill Drain.",
            "Hi all, I'm new to the game and this sub, and have a question for you all. As a new new player I´ve taken all the beginner tips to heart like: play solo first, buy one-time bundles first,  buy the duel pass and buy card specific packs. The problem is I'm still fairly short of cards for the Blue-Eyes deck I want to play(13 UR short). I know the best way is to play games with the duel pass, the only problem being I don´t have a completed deck yet. So I'm basically asking what starter/structure deck is the best to play normal games with and not get completely ruined. I´m expecting to be bad because I'm new. I just don't want to be bad because I get OTKd every game because my deck has no hand traps/counters to deal with them",
            "Should we not soon be getting the extra missions for gems? Seems like in past events we had them by now this far into them.",
            "Seriously, is this a solitaire simulator? I played Runeterra, Hearthstone, Elder Scrolls Legends and Marvel Snap as well as Magic the Gathering and never ever in my life was I not only overwhelmed but utterly bored as the enemy needs 5 minutes to create their awesome combo turn with 5 fusionxyzwhatever monsters while I have a normal summon, a bit of graveyard synergy and a trap that can take out ONE monster.",
            "Omfg, can you turn off that missions tick off one by one, now??? Who the hell asked for this to be a thing?",
            "Why in the actual fuck is everbody playing nibiru now I havent seen it in months before today and got hit with it 3 times today. I'm about to become the joker",
            "Runick is so easy to play. I don't really understand how it works, but everyone surrenders within a few turns so I don't have to and i still win.",
            "I'm struggling with my runick spright deck. I know I'm toxic Yada Yada but it's my first meta deck I've built and not sure how to properly run it. \n\nIf I get hit with Maxx C do I play through it? If not where on the board should I stop?\n\nI usually go giant spright to spright blue to jet. Should I prioritize one of my negates over jet?  \n\nI feel like IP masquerade is a big part I don't know how to use.",
            "This last week I've noticed that I'm running into more and more smooth brain Dark Magician players running skill drain. \n\n&#x200B;\n\nWhile it is endlessly amusing to watch them pop it and cripple themselves, does anyone know why this is a thing all of a sudden?",
            "What do I do against Ishizu Adamancipator, the deck seems extremely busted and is able to easily put out like 5+ negates turn 1 + the shufflers in the GY. Where are it's weak points?",
            "At which point of a Spright deck's opening combo should I use Ash Blossom?",
            "Why are there 3 cards with the name Lubellion (XYZ, Fusion, Bystial)? They're not connected in lore?",
            "New to master duel, playing mathmech. can someone explain why IP masquerena is a core card and how its supposed to be effectively played? I assume its for protection whenever you go first, but my end board at turn 1 generally consists of a decode talker heatsoul and the masquerena - if i wanted to get an apollousa or unicorn out, i'd have to tribute both those cards. is it worth it?",
            "Red eyes zombie dragon lord should have gotten an animation. I think the zombie structure deck might be the only structure deck without any summon animation in it",
            "[deleted]",
            "Just wanna get this outta my chest and it doesn't deserve its own post.\n\nI think I just realized how much I hate \"our turn\" decks ala Floo and Tear, I'd rather be faced with multiple negates as a puzzle I need to solve than those bs, maybe its just the MD interface that makes them feel like a slog to deal with due to the Chain Links animation.\n\nIts basically the same reason why people hate decks that combos for too long i guess, but in these case they hide it by playing bits on both turns.\n\nI didn't really mind things like I:P, Mathmech, Branded in Red - Chimera, among other stuff because most of it is like 1-2 action, but Tear/Floo might as well be doing 10.",
            "Not a gameplay question, but, i just played against someone named \"TearsRFags\" would i be an asshole if i reported them?\n\nI get it if you hate Tear, but that kind of name is just uncalled for. So many other words you could use as an insult.",
            "Is tearlaments ever gonna die? I havent touched the game at all since their release. I dont like seeing their power level on master duel meta.",
            "I just got Puppet locked.\n\nFuck man, this is so dumb...",
            "Holy shit this loaner Ghoti deck is so bad... I've bricked on assault synchron (can't make synchros without water tuner) and traps like 3 times, plus every deck is apparently running 3 ash 3 maxx c... Why can't they match loaner decks against other loaner decks? (or just ban ash+maxx c from the format like the anthology event...)",
            "with the Synchro event going on, I wanted to try my hands at a deck I've never experienced before: synchro zombies.  problem is, I can't seem to find a good guide on how to actually play them.  I want to make a budget version using the structure deck.  I pretty much have unlimited SR craft material, but I want to be reserved with the UR crafts that I have as their are a lot of decks that I want to try out.  any advice and basic combos that I can build off of would be appreciated, thanks \\^\\^",
            "I just played against someone who after getting 2 numbers eveil negated activated left arm offering and activated a 3rd… followed by a sales ban. How the fuck is this garbage legal? Don’t care of it’s inconsistent, this is unhealthy trash that needs to be addressed. Happened in diamond 1.",
            "Can someone explain what Inspector Boarder does? I encountered for the first time and basically I couldn't activate any monster effect while my opponent could. If it does that why is it not banned, and it had decent stats. He completely shut me of the game.",
            "Hi could anyone watch my replay and tell me what I could've done better? I end up winning but I'm pretty sure it was sheer luck because they didn't negate my Dark Fusion.  \n\n\nID: 776-176-035 it's the only replay available. Hero deck vs Blackwing, I couldn't read much about their cards' effects because otherwise I would've lost by time-out but I'm pretty sure I could've done better on this match. Any tips appreciated thank you",
            "any staple suggestions for climbing in this meta? \n\nmost games i played since the past few days are either labrynth or purrely, i feel like if i put in anti-purrely cards, i autolose to labrynth and if i put in anti-labrynth cards i autolose to purrely lol\n\nmostly been playing punk with some tri-zoo (and numeron if i get really really tilted)",
            "What did Dkayed leak on today's stream? (Other than Manadium)",
            "Long time returning player here, I have a near-complete Swordsoul deck except for Barrone, Chaofeng, Longyuan, and Draco Berzerker. \n\nMy question is which of these ED monsters are most important to get first and which ones are 'nice but not necessary' cards?",
            "No question, but can I share something here? I'm a long time yugioh fan since the 90s but only started playing Master Duel 10 days ago. I love the Silent duo and been playing various decks built around them (mostly Swordsman) since 2008. When I was playing YGOPRO for a couple of years I met absolutely no one playing them. But just now I met someone played Silent Magician (Spell Book) in Master Duel. After the duel I went straight to follow them just to see they already followed me, totally wholesome! ID \"ThsHurtMeMor\", if you're here, I want to let you know that it was a fun duel, I tried building Silent Magician Spell Book too (in 2017) but my deck was much worse than yours, would be great to duel with you again.",
            "5 games in a row going 2nd. \n\nLost because their last card in hand was Maxx \"C\".\n\nIt's unbelievable how braindead someone has to be to defend this card. Actual brainrot.",
            "Bruh it's hella infuriating how meek cant be special summoned if riumheart has different stats just because of the field spell, this shouldn't be a thing",
            "So I was thinking about getting into Punk Gold Pride, but before I sink packs into it, wanted to get an opinion on Punk Therion  first in comparison.  Also I got a prisma Therion Irregular so I wanted to see if it is something I can keep or just dust for another staple.",
            "[deleted]",
            "How many copies of each Diabellestar/Snake Eyes card do You need to play it pure, and as an engine?",
            "\"Do not use without guidance\" You're not my mom you can't tell me what to do! *Crafts triple ojama king and ojamatch*",
            "Anyone has a list of chokepoints for most meta decks right now?",
            "Is there an app for the pc version that can send me a notification when it is my turn?",
            "Ummm how do we find out if servers are down or not and for how long? Went to konami twitter found nothing, same for website nothing too",
            "what rank do people stop insta scooping unless they have maxx c? I am having trouble doing dailies when my only permitted action every game is normal summon live twin into scoop or maxx c.",
            "Your friends seem like the kind of friends that will hate their opponents just for having a good deck that wins consistently.\n\nIf you want a cheap deck that can prove surprisingly interesting, albeit bricky, look into Pacifis/Phantasmal Spiral control. Deck revolves around a field spell and normal water monsters along with their S/T to stop your opponent while you beat them down with a big number stick. Most of the cards are R or N, so it's very F2P friendly to build.",
            "Honestly it seems to be an issue with your friends. Unless you play a deck with 40 Normal Monsters and nothing else, they won't be happy (and will still somehow lose).",
            "I don't know if you'll ever tell your friends this, but if they're struggling to beat *Toons*, they frankly suck at the game.\n\nAlso funny how they'll say you focus too hard on meta with Drytron but then you're brain-dead with Toons. Like, wow. They need to re-examine what they're saying.",
            "1. Fuck them\n2. Also consider making a second account if you really wasted your gems\n3. Dragonmaids are sick\n\nI think the \"lesson\" here should be that no matter what you play people will hate you for it so stop giving a shit",
            "They’re gonna complain whenever they lose to anything as an excuse. It doesn’t always mean that deck is better than theirs, it could just be the draws. They need to learn how to take losses and just go next imo. Out of my friend group, I’m the most competitive but honestly laugh it off when I lose to my more casual friends’ mill decks and shit. \n\nWhen you start to get toxic when you’re just playing with your friends, it’s just not enjoyable anymore - play what you have fun playing and just disregard their negativity",
            "Take a deep breath and a break :)  \nYou'll eventually hit it, we are far from the end of the month, gl!",
            "Did you replace a consistency card you often used by chance",
            "I literally JUST finished building a new deck then I got booted. Super sad",
            "those 10 10 20's are gonna hurt tomorrow i just did the same thing 🤡",
            "F\n\nWhat’s a few days tho",
            "Cyber dragon?",
            "There's a reason Drident is now banned in OCG.",
            "Waifu bias.",
            "Also came here to ask about this so likely not personal.",
            "Not just you, noticed this today",
            "That's not really a hot take, since that's what the TCG did to reduce the power of True Draco.",
            "Yeah I don’t get it either. Is there some button that lets you see?",
            "Well there is a reason they are meta",
            "One Piece.",
            "Yugioh",
            "start of the season more people are tryharding, a lot of people in gold atm are platin players on their way back so the next few days you will see a lot more meta decks then usual.",
            "Same",
            "I wish I had this problem but I never get Royal Finish.",
            "Because it enables bad players to cheese wins",
            "Oh so that's why people scoop when i activate terraforming in my dark lair deck",
            "Honestly my guess would be that it got really rushed release. \n\nIt first release in steam without any kind of announcement, it just release one day, and over a few days it also releases on various other consoles similiarly without any announcement. \n\nFrom my experience its also run really badly in android so i guess all non PC version is unoptimized?",
            "I think a decklist (aka screenshot) could suffice in most cases.",
            "That’s the deck I’m building next. I’m using Thunder Dragons and I found out you can splash them in a PK deck to bring out Colossus, and also Toadally/Treatoad. I had a failed Paleozoic/Toad deck that I wasn’t using anymore and now I finally found another use for that card. It’s pretty messed up what you can do with PK.",
            "putting the ranked in pranked",
            "What do you mean? Block Dragon isn't a problem, the deck sucks now they've semi'd Analyser, Rocksies and Sekka.\n\nOn a more serious note, Block getting hit is definitely an uncertain thing, given its still legal in the OCG at the moment.",
            "Now you know why Zane got a heart attack playing that deck.",
            "As someone that plays lots of gacha games it is illegal to change the drop rates because people can dump actual money into it. Not saying that they can't but they will be in some deep doodoo if they got caught. \n\nThat said, 80 rolls is not nearly a big enough sample size to check trends in drop rate. It might be a lot for one person(nearly the cap for free gems) but it's not enough to definitely say they lowered the drop rate.",
            "Most likely, either in 10 or 15 days, when the selection packs or the duel pass run out.",
            "I propose Pendulum Pro and Link Lord",
            "No its more like 50% \n\nMost of yu gi ohs archetypes are playable and are pretty powerful when they get going\n\n\nThe issue though is playing through negates,handtraps,op board breakers like evenly and of course the stupidly generic engines .\n\nAn example of this is playing a deck of only prank kids cards versus a deck if only darklords, cubic,ddd, ignisters,codetalkers,salamangreats,shadolls etc cards and prank kids will lose around 60% of those matches but when you factor in handtraps and dpe and adventure then prankkids win around 90% of the time. \n\nBasically a deck being good isnt based on how good the core mechanic is but based on how many handtraps +meta engines can it run\n\nThere is also the problem of consistency viability and meta reliance. For example a exosister ,gravekeeper deck is pretty decent if the decks you are facing are zombies,eldlich or tearalements but mediocre otherwise",
            "Sometimes you just need to dump the eldlich used as material to grave so you can get rid of the skilldrain before making Liebe",
            "Cant chose the order of the effects on the End Phase because Konami is a small indie company and thats too much for them.",
            "Summoning monsters is fun. You should try to summon more monsters next time.",
            "Welcome back!",
            ">Is there a way to counter it?\n\nkaijus, lava golem etc are the most reliable way to remove it",
            "{{Forbidden Droplet}} and {{Dark Ruler No More}}, but they would still have {{Herald of Orange Light}} in their hand. Best way is to use hand traps to prevent them from setting up in the first place, but that's tough too\n\nBasically they are the one of, if not *the*, top decks in this game, and there's no shame in losing against them",
            "Other than the very generic cards (Kaiju, Lava Golem, Forbidden Droplet, Dark Ruler No more), there are some which depend on the kind of Deck you use. Of course this is for going 2nd...\n\nIf you play antimeta decks that rely on the banished zone, if you normal summon {{Banisher of the Radiance}} (or other cards like them) they can't activate those effects since they cannot send cards from their hand to the Graveyard.\n\nIf you use Fusion monsters (better if you use generic ones so this card is good for other fusions), {{Super Polymerization}} paired with {{Mudragon of the Swamp}} gets Herald and a non-fairy LIGHT monster out without the opponent having the chance of doing anything.\n\nIf you use counter traps like {{Solemn Strike}} they can only answer with counter traps (this card is hard to use going 2nd though, as you'll not be able to do anything and they may be able to summon Herald back the same turn you destroy it).\n\nYou may even play some antimeta deck summoning {{The Winged Dragon of Ra - Sphere Mode}} and then activating on their turn {{Gozen Match}} or {{Rivalry of Warlords}} locking your opponent from summoning monsters unless they destroy your trap.\n\nYou may even use some cards which generate other cards when they get destroyed or which have effects from the GY so your opponent cannot negate everything and something may still happen.\n\nWhen you first encounter Drytron and Herald, you feel like you can't do anything, but there are ways to go around them... it's just that they are really strong.",
            "Dont waste the gems. You will end up playing DD dynamite once you keep loosing playing toons.",
            "Yes",
            "Yes but you'll have to unlock the secret pack again.",
            "The Phoenix Blade ban really sucks for them\n\nWell my friend whose pet deck is infernobles rants about it every other week",
            "Maintenance was announced for new shop stuff",
            "What deck are you playing? What cards are you struggling against?",
            "Yes, you can't negate a monster that has its effect negated. Droplet works though if you need to get one of your monsters off the field. This is because it also halves attack and isn't solely a negate.",
            "Your guess is as good as ours, Konami doesn't tell us anything.",
            "The rest of Exosister is still far away. The cards that make the deck playable only came out in the TCG like a month ago. And we're like a bit less than half a year behind TCG atm.",
            "Soon copium.\n\nIn all serionesss, yes. Especially since Swordsoul is probably the \"best\" meta deck to recommend to beginners wanting to go competitive. Easy to learn, hard to master. Has basuc comboes but more niche lines as well. Comboes are not extremely long. Probably the fairest meta deck that will last until Splight/tearala meta.",
            "The two best decks right now Swordsoul Tenyi and Branded Despia don't really rely on link summons, focusing on Synchros and Fusions respectively. Very hesitant to recommend to new players though since some core cards are from selection packs no longer in the game currently so it adds to the crafting cost. \n\nThere are stun decks that aren't combo reliant at all and use floodgates to slow the game to their level. Floowandereeze, Eldlich and Umi Control are the prime examples for this. Floowandereeze are cheap but same problem as the above 2, most of them are in an old selection pack.  \n\nPure Zoodiacs is pretty combo friendly where the deck is entirely made of 1-card starters because of their 1-card xyz summon gimmick. Then it's just memorizing combos. And it can be upgraded into Tri-Brigade Zoodiacs when you feel ready to link summon. \n\nInvoked Shaddoll Dogmatika - it really only performs like maybe 2 link summons at most and that's just to get fusion materials out. The deck is mainly fusion summoning and the invoked term single-handedly created the meme of normal summon Aleistir. More control focused with a hint of floodgate so not super combo heavy either. \n\nDragonmaids - Mostly fusion summoning as well. It does have a few links but only the super cracked out hands really link summon. The structure has almost every dragonmaid card you would want and then you just pump it with staples. Can also be upgraded with Branded cards to make the deck stronger.",
            "Zombie World! It prevents any tribute summoning",
            "This is why i dislike discard handtraps in madolche. Im currently running exactly 1 maxx c and 1 ash blossom and those are mostly only there as crossout targets. Nibiru, imperm and gamma are good alternatives if you want handtraps that dont mess up your starters.\n\nConsistancy options outside of pots are lacking at the moment. Ive seen some people try stuff like condemned witch but i find it too gimmicky for my liking. small world is hopefully coming soon which should massively boost the deck’s consistency.",
            "Duel Pass and the one time bundle deals with ash/lightning storm/judgment. Other than that just buy secret packs for the archetypes you wanna build decks of.",
            "When someone DCs, their opp gets the win. You DCing doesn't hurt them in a negative way and I don't see why they would report you, unless they're an ass.",
            "Because links can't be set.",
            "1. Yes, you can get demoted. If I recall, it’s when the game says you’re 8 wins away, and you lose again.\n2. Yes, your opponent sees all the cards.\n3. Extravagance must be the first thing you do during your Main Phase 1. You are allowed to activate other effects during Draw and Standby Phases, however. You may need to turn the Activation setting to On.\n4. Yes, those are generally ignition effects, which are Spell Speed 1 effects activated by the turn player. For Spell Speed 2 effects, modern card texts use simply “(Quick Effect)”, and older cards use “During either player’s turn”",
            "It tells you in the notification. It is scheduled for 2.5 hrs so will end 2:30 EST.",
            "You could get a mouse",
            "It should be treated as a loss",
            "Cyber Dragon Nova, if opponent decide to destroy it for some reason you can bring out mechaba.",
            "Ur supposed to skip the 6 bad ones and just do the 50gem and 30gem ones",
            "You mean not doing them to get the better rewards and having to ignore the big red 6 over the missions tab? XD",
            "It doesn’t give free card advantage like the others",
            "People play it for fast wins. I suppose they only care about farming dailies and not climbing, since the deck generally loses going second. While the deck tends to avoid many hand traps, there are a few things you can do:\n\n* Ash cards that draw 2 or more. Best target is Card of Demise.\n* Use Droll if you run it.\n* Use Gamma on Lilith if you run it.\n* Imperm/Veiler has an interesting interaction with Lilith. If you use it on summon, they must chain the effect. This can be useful if they are about to use Card of Demise, since it forces them to pick targets before drawing. If they do not immediately chain, the negate will resolve and activating Lilith later in the turn will not work.\n* If they flip Banquet, chain Twin Twisters/Cosmic Cyclone/MST immediately. They cannot chain D.D. Dynamite since you don’t have any banished cards yet. They can chain Trap Trick, but the OTK still fails since they can only activate one more Trap this turn.",
            "The countdown is shown in hours now, so next reset should renew all daily missions.",
            "Once the countdown shows hours, you can claim all of them, since the next reset will renew the missions.",
            "Either surrender and report for slow play if you value your time or wait for them to lose and report.",
            "[Crystal Wing Synchro Dragon](https://www.masterduelmeta.com/cards/Crystal%20Wing%20Synchro%20Dragon) requires 1 Tuner + 1+ non-Tuner Synchro Monsters.\n\n[Mecha Phantom Beast Tetherwolf](https://www.masterduelmeta.com/cards/Mecha%20Phantom%20Beast%20Tetherwolf) is not a Synchro monster.",
            "That's unfortunately an issue with Master Duel. For effects that happen during the end phase (and I believe for Standby Phase effects as well), it doesn't let you pick any order like you are supposed to be able to, and instead it just has a set order it goes through.\n\n> A few times it let Roland pop off first, but how do I actually get to choose?\n\nI assume it's a similar situation to Sky Striker. What happens there is that Charles has no legal way of resolving its effect at first, so it will only ask about Roland, but after you've resolved the effect of Roland, Charles now meets the conditions to resolve its effect, so it will ask you if you want to use the effect after Roland.",
            "The physical card game lets you choose, but this digital implementation does not. Instead, it follows a predetermined order when activating/resolving effects tied to a specific phase.\n\nIf, according to this order, you can activate an effect, then you get a prompt, and if you decline, you won’t get prompted again. However, if you don’t meet activation conditions (no Equip Spell for Charles), you can still get the prompt later in the phase if you meet the conditions then.",
            "Depends on luck and whether you have your staples ready",
            "Craft them and save gems for something else.",
            "Dinos be expensive. But I believe Cyberdragons has a fusion component, so it gives another option for the rumored Fusion Festival.",
            "Phantom Knights are most future prof of those, since they will be able to use the upcoming Adventurer engine probably the best out of all the decks in MD.",
            "Heroes have the annoying extra deck possiblity of having Hero + one other element fusion monsters. \n\nLike no matter what board you build they can summon any e hero and pull out a crap fusion using whatever your boss monster is. Back in the terrible GX days when extra deck was unlimited heroes were quite annoying with how many extra deck bullshit possibilities you had to consider playing against. Now at least you can hope with 15 card limit they don't have every freaking fusion in the archetype to screw you with in the most niche cases. \n\nUntil you've had someone pull super poly and combine a fiend monster and an earth monster from your board to summon Dark Gaia you don't understand the experience of hating super poly. \n\nWhy doesn't it at least require a hero card? How the hell could I have seen that coming? He activated it in the battle phase what the fuck....",
            "Oh it's not. Eva is banned in the TCG. If you don't have a hand trap in your opening hand and know exactly where in the combo to stop the board being built you might as well concede.\n\n\nThe reasons people run a nibiru or multiple copies of infinite Impermance no matter what deck they're playing is to stop shit like a full Dryton board.\n\nHere's another fun little bastard as well. \n\n\nIf you ever see {Time Thief Regulator} A 600/200 cute little doggy activate it's effect. If you don't Ash that fucker immediately you're screwed. Off one card. \n\nYou just have to know where and when to use your hand traps in modern Yugioh.",
            "Daily login, daily spectate mission and other 3 daily missions (the amount you get each reset) give a total of 145 gems per day.",
            "Ghosts from the Past 2, so a little past Albaz Strike, which is uh... A year and a half away i think?",
            "Did you proceed to the main menu first, and then tried to link your Konami ID?\n\nYou are supposed to link your Konami ID as the very first step, before you even proceed to the main menu, because proceeding to the main menu produces a new account.",
            "There's a few, but AFAIK nothing as good, all of them just destroy monster on the field\n\n{Warrior Elimination} {Last Day of the Witch} {Acid Rain} {Eternal Drought} {Eredicating Aerosol} {Exile to the Wicked} {Breath of Light}",
            "Cyber Slash Harpie Lady is only a Harpie Lady while it has its effect because that is actually an effect unlike the numbered ones or Cyber Harpie Lady. \n\nThe key is in the text of Hunting Ground, it will not trigger under summoning the synchro with skill drain up. It is specifically asking for the monsters Harpie Lady or Harpie Lady Sisters. \n\nWhen something is specifying an archetype it will say something like **\"Harpie\" monster**. \n\nThis is why {Dark Magical Circle} can't actually add {Eye of Timaeus}. Dark Magical Circle adds things that mention \"Dark Magician\" the individual card but Eye of Timaeus says \"Dark Magician\" Monster which refers to the Dark Magician archetype.",
            "It's banned and the game automatically filters banned cards. You can turn off the filter and find it.",
            "No, Branded Fusion is at 3.\n\nBut also not in Master Duel yet.",
            "You can randomly get 8 gems for winning a Duel. There’s not much you can do about it, except randomly get 8 gems a few more times.",
            "You sometimes get 8 gems in a ranked win award.",
            "the same reason why people complain about most FTK, if you don't open handtrap you lose. it performed worse in masterduelmeta because they used tournament data too, which most of the match are best of 3, so you can side in more handtrap to counter these FTK-esque deck. but in typical master duel ladder where it's only single, Rhongo turbo become a toxic menace that you can't really plan on.\n\nlooking at top TCG/OCG decks from the past should do the trick, with some gimmicky deck will perform better (because best of 1)",
            "Neither i would say, gadarla is still the best choice as it gets over tri-brigade barrier statue lock which is more important than the very off chance you would ever get to use kaiju for synchro play.",
            "I can't think of any rank 3 that can out skill drain without the help of other cards like Forbidden Droplet, but you could use Number 30: Acid Golem of Destruction as a 3k beater while Skill Drain is up, since it negates all the downsides.",
            "Secret Pack are unlocked by obtaining SR/UR card in that pack through any other mean, either from buying master pack or crafting them.\n\nIf you know what to build, go to deck builder, search the name of the card of the deck that you want to build, craft a SR card among them to open their secret pack.\n\nAlso you should check [Here](https://www.masterduelmeta.com/secret-packs) first to check whether the card you craft are in the right secret pack.",
            "Depends largely on the deck. If you have a consistent way to get it out, then its absolutely a decent tech option. For example, in VW, you can use Beatrice to send Necroworld Banshee to the GY, which can then activate Zombie World from deck. \n\nJust as an unsearchable 1-of it's probably not worth playing.",
            "So your one card combo to Colossus is Gold Sarc > Banish Dragondark > Search Dragonhawk > Discard Hawk to revive Dark > Tribute Dark for Colossus. Other combo lines typically revolve around using Aloof Lupine + Thunder Dragon in hand and banishing Dark/Roar depending on what you need. Whether you get Fusion or Dragonhawk depends on if you opened the original Thunder Dragon, since Colossus requires the original to be fused with a fusion spell. Buster lock is optional, but I’ve found some success with Aloof > Banish Dark + Roar > Search Hawk + special Dark > Tribute 1 Dark for Colossus, discard Hawk to revive the other Dark/Roar, make Union Carrier with 2 monsters and Colossus with the other. Keep in mind this leaves you vulnerable for Nibiru. If you have OG + Fusion in hand it’s possible to make Colossus + Buster Lock in 4 summons. \n\nVerte Anaconda is only if you end up with a bad hand but you can make Anaconda that turn. Thunder Dragon Fusion is both the best and the worst fusion spell in the game since it shuffles resources back from GY/Field/Banish. On one hand, that lets Thundras grind hard, on the other, using it too much leaves Colossus/Titan open to Raigeki. But the follow-up from Fusion is amazing since it lets you search *any* Thunder monster. Good choices are Denko Sekka to shut down facedowns, Chaos Creator for extending, and Dragonroar to re-add Fusion to hand to make another Titan.\n\nChaos Variant adds more consistency to the deck, while Pure can play Dimension Shifter. Chaos uses White Dragon Wyverbuster, Black Dragon Collapserpent, Chaos Creator, and 3x Chaos Spaces. The White/Black dragons can banish Dark/Light monsters from the GY respectively, so that makes Dark + Chaos Space in hand a great combo starter. It also lets you run Hieratic Seals of the Heavenly Spheres as a form of disruption. Pure I don’t have as much experience with, but DShifter does shut down like… every deck. Except Floowandereeze.\n\nEdit: Forgot to mention Verte is also a good way to end out games, since 2 Titans + 1 Colossus is enough dmg to break 8k LP.",
            "Look at issues page in MD, there’s an item about problems when fusion summoning with 6 to 8 monsters.\n\nEdit: grammar",
            "As far as I'm aware most lists only run 1 Roze and Afterburners: cutting down one those makes your list tighter and you could replace one of them with the third Shark Cannon, which is especially potent in a DPE format.",
            "Draco Berserker is the most notable, all the other extra URs that aren't staples (i.e. handtraps, Called by, Crossout or stuff like Droplet) are optional. Personally i like having Dragite available and Protos at 1 in the maindeck can occasionally just be an instant-win. Chaofeng can also come up in rare cases. None of them are in any way required though.",
            "{Draco Berserker of Tenyi} and theres also Halq + Auroradon if you go for those plays as well.",
            "Soul Crossing.",
            "ONE. BAD. DAY.",
            "If an effect does not explicitly says it targets, then it does not targets and can bypass targetting imunity.\n\nI assume you are talking about Shuraig, and if you read his effect carefully it never says it targets, which is why he was able to banish your monster.",
            "Getting Omni-Negates like Baronne or Savage is always a safe option or the cards that can disrupt if they're synchro summoned. Ruddy Rose Dragon is good for plant/Rose Dragon decks for field wipe and Satellite can give pops if you have synchros in the GY. Supreme King Clear Wing is a good monster wipe for Pendulum Magicians and the Crystron synchros are okay if you have the materials to summon them.",
            "They started cropping up towards the end of last season or whenever that update happened that added a cap to gem farming from duel rewards.",
            "You can hit Diamond one by tomorrow morning if you just keep playing and watching a frozen screen. They're easily over 2/3rds of the decks I've run into. \n\nAnd I'm on Diamond 3 now...",
            "> While this Synchro Summoned card is on the field, your opponent cannot activate effects of monsters **with the same original Attribute(s) as the \"Yang Zing\" monster(s) used for the Synchro Summon of this card.** When this Synchro Summoned card is destroyed by battle or card effect and sent to the GY: You can add 1 Tuner from your Deck to your hand. Once per turn, when a monster(s) your opponent controls is destroyed by battle or card effect: You can Special Summon 1 Wyrm monster from your Deck, in Defense Position, whose original Attribute matches the original Attribute that 1 of those destroyed monsters had on the field. \n\nYou used Adhara and Chixiao as material, both are not \"Yang Zing\" monsters, thus the effect preventing activating effects wasn't active.",
            "Thats literally a non-issue, they dont care about some made-up digital resources like that.",
            "No, you get those rewards as you rank up.",
            "It does take a while, but after some time you get used to the most popular cards and the only things that catch you off-guard are some rather obscure cards or techs which tend to be weak in power level anyway.\n\nIt can get a bit overwhelming at the beginning, though, I have been on-and-off of Yugioh for a long time now and even then I had to relearn a lot of things, but after a while it stabilizes.",
            "Practice, but also rewatching replays and actually reading the cards with no time limit lurking in the back can help understand what's going on.",
            "If they were in Diamond they fell to plat 5 only after the reset.",
            "they are in diamond already",
            "You don't want it hard enough then.",
            "> Today, I played a spell in the same column where my opponent had literally just activated Imperm.\n\nThis was actually a lot more common, before they added the animation for the column lockout. To this day I'll call by the grave something and then forget about it and try and activate that handtrap on my opponents turn.\n\n\n> I finally Ash'd myself.\n\n\nThis is honestly one of the intitation steps to master duel. The other big one is trying to ash Gamma.",
            "Click the “how to obtain” button when viewing the card.",
            "Haven't seen one since the update. There must have been some extra security measures snuck in like the stealth add of Penguins.",
            "Rank 4s can use Abyss Dweller(Has to activate before the GY effect activates) or Raphsody in Berserk to banish it from GY. \n\n4 Mat Zeus. \n\nWind decks can make Doom Eagle to return it to the deck after its in the GY. \n\nChengying under the right circumstances, OG Trishula, Omega can always return itself and DPE if both are in GY. \n\nBut just drawing the out is the most reliable: Called By the Grave, D.D. Crow, Ghostbelle for the GY effect. Ash to stop Fusion Destiny, Veiler/Imperm for Anaconda.",
            "This isn't an extra deck thing and won't fit into any deck, but the more meta decks play more starters and extenders which allow you to bait the DPE or just play through it. If you are just tired of DPE you can play the super meta decks that ignore it. This does suck for decks that can't afford to cram in one card starters or extenders and is probably why we so many players switching to sword soul, but that's just how you have to adapt to cards that clearly need to be banned (I'm talking about verte here).",
            "So aside from things like card pools and stuff. The fundamental differences between the two. \n\nMaster Duel\n\nHas a main phase 2 after the battle phase. \n\nHas link summoning which isn't in Duel Links yet(this also comes with 2 Extra Monster Zones in the middle)\n\n5 Monster and S/T zones instead of 3\n\nNo skills or characters. \n\nFundamental Banlist Difference(You can run multiple limited and semi-limited cards as long as they're different cards.)\n\nProbably other shit, I don't remember.",
            "To add, deck size is 40 to 60, LP is 8000 and IIRC there are direct damage differences for spells/traps (its half in DL). Its basic stuff but kinda important.",
            "If I could get a UR I want for 500 gems I'm going for that shit. Sometimes I don't even get 1 for 1000 gems.",
            "Not really, Exosisters has the potential to be good when the rest of their support comes out but that's not really soon. \n\nCupid Pitch is the most relevant card in there at the moment and that's a R. It gives the Halq-Auroradon decks access to Colossus and any other degeneracy that has 600 defense.",
            "Chaofeng most important meta applications are vs Eldlich and kinda in the mirror. It also FTKs the Dryton matchup.\n\nEldlich is a bad matchup for SS. 1 Golden Lord beats the basic Baronne+Chixiao+Blackout as Golden Lord hand effect will force Baronne negate, revive punch over Chixiao without having 2 cards on field for Blackout to pop. Light Chaofeng prevents this.\n\nIn the mirror, it limits certain lines. It stops Ashuna. This limits the options to get to Vishuda, which always baits a negate. Other than that it stops Baxia, Ecclesia, and Chixiao until outed.\n\nThe other scenario it comes up is it makes it way safer to OTK thru Maxx C since alot of the HTs are light. Nibiru is the big one, but Ogre, Gamma, and Veiler are Light as well.",
            "Yeah the cards are just bad xD But the legacy packs do contain some playable cards",
            "its funny there isnt any good list of budget decks for this game when tehre are for every other card game its kinda funy the lack of resources out tehre",
            "Yes, if you didn't draw all 3 of them.",
            "Imo it's worth. I doubt they will ban any of it. It was absolutely everywhere in the TCG alongside adventurer for a long time and the only UR's in the package are DPE & Verte. So really, you only need 60 UR.",
            "DPE was released not even 2 month ago. I don't think they will ban anything of the engine yet. The problem card is verte anaconda which is banned in both ocg and tcg. So it's safe to assume it will be gone sooner or later. But it took some time until that point.\n\nLong story short: It's worth it",
            "The random number generation isn’t very random",
            "Crusadia, Ancient Warriors, Madolche and Unchained are good going second decks as well.",
            "Totally worth. droplet is a really good equalizing card especially if your deck can afford to send materials to grave to set up for follow up plays",
            "All drawing effects are considered adding cards to the hand, but not all adding card effects are drawing cards, if that makes any sense.\n\nTo clarify, Droll & Lock Bird prevents cards from being added to the player's hand (counters maxx c). Thunder Dragon Colossus prevents cards from being added to the hand, except by drawing them (doesn't counter maxx c).",
            "https://ygorganization.com/lore-matching-outfits-and-more-goblin-stories/\n\nPoor goblin kid goes to various Japanese festivals and has a slightly bad time. The picture on his shirt is {Scrap Kong}, a meme card in the Japanese community because of its effect to instantly destroy itself when summoned. [Yugipedia lists all the cards the kid shows up in.](https://yugipedia.com/wiki/Card_Trivia:Gift_Exchange).",
            "Bees aren't good because of their boss monster, they're good because they have an almost 100% reliable way to search retaliating c and maxx c going first during their turn to guarantee get to use it on the opponent's turn. Scale Bomber acts as a monster-only ghost ogre type effect.\n\nAlso, Sting Lancer has the unique effect of 1) letting you dodge your maxx c getting called by the grave and 2) countering your opponent's GY effect monsters (like DPE) by shuffling them back into the deck in response.",
            "It really depends on the deck. A deck that heavily relies on Link monsters for example doesn't care at all, and neither do decks that do not activate monster effects on the field. Also, the Adventure engine naturally outs Bagooska.\n\nAgainst other decks though, it's basically an easily accessible Skill Drain.",
            "[deleted]",
            "It's the best HT vs Adventure engine as it destroys Fateful Adventure.",
            "So you have to be able to use monsters as link material up to the link rating.(Specifically not tributing also). Borrelsword is a link 4 so it needs to be made with 4 monsters because each monster is worth 1 link rating. The exception to this is if you use **link** monsters as material then they can either count as 1 or their link rating. (i.e. A link-3 monster can count as 1 or 3 for materials). \n\nSo when something like Borrelsword says 3+ it means you make it with 3 materials using a link-2 and 2 other monsters(2+1+1) or make it with 4 monsters worth 1 rating each.",
            ">\tBut once a deck becomes so good that it’s meta thanks to the new cards, everyone suddenly starts hating the new cards. Some people tend to go way too far and even hate the player for using the deck.\n\n>\tPeople are getting hyped about new cards, then start to hate them when they become part of a meta deck. After they fall off the meta, people like the cards again and say that it’s cool and based to play with them.\n\nYou've just described the Yu-Gi-Oh game community in a nutshell. It literally is like this and it has been forever.\n\nI mean sure, it's kinda like this everywhere, don't get me wrong, but the meta shifts much faster than some other games that it usually has no time to settle down.\n\nAs to why - probably because the community consists of many vocal minorities who are in an neverending discussion of what's good for this game.",
            "ITs different people",
            "You lucky motherfucker lol",
            "This is just my assumption, since i'm no Branded Despia expert, but it might be to account for things going wrong. There's always things that can go wrong (e.g. if your Branded in Red target moves out of the graveyard because it got hit by smth like CBTG or D.D. Crow in response you will actually not be able to fuse at all, which means no Chimera and no reset Mirrorjade) and if things do go wrong a Mirrojade on board (even if it can't use its effect) gives you much more than an Aluber, which might make the difference between getting lucky and staying in the game and losing.",
            "Best target for Ash/Imperm/Veiler is probably Sea Angel (the spell searcher)- keep them off Battle Ocean, and even if they already have it you stop them getting a free summon from deck with Marincess Dive. You can make plays even without Battle Ocean but the endboard is much easier to out.\n\nGhost Ogre is very good against this deck since you can hit Coral Anemone. If you blow up Coral Anemone then they don't get the special summon since Anemone no longer points to any zones.\n\nLike a lot of combo decks though it really depends how good their hand is- some hands will cave to one handtrap, strong hands can play through almost anything.",
            "Negating Electrumite is one chokepoint, also negating draw cards if you don't think they will be able to reach 3 counters on their pend monsters for a special summon (always a gamble).\n\nIt's by no mean a top tier deck you should be worried about countering, but droll & lock bird is a good hand trap to run against a lot of decks in the meta right now, that helps a ton too.\n\nEndymion is a \"going first or lose\" deck though, I've played a ton of it in MD and I can safely say it probably has upwards to an 80% winrate going first but then like a 20-30% winrate going 2nd with how strong of boards current meta decks can build",
            "\"Dreadnought\" is probably the best one out of those if by Dreadnought you mean Rank 10 Trains. The modern version of that is just called Earth Machines because it uses Infinitracks now to open up access to Rank 9 and rank 8 xyz. \n\nCyber Dragon is probably the other best one just because the playstyle of the deck is built around breaking through opponent boards and OTKing them. It can also be better than Earth Machines if you include the branded stuff but is still okay without it. \n\nSix Samurai is a feast or famine deck. Gateway is one of the strongest cards out there and with it out they can do like any degenerate combo they want. But very vulnerable to like every handtrap and disruption imaginable. \n\nIce Barriers are the worst of the bunch. They're a control deck with good synchro monsters but are kind of bad at synchro-ing. If you really want to play them, just wait until their structure deck comes out(we don't know when but it's been leaked a long time ago)",
            "Because it's the only thing they know how to play",
            "3 Normal summons, probably 3 spell cards and 1 win.",
            "They can basically do anything that they want if they don't get disrupted because gateway is absolutely disgusting. So...they are super vulnerable to like every handtrap if they didn't open gateway. Their ability to combo hinges on being able to get to gateway.  \n\nAlso nothing to do with viability but the new timer rule fucks them more than usual since removing counters is fairly time-consuming.",
            "Copernicus or Dark Contract with the Gate.",
            "Aqua Argonaut: \"During your opponent's turn, when a Spell/Trap Card or effect is activated on the field (Quick Effect): You can Special Summon 1 of your \"Marincess\" Monster Cards equipped to this card, and if you do, negate that activated effect.\"\n\nBranded Lost only prevents the *activations* of effects that perform a Fusion Summon from being negated. Argonaut negates the effect, not the activation, so Branded Fusion will resolve negated. This is the same reason BraFu can be Ashed even under Lost.",
            "Super Polymerization is in fact one of the craziest cards in the game, depending on the meta. Right now especially, it's devastating for DARK and/or Fusion decks, and later on, when {Garura, Wings of Resonant Life} comes out, it also is a complete blowout against any deck that shares types and attributes, since Garura will offset the cost of Super Polymerization by itself.\n\nYou can take solace in the fact that Garura is a TCG exclusive though, and thus will probably take a long time to get imported into Master Duel.",
            "Yes, if a pack doesn't cost gems there is no reason not to claim it",
            "Salamangreats are a very good structure for the price, 3 of it plus craft a few more SR cards and some staples and you have a good deck. You can check in the website for examples.",
            "{Floowandereeze & Empen} stop the opponent to activate effect of atk pos monster",
            "It summon a strong fusion like exterio that negate all s/t, and last warrior that stop all summon\n\nIt synergizes fairly well with runick because the deck doesnt need most of their ED slot so they can afford loading random fusion just for stein. Also they're stall deck so stein is just a strong bonus card they can get while they stall.",
            "Maxx C, Skill drain, summon limit, and tcboo",
            "If you didnt build your deck optimally yes. \n\nMost player run many hand traps and board breaker to deal with combo deck so they're manageable.",
            "I'm not aware of any Xyz Lubellion, but they are connected, Lubellion is Aluber's dragon form that he took on after taking Albaz' power in Branded Lost.",
            "If anything it would be a good thing to report them, since Konami does way too little against these people. Maybe if they get enough reports they'll one day realize that they shouldn't just ignore this.",
            "The lost of most of the Ishizu cards does hurt them rather substantially, although they’ll likely still be a very good or best deck of the format",
            "I second Phantasm Spiral, it rocks",
            "Thank you man... it was really driving me crazy, I was feeling really bad with my choices.\n\nThey even started mocking me, how I am now going to make an anime girls deck or whatever. How Hero decks look cooler.\n\nI don't think I need another account, I like liked the choices that I made and its too bad that my friends don't like them. I get my shit kicked in ranked with those decks, even from non meta decks, so I honestly don't get why they can't deal with my stuff.\n\nI am excited about the dragonsmaid and I am looking some more niche decks that look fun, like that Millennium Eyes Restrict. What an insane design lol",
            "I am not sure I understand. What is the issue with claiming all?",
            "The card pool in master duel is missing a few of the latest physical card releases but is for the most part complete whereas duel links only picks and chooses some of the lower power cards to add to their game so the overall power of cards and decks is much higher in master duel enabling crazier combos and interactions.\n\nMaster duel also has a lot more friendly free to play system which allows you to dismantle any 3 cards into any card you would like of the same rarity which makes it far easier than buying out boxes like in duel links.",
            "That's because there aren't budget options for the good hand traps (otherwise decks that can fit them would just run both), that are still hand traps. That's where a lot of the UR/SR cost in a deck comes from.",
            "It's not your fault bro, in the end it's just as a game and if they get salty they should take a break or walk it off. If anything keep doing you and play what ya like. And yes the relinquish, is pretty dope awesome card arts",
            "Because you’re claiming the shitty 10,20 gem rewards. \n\nIf you only claim the 50,30s they will constantly get re added everyday. \n\nIf you claim all, the next day you might not even see the 50,30s . You’ll just get 10,20s.\n\nSo to earn the most gems, u leave the other dailies to Rot\n\n(Each day, only 3 new dailies get added to your list)",
            "Oh! I had no idea.\n\nSo it's always better to only claim 3 high value rewards to be repeated daily?",
            "Thats the 'exploit', and only retrieve the other ones on the last day of the season."
        ]
    },
    "Unconfirmed Leaks from Dkayed: Centur-Ion": {
        "title": "Unconfirmed Leaks from Dkayed: Centur-Ion",
        "score": 36,
        "url": "https://www.reddit.com/r/masterduel/comments/1djxxun/unconfirmed_leaks_from_dkayed_centurion/",
        "content": "* **Leaks:** [https://www.masterduelmeta.com/articles/news/leaks/june-19-2024](https://www.masterduelmeta.com/articles/news/leaks/june-19-2024)\n* **YGOMeta \"Centur-Ion\" TCG Brekadown:** [https://beta.yugiohmeta.com/tier-list/deck-types/Centur-Ion#TCG](https://beta.yugiohmeta.com/tier-list/deck-types/Centur-Ion#TCG)\n   * **OCG:** [https://beta.yugiohmeta.com/tier-list/deck-types/Centur-Ion#OCG](https://beta.yugiohmeta.com/tier-list/deck-types/Centur-Ion#OCG)",
        "num_comments": 35,
        "comments": [
            "Oh, that's gonna be expensive compared to Memento and Vaalmonica.",
            "Calamity turbo without Calamity",
            "Legatia, my beloved. Runick bystial will be at full power (minus runick hits)",
            "Come on, give me some good news on Yubel…",
            "As an RDA player, I've been waiting an eternity for this.",
            "pretty cool and easy way to bring 12\\* bosses without spending 30 mins. I like that.",
            "I'm predicting Goblin Riders and Ogdoadic support",
            "& another deck no one will play",
            "OH it would be so hype if all the new support comes out with it",
            "So, based on dkayed video this deck puts 3 disruptions + whatever handtraps you have on their optimal 1st turn? And if you manage to stop crimson, it's just a quasar and the trap? Doesn't sound very good, honestly",
            "Great, now besides the dark souls deck ill need the gurren lagan deck, fml",
            "One more deck that Horus will see play...",
            "can you mix branded with Centurion? \n\n  \nmy Branded account has 9k+ gems. i guess instead of creating a new account.",
            "Next pack is likely Centur-Ion, Yubel and Voiceless Voice right? I’ve got 10k gems ready to go!",
            "is Centurion a good deck?",
            "Field spell, Primera and prob one of the Lv12s. So I’d say at min 8 UR for in archetype cards. Def going to be on the high side.",
            "it'll make the deck actually somewhat interesting now instead of revolving around exactly 1 thing ever",
            "Oh shit that deck runs legatia? Cool I’ll have to try it out",
            "People might have played it a bit more if Calamity was legal since there was a good payoff, but even then it wasn’t gonna be a big meta contender. ",
            "Supposedly it’s everything except the newest Lv4 and quick play spell (at work, can’t get names).",
            "ye without calamity it isn‘t all that strong",
            "It really doesn't. Don't know why you got downvoted. It will probably be very expensive as well.",
            "wich one is the better? Voiceless right?",
            "You can say that for lot of current meta decks especially SE on the whole “doesn’t make the deck unique” aspect.    \n\nIt’s good the card is banned, but they should do that ban treatment of overly good generic cards on the other decks too so things are at least remotely consistent.  ",
            "Susceptible to roach tho since you probably need ecclesia instead of cartesia",
            "Honestly the deck wasn't very strong even WITH Calamity",
            "Konami has been pretty good of late at not overpricing mid archetypes so maybe this will be the same?",
            "Yubel and Voiceless are in the same level I believe",
            "It wasn’t. Calamity is legal in TCG and it didn’t do crap. I mean it’s nice a toxic card is banned, but let’s be real I would rather pick a good 30 or so other generic cards I would want banned over Calamity ",
            "Oh you mean like Vaalmonica? Yeah, you're right. That's a possibility.",
            "But are they good??",
            "Yes, along with Memento that only had 2UR cards. ",
            "Are you?",
            "no...",
            "Then neither are they.\n\nDecks are only as talented as their pilot"
        ]
    },
    "The only hand trap stronger than maxx c": {
        "title": "The only hand trap stronger than maxx c",
        "score": 73,
        "url": "https://i.redd.it/ix2l3pi5x38d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Ah yes, Maxx G",
            "ayoo bro got that anti-stun hand traps 💀",
            "Having it pointed at someone safety on or  not, unloaded or not is against gun safety regulations... with that said, if your opponent is playing branded, tearlimits or kashtira its completely okay, and actually encouraged.",
            "finger the gun!",
            "Me trying to zoom a lot to identify the cards : \"wait what ? What card are you talking about ?\"\n\nMe zooming out : \"Alert ! There is a gun on the table !\"",
            "What is that card?",
            "Maxx C isn't even the strongest hand trap, Dimension Shifter is",
            "I’m gonna defeat you with the souls of the cards… and this gun I found.",
            ">\"Activate that ash blossom and I'll shoot myself.\"\n\nKaiba, probably.",
            "Good thing I run Ash. It can negate anything.",
            "Is this the new Borreload Dragon ?",
            "Damn he must be a Volcanic player.",
            "Bro bring his fav Mate to the duel, Black D Pistol",
            "Why is that guy's deck unsleeved? I think that would kill me faster than the gun",
            "I wish they would also add this mate in master duel",
            "Beat me to it lmao",
            "And if they are playing mikanko or stun you are obligated to point the gun at their head",
            "A gun",
            "Idk. I guess one of new Magikey support",
            "Damn… years of playing yugioh finally affect my irl eyesight"
        ]
    },
    "yugioh player be like this will make a fine addition to my collection": {
        "title": "yugioh player be like this will make a fine addition to my collection",
        "score": 77,
        "url": "https://i.redd.it/m5rpem4v838d1.png",
        "content": "",
        "num_comments": 60,
        "comments": [
            "This is why Konami took custom mats away from us, you mfs couldn't behave.",
            "I feel attacked.",
            "First time I ever went to a locals, the first table there had a guy with a playmat. The playmat in question had every yugioh female lead in barely covering maid outfits with fucking massive boobs.\n\nAnd this is why custom playmats were banned",
            "I’ve said it before and I’ll say it again. Great artwork, horrible playmat",
            "why though?\n\nwhat purpose does a horny mat do for you?\n\njust buy a poster if you want a big picture of lab milkers.\n\nalso really unrelated to master duel.",
            "I mean, I was just buying it for the free tube/bag. The mommy milkers are simply an incidental bonus.",
            "Jarvis, but even lower effort",
            "Jarvis",
            "![gif](giphy|HxMhuDg7O4pKOhhcRC)",
            "I hate how lab plays but seeing things like this really makes me tempted to use them myself…",
            "Too bad custom playmats got banned in TCG\n\nAt this point its just an overpriced mouse pad",
            "Wife mat",
            "the Art of Lovely on the mats is pretty good too\n\nhttps://i.redd.it/ifa1hz6fs38d1.gif",
            "Isn’t it pretty hard to play on a sticky and crusted mat ? Not very practical tbh.",
            "Wrong game. What does this have to do with Master Duel?",
            "Also Konami:\n\nhttps://preview.redd.it/4woccpxss38d1.png?width=400&format=pjpg&auto=webp&s=ae34db4b3acae5cab946ed56923c0c3d33380e4f",
            "But look at it, is 10x better then Konami mats, you know Konami could be swimming in money if they started making these kinds of mats.",
            "There is nothing wrong with these mats. The one in the post isn’t even nsfw in any way. There’s no reason for Konami not to allow this",
            "If you’re ever in doubt just look back to your flair…",
            "i feel it will make a fine addition to your collection",
            "I mean me too but, I don't think I can disagree...",
            "I seriously seriously and seriously can't understand what these people have in their head saying \"yeah I want to show to everyone my addiction to erotic content\"\n\n\nLike keep it for yourself bro. Bring back the times when people thought some things should be kept into intimacy",
            "So, it's not \"made from high-quality materials that makes it easy to shuffle and play your cards\"?",
            "https://preview.redd.it/8qajlyqyn38d1.png?width=288&format=png&auto=webp&s=233388e81a374512ae752ae084b52c4e499fea4a",
            "Join the dark side.",
            "Its just banned in in european nationals and euros and mats like these were the reason legitimately cool custom mats were caught in the crossfire.",
            "This doesn’t even compare to the mat in the post, like yeah it’s definitely more horny than the OG kisikil and lilla arts, but it’s not crazy horny",
            "\\*bonk\\*",
            "I mean, she's holding that staff between her tits like it's some kind of stripper dance pole. Might not be NSFW but it's not appropriate / tasteful either.",
            "You think it’s not NSFW just because her nipples aren’t showing?",
            "Yeah no this mat is 100% nsfw. Nsfw is defined as “content, videos, or website pages the viewer may not wish to be seen viewing in a public, formal, or controlled environment. The marked content may contain graphic violence, pornography, profanity, nudity, slurs…” this mat definitely falls under the “pornography” and “nudity” categories, with Lovely Labrynth’s exaggerated boobs being barely covered and her ass being nearly completely visible.\n\nAnd even if you wouldn’t define it as NSFW, konami should still not allow these mats as they are disturbing to other people at events. A personal anecdote is that I nearly turned around and left my LGS because the first table I saw had a player using a disgusting mat depicting all the yugioh deuteragonists in barely covering maid outfits with extreme amounts of cleavage. Those types of playmats should not be allowed in a children’s card game.",
            "No, it’s a horrible art to have on a mat",
            "is not that dark like stun",
            "Not NSFW? Go show that to your boss right now and wait for your promotion.",
            "True but it’s just a personal game mat. It may not be appropriate but it doesn’t affect the game in any way",
            "Yes. You apparently do not know what nsfw means. That’s literally the difference. This is just mild ecchi. Not nsfw",
            "I literally gave an exact definition proving this wrong elsewhere in the thread. I’m not repeating myself. Go read.\n\nThis mat is not NSFW. **That does not mean that it is appropriate to use.**",
            "What if he likes it?",
            "Go buy a dictionary and try reading it",
            "NSFW stands for Not Safe For Work. \n\nWhen my boss walks by my computer and sees this on my screen, I’ll just explain to HR that it’s only mild ecchi as they walk me out the door.",
            "You claim this is “Ecchi” which in your own definition is described as a “playful sexual suggestiveness” which a depiction of barely covered massive boobs and ass is not. Hell, your definition even says Ecchi is mostly teasing and innuendos. Please, tell me, what about this is just “teasing” or an “innuendo”? \n\nActually, bigger question. Why do you fight so much about this not being nsfw? Do you have something to prove or do you have something to hide?",
            "Since you’re apparently too lazy/dense to correct yourself, here I’ll do it for you:\n\n###NSFW (Not Safe for Work)\n\nNSFW is an acronym commonly used on the internet to label content that is inappropriate for viewing in a professional or public setting. This type of content often includes explicit sexual material, nudity, strong language, or graphic violence. The label serves as a warning to viewers that the material may not be suitable for all audiences and should be viewed in private.\n\n###Ecchi\n\nEcchi is a term derived from the Japanese pronunciation of the letter “H,” which stands for “hentai,” though it has a milder connotation. In anime and manga, ecchi refers to content that is sexually suggestive or provocative but does not cross into explicit pornography. This might include scenes of characters in revealing clothing, accidental nudity, or situations with sexual undertones, often used for comedic effect. Ecchi is more about titillation and humor rather than explicit content.\n\n###The Difference\n\nThe primary difference between NSFW and ecchi lies in the level of explicitness and cultural context:\n\n\t1. Explicitness: NSFW can encompass a wide range of explicit content, including pornography, graphic violence, and strong language, making it unsuitable for public or workplace viewing. Ecchi, on the other hand, is suggestive but not explicit, focusing more on teasing and innuendo without showing explicit sexual acts.\n\t2. Cultural Context: NSFW is a general internet term used globally to mark content inappropriate for work environments. Ecchi is specific to Japanese anime and manga, where it denotes a genre that is playful and flirtatious rather than overtly sexual.\n\nSo, while both terms refer to content that might not be suitable for all audiences, NSFW is a broader and more explicit category, whereas ecchi is more about playful sexual suggestiveness within the context of Japanese media.\n\n##The playmat shown in this post does not show nudity or any explicit sexual material so, it is **not** NSFW\n\nMaybe educate yourself before commenting next time",
            "What it stands for and what it’s actually used to mean are 2 different things",
            "That is not **my** definition it is **the** definition. As said in those definitions, the difference is how explicit the content is. This image is not overly sexual in any way and she is not nude. It’s just suggestive. That by itself is not NSFW. Again, not being NSFW does not mean that it is appropriate.\n\nI am not fighting at all, I am simply correcting people who have come crying to me trying to **fight** that it is NSFW.\n\nYet elsewhere in the thread someone even posted an **official** live twin mat which is very similar to the mat in the post.",
            "I’ll recite this entire Chat GPT generated garbage to the HR department as they’re explaining when my last check will arrive and when my insurance benefits expire.",
            "Ironic claiming others are crying when you started crying the second someone called this nsfw. The live twin mat you’re talking about is more along the “ecchi” lines as while the alt art kis-sikil and li-la cards are suggestive, they are not so prominently sexual to the point of having almost no clothes on like the playmat in the post\n\nAlso wait, you claimed there was “nothing wrong” with the playmat and that konami should allow it. So you apparently DO think it’s appropriate for tournaments that a very wide age group attend.",
            "Wow. Sorry, I should’ve expected a yugioh player to lack simple reading comprehension. I’ll simplify it for you.\n\nNSFW may stand for not safe for work however that is not the definition of NSFW.\n\nThe image on this playmat is not NSFW. The fact that it is not NSFW however, does **not** mean that it is appropriate to use in work.\n\nThat better or is it still too difficult for you to understand?",
            "Wow at this point you’re just admitting that you can’t understand the difference between facts and opinions and lack simple reading comprehension. Well done.",
            "Please touch grass",
            "Fun how you claim that I have poor reading comprehension and cannot “understand the difference between fact and opinion” when you have yet to make a single claim about why this mat, or anything similar, should be allowed at a kid’s card game event.",
            "That’s your only response now? How pathetic. So sorry you apparently lack an education.\n\nAnd you’re on Reddit… in a master duel sub… telling people to touch grass? The irony there lmao",
            "I did not once say that but fine…\n\nThis card is not NSFW. That does not mean that it is appropriate. That’s fact.\n\nIn my opinion however, there is nothing wrong with using mats like these. They do not affect the game in any way. It’s not as if you can somehow use a game mat to cheat.\n\nThat does not mean that these mats should be used at all times in public spaces. **where** you are using them needs to be taken into consideration and there simply needs to be rules put in place for that.\n\nFor example if this is a tournament where kids are participating then these mats should not be allowed. However if there are no kids present and  there are only participants aged 18+ then there is no issue.\n \nThis is not solely a kids card game. It’s for people of all ages and that needs to be taken into consideration. There is no need for all this needless censoring in most cases. If there are kids present, do not use these mats. If there are no kids involved, use whatever mat you want. \n\n###Simple."
        ]
    },
    "The Duel was a Inside Job": {
        "title": "The Duel was a Inside Job",
        "score": 33,
        "url": "https://i.redd.it/0v6f610rp38d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Bruh this is fked up",
            "Yeah this aint funny dude"
        ]
    }
}