{
    "Quick Questions: June 19, 2024": {
        "title": "Quick Questions: June 19, 2024",
        "score": 14,
        "url": "https://www.reddit.com/r/math/comments/1djmq96/quick_questions_june_19_2024/",
        "content": "This recurring thread will be for questions that might not warrant their own thread. We would like to see more conceptual-based questions posted in this thread, rather than \"what is the answer to this problem?\". For example, here are some kinds of questions that we'd like to see in this thread:\n\n* Can someone explain the concept of maпifolds to me?\n* What are the applications of Represeпtation Theory?\n* What's a good starter book for Numerical Aпalysis?\n* What can I do to prepare for college/grad school/getting a job?\n\nIncluding a brief description of your mathematical background and the context for your question can help others give you an appropriate answer. For example consider which subject your question is related to, or the things you already know or have tried.",
        "num_comments": 85,
        "comments": [
            "I finished my maths BSc nearly 7 years ago, and recently started thinking about mathematical topics again and am loving it, but I'm not really sure where to go to continue learning. Any suggestions for books, YouTube channels, or other routes and resources I might take to start studying maths a bit again?",
            "Hey there. I figured out what I think is a cool equation, and I was wondering if had a name. Here’s the equation:\n\ny=+-(c1xln(x)+c2x+c3)\nWhere c1, c2, and c3 are constants and c1/=0.\n\nThe reason this equation is cool is that the y-intercept of the line tangent to the equation goes from -infinity to infinity at a constant rate as you move along the graph at a constant rate.\n\nI’m sure I’m not the first to figure this out, so does anyone know if this has a name? And if so, does it have any practical applications?\n\nA little background if anyone’s curious, I started think about this when I was driving my car a while ago. The driver in front of me was driving terribly, so I wanted to look in their side window and see who was driving. But then they turned at such an angle while I kept going straight, such that I could only ever see the back of the car. Then I started to wonder what curve they would have to take such that I could only ever see the back of their car, assuming we both kept going at a constant speed, and I kept driving in a straight line. And then the above equation is what I got when I sat down to figure it out.",
            "I'm going into precalc this sophomore year, though im learning calculus right now as ive finished the trig i need to know for calculus, is it possible to learn to write proofs at my level?  Understanding things on a conceptual level in math is very satisfying and an unparalleled feeling for me.  Are there any book recommendations for beginners like me to write basic proofs that include logic?",
            "[an advanced maths textbook from my school days, on pg. 134](https://drive.google.com/file/d/1P0Oj4xiYFT8TGnZdbtwwm2Ts4ltTbRmN/view), included a circle drawing technique without compass. here's my rough translation of the technique (called 3 1 - 1 1 - 1 3 in the textbook):\n\n- from point A, mark point B at 3 units left and an unit down of A and draw a curve between them\n\n- from B, draw the curve to point C where C is one unit left and an unit down of B\n\n- from C, draw the curve one unit left and 3 units down before marking point D\n\n- repeat and reverse those three steps accordingly till the curve is closed at A\n\n(quick proof in the text book: let O be the curve's centre, then OA = OD = 5 and OB = OC = 5 per Pythagorean theorem, as such A, B, C and D all lie on the circle (O, 5) )\n\ni'm curious whether this technique was shown and proved elsewhere, as well as whether the technique can be adapted for hand drawing other curves or curved shapes too.\n\nmany thanks.",
            "Take n circles with different radii r_i in R^2 , I'm trying to find the radius of the smallest circle that could fit all n circles in it with no overlap. I'm pretty sure this is a very difficult problem, but does anyone have any insight on how I could solve/approximate this?\n\nIn case it helps, the practical situations I'd use this for would be restricted to n<=20 and only a handful of possible values for r_i (most circles would be the same size, with maybe up to 5 total different sizes). The final result could also be off by a few percent without being an issue, so approximations would already be hugely helpful.",
            "I have started going through John Lee's *Introduction to Topological Manifolds* and wanted to see other examples of solutions of the problem 2-5a) Give two subsets of ℝ^2: X,Y and a function f: X -> Y such that f is open, but neither closed nor continuous. I found this solution on scribd.com:\n\nX = B₂(0,0) \\ ∂B₁(0,0), so a ball radius 2 without a circle radius 1 all centered at (0,0). Y = B₄(0,0). f is then defined as f(x,y) = (x,y), when (x,y) is in B₁(0,0); and (2x,2y), when (x,y) is in X \\ B₁(0,0).\n\nIt states that the function is \"*clearly not continuous*\", but I think otherwise. Going off of the topological definition, any preimage of an open ball in Y will either be an open ball in X, or a \"half-ball\" being cut off at the boundary of B₁(0,0). However since that boundary is not in X by its definition, the pre-image is still open.\n\nIs the given example wrong or am I missing something?",
            "Suppose Fq is a finite field, how would I go about finding out how many primitive elements Fq^n has over Fq?",
            "Are there any online sources I can use to review Calculus 3 and Differential Equations?",
            "Is there a more efficient way to prove that the localization of a ring is a ring? The proofs I've seen have been just a lot of simple algebraic manipulations (in my opinion quite dry), but maybe there is a shorter way to show this fact.",
            "I am looking for an easy-to-read book on manifolds, preferably with a lot of examples. The concept was introduced in my real analysis class. Since it is really abstract, I am looking to become more familiar with it by exploring examples and problems. Does anyone have a good book recommendation?",
            "x-x=0\n\nx+(-x)= 0\n\ni= **√**-1\n\n**√**1=1\n\n**√**1 + (**√**-1) = 0\n\n1+(**√**-1)=0 I -1\n\n**√**-1=-1\n\ni=-1????????????",
            "I watched a video a few minutes ago [0⁰ = 1 Proof (youtube.com) ](https://www.youtube.com/watch?v=vDp4TeDZpVI)\n\nI was wondering, how can we just define 0\\^0 to be 1 because it's convenient?  Especially because there are theorems that depend on it as he said in the video (I'm not sure if that's true or not).  Surely you wouldn't say something like 1+1=3 just because you say so.  Does this have to do with 0/0 being undefined?  Why didn't he just stop at 0/0 if it's undefined?  Is this a bad proof of 0\\^0?\n\nEdit: people in the comment section of the video are not happy about the proof, so im just gonna go on a limb and say this is a bad attempt at a proof.",
            "I'm an undergraduate math student, and very passionate about learning new stuff. I usually don't have much struggle in following proofs, thinking how can I solve exercises / problems and sketching proofs. My big struggle is when I apply the knowledge I have - I'm very prone to mistakes, specially when I have to compute something, which can be really annoying. I feel like I want to do things fast, and I actually think fast, but not very accurately. Do you have some tips on how can I improve in this matter?",
            "Information Theory question - What's the best way to compress 5 categories into 3?\n\ntldr; compressing a one-hot vector such as \\[0, 1, 0, 0, 0\\] into length 3 instead.  \\[-1, 0, 0\\], \\[1, 0 , 0\\], \\[0, -1, 0\\], \\[0, 1, 0\\], \\[0, 0, -1\\] is probably the best solution, I would assume. But didn't know if anybody had a better answer.\n\nThis question is in the context of reinforcement learning, and I am representing a game to a model. I have 5 gems, and these get repeated a lot in my game representation vector. So if I can compress the representation to 2 or 3, it would be wildly beneficial. I'm assuming that the best answer is the vectors that have the highest entropy, under the confines that they should be between -1 and 1. Any combo will do, and the model will learn, but which is optimal?",
            "Let's say I have four generators (a, b, c and d) of a group, G. Now I want to definine the relations between these to make the group finite. Consider the set of all group elements that can be written as the ordered product a^n * b^m * c^l * d^k, where n, m, l and k are integers. For the order of G to be finite, do all elements of G need to adhere to this format? That is, do all elements of G need to belong to this set for G to be finite? ",
            "(Post got removed so I'll post it here)\n\nLooking to make math fun for me again.  \n[](https://www.reddit.com/r/math/?f=flair_name%3A%22Removed%20-%20ask%20in%20Quick%20Questions%20thread%22)I am entering my senior year of high school this coming September. As I have completed all my math credits, I will no longer have a math class as part of my day-to-day schedule. I used to enjoy math from middle school to Freshman year but hated it all the way through Sophomore and Junior (Geometry and Algebra II respectively.) Now that I don't have to do math for school would it be wise to go on my own mathematical journey until I've to take mandatory math in college? I really didn't like Geometry so I was thinking I might start there so I could try to learn it straight out of a textbook different from the way my math teacher last year taught it.",
            "[deleted]",
            "Fix an element (z,w) in C\\^(2) of unit length, where C is the set of complex numbers. Why is the set {(e\\^(it) z, e\\^(it) w) : t in R } a circle? A great circle of S\\^3 in C\\^2? This is in regards to the Hopf fibration. Also, we can think of the Hopf fibration as the quotient of S\\^3 by the action of S\\^1, does this imply that the fibers of this bundle is homeomorphic to S\\^1?",
            "I want to get better in maths but I'm learning it a very slow speed even simple basic questions. Is this telling me I'm not going to be good?Although I haven't studied for past 8 years neither I have worked hard on maths",
            "why is there no popularly used symbol for primes (like a stylized P) ?",
            "    I can't solve this exercise, it seems impossible to me.\n    30 St Mary Ax is a building located in the heart of the city of London and is considered the first skyscraper in the British capital to be built with ecological criteria. This building stands out for its height of 180 meters on a narrow plot, and for the significant variation in the diameter of its floors. At the base, its diameter is 49 meters, it widens to 56.5 meters at the widest part, and narrows to 26.5 meters at the top floor, located 167 meters from the ground. They are required to demonstrate at what height from the ground the widest sector of the building is, applying knowledge of geometry.",
            "What kind of maths are you interested in?",
            "Pick an area. Say, from here [https://math.ucsd.edu/research](https://math.ucsd.edu/research)  \nThen look at graduate notes on that area",
            "Reverse the flow of time, and you get a [pursuit curve](https://en.wikipedia.org/wiki/Pursuit_curve).",
            "It is absolutely possible. You do not need calculus to learn to write proofs at all. In fact, technically you don’t need anything beyond algebra I I would say (but more knowledge never hurts). Go for it! \n\nAs for books, I think any book about proofs like the ones by Velleman or Hammack are appropriate. ",
            "One possibility you might enjoy is to look at a book on number theory, abstract algebra, or real analysis and walk through some of the proofs at the beginning of the book. These are difficult subjects, but at the start of the book there are usually proofs you can follow with few to no prerequisites. For instance, using the definitions of addition and multiplication of natural numbers, you can prove a variety of properties you learned in elementary school, like the associative, commutative, and distributive properties. I'll give the concrete example of proving that (a+b)+c = a+(b+c) for all natural numbers a, b, and c. We use the following definition of addition:\n\n\n(1) n+0 = n, and\n\n\n(2) m+(n+1) = (m+n)+1\n\n\nfor all natural numbers m and n.\n\n\n\nFirst, let a and b be natural numbers and let c = 0. Then (a+b)+0 = a+b = a+(b+0), by (1).\n\n\nNow suppose (a+b)+c = a+(b+c) for all natural numbers a and b for some natural number c=n. We must show it also holds for c=n+1. That is, we must show (a+b)+(n+1) = a+(b+(n+1)).\n\n\n(a+b)+(n+1) = ((a+b)+n)+1 by (2).\n\n\n((a+b)+n)+1 = (a+(b+n))+1 by assumption.\n\n\n(a+(b+n))+1 = a+((b+n)+1) by (2).\n\n\na+((b+n)+1) = a+(b+(n+1)) by (2).\n\n\n(a+b)+(n+1) = a+(b+(n+1)) by the transitive property of equality.\n\n\nTherefore whenever the equation holds for some c=n, it also holds for c=n+1. And it holds for c=0. So by induction, it holds for all natural numbers c.",
            "[Here's](https://en.wikipedia.org/wiki/Circle_packing_in_a_circle) a table of solutions,for 1 ≤ n ≤ 20.",
            "That example seems wrong to me, yeah.",
            "Use the Frobenius. The degree of extension of an element equals the number of conjugate, which equals the number of elements obtained by repeated application of the Frobenius.",
            "Khan Academy or [Pauls Online Notes](https://tutorial.math.lamar.edu/).",
            "Afaik any definition ultimately boils down to verifying ring axioms, but, given a multiplicative subset S ⊂ R , you might prefer the definition of localization 𝜙 : M → S-^(1M) as an initial object in the category of R-module maps M → N , such that s ∈ S is invertible in N. See [Vakil (1.3.3.)](https://math.stanford.edu/~vakil/216blog/FOAGapr0123public.pdf) for details.",
            "Calculus on Manifold by Spivak?",
            "Where are you getting line 5 from? It's true that sqrt(1 + (-1)) = sqrt(0) but you can't infer that sqrt(1) + sqrt(-1) = 0; it is in general false that sqrt(a + b) = sqrt(a) + sqrt(b).",
            "It's more than convenience. There are natural definitions of exponentiation where 0^0 = 1 is just a special case. For example, a rigorous definition of \"repeated multiplication\" by induction: x^0 = 1, x^(n+1) = x^n x. Many properties of exponentiation can be proved without caring about whether x is 0.\n\nIn contrast, the conventional definition of division via multiplicative inverses (x/y = xy^(-1)) simply does not apply to 0. Extending that definition to 0 would require an ad hoc special case, and then any property of division must have its proof amended accordingly, if it even still makes sense.\n\nIt also depends on the context. 0^0 is not as meaningful if you're looking at exponentiation by real numbers. As a two-variable function, x^y has a discontinuity at (0,0) (x^0 = 1, but 0^y = 0).  Arbitrarily giving a value to 0^0 won't change the fact that you have to be careful about what's going on around there anyway.",
            "We can define an undefined thing if we want. The caveat is that it should make some sort of sense to do so.\n\nFor example it doesn't make sense to define 1/0 in general. The most natural thing to do there is take the limit of 1/x as x tends to 0 but this gives answers that disagree so undefined is better than picking one in general. 0/0 is even worse in this regard as you have various ways to get to it. Is it the limit of 0/x or x/x or should we even take something weirder like 2x/x?\n\n0^0 runs into some of the same problems as 0/0 so it is reasonable to say it is not defined either but there are some scenarios where it makes sense to argue it is 1. For example, if you are considering only whole numbers as exponents so x^n is x \\* x \\* ... \\* x and so on then x^0 means the empty product which is always 1 so plugging in zero should still give 1. This means it makes sense as the constant term in a polynomial for example. Various formulae work best if we assume 0^0 = 1 as well such as the binomial formula, differentiating polynomials at x=0, the Taylor series for e^x and so on.\n\nBasically, it is more common for a scenario where 0^0 = 1 is a useful definition so we can use that.\n\nNote this is different to defining 1+1=3 because that definition contradicts our other rules of arithmetic and breaks lots of things while 0^0 = 1 only breaks the rule 0^x = 0.",
            "You're absolutely right that the 'proof' in the video is absolute nonsense. At best, it works as a handwavy justification.\n\nIf we leave 0^0 entirely undefined, which would be the 'default', many theorems end up saying things like:\n> The number of functions from X to Y is |Y|^(|X|) , **and if both |Y| and |X| are zero, it's 1.**\n\n> The derivative of x^n is nx^(n-1) , **and if x and n-1 are both zero, it's 1**.\n\nSo you have a bunch of theorems that all seem to 'naturally' use this special operation that's exactly the same as exponentiation, but *also* gives you 1 at 0^(0). Since 0^0 is not [yet] defined, it ends up making a lot of sense to just... well, define it that way!",
            "One general piece of advice is to think from the point of view of whoever is going to read your proof. You want to make their job, which is to check your proof, as easy as possible. And in one instance, \"the reader\" is going to be \"you\" when you are double-checking your proof.\n\nThe most basic thing is to work on the form of the proof. You don't want to write a wall of text or a wall of formulas. Even if the proof is only calculations, try to be creative in how it is laid out. If every step only does one simple thing, then most likely there are many parts to an equation that remain unchanged at each step, and you could vertically align them to make that clear. If you find yourself repeating something a lot (which, at length, results in being sloppier and making mistakes), that could be a sign that there is a general result at play, so try to state it explicitly and avoid the repetition.\n\nAt a more high level, you need ways to double check your answer independently of how you reached it. A simple case is if you're solving an equation, then you must plug the solution in it and check that the equation holds. If the answer is a number, maybe you can find approximations, or bounds on it. In more abstract situations, look for symmetries or other properties that the solution must satisfy.\n\nLook for ways to visualize the problem. In ideal cases, you can literally draw a picture that illustrates what's going on. In some other situations, you can still give a high level idea of the proof before diving into the details.\n\nTo sum up, intuition is not only useful to come up with a proof, but also to guide the flow of the written proof. That makes mistakes less likely, and convinces the reader (including yourself) that you understand what's going on as opposed to stumbling upon the correct answer by trying things blindly.",
            "No; this isn't even true for 2 generators.\n\nConsider the symmetric group on 3 elements; let a = (1,2) and b = (2,3). Then (3,2,1) is not expressible as a^n * b^(m).",
            "Do you have any programming experience? Learning to solve math problems with algorithms is a different way to learn some concepts, that you might enjoy. Check out Project Euler, start solving the problems as they get harder and harder.",
            "Yes, except in February (unless it's a leap year).",
            "It's the intersection of the complex plane C(z,w) with the unit sphere |z|^2 +|w|^2 =1",
            "The primes aren't really a thing people study *by themselves* - it's always in context of the naturals.\n\nLike, the rationals are a field; it makes sense to talk about doing things in the rationals without caring about how they're part of the reals. You can add, subtract, multiply, and divide them, and do a ton of mathematics without ever *leaving* the rationals. It makes sense to think of them as a \"space\" you can navigate, in a sense.\n\nThe primes don't have that. We don't have any nice way to combine two primes to get a new one - practically any operation we do to them will give us something outside of the set of primes.\n\nSo it's not very useful to talk about the primes alone - they don't form a nice \"space\" to play around in.",
            "they didn't *factor* that into account",
            "I'm not an expert but my guess is that it's a mix of \n- you don't really need it, you can just say \"let something be prime\"\n- the letter p is commonly used with so many styles that fixing one just for prime numbers isn't efficient (prime ideals with the fraktur, projective stuff and probability for the blackboard font, the Weierstrass P, Powersets etc.). As far as I've seen the most used unofficial notation is the blackboard P since it's hard to confuse prime numbers and projective space in context.\n- There is a symbol for prime ideals of any ring, Spec. Prime elements and prime ideals aren't the same thing, but for PIDs like the integers they might as well be. On Dedekind rings you prefer working with prime ideals instead of prime elements anyway.",
            "p and q are the popular symbols for primes. Pretty much anytime you see them (in a context where primes make sense), they will mean a prime number.\n\nIn constract mathfrak p is often used for prime ideals in some other ring. We don't want to use mathfrak p for regular primes, as in number theory we are often considering prime numbers in Z at the same time as prime ideals in some larger ring.",
            "i've seen people use mathbb P for that",
            "Put the tower on its side and fit a polynomial to the curvature. Maximize or minimize.",
            "First, I put the tower in a coordinate system where x=height and y=width.\n\nAssuming a second-degree equation y = -x\\^2 + Ax + B for the tower's curvature, we'll get B=49 since y=49 when x=0.\n\nFor the top floor, the equation is 26.5  = -(167\\^2) + 167A + 49. This gives A = 55733/334.\n\nThe derivate of y gives y' = -2x + A, which is the equation for the widest part. y' is here 0 (the equation has its maximum) so x = A/2 = 55733/668 meters or approximately 83.43 meters. This is the height for the widest part.\n\nHere you can put in the coordinates and see the function: [https://www.dcode.fr/function-equation-finder](https://www.dcode.fr/function-equation-finder)",
            "I'm not sure exactly. I was looking into limits, and then the definition of the real numbers, and then started looking into the surreal numbers (I've ordered a book on them).",
            "Thanks!",
            "Sounds good!  I just know people typically learn proofs after a class like calculus in college.",
            "I found that too, but that only works when all circles are the same size. I'm interested about cases where the circles have different sizes.",
            "So I apply the frobenius for each element of Fq and check if it eventually only has one conjugate or I get a loop so to speak?",
            "Much appreciated",
            "Though, you must show an initial object exists... I think there is no way for it to be simpler than verifying ring axioms",
            "Thank you for your response! \nIt is funny that you refer to Vakil, thats exactly what I was reading. In the first paragraph of 1.3.3. he says \"(If you wish, you may check that this equality of fractions really is an equivalence relation and the two binary operations on fractions are well-defined on equivalence classes and make S^{-1}A into a ring)\". So before he gives the second one, so I think then it would be needed to verifying the ring axioms as you say.",
            "I have not read it but Calculus on Manifolds by Spivak really has a lot of examples? I thought the book was famous for being so concise and to the point. ",
            "Thank you!",
            "no i thoungt that **√**1 and **√**-1 have the same value so you can put it in the second equation",
            "Thank you. It's it possible to construct such an ordered product of a minimal amount of elements that generates the group? Does it have a name? ",
            "I know absolutely nothing about programming or what it means to be a programmer haha. But I will try out that methodology sometime. I'm gonna check out some of the resources I've been recommended recently here!",
            "Could you kindly break this down for me?",
            "Why is it obvious that a 2 dim subspace of R\\^4 intersects S\\^3 in a (great) circle?",
            "there's a lot of problems in number theory where you start with \"assume is an element of primes\"",
            "Maybe work through Abbott's understanding analysis? It's fantastic and the exercises should be doable for you.",
            "If you're interested in the construction of the reals, then I can recommend Stillwell's *The Real Numbers* or Bloch's *The Real Numbers and Real Analysis*, both of which treat the subject in considerable detail.",
            "Blame engineers. The standard \"calculus track\" is the one that's most important for engineers and scientists to know, so our educational systems focus on that. But really, mathematical progression is not linear - by the time you've started calculus you've already gone straight past a *lot* of branching-off points, and you could study those branches for *years* without touching calculus.",
            "No need. It is more of a standard.\nIn fact, if you are interested in math and decide to do proofs, I would say you can even jump straight to Real Analysis  and not self study Calculus at all.\n\nProofs and basic set theory are much more important for Real than Calculus itself.\n\nWhatever you choose, wish you luck!",
            "Here's an example with calculation:\n\n[https://youtu.be/9fACsf04a\\_w](https://youtu.be/9fACsf04a_w)\n\nHere, some other cases are discussed:\n\n[https://math.stackexchange.com/questions/647790/unequal-circles-within-circle-with-least-possible-radius](https://math.stackexchange.com/questions/647790/unequal-circles-within-circle-with-least-possible-radius)",
            "Yeah you will get the loop and returns to itself.",
            "Yep, but in this setting it’s easier imo to see localization is a special case of the tensor product, which is neat. ",
            "[deleted]",
            "If sqrt(1) and sqrt(-1) \"have the same value\", i.e. sqrt(1) = sqrt(-1), then we would have i = 1, which can't be right. The second equation tells you, for instance, that sqrt(1) + (-sqrt(1)) = 0; but you can't conclude from there that sqrt(1) + sqrt(-1) = 0, because -sqrt(1) is *not* the same thing as sqrt(-1). If we had -sqrt(1) = sqrt(-1) then we would immediately get your conclusion i = -1 without the need to do any of your other steps. But that premise is false-- the equation -sqrt(x) = sqrt(-x) is not true for any x except 0--and the conclusion is false as well.",
            "[Indra's Pearls](https://www.dam.brown.edu/people/mumford/beyond/indra.html) explores geometry through programming. Beautiful book.",
            "rent is 9600/year, so an even share will be 4800. Roommate 1 pays 52*100 = 5200 /yr, 400 more than an even split.",
            "Sure, but that's probably the main (only?) reason you'd need a symbol for the set of all primes, in which case you can really just say \"let p be prime\" without needing to introduce a new symbol. Part of why it's useful to have symbols like Z, Q, R is that you often build structures \"on top of\" or \"out of\" one of those sets, e.g. by products, adjoining elements, quotients, or multiple of those operations--think R^n, Z/nZ, Q(i), Q[x]/(x^2 - 2), and so on. In that case having a symbol for the \"base\" set automatically gives you a nice symbol for the new structure. But because (as u/AcellOfllSpades mentioned) the primes don't have much structure, you don't often build new structures out of the set of all primes in the same way, so one of the big reasons you'd want a symbol for the set of all integers, say, is absent for the set of all primes.",
            "Sure, but all those usages are easily rephrasable as \"assume *p* is prime\". You're not actually using the primes as a *set*, you're using primality as a *property*.",
            "Thanks!",
            "Thank you!",
            "Thanks for the input lol.  yeah I agree definitely isn't linear I'd imagine when you are in more advanced math classes,",
            "Thank you!  I thought Real Analysis was a class that just proved everything in Calculus though?  Wouldn't I need to learn Calc first before?  I've only ever wanted to learn math because I wanted to do something physics, but now doing math just for the sake of math is increasingly interesting.  I come from a pretty math oriented backround with my aunt being a math major and one of my uncles having a degree in physics and P.h.D in applied math, but only recently have I been interested in science.  Do you have any recommendations for books to learn analysis after proofs?  I know Jay Cummings has a book on both proofs and analysis that I see everywhere.",
            "I actually found a recursive formula in case you are interested: Let M(d) denote the amount of primitive elements in Fq^d . Then q^n =Sum over all M(d) with d|n. Just sucks to do for large n but I can't see a direct way. Maybe Mobius Inversion can be applied to this though.",
            "Got it, thank you!",
            "Thank you!",
            "I’m a sophomore in high school as well and have not done too much analysis yet, so I might not be the most appropriate person to ask for advice.  However, if you are capable of studying proofs, I think doing Calculus before Analysis is kind of unnecessary. If you learn Analysis, you would already have a good grasp of the majority of the material that is taught in a Calculus course. If you only do Calculus however, well… you would not know much Analysis.  Moreover, pretty much all Analysis books don’t assume that the reader has taken Calculus. In fact, most Analysis books are entirely self-contained and include a preliminary chapter on proofs or set theory. See for example, Analysis with an introduction to proof by Lay, Understanding Analysis by Abbott and even the book by Jay Cummings you mentioned.  If you are interested in studying physics, however, I would imagine you probably want to be comfortable with computations and perhaps optimization too. If that’s your case, I think the book Calculus by Michael Spivak is the best fit. I have not read much of it, but it seems to lie in the intersection of Calculus and Analysis, computations and rigour. You don’t actually need to learn proofs to start Spivak. You will learn as you progress! (you will eventually have to learn some naïve set theory though) If not, the Jay Cummins books (both on Proofs and Analysis) look pretty fine.  Sorry for the long comment, hope this helps.",
            "Haha no worries, yeah it helps.  I'll probably pick up a proofwriting book this summer and jump into it.  Thanks for the advice!"
        ]
    },
    "Career and Education Questions: June 20, 2024": {
        "title": "Career and Education Questions: June 20, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/math/comments/1dkf7b6/career_and_education_questions_june_20_2024/",
        "content": "This recurring thread will be for any questions or advice concerning careers and education in mathematics. Please feel free to post a comment below, and sort by new to see comments which may be unanswered.\n\nPlease consider including a brief introduction about your background and the context of your question.\n\nHelpful subreddits include [/r/GradSchool](https://www.reddit.com/r/GradSchool), [/r/AskAcademia](https://www.reddit.com/r/AskAcademia), [/r/Jobs](https://www.reddit.com/r/Jobs), and [/r/CareerGuidance](https://www.reddit.com/r/CareerGuidance).\n\nIf you wish to discuss the math you've been thinking about, you should post in the most recent [What Are You Working On?](https://www.reddit.com/r/math/search?q=what+are+you+working+on+author%3Ainherentlyawesome&restrict_sr=on&sort=new&t=all) thread.",
        "num_comments": 10,
        "comments": [
            "Helloo,\n\n**TL;DR: Applied math undergrad looking to transition to pure math for master's at good EU universities. Seeking advice on feasibility, areas to focus on, specialization selection, and improving my chances of acceptance.**\n\nI'm considering applying for master's programs in pure mathematics good universities in Europe (excluding the UK), such as Bonn, Uni of Pisa , ETH Z, EPFL, TUM, Uni of Vienna, etc. However, my bachelor's degree focused heavily on applied mathematics, statistics, and some physics.\n\nAcademic Background:\n\nI completed a bachelor's degree in statistics, with mathematics and physics as my minors. My coursework included calculus (including multivariable), linear algebra, differential equations, statistics, and physics (thermodynamics, quantum mechanics etc.)\n\nI'm particularly interested in understanding the following:\n\n- How feasible is it to transition from an applied mathematics background to studying pure mathematics at the graduate level, especially for top universities in Europe?\n- Are there specific areas of pure mathematics that I should focus on strengthening my knowledge in before applying to these programs?\n- Do good EU universities with a low acceptance rate like Bonn, ETH , EPFL etc., welcome applicants with applied mathematics backgrounds who want to pursue pure mathematics?\n- Considering my background, would it be more advisable to apply for applied mathematics master's programs initially and then shift towards pure mathematics if possible?\n\nAdditionally, my counselor has advised me to mention my desired specialization in my SOP as it increases the chances of admission, but since I've just started learning higher level pure math subjects, I'm unsure which specialization to select. Is there a quick and easy way to determine which higher-level math subjects you truly like if you don't know much about them yet?\n\nDo I actually have a chance of getting into these good universities with my current background? Is there anything I can do to improve my chances? (I am studying passionately and extensively every day to fill my gaps)\n\nI would greatly appreciate any advice, personal experiences, or recommendations from those who have insights into this topic. Thank you in advance for your help!",
            "Just finished my undergraduate, I am trying to look ahead to my masters and think about what I want to explore during it. I am curious what are some areas that are worth checking out, given that the following were things that I had fun with during undergrad:\n\nFinite Group Representations\n\nSymmetric Polynomials\n\nTensors\n\nMapping Class Groups\n\nKnots/Braids\n\nConfiguration Spaces\n\nHilbert/Banach Spaces\n\nMarkov Chains\n\nConvergence Theorems\n\nMeasure Spaces\n\nMixing and other things Ergodic\n\nAny recommendations of an area to check out before the semester starts to see if I want to spend more time on it?",
            "What are some good careers that involve math that aren't for evil corporations?",
            "Hello everyone.\n\nI'm looking for suggestions for companies to apply to. I have a Masters Degree in Data Analysis with about 1 year of experience. I'd like to find companies in Florida as that's where I live. The following lists are things that the job should have to work best with me, things I'd like the job to have and any bonus points towards the company. Please let me know your thoughts and have a good day.\n\n**Need**\n\n* Pay >= $90K/Year \n* Remote option available\n* Disability friendly (I have ADHD)\n* Involved in research (e.g. psychology, medical, physics)\n* No forced volunteering\n* Not fast-paced\n* Indoor work environment\n* Work on my own most of the time\n* Primarily use SAS, SAS Enterprise, R or Python for main job\n* Minimal travel (< 10%)\n\n**Nice to have**\n\n* Pay > $100,000\n* 100% remote (can have office, but can work at home too.)\n* Flexible scheduling\n* Minimal meetingsStart date 11/1/2024 or laterUse Tableau or Power BI for graphicsNo travel|\n\n**Bonus points**\n\n* Gym membership options\n* Student Loan Help\n* Moving expenses\n* Retirement help",
            "Hi all,\n\nI wanted to know what schools in Asia, particularly Malaysia, will cover the cost of tuition for 3 children 100%. I am aware that many cover the cost of tuition for 2 children but not 3 children.\n\n  \nAlso, which parts of Asia have the best packages for a family and allow you to save the most? Are there any that are:\n\n1. Tax free salary\n\n2. House allowance for family provided\n\n3. Flights home annually\n\n  \nAre there any other perks I should be aware of?\n\nCan you negotiate with schools if your subject area is high demand?\n\nThank you for your insights.",
            "It sounds like your bachelor is in the US? I think you have very little chance for top programs. With zero analysis and algebra background, you’d even have trouble being taken seriously by pure math masters programs in the US, not to mention Europe. Even if you manage to get in, you will have an exceedingly hard time surviving the program, since most students will be way ahead of you: their bachelors usually cover the first year of US grad school math if not more. Your math background (minus stats&physics) is covered in European high schools and maybe first year. Even applied math in Europe requires rigorous training in foundational topics like analysis. You should aim for a transitional/remedial masters/postbac program in the US instead. But it is possible that you eventually will rely on your statistical background to get jobs since a masters in pure math doesn’t open many new doors.\n\nOnce you acquire US first year grad level of math (measure theory, algebraic topology, etc) on transcript, then you will have a chance of getting in. But even for qualified students, their programs and math culture are very different from that of US that many US students can still struggle immensely. I would not recommend European masters for typical US students unless you have very good reasons.",
            "There was a thread discussing this question in the last 6 months ? look it up in the sub.",
            "I don't want to be rude, but why are you asking us? This sub isn't about international schools.",
            "Thanks for the reply, very much grateful :)\nI'm actually from India (theres always an Indian :p). I'm aware that I lack the prerequisite subjects on paper, but I'm working on them unofficially. I left my entry-level job to focus on studying pure math subjects full time. I've finished a proof-writing book and recently started an Analysis and a theoretical linear algebra book. I've got a year before starting my master's, so I think I will cover a lot by then (please correct me if I'm wrong.\n\nWill universities still see me as lacking knowledge in these subjects even after my self-study efforts? Also, I'm not looking for a job after my master's—I'm aiming for a PhD in pure math. I know I might be a bit late but better late than never i guess. Thanks again for the advice!",
            "Gotcha. Unfortunately I believe Europe admission works the same way as the US on unofficial self-studying: they don’t count, unless you are self-learning under the supervision of a (well-established) mathematician that can write you a glowing reference letter. Otherwise you need them to be on your transcript. They have good reasons: there is no way to evaluate your mastery of the materials unless you take it as a structured course with a syllabus detailing the content and evaluation methods. It’s commendable that you have so much passion for learning pure math. You might want to aim for less competitive programs (especially in the US) designed for non-major enthusiasts like yourself."
        ]
    },
    "I hate the fact that exams supposedly testing your mathematical ability is testing your regurgitating ability.": {
        "title": "I hate the fact that exams supposedly testing your mathematical ability is testing your regurgitating ability.",
        "score": 207,
        "url": "https://www.reddit.com/r/math/comments/1dlhhz6/i_hate_the_fact_that_exams_supposedly_testing/",
        "content": "Coming from a third world education system, damn I want to study mathematics and discuss mathematical topics and not just getting degrees without having an idea about what the hell I studied, what a waste of time and energy for people who care about the quality of education rather than the number of degree holders.\n\n&#x200B;\n\nIs this a global issue ? I mean I believe it's a consequence of capitalism and people in power that have zero interest in education and mathematics.",
        "num_comments": 85,
        "comments": [
            "Time limits. It’s very hard to test your mathematical ability in an exam lasting 1.5 hours. The most ideal way to go about everything is have one on one oral exams with your professor … but this is basically impossible in most cases because of time and money restrictions. Homeworks are a lot better at seeing if you’re understanding the material (assuming you don’t look up solutions right away which a significant portion of students do).",
            "I've taught at a low-income school for 4 years. I try to assign a mix of tests and projects. Unfortunately, if we don't have quizzes every 2 weeks or so, the kids don't learn how to actually do the calculations. They skip the homework or copy it off their friends; they mimic the example projects and change like 1 thing; they over-rely on technology; they don't take notes.\n\nThere is value in having a mix, I think. Exams encourage the *automaticity* you need to really succeed in mathematics, and projects give you a better idea of what real-world math actually looks like.\n\nI found your \"capitalism\" comment rather silly because exams are older than capitalism. The first standardized exams go back to the Sui Dynasty (the year 605 CE), long before capitalism even existed. Those imperial examinations were used to select government officials.\n\nIn any meritocracy, you need safeguards against incompetence that cannot be sidestepped, faked, or cheated. Exams are very good at that.",
            "What alternative metric are you proposing for measuring mathematical ability? To be blunt, if you can't do a particular style of problem on demand, then your ability *is* incomplete in that area. Of all the domains humans endeavor to teach, mathematical ability is one of the easiest to measure and one of the hardest to fake. \n\nEdit: and just to clarify, you are very correct suggesting that many degrees are awarded based on metrics other than actual competency. I'm curious to know if you think it is the method or the system applying the method that's broken.",
            "I think that sometimes people get confused about what exams are testing them on.  If you learn the underlying reasons and methods for something, then you can apply the strategies, algorithms, etc. required for the questions.  If you only learn the algorithms, then yes it will seem like regurgitating instead of learning and being truly tested.\n\nOnce you get to upper-level math classes, definitions become very important and a lot less actual computation is done/tested on.  It might feel like these exams are asking you to regurgitate definitions.  The reality is, these definitions are fundamental to ensuring a proper foundation necessary to understand the rest (i.e. in linear algebra, abstract algebra, higher-level differential equations, etc).",
            "you chose to rote learn exam answers and then blame it on capitalism",
            "In some countries oral exams are quite common for graduate courses. In those it is often easier to check if a student understood the content instead of testing if he/she can solve certain problem sets. \nBut for undergraduate level this is quite hard but I also think on the basic bachelor level written exams are good enough to test the understanding.",
            "This might be a matter of approach. I'm a CS student, and had to take a few math courses. To this day, I use, apply, and understand every single thing I learned in those classes 3 years ago. Regurgitation feels more like a characteristic of high school math, which doesn't require as much thought and understanding. In my eyes, a good test (such as the ones I took) doesn't benefit from intense memorization, but instead requires an understanding of the subject, which, once formed, tends to stay. The few classes I truly hated during my undergrad were mainly the ones that were just a test of memory (I still have nightmares from Introduction to Operating Systems), but I can still solve a Linear Algebra 2 exam without preparation, since I remember the main theorems, and understand the rest. This is partially dependent on the professor, and of course it's reliant on the curriculum, but if you have a chance to form an understanding of the subject, you can maybe even enjoy mathematics. I know that I might be speaking without seeing the full picture since I'm just an undergrad, but I feel like all you need is one good professor to love the study of math.",
            "I agree with you directionally, but I don't share the strength of your opinion.\n\nFundamentally, I think you're right; one's ability to answer five questions in 50 minutes or whatever is not really a good indicator of how good they are or will be at math. In an ideal world grades would only depend on homework, but it's so easy to cheat these days that if you base grades solely on homework then you're basically creating an arms race between students to cheat more and more. So, there needs to be a way to verify that the work a student is doing is truly their own, and as far as I can tell the only way to really do that is to physically watch the students do the work by themselves.\n\nI've been noticing a little bit of a trend in recent years to start doing away with time restrictions on exams. This I think has a handful of logistical issues, but in the grand scheme of things I think those are fairly minor compared to what is gained.",
            "We need reference to what classes. At uni in USA, it was regurgitation until proofs and then it really can’t be at that point. \n\n\nMy modern algebra class was so hard that some would get a B and never had actually finished a proof (curve and teacher graded on understanding of concepts generously- if the proof demonstrated you understood pretty well but you didn’t finish it, you wouldn’t get too many points knocked off)\n\nThey had to take me out of the curve a few times because I usually did better than others and would typically get an A outright. 😵‍💫",
            "The exams i liked best were open book exams. You could take your study book into the exam hall.\n\n\nIf you studied well, i'd be great to have some reference.\n\n\nIf you didn't study, the book was too thick and the questions too difficult to stand a chance of looking everything up in time.",
            "ebil gabidalism :DDDDDDDD",
            "IMO, timed exams measure the ability to work under pressure more than they measure mastery of concepts and problem solving abilities. So the question depends on the goal of the teacher. If the teacher is trying to prepare students for the work force, then timed exams may be more appropriate.",
            "When I was in like 11th grade I suddenly \"got it\" I picked up geometry trig and calc in a short period of time.  But in college I couldn't tutor it worth shit.  My co students just didn't \"get it\" and I could not figure out how to teach it to them.  I'm talking basic algebra.  I would change both sides of the equation and they got lost at that.  It made me believe that some people will never appreciate math let alone understand .... well any of it.",
            "I remember one of the standardized tests I took in highschool expected you to round gravity to 10m/s2. If you used 9.8, they marked it wrong.",
            "Then just ask for the graduate level maths exams. Issue is that they can take 3+ hours to do, but they'll do more than regurgitating.",
            "If you try self-studying you’ll find that testing yourself periodically is extremely useful for studying, it forces you to review what you’ve learned which helps it stay in your mind much better and it helps you get a better idea of how well you actually understand the stuff you’ve learned",
            "That's why you have better exams and more time with them. Remove multiple choice puke and narrow just answer problems. \"But i'm testing if he knows this term that is important in an effective way\"; nope! you're just testing if the student had time/motivation to memorize the random thing you deemed important. Most human beings can memorize things very effectively at an age of 6 so there's not really need to test that.\n\nRequiring and giving points for steps and reasoning should always be a default. Having answer is not really important as an ai can give you an aswer aswell. Having the knowledge to prove you are right is the skill of the future.\n\nAdd in open ended questions where you aren't even expected to solve the problem but just show what you can do with things you've learned. Or even just essays of \"how you would teach x to someone else\".\n\nMaths has this very big problem of where the \"how we should teach it\" is so far apart from what studies say is the most optimal way. The change is always so hard because it for some reason always requires someone else to do it first. Be it the lead of the school, the board, parents or students; there's plenty of scapegoats but very few heroes who make the change for better.",
            "That's true of exams in general. Exams aren't good at testing students' true abilities and knowledge, but they are really convenient to organise.",
            "While it may flag someone who doesn’t understand as understanding it, but those who understand the maths behind should pass the tests without much worries. Not always, but usually",
            "it depends though.  Up to calculus 4, by far the vast majority of your testing is literally on your ability to integrate or derive or deviate from a parent graph etc.  It's going to be algorithmic regardless on the kind of test you're taking.\n\nIf you're doing various forms of integration or related rates problems, it will be in some sense regurgitation, sure, but also you need to be well versed in the various forms to know how to set up the integral which is by far the bulk of the work.  If you know your bounds and the kind of integration you're doing, you've done most of the work, and most professors recognize this and give you the bulk of the credit.\n\nIf you're talking about undergrad math, this is a lot of definition memorizations for most of the credit, and then partially how to utilize it.  If you're doing algebra, you're going to write down the definition of your ring group or field etc and maybe what kind of action or object you're looking at such as an annhilator or an ideal and what kind of ideal  etc.  Even for real analysis the bulk of your credit is going to come from your theorem, whether you can use it is a diff story.  However, at the undergrad level how to use it isn't that important.  You can look at a similar problem and if you can replicate the similar process, you're good to go.\n\nat the graduate level is where things will shift.  Ideally you will be doing your own research, and the only distinction from a ph.d is the depth of the topic and well most importantly, if nothing uniquely new comes to fruition, you can still get a masters, but not a ph.d.\n\nKeeping in mind that before you start your ph.d you need to pass qualifying exams and an oral exam.  There are some departments that could forego these, but it is in the students best interest to not do so.  The chance of you discovering something new in your field without a handle of fundamental tools and how to use them is slim to none.  These oral and qual exams are definitely not regurgitation, you need to do quite a bit of thinking.  4 hours for 8 questions emphasizes their importance on depth",
            "Those damn capitalists, trying to prevent our children from learning mathematics",
            "Problem is within your post",
            "As someone who struggles with math and is taking a math class again right now for higher ed, I know why it’s hard. My basic math foundations suck otherwise intermediate algebra would be a breeze to spit out. I think they want the average person dumb because we are easier to control and I think we don’t focus enough on our individual education. I was told in late middle school and high school that no one cares about your education but you, it took till later in my college life to understand that. Plus you deal with 30+ kids all day for minimum wage and standardized test metrics. In the US anyway I can’t say I know what developing nation is like.",
            "Same in so called elite universities",
            "It's just a problem of how much we know about maths.\n\nPeople have been doing maths for millenia and proved a lot of stuff, so to have any chance at advancing the field, you have to know a lot of stuff by the time you get your masters. \n\nAnd you can't just understand your way out of that - no matter how good you understand formal logic, you probably won't be able to prove Godel's inequality within 4 hours if you haven't seen the proof a couple times - this obviously goes for any problem that took legendary mathematicians (hundreds of) years to solve.",
            "Impossible to make an opinion if you don't share an exam to illustrate.",
            "I liked holding conferences with students in lieu of exams during the pandemic. I got to connect with students, each of us would pick some topics from the course to focus on, I would find potential knowledge or problem-solving gaps from reviewing their previous test solutions, and then I would probe their understanding a little more in depth. It was a nice way to connect with each student at the end of the course and to confirm or adjust their achievement data.\n\nNothing works forever, and marks-driven students eventually started turning these conferences into annoying argument sessions for relitigating how their tests were marked, but I miss it right now as I have a stack of 238 exams to crank through in just a week. I see some benefit to having students sit through comprehensive exams, but I feel like a marking robot.",
            "I don’t remember an exam ever asking me to spit up my food",
            "I did a succession of 3 hour mathematics exams, back in the day when I was a student. **None** of them involved \"regurgitation.\"\n\n**None** of them were the result of \"capitalism\" either. Indeed, the USSR used mathematics exams even more extensively than the West.",
            "It's a global issue. Us Americans think we have it bad, but as Feynman demonstrated, everywhere (like Brazil; brazilmentionedletsgo) has it even worse.\n\nI think the Russian school system, of all things, had it the best. Source: Alex Kontorovich's interview with Grant Sanderson on the short-lived 3b1b podcast.",
            "No, the main culprit is that scientists are paid to do science, but they have to do teaching as well. The measure of  success  is usually the quality and the number of publications, not the educational success of their students. Therefore, the exams are often written closed form tests of 90 minutes. That said, during my Master education a head several classes well, the exam was in principle Unlimited Time to prepare the  answer. Of course why some people were preparing the answer, and the other people were discussing their answer.\n\nThe only thing The capitalizm hes to do with this situation is that there are more researchers in science than 50 years ago, especially in fields unrelated to nuclear weapons. This necessitates evaluation schemes, Hirsh indices, index impact factors, etc, and in the long run, 90-minute closed form tests.\n\nThis is a very bureaucratic approach but at least it tries to promote those who are the best. In contrast the Communist way is when, the academic success is dependent on drinking vodka with proper people or claborating with Secret Police.",
            "It's a consequence of capitalism as many things are: there is an incentive for a voluminous mathematical community cranking out results, but there's little incentive for providing mechanisms to really guide and educate upcoming mathematicians. It's always more cost-effective to outsource learning effort to the students themselves, and make up for it with volume of incoming students and filtering through exams. \n\nMath education gets much better at the PhD level (if you have a good advisor, or course) because there you will properly have a guide for your journey. Getting a paper published - getting a few fellow members of the community to recognize that you did something interesting and nontrivial - is the only real proof-pf-understanding that has a paper trail in our current system. Before that it's all proxies like exams and personal judgement from professors on eg your questions in class or in office hours, or in interviews.",
            "You raised a very interesting point. I came from Europe, and the quality of math there is quite rigorous and puts a lot of emphasis on the logical aspect of mathematics rather than reciting a formula and plugging in values. Unfortunately, the level of math in North America is very decent and does not help you develop critical thinking skills.",
            "It's not about capitalism, it's about cronyism",
            "Same with various LLM benchmarks? We need better testing everywhere!",
            "Oral exams often involve regurgitation as well tbh. Not as much though.",
            "I fail to see how oral exams are better. They are extremely susceptible to conscious or unconscious bias of the examiners/professor, especially if they already know the students. \n\n\nIn addition, you wont be able to do every exam at the same time, so in order to make this remotely fair, Examiners would have to prepare an (essentially) unique set of questions for every student. Which is basically impossible if there were more than a handful of students. \n\nAlso, to get a meaningful impression of the students skill, an oral examn for a standard lecture would have to last about what, 2+ hours? Again, somewhat unrealistic for more then a few students.\n\nI have seen how half-assed attempts at oral examns look like as the guy doing protocol…20min-exams with basically the same questions again and again for lectures with 50+ participants. Absolutely awful.",
            "Hard disagree on oral exams testing mathematical abilities better. A 4h exam with good exercices of progressive difficulty is a way better benchmark.\n\nOral exams is a lot harder to conduct correctly.",
            "In my Uni, to my great surprise, students’ self-government made an official request to dean to standardize one on one oral exam. Students’ self-government decided the oral exams are unfair.",
            "A well-done class and exam with have you facing questions that you haven’t seen before, but which can be solved using methods that you have learned.",
            "I don’t think most homework problems given can be solved without stack exchange anyways…",
            "To be honest, OP seems like cope for not scoring well enough to get to actually advanced levels of math where you do not, in fact, regurgitate answers.",
            ">I found your \"capitalism\" comment rather silly because exams are older than capitalism.\n\nThis is not a reason to a priori dismiss OP's argument. While it's true that many phenomena predate capitalism's advent 300-400 years ago, these phenomena would not continue to persist into the present day if there was not a socioeconomic basis for them to exist. Prominent examples: gender as a social construct and patriarchy; the invention of whiteness and the category of race; and market exchange.",
            ">In any meritocracy, you need safeguards against incompetence that cannot  \n be sidestepped, faked, or cheated. Exams are very good at that.\n\nNot all of them, some are very good at that purpose, but not all, maybe the bar is too low now comparing to > 30 years ago.",
            "I am talking about the 21st century exams, or more precisely post pandemic exams, I didn't specify because I thought it's obvious I am not generalizing.",
            "Serious question: do/did you actually get only 50 minutes for an exam where you studie(d) and if so, how did these exams cover the content of the course?\n\nIn my university (EU), I have had 3.5 hours for every math exam I have taken. My high school math exams were already at least 2 hours. I can also either bring a sheet of paper to my exams on which I can write basically anything I want, bring the book used in the course to the exam or both, depending on the person who gives the course.",
            ">then it really can’t be at that point.\n\nYou obviously never met my Real Analysis professor whose entire exam would always boil down to testing if we memorized the right list of pathological counter-examples.",
            "It's a master degree in applied math, exams are carbon copy of the problems we had in the semester, meaning if you memorized the damn problems with solutions you are granted to pass.",
            "Interesting. In my uni, open book exams usually imply you can also bring your own notes, which makes summarising all the main theorems in 1-2 pages a lot easier than searching for them through the book. It also removes the need for students to pay borderline-scam sums on certain math textbooks.",
            "I thought I was in r/politics for a moment",
            "lmaooooo. AcDeMiA-iNdUstRiaL ComPEx",
            "Sorry can you clarify your answer ?",
            "It's exactly the opposite issue; there are lots of students who are good at math and understand it but don't do well under time pressure. Assigning such enormous percentages of a grade to a timed exam is going to flag those students who understand as not understanding.",
            "Correct. It’s hilarious to me that you’re being downvoted.",
            ">Math education gets much better at the PhD level\n\nI hope so, because at this moment I think it's not worth the energy to pursue it if it's eventually not gonna test understanding of math.",
            "Oral exams are even more regurgitation oriented than problem solving oriented. they do try to test whether you know your basic concepts well. But take a look at Princeton general oral exams. They quiz you a lot on definitions and proofs of theorems that are covered in standard first year grad books.",
            ">In addition, you wont be able to do every exam at the same time, so in order to make this remotely fair, Examiners would have to prepare an (essentially) unique set of questions for every student. Which is basically impossible if there were more than a handful of students.\n\n>Also, to get a meaningful impression of the students skill, an oral examn for a standard lecture would have to last about what, 2+ hours? Again, somewhat unrealistic for more then a few students.\n\nYeah that's why the person you responded to said\n\n>this is basically impossible in most cases\n\nYou disagreed with them in your first sentence, then went on to make their point for them in the rest of your post.",
            "They can, but not if you’ve gotten into the habit of using stackexchange. Doing the problems builds your skills, and the more problems you ask about, the more skill you will be lacking. The problems aren’t simply about knowing the solution, it’s the growth that happens when you think about how to solve it.",
            "Biggest self-report I've ever seen",
            "On what level?",
            "Obviously they can be, because the stack exchange posters didn’t need stack exchange to solve them.",
            "/s? They are literally just the lecture content revisited...",
            ">gender as a social construct and patriarchy; the invention of whiteness and the category of race; and market exchange\n\nIs this intended to be a list of (a) things that predate capitalism but persist because of it, or (b) reasons why standardized tests continue to exist?",
            "Do you think post-pandemic exams differ significantly from pre-pandemic exams? In what way?",
            ">I am talking about the 21st century exams, or more precisely post pandemic exams\n\nOh, I see. Kind of hard to realize that when you blame capitalism, which existed long before the pandemic – dating back to Adam Smith (1776) and possibly earlier",
            "That just sounds like you have a lazy professor, not a problem with exams in general",
            "It’s like when a pure mathematician had to teach differential equations because of staff shortages. He came into class and went on about a proof for the whole class. Then, every class he went over homework questions then just talked about anything but math  until class was out. When the test came, everyone failed but I got an A. (Class was 95% engineers). Everyone asked how I did so well and I said because I understand differential equations based on the proof he walked us through. \n\n\nThey were more or less incapable of learning math that way. They would’ve only learned by plugging and chugging numbers.\n\n\nBut I’m not sure how you could even write an exam for real analysis without proofs but I can see how those proofs might’ve been very similar to assigned proofs. But I’m also not sure it’s possible for students to memorize every proof from every assignment in order to replicate it and as a grader- it would be fairly obvious that’s what they did if they couldn’t memorize it entirely- and thus I would give them a really bad grade because they clearly aren’t comprehending and are just regurgitating. Sorry I’m going back and forth on this as I think about it. \n\n\nI can see how most of the other applied classes could be plug and chuggy though- definitely differential equations, linear algebra. My grad level prob & stats was theory based but could’ve been less if it was a different math department & proff. \n\n\nWhich specific classes?\n\n\nETA I took a lot of grad classes (cross listed) in undergrad. Grad students were expected to do undergrad work and also a project.",
            "In my experience professors do that when they don’t think the students are very serious.",
            "Carbon copy of problems in the semester is definitely a lazy professor, but in the general case given time constraints, the most exam questions will usually ask for is for you to be able to unfurl a question into an equivalent one in which you can apply one of the “ main theorems” of the course to. \n\nThis is not a lot better, but being able to unfurl into an easier to attack form is essential to be able to do, and then identify when a “main theorem” is applicable is also useful to test. There ought to be questions that allow students to show a deeper understanding of the theorems, e.g why certain hypothesis are necessary for the theorems to hold, but given time constraints such questions may be unfair.",
            "I'm not sure if this was allowed or not. I also had ''you may bring notes but not the book exams''. \n\n\nAlso we generally barely used books, but ''dictates'', created by our teachers, printed&sold by the student study org.\n\n\nEither way, i believe this exam specifically used a lot of smaller theorems and consequences as well. If you had actually studied those made plenty of sense and you problably didn't even need to look at the book for most of them. But if you hadn't studied, it probably wasn't also one of the main theorems you'd put on the main page.\n\n\nI studied half of it well, and barely looked at the other half, and to me it was very clear how well it actually tested my knowledge, rather than just my ability to reiterate knowledge.\n\n\nFor the first half, even if i forgot something, it was easy to find it from context and get the correct wording.\n\n\nFor the second half i had to dig through half the book because i may have seen it once but never used it so forgot the context.  ",
            "They're making fun of you.   \nSometimes really smart people on the internet do this extremely clever and hilarious thing where they paraphrase what you said but spell it badly.",
            "I think it's a bit of a knee-jerk reaction everytime people mention the relationship between math and social systems (beyond the established classics like complaining about Elsevier'a greed). I might be wrong, but usually 'math does not exist in a vacuum' gets oeople riled up! And it's ok, to first order it does, but that taylor series does not converge as quickly as we'd like to think it does, to put it in an analogy hahaha.",
            "That really depends on the professor and their style of exam. \n\nIn my undergrad, we barely went over MCMC in statistics, but my professor made me construct some advanced form of it by asking a question that could only be solved by that and giving hints (and on the way, all some did line \"how do you expect this model to perform in that situation\" that needed stuff from the lecture).\n\nAnother proof gave out a sheet of *hard* problems two weeks before the exam and always started the exam by asking which of the problems you were able to solve, then to show the solution to one of them. Starting there, the exam really starts by asking you how you got to the solution, which ideas of the lecture were used, maybe about specific theorems or definitions that have something to do with the problem etc.\n\nI always felt like they could ask harder questions in  oral exams because they could always pivot on the fly if they see their student struggle.",
            "Yeah, standing with a blackboard on one side and an audience on the other instantly makes you very very stupid. The only thing you can reliably do is regurgitate things you know cold.\n\nSource: Occasionally I forget calculus while teaching it.",
            "This. I realized that as I went to taking 4-5 math classes a  semester that I was not taking enough time to work on a homework without looking up the answer. \n\nI had to retrain myself to dive as deep as I could without even looking at my notes or the book. If nothing fell out, then I'd peek at those. If after spending a significant amount of time with those resources, I look up the answer and seriously just let my eyes wander over it as fast as possible then I try to solve it again.\n\nSometimes this doesn't work and I need to go over the entire solution. Is this extremely tedious? Yes. But I'd rather go extremely deep on one problem and copy 4 solutions then have a shallow idea on 5 problems which are all copied.\n\nDoing this made me a better mathematician and improved my critical thinking. It made me able to do every problem of a section without having to look up more than one or two hints.",
            "\"Grug! Me have two sheep. Then new sheep? How many sheep?\"\n\n\"Wait two moons for answer.\"\n\n*starts smokes signals towards stackexchange cavern*",
            "A lot of the questions answered on stack exchange are standard so the solutions have been passed down informally over generations. Mathoverflow is a different matter…",
            "Not necessarily true. Good homework problems push you to come up with new connections and discover new theorems for yourself.",
            "The former!",
            "Well earlier. Adam Smith didn’t invent capitalism he just wrote a book describing it.",
            "Yeah which is why most exams are paper pencil exams in a class where they can really throw hard problems at you.",
            "Right, I see.\n\nYou can believe that if you want, but I see it as magical thinking – ascribing causality when it isn’t there. I have not seen any convincing evidence that capitalism is the reason racism, sexism, and exams (which really aren’t as bad as the other two) continue to exist.\n\nCapitalism, to me, seems perfectly compatible with gender and racial equality. And conversely, racism & sexism have flourished in both capitalist and non-capitalist societies from 1900 to the present. But again, that’s just my view."
        ]
    },
    "Can you be someone* in 1/3?": {
        "title": "Can you be someone* in 1/3?",
        "score": 19,
        "url": "https://www.reddit.com/r/math/comments/1dltnwm/can_you_be_someone_in_13/",
        "content": "\\*I mean genetically ethnic, let's say Asian; 2/3 European, 1/3 Asian.\n\nor by extention, can you be that type of someone by 1/x, where: x≠2\\^n ; n∈ℕ",
        "num_comments": 18,
        "comments": [
            "In theory no, in practice 1/3 can be approximated to arbitrary accuracy taking terms of its binary representation 0.010101…\n\nSo you’re 1/3 Asian if you have a grandparent who’s purely Asian, a great-great grandparent who’s Asian and so on. If you just have an Asian grandparent and great-great-grandparent you’re 31.25% Asian.",
            "If we assume the following:\n\n* originally people were 1 of some ethnicity\n* each parent contributes exactly half ethnicity\n\nthen the answer is indeed you can only be only m/2\\^n of some ethnicity. But I don't think we can make these assumptions.",
            "I once met someone who said she was a third Black.  I asked how that happened; she said it was on her father's side.\n\nBut it turns out that\n1/3 = 1/4 + 1/16 + 1/64 + 1/256 + 1/1024 + ...",
            "Not exactly but in practice this can be true approximately.\n\nParent 1 is 75% German (one 100% german parent and one 50%)\n\nParent 2 is 0% German\n\nChild is 37.25% German.\n\nOR Parent 1 is 62.5% German (one 75% one 50% OR one 100% one 25%) \n\nChild is 31.25% German",
            "I just want to point out that genetically, 1/2 of our genes comes from each parent, but of course, that does NOT mean that 1/4 of our genes comes from each grandparent (because the halves are randomly chosen). In fact, given that we have 26 chromosomes, we are never 1/4 the same as one of our grandparents. So contrary to some commenters, we are not limited to fractions that have denominator 2^k .\n\n\nGetting back to the original question, I don’t really know the details of how one defines “what fraction Asian” a person is, genetically (that is, what definition services like 23andme use), but however it’s defined, it’s clear to me that it can’t be defined with perfect precision, in which case I don’t think we can distinguish 1/3 from a close approximation of 1/3 anyway. \n\n(In a theoretical world where each chromosome has a specified ethnicity, your fraction of any race would always be a fraction with 26 as the denominator, but that’s not how it works.)",
            "Fun fact: in the epic of Gilgamesh, the demigod Gilgamesh is 2/3 god and 1/3 human",
            "No, not with genetics in our world. If people can only either be 'starting' at 1, or have genetic ethnicity derived in fractions descending from them with denominators that are powers of 2.\n\nHowever, there is the story of Gilgamesh who is apparently 2/3 god and 1/3 human, and there is technically a solution that allows this if you don't mind a bit of a gross \"All You Zombies\" solution and using time travel. \n\nLet G be an individual. Let X be European and let Y be Asian. Then have G have a child with Y, and denote the child by H. Then, have H time travel back in time and have a child with X with the child being G. G's ethnicity is 1/2 European plus 1/4 Asian plus 1/4 their own ethnicity (as they are their own grandparent), thus working out the algebra, this comes out to 2/3 European and 1/3 Asian.\n\nIt works. But Ew.",
            "Technically, you can be exactly 1/3 Asian.\n\nHumans usually have 46 chromosomes, 23 from the father, 23 from the mother.\n\n46 being not divisible by 3, lets spose you are born with 48 chromosomes. It’s rare, but some people have, for instance, XXYY.\n\n48 being easily divisible by 3, it means you need exactly 16 chromosomes coming straight from Asia.\n\nSay you father is half Asian, half whatever. It means that he inherited exactly 23 chromosomes from his father, 23 from his mother.\n\nNow, all that’s needed, is to pass exactly 16 out of the 23 (or more, since, you know, tetrachromosomy) Asian chromosomes he has to his tetrachromosomic child.\n\nThat’s just the easiest example I could make up, but other scenarii exist.",
            "Race is not a thing. It is a concept that crumbles down as you decide to take it seriously and think about it",
            "Close enough",
            "As a CS student, i approve this very clever solution.",
            "I think this construction assumes that there are arbitrarily old generations of Asians, where really humans have only existed for a finite amount of time...\n\nThough maybe this implies there are humans that are genetically 1/3 of the way to what you'd call an Asian today, which would enable you to be precisely 1/3 Asian...\n\nToo many edge cases...",
            "For the great-great grandparent and grandparent to be asian, doesn't that require the next generation to be at least 1/2 Asian? In that case, does this still work?",
            "How could I forgot of this formula?\n\n\\*my goodness what an idea why didn't I think of that\\* meme moment",
            "1/2 = 2/3\n\nConfirmed",
            "Go outside.",
            "In fact, genes are finite in number. We only have about 20,000 protein-coding genes, so if you happen to have a number of genes divisible by 3, you can actually happen to have exactly one third of specific genes in only about 15 generations (2^(15)>>20,000).",
            "If you look at the power series 1/4 + 1/16 + 1/64 + 1/256  + … = 1/3, it’s not hard to see that the error after taking N terms is 4^(-N)/3.   If we go back 100 generations (roughly  2000 years), the difference from 1/3 would be less than 10^(-30)"
        ]
    },
    "How do you check whether you've actually understood a concept?": {
        "title": "How do you check whether you've actually understood a concept?",
        "score": 11,
        "url": "https://www.reddit.com/r/math/comments/1dlubta/how_do_you_check_whether_youve_actually/",
        "content": "So for example, I recently started self studying linear algebra, and it is kinda tough ngl. The concepts make sense at least, but when it comes to doing exercise sets I make errors or can't do much or at all. After a while I just end up moving on and marking that problem for review.  I'm not in uni yet. This is only for specific topics btw.",
        "num_comments": 4,
        "comments": [
            "Doing exercises is your best bet. If you make a mistake, try to figure out why you made the mistake. It is also good to use books with solution manuals or hints in case you get stuck. Sometimes, being stuck doesn't mean you don't understand the concepts. It might simply mean that the problem requires a 'trick' which you haven't seen before. How to get familiar with the most widely used tricks apart from doing exercises? Read (and try to understand) the proofs. Or better yet, don't just read the proofs. Try to work them out on your own. If you get stuck, read a little of the proof, then try to finish it. This is useful especially in linear algebra where a lot of the proofs are quite straightforward if you understand the concepts and understand what the theorem/lemma/proposition really says, so by doing this you can also check if you understand the material and get a better grasp of it.",
            "Doing exercise. If you fail, try to understand why you did and then exercise more. If you give up without understanding you'll drag those misunderstandings along and, when they have accumulated enough, undermine your comprehension of basically anything related. For people who start doing that at an early age, with fractions or trigonometry for example, this prevents entire careers in anything vaguely scientific.",
            "A first linear algebra course should be hard. If it's easy, like just a bunch of matrix calculations, you're not learning linear algebra. There is a video series called \"The Essence of Linear Algebra\" by 3blue1brown that helps a lot of people. Try it out. See if it helps you with your exercises.\n\nSkipping exercises, especially early ones, is a mistake. Later exercises in a problem set may be challenging you to think a little a harder. Do them. You aren't in a race. You have plenty of time to learn. If your friends are learning faster than you, ask them for help. If you're learning faster than them, help them. Mathematics is a social game despite what you may have read in books. Mathematicians get problems from each other and solve them together.",
            "The only way to truly understand something is with exercises, and lots of them until you are confident doing it. We often think we understand a concept while reading theory, but exercises are a good check to see what we have actually learned"
        ]
    }
}