{
    "[Official] MCAT Study Buddy Thread [2023-2024 Exam Dates]": {
        "title": "[Official] MCAT Study Buddy Thread [2023-2024 Exam Dates]",
        "score": 121,
        "url": "https://www.reddit.com/r/Mcat/comments/17h33dj/official_mcat_study_buddy_thread_20232024_exam/",
        "content": "Welcome [/r/MCAT](https://www.reddit.com/r/MCAT/)! This is the **Official MCAT Study Buddy Thread** for the **2023-2024 test takers**. Studying alone is do-able, but studying with someone who will hold you accountable will prove to be far more beneficial! So take advantage of this high yield opportunity to find a study buddy near you or online! This is **Part 1** of the study buddy thread. **Part 2** and onwards will be published as posts get overcrowded.\n\nAlso, **if you're a retaker**, feel free to join the \"**MCAT Retaker's Chat Room**.\" You can join it via the sidebar widget down below or via this [link](https://s.reddit.com/channel/17857687_c7f442c332b305d3cdc30ec79249028e1aa29ced). Also don't forget, we have a **Discord Server** (link in sidebar) where there's an already established community on 24/7, discussing everything from MCAT to premed to life on Mars.\n\n**To get started**, follow the 3 steps to post and find yourself a study buddy (or even group) in your area!\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**STEP 1**: Entering your information to be contacted by prospective study buddies\n\nCopy/paste and fill out the following requirements:\n\n**Required**:\n\n* **Location** (City, State, Country): *e.g. Dallas, Texas, USA or Toronto, Ontario, Canada*\n* **Test Date** (or Anticipated): *e.g. 4/20/20 registered but may reschedule*\n* **MCAT Prep Material**: *e.g. Kaplan books, NS Exams, UEarth, AAMC (all of it)*\n* **Online/In-Person/Both/No-Preference**:\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *e.g. done with content review, taking 3rd party practice exams right now*\n* **Goal of a Study Buddy**: *e.g. keep each other accountable, quiz each other, share tips, combine notes*\n* **Goal Score and Realistic Score**: *e.g. 514 goal, 510 realistic*\n* **Other obligations**: *e.g. 19 credit hours, extracurriculars, family. part-time job*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *e.g. 23M or 23F*\n* **Other Information/Ice Breakers**: *e.g. I like potatoes so I work in a laboratory with potatoes; I'm a pre-oncological pediatric orthopedic neurosurgeon*\n\n**STEP 2**: Find your Study Buddy\n\n**Use the \"search\" function** on your browser to easily sift through the thread for your city/state (make sure to pre-load all the comments by scrolling down before doing so).\n\nMake sure to reply BOTH via \"comment reply\" and \"private message\"\n\n**Note about private information**: It should be noted that any private information (e.g. names, specific locations, and contact information, zoom/skype, phone numbers, emails, facebook profiles) should be exchanged via PM (Private Message).\n\n**STEP 3**: Make sure to check back\n\nWe'd appreciate it if everyone would actually check back frequently and respond in a timely manner. Your time is just as valuable as everyone else's time. Let's be respectful of each other.\n\nIf you don't find success here, feel free to also join our **discord server** (link in sidebar) and seek out online study buddies there. The community there is large and growing.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\n**Other IMPORTANT MCAT Information**:\n\n1. Check out our [Wiki Page](https://www.reddit.com/r/Mcat/wiki/index) for a basic MCAT 101\n2. Read the side bar for other valuable information (e.g. test score converters)\n\n**Study Buddy Thread History**:\n\n1. 2015: [link](https://www.reddit.com/comments/34klia)\n2. 2015: [link](https://www.reddit.com/comments/3s4ins)\n3. 2017: part 1 [link](https://www.reddit.com/comments/5go3yo), part 2 [link](https://www.reddit.com/comments/6avwc2), part 3 [link](https://www.reddit.com/comments/72ikxw)\n4. 2018: [link](https://www.reddit.com/comments/7s2gw5)\n5. 2019: [link](https://www.reddit.com/r/Mcat/comments/c1bwb8/)\n6. 2020: [link](https://www.reddit.com/r/Mcat/comments/dbwp5v/official_mcat_study_buddy_thread_2020_exam_dates/)\n7. 2021: part 1 [link](https://www.reddit.com/r/Mcat/comments/k2enh6/official_mcat_study_buddy_thread_2021_exam_dates/), part 2 [link](https://www.reddit.com/r/Mcat/comments/l9c4mx/official_updated_mcat_study_buddy_thread_2021/), part 3 [link](https://www.reddit.com/r/Mcat/comments/nvq7np/official_updated_mcat_study_buddy_thread_2021/)\n8. 2022: part 1 [link](https://www.reddit.com/r/Mcat/comments/smafxa/official_mcat_study_buddy_thread_2022_exam_dates/), part 2 [link](https://www.reddit.com/r/Mcat/comments/ty5299/official_part_2_mcat_study_buddy_thread_2022_exam/), part 3 [link](https://www.reddit.com/r/Mcat/comments/waej7j/official_part_3_mcat_study_buddy_thread_2022_exam/)\n\n**Happy studying!**\n\n\\~ [r/MCAT](https://www.reddit.com/r/MCAT/) Mod Team <3 \\~",
        "num_comments": 920,
        "comments": [
            "**Location:** Tempe, AZ\n\n**Test Date:** April 26, 2024\n\n**MCAT Prep Material:** ANKI (MilesDown & my own), AAMC, UWorld soon\n\nI would like to have an online study buddy for now, maybe in-person closer to the time.\n\n**Stage of studying/study plan:** Starting content review, about to take my first full length.\n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, and cheer each other on!\n\n**Goal Score and Realistic Score:** not sure\n\n**Other obligations:** I work as an ER scribe full time in order to pay for rent and bills. I will be cutting back on hours closer to the test though.\n\n**Age/Gender:** 22F\n\n**Other Information/Ice Breakers:**  I struggled with depression and undiagnosed adhd during college and didn't take care of myself well. I had no routine and lost confidence in myself and my ability to study. This MCAT is going to be my redemption! I will be also trying to start running/ working out more while I study for this test.",
            "**Location (City, State, Country):** Maryland\n\n**Test Date (or Anticipated):** 3/22/24\n\n**MCAT Prep Material:** Kaplan books, UWorld, Anki, Jack Westin, BP, AAMC\n\n**Online/In-Person/Both/No-Preference:** Mainly online through Discord\n\n**Stage of studying/study plan:** I took a diagnostics exam through BP(about 1 wk ago) Since then, I've been mainly doing a lot of Qbanks and Anki decks and supplementing any areas that I lack in by taking notes w/ the Kaplan books or youtube videos.\n\n**Goal of a Study Buddy:** Mainly to support and give each other some tips. Definetely open to sharing my notes too :)\n\n**Goal Score and Realistic Score:** 520 Goal, 515 realistic\n\n**Other obligations:** Full time job 7:30AM-3:30PM ;-;\n\n**Age/Gender:** 24F\n\n&#x200B;\n\n**Other Information/Ice Breakers:** Interested in specialties around Dermatology or Plastics as I am currently working as an MA in Derm. Minus all the love for science, I love watching anime, playing some RPG's and or cozy games(Stardew valley, etc). I adore going to the gym in the mornings(5AM gang :P).\n\nFeel free to PM if you wanna study/ chat together or just vent! :)",
            "Location: Miami,FL  \nTest Date: April 26,2024  \nMCAT Prep Material: anki, uworld  \nOnline/In-Person/Both/No-Preference: in person, online\n\n  \nStage of studying/study plan: i have no idea how to go about it, doing uworld and watching youtube videos  \nGoal of a Study Buddy: Keep ourselves accountable, ask each other questions, have someone to commiserate with about the exam and have someone to study with!  \nGoal Score: 512  \nOther obligations: full time work  \nAge/Gender: 22 female  \nOther Information/Ice Breakers:interested in neurology",
            "**Location**: Long Island, NY\n\n**Test Date**: June sometime\n\n**MCAT Prep Material**: UW, AAMC, Kaplan books (probably won't use much of these though), Anki\n\n**Online/In-Person/Both/No-Preference**: Online for now, *maybe* in-person closer to the time\n\n**Stage of studying/study plan**: Doing Anki now, going to start UW at the beginning of November and do that through February\n\n**Goal of a Study Buddy**: Keep ourselves accountable, ask each other questions, have someone to commiserate with about the exam lol\n\n**Goal Score and Realistic Score**: Hoping to beat the score I got last time\n\n**Other obligations**: Nothing really\n\n**Age/Gender**: 25M\n\n**Other Information/Ice Breakers**: I took the exam in 2019 and got a 521, but my score expired, so I'm taking it again. In terms of my hobbies I'm into gaming and anime lol, but I’m trying to get into exercise now as well \n\n&nbsp;\n\nIf you're interested in studying for the exam with me (and you have a similar test date), PM me!",
            "Harlingen, TX, United States\n\nTest date: ~September/October 2024\n\nMCAT PREP: Anki, Kaplan Flash Cards, MCAT prep books, Princeton Prep Books, Notes, Khan Academy, Organic Chemistry Tutor MCAT Videos\nOnline/In Person\n\nStage: Content Review (starting new and fresh)\n\nGoal Study Buddy: accountability, teaching each other (I am a Biology teacher I learn when I explain to someone and vice versa), Quizzing, tips\n\nTest Goal: 518 (for Baylor) I'd be happy with a (510 for my first time taking the exam.\n\nOther obligations: I'm a full time PreAP teacher so during M-F I am busy during school hours. \n\nAge/Gender: 25F\nOther: Um- I'm pretty chill. Willing to help out as much as I can. I have a teaching certificate and the P/S section for MCAT is literally how the PPR exam was for the certification.",
            "Location: Durham, NC\n\nTest date: September 5, 2024\n\nMCAT Prep: Kaplan books, Princeton Psychology book, UWorld, AAMC Practice tests, Kaplan course (maybe)\n\nOnline or in-person (3+ is great as well)\n\nStage of studying: haven’t started yet. Will start up next month and kick it into high gear in May\n\nGoals: just help each other out and cover each other’s weaknesses in content\n\nGoal score: 525 goal and realistic \n\nOther obligations: I hope to be in research this summer, school this semester\n\nAge/Gender: 19M\n\nPlease reach out!",
            "Location: houston, Texas\n\nTest Date: June 22nd \n\nMCAT Prep Material: UW, AAMC, Kaplan books (leaning more on uworld), Anki\n\nOnline/In-Person/Both/No-Preference: in person if you are in Houston, online can be scheduled though Id like to keep any distractions minimal online. Session would be an hour. \n\nStage of studying/study plan: doing uworld, balancing with my work schedule\n\nGoal of a Study Buddy: Keep ourselves motivated, ask each other questions, and help me sink the information in\n\nGoal Score and Realistic Score: hoping for 520+ which would be wY better than last tome\n\nOther obligations: work, and other things for med school like volunteering, shadowing\n\nAge/Gender: 26M\n\nOther Information/Ice Breakers: I took the mcat several times already and had life circumstances that affected my score. Things are better now and different so i am confident that this will be the last time i am taking it. In terms of my hobbies I'm into gaming and anime lol, i also meditate, journal, and exercise. \n \n\nIf you're interested in studying for the exam with me (and you have a similar test date), PM me! I am okay as well if your test date is earlier or later.",
            "**Location**: Edmonton, Alberta Canada T\r  \n\r  \n**Test Date** (or Anticipated): June/August2024\r  \n\r  \nMCAT Prep Material: Kaplan books, Khan, AAMC, Uworld \n\n\r  \nIdeally Online but ok with In-Person too. \r  \n\r\r  \n\r  \n**Stage of studying/study plan:**  content review\r  \n\r  \n**Goal of a Study Buddy**: keep each other accountable, share tips, share resources \r  \n\r  \n**Goal Score and Realistic Score:** 126-130 each topic \r  \n\r  \n**Other obligations:** full-time job and family :)\r  \n\r\r  \n**Age/Gender:** 28F\r  \n\r  \n**Other Information/Ice Breakers**: Clinical research coordinator, Neuroscientist (Master). studying and working I really don't have time for other stuff but if I do I watch the Outlander show.",
            "Location: Philadelphia, PA\r  \n\r  \nTest Date (or Anticipated): March 22, 2024\r  \n\r  \nMCAT Prep Material: Kaplan books, AAMC \r  \n\r  \nOnline/In-Person/Both/No-Preference: Both\r  \n\r\r  \nStage of studying/study plan:doing content review\r  \n\r  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes\r  \n\r  \nGoal Score and Realistic Score: e.g. 520 goal, 515 realistic\r  \n\r  \nOther obligations: fulltime job\r  \n\r  \n\r  \nAge/Gender:  23F\r  \n\r  \nOther Information/Ice Breakers: I like working out, trekking, travelling.",
            "**Location**: New Haven, CT / originally from Bay Area, CA\n\n**Test Date:** January 12, 2024\n\n**MCAT Prep Material:** UW, Anki, AAMC\n\n**Online/In-Person/Both/No-Preference:** Probably online for now, but flexible\n\n**Stage of studying/study plan:** Just started UW / content review\n\n**Goal of a Study Buddy:** Accountability, ask each other questions and commiserate over our suffering\n\n**Goal Score and Realistic Score:** 515+ dream, but just praying I don't need to take this more than once man\n\n**Other obligations:** Currently a full time college student, that's about it\n\n**Age/Gender:** 23M\n\n**Other Information/Ice Breakers:** love music, working out/running, cooking and reading.\n\nfeel free to PM me if you wanna chat / study together!",
            "Location: Los Angeles, CA\n\nTest Date: 3/22/24\n\nMCAT Prep Material: Princeton review books, AAMC, Khan Academy\n\nOnline/In-Person/Both/No-Preference: No preference\n\nStage of studying/Study plan: beginning content review but done with all the classes\n\nGoal of a Study Buddy: combine notes, quiz each other, share tips have someone to set goals with \n\nGoal Score: 511 goal\n\nOther obligations: full-time job (ophthalmology scribe/technician)\n\nAge/gender 23 F",
            "- Location (City, State, Country): Dallas, Texas. (North Dallas more precisely)\n\n- Test Date (or Anticipated): 4/12/2023, registered but want to take it earlier if any spots open. \n\n- MCAT Prep Material: e.g. Kaplan books, NS Exams,KA videos, Uworld, AAMC (all of it)\n\n- Online/In-Person/Both/No-Preference: Online/In-person. I’m fine with both.\n\n\n- Stage of studying/study plan: Currently on content review. Going through the Kaplan books, contemplating taking a prep course.\n\n- Goal of a Study Buddy: Keeping each other accountable and disciplined, sharing tips and methods of studying, having someone to share the stress with that understands. \n\n- Goal Score and Realistic Score: e.g. 518, 510 realistic\n\n- Other obligations: I have a full time job but work night shifts 9pm to 7:30am so got time to study during the day. It’s a 7 on 7 off schedule too so very flexible for my studying. \n\n\n- Age/Gender: 23F\n\n- Other Information/Ice Breakers: I work full-time in the lab as a lab technician. I love everything dermatology but might end up going into emergency medicine. During my free time, I sleep, go out to eat and try new restaurants, read romance novels and work out.",
            "Location: Zachary, LA, USA  \nTest Date (or Anticipated): 4/13/23  \nMCAT Prep Material: Kaplan Online Course  \nOnline/In-Person/Both/No-Preference: No preference  \nOptional:  \nStage of studying/study plan: Content Refreshers in Kaplan Online Course, I have no idea if im doing this course correctly or not honestly   \nGoal of a Study Buddy: community, accountability to keep myself from quitting, prevent isolation  \nGoal Score and Realistic Score: 510 goal, 507 realistic  \nOther obligations: full time job as a Pediatric Medical Assistant, food delivery driver, babysitter and praise team/choir member  \nOptional:  \nAge/Gender: 26F  \nOther Information/Ice Breakers: queer, black femme she/they pronouns, XULA Alumna, Sagittarius",
            "[deleted]",
            "**Location:** South Florida  \n**Test Date:** April 27th 2024  \n**MCAT Prep Material:** Kaplan prep books, Milesdown ANKI, starting Uworld soon  \n**Online/In-Person/Both/No-Preference**: Would prefer online but its not a deal breaker  \n**Stage of studying/study plan**: Will finish content review by the end of this month and will start with FL's and Uworld practice after that. \n\n  \n**Goal of a Study Buddy**: Looking for someone to keep me motivated, go over more difficult material, two minds are better than one lol.\n\n  \n**Goal Score and Realistic Score**: Goal 520, realistic 511\n\n  \n**Other obligations**: I work on the weekends in Feb and March :/  \n**Age/Gender**: 24f\n\n  \n**Other Information/Ice Breakers**:  My field of interest is Pathology, I have my own microscope I love looking at the tiny guys. My hobbies are yoga and crocheting. \n\nPlease feel free to send a PM!",
            "**Location**: Houston, TX\n\n**Test Date**: March 9th, 2024\n\n**MCAT Prep Material**: UW, AAMC, Kaplan books, KA, Anki, former undergrad notes.\n\n**Online/In-Person/Both/No-Preference**: Online/In-person, as long as quality studying is getting done!\n\n**Stage of studying/study plan**: I've been slowly transitioning from content (Kaplan/KA/notes) to practice (UW/AAMC) with Anki for retention.\n\n**Goal of a Study Buddy**: Bolster each other's consistency by keeping each other accountable and asking questions for the MCAT. As well as being able to suffer collectively lol.\n\n**Goal Score and Realistic Score**: 510+, 508-515. I took my first MCAT September 9th of last year and received a 501 with surface level review/minimal practice (was going through a rough patch in life). Now, things are much more ironed out and my expectancy-value of getting through this has risen!\n\nOther obligations: I work night shift as a forensic investigator, thus I study from afternoon to late evening prior to work.\n\nAge/Gender: 22M\n\nOther Information/Ice Breakers: I graduated from Texas A&M with B.S. in Forensics with a minor in Chemistry in 2023, love plants, reading, competed for Texas A&M judo, climb/boulder, workout, and adore films. I'm hoping to get into forensic pathology and/or pediatrics. I unironically listen to phonk in the gym and Tyler, the Creator is one of my favorite artists.\n\nfeel free to PM :)",
            "Located: Union City, New Jersey\n\nTest Date: September 2024 \n\nMCAT Prep:  Blueprint books & possibly FL, Anki, Khan academy, Uworld, AAMC (towards the end) \n\nStage of studying: beginning content review \n\nGoal of study buddy: keep each other accountable, share tips, would love a study buddy friend \n\nAge/Gender: 25/female🇵🇪 \n\nOther obligations: queer latina, full time job but with a lot of flexibility- typically studying early mornings (6-8am) and starting again at 4 pm every weekday.  Live with partner and dog :) love to do Pilates during the week as well. hoping to be an obgyn but also kinda like emergency med! Got my masters in public health in women’s sexual health and am very passionate about becoming a physician public health researcher. Have struggled with mental health previously and still getting to know myself 😌",
            "  \n**Location**: Billings, Montana  \n**Test Date:** e.g. 4/24  \n**MCAT Prep Materia**l: Blueprint  \nOnline/In-Person/Both/No-Preference: any\n\n  \n**Stage of studying/study plan:** content review, starting FLs\n\n  \n**Goal of a Study Buddy:** meet someone with a similar path, keep each other accountable  \n**Goal Score and Realistic Score**: 515 goal 508 realistic  \n**Other obligations**: 2 part time jobs, volunteer, nonprofit founder  \n**Age/Gender**: 29F  \n**Other Information/Ice Breakers**: I am an avid biker, runner, and climber. I love to get outside for my study breaks!  \n\nI am a nontraditional student battling some gnarly undergrad grades, so my MCAT score is super important.",
            "Hey! I hope this message finds you in great spirits. I’m reaching out to you today to share that I’m on the lookout for a Loyal, Dedicated and Honest accountability partner to join me on my MCAT preparation journey. I'm specifically seeking someone who is genuinely enthusiastic towards learning – and someone who's not just willing to study,  but is also a little excited about the chance to dive into this MCAT process and improve slowly but gradually, with me alongside them learning and encouraging them along the way - and vice versa. I envision a collaborative environment where we can motivate each other to Grow -  keeping each other accountable and celebrating our small successes together as we work towards achieving our 2024 MCAT study goals. If you're passionate about helping each other grow and succeed, I'd love to connect and explore how we can support each other on this challenging yet incredibly rewarding path to medical school. Let's make this journey memorable and impactful together! Below is all my info: \n* Location: Delaware, United States.  \n* Test Date (Anticipated): Initially 4/13/2024 but rescheduling to 9/14/2024. \n* MCAT Prep Material: e.g. all Kaplan books with all AAMC online material, I also do about 30 Q-Bank questions a day on Kaplan’s website, and try to follow their schedule. Currently saving up for U-World. Also currently enrolled in a MCAT class and recently just downloaded Anki. \n* Online/In-Person/Both/No-Preference: Online, preferably FaceTime or Zoom. \n* Stage of studying/study plan: Recently took a Practice FL, or a diagnostic rather, and did decently on it considering I haven’t finished taking Biochemistry at my university, nor have I finished the Physics 2 course. I am currently challenging myself to sit down and study for at least 6h daily on weekdays outside of class, and 2x that time on weekend days. I also have that MCAT prep class pretty much daily for 3h, but I have mandatory classes on Sundays for 4h. I have a google calendar that I follow rigidly and that is essentially my life. I can share that with you to create a feasible study plan for both of us. \n* Goal of a Study Buddy: My biggest goal is for us to keep each other accountable and ACTUALLY meet on a weekly basis based on our schedules in order to actively learn together via practice quizzes, test modes, debating content review ideas that we come across in order to learn via teaching, and share overall tips and mnemonics that we learned as we individually studied. If you are okay with it, I am cool with keeping an organized draft of google docs via email, this way, we we can use spreadsheets to keep track of hours studied and content reviewed daily — as a added accountability and extra resource guide where we combine notes, etc. These are all just ideas,  though. Tbh, I can help a lot with the organization part. The biggest thing for me is finding someone who is willing and ready to just SHOW UP CONSISTENTLY, and is diligent because they want to be, and not because I’m forcing them to be. Keeping each other accountable can only work if both parties are ready to put in the work. I’m ready to hold you accountable but you have to reciprocate. I’m also ready to get a great score. Are you serious about getting a great score too? \n* Goal Score and Realistic Score: 520+ dream score, 517 target score.\n* Other obligations: I’m currently a full time Neuroscience student, but like I said, I have a very strict schedule that I truly live by. Within this schedule, I have budgeted over 45 hours of study time outside of class time. This is for my core class that I’m taking in school right now. However, I have an additional 28-35 Targeted hours of MCAT practice and studies outside of class as well. Most of my classes are Biochem and Physics oriented, so I am flexible with which content to review and study on which days. I also have other obligations, but these can be worked around. I prefer if you have a google calendar that is already organized and set, or something of a list of sorts, so that we can compare schedules easily. Thanks! \n* Random Information: I’m a 26F, non-traditional senior with degrees in interpersonal communication and neuroscience. I am a ‘foreigner’ as I immigrated here from an african country about 10 years ago, but I consider myself very much american. i graduate in may. I do research at a bio-chem lab. I used to be a night owl until end of 2023 when I totally adjusted my goals and mindset, and now I wake up by 6am daily but I want to start waking up at 5am because that is when my cortisol levels are the highest and I can maybe get some studying In before the day starts ? But thats a work in progress. I’m super precise and well known for my daily fashion choices haha and this is a fun part of me that has become my \"niche\"! What about you ? When responding, please lmk something unique about yourself :) thanks in advance.",
            "**Location:** Atlanta, GA\r  \n\r  \n**Test Date:** June 15, 2024\r  \n\r  \n**MCAT Prep Material:** Kaplan books, Anki (AnKing & my own), all AAMC materials, Examkrackers books, JW daily CARS, Khan Academy, Youtube\r  \n\r  \n**Online vs in-person:** I'm okay with either or both \n\n\r  \n**Stage of studying/study plan:** middle of content review, doing practice questions and reviewing them, doing CARS daily\r  \n\r  \n**Goal of a Study Buddy:** Keep each other accountable, motivated each other, quiz each other, teach topics to each other for understanding, moral support \n\nI learn best by talking about the topic with other people and seeing the topic in many different ways. So, it would be most helpful to find someone to talk out concepts with. \r  \n\r  \n**Goal Score and Realistic Score:** 520+ goal, \\~515 realistic\r  \n\r  \n**Other obligations:** I'm completing my medical assistant certification, but focused on studying for MCAT full-time\r  \n\r  \n**Age/Gender:** 23F\r  \n\r  \n**Other Information/Ice Breakers:** I love to cook and bake, workout, and try out/visit new spots.",
            ".",
            "Location (City, State, Country): Ft Worth, TX\r  \n\r  \nTest Date (or Anticipated): 5/24/24\n\n\r  \nMCAT Prep Material: Kaplan Books, UWorld, Anki decks, Blueprint, Jack Westin\r  \n\r  \nOnline/In-Person/Both/No-Preference: Online (zoom, teams, google meet, etc.)\r  \n\r\r\r  \nStage of studying/study plan: content review\r  \n\r  \nGoal of a Study Buddy: keep each other accountable, share study tips and materials\r  \n\r  \nGoal Score and Realistic Score: e.g. 510+ goal, 508 realistic\r  \n\r  \nOther obligations: full time job as a scribe, taking 2 classes this spring\r  \n\r  \nOptional (100%):\r  \n\r  \nAge/Gender: 23M\r  \n\r  \nOther Information/Ice Breakers: I love music and sports, especially football. Go horned frogs!\n\nIf interested in studying together, PM me!!!",
            "[deleted]",
            "Location (City, State, Country): Los Angeles, CA USA\n\nTest Date (or Anticipated): August or September 2024\n\nMCAT Prep Material: e.g. Kaplan books, AAMC, Uworld, JW, not quite sure what else yet\n\nOnline/In-Person/Both/No-Preference: in person preferred but online is chill too :)\n\nStage of studying/study plan: just making my study schedule right now and i'll be starting content review in december or january!\n\nGoal of a Study Buddy: keep eachother on track and motivate each other!! just someone to talk to when studying gets rough bc not a lot of my friends are premed\n\nGoal Score and Realistic Score: Haven't taken a diagnostic but aiming for a 514+ lol\n\nOther obligations: full time student w 12 hours a week job during Jan-Mid may, then just 24-36 hours a week at work during the summer. also i have ADHD so my schedule for studying is going to be longer than most to accommodate for that.\n\nAge/Gender: 21M\n\nOther Information/Ice Breakers: I love baking and cooking, I do some cancer research on the side, I want to start going to the gym so if anyone can help w that LOL...",
            "Required:\r  \n\r  \nLocation (City, State, Country): e.g. Dallas, Texas, USA \r  \n\r  \nTest Date (or Anticipated): 4/26/24 not official might reschedule.\r  \n\r  \nMCAT Prep Material: Kaplan books, NS Exams, UEarth, AAMC, Anki\r  \n\r  \nOnline/In-Person/Both/No-Preference: Online preferably but we can do occasional in person meet ups. \r  \n\r  \nOptional (but recommended):\r  \n\r  \nStage of studying/study plan: I am still doing content review and will hopefully be done in the coming weeks. \n\nGoal of a Study Buddy:  Keep each other accountable, quiz each other, share tips, combine notes, Review and fill content gaps. \r  \n\r  \nGoal Score and Realistic Score: Goal: \\~510 Realistic Score: Unsure at the moment\r  \n\r  \nOther obligations: I work as a Part time scribe at an ED and volunteer at a Hospice and a local Food Bank. \n\nI am a 22M and graduated college this past May. I am hoping to study with someone who has a similar goal score as mine and tests around the same time (April or early May).  This will be my first attempt.",
            "**Location (City, State, Country)**: Portland, Oregon\r  \n\r**Test Date (or Anticipated):** October 2024\r  \n\r**MCAT Prep Material:** Kaplan books, Anki, I want to get uworld but later on\r  \n\r**Online/In-Person/Both/No-Preference:** Online/in person\r  \n\r\r**Stage of studying/study plan**: just getting started and need to create a study schedule\r  \n\r**Goal of a Study Buddy:** To be there for each other and quiz one another. While at the same time alleviating the stress the MCAT brings. For sure would be okay with sharing notes\r  \n\r**Goal Score and Realistic Score:** 515 Goal, 500 Realistic\r  \n\r**Other obligation:** work as Retina scribe/technician and work as a server\n\n**Age/Gender**: 24 M\n\n**Fun facts/icebreakers:** I play a lot of video games(PC mainly). Undergrad was hard for me but I did the best that I could do and am proud of what I completed. I majored in cognitive behavioral neuroscience in college; therefore I am a pro at psychoanalyzing haha. work as a Retina scribe/technician and work as a server",
            "**Location:** Illinois\n\n**Test Date:** March 22nd, 2024\n\n**MCAT Prep Material:** Everything\n\n**Stage of studying/study plan:** half way through content review \n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, and cheer each other on!\n\n**Goal Score and Realistic Score:** not sure\n\n**Other obligations:** nothing\n\n**Age/Gender:** 24M",
            "**Location (City, State, Country):** San Antonio, Texas\r  \n\r  \n**Test Date (or Anticipated):** Thinking late May\r  \n\r  \n**MCAT Prep Material:** e.g. Kaplan books, AAMC, some Altius\r  \n\r  \n**Online/In-Person/Both/No-Preference:** Okay with both\r  \n\r\r  \n\r**Stage of studying/study plan:** Content Review, free workshops, Taken 2 FL exams, youtube videos\r  \n\r  \n**Goal of a Study Buddy:** keep each other accountable, quiz each other, share tips, combine notes\r  \n\r  \n**Goal Score and Realistic Score:** I would really like a 520, I want to believe we can make it\r  \n\r  \n**Other obligations:** Full-time job, most likely study the most 6-7pm until 11pm, and possibly weekends but trying to find more volunteering opportunities in a clinical setting. \r  \n\r\r  \n\r**Age/Gender:** e.g. 25F\r  \n\r  \nOther Information/Ice Breakers: I go to the gym in the AM, I love my dogs, I enjoy anime, gaming and romance novels but just like you I have put them on the back burner as I'm trying to focus more on studying. **I lost my nerve when I tried to take the exam the first time so I didn't even attempt it. Now I am ready to kick this exam's ass with full force.**",
            "Location (City, State, Country): Ft. Lauderdale, FL\r  \n\r  \nTest Date (or Anticipated): April 24, 2023\r  \n\r  \nMCAT Prep Material: KA, Anki (Milesdown Coffin version), JW daily CARS, TPR, UWorld, AAMC\r  \n\r  \nOnline/In-Person/Both/No-Preference: mainly prefer online, usually available on Discord but I don't mind using other methods to communicate. in-person is a maybe\r  \n\r\r  \n\rStage of studying/study plan: I'm on the second week of content review. I do JW cars daily first thing, watch KA videos, and then study/practice the topics on Anki. Hoping to be done with content review in February so I can do UWorld and/or AAMC Section Bank, then do practice exams!\r  \n\r  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes, keep each other motivated and reduce stress\r  \n\r  \nGoal Score and Realistic Score: e.g. 520 goal, but my dad said having a range might feel better so I'm hoping for around a 510-520!!\r  \n\r  \nOther obligations: I recently graduated so I am trying to study full-time, family.\r  \n\r\r  \n\rAge/Gender: 20F\r  \n\r  \nOther Information/Ice Breakers: I've been working and volunteering with special needs kids and adults since my freshman year of high school and I plan on continuing that work in June! I love gaming (usually league of legends (((<3))), overwatch, or sims 4 if I can find time), but I also enjoy reading (recently found my love for autobiographies), writing short stories, crocheting, and indoor cycling.",
            "**Location:** Knoxville, TN, USA  \n**Test Date:** 4/26/24  \n**MCAT Prep Material**: Kaplan MCAT Complete 7-Book Subject Review, Sketchy MCAT Essentials (preferred)  \n**Online/In-Person/Both/No-Preference:** No-Preference  \n**Stage of studying/study plan:** Finishing up content review, doing practice questions by section. Already took the MCAT in Sep 2023 after studying for 2 weeks and got a 505  \n**Goal of a Study Buddy:** stay on schedule,   \n**Goal Score:** 512 -- I try to set realistic goals  \n**Other obligations:** part time school (4 credit hours), part time work (25 hrs/week), research (5 hr/wk)  \n**Age/Gender**: 22 F  \nOther Information/Ice Breakers: I like cats and dogs equally. I have over 50 house plants and a pet Axolotl who is almost 4 years old. I’m a little ADHD so I need someone to hold me down fr",
            "Location: Little Rock, Arkansas\r  \n\r  \nTest Date: September 14,, 2024\r  \n\r  \nMCAT Prep Material: ANKI (MilesDown), AAMC, maybe UWorld if I need it soon, Kaplan books and practice tests. \r  \n\r  \nI really need a compliance study buddy. We keep each other on track, since I am ADHD and tend to get lost in my head and other things going on around me.\r  \n\r  \nStage of studying/study plan: Starting content review, and refreshing on subjects since I'm 30 and been out of the game for a bit. I'm planning to take my first full length diagnostic this weekend..\r  \n\r  \nGoal of a Study Buddy: Keep each other accountable, share resources, ask questions, and cheer each other on!\r  \n\r  \nGoal Score and Realistic Score: 510+\r  \n\r  \nOther obligations: I work in a research lab during the week that's an hour away from my home.\r  \n\r  \nAge/Gender: 29F\r  \n\r  \nOther Information/Ice Breakers: I struggled during my undergrad with undiagnosed ADHD and OCD (fun, right!) Now, I'm medicated for both and have been in a masters degree trying to pay for classes as I go to show that I am not the person I was in undergrad. As for ice breakers, I recently moved from South Carolina and have a dog, a cat, and a turtle with an attitude!",
            "**Location**: Greater Vancouver, BC, Canada\n\n**Test Date**: Aug 24, 2024\n\n**MCAT Prep Material**: *Kaplan books, Anki, AAMC, maybe Uworld, KA*\n\n**Online/In-Person/Both/No-Preference**: both!\n\n**Stage of studying/study plan**: *content + a little practice till may, practice heavy in june, and full lengths late jun and all of august*\n\n**Goal of a Study Buddy**: *accountability and someone to study with when the semester finishes in april*\n\n**Goal Score and Realistic Score**: *515*\n\n**Other obligations**: i'm *going to be away 3.5 weeks in july, full time school till end of april*\n\n**Age/Gender**: *19F*\n\n**Other Information/Ice Breakers**: *I'm a psyc major with first year science background so I'm taking about 6 months to prep.*",
            "**Location:** Los Angeles, CA  \n**Test Date:** 6/14/24  \n**MCAT Prep Material:** Anking MCAT Deck, UWorld, Blueprint Books, Jack Westin soon..\n\n**Stage of studying/study plan:** Content Review (Almost done w/ UWorld, lots of Anki 0\\_0)\n\n**Goal of a Study Buddy:** Someone to keep myself accountable and to share study tips \n\n**Goal Score and Realistic Score:** Goal - 520+, Realistic - 520+ (go big or go home!)\n\n**Other obligations:** None, full time studying\n\n**Age/Gender:** 23M\n\n**Other Information/Ice Breakers:** I have a pet tortoise named Panzer",
            "Location: Dallas, Texas\n\nTest Date: 06/01 or 06/14\n\nMCAT Prep Material: UW, AAMC, Kaplan Books, Anki\n\nOnline/In-Person/Both/No-Preference: Either, do not care\n\nStage of studying/study plan: Content review, just starting up again\n\nGoal of a Study Buddy: Accountability (duh), questions, just a friend to chat to about all things MCAT\n\nGoal Score and Realistic Score: 515+ \n\nOther obligations: Looking for research opportunities, other than that full time studying. Might pick up scribing idk\n\nAge/Gender: 23M\n\nOther Information/Ice Breakers: Took MCAT junior year, did meh, never got the motivation to pick up studying again during college, so here we are! Fine if you're test date isn't on my exact date, but would prefer if it is in that vicinity.",
            "Location : Queens,NY, US-\n• Test Date (or Anticipated): registered 01/2025\n• MCAT Prep Material: e.g. Kaplan books, UEarth, AAMC (all of it)\n• Online: online or both\n• Stage of studying/study plan:just started with content \n• Goal of a Study Buddy: e.g. keep each other accountable, quiz each other, share tips, combine notes\n• Goal Score and Realistic Score: e.g. 525-526 goal\n• Other obligations: e.g full time job, but studying 4/5 hours weekday & 8+ hours on weekend \nOptional (100%):\n• Age/Gender: e.g. 25F\n• Other Information/Ice Breakers: e.g. I like serial killer biographies and horror stories😄",
            "| Location: Long Island, NY, USA\n| Date: 9/14/2024 registered\n| Materials: Kaplan books, UEarth, ANKI, and AAMC\n| Communication: No-preference (but leaning towards online)\n\n| Stage: I am at the very beginning of the journey (no content review yet, just the purchase of materials).\n| Goal: I need an accountability partner and I also learn best teaching/learning from others\n| Goal score: 520+ \n| Other Obligations: Part-time job, Part-time student, Family, gym\n| Age: 21F\n| Ice breaker: I like anime, reading, and am a mild introvert lol. I tend to give the initial impression of being scatterbrained but I learn incredibly quickly!",
            "Location: Toronto  \nTest Date: July 2024  \nPrep Material: Kaplan, UWorld, AAMC, Anki (Miledown)  \nOnline/In-Person/Both/No-Preference: Online\n\nStage of studying/study plan: Started content review\n\nGoal of a Study Buddy: Looking for an accountability partner and someone to go through questions together. Ideally meeting a few times every week. I took the MCAT last summer but I am hoping to rewrite and improve my score.   \nGoal Score and Realistic Score: 520+ (515+ realistic)  \nOther obligations: I work FT in research. I am typically free after 7 or 8 PM EST on weekdays, and flexible on weekends. Attempting to study 20 hours weekly (more hours closer to testing date).  \nAge/Gender: 24F",
            "Location / Method: Tampa, FL / Prefer zoom but open to in person\r  \n\r  \nPlanned Test Date: August 23, 2024\r  \n\r  \nMCAT Prep Material: Princeton books/resources, AAMC\r  \n\r  \nStage of studying/study plan and Goal: Doing content review and questions simultaneously. Need a buddy to team tag on dissecting MC questions quiz each other and to encourage each other!. My weak areas are CARS and physics.\r  \n\r  \n\r  \nGoal Score and Realistic Score: 520 / 507-510\r  \n\r  \nOther obligations: work in research, will soon cut back on hours\n\nGender: Female\n\nWilcards: 1)  I am a rookie to redditt! lol Looking forward to a private message. 2) I'm Caribbean and my happy place is the beach or outdoor walks :). Happy studying!!!",
            "Phoenix, AZ, USA\nRegistered for Sept 14th\nPrinceton Review books + access to site \nNo preference on whether we meet online or in person, rather someone who’s time zone is similar if online  \n\nI’m in the very beginning of the study process. Feeling overwhelmed and don’t know where to start so have someone to work with would be super helpful. We can teach the material to each other. I’m a visual learner \n\n26F",
            "* **Location**: Los Angeles, CA\n* **Test Date**: Sept 13\n* **MCAT Prep Material**: *Uwhirl books, Anki, Khan Academy, AAMC*\n* **Online/In-Person/Both/No-Preference**: no preference\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *just took my first diagnostic and currently working on study plan/content review*\n* **Goal of a Study Buddy**: *to keep me sane* 😀😀😀\n* **Goal Score and Realistic Score**: *goal: 520*\n* **Other obligations**: *part time research assistant*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *22F*\n* **Other Information/Ice Breakers**: *My backup plan for medicine is to become a celebrity*",
            "Location: Bay Area, CA  \nTest Date: Jan 12, 2023  \nMCAT Prep Material: Blueprint, Anki  \nOnline/In-Person/Both/No-Preference: Online for now, maybe in-person possible  \nStage of studying/study plan: Doing Anki/content review now with a sprinkle of practice  \nGoal of a Study Buddy: Keep ourselves accountable, ask each other questions, be cheering each other on  \nGoal Score and Realistic Score: Hoping for a 515+ for CA med schools   \nOther obligations: internship (10hr/week)  \nAge/Gender: 21F  \nOther Information/Ice Breakers: I love working out, trying new recipes and checking out cafes/sight seeing",
            "**Location:** Toronto, Ontario, Canada\n\n**Test Date:** 03/22/2024\n\n**MCAT Prep Material:** EC books, UEarth, AAMC\n\n**Online/In-Person/Both/No-Preference:** Online\n\n**Stage of studying/study plan:** Getting started with content and practice questions.\n\n**Goal of a Study Buddy:** Keep each other accountable, quiz each other, share tips, combine notes.\n\n**Goal Score and Realistic Score:** 514 goal, 510 realistic\n\n**Other obligations:** None; hoping to study full-time.\n\nPlease PM if you are interested in studying online.",
            "Location: hopping between Bay Area & Sacramento, California, USA\n\nTest Date: 1/26/2024\n\nMCAT Prep Material: Anki, TPR FLs, Kaplan FLs, uEarth, AAMC (all of it)\n\nOnline: discord or zoom\n\nStage of studying: done with content review for B/B, P/S, but really struggling with C/P. I’ve tried most methods to retain and learn the info but for some reason it doesn’t click. I have no problem with the math and memorizing the equations but i hardcore struggle to understand the concepts behind C/P and therefore I don’t do very well in applying the equations. \n\nGoal of a study buddy: accountability, sharing tips, moral support, make friends :)\n\nGoal score & realistic score: goal is definitely 510+, and realistic im hoping is the same. I’m a retaker and my last score was a 503. \n\nOther obligations: just finished my job so should be pretty full-time studying for the next few months! Family is going through some stuff but that info + impacts on schedule will be known in advance \n\nAge/gender: 21F\n\nOther info: I worked in an oncology clinic for a few months as an MA and loved it! I LOVE GOOD FOOD!!! I play Fortnite with friends since it’s cross platform and like to exercise in my free time. I REALLY struggle with C/P and would prefer someone who loves that section so we could work together on that. I would be happy to help review or fill in any gaps in the latter two sections. Please dm me and I’ll respond as soon as I can :)",
            "**Location:** Calgary, Alberta (Canada)  \n**Test Date:** August 22/23/24, 2024  \n**MCAT Prep Material:** Kaplan 2018, JW MCAT course, Anki, AAMC  \n**In-Person:** Ideal  \n**Stage of studying:** Just starting content review with JW - as a *non-traditional student*. This is my first approach at this material.  \n**Goal of a Study Buddy:** Let's explain concepts to each other - discussion is my favourite way of studying!  \n**Goal Score and Realistic Score:** 515 goal, 510 realistic. (129 CARS goal)\n\n   \n**Other obligations:** Working 16 hours/week, volunteer obligations \\~4 hours.  \n**Age/Gender**: 23F (would prefer F)  \n**Other Information/Ice Breakers:** I have a B.A. in International Studies, and I'm fully bilingual in French (I also speak some German and Japanese!). I'll be volunteering at the Alberta Children's Hospital!",
            "  \nLocation (City, State, Country): North Carolina \n\n  \nTest Date (or Anticipated): 01/26/2024, may reschedule based on where I am at after my first couple FLs in the next couple weeks  \nMCAT Prep Material: e.g. Kaplan books, UWorld, Anking Anki deck, AAMC materials  \nOnline/In-Person/Both/No-Preference: Online  \nOptional (but recommended):  \nStage of studying/study plan: working on finishing up content review by thanksgiving, self teaching bio chem, my worst section right now is physics and chem.   \nGoal of a Study Buddy: keep each other accountable, offer tips to each other on various sections and help each other out with topics we are struggling with  \nGoal Score and Realistic Score: 515+ goal, 508 realistic  \nOther obligations: e.g. 16 credit hours, volunteering, and college athlete  \nOptional (100%):  \nAge/Gender: e.g. 21M  \nOther Information/Ice Breakers: I love sports and am a pre-anesthesiologist / pre- ortho surgeon.",
            "Required\n\nLocation (City, State, Country): Houston, TX\n\nTest Date (or Anticipated): 03/22/2024\n\nMCAT Prep Material: AAMC, Kaplan books, UEarth, ANKI\n\nOnline/In-Person/Both/No-Preference: Mostly online (discord) but also down to meet up in-person if both our schedules align.\n\nOptional (but recommended):\n\nStage of studying/study plan: honestly still in planning stage but plan to mix content review and practice questions via UEarth and daily ANKI\n\nGoal of a Study Buddy: Mostly for accountability and discipline, quiz each other, ask questions to,  someone to vent to about the exam, the pre-med process and be friends. I really would like have a study buddy who I can text everyday about my daily goals, check if I was able to accomplish them, and I’ll gladly do the same for my study buddy. I might be a little intense and annoying but I will also push you to do your best. This will be my 3rd retake so I’m really hoping for a study buddy who can be as intense as I am.\n\nGoal Score and Realistic Score: 507 (realistic based on my previous score), 515 (goal), 520 (hopeful wish)\n\nOther obligations: I work full-time day shift 8 days straight and off for the next 6 days. I mostly plan to study at night. On the days that I’m off, I plan to study the whole day. Volunteer.\n\nOptional (100%):\n\nAge/Gender: 26 F\n\nOther Information/Ice Breakers: I work in the clinical lab and am interested in pathology and possibly, emergency medicine. I like boba, making coffee, traveling, and most importantly, sleeping.",
            "  \n**Location:** Austin, Texas, USA \n\n  \n**Test Date (or Anticipated):** 5/24/24  \n**MCAT Prep Material:** Kaplan Books, Anki Decks, AAMC Material, UWorld (will purchase in February)  \n**Online/In-Person/Both/No-Preference:** Both, in person preferably \n\n  \n**Stage of studying/study plan:** Beginning Content Review  \n**Goal of a Study Buddy:** discuss material since I'm an auditory learner  \n**Goal Score and Realistic Score:** 1st time taking it so 528 goal (shooting for the moon), 515 realistic (landing among the stars)\n\n  \n**Other obligations:** part-time job, 15 credit hours, Friday & Saturday personal commitments\n\n  \n**Age/Gender:** 21M  \n**Other Information/Ice Breakers:** I have ADHD, I'm a B.S. Psychology Major at UT Austin, and I've recently started going on runs regularly before I study in an effort to improve my Focus.",
            "Location: Lansing, IL Test Date: May 24, 2024MCAT Prep Material: UW, AAMC, Kaplan books (probably won't use much of these, though), AnkiOnline/In-Person/Both/No-Preference: Online for now, maybe in-person closer to the timeStage of studying/study plan: Doing Anki now, going to start UW in January and do that through AprilThe goal of a Study Buddy: Keep ourselves accountable, ask each other questions, and have someone to commiserate with about the exam, lolGoal Score and Realistic Score: 515. 510Other obligations: 15 credit hoursAge/Gender: 29 M (African)If you're interested in studying for the exam with me (and you have a similar test date), PM me!",
            "**Location (City, State, Country):** Chicago, IL, USA\n\n**Test Date:** 3/9/2024 registered\n\n**MCAT Prep Material:** UEarth, AAMC, Anki.\n\n**Online/In-Person/Both/No-Preference:** No-Preference\n\n**Stage of studying/study plan:** UW\n\n**Goal of a Study Buddy:** text and keep each other accountable, quiz each other, share tips\n\n**Goal Score and Realistic Score:** 515 goal, 510 realistic\n\n**Other obligations:** part-time job\n\n**Age/Gender:** 22F\n\n**Other Information/Ice Breakers:** I go to the gym every other day. I am a night owl no matter how hard I try to wake up early. I am a huge coffee fanatic and am in the process of purchasing a new espresso machine (need recs). Planning on applying to med school in the upcoming cycle. Feel free to PM!!",
            "**Age/Gender**: 23F\n\n**Location (City, State, Country)**: Dallas, TX\n\n**Test Date (or Anticipated)**: 4/7/24 registered but may reschedule\n\n**MCAT Prep Material**: Kaplan books, KA videos, Anki, Blueprint Self Paced Course, Jack Westin, UEarth, AAMC (all of it)\n\n**Online/In-Person/Both/No-Preference**: Online but willing to meet up\n\n**Stage of studying/study plan**: halfway with content review, plan to add in practice questions and start studying consistently starting 12/11\n\n**Goal of a Study Buddy**: keep each other accountable, share tips, motivate each other, honestly someone to talk/text about the whole premed process\n\n**Goal Score and Realistic Score**: 519 goal, 510 realistic\n\n**Other obligations**: full time job as clinical research assistant, DIY post bacc\n\n**Ice Breakers**: youth leader and Sunday school teacher on Sundays, completing a graduate certificate this month, love anime, dramas, and telenovelas",
            "\n\n* **Location**  Michigan USA\n* **Test Date** 6/1/2024\n* **MCAT Prep Material**: Anki, youtube, Princeton review. Pretty much everything\n* **Online/In-Person/Both/No-Preference**:\nOnline\n\n* **Stage of studying/study plan**: Just began studying, I study for 13 hours a day so I will always be available.\n* **Goal of a Study Buddy**: Share the struggle and help each other get the best scores possible. Motivate each other.\n* **Goal Score and Realistic Score**: 525 520\n* **Other obligations**: I'm taking some logic and prompt engineering courses to help.\n\nMale 24",
            "Location: Palo Alto, CA, USA  \nTest Date: 5/10/2023  \nMCAT Prep Material: The Princeton review content books, Kaplan 528 and KaplanOnline and willing to work or start with other material if shown to be more effective  \nOnline/In-Person/Both/No-Preference: In-person with occasional online would be my preference   \n\n\nStage of studying/study plan: Going through content at the moment  \nGoal of a Study Buddy: keep each other accountable, share tips, pace each other, etc.\n\n  \nGoal Score and Realistic Score: e.g. 520 goal, N/A realistic  \nOther obligations: Full time lab position  \nAge/Gender: 22F open/accepting to all gender identities   \nOther Information/Ice Breakers: I am a big neuro nerd. I love camping, hiking, bouldering, mountain biking, really anything outdoors. Pets are always a bonus to have around while studying!",
            "**Location:** Chicago IL\n\n**Test Date (or Anticipated):** registered 3/22/24\n\n**MCAT Prep Material:**  Kaplan books, anki, UEarth, AAMC\n\n**Online/In-Person/Both/No-Preference**: preferred in person over winter break (this month) also open to online, honestly just someone to check in with lmao\n\n**Stage of studying/study plan:** done with content review, started grinding UEarth and want to start FLs by mid to late Jan\n\n**Goal of a Study Buddy**: keep each other accountable and motivated! also mental health check-ins bc studying for the mcat sucks ha\n\n**Goal Score and Realistic Score:** idk yet, my half-length diagnostic w/o content review was 506\n\n**Other obligations**: winter break rn, but full credit hour schedule starting mid Jan\n\n**Age/Gender:** 20F\n\n**Other Information/Ice Breaker**s: current college junior, currently planning on not taking a gap year but we'll see how things pan out! big morning person, love Survivor and GBBO, enjoy running, and spent my past semester abroad so now its time to lock in lol",
            "**Location**: Gaithersburg, MD, USA\n\n**Age/Gender**: 20 F\n\n**\\[Anticipated\\] test date**: Aug 2024\n\n**MCAT prep material**: Kaplan books, U world, AAMC, Anki (creating my own), Khan, Jack Westin CARS practice\n\n**Online/In-Person/Both/No-Preference:** Open to either or, but I'd prefer if you're going to be taking the MCAT around the same time as me\n\n**Stage of studying/study plan:** Planning out my study schedule, starting content review Jan 1st\n\n**Goal of a Study Buddy:** keep accountable, motivate, quiz/help each other, meet someone who's in the same boat as me, chat during breaks!\n\n**Goal Score and Realistic Score:** 515 - 520\n\n**Other obligations:** I work part-time, go to school, and volunteer throughout the week, but I plan to always to be free after 5 pm.\n\n**IceBreaker:** I'm super interested in maternal and public health, so I'm working towards becoming an OBGYN in the future. I love gaming, reading books, and arts and crafts.",
            "**Location (City, State, Country):** Peru, IL when home on break or Green Bay, WI when back at school.\r  \n\r  \n**Test Date (or Anticipated):** I expect to take the MCAT June 15 or 22\r  \n\r  \n**MCAT Prep Material:** Kaplan books, Blueprint/Kaplan, UEarth, AAMC (all of it), and Anking Anki deck.\r  \n\r  \n**Online/In-Person/Both/No-Preference:** I can zoom/google meet or meet in person as well.\n\n**Stage of studying/study plan**: I'm just about to start content review and practice CARS daily.\n\n**Goal of Study Buddy:** Person to reach out to compare strategies, see how content coverage is coming, and generally keeping the other a person accountable and motivated to keep studying.\n\n**Goal Score**: 518+ but realistic 513+ \n\n**Obligations:** Full time student of 2 Psychology Courses and 2 Stem courses of Physics and Medical Microbiology. Occasionally, community service or research opportunities with professors.\n\n**Age**: 21M",
            "**Location:** Indiana\n\n**Test Date:** 5/24/24\n\n**MCAT Prep Material:** e.g. Kaplan books, UWorld question bank, AAMC exams and question banks\n\n**Stage of studying/study plan:** content review\n\n**Goal of a Study Buddy:** I am currently studying in a vacuum as none of my friends are preparing for MCAT or pursuing medicine at all. I want someone to talk with about MCAT concepts and med school in general.\n\n**Online/In-Person/Both/No-Preference:** Online\n\n**Goal Score and Realistic Score:** e.g. 510 goal, 505 realistic\n\n**Other obligations:** 17 credit hours, 3 on-campus jobs, research with biochemistry faculty\n\n**Age/Gender:** e.g. 25M\n\n**Other Information/Ice Breakers:** I like to listen to classical music and play the piano. Also, I like the NFL. : )",
            "Location: New Jersey\n\nTest Date: late march\n\nMCAT Prep Material: Kaplan books, UWorld question bank, AAMC exams and question banks\n\nStage of studying/study plan: content review\n\nGoal of a Study Buddy: I honestly don't know or have anyone around me studying for the MCAT and would love to have an accountability partner/ someone to talk with about MCAT concepts and/or even  med school in general.\n\nOnline/In-Person/Both/No-Preference: Both (I honestly don't mind)\n\nGoal Score and Realistic Score: 515\n\nOther obligations: 17 credit hours, 1 on-campus jobs, clinical research at a hospital\n\nAge/Gender: 22F\n\nOther Information/Ice Breakers: with the mcat a lot is at stake for me because its my redemption for my semi-low GPA. I love listening to the interstellar soundtrack while studying and I also like to workout/stay active!",
            "Location - Bronx, NY\n\nTest Date (or Anticipated): Scheduled for May 10th (if needed, will reschedule)\n\nMCAT Prep Material: Kaplan books, Khan Academy videos, AAMC (everything), blueprint, maybe sketchy\n\nOnline/In-Person/Both/No-Preference: No-preference \n\n\nStage of studying/study plan: planning on taking diagnostic 01/13/24 and begin content review\n\nGoal of a Study Buddy: Keep each other accountable, give each other tips, honestly have someone to talk to regarding this strenuous process.\n\nGoal Score and Realistic Score: 512 goal, 507 realistic\n\nOther obligations: Full-time job (40+ hours a week) that's pretty much it at the moment.\n\nAge/Gender: 25F\n\nOther Information/Ice Breakers: Hey guys :) in the middle of my gap year, currently working in a physical therapy clinic, looking for summer internships/programs to boost the app a little anddddd yeah. I'm a huge baseball fan (ride or die for the Rockies unfortunately😔✊️) and I'm always down to exchange food recipes. Happy studying everyone!",
            "Location: Columbus, GA \n\nTest Date: unknown (June 2024 or July 2024) \n\nPrep Material: TBR (The Berkeley Review) for C/P. TBR (idk) maybe Kaplan and YT videos for B/B. Miles Down Anki deck  (a deck for the 300 pg P/S) and CARS.\nUearth,Princeton Review AAMC Test , Jack West, Anki \n\nOnline/In-Person/Both/No-Preference: No preference. Both would be great. \n\nStage of studying/study plan: just starting content review. I want to actively start taking exams the first/second week of February \n\nGoal of a Study Buddy: I was looking for accountability partners and also someone to review thorough content. I haven’t started studying again but plan with content review starting next week.  My goal is hopefully find someone that help me be consistent as well as doing the same for the other person. Weakness: struggle with C/P.  \n\nGoal Score and Realistic Score: not sure (505-507) \n\nOther obligations: I work FT at a Biomedical company. FT job and typically free after 8pm EST MON-FRI free all weekend \nStudy hours: attempt 20-25 hours weekly. Weekdays maximum 2-3 hours and weekends 7-8 max hours.\n\nAge/Gender: 30F\n\nOther Information/Ice Breakers: I struggled with being consistent when studying. I like to travel, watch tv shows and spend time with family. Many times I have pushed my test date back and have low confidence after taking practice full lengths.",
            "**Location (City, State, Country):** College Park, Maryland\n\n**Test Date (or Anticipated):** August 23rd, 2024\n\n**MCAT Prep Material:** Kaplan books, Jack Westin, BP, AAMC, KA\n\n**Online/In-Person/Both/No-Preference:** Discord or In-Person\n\n**Stage of studying/study plan:** I took a BP practice exam 1-week ago and got 501. Now I am doing content review and working on practice Q's every day\n\n**Goal of a Study Buddy:** Commiserate about the MCAT and provide lots of motivation for myself and others. We will be doctors!!!\n\n**Goal Score and Realistic Score:** 515-520\n\n**Other obligations:** Full-time work 7-5, Volunteering on weekends 3-11 pm, Full time MPH\n\n**Age/Gender:** 23M\n\n**Other Information/Ice Breakers:** Interested in politics/ involvement in local politics. Lots of outdoor activities: Hiking, climbing, cycling. Gaming: CS2, Alan Wake 2",
            "Location: Columbus, OH, USA\n\nTest Date: not registered yet but end of hoping for sometime between end of Apr to Mid May \n\nMCAT Prep Material: Anki (milesdown), Kaplan Books, AAMC material, 3rd party sample tests, might invest in UWorld\n\nWilling to meet online, in-person, hybrid, no preference really \n\nStage: created a study plan twice and failed to adhere to it and got burnt out quickly, hoping to start anew with accountability\n\nGoal of a study buddy: tips, accountability, quiz each other, build off each others strengths/weaknesses\n\nGoal Score: pretty unsure but would be satisfied with 511+ \n\nI (24F) am working part time at a hospital as a patient support assistant on a cardiovascular floor. Graduated with a B.S. in Human Nutrition Dec ‘22. I enjoy powerlifting and skating and being active. I occasionally volunteer at a local homeless shelter and food pantry. Hoping to find a study buddy and friend to share the premed struggles with",
            "Location: Miami, Florida (FL)  \nTest Date (or Anticipated): August 2024  \nOnline/In-Person/Both/No-Preference: all are good with me!",
            "Location: Singapore\r  \n\r  \nTest Date: September 2024\r  \n\r  \nMCAT Prep Material: MCAT Flashcards, AAMC, Kaplan Books\r  \n\r  \nI would like to have an online study buddy for now, maybe in person closer to the time.\r  \n\r  \nStage of studying/study plan: Starting content review, about to take my first full length.\r  \n\r  \nGoal of a Study Buddy: Keep each other accountable, share resources, ask questions, combine notes, and cheer each other on!\r  \n\r  \nGoal Score and Realistic Score: Goal: 520, Realistic: 517\r  \n\r  \nOther obligations: No obligations \r  \n\r  \nAge/Gender: 26M",
            "Location: Sacramento, California \n\nTest date: September 24, 2024 \n\nMCAT: Khan academy, blueprint , maybe sketchy? \n \nIn person is better for me, limits distractions. \n\n22F",
            "**Location (City, State, Country):** San Juan, Puerto Rico, USA\n\n**Test Date (or Anticipated):** \\~ June/August\n\n**MCAT Prep Material:** Kaplan books, NS Exams, UWorld, Khan Academy, Anki\n\n**I prefer an online study buddy**\n\n**Stage of studying/study plan**: Starting content review\n\n**Goal of a Study Buddy:** keep each other accountable and motivated, support each other, quiz each other, share tips and resources, combine notes\n\n**Goal Score and Realistic Score:** 515 goal, 505 realistic\n\n**Other obligations:** Full time undergrad\n\n**Age/Gender:** 22F\n\n**Other Information/Ice Breakers:** I like reading, going to the beach and have started recently going to the gym.",
            "Location: Nashville, TN, USA  \nTest Date (or Anticipated): June 15  \nMCAT Prep Material: e.g. Kaplan books, UEarth, AAMC, Sketchy, private tutor, & Kaplan Course  \nOnline/In-Person/Both/No-Preference: No preference.   \n):  \nStage of studying/study plan: In the beginning stages of content review.. starting with bio/biochem  \nGoal of a Study Buddy: e.g. keep each other accountable, quiz each other, share tips, combine notes  \nGoal Score and Realistic Score: 510 goal, 500 realistic  \nOther obligations: e.g. fellowship (20 hrs/week), class on Monday (2-4 CST), and class on Wednesday (2-4; 5-8 CST)  \nOptional (100%):  \nAge/Gender: 23F  \nOther Information/Ice Breakers: I play the flute",
            "Location: Georgia\n\nTest date: 6/27/24\n\nMCAT prep material: Kaplan books + their online content, AnKing deck, Khan Academy, AAMC, UWorld, free JW CARS materials\n\nOnline only study buddy \n\nStage of studying: doing content review rn - 1-2 chapters of the Kaplan book a day along with all of the associated Anki cards. Also doing Jack Westin CARS passages (I try to do 1 daily but I'm bad at that). \n\nGoal Score: 520\n\nRealistic: not sure since I didn't do a diagnostic.\n\nObligations: 12 credits of classes, but it's an easier load. I will have all of May and June to prep with no obligations. \n\nAge/gender: 21F\n\nGoals: to share notes, tips, and tricks and keep each other on track",
            "Location: Raleigh, North Carolina \r  \n\r  \nTest Date: May 2024\r  \n\r  \nMCAT Prep Material: Kaplan, UWorld, probably Anki, AAMCAS Bundle\r  \n\r  \nOnline/In-Person/Both/No-Preference: No preference \r  \n\r\r  \n\r  \nStage of studying/study plan: Starting Fresh \r  \n\r  \nGoal of a Study Buddy: Accountability, constructive communication and support \r  \n\r  \nGoal Score and Realistic Score: 510+\r  \n\r  \nOther obligations: Work Full time in dermatology clinic (7-5:30 Tue-Fri), YMCA Big brother program on the weekends\r  \n\r  \n\r  \n\r  \nAge/Gender: 25M\r  \n\r  \nOther Information/Ice Breakers: My first two years of undergrad were horrible, reeled it in Jr and Sr year but had to get a Master's in Physiology to bolster my application for medical school. Starting to study now and I just feel so overwhelmed, looking to gain insight/encouragement from others who may be in similar situations.",
            "Location (City, State, Country): College Station, TX\n\nTest Date (or Anticipated): 4/12/24\n\nMCAT Prep Material:  Kaplan books, UWorld, AAMC\n\nIn-Person\n\nStage of studying/study plan: Done with reviewing Kaplan books, now working on UWorld and Anki decks\n\nGoal of a Study Buddy: Hold each other accountable, productively study, and take quality breaks to prevent burnout\n\nGoal Score and Realistic Score: 515 goal, 508 realistic\n\nOther obligations: Working part-time (2/4 days out of the month) and volunteer a little for an org but nothing major\n\nAge/Gender: 23M\n\nOther Information/Ice Breakers: Graduated from Texas A&M last May as a BIMS major, sticking around for work and to keep me from going home and napping with my cats all day. Like to workout and cook in my free time and trying to figure out more things to do with my free time. Seeking to go into military medicine!",
            "**Location (City, State, Country):** Hamilton, ON  \n**Test Date (or Anticipated):** August 18, 2024  \n**MCAT Prep Material:** Kaplan books, Jack Westin (CARS), AAMC (all of it)  \n**Online/In-Person/Both/No-Preference:** Online (could meet in person too)  \n**Stage of studying/study plan:** Creating study plan right now  \n**Goal of a Study Buddy:** Keeping each other accountable, having someone to study with  \n**Goal Score and Realistic Score:** 505  \n**Other obligations:** Studying full time right now, will be working full time in the summer  \n**Age/Gender:** 20F\n\nWould love to find someone/a group to go through this process with. Feel free to message!",
            "\n\n\nLocation: Portland,OR\n\nTest Date ( Anticipated):  5/11 or 5/16\n\nMCAT Prep Material: Kaplan books, nextgenu course, and uearth\n\nOnline/In-Person/Both/No-Preference: no preference\n\n\n\n\nStage of studying/study plan: taken it 3x before, I have poor content retention and test anxiety. I'm trying to start again at content review, trying a new learning approach since my ADHD diagnosis. \n\nGoal of a Study Buddy: keep each other accountable, share study tips/tricks\n\nGoal Score and Realistic Score: I'm shooting for a 500. \n\nOther obligations: full time job(it's shift work so my long stretch I essentially work 6 shifts in a row with a one gap day. But then I'm off for 6 days), family, trying to squeeze in shadowing. \n\nOptional (100%):\n\nAge/Gender: 34F\n\nOther Information/Ice Breakers: I like working in the ER, but I think I might really be interested in being a hospitalist/internist, I like watching shows (like Brooklyn 99, Witcher, Star Trek), I also am a foodie! I don't usually get out much so I'm trying to \"socialize\" and study, don't have much time for hobbies yet :(. Just moved to Portland!",
            "Location: Bronx, NY \n\nTest Date: May 2024 \n\nAge/Gender: 27/M \n\nMCAT Prep Material: Blueprint Books, Khan Academy, Youtube Videos, Third party Exams, UPlanet, AAMC materials, Jack Westing Questions and Some PDFs \n\nOnline/In-Person/Both/No-Preference: Preferably Online \n\nOptional (but Recommended): \n\nStage of Studying/Study plan: I am at the phase where my time is split into 50% content review and 50% practice questions. \n\nGoal Score and Realistic Score: \n\n- Goal score: 520+ \n- Realistic: Not sure yet \n\nOther Obligations: Research, non-clinical volunteering, Poster presentations, Working on a research paper for publication, etc.",
            "Location: Long Island NY\r  \n\r  \nTest Date: April 13, 2024\r  \n\r  \nMCAT Prep Material: Uworld, Kaplan materials, AAMC\r  \n\r  \nOnline would be more ideal, but am totally down for in person if convenient.\r  \n\r  \nStage of studying/study plan: finishing content review and starting practice. I am essentially cramming for a month. \r  \n\r  \nGoal of a Study Buddy: Encouragement (motivation is diminishing rapidly), share resources, ask questions\r  \n\r  \nGoal Score and Realistic Score: Goal 520+, realistic 515+\r  \n\r  \nOther obligations: I am # unemployed. lol. I graduated early in December and I'm applying for gap year jobs right now.\r  \n\r  \nAge/Gender: 21F\r  \n\r  \nOther Information/Ice Breakers: I love stardew valley and I'm so excited for the update (even though it will probably distract me from the MCAT). I struggled with depression in college; now, I'm really focusing on trying new things. I'd love to talk about navigating premed and mental health and hear about any tips!",
            "  \n**Location**: Tampa, FL, USA\n\n  \n**Test Date** : Planning for 6/1/2024 (June)   \n**MCAT Prep Material**: Princeton books, Altius, Uworld, AAMC FL and Section Bank  \n**Online/In-Person/Both/No-Preference:** \n\nPrefer Online, but if very close by, open to in-person too. :)   \n**Stage of studying/study plan:** \n\nDoing content review and u world right now, planning on finishing content review by end of March-or mid April latest  (3 month plan)  \n**Goal of a Study Buddy:** \n\n\\#1 keep each other accountable, motivate / cheer each other on! If need be, we can quiz each other, share tips, etc.   \n**Goal Score and Realistic Score:** \n\n520, aim for the stars. realistic, 515   \n**Age/Gender**: 23F  \nOther Information/Ice Breakers: \n\nGraduated, taking time off and planning on applying next cycle. Seriously struggled in undergrad with studying but we made it out! Working on building a sustainable routine to keep myself balanced. I love reading webtoons/ manhwa, being in nature, and trying out new recipes",
            "Hello! I am 27(F) and looking for a study buddy!\n\nLocation: Richmond, VA\n\nTest Date (or Anticipated): 6/22/24. Have not registered yet, but that is the most likely date.\n\nMCAT Prep Material: This is a retake for me. I got a 499 the first time. I have Kaplan books from the first time I took the test. I will likely use uworld, Anki, AAMC SB, and FL tests.\n\nI am looking to study in person if possible! The only thing is that I work nights as a paramedic, so it would have to be later in the afternoon or evening to keep up with my sleep schedule.\n\nMy goal is to have someone to rely on and bounce questions and answers on. I need someone who can text me and say, \"Did you do your anki today?\". I am also looking for someone who can relate to this and have an idea of what it is like to go through the studying! I had no one to really empathize with the first time, and I think that did not help my well-being. Also, because this is a retake for me, I might be able to share some insight into what it is like.\n\nOther stuff: Because of my profession, I am very interested in emergency medicine. I work with doctors, residents, and medical students every day, and they are such an inspiration to me! It also rubs off a bit to be in the ED. It is so insightful to talk to them and get advice as I go through this process. My other interests include cardiology, anesthesiology, and ortho! I can totally see myself doing those too.\n\nThanks!!",
            "  \n**Location (City, State, Country)**: San Francisco, CA  \n**Test Date (or Anticipated):** July 16 registered but may reschedule  \n**MCAT Prep Material:** Princeton books, Miles Down Anki  \nOnline/In-Person/Both/No-Preference: Mostly online  \n**Stage of studying/study plan:** Doing a course (Could've been a bad choice tbd), but have done a few practice tests and just trudging through MilesDown deck.\n\nG**oal of a Study Buddy:**   keep each other accountable, share tips \n\n**Goal Score and Realistic Score:** 510 Goal  \n**Other obligations:** I work at a Biotech company full time, and will start to work in a hospital soon  \n**Age/Gender:** 27F  \nOther Information/Ice Breakers: I love human biology, as well as marine biology",
            "**Location**: Buffalo, NY  \n**Test Date**: Sometime in August/September 2024  \n**MCAT Prep Material:** Kaplan books  \n**Online/In-Person/Both/No Preference:** Preferably in-person but online is fine as well. \n\n  \n**Stage of Studying/study Plan:** Done with some content, have not taken a full length test yet.   \n**Goal of a Study Buddy:** Keep each other accountable, quiz each other, study together(content).   \n**Goal Score and Realistic Score:** Goal 515, Realistic 510  \n**Other Obligations:** Working a full time job, family responsibilities. \n\n**Age/Gender:** 23F  \n**Other Information/Ice Breaker:** Currently working as a Public Health Fellow where I have shadowed a Trauma and Burn surgeon and have seen them perform procedures/surgeries in the OR. I have undiagnosed ADHD. I had tried to study for the MCAT by myself and I was very overwhelmed. Lost confidence in myself and my ability to study. Have been struggling with this a lot and studying alone with no study buddy has been very stressful for me because I am someone who struggles with accountability. So studying alone did not help with that which led to loss of confidence in myself. I even started to question myself that am I really cut out for this, can I really do this.",
            "  \nRequired:  \nLocation (City, State, Country):Chicago, Illinois, USA  \nTest Date (or Anticipated): September  \nMCAT Prep Material: e.g. Kaplan books, Uworld, AAMC   \nOnline/In-Person/Both/No-Preference: Online and In-Person, both work for me  \nOptional (but recommended):  \nStage of studying/study plan: e.g. done with content review, taking 3rd party practice exams right now. I started doing content review but it is not going well. I wanted to take it in june but I pushed it to september.  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes  \nGoal Score and Realistic Score: 514 goal, 507  \nOther obligations: Part-time job  \nOptional (100%):  \nAge/Gender: 22F  \nOther Information/Ice Breakers: French is my first language :)! I am currently rewatching the first seasons of Grey's Anatomy. I am also graduating from the University of Illinois at chicago with a bachlor in Biology in May 2024",
            "* Location (City, State, Country): Durham, North Carolina\n* Test Date (or Anticipated): 05/11/24 registered but willing to reschedule\n* MCAT Prep Material: Kaplan books, AAMC Material, Miles Down, 300 Page P/S, My own Flashcards\n* Online/In-Person/Both/No-Preference: No Preference\n* Stage of studying/study plan: Practice questions; Some content review, Practice Exams\n* Goal of a Study Buddy: Keep each other accountable, quiz each other, share tips, combine notes\n* Goal Score and Realistic Score: My goal is a 510; 500 realistic\n* Other obligations: Full time job at a clinic\n* Age/Gender: 25 M\n* Other Information/Ice Breakers: I took the exam last year and did very poorly. I am really stressed to do well on this exam because it’s holding me back from medical school. The rest of my medical school application is golden. In terms of my hobbies I'm into gaming and anime. I am interested in orthopedics since I was an athlete in college.",
            "**Location**: Vancouver, British Columbia, Canada \n\n**Test Date:** August 9th, 2024 \n\n**MCAT Prep Material**: e.g. TPR Course, Anki, Uworld JW and AAMC (Later)\n\n**Online/In-Person/Both/No-Preference**: No-Preference\n\n**Stage of studying/study plan**: Content Review \n\n**Goal of a Study Buddy**: Accountability, developing strategies for efficiency and improvement, share tips & resources, support :) \n\n**Goal Score and Realistic Score**: Goal is 515+\n\n**Other obligations**: Volunteering and side business \n\n**Age/Gender**: 24M \n\n**Other Information/Ice Breakers**: Kinesiology student and personal trainer at UBC, big fan of music, staying active and can binge watch anything. This will be my first time taking the test so nerves are high, and would love some people to weather the storm with",
            "**Location**: Ontario, Canada\n\n**Test Date**: 08/24 (writing in detroit since no spots in canada TT)\n\n**MCAT Prep Material**: Kaplan, Anki, UWorld, AAMC\n\n**Online/In-Person/Both/No-Preference**: no preference\n\n**Stage of studying/study plan**: may-june: content review, july-august: grind uworld, do mock exams\n\n**Goal of a Study Buddy**: keep accountable, do periodic check ins, share resources  (for mcat & med school, anything pre-med, etc.), be supportive/keep motivated \n\n**Goal Score and Realistic Score**: first time writer so.....515 goal, but anything above 505-510 is a W\n\n**Other obligations**: volunteering two places (around 3-4 hours/week) \n\n**Age/Gender**: 21F",
            "* **Location:** Singapore\n* **Test Date** 27 July 2024\n* **MCAT Prep Material**: Kaplan books, Anki (MilesDown & Own), AAMC, World, \n* **Online/In-Person/Both/No-Preference**: Online\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: Started content review\n* **Goal of a Study Buddy**: Keep me accountable for things to complete daily\n* **Goal Score and Realistic Score**: 517\n* **Other obligations**: 2 research paper - (1) under data collection, (2) editing manuscript\n\n**Optional (100%)**:\n\n* **Age/Gender**: 25 M\n* **Other Information/Ice Breakers**: Im a psychology major",
            "**Required**:\n\n* Queens, NY\n* 8/24/2024\n* Kaplan, UWorld, and Sketchy\n* Prefer Online but flexible in person\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *Just finished classes starting content review*\n* **Goal of a Study Buddy**: *keep each other accountable and maybe do a similar plan and work through some of the more high yield things together?*\n* **Goal Score and Realistic Score**: *As high as possible*\n* **Other obligations**: *Caretaker for elder, work*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *32M*\n* **Other Information/Ice Breakers**: *I love knicks basketball and playing music with my friends.*",
            "Location (Chicago, IL, US)\n\nTest date (August 2024, anticipated)\n\nMCAT prep material: Kaplan, KA, Anki, AAMC\n\nOnline/in-person/both/no-preference: no preference",
            "* **Location** (City, State, Country): *Mississauga, Ontario, Canada*\n* **Test Date** (or Anticipated): *End of August*\n* **MCAT Prep Material**:  *Kaplan books, AAMC (all of it), Jack Western, Uworld, milesdownanki*\n* **Online/In-Person/Both/No-Preference**: Anything is fine but would prefer online if far away \n\n* **Stage of studying/study plan**: *just starting the content review* \n* **Goal of a Study Buddy**: *keep each other accountable, quiz each other, share tips, just be a friend !*\n* **Goal Score and Realistic Score**: *510 realistic*\n* **Other obligations**: none\n\n* **Age/Gender**: *20F*",
            "**Age/Gender**: 19F\n\n**Location (City, State, Country)**: Austin, TX\n\n**Test Date (or Anticipated)**: 8/23/24  \n\n**MCAT Prep Material**: Kaplan books, KA videos, Anki, UWorld Qbank, Blueprint Exams (maybe), Jack Westin, AAMC \n\n**Online/In-Person/Both/No-Preference**: Online or in person\n\n**Stage of studying/study plan**: I just took a diagnostic test and I'm working on making a study plan and doing content review. I just finished up my ochem and biochem courses, so those are still fresh on my mind. I'm also taking a physics course while studying at UT Austin. \n\n**Goal of a Study Buddy**: If available to meet up, I'd love to have an in-person study buddy! Otherwise, just keeping each other accountable, sharing tips, motivating each other, and honestly having someone to talk to/text about the whole premed process would be nice. \n\n**Goal Score and Realistic Score**: 520 goals (I would be pleased with that score) I haven't taken a FL yet so I don't know what my realistic score would be \n\n**Other obligations**: Taking a physics course and lab for 5 weeks \n\n**Ice Breakers**: Aside from academics I love playing tennis and am very involved in the tennis community in general. I'm trying to get back into working out and running. I enjoy concerts, traveling, and trying new foods. To relax I love just watching a movie or TV show (especially K-dramas lol)",
            "\rLocation: Florida\r  \n\r  \nTest Date: 01/26/2024\r  \n\r  \nMCAT Prep Material: Kaplan, Looking for UWorld but cannot afford\r  \n\r  \nOnline preference\r  \n\r\r  \n\r  \nStage of studying/study plan: almost done with content review\r  \n\r  \nGoal of a Study Buddy: accountability, share tips/resources, review passages, questions, and solutions together especially for B/B and C/P\r  \n\r  \nGoal Score and Realistic Score: 520 goal, 517 realistic\r  \n\r  \nOther obligations: job, family issues, volunteer (\\~50hrs/week)\r  \n\r\r  \n\r  \nAge/Gender: 27M\r  \n\r  \nOther Information/Ice Breakers: I'm passionate about all things medicine, mental health, social and global advocacy for underserved communities, and want to go into a specialty where I can both have relationships and \"fix\" people's problems with procedures or surgeries",
            "Location: Bronx NYC\n\nTest Date: maybe fall 2024\n\nOnline/In-Person/Both/No-Preference: only or in person \n\nGoal of a Study Buddy: 2 brains is better that 1, I need someone who is motivated and able to stick stick to this like bubble gum\n\nGoal Score and Realistic Score 500\n\nOther obligations: work 36h a week, im doing my bachelor degree in biomedical science pre-med \n\nAge/Gender: 24 F\n\nOther Information/Ice Breakers: i love sports (volleyball) i love to learn new things",
            "Location: San Juan, TX\r  \n\r  \nTest Date: 04/27/2024\r  \n\r  \nMCAT Prep Material: Kaplan, UEarth, Sketchy, AAMC material, Blueprint practice tests\r  \n\r  \nOnline/In-Person: Both\r\r  \n\r  \nStage of studying/study plan: Just starting with content review again. Starting from scratch bc I scored horribly in June\r  \n\r  \nGoal of a Study Buddy: accountability and to help other with questions\r  \n\r  \nGoal Score and Realistic Score: Goal score: 515 Realistic Score: 505\r  \n\r  \nOther obligations: wfh job Monday-Friday 9-5; also teach dance classes Monday nights and family obligations",
            "**Location:** Palo Alto, CA\n\n**Test Date:** 1/26/24\n\n**MCAT Prep Material:** Kaplan, NS Exams, UWorld, AAMC, and Jack Westin\n\n**Online/In-Person/Both/No-Preference:** Would prefer in-person study buddy but online also works!\n\n**Stage of studying/study plan:** In content review, with plan to finish by beginning of December. Will begin hard prep phase (FLs + FL review + question banks) until exam date (with break from 12/9-12/23).\n\n**Goal of a Study Buddy:** Looking to study with someone (albeit \\~quietly\\~ because I have a hard time focusing otherwise) — especially in the mornings, Mon-Fri and Sun, starting at 9am PST.\n\n**Goal Score and Realistic Score:** 525 goal, 520 realistic\n\n**Other obligations:** EC on Wed afternoons. Otherwise, would like to dedicate rest of time to preparing for exam!\n\n**Age/Gender:** 23NB",
            "Location: Manchester, NH\n\nTest Date: don't have one yet\n\nMCAT Prep Material: the Princetown review, MCAT flashcard(Kaplan), Anki\n\nOnline/In-Person/Both/No-Preference: mainly online, flexible\n\nStage of studying/study plan: starting content review, and flashcards.\n\nGoal of a Study Buddy: Keep ourselves accountable, study together, share notes, and help each other where we are lacking.\n\nwhether you are in NH, CT, MA, NY, ME, or VT, I don't mind\n\nGoal Score and Realistic Score: 520+\n\nOther obligations: Nothing right now, but I'm starting my full-time job soon\n\nAge/Gender: 23F\n\nOther Information/Ice Breakers:  I just graduated as an engineer, self-learning orgo 2, and planning on taking biochem in 20204. I'm into anime, reading, and working out, I'm going back to boxing two weeks after starting my job.\n\nIf you're interested feel free to message me.",
            "Location (City, State, Country): Traveling   \nTest Date (or Anticipated): January or March but I am trying to apply this cycle  \nMCAT Prep Material: UWorld, AAMC, and the milesdown study guide  \nOnline/In-Person/Both/No-Preference: Online\n\nI am 22 y/o female who is traveling and also trying to study for the mcat. Seriously gotta start holding myself accountable cause I keep postponing.",
            "\n* Age/Gender: 23F \n\n* Location: North Carolina \n\n* ﻿﻿Anticipated Test Date: 04/13\n\n* ﻿﻿MCAT Prep Material: UW, Blueprint FLs, AAMC FLs\n\n* ﻿﻿Online/In-Person/Both/No-Preference: no preference \n\n* ﻿﻿Stage of studying/study plan: focusing on completing the UW Q-bank and reviewing each set of practice questions \n\n* ﻿﻿Goal of a Study Buddy: it would be awesome to have someone to do UW or review questions with, via Zoom. I am honestly looking for a boost in motivation and studying with another person seems to help me a lot. \n\n* ﻿﻿Goal Score and Realistic Score: I’m just going to try my best; focusing on the number does not help my mental health. \n\n* ﻿﻿Other obligations: part time work as a tutor and nanny, interviewing for full time roles as clinical research coordinator. \n\n* I have quite intense anxiety about this exam to the point of feeling paralyzed sometimes when I’m studying. If anyone knows the key to getting rid of this, please share!",
            "**Location:** PG County, Maryland\n\n**Test Date:** April 28 or last week of April\n\n**MCAT Prep Material:** e.g. Kaplan books, Blueprint, AAMC (all of it), Jack West, Anki Miles Down, ,86 Page P/S\n\n**Online/In-Person/Both/No-Preference:** No preference\n\n**Stage of studying/study plan:** I started studying back in May this year but I canceled my exam in September because I wasn't 100% ready :( Starting up all over again first week of December\n\n**Goal of a Study Buddy:** keep each other accountable, quiz each other, share tips, combine notes\n\n**Goal Score and Realistic Score**: 515 Goal.. realistically 510\n\n**Other obligations:** Part time Army National Guard Medical Officer , applying for research and/or clinicals for full time.\n\n**Age/Gender:** 23F\n\n**Other Information/Ice Breakers:** I've been playing classical piano since I was 5 & I also know how to play the harp. Other than my hatred for physics, i love to cook and bake. I also like to go to the gym in the afternoons when no one is there :). I have a passion for dermatology but I'm opened to learning about more fields.  Ive never had a study buddy for MCAT stuff, so feel free to hit me up!",
            "Location: Los Angeles, CA\n\nTest Date: Waitlisted for January spots ( hoping spots open last minute)MCAT\n\nPrep Material:  Kaplan books, Blueprint, AAMC Test , Jack West, Anki Miles Down, ,86 Page P/S\n\nOnline/In-Person/Both/No-Preference: No preference\n\nStage of studying/study plan: Finished content review. Doing tons of practice questions and exams.\n\nGoal of a Study Buddy: Keep each other accountable, Quiz each other, and share tips.\n\nGoal Score and Realistic Score: 515 Goal\n\nOther obligations: Ed scribeAge/Gender: 23M\n\nOther Information/Ice Breakers: I love to plat guitar when times get stressful, and they will if you study for the MCAT. I am also interested in becoming a pediatric physician. This is my first time trying this out and actually posting on this thread. If yall are interested let me know!",
            "**Location:** San Antonio, TX  \n**Test Date:** 4/26/24  \n**MCAT Prep Material:** UW, Anki, Kaplan books  \n**Online/In-Person/Both/No-Preference:** w/e  \n**Stage of studying/study plan:** done with content review, doing anki and taking diagnostics   \n**Goal of a Study Buddy:** accountability and ask each other questions!  \n**Goal Score and Realistic Score:** realistic 515 goal 520\n**Other obligations:** full time job and full time school  \n**Age/Gender:** 23F  \n**Other Information/Ice Breakers:** all I do is study I have literally no personal life lol. very passionate about medicine and have about 3000+ clinical hours under my belt due to working full time in health care for a while.",
            "Location: Atlanta, GA/Marietta, GA\n\nTest Date: June 1, 2024\n\nPrep: TPR, MilesDown, Mr Pankow, 300 Page P/S\n\nOnline/In-Person/Both/No Pref: Both\n\nStage: Content Review rn, taken almost all pre-reqs\n\nGoal of Study Buddy: Body doubling, accountability, share material/advice\n\nScore Goal: Realistic: 500+, Goal: 515+\n\nOther: Current semester is 14 Cred/3 Labs, next semester is 16-20 cred/2 Lab, looking to volunteer, possibly research in spring. I’m also a commuter and living with partner in Marietta with two dogs both of which take a ton of time out of my day.\n\nAge/Gender: 21NB\n\nOther Info: I spend way too much time in the day playing video games but I somehow make everything work. I love cooking (I’m viet, it’s built into my culture), watching Chinese dramas, crocheting, and indie horror anything. Honestly it all amounts to anything that can keep my attention for more than two seconds.",
            "Location: Massachusetts (MA)\n\nTest Date (or Anticipated): May 4th, 2024\n\nMCAT Prep Material: UEarth, AAMC (all), Kaplan books, BP FLs and ANKI\n\nOnline/In-Person/Both/No-Preference: I prefer online.\n\nStage of studying/study plan: I have been studying inconsistently since June, but now I am done with content review. However, I plan on incorporating both content review and practice into my study routine. \n\nGoal of a Study Buddy: Mainly for accountability but also to review concepts or specific problems.\n\nOther obligations: Job (M-W 7am-5pm).\n\nAge/Gender: 24M\n\nOther Information: Never took the exam before, graduated from undergrad last year, and an ESL student. Goal score 512+\n\nIf you are in the same time zone as me, I would be happy to join your study group as well.",
            "**Location:** Boston, MA\n\n**Test Date:** 5/11/2024\n\n**MCAT Prep Material:** Kaplan books, AAMC (all of it), Anki\n\n**Online/In-Person/Both/No-Preference:** Both/No preference\n\n**Stage of studying/study plan:** middle of content review, using Anki flashcards\n\n**Goal of a Study Buddy:** I'm a novice and I'm not sure where to start or how to study. Looking for advice, accountability, etc.\n\n**Goal Score and Realistic Score:** 514 goal, 510 realistic\n\n**Other obligations:** full-time Masters student, 32 work week M-T 8:30-4:00\n\n**Age/Gender:** 22F",
            "[deleted]",
            "Location: Manhattan, Ks\n\nTest day: May 4th, 2024\n\nMCAT Prep material: Kaplan books, MCAT ladder\n\nOnline/in-person: pref online\n\nStage of studying: specific topics\n\nGoal of study buddy: be able to quiz each other, ask each other questions, and study together \n\nGoal score: 510ish \n\nObligations: school stuff and working out \n\nAge/gender: 20M\n\nOther info/ice breakers: always down to study but I don’t lift competitively so I can’t skip out on training.",
            "**Location:** Long Beach, CA, USA (Los Angeles, CA)\n\n**Test Date:**  May 4, 2024\n\n**MCAT Prep Material:** Kaplan books, ANKI Miles Down, Khan Academy\n\nOnline/In-Person/Both/No-Preference: No-Preference\n\n**Stage of studying/study plan:** I just did a diagnostic MCAT test to see where I'm at and what I need to study! I'm at a 491 right now.\n\n**Goal of a Study Buddy:** keep each other accountable, quiz each other, share tips, combine notes, anything really!\n\n**Goal Score and Realistic Score:** 514 goal, 510 realistic\n\n**Other obligations:** I have a trip to the UK/EU planned for the entire month of January! After that, I plan on studying for the MCAT full-time.\n\n**Age/Gender:** 22M\n\n**Other Information/Ice Breakers:** I recently moved back to Long Beach, CA (my hometown) from working in San Francisco, CA for a bit after graduating this past May from UC Berkeley. I'm also a big foodie! I'm pretty open and flexible so feel free to hit me up if you're interested in tackling the MCAT together!",
            "**Location:** White Plains, NY \n\n**Test Date:** 05/24/2023\n\n**MCAT Prep Material:** Blueprint (registered) and considering of registering for Kaplan Review (decision by first week of January)\n\n**Stage of Studying:** creating my study schedule. Taking my first practice exam. \n\n**Online to start and then before the exam in person pleaseeee :)** \n\n**Goal of a study buddy:** to help and be helped with staying on track; quiz each other; and to get through this exam together!! WE GOT THIS \n\n**Other obligations:** full time job (10-6:30pm) in a lab doing thoracic cancer research- I plan to do a study sesh in the morning (7:30-9am) and in the evening (7:30/8-10pm) \n\n**Age:** 23F",
            "• Location (City, State, Country): Washington, DC \n\n• Test Date (or Anticipated): Jan. 26th, 2024 \n\n• MCAT Prep Material: e.g. Kaplan books, UEarth\n\n• Online/In-Person/Both/No-Preference: both \n\n• Stage of studying/study plan: finishing content books, starting uworld. This is my fourth time studying for this exam. 3rd time in the last year. \n\n• Goal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes\n\n• Goal Score and Realistic Score: 510 goal, 500 realistic\n\n• Other obligations: full time job as a clin tech. I work three 12 hour shifts weekly & im off for 4 days \n\n• Age/Gender: 24F\n\n• Other Information/Ice Breakers: I’m a first gen student",
            "**Location:** San Antonio, TX  \n\n\n**Test Date:** April 13, 2024  \n\n\n**MCAT Prep Material:** URanus, AAMC, Anki (Milesdown), Kaplan, Jack Westin  \n\n\n**Online/In-Person/Both/No-Preference:** No pref  \n\n\n**Stage of studying/study plan:** Starting content review, going through AAMC outline to guide studying, AAMC full lengths and maybe BP full lengths  \n\n\n**Goal of a Study Buddy:** Would like to to have question collab sessions and didactic lessons in group study, complimenting our strengths and weaknesses  \n\n\n**Goal Score and Realistic Score:** Goal 118, Realistic 112  \n\n\n**Other obligations:** Some traveling in February, but studying full time- freelance grad photos on the side  \n\n\n**Age/Gender:** 23F  \n\n\n**Other Information/Ice Breakers:** Cycling, climbing, coffee shops, also love music - especially playing music or dancing to music, open to really anywhere in the San Antonio/Austin Area, also volunteering at Corazon Clinic in SA if anyone wants to accompany me, big interest in health policy",
            "**Required**:\n\n* **Location: Northern VA**\n* **Test Date**: 03/24\n* **MCAT Prep Material**: Examkrackers, BP, and Uearth\n* **Online/In-Person/Both/No-Preference**: No-preference\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *Taking practice exams and reviewing content*\n* **Goal of a Study Buddy**: *Accountability*\n* **Goal Score and Realistic Score**: 510 Realistic: 510\n* **Other obligations**: *Part time night job*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *22M*\n* **Other Information/Ice Breakers**: I am retaking.",
            "Location:  (City, State, Country): Belmont or San Francisco, CA\n\nTest Date: 3/22/24 MCAT\n\nPrep Material: Blueprint, UWorld Anki Deck\n\nOnline/In Person: No preference\n\nStage of studying/study plan: content study and just took first practice test\n\nGoal of a Study Buddy: keep each other accountable, learn together, or do our own thing. Would like some lvl of interaction. \n\nOther obligations: full time studying for MCAT\n\nAge/Gender: 30 YO Male, LGBT\n\nInformation/Ice Breakers: love studying with people, looking forward to diving deep and powering through all the challenges, happy to host at our house",
            "**Location:** Boston, MA        \n\n**Age/Gender:** 22F\n\n**Test Date** (Anticipated): April 2024\n\n**MCAT Prep Material:** Uworld, Anki, AAMC, Khan Academy\n\n**Online/In-Person/Both/No-Preference:** I prefer in-person, but don’t mind both!\n\n**Stage of studying/study plan:** Plan is to do Anki and Uworld everyday, full-lengths every other week, and use khan academy to fill gaps in knowledge.\n\n**Goal of a Study Buddy:** Keep each other accountable and share tips!\n\n**Goal Score and Realistic Score**: 515 goal\n\n**Other obligations**: full-time job as a clinical care technician (Three 12hr shifts a week, rotating days/nights and weekends)\n\n**Other Information/Ice Breakers**: I love music (trying to make producing music a hobby), food, exploring, and working out",
            "**Location:** Nashville, TN\n\n**Age/Gender:** 25M\n\n**Test Date (Anticipated):** April 2024\n\n**MCAT Prep Material:** Uwhirl, Anki, AAMC, Khan Academy\n\n**Online/In-Person/Both/No-Preference:** Would love an in-person with someone nearby, but okay with online (prefer Discord, but willing to do google meets, zoom, etc.). Posting cause I didn't see any Nashville posts :)\n\n**Stage of studying/study plan:** I'm jumping into Uearth and continuing Anki grind. Planning to implement practice exams after a month/1.5 months.\n\n**Goal of a Study Buddy:** Need accountability, maybe review concepts together. I'm a huge fan of the Feynman Learning technique. I'm trying to not only build a good schedule for the MCAT, but better studying skills and schedule building for Med School.\n\n**Goal Score and Realistic Score:** 515 goal\n\n**Other obligations:** Currently working M/W but off by 5 PM (CST)\n\n**Other Information/Ice:** I enjoy video games to unwind. Currently addicted to Final Fantasy XIV. Looking to clear my backlog on downtime while studying (Zelda BotW, Nier Replicant, etc.)",
            "**Location :** Boston, MA\r  \n\r  \n**Test Date**: May 4, 2024\r  \n\r  \n**MCAT Prep Material**: Kaplan books, AAMC, Uworld, Anki\r  \n\r  \n**Online/In-Person/Both/No-Preference**: no preference\r  \n\r\r  \n\r  \n**Stage of studying/study plan**: retaker, first took test last June. Beginning content review next week\r  \n\r  \n**Goal of a Study Buddy:** keep each other accountable, share notes, help with C/P as that was my weakest section\r  \n\r  \n**Goal Score and Realistic Score**: 515 goal, 508-510 realistic\r  \n\r  \n**Other obligations:** working full time as a medical assistant in an urgent care \n\n**Age/Gender:** 22F",
            "**Location:** Southern Utah \r  \n\r  \n**Test Date:** June 1, 2024\r  \n\r  \n**MCAT Prep Material:** UW, AAMC, Princeton Review, and of course Anki.\r  \n\r  \n**Online/In-Person/Both/No-Preference:** Online for now, maybe in-person closer to the time.\r  \n\r  \n**Stage of studying/study plan:** Doing Anki now, going to start UW in January. Currently, reviewing the 300 page psych/soc doc. \r  \n\r  \n**Goal of a Study Buddy:** Keep ourselves accountable.\r  \n\r  \n**Goal Score and Realistic Score:** 510+\r  \n\r  \n**Other obligations:** Nothing really.\r  \n\r  \n**Age/Gender:** 29M\r  \n\r  \n**Other Information/Ice Breakers:** I took time off after graduating to really make sure that this was the path I wanted to pursue. This is what I want to do. I work full-time so I'm only able to study part time.",
            "**Location:** New Jersey  \n**Age/Gender:** 20 F  \n**\\[Anticipated\\] test date:** Aug 2024  \n**MCAT prep material:** Kaplan books, U world, AAMC, Anki, Khan, Jack Westin CARS practice  \n**Online/In-Person/Both/No-Preference**: Both but prefer in person better   \n**Stage of studying/study plan:** Planning out my study schedule and abt to start soon   \n**Goal of a Study Buddy:** keep accountable, motivate, quiz/help each other, meet someone who's in the same boat as me, chat during breaks!  \n**Goal Score and Realistic Score:** anything above 510  \n**Other obligations:** I work part-time, go to school, and volunteer every saturday but can adjust my schedule   \n**IceBreaker:** I love outdoor activities especially watching sunrise or sunset at the beach. I also read books, try my best to go to the gym, and trying to learn how to cook.",
            "**Location:** Houston, Texas, USA\n\n**Test Date:** May 4, 2024\n\n**MCAT Prep Material:** Kaplan books, Anki, UWorld, Blueprint and AAMC Exams\n\n**Online/In-Person/Both/No-Preference:** Online but in-person may work!\n\n**Stage of studying/study plan:** I started today (January 1, 2024)!\n\n**Goal of a Study Buddy:** Keep each other accountable and motivated!\n\n**Goal Score and Realistic Score:** I do not know, I have not taken a Diagnostic Exam yet.\n\n**Other obligations:** I just graduated so I only have some volunteering with some job hunting.\n\n**Age/Gender:** 22F\n\n**Other Information/Ice Breakers:** This is my 1st Reddit post, I barely know how Reddit works :). Just logged in to make this post!",
            "Hi guys :)\n\n**Location**: Waterloo, ON, Canada\n\n**Test Date:** Anticipated - April 6, 2024\n\n**MCAT Prep Material**: Kaplan, Khan Academy, Milesdown Anki, AAMC\n\n**Online/In-Person/Both/No-Preference**: Online or in-person\n\n**Other obligations**: Working full time (co-op) from January to April end. Volunteering and EC's.",
            "[deleted]",
            "**Location (City, State, Country)**: Tampa, FL USA  \n**Test Date (or Anticipated)**: Anticipated End of April (waiting on FAP to reopen for fee assistance)  \n**MCAT Prep Materia**l: Kaplan, UWorld, Jack Westin, and free resources  \n**Online/In-Person/Both/No-Preference**: Both  \n**Stage of studying/study plan**: Just starting; following blueprint 3-month study schedule  \n**Goal of a Study Buddy**: keep each other accountable, quiz each other, share tips, combine notes, motivate each other  \n**Goal Score and Realistic Score**: e.g. 520 goal, N/A realistic   \n**Other obligations**: Part-time job",
            "•Location (City, State, Country): San Luis Obispo, CA\n\n•Test Date (or Anticipated): 5/4/2024\n\n•MCAT Prep Material: Kaplan books, AAMC, maybe ANKI/UWORLD?\n\n•Online/In-Person/Both/No-Preference: No preference \n\n•Stage of studying/study plan: currently taking physics and biochem classes, working on content review and full length exams (recently took all prereqs, I’m in my junior year of college)\n\n•Goal of a Study Buddy: keep each other accountable, share tips, combine notes\n\n•Goal Score and Realistic Score: 517 goal, 510 realistic\n\n•Other obligations: 14 credit hours\n\n**P.S. this will be my first time taking the MCAT and I’m pretty nervous, plz share any helpful tips or resources :)",
            "**Location:** Ponce, Puerto Rico \r  \n**Test Date:** May 11th, 2024 \r  \n**MCAT Prep Material:** Kaplan books, Anki (MilesDown), UEarth for now. Open to new options! \r  \n**Online/In-Person/Both/No-Preference:** Online at the start and then in-person as the date approaches! \r  \n**Stage of studying/study plan:** Soon about to take my diagnostic test\r  \n**Goal of a Study Buddy:** Share resources, quiz each other, study together silently when needed (seeing someone else motivates me), and be positive towards each other! \r  \n**Goal Score and Realistic Score:** 505 (The minimum I want, so just want to be realistic) \r  \n**Other obligations:** I work at a research lab, so maybe some days I would be out but most of the times, I will be available to study! \r  \n**Age/Gender:** 22F \r  \n**Other Information/Ice Breakers:** I love working out, really love to hike, and I am not afraid to order something different every time I go to the same restaurant! (other words, love to try new things haha) \r  \n\r  \nDM if interested!",
            "Location: Denver, CO, USA\nTest Date: April 27, 2024\nMCAT Prep Material: Khan Academy, Kaplin, Anki, UWorld, JW\nOnline/In-Person/Both/None: Mostly online!\n\nStage of studying/study plan: on 2nd week of studying so still doing content review. I generally do Anki, content review, JW passages, some UWorld each day\nGoal of Study Buddy: motivation, accountability, sharing resources, clarifying questions, overall just support!!\nGoal Score and Realistic Score: 525 (would love above 520s but realistically 515+)\nOther obligations: work a few days a week at my family’s restaurant\n\nAge/Gender: 21F\nOther Information/Ice Breakers: Recent Neuroscience grad from CU Boulder! Love cats, going to new restaurants, and rewatching comfort shows and movies!",
            "**Location**: Bronx,NY USA  \n**Test Date:** April 2024  \n**MCAT Prep Material:** Currently doing content review with Kaplan. Will use Khan Academy, JackWestin, Ugold, AAMC questions, etc.  \n**Online/In-Person/Both/No-Preference:** Online for now  \n**Goal of a Study Buddy:** Motivation and accountability  \n**Goal Score and Realistic Score:** 510+  \n**Other obligations:** Part-time job  \n**Age/Gender:** 23F  \n**Other Information/Ice Breakers:** I love cats, taking naps and snacks lol",
            "Location (Manhattan, NY, USA).\n\nTest Date September or fall 2024\n\nMCAT Prep Material: e.g. Kaplan books, Jack westin,I will get AAMC and blueprint when its 2-3 months close to exam date\n\nOnline/In-Person/Both/No-Preference: in person and online \n\nOptional (but recommended):\n\nStage of studying/study plan: e.g. Started content review with Kaplan books but haven't been consistent because of winter class which ends 1/23/24\n\nGoal of a Study Buddy: e.g. Heavy on accountability partner, I need someone to remind to be on my toes and vice versa.\n\nGoal Score and Realistic Score: e.g. 515 goal, 510 realistic\n\nOther obligations: e.g. 6 credit course for spring semester begins 1/25/24 ends 5/22/24 \n\n9 credit summer courses begins ( 6/3/24 ends 8/3/24). \n\nFamily - I am the eldest of an immigrant household so basically 2nd mom to 3 younger siblings \n\nOptional (100%):\n\nAge/Gender: e.g. 23F as of February \n\nOther Information/Ice Breakers: e.g. I like kpop songs, kdrama and bollywood movies ",
            "Location: Orlando, FL, USA\n\nTest Date (anticipated): August/September (probably September 05, 2024 though I may reschedule to a later date)\n\nMCAT Prep Material: Kaplan Books, P/S Doc, r/MCAT resources, BP Exams (and possible course lol), Anki (MilesDown and AnKING decks most likely), Jack Westin, Khan Academy videos, Leah-Sci, Organic Chemistry Tutor, Youtube MCAT playlist, class notes, AAMC & UEarth later down the road, maybe Memm if I can afford it\n\nOnline/In-Person/No Preference: Personally, I prefer in-person but I don’t mind going online via Discord or Zoom as long as we're able to properly communicate with one another\n\nStage of studying/study plan: I've only done one BP HL and got a 492 back in November and life has been so tiring that I haven't been able to study efficiently since. Man, I'm shit at timing and being consistent and accountable lmao\n\nGoal of a study buddy: Definitely keeping each other accountable (see prior explanation pls), give each other encouragement and support/have someone else to commiserate about this mothereffing exam lol, sharing resources and tips,  asking each other questions and quizzing each other, combining notes all the the usual spiel (hopefully one who'll be willing to exchange numbers with me too lol) \n\nGoal Score and realistic score: 520+ Goal, 515+ realistic (will be happy with a 510+ score also tbh)\n\nOther obligations: Studying to become a CNA (certified nursing assistant so I can get clinical experience (potential full or part-time job...will share details later on down the line when I get there), family, volunteering on and off at a food bank, and church sometimes TmT\n\nAge/Gender: 25F (Will be 26 in June...damn, I'm ancient lmaooooooo)\n\nOther information/ice-breakers: Hoo boy, where do I even begin? Well, I have ASD (Asperger's specifically) and ADHD, I'm Puerto Rican and Filipino, I have two sweet little dogs named George and Benji, and I'm also interested in both M.D. and D.O. friendly specialties. The list of specialties I am interested in specifically are:  primary care (FM/IM/Peds), OB/GYN, PM & R,  Radiology and Psych",
            "Location: Atlanta, Ga\r  \n\r  \nTest Date (or Anticipated): August 2024\r  \n\r  \nMCAT Prep Material: Kaplan books, AAMC, Kaplan Prep Course\r  \n\r  \nOnline/In-Person/Both/No-Preference: Online mostly....MAYBE In person! \r  \n\r  \nStage of studying/study plan: About to start content review in Feb. Plan on starting kaplan course Feb 5 \r  \n\r  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes\r  \n\r  \nGoal Score and Realistic Score: goal: honest anything 510 and above...I just want to get into an American Medical school....Med school is medschool. \n\nRealistic: Idek I plan to take a diagnostic when I start my content review in Feb.\r  \n\r  \nOther obligations: job M-Th from 8am-3 pm. Trying to get two weekdays off for the prep course. \r  \n\r  \nAge/Gender: 23F\r  \n\r  \nOther Information/Ice Breakers: I like working out, cooking, skincare, healthy eating ummmmm idek I am more humanities based ngl. Majored in Bio Minor in Phil. My life really has been set up to succeed in Medicine... I love the end goal HATE chem and bio lol anatomy is cool tho.",
            "Location: Boston\nTest Date (or Anticipated): waiting for 4/27 slot to open up (finger crossed) \nMCAT Prep Material: Kaplan books, UWorld, anki decks, etc\nOnline In-Person Both No-Preference: online mostly but down to do in person here and there if it’s in the city\nStage of studying/study plan: content review\nGoal of a Study Buddy: really looking for an online accountability buddy to help me study on weekdays after work! \nOther obligations: full time 9-5 job\nOther info: I’m a non-trad 26F and would love to meet other career changers in the same boat!",
            "Location: San Diego, CA  \nTest Date: May 14, 2024  \nMCAT Prep Material: ANKI , AAMC, UWorld, Kaplan books  \nOnline/In-Person/Both/No-Preference: I am honestly down for both, but I do have a hectic schedule and online would probably work out best.\n\n  \nStage of studying/study plan: I am kinda all over the place. I had rescheduled my test date so I have some content review done, but I would like to do a lot more. But at the same time, I have completed some full-lengths and have done a bunch of practice problems as well. It's kinda a hot mess I'm trying to figure out  \nGoal of a Study Buddy: Keep each other accountable, share resources, ask questions, and cheer each other on!  \nGoal Score and Realistic Score: My goal is 520+, and honestly I really do feel that is I push myself and work hard I can achieve it.   \nOther obligations: I am currently a full-time student, who works at a research lab about 20-30 hours a week. I also am getting clinical hours and I am part of a club. I am on the quarter system, and starting next quarter I will be a research-based master's student. So kind of a lot, but it is what it is    \nAge/Gender: 21F  \nOther Information/Ice Breakers: I recently (very recently) went through a breakup, we were in a relationship for 2 years. I'm trying to throw myself into study as a coping mechanism with everything that is happening. I really love research, all of my research so far has been within oncology. And my overall goal is to apply for an MD/PhD. I am also trying to get back into working out as a healthy habit to counteract all the studying and sitting.",
            "**Location:** NYC\n\n**Test Date:** April 27, 2024 (Anticipated - won't be testing in NY though)\n\n**Online/In-Person/Both/No-Preference:MCAT Prep Material:** Kaplan books, Jack Sparrow and Milesdown Anki decks, Jack Westin, any free tests I can find. \n\n  \n**Online/In-Person/Both/No-Preference:** Would love to meet up in person, but online is great too!\n\n**Stage of studying/study plan:** Heavy into content review, particular emphasis on general chemistry. \n\n**Goal of a Study Buddy:** Accountability, getting out of the house more, great study tool to teach one another concepts, maybe making a friend or two on this journey. \n\n**Goal Score and Realistic Score:** Goal score is 518, realistically looking for at least 508. \n\n**Other obligations:** I work full time, but job is remote and I have amazing freedom to do what I want through the day. \n\n**Age/Gender:** 27F\n\n**Other Information/Ice Breakers:** I have a degree in molecular biology, I dabble with computer science, I have a small Shiba Inu who is very rude. I don't take myself too seriously and am pretty goofy and easy going. This test isn't consuming my life, which I think is making it easier to relearn the material I have forgotten. I like teaching people things...at one point in my life I was a theatre kid 🤪",
            "Location: Long Island, New York  \nTest Date (or Anticipated): Sept 14th\n\n  \nMCAT Prep Material: Kaplan, JW, Anki, AAMC, Uworld, Berkley, Varsity Tutors  \nOnline/In-Person/Both/No-Preference: Both\n\nStage of studying/study plan: Starting content Review  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes, help motivate each other  \nGoal Score and Realistic Score: Goal 515, Realistic 510  \nOther obligations: Part-Time job Fridays or Saturdays 7A-7P, School (Monday,Wednesday)\n\nAge/Gender: 22F",
            "[deleted]",
            "Location: San Francisco, CA\n\nTest Date (or Anticipated): May 10, 2024\n\nMCAT Prep Material: AAMC exams, Uworld, Anki, Jack Westin\n\nOnline/In-Person/Both/No-Preference: Both\n\nStage of studying/study plan: Reviewing Content \n\nGoal for Study Buddy: keep each other accountable, share study tips, review questions together, quiz each other on content \n\nGoal Score and Realistic Score: Goal 520 Realistic 515 \n\nAge/Gender:  25F\n\nOther Information/Ice Breakers: I like hiking, traveling, I have a pet Maine Coon and he’s super friendly! If interested PM me.",
            "Location: Louisville, KY Kentucky ( I included both for browser search) \r  \n\r  \nTest Date: June, 2024\r  \n\r  \nMCAT Prep Material: Kaplan, Khan, AAMC, UWorld soon\r  \n\r  \nI would like to have an online study buddy for now, and then in-person soon after a few online study sessions together .\r  \n\r  \nStage of studying/study plan: Starting content review\r  \n\r  \nGoal of a Study Buddy: Keep each other accountable, share resources, ask questions/quiz one another, and cheer each other on!\r  \n\r  \nGoal Score and Realistic Score:  Perfect score and the realistic score idk honestly\r  \n\r  \nOther obligations: I work two part time jobs to pay for my rent and cost of living. \r  \n\r  \nAge/Gender: 25F\r  \n\r  \nOther Information/Ice Breakers: \n\nI'm active. I like sports; I enjoy playing basketball. I go to the gym regularly. I could be talkative and weird. Dw I will play normal so you won't notice XD. Fun fact- I am a certified NASM personal trainer. \n\n&#x200B;\n\nFeel free to PM me to study together and cheer on.",
            "[deleted]",
            "**Location (City, State, Country):** San Fernando Valley, California  \n**Test Date (or Anticipated):** Not scheduled but Late March/ Early April  \n**MCAT Prep Material:** Uworld, AAMC, JW Daily  \n**Online/In-Person/Both/No-Preference:** Both!\n\n**Stage of studying/study plan**: Done with content review, taking MCAT for the second time. 508 score on actual.   \n**Goal of a Study Buddy:** e.g. keep each other accountable, quiz each other, share tips, CARS help.  \n**Goal Score and Realistic Score**:  525 ideal. 515 realistic  \n**Other obligations:** Work on weekends. Physical therapy in the mornings M, T, F\n\n**Other Information/Ice Breakers**: interested in neurology.",
            "Location: Medicine Hat, Alberta, Canada\n\nTest Date: (tentative) June 1st\n\nMCAT Prep Material: Princeton Prep books, KA, plan on looking into UWorld, JW daily CARS, AAMC Bundle\n\nOnline/In-Person/Both/No-Preference: Open to in-person, but highly doubt anyone lives near me. Completely open to online calls. \n\nStage of studying/study plan: Gathered all resources and planned out a decent amount, just started my content review. \n\nGoal of a Study Buddy: Accountability, constructive communication and support for one another. Also share tips and tricks that may help each other.\n\nGoal Score and Realistic Score: 510, 508\n\nOther obligations: Taking 4 college classes, albeit easy ones so I can study for the MCAT more effectively. Volunteer once a week and work once a week. President of a science club at my college.\n\nAge/Gender: 19M\n\nOther Information/Ice Breakers: In the second semester of my 2nd year of undergrad, missing college level physics. I go to the gym frequently, play basketball semi-regularly, and play video games when I have the time. My goal is to be admitted into U of C’s veterinary medicine “!",
            "Location: Miami, FL\n\nTest Date (or Anticipated): 5/16/24\n\nMCAT Prep Material:  Jack Westin Science Course, Anki, saving up for UEarth, Bp, and AAMC\n\nOnline/In-Person/Both/No-Preference: Mainly online, dont mind in person if youre really close\n\n\nGoal of a Study Buddy:  Encourage each other and make this a less lonely process\n\nGoal Score and Realistic Score: 520 Goal, 515 realistic\n\nOther obligations: Family's Seventh Dy Adventist, so nothing from Friday night to Saturday night\n\nAge/Gender: 21F\n\nOther Information/Ice Breakers: Black, go to UM, interested in dermatology. Love Marvel and kpop lol",
            "\n\n* **Location**: *Harvard, MA USA (close to Worcester and Boston)*\n* **Test Date** Anticipated: 5/15/24\n* **MCAT Prep Material**: Kaplan, Blueprint 6 month self paced course, TPR books, UWorld, Psych/soc 300 pg doc, AAMC Qbank and practice materials (all of it)\n* **Online/In-Person/Both/No-Preference**: In person\n* **Stage of studying/study plan**: Content review currently. I started studying Jan. 1 with the blueprint plan that has with practice passages and content review at the same time, but it wasn't for me so I've started a more traditional content review phase out of the Kaplan books.\n* **Goal of a Study Buddy**: I learn best conversing with other people so I can ask questions, simulate teaching, and really get to understand how someone else thinks about the test. All super helpful for me and I'm not taking an MCAT class so I dont really have any of this.\n* **Goal Score and Realistic Score**: never understood this question, my goal score is 528 because why would you set your goal for anything lower. Realistic score would be 523.\n* **Other obligations**: Currently none. I moved back home so I could study for this test\n* **Age/Gender**: 24 y.o M\n* **Other Information/Ice Breakers**: Since I graduated college in 2021, I moved to NYC to really figure out if I wanted to be a doctor or not. I spent two years in the workforce at an Eye-Bank and a COVID testing center. I realized that more than anything I want to be a physician, so I moved back home to study for this test with the support of my family. I worked non-stop in New York and could barely pay my bills. Studying there was out of the question for me. I also love to play any type of music and I love sports of all kinds, mainly soccer and lacrosse.",
            "**Location** (City, State, Country): *Malden (Boston), MA, US*\n\n**Test Date** (or Anticipated): *06/01/2024*\n\n**MCAT Prep Material**: *Blueprint*\n\n**Online/In-Person/Both/No-Preference**: In-person preferably but can also do both\n\n**Stage of studying/study plan**: *Just started a course with Blueprint but this is my retake*\n\n**Goal of a Study Buddy**: *Quiz/teach each other, help with full test practice.*\n\n**Goal Score and Realistic Score**: *515 goal, 510 realistic*\n\n**Other obligations**: *full-time job but I'm free Friday*\n\n**Age/Gender**: 30M\n\n**Other Information/Ice Breakers**: I'm working for Boston Children's. Been on a multi-year gap year but finally decided to apply this cycle. I'm a Vietnamese-American. Feel free to DM.",
            "[removed]",
            "* **Location** (City, State, Country): *e.g. P*ittsburgh, Pennsylvania, USA                                                             **Test Date** (or Anticipated): *e.g. 9/12/24 registered but may reschedule*\n* **MCAT Prep Material**: *e.g. Kaplan books, NS Exams, UEarth, AAMC* \n* **Online/In-Person/Both/No-Preference**: Online\n\n\n\n* **Stage of studying/study plan**: *e.g. Just starting out with content*\n* **Goal of a Study Buddy**: *e.g. keep each other accountable, quiz each other, share tips, combine notes*\n* **Goal Score and Realistic Score**: *e.g. 520 goal, 515 realistic*\n* **Other obligations**: *e.g. full time college student and research*\n\n* **Age/Gender**: *20F*\n* *Ice breaker - I am a Neuroscience major and dream to be a surgeon. I am a huge film buff, love reading and the motto for 2023 was to do it for the plot!*",
            "Location (City, State, Country): TX\n\nTest Date (or Anticipated): 3/26/24\n\nMCAT Prep Material: Kaplan On Demand Course, Anki, AAMC, Tutor \n\nOnline/In-Person/Both/No-Preference: Either!\n\nStage of studying/study plan: I am in my MPH program and teach all day and take classes at night!  So I study lots in the mornings.  Trying to get through lots of Kaplan + Anki practice while taking practice tests every weekend! \n\nGoal of a Study Buddy: Support, encouragement, tips!\n\nGoal Score and Realistic Score: 520 Goal, 515 realistic\n\nOther obligations: Teaching undergrad students 12-3pm, MPH classes 3-9:30pm\n\nAge/Gender: 22F\n\n\nOther Information/Ice Breakers: I love love health and wellness!  I have been obsessed with all things medicine since I was 13 and diagnosed with a chronic illness.  My doctor saved my life, and my goal is to change lives like he has mine!  \n\nFeel free to PM if you want to chat, exchange study tips, or look over each other’s CVs and give application advice! :)",
            "Location: Vancouver, Canada \n\nTest Date: June 14, 2024\n\nMCAT Prep Material: UEarth, AAMC, anki, KA, TPR\n\nStudying Plan: Finishing content review, need help with C/P!!!\n\nGoal of a Study Buddy: Help with topics we don’t know. \nI am great at CARS and P/S and can help anyone with that! I am okay with B/B. But I need help with C/P!!! Cool with virtual study buddy, anywhere. \n\nGoal Score and Realistic Score: 520+ \n\nAge/Gender: 25F \n\nOther Information/Ice Breakers: I am chronically online and I love movies, music, and food. Really bad at physics/chem :(",
            "**Location**: Austin, TX  \n**Test Date**: April 13, 2024  \n**MCAT Prep**: Kaplan Books, UWorld, little bit of Anki (my own), free BP exams, and getting AAMC tomorrow  \n**Goal of a Study Buddy**: Keep me accountable, share CARS tips (I can share some C/P tips as that's probably my most confident section)\n\n**Online vs In-Person**: Mostly online but open to in person  \n**Goal Score and Realistic Score**: 512+  \n**Other obligations**: School, taking Biochem 2 and a hard Molecular Genetics class, but I have no more exams until test day  \n**Age/Gender**: 21M",
            "Location: Georgia (metro Atl)  \nAge/Gender: 27F  \nTest Date (Anticipated): May 2024  \nMCAT Prep Material: Uworld, Anki, AAMC, Khan Academy  \nOnline/In-Person/Both/No-Preference: Preferably in-person, but don’t mind both/online!   \nStage of studying/study plan: Anki + Uworld + JW. Videos for content gaps, soon doing FLs every other week.   \nGoal of a Study Buddy: Keep each other accountable, motivation, and share tips!  \nGoal Score and Realistic Score: 515, realistic: 510-512  \nOther obligations: Part time job tutor & clinical   \nOther Information/Ice Breakers: Love yoga, burgers, going for walks/run, etc",
            "Location: Canada west coast\n\nTest date: May 10 might reschedule \n\nMcat prep: Anki, aamc, uworld \n\nOnline cuz everyone’s American here oops\n\nStage: just started today cuz I hate\n\nGoal: just watch me and make sure I study for at least 5-6hr a day thanks\n\nGoal score: 128 in cars (pretty iffy about this one), at least 124 everything else (easy)\n\nSo I got 512 in my last test in 2019 (expired) and a 125 in cars. My background is sciences so I got carried by science sections, but my cars is so crap. As a Canadian I need 128 to apply to most schools so here I am. orz ",
            "[deleted]",
            "**Location**: Atlanta, GA\n\n**Test Date**: September 13, 2024 but may reschedule\n\n**MCAT Prep Material**: Kaplan books, Khan Academy, Anki (Pearl-AnKing), then UW and AAMC\n\n**Online vs in-person**: I'm cool with either\n\n**Stage of studying/study plan**: Beginning content review\n\n**Goal of a Study Buddy**: Accountability (got a calendar to track progress but it's been mostly empty 😅)\n\n**Goal Score**: Where I don't think I could have done better\n\n**Other obligations**: Summer research program\n\n**Age/Gender**: 20M\n\n**Other Information/Ice Breakers**: Interested in oncology",
            "**Location:** Chicago\n\n  \n**Test Date:** Sept 2024\n\n  \n**MCAT Prep Material:** Kaplan books (for now), eventually UW, AAMC, FLs, etc.\n\n  \n**Online/In-person:** I'll take whatever I can get  \n\n  \n**Stage of studying/study plan:** Have just barely cracked open the books for content review\n\n  \n**Goal of a Study Buddy:** To hold ourselves accountable!! I have approximately ***zero*** self-control and can't stick to a schedule for the life of me... Also to motivate each other when the going inevitably gets tough, to laugh but also to cry, all that good stuff! \n\n  \n**Goal Score:** 🤷🏻‍♀️\n\n  \n**Other obligations:** Clinical job \n\n  \n**Age/Gender:** 23F\n\n  \n**Other Information/Ice Breakers:** I'm pivoting from aspiring PhD to MD. Previously worked full-time in cancer research (non-clinical).",
            "**Location (City, State, Country):** e.g. Arkansas but due to summer I would be moving to Washinton\n\n**Test Date (or Anticipated):** e.g. September/October 2024\n\n**MCAT Prep Material:** Khan Academy, Proton Guru, YoutubeAAMC (all of it), The Princeton Review \n\n**Online/In-Person/Both/No-Preference:** Online\n\n**Stage of studying/study plan:** e.g. Just starting with content review\n\n**Goal of a Study Buddy:** e.g. keep each other accountable, quiz each other, share tips, combine notes\n\n**Goal Score and Realistic Score:** e.g. 520 goals, 515 realistic\n\n**Other obligations:** e.g. 16 credit hours, extracurriculars, having a summer remote job\n\n**Age/Gender:** 23F\n\n**Other Information/Ice Breakers:** e.g. I Love Jesus first.",
            "Location Long Island, New York (Brookhaven Area)\r  \n\r  \nTest Date: 8/23/24 \r  \n\r  \nMCAT Prep Material: still in the beginning process of studying, considering purchasing Kaplan books, Anki, UWorld, Blueprint, \n\nOnline/In-Person/Both/No-Preference: I have no preference, we can begin with online and transition to in-person meetups  \r  \n\r\r  \nStage of studying/study plan: At the absolute beginning of studying\r  \n\r  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes\r  \n\r  \nGoal Score and Realistic Score: e.g. 518-515 goal, 512 realistic\r  \n\r  \nOther obligations: master's program, rugby, gym, research \r  \n\r\r  \n\r  \nAge/Gender: 23M\r  \n\r  \nOther Information/Ice Breakers: I was born in Ecuador but moved when I was 15 months old. I would say a recent drive to wanting to become a doctor was when I was scribing and saw first-hand the subpar patient treatment towards Spanish-speaking patients. \n\nI would say for an ice breaker- I would say that in recent years I have gotten really into working out and sports. There was this one time before a rugby game, I dislocated my pinky and put it back into place and played the whole game. I think it took a whole half a year for the swelling to go down.",
            "Hey :)  so I already posted a request for a study buddy with the template provided I dk where my original post is to check for any potential replies, any redditt techs can help please. I am looking for a study buddy ( testing in August) and trying not to repost the same thing a gazillion times. Thank you!!",
            "**Location:** Nashville, TN\n\n**Test Date:** June 22nd, 2024\n\n**MCAT Prep Material:** AAMC,Anki, Altius\n\n**Stage of studying/study plan:** Review;Studying intensely.\n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, etc. Support each other!\n\nOnline or In-Person works for me! \n\n**Goal Score and Realistic Score:** 510\n\n**Other obligations:** None\n\n**Age/Gender:** 29F\n\n**Other Information/Ice Breakers:** I have ADHD, depression, lost both of my grandmas, have shit family, just broke up with my trash ex of 9 years, lost all my friends because of it, and lost a lot of time because I depended on my ex--Cheered him on while he tried and got into med school and helped him out when he never helped me; I have a master's degree and work for pain clinic. I never took care of myself well while supporting everyone else around me. I never had a set schedule and changed that. This MCAT will get me into med school finally, and I'm focusing on my future and physical and mental health.",
            "[removed]",
            "Location: Atlanta, GA\n\nTest Date: 06/15/24\n\nMCAT Prep Material: Kaplan books, UWorld coming soon\n\nOnline/In-Person/Both/No-Preference: preferably in person but online is okay too\n\nStage of studying/study plan: some content reviewed a while ago, getting back to studying\n\nGoal of a Study Buddy: accountability, quizzing each other, studying efficiently\n\nGoal Score and Realistic Score: 510-515+\n\nOther obligations: n/a took time off to study full time\n\nAge Gender: 25F\n\nOther Information/Ice Breakers: i love edm",
            "* **Location** New Orleans, Louisiana  \n* **Test Date** (or Anticipated): *August 24*\n* **MCAT Prep Material**: *e.g. Kaplan course online (beginning of it), AAMC, Blueprint or Uworld (later), Anki, youtube MCAT materials* \n* **Online/In-Person/Both/No-Preference**: online possible in person, if time permits\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**:  *Started content review, hoping that in a month or two I will start practice tests/ review. With FL and reviewing and filling in contact gaps as I go along.*\n* **Goal of a Study Buddy**:  *keep each other accountable, quiz each other, share tips, ask each other questions, encourage each other.* \n* **Goal Score and Realistic Score**: *. 514 goal, 507 realistic, hopeful for a 510*\n* **Other obligations**: *Work a full time job 7:30am- 4pm. I have an Australian Shepard that needs her walks (very active dogs), family oriented person, also working on getting my citizenship (studying for two important tests)*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *27F*\n* **Other Information/Ice Breakers**: *I have not been able to take a full length yet. I plan to do so in a week or so. I have dealt with depression and anxiety for many reason. However taking this test does not help either. I am hoping to get over my fear of failing. Reason why I have not taken it once since I graduated (in 2019 then ofc covid). This will be my first MCAT exam. SO I am excited and nervous but I am so ready for this next phase of my life. I love going to the gym at 5am, gets my day going. I love my daily walks with my dog. I am very family oriented so I love being around my family and friends (hard to do it during this time of MCAT prep).  I also love true crime and horror movies. I'm obviously an non-traditional applicant, undergrad overall gpa is average. MCAT is very important and I need to do as well as I can.*",
            "Looking for a study buddy who just started studying content review.",
            "[deleted]",
            "[removed]",
            "love this",
            "* **Location**: Ottawa, Ontario, Canada\n* **Test Date**: September 5, 2024\n* **MCAT Prep Material**: *Kaplan books, Kaplan study deck, AAMC*\n* **Online/In-Person/Both/No-Preference**: Online or in-person",
            "\n\nLocation: Toronto/ Markham, Canada\n\nTest Date: mid September (still waiting for open spot :(\n\nMCAT Prep Material: Kaplan books, Anki, Uworld, AAMC \n\nOnline/In-Person/Both/No-Preference: No-Preference\n\nStage of studying/study plan: May - June: content review \nJuly- August: Uworld, AAMC\n\n\nGoal of a Study Buddy: Keep each other accountable, Sharing tips and talk about everything premed/mcat related \n\nAge/Gender: 22 F\n\nGoal Score: 512+\n\nOther obligations: currently taking summer courses + part time jobs",
            "* **Location**: Houston, TX\n* **Test Date**: August 2024\n* **MCAT Prep Material**: Kaplan books, Jack Weston, Anki (Milesdown), UWorld, BP\n* **Online/In-Person/Both/No-Preference**:  Online\n* **Stage of studying/study plan**: Just started content review\n* **Goal of a Study Buddy**:  keep each other accountable by meeting once or twice a week, quiz each other, and share test taking tips.\n* **Goal Score and Realistic Score**: 520 goal, 515 realistic\n* **Other obligations**: Part-time job and volunteering\n* **Age/Gender**: 20F\n* I prefer a female study buddy since I'm a female myself.\n* Please reach out!",
            "* **Location** *Vancouver, Canada*\n* **Test Date** (or Anticipated): *17/08/24 registered but may reschedule*\n* **MCAT Prep Material**: *e.g. Kaplan books, UWorld, AAMC and Khan Academy for psych and socio*\n* **Online/In-Person/Both/No-Preference**: Both works!\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: starting content review, almost done with the planning stages rn\n* **Goal of a Study Buddy**: *keep each other accountable, quiz each other, share tips, combine notes* \n* **Goal Score and Realistic Score**: *523 goal, 515 realistic*\n* **Other obligations**: *volunteering, extracurriculars, maybe a single course during summer*",
            "**Location**: Houston, Texas\n\n* **Test Date**: 08/02/2024\n* **MCAT Prep Material**: Kaplan Books, ANKI, Blueprint self paced course\n* **Online/In-Person/Both/No-Preference**: No-Preference\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: Just took first FL without any studying starting 3 week content review \n* **Goal of a Study Buddy**: *Accountability and just a friend!*\n* **Goal Score and Realistic Score**: *Goal 520* Realistic *: 512*\n* **Other obligations**: *part-time job*\n\n**Optional (100%)**:\n\n* **Age/Gende**: 20F\n* **Other Information/Ice Breakers**: *I am a* yoga instructor and I love to read!",
            "**Required**:\n\n* **Location**: *India*\n* **Test Date** : *13/09/2024*\n* **MCAT Prep Material**: *Kaplan books, TPR books, Anki, and KA (soon planning to take all of AAMC)*\n* **Online/In-Person/Both/No-Preference**: Online\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *under content review (80% done), taking 3rd party practice exams right now*\n* **Goal of a Study Buddy**: *keep each other accountable, quiz each other, share tips,* \n* **Goal Score and Realistic Score**: *526 goal, 521 realistic - current 500 (TPR)*\n* **Other obligations**: *Family, full-time job*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *24M* \n* **Other Information/Ice Breakers**: *I like reading crime thrillers and currently writing one as well!*",
            "**Location:** Phoenix, AZ\n\n**Test Date:** August 2, 2024\n\n**MCAT Prep Material:** ANKI (MilesDown), AAMC, UWorld\n\nI would like to have an online study buddy for now, maybe in-person if relatively close to me\n\n**Stage of studying/study plan:** Starting content review, have taken two practice test\n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, and cheer each other on! If possible do a two hour study sessions together daily / every other day. I know this sounds like a lot but I have heard the best things about studying daily together for accountability and grasping concepts. Even if we just do practice questions silently then share or answers and though processes some days then others concept review.  \n\n**Goal Score and Realistic Score:** Goal in 520's, realistic 515\n\n**Other obligations:** I am studying full time thankfully\n\n**Age/Gender:** 24 Female\n\n**Other Information/Ice Breakers:** I have taken the exam in January and severely under estimated it but now I have the proper resources and I really want to do well to apply in the 2025 cycle!",
            "* **Location** (City, State, Country): *Houston, TX*\n* **Test Date** (or Anticipated): *8/23/2024*\n* **MCAT Prep Material**: *Kaplan books, BP, UWorld, AAMC*\n* **Online/In-Person/Both/No-Preference**: No Preference\n* **Stage of studying/study plan**: *Just starting content review*\n* **Goal of a Study Buddy**: *Accountability and a friend to* commiserate *with*\n* **Goal Score and Realistic Score**: 520 goal, idk realistic\n* **Other obligations**: Part-time *research and volunteering*\n* **Age/Gender**: *20F*",
            "* **Location** (City, State, Country): SD/LA, California\n* **Test Date** (or Anticipated): 8/23/24\n* **MCAT Prep Material**: Kaplan, AAMC, soon UWorld and Blueprint FLs\n* **Online/In-Person/Both/No-Preference**: Online \n* **Stage of studying/study plan**: Just started\n* **Goal of a Study Buddy**: Accountability, note sharing and to jus talk\n* **Goal Score and Realistic Score**: 520 Goal, Realistic (???)\n* **Other obligations**: Part time job and family \n* **Age/Gender**: 19F\n* **Other Information/Ice Breakers**: I love to read and sometimes play stardew valley as a study break :)",
            "**Location** (City, State, Country): *Dallas, Texas, USA*\n\n**Test Date** (or Anticipated): *End of July*\n\n**MCAT Prep Material**:  *AAMC (all of it),Khan,Old princeton book*\n\n**Online/In-Person/Both/No-Preference**: Any\n\n**Age/Gender:** 22F\n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, and cheer each other on!",
            "**Location (City, State, Country):** West TX( Mountain Time)\n\n**Test Date (or Anticipated):** Friday, September 13 (I am a hardcore Swiftie so the 13 is for luck)\n\n**MCAT Prep Material:** e.g. Kaplan books, AAMC, UWorld, Free JW, I am thinking about getting Sketchy and also looking into prep-coures (if you have any recommendations, please let me know)\n\n**Online/In-Person/Both/No-Preference:** Online\n\n**Stage of studying/study plan:** Content Review\n\n**Goal of a Study Buddy:** keep each other accountable, quiz each other, share tips, emotional support. I study from 8-4 so someone with a similar schedule would be perfect, if not we can adjust <3 or at least support each other through texts.\n\n**Goal Score and Realistic Score:** 520\n\n**Other obligations:** Part-time remote job extremely flexible so I am technically studying full-time.\n\n**Age/Gender:** 27F\n\nOther Information/Ice Breakers: I have a Master’s in Public Health. I grew up in Mexico and moved here to pursue higher ed. I am interested in psychiatry/ mental health.",
            "* **Location**: Studio City, CA\n* **Test Date** (or Anticipated): September 15, 2024 (Pasadena)\n* **MCAT Prep Material**: Kaplan Books + Online, UWorld + AAMC (soon), Anki (soon)\n* **Online/In-Person/Both/No-Preference**: No-Preference\n* **Stage of studying/study plan**: Content review right now!\n* **Goal of a Study Buddy**: Be able to ask questions, keep each other in check, help one another with subjects, and having someone understand the MCAT struggle lol\n\n* **Goal Score and Realistic Score**: *515 goal, 510 realistic*\n* **Other obligations**: Volunteering on some Tuesdays from 2-6 + online class 6-9pm, and volunteering thursdays 4-8pm\n\n* **Age/Gender**: 22F\n* **Other Information/Ice Breakers**: I like K-pop, reading, just graduated with my bachelors in biology! Planning on Med school or DO to become an Endocrinologist!",
            "**Location:** Mississauga, ON\n\n**Test Date:** September 1, 2024\n\n**MCAT Prep Material:** ANKI (MilesDown), Khan Academy, UWorld soon\n\n**Stage of studying/study plan:** Starting content review \n\n**Goal of a Study Buddy:** Share resources, accountability, and motivation\n\n**Goal Score and Realistic Score:** N/A \n\n**Other obligations:** N/A \n\n**Age/Gender:** 20F\n\n**Other Information/Ice Breakers:** I've been hesitant in fully going for it and had a lot of self-doubt starting out studying for the Mcat. I'm going for it this year for the first time, and plan on prioritizing it.",
            "* Location: Long Island, NY \n* ﻿﻿Test Date: 09/06/2024\n* ﻿﻿MCAT Prep Material: Kaplan books, UEarth, MilesDown/JS ANKI, all of AAMC prep materials \n* ﻿﻿Online via discord/zoom/ft etc \n\nOptional (but recommended):\n* ﻿﻿Stage of studying/study plan: at the begging with Kaplan Review🙏🏽\n* ﻿﻿Goal of a Study Buddy: keep each other accountable, quiz each other, share tips, motivate one another \n* ﻿﻿Goal Score and Realistic Score: 520+ goal \n* ﻿﻿Other obligations: e.g. doing this full-time for the rest of the summer! \nOptional (100%):\n* ﻿﻿Age/Gender: 21 F \n* ﻿﻿Other Information/Ice Breakers: I’ve been khee-kheeing and resting all of May after a hectic junior year, and am now ready to LOCK IN for the rest of the summer to study for this MCAT and do well iA",
            "* **Location** : Baltimore, Maryland\n* **Test Date**: August 24\n* **MCAT Prep Material**: Blueprint 515+, kaplan books\n* **Online/In-Person/Both/No-Preference**: both\n* **Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, study together\n* **Other obligations:** I am an intern, I work 12 hours a week (8:30AM-12:30PM MWF) but that is all!\n* **Age/Gender:** 20 F",
            "**Location:** Los Angeles, CA\n\n**Test Date:** August 2nd, 2024\n\n**MCAT Prep Material:** Kaplan, ANKI (MilesDown), AAMC, UWorld, Blueprint\n\n**Stage of studying/study plan:** Baseline with the AAMC was a 522! Currently 3 weeks in.\n\n**Goal of a Study Buddy:** I work individually cause I'm introverted asf lmao but am here to help.\n\n**Goal Score and Realistic Score:** 525+? Realistic: 520\n\n**Other obligations:** 5 research labs, 3 clinical scribings, 8 ec's, 2 shadowings, yeah i get 6 hours of sleep\n\n**Age/Gender:** 19M (gonna try applying this cycle)\n\n**Other Information/Ice Breakers:** i have national awards and have appeared on the news way too many times for me to reveal any more info (jim carrey lives in my penthouse im not kidding he's the best person i've ever met)",
            "Hi, I took the MCAT in April 2024 and didn't get the score I wanted and I plan to take it again end of this summer. I studied alone last time but now thinking about a study buddy. Please PM me if anyone is in the **Queens or Long Island** area in **NY** and wants the same thing.",
            "* **Location**: Hartford County, Connecticut\n* **Test Date** (Anticipated): 8/24/2024\n* **MCAT Prep Material**: Kaplan Books, UWorld, Anki (JackSparrow with my own additional cards), Khan Academy, 100-pg P/S Document (soon), Jack Westin (mainly for CARS), AAMC practice (planning after content review)\n* **Online Preference**\n* **Stage of studying/study plan**: mostly done with B/B content review, just started doing content review for C/P and P/S, doing UWorld alongside content and the relevant Anki, daily CARS practice passage\n* **Goal of a Study Buddy**: keeping each other accountable, preferably meeting virtually atleast once a week to check in, share resources, ask each other questions or possibly go over practice questions together. Mainly having someone to study with and cheer each other on!\n* **Goal Score and Realistic Score**: 515 realistic, 520+ goal\n* **Other obligations**: summer classes starting in July, not much other than that.\n* **Age/Gender**: 19F\n\nIf you're interested in studying with me, feel free to PM me! :)",
            "* **Location:** Austin, TX\n* **Test Date:** 09/14/24\n* **MCAT Prep Material:** All Princeton books, all blueprint books, Kaplan Ochem and Biochem books, all AAMC, UWorld, Anki (Miledown and Mr. Pankow)\n* **Online/In-Person/Both/No-Preference**: No preference, but if you live in Austin I'd be down to study together in person!\n* **Stage of studying/study plan**: Retaking a 503. Studying weaknesses and practicing on Uworld.\n* **Goal of a Study Buddy**: Accountability; sharing notes, tips, and resources; helping each other out; emotional support (just kidding...kind of)\n* **Goal Score and Realistic Score**: 512 goal, 510 realistic\n* **Other obligations**: Mostly free for the summer, some volunteering. *I may have to leave the state for an extended time due to one of my parents needing a medical procedure, however it is extremely unlikely that this will happen this summer.*\n* **Age/Gender**: 24F\n* **Other Information/Ice Breakers**: I graduated with a dog-shit gpa. No, really--I barely graduated. I decided to try for medicine at least once because I'd never forgive myself if I didn't. Working on a DIY postbacc to pull myself up and I've come a long way. Needless to say, I'm not the gunner type--I'd be elated with a Do acceptance. I love documentaries and horror movies. I know, weird combination.",
            "**Location**:Atlanta, GA\n\n**Test Date** (or Anticipated): *10/2024*\n\n**MCAT Prep Material**: *Kaplan books, AAMC*\n\n**Online/In-Person/Both/No-Preference**: Both\n\nS**tage of studying/study plan**: done with content review, would like to actively keep up with flashcard, really need to improve CARS\n\n**Goal of a Study Buddy**: \\*\\*\\*do CARS article together and explain to each other\\*\\*\\* *keep each other accountable, quiz each other, combine notes*\n\n**Goal Score and Realistic Score**: *523*\n\n**Age/Gender**: *23F*",
            "* **Location** *San Antonio, Texas, USA*\n* **Test Date** Aug 2, 2024\n* **MCAT Prep Material**: *Kaplan books, UWorld, AAMC,  JW, Altius*\n* **Prefer In-Person, but Online Ok as well.**\n\n* **Stage of studying/study plan**: Between *content review and going over practice exam questions.*\n* **Goal of a Study Buddy**: I learn by teaching so I will learn a concept, then meet up and try to teach it to you so I can ensure I have a solid understanding of it myself. We an *keep each other accountable to a study schedule, quiz each other, share tips, combine notes, and do practice questions together.*\n* **Goal Score and Realistic Score**: *515 goal, 508 realistic*\n* **Other obligations**:  *part-time scribing job*\n* **Age/Gender**: 25 M\n* **Other Information/Ice Breakers**: I'm currently scribing to network with doctors and get advice about the medical field.",
            "* **Location** (Toronto/Montreal, Canada)\n* **Test Date** (or Anticipated): *e.g. 9/14/24 Not registered, still waiting for an opening* \n* **MCAT Prep Material**: *e.g.  AAMC (all of it), Altius, JW* \n* **Online/In-Person/Both/No-Preference**: No preference \n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *e.g. done with content review, taking 3rd party practice exams right now*\n* **Goal of a Study Buddy**: *e.g. keep each other accountable, share tips, review fulls together? or ask each other questions* \n* **Goal Score and Realistic Score**: *e.g. 520 goal, 515-17 realistic*\n* **Other obligations**: *extracurriculars, family. part-time job*",
            "Location: I'd prefer to keep it private for now but an online study budy would be helpful.\n\nTest Date: September 14th, 2024 (might change to January dates)\n\nMCAT Prep: AAMC exams, UWorld, attempting ANKI soon...\n\nStage of Studying: Taking section exams a day, but not reviewing content. I'm working fulltime and it's been hard to get back onto the grind. \n\nGoal of Study Buddy: Keeping each other accountable, consistency, and overall a good study partner who isn't too talkative and very serious. \n\n  \nGoal Score: 510 - 515 would be a good score for me. \n\n  \nOther obligations: I'm a research assistant working on a publication soon, but will be requesting part time soon because my mind can't exit work mode. \n\n  \nAge/Gender: 25/F\n\n  \nOther information/Ice Breakers: I'm a non-traditional student and I switched my major last minute. I think I regret doing this when I could've just graduated and just worked pt to just focus on getting into medical school rather than thinking I needed to work and earn a living before grad school essentially.",
            "\n* **Location** (City, State, Country): Lafayette Louisiana \n* **Test Date** (or Anticipated): January or march 2024 \n* **MCAT Prep Material**: *e.g. Kaplan books, NS Exams, UEarth, AAMC (all of it)*\n* **Online\n* **Stage of studying/study plan**: *e.g. done with Magoosh. Halfway through KA UW \n* **Goal of a Study Buddy**: Skype uworld partner \n* **Goal Score 514 goal, 510 realistic \nOther obligations - aunt in rehab caretaking \n56F \nOther Information/Ice Breakers - mcat expired. Ms4. Step 1 passed 2005. Step 2cs but it is obsolete. Acadian",
            "**Location:** NYC  \n**Test Date (or Anticipated)**: I haven't registered yet but hopefully in March or April  \n**MCAT Prep Material:**  UEarth, AAMC   \n**Online/In-Person/Both/No-Preference**: I prefer online\n\n**Stage of studying/study plan:** I am still doing content review but I want to do UW also\n\n**Goal of a Study Buddy:** Mainly for accountability but also to review concepts or specific problems\n\n**Other obligations:** Kids, Job\n\n**Age/Gender:** 30M (I know I'm old)",
            "**Required**:\n\n**Location** :  Manhattan, New York, NY, USA.\n\n**Test Date (Anticipated)**: 2024. May 15th\n\n**MCAT Prep Material**: e.g. Kaplan books, Jack Westin, KA, NS 2000q book,  UTerra, AAMC (all of it).\n\n**Online/In-Person/Both/No-Preference**: Preferably in person, but open to both.\n\n**Optional (but recommended)**:\n\nStage of studying/study plan: just doing question from everywhere, lol.\n\n**Goal of a Study Buddy**:  keep each other accountable, quiz each other, share tips\n\n**Goal Score and Realistic Score**:  520+ goal, 515 realistic (have taken twice before, 510 highest)\n\n**Other obligations**: 12 credit hours Masters courses.\n\n**Optional (100%)**:\n\n**Age/Gender**:  24M\n\n**Other**: non-resident alien, probably not applying to US MD/DO; applying to PhDs at the same time.",
            "**Location (City, State, Country):** Inland Empire, CA, USA\n\n**Test Date (or Anticipated):** 4/12/24 in Santa Maria, CA\n\n**MCAT Prep Material:** The internet, for now\n\n**Online/In-Person/Both/No-Preference:** In person but online is fine\n\n**Stage of studying/study plan:** Still have to learn physics and psych lol\n\n**Goal of a Study Buddy:** Quiz each other, take practice tests\n\n**Goal Score and Realistic Score:** 520, 510\n\n**Other obligations:** 2 part time jobs, volunteering",
            "**Location**: New York, NY \r  \n\r  \n**Test Date**: May 25th, 2024\r  \n\r  \n**MCAT Prep Material**: Kaplan books, anything free online, open to paying for material that might work for me\r  \n\r  \n**Online/In-Person/Both/No-Preference**: No preference\r  \n\r\r\r  \n**Stage of studying/study plan**: Been halfass reviewing content in the last few months, but giving myself 5 months to hunker down without distractions.\r  \n\r  \n**Goal of a Study Buddy**: Share tips, quiz each other, have teach backs for difficult material.\r  \n\r  \n**Goal 520, realistic 513**\n\n\r  \n**Other obligations**: full time job, last semester in MPH program but only take two courses, some consulting side gigs that wouldn't really take too much from study time \r  \n\r\r  \n\r  \n**Age/Gender:** 27M Queer\r  \n\r  \n**Other Information/Ice Breakers**: Non-traditional applicant (graduated in 2018). Been working in public health and research for a while now. Looking to go to school somewhere in NYC but open to tri state area. Queer latino super chill just wanna be a doctor (hehe).",
            "Location: Northern Va, close to DC\n\nTest date: April 27th, 2024\n\nMCAT prep: AAMC, Kaplan books, anki, Uworld soon, BP soon\n\nStage of studying: Half way done with C/P and B/B content review, havent started P/S content review \n\nGoal of study buddy: Have a friend to go through this horrible process together, keep eachother motivated, ask questions\n\nGoal score and realistic score: the best I can do :) \n\nOther obligations: I work as a full time nurse (3 shifts a wk 12 hours) but starting Jan 21st I am switching to 2 shifts a wk so I’ll be studying 5 days a wk and closer to test day only 1 shift a wk\n\nAge/gender: 24F\n\nOther info/ice breakers: I am a career changer! I did a postbac career changer program and completed all the prereqs in one year :)",
            "Location: Fontana CA\n\nTest Date: 5/16, may reschedule if needed.\n\nMCAT Prep Material: Mainly Blueprint, some AAMC and anki\n\nOnline/In-Person/Both/No-Preference: Both\n\nStage of studying/study plan: Doing content review everyday and a full legnth practice exam every other week\n\nGoal of a Study Buddy: quiz each other, keep each other accountable, vent and keep each other motivated\n\nGoal Score and Realistic Score: 510+\n\nOther obligations: Full-time job as ophthalmic assistant (hoping to cut down hours closer to test date), long-term relationship and family.\n\nAge/Gender: e.g. 22F\n\nOther Information/Ice Breakers: I want to start running because I am hoping to do a disney run in September! Interested in pediatrics and maybe even ophthalmology pediatrics now due to my experience. Love reading romance novels and going line dancing every saturday night to keep myself sane!",
            "Location: Hacienda Heights, CA (East of LA)\r  \n\r  \nTest Date: May 11, 2024\r  \n\r  \nPlanned MCAT Prep Material: ANKI (MilesDown & my own), AAMC, UWorld, Kaplan for review, free BP and Atlius FL, Khan academy for physics, JW for CARS\r\n\nMode: I would like to simulate a studying environment/routine so I prefer in-person at a cafe/library but I am down to try online if it is more in demand. \r  \n\r  \nStage of studying/study plan: Starting content review, currently reviewing physics with khan, then will use kaplan books for BB and Chem.\r  \n\r  \nGoal of a Study Buddy: Mainly to keep each other accountable (I'm a very bad procrastinator on my own and will only work efficiently if someone is relying on me to show up), share resources, ask questions, and cheer each other on!\r  \n\r  \nGoal Score and Realistic Score: 520\r  \n\r  \nOther obligations: I currently tutor and may pick up another job to pay for things so my schedule may change next month. However, I am currently mainly free besides my tutor days\n\nPreferred times to meet (considering in person): morning-12pm\r  \n\r  \nAge/Gender: 22F\r  \n\r  \nOther Information/Ice Breakers: I recently graduated undergrad in august and was also supposed to take my mcat with only 1.5 months to study, but due to graduating early, I experienced burnout and couldnt study well for this test. I only got as far as reading all of BB, ochem, and chem kaplan reviews. Back then I studied in 8 hour blocks and was hyper focused on this exam, but after learning from my burnout, I will be shortening my study times to around 4 hours. I believe I have recovered from this burnout and have the spirit to study again so looking forward to working with someone!",
            "Location: Thailand (Open to anyone close to my timezone, so Singapore, Malaysia, Eastern China, Hong Kong, Phillipines, etc)\n\nTest Date: March 22, 2024\n\nMCAT Prep Material: AAMC resources, anki, uworld, kaplan books\n\nOnline/In-Person/Both/No-Preference: online\n\nStage of studying/study plan: almost finished with Uworld, content review finished, tons of Anki left. Happy to help/answer questions\n\nGoal Score: 518+",
            "**Location:** Virginia Beach, VA (Virginia)\n\n**Test Date**: June 2024\n\n**MCAT Prep Material:** AAMC FLPEs, Princeton Review FLPEs, Uworld, Jack Westin, and Anki (Miledown deck)\n\n**Online/In-Person/Both/No-Preference:** Online\n\n**Stage of studying/study plan**: Majority of bulk content review done (still struggling with P/C); using Jack Westin and UWorld for daily practice questions; practice exams from PR every other weekend (will use AAMC 1 month out)\n\n**Goal of a Study Buddy:** combine notes and share tips. Talk through concepts that we both are struggling in.\n\n**Goal Score and Realistic Score:** 515 goal, 508 realistic\n\n**Other obligations:** Part-time job (8a-2p weekends, 5a-10a Tues/Wed).\n\n**Age/Gender:** 26F\n\n**Other Information/Ice Breakers:**\n\nThis is my second time taking the MCAT and trying to score as high as possible to balance out my really low GPA (I've done an upward trend of a 3.8 during my DIY Post-bacc after 30 credits however).\n\nCurrently work with active duty and wounded warrior military to work on their general and or medical nutrition, physical health (i.e. gym goals), and public health (i.e. help them understand their medical work and education on Hypertension and Diabetes, etc).",
            "Good",
            "Awesome!",
            "**Location:** Queens, NY, USA\n\n**Test Date:** May 11, 2024\n\n**MCAT Prep Material:** ANKI (MilesDown), AAMC, UWorld, blueprint FL exams 1-6\n\nI would like to have an online study buddy for now but flexible with in-person\n\n**Stage of studying/study plan:** currently doing blueprint FL on sundays and going over them and learning additional content during the week. \n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, and cheer each other on!\n\n**Goal Score and Realistic Score:** 510-515\n\n**Other obligations:** I work as a clinical research coordinator full time and study before and after work.\n\n**Age/Gender:** 22/M\n\n**Other Information/Ice Breakers:** I graduated in june 2023 and since then been working in research and recently started studying for the MCAT.",
            "**Location:** Jersey City, NJ\n\n**Test Date:** May 11, 2024\n\n**MCAT Prep Material:** ANKI (MilesDown, JackWestin & my own), UWorld\n\nI would like to have an online study buddy for now, maybe in-person closer to the time.\n\n**Stage of studying/study plan:** Banging out practice questions, trying to improve in CARS, and better learn against AAMC strategies/tricks\n\n**Goal of a Study Buddy:** Keep each other accountable, share resources, ask questions, and cheer each other on!\n\n**Goal Score and Realistic Score:** ideally would love 510 or above (retaker so trying to show improvement)\n\n**Other obligations:** I work as clinical research supervisor in a very big academic center, but make my own hours for the most part and work hybrid so always squeezing in studying\n\n**Age/Gender:** 26M\n\n**Other Information/Ice Breakers:** Love music, doing research (nerd.. i know), lifting, yoga, skiing, sports, long walks. Retaker and reapplicant so really tryna take the A home this upcoming cycle!",
            "Location: MidWest ( Illinois, Chicago)\n Test Date: June 22, 2024\nReview: Princeton Review books, Jack Weston, Khan Academy\n\nScore: Hoping for a 515+\nReality: 510\nMy problem is trying to figure out the best way to review content I do have one class this semester not too much work. Trying to stay focused on this exam is a problem for me.\nI prefer online.",
            "Location: New Mexico\n\nTest Date: May 11, 2024 (may reschedule) \n\nMCAT prep material: ANKI (milesdown with my own cards), Uworld, blueprint prep\n\nStage of studying: reviewing content, doing questions, refining CARS\n\nGoal of a study buddy: accountability and someone to weather the storm with\n\nGoal Score: Above 506\n\nOther obligations: work as a lab tech\n\nAge/Gender: 22M",
            "Location (City, State, Country): Boston, MA  \nTest Date (or Anticipated): 6/1/2024  \nMCAT Prep Material: Uworld, AAMC, TPR, Kaplan, KA  \nOnline/In-Person/Both/No-Preference: Online  \nStage of studying/study plan: Done with content review. Been mainly doing practice problems and practice tests.  \nGoal of a Study Buddy: keep each other accountable and share tips. Sometimes vent about studying because tbh not much people from the outside understand what its like studying for this exam.   \nGoal Score and Realistic Score:  Goal 510, Realistic 504  \nOther obligations: I currently work as an MA.\n\nAge/Gender: 26F  \nOther Information/Ice Breakers: Basically been on and off studying for the MCAT since 2021.   About me is that I am all about cats and anime lol .",
            "**Location (City, State, Country):** Philadelphia, PA  \n**Test Date (or Anticipated):** 5/4/24  \n**MCAT Prep Material:** e.g. Kaplan books, UEarth, AAMC (all of it), Anki  \n**Online/In-Person/Both/No-Preference:** no preference  \n**Stage of studying/study plan:** done with content review and uWorld, doing AAMC material  \n**Goal of a Study Buddy**: keep each other accountable, share tips, just talk about the process honestly  \n**Goal Score and Realistic Score:** A goal: 520, B goal: 518, C goal: 515  \n**Other obligations:** part time volunteering daily  \n**Age/Gender:** 23F",
            "* **Location**: Long Island\n* **Test Date**: 5/11 but may reschedule\n* **MCAT Prep Material**: Kaplan books, *AAMC material, anki, jack westin questions* \n* **Online/In-Person/Both/No-Preference**: whatever works!\n\n* **Stage of studying/study plan**: doing practice questions and content review. planning on taking my first FL next week\n* **Goal of a Study Buddy**: keep each other accountable, share tips, cheer each other on\n* **Goal Score and Realistic Score**: \n* **Other obligations**: part time job, volunteering at my local hospital, volunteering at my fire department, and exercising\n* **Age/Gender**: 22F",
            "Location (City, State, Country): Vaughan (Toronto), ON, Canada\n\nTest Date (or Anticipated): Not registered but planning early summer\n\nMCAT Prep Material: Have Kaplan books but willing to get Uglobe\n\nOnline/In-Person/Both/No-Preference: In-person preferred but will do both\n\nStage of studying/study plan: Willing to start from beginning but have a good baseline knowledge of content\n\nGoal of a Study Buddy: Keep each other accountable, share tips and tricks, and make sure we all hit our goal mcat score\n\nGoal Score and Realistic Score: 520 goal, realistic 512-516\n\nOther obligations: Full-time job\n\nAge/Gender: 22M\n\nOther Information/Ice Breakers: I work in an endocrine clinic so if you need your hormones checked I can hook you up.",
            "Location (City, State, Country): Philadelphia, PA\n\nTest Date (or Anticipated): 06/1/2024\r  \n\r  \nMCAT Prep Material: e.g. Kaplan books,Uworld, Sketchy, AAMC\r  \n\r  \nOnline/In-Person/Both/No-Preference: both\r  \n\r\r  \n\r  \nStage of studying/study plan: e.g. 60% done with content review, took fl\r  \n\r  \nGoal of a Study Buddy: keep each other accountable, quiz each other, share tips, combine notes\r  \n\r  \nGoal Score and Realistic Score:  518 goal, 510 realistic\r  \n\r  \nOther obligations: 18 credit hours, research, shadowing, extracurriculars, family. part-time job\r  \n\r\r  \n\rAge/Gender: 23F",
            "Location: Atlanta, GA\n\nTest Date (or Anticipated): 5/10\n\nMCAT Prep Material: Kaplan books, Khan, AAMC, Uworld\n\nOnline or In-Person if schedules/locations align! \n\nStage of studying/study plan: Final month, AAMC material \n\nGoal of a Study Buddy: keep each other accountable/encourage each other, share tips, quiz each-other\n\nGoal Score and Realistic Score: Goal is 520+\n\nOther obligations: full-time student, research and clubs\n\nAge/Gender: 20F\n\nOther Information/Ice Breakers: Undergraduate neuroscience student interested in pediatrics and/or medical genetics. I love dancing, traveling and trying new vegan foods! I am also a novice crocheter, hoping to get better at it when I have more time :)",
            "**Required**:\n\n* **Location** (City, State, Country): Davie (Broward County), FL\n* **Test Date** (or Anticipated): Hopeful for June 2024\n* **MCAT Prep Material**: Kaplan books, AAMC, ANKI\n* **Online/In-Person/Both/No-Preference**: Both\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: Restarting studying, studdied for 6mo last year and was frying my brain\n* **Goal of a Study Buddy**: Keep each other accountable, quiz each other, share tips, combine notes\n* **Goal Score and Realistic Score**: 522 goal, 516 realistic\n* **Other obligations**: Full-time job, on-call every other weekend, family, boyfriend\n\n**Optional (100%)**:\n\n* **Age/Gender**: 24 F\n* **Other Information/Ice Breakers**: I'm interested in Truama or CT Surgery; I currently work in cardiac rehab and cardiac stress labs",
            "* **Location:**  Chesterfield, Virginia, USA\n* **Test Date** (or Anticipated): 06/01/2024\n* **MCAT Prep Material**: Princetonereview classes\n* **Online/In-Person/Both/No-Preference**:\n* **Stage of studying/study plan**: Trying to do my best\n* **Goal of a Study Buddy**: Share tips and keep a study check on each other. Or honestly anything that helps. \n* **Goal Score and Realistic Score**: 510 - 515\n* **Other obligations**: Part time job as Patient care technician In ER every Wednesday and Thursday. Princeton review classes on weekends. \n* **Age/Gender**: 24M\n* **Other Information/Ice Breakers:** I gave MCAT last year in 2023 didn't get a good score and really want to maximize this year. I like to play tennis also am good at it.",
            "Location:  Miami, FL, US \nTest Dat (or anticipated): 08/17/2024 \n\nMCAT PREP MATERIAL: Kaplan book set, UWORLD, JW, BP, AAMC, ANKI \n\nOnline/in-person/Both/preference: In person \n\nStage of studying plan: in content review for phase, but implementing Uworld to test knowledge. Will be taking a full length at the end of the month, and then one every other week in May. June will be a test every week up until my test date. \n\nGoal of study buddy: hold us accountable and support each other through the grind. It’s not easy and this process is discouraging, so having that person that understands goes a long way. \n\nGoal score: 517-522\n\nOther obligations: working on a project for my grad program but other than that this exam is my main priority. \n\nAge: 26 \n\nIce breaker: if you trying to study 10-12 hours and go grab brews after to celebrate the hard work, PM me. Currently taking a semester off from my masters in health administration program to focus on the exam. If you have interest in that side of health care I can put you on, I’ve worked in a hospital setting with patients as well.",
            "* **Location** Las Vegas, NV\n* **Test Date** 5/24/24\n* **MCAT Prep Material**: *AAMC, Khan Academy* \n* **Online/In-Person/Both/No-Preference**: np\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *done with content, 3rd party*\n* **Goal of a Study Buddy**: *keep each other accountable, quiz each other, share tips, combine notes*\n* **Goal Score and Realistic Score**: *Goal 517 Realistic 510*\n* **Other obligations**: *2 part time jobs* \n\n28 M",
            "* **Location** (City, State, Country): Chicago, IL\n* **Test Date** (or Anticipated): 05/04/24, but may reschedule for end of June / early July\n* **MCAT Prep Material**: Kaplan Books, Uworld Qbank, \"The Premed Consultants\", ANKI (milesDown)\n* **Online/In-Person/Both/No-Preference**: Both / No-preference\n* **Stage of studying/study plan**: Content review with question banks\n* **Goal of a Study Buddy**: *keep each other accountable, quiz each other, share tips, combine notes*\n* **Goal Score and Realistic Score**: 515 goal, 510 realistic\n* **Other obligations**: 4 credit hours (and then no summer obligations!)\n* **Age/Gender**: 31 M\n* **Other Information/Ice Breakers**: I'm a non-traditional applicant with a B.S. in Computer Science. Making a career swap I want to do emergency medicine.",
            "**Location**: Canton, Michigan, USA\n\n\r**Test Date**: July - September (Anticipated)\r\n\n**MCAT Prep Material**: UWorld, Altius, and AAMC\r\n\n**Online/In-Person/Both/No-Preference**: Online\r\n\n**Stage of studying/study plan**: I am currently focusing on reviewing practice questions and FL-exams\r\n\n**Goal of a Study Buddy**: I'm hoping to connect with someone who has or is working on maintaining a consistent schedule. I find that consistency and discipline are key challenges for me, and I believe having a supportive study partner could really help us both stay on track\r\n\n**Goal Score and Realistic Score**: 524 goal, 510 realistic\n\n**Other obligations**: none, studying full time\n\n**Other Information/Ice Breakers**: I'm a re-taker. I'm hoping to connect with fellow students who, like me, have the flexibility to maintain regular communication. Consistency is key for me in preparing for this exam, and I believe having a supportive study group will help us all stay disciplined and motivated",
            "I'm in Albuquerque, New Mexico. USA\nI will test 5/24/24\nI have uworld, blueprint, and I will get the AAMC material \n\nI have mainly done content, and I am simply reviewing it while I prioritize practice questions and exams\n\nI ideally want to do some questions together or review FLs together, so I can pick up some other tricks on the MCAT and maybe collaborate on some strategies for the exam. \n\nMy goal score is 515, but realistically I'm looking at a 510\n\nI work as a tech, and I lift \n\nI'm 23M",
            "**Location** : San Diego, CA\n\n**Test Date** : 5/16\n\n**Material:** Kaplan books, UWorld, Anki, AAMC \n\nNo-Preference, probably Online\n\n**Stage of studying/study plan:** done with content review, Working mainly on AAMC material/FLs\n\n**Goal of a Study Buddy:** Short term(1mo out), keep each other accountable, quiz each other, share tips, Figure CARS out/Strategies for other sections, Focus on improving struggling sections\n\n**Goal Score and Realistic Score:** Goal 518, Realistic 512\n\n**Other obligations:**  extracurriculars, family, part-time job(EMT), Lots of Volunteering\n\n**Age/Gender:** 26M\n\n**Other Information/Ice Breakers:** Applied last cycle, retaking to improve my score, graduated from UCSD, go tritons",
            "* **Location** (City, State, Country): Research Triangle, NC\n* **Test Date** (or Anticipated): June 15, 2024\n* **MCAT Prep Material**: UW, AAMC (all of it), Anki, Sketchy\n* **Online/In-Person/Both/No-Preference**: online and/or in person\n* **Stage of studying/study plan**: mostly taking practice questions, some content review\n* **Goal of a Study Buddy**: keep each other accountable, quiz each other (testing effect), explain concepts (Feynman technique), share tips\n* **Goal Score and Realistic Score**: as high as possible \n* **Other obligations**: I work as a medical assistant 40 hours/week.\n* **Age/Gender**: 25M\n* **Other Information/Ice Breakers**: I am happy to provide support. Having a study buddy/group can make the process so much more enjoyable and productive. Feel free to shoot me a message. Thank you.",
            "Location: Long Island, NY (Nassau County)\n\nTest date: 6/1\n\nPrep Material: Kaplan Course; AAMC material\n\nPreference: in-person\n\nStage: content review/question banks…starting in May I’ll test every Friday but I’ll continue with content/questions around my FL reviews\n\nGoal: keep myself accountable and on task while studying….i keep getting distracted! I have adhd and find that having a body double present just keeps me focused!\n\n\nGoal Score: 512-515; realistic 505-508\n\nOther obligations: working at OB/GYN office Monday and Wednesday \n\nAge/Gender: 22F\n\nOther info: I’m extroverted, I like working out, I love working in women’s health, and my mindset is pretty “go with the flow” for this test, so I’m trying to stay grounded and not become too neurotic! I don’t want to loose myself in this test :)",
            "Location: Phoenix Az\n\nTest Date: July 26th\n\nMCAT Prep Material: Kaplan, Khan Uworld and AAMC\n\nStage of Studying Plan: I am starting my content review today, I plan to finish in a months time\n\nGoal of a study buddy: I want to keep everyone on a same schedule so we can do problems together and help cover each others weaknesses\n\nGoal Score:520, 515 Realistic\n\nCurrent obligations: Currently TA organic chem and physics, currently working as a scribe part time for ortho clinic\n\nAge/gender: 26M\n\nOther info: I'm a non trad, former software engineer attempting to make the switch to med school. I currently TA chem and physics at a university and am friendly, and am good at teaching. I want to build a good community to study together and I have experience taking competitive exams. Send me a dm and comment below, I can add on discord or whatsapp or telegram as well. We can do it together!",
            "Location: Edmonton, Alberta, Canada\n\nTest date: Finish prep by Sept and write a couple FLs but exam won't be till next year.\n\nMCAT Prep Material: TPR, KA, youtube, Anki, UEarth\n\nOnline/In-person: I prefer in person but online works too.\n\nGoal of a study buddy: Accountability.\n\ngoal score: 520\n\nCurrent obligations: Full time job (I am free two-three days a week)\n\nAge/Gender: 22 M\n\nOther info: I am a fourth year nursing student.",
            "**Location**: Socal California\n\n**Test Date**: June 22nd\n\n**MCAT Prep Material**: Kaplan, Anki, UWorld, AAMC, Altius, Jack Westin, 86page doc\n\n**Online/In-Person/Both/No-Preference**: Discord or any other\n\n**Stage of studying/study plan**: Almost done Full Content review, now on  just Exams and Questions AAMC material and Altius\n\n**Goal of a Study Buddy**: keep accountable, Mini cram sessions a day, Learn and Improve skills, maybe even reading comprehension skills, especially harder subjects, be supportive/keep motivated.  About 2-3 hours can study together and do active studying together.\n\n**Goal Score and Realistic Score**: Want a 518+ realistic is 510-12\n\n**Other obligations**: Self studying, Tuturoring, A mentor\n\n**Age/Gender**: 26M\n\n  \nOther Quirks: Social, excellent hype man, mentor/motivation speaker for many programs,",
            "**Location**: Chicago, IL\n\n**Test Date** (or Anticipated): *6/22/24*\n\n**MCAT Prep Material**: *ANKI, UPangea, AAMC*\n\n**Online/In-Person/Both/No-Preference**: Online\n\n**Stage of studying/study plan**: *Done w/ content review, just moved to UPangea and will take first practice test soon*\n\n**Goal of a Study Buddy**: *Looking for someone to help with tips and tricks, use each other's knowledge to fill in content/concept gaps*\n\n**Goal Score and Realistic Score**: *503 on first attempt, looking for 510+*\n\n**Other obligations**: *None as of now*\n\n**Age/Gender**: *25M*\n\n**Other Information/Ice Breakers**: *For some reason I'm really talented in the P/S section but really looking to improve everywhere else*",
            "Location: New Jersey\n\nTest date: June 22, 2024\n\nMCAT Prep: Princeton Review \n\nStages of studying/study plan: just started on May 4th\n\nGoal of a study buddy: keep each other accountable and learn from each other \n\nAge: 26",
            "* **Location**: Bay Area, CA\n* **Test Date**: 06/22/2024 *registered but may reschedule*\n* **MCAT Prep Material**: *UEarth, AAMC (all of it), Khan Academy, TPR review book*\n* **Online/In-Person/Both/No-Preference**: online/no preference\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**: *Finished reading TPR & watching KA, will start on UEarth & AAMC*\n* **Goal of a Study Buddy**: *keep each other accountable, motivation*\n* **Goal Score and Realistic Score**: 520+ *goal, 510 realistic*\n* **Other obligations**: *full-time job (9-5)*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *23F*\n* **Other Information/Ice Breakers**: *Please share any nice cafes or libraries that open late. I like switching up my study space when I can.*",
            "Location: Hamilton, Canada  \nTest Date: June 1st 2024  \nMCAT Prep Material: Princeton/UWorld  \nOnline  \nStage of Studying: Content Review & Practice Questions (Hybrid)  \nGoal of a study buddy: Keep each other accountable & encouraged (not necessarily exactly studying together - but I need someone to be like YO, WE NEED TO DO WORK).   \nGoal Score: 510+  \nOther Obligations: Literally stopped everything to do this. I need to grind like 12 hours a day and I need someone to do this with!! So tired of this and I gotta kill it.   \nAge/Gender: 22M  \nOther Information: Discord? :)",
            "Thank you for sharing!",
            "Location: Toronto, Canada\n\n Test Date: Late July\n\nMCAT Prep Material: Kaplan/UWorld\n\nStage of Studying: Content Review & Practice Questions\n\nGoal of a study buddy: Keep each other accountable & motivated (at least a weekly check-in and maybe even testing each other).\n\nGoal Score: 518+\n\nOther Obligations: Research (10h/week)\nAge/Gender: 23M\nOther Information: Prefer Discord",
            "* **Location** (City, State, Country): *Brampton, ON, Canada*\n* **Test Date** (or Anticipated): *17 August 2024*\n* **MCAT Prep Material**: *Kaplan Books, Anking, Uworld, KA P/S 300pg doc, AAMC materials*\n* **Online/In-Person/Both/No-Preference**: *No-preference, dependant on distance*\n\n* **Stage of studying/study plan**: *started a little content review, full sending on schedule tomorrow*\n* **Goal of a Study Buddy**: *keep each other accountable and motivated, share tips, help out*\n* **Goal Score and Realistic Score**: *520+ goal, 515 realistic*\n* **Other obligations**: *none at all*\n\n* **Age/Gender**: *20M*\n* **Other Information**: can exchange socials in DMs",
            "* **Location** (City, State, Country): *San Antonio, TX* \n* **Test Date** (or Anticipated): *September 14*\n* **MCAT Prep Material**: *Kaplan books, Jack Westin, UWorld, AAMC, Anki* \n* **Online/In-Person/Both/No-Preference**: *Depends on distance*\n* **Stage of studying/study plan**: *Just starting the content review* \n* **Goal of a Study Buddy**: *Helping each other focus, holding each other accountable, asking questions, sharing tips/strategies, and to vent lol* \n* **Goal Score and Realistic Score**: *idk but I’m aiming for 520+* \n* **Other obligations**: *Part time EMT and volunteering*\n* **Age/Gender**: *21M* \n* **Other Info**: *My attention span is fried so heavy emphasis on the helping each other focus*",
            "Location: San Diego, California \n\nTest Date: September 5, 2024\n\nMCAT Prep Material: ANKI (MilesDown), AAMC, Blueprint 515+ \n\nGoal of a Study Buddy: I’d like to study with someone online or in person to help each other out on stuff we don’t understand, share resources if needed. Also to keep each other accountable on daily goals. \n\nStage of studying/study plan: I took my diagnostic last week and I started content review this week. \n\nGoal Score and Realistic Score: My goal is a 520 but realistically 515-517\n\nOther obligations: I just quit my job to fully focus on studying. \n\nAge/Gender: 23F\n\nOther Information/Ice Breakers: I love to bake and make food! I have my small business of baked goods. I started to work out again because it is like therapy to me, I really enjoy it. I graduated from UCSD last year and have 2 huskies. I grew up with brothers so I love anime since I was a toddler lol.",
            "Closed Now  \n  \nLocation: Berkeley, California  \nTest Date: September 5, 2024  \nMCAT Prep Material: Kaplan Books, Jack Westin. Intend to get Uworld later down the line. Still considering more options\n\nOnline/In-Person/Both/No-Preference: Online\n\nGoal of Study Buddy: Regularly scheduled meetings for active discussion of recently reviewed topics. Ideally, identifying high yield areas within each topic, the best ways to study for them, and which additional resources may be useful.\n\nStage of studying: Content review\n\nGoal Score: As high as possible, realistically 520\n\nOther obligations: Remote volunteer work. Otherwise, it is just studying\n\nAge/Gender: 22M\n\nOther Information/Ice Breakers: Used to do creative writing as a hobby. On Biochemistry for content review at the moment.",
            "Location: Richland, Washington \n\nTest date: June 22, 2024 \n\nMCAT Prep Material: Kaplan, quizlet, AAMC \n\nOnline/In-Person/Both/No-preference: No preference \n\nStage of Studying: currently a lot of content studying and practice questions.\n\nGoal of a Study Buddy: I just need a different point of view for a lot of the content. It might help me retain more information. \n\nGoal Score and Realistic Score: 510 goal score but realistically I’m just hoping for a 505. \n\nOther Obligation: I work part time, 24 hours within the week. Luckily I work 12 hour shifts, it means that I have a lot of available time throughout the week to study. \n\nAge/Gender: 28F \n\nOther Information/Ice Breakers: I have an orange cat and I think he only has 2 brain cells. I’m taking the MCAT a second time, hopefully this time around I’m less anxious with everything.",
            "* **Location** : *Minnesota*\n* **Test Date** (or Anticipated): *September 2024*\n* **MCAT Prep Material**: *Planning on starting Kaplan, uworld, anki. Currently using blueprint*\n* **Online/In-Person/Both/No-Preference**: Online is probably better\n\n* **Stage of studying/study plan**: *Just started, in content review*\n* **Goal of a Study Buddy**: *e.g. keep each other accountable, share tips*\n* **Goal Score and Realistic Score**: *goal 515*\n* **Other obligations**: *6 credit hour classes (taking biochemistry course right now), volunteering. nothing else*\n\n* **Age/Gender**: *21F*\n* **Other Information/Ice Breakers**: *A lot of my content review will be me learning things for the first time lol.*",
            "* **Location** (City, State, Country): Singapore\n* **Test Date** (or Anticipated): August 2024\n* **MCAT Prep Material**: Kaplan \n* **Online/In-Person/Both/No-Preference**: No preference\n* **Age/Gender:** 21/F",
            "* **Location** (City, State, Country): *Boston, Massachusetts*\n* **Test Date** (or Anticipated): *August 27, 2024*\n* **MCAT Prep Material**: *Kaplan Books, Anki, Uworld, KA P/S 300pg doc, AAMC materials, Blueprint*\n* **Online/In-Person/Both/No-Preference**: *No-preference*\n* **Stage of studying/study plan**: *Started content review and some CARS*\n* **Goal of a Study Buddy**: *Keep each other accountable, study tips*\n* **Goal Score and Realistic Score**: *520 goal, happy with a 510*\n* **Other obligations**: F*ull time PCT until late June and remote volunteering, then full send until exam*\n* **Age/Gender**: *20F*\n* **Other Information**: I'm a Biochemistry major :)",
            "Location: Cleveland, OH\n\nTest date: 8/24 or 9/1\n\nPrep Material: Kaplan books, exams, and AAMC material\n\nPreference: in-person, virtual sometimes\n\nStage: question banks, just did first FL and am looking to improve a lot in the next few weeks\n\nGoals:\n\n1. Body doubling/keeping myself motivated for longer study periods\n2. improving retention; i enjoy talking about content with other people since it keeps the information clear, and teaching other is a good way to learn content.\n3. (less important/prominent) sharing advice and tips on this process\n\nMethods: meet once a week and increase if we think its a good idea. We'd study in silence for maybe 2-4 hours and quiz each other for 20-30 minutes at the end of the time on what we learned and play-practice at teaching the content to the other person\n\nGoal Score: as high as possible\n\nOther obligations: family responsibilities, being abroad for vacation for a bit and working 20 hours a week as PCNA\n\nAge/Gender: 20F\n\nOther info: I love rock climbing, playing tennis and just being outdoors, I have a lot of random interests and am very passionate/hyper about them",
            "Location: Brooklyn, NY\nDate: expecting to take it January 25\nMCAT prep materials : Kaplan and Princeton Review Books, Uword, MCAT king\nPreference: I would love to be able to study in person, but online works as well! \n\nStage of study: taking second time officially, so haven’t really made a plan to study yet, kinda feeling lost\nGoal of study buddy: keep each other accountable, be able to explain each other and quiz each other, share some advice/tips, and anything else they would like\nOther Obligations: might start part-time job soon, for now more like flexible till August (going to travel) \n\nAge/ Gender: 21/F\nOther: I’m very clingy, sorry 😭",
            "Dallas, Texas \nEnd of July   \nKaplan books, anki, u world AAMC \n24 M",
            "* **Location**: Wailuku, HI\n* **Test Date**: March/April 2025 (aiming for March 22)\n* **MCAT Prep Material**: Kaplan books, Anki, Uworld (free trial as of now), considering Blueprint MCAT course\n* **Online/In-Person/Both/No-Preference**: No preference\n* **Stage of studying/study plan**: Looking at several MCAT prep courses. I've started to go through the Kaplan books. Gauging how much information I've remembered from college.\n* **Goal of a Study Buddy**: To have someone to talk to and make sure we're both being accountable of each other. Also is super nice to study with another person instead of by self just based on experiences with group assignments and exams haha.\n* **Goal Score and Realistic Score**: 520, realistic is 510\n* **Other obligations**: full time job as a medical scribe\n* **Age/Gender**: 21M\n* **Other Information/Ice Breakers**: I love to go explore the outdoors! You'll find me either playing basketball at the courts or hanging out at the beach. I also just graduated from Washington State University as a Bio major :)\n\nPlease please please reach out! I'm more than happy to get to know some of you and hopefully study together!",
            "**Location:** Boston and New York\n\n**Test Date:** August 23, 2024 (OR January 26, 2025)\n\n**MCAT Prep Material:** Princeton, U-World, AAMC\n\n**Online/In-Person/Both/No-Preference**: Online, Depends For In-Person (Closer To Test Date)\n\n**Stage of Studying/Study plan:** Set Baseline, Question Banks, Content Topic Review, Practice Exams\n\n**Goal of a Study Buddy:** Accountability, Consistency In Meeting Together, Discussion Of Questions, Sharing Materials and Tips\n\n**Goal Score and Realistic Score:** 502 For Average and Obviously 517+\n\n**Other obligations:** Classes, Research, Family\n\n**Age/Gender:** 21F\n\n**Other Information/Ice Breakers:** Biology Major, I'm interested in doing group study sessions virtually, and of course open to having one or multiple study buddies, looking forward to meeting other pre-meds!",
            "Location (City, State, Country): Los Angeles, CA.\n\nTest Date (or Anticipated): 6/22/24\n\nMCAT Prep Material: UEarth, AAMC (all of it)\nOnline/In-Person: Either!\n\nStage of studying/study plan: AAMC materials now!\n\nGoal of a Study Buddy: Just someone to get across the finish line with. It’s been a tough road and could use a buddy whether it’s studying, sharing tips, or encouraging each other even if it’s just a quick “you got this!” text.",
            "* **Location:** chicago, il\n* **Test Date:** aug 24, 2024\n* **MCAT Prep Material**: kaplan books, Uworld, JW, AAMC eventually\n* **Online/In-Person/Both/No-Preference**: online\n* **Stage of studying/study plan**: early content review\n* **Goal of a Study Buddy**: motivation, tips and tricks, mental sanity\n* **Goal Score and Realistic Score**: 510 diagnostic, 528 goal, 520 realistic\n* **Other Information/Ice Breakers**: some artists on my mcat study playlist are kendrick, frank ocean, sza, and steve lacy",
            "**Location:** Princeton, NJ\n\n**Test Date:** September 13, 2024\n\n**MCAT Prep Material:** Kaplan books, KA, Anki (MilesDown, Pankow, Anking), UWhirl, AAMC Official\n\n**Stage of Studying/Study Plan:** 20% into content review. Finishing with gen chem and about to hit physics. Doing UWhirl as part of content review to check understanding.\n\n**Goal of Study Buddy:** primarily accountability and teaching each other/sharing lessons learned.\n\n**Goal Score:** 520\n\n**Other Obligations:** hospice volunteering.\n\n**Age/Gender:** 23 M\n\n**Other Information:** I am a compulsive procrastinator and beat myself up over it. It keeps me on task, but has a negative effect on my mental health. I do better when  I am inspired through collaboration.\n\nI am a big fan of research in neuroscience and will be going overseas for a research masters after taking the MCAT. Would love to talk about research as well. I want to apply MD/PhD next cycle--hopefully I feel the same way after my MCAT score comes out. Lol.",
            "* **Location**: New Caney, Texas \n* **Test Date**: 7/13/24\n* **MCAT Prep Material**:  *UWORLD , AAMC MATERIALS , KAPALAN BOOKS , YOUTUBE , KHAN ACADMEY*\n* **Online/In-Person/Both/No-Preference**: Would love to meet in-person(if okay) , or online is fine\n\n**Optional (but recommended)**:\n\n* **Stage of studying/study plan**:  *Just took first exam , mainly doing questions on uworld and just now starting aamc* \n* **Goal of a Study Buddy**: *keep accountable and share study tips or tips we have found successful in sections*\n* **Goal Score and Realistic Score**:  *Goal : 503 , Realistic: 500* \n* **Other obligations**:  *im off the whole summer until my test so all im doing is this. Im in the library everyday but sunday*\n\n**Optional (100%)**:\n\n* **Age/Gender**: *25M nontrad*\n   * **Other Information/Ice Breakers**: intestered in ortho , I plan on only applying DO,  former college athlete(football) and anime head ,   married! and currently a teacher hoping for this to be my last year before medical school.",
            "**Location**: Honolulu, HI\n\n**Test Date** (Anticipated): July 26, 2024 (currently signed up for Aug 4)\n\n**MCAT Prep Material**: Kaplan, AAMC, Anki, (hopefully) UWorld\n\n**Online/In-Person/Both**: Would love love to have an online/in-person buddy\n\n**Stage of studying/study plan**: done with content review, took 2 FL (results we don't talk about oop)\n\n**Goal of a Study Buddy**: keep each other accountable, quiz each other (esp on Chem and Phys), share resources\n\n**Goal Score and Realistic Score**: 520",
            "letsgo",
            "**Location** : Orange county, California\n\n**Test Date** : 8/2/2024\n\n**MCAT Prep Material**: *Kaplan + Anki + Uworld + Jack Westin + Blue print + AAMC*\n\n**Preference:** Online\n\n**Stage of studying/study plan**: *UWorld + Anki + starting AAMC*\n\n**Goal of a Study Buddy**: *Accountability and encouragement!* \n\n**Goal Score and Realistic Score**: *520+*\n\n**Other obligations**: *research, part-time job, volunteering*\n\n**Age/Gender**: *21F*\n\n**Other Information/Ice Breakers**: *I love concerts + cafes + soccer + golf!*",
            "[deleted]",
            "*  Location: Minneapolis,Minnesota,United States, also in Los Angeles,CA + Claremont for the summer.\n*  Test date: November 13 \n* *U* Earth, Kaplan, Anki deck , Blueprint, U world \n* no preference can be online or in person :) \n\n* **Stage of studying/study plan**: *Starting content* review *this week* \n* **Goal of a Study Buddy**: *. keep each other accountable, quiz each other, share tips, combine notes*\n* **Goal Score and Realistic Score**: *525 goal ,* realistic 519?\n* **Other obligations**: summer research intern , taking a few summer classes however \n\n* **Age/Gender**: *20 F*\n* **Other Information/Ice Breakers**: Biomedical engineering major, I love dogs !",
            "Hi all, I'm hoping to find a few people to work on uworld passages with. If interested, here is a [link to a discord group](https://discord.gg/4nDPy3Dz) where we can schedule a time to meet up. CARS is my worst section according to my diagnostic. So if anyone wanted to go over the daily JW passage I'd be game for that too.",
            "• Location (City, State, Country): San Antonio, TX USA\n\n• Test Date (or Anticipated): Sometime in the spring of 2025\n\n• MCAT Prep Material: Kaplan books, UEarth, AAMC FL, Jack Westin, 300pg. P/S doc, and Anki (JS deck).\n\n• Online/In-Person/Both/No-Preference: Probably online.\n\n• Stage of studying/study plan: Started content review but it's slow going and I'm sort of stuck :/\n\n• Goal of a Study Buddy: Keep each other accountable, share tips, encouragement\n\n• Goal Score and Realistic Score: 515 goal, 511 realistic\n\n• Other obligations: classes, family, officer position for a club.\n\n• Age/Gender: 21F \n\n• Other Information/Ice Breakers: I am a microbiology major (senior) who loves classic rock and movies! I am interested in emergency medicine and surgery.",
            "Commenting so I can post",
            "Spokane WA\n\nTest date: July 26th \n\n  \nMaterial: Altius, AAMC, KA, Jack Sparrow",
            "* ***Location:*** *Dallas, Texas*\n* **Test Date** 9/14\n* **MCAT Prep Material**: *Princeton books, Uworld, AAMC, JW*\n* **Online**\n\n* **Stage of studying/study plan**: *Halfway* thru *content*\n* **Goal of a Study Buddy**: *Keep each* other accountable*, talk, etc*\n* **Goal Score and Realistic Score**: *520 goal, 515 realistic*\n* **Other obligations**: Research, Volunteering \n\n* **Age/Gender**: *21M*\n* **Other Information/Ice Breakers**: Want *to go into cardiology. Love playing tennis, going to the gym, and running. Feel free to hmu.*",
            "* **Location** South Florida \n* **Test Date** (or Anticipated): 9/14/24 or early next year (not scheduled)\n* **MCAT Prep Material**: Kaplan books, Altius exams, will repurchase UEarth and AAMC eventually \n\n* **Online/In-Person/Both/No-Preference**: open to see what works \n* **Stage of studying/study plan**: retaking , but want to start over from scratch and do some heavy content review (I need it)\n* **Goal of a Study Buddy**: MAJOR ACCOUNTABILITY, help with motivation and discipline, learn topics together, review full lengths, etc.. \n* **Goal Score and Realistic Score**: 513 goal, 509 realistic??\n* **Other obligations**: full time job 😵‍💫, boyfriend, family sometimes \n\n* **Age/Gender**: 25F\n* **Other Information/Ice Breakers**: I have a masters in biological sciences, used to work in research lab and would like to find a job in that again while I study, have a cat I love.",
            "Hi I feel like my story is so similar to yours! Would love to chat, also taking my test in April:)",
            "My exam will be on April 26, 2024, as well",
            "You got this! Exercise definetely keeps my brain alive when I study",
            "Just dm'd you!",
            "Pmed you as well !",
            "hey PM me if u stil down to make a study group",
            "PM me I am testing same date",
            "hii i’m 23f also interested in derm, using the same prep materials - testing in may though, would still love to chat/study together!",
            "PMed you! :')",
            "I also want to do neurology!",
            "Hi, my test date is on August 17. Did you take it? How was it?",
            "PM me I am testing same date",
            "PM me if anyone is in Queens, NY. My exam date is May 11 2024.",
            "would love to have an accountability buddy and quiz each other!!",
            "If you got a 521, tell me your secrets!",
            "Hey, I’m from LI and taking the exam this month as well (06/15). Still looking for a study/accountability partner?",
            "I'm from San Juan!! I plan on testing in April though and we're like 30 mins away from each other. Maybe we can work something out to help each other out or at least keep each other accountable? Pls lmk!!",
            "Hello! I’m from TX too and I’m looking to test in June-July. I’d be interested in studying together!",
            "Hi, I am just starting too and I will be writing mine in Sept/Oct 2024, I will prefer online because I am in Arkansas.",
            "Hi, I am looking to take the exam around the same time! Are you okay with online (because I’m in the north east)?",
            "Hey! I am not from the Texas area but I would love to study with you. I think we both learn in similar ways so it may be helpful to kind of teach each other or talk through topics. I just started with my content review and would love to be your study buddy if you are interested.",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey, I’m in NC testing the 24th of September and just started hitting it hard this week. Throwing it out for a general NC group; virtual meetup is cool, too",
            "Have you found a study partner yet?",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "hi im from edmonton alberta. i am also taking my exam in september.",
            "Hi! I'm testing in September as well. Are you still looking for a study partner?",
            "Hi, I am also from Houston, but have a later test date. I would love to talk about how your test prep is going.",
            "Hey did you already take your exam?",
            "Hi, are you still open to online, I hope to write my exam in Sept/Oct 2024, I am just starting.",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "i’m also in los angeles and starting review!!",
            "Hi, I am taking it in May and live in the bay. I am a 22F also working full time and would like to achieve the same goals as you would by studying together. I am from the Bay area.",
            "Hi I am taking it this June! I live in San Gabriel area!",
            "hey i would love to chat, sent you a DM",
            "Sent a pm!",
            "I’m also in Dallas! \n26F \nTaking exam second time around in April but most likely to change to early May.",
            "In Dallas if anyone's still looking for one!",
            "messaged you! :)",
            "Hey! I'm also in south florida, 24f, and taking the exam late april! Send me a message and lets plan something out!",
            "Hi! I am also in South FL and testing 4/27. I'm okay with meeting at a library or studying on zoom. Feel free to PM!",
            "I take it on the 27th here in California!! Good luck 😭 I know I’m scared.",
            "Hi! My goal is the same around yours lol! I’m also based is htx. Lmk if you need a consistent study bud but I am testing a bit later! Just started aamc material :))",
            "omg I'll be taking it in June, hoping to apply this cycle but also a queer peruana good luck with everything and please feel free to connect :)!",
            "hey, we could connect :)",
            "Idk if you’re still looking for a study buddy but I PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey, still looking for a buddy? DM me to let me know! I am also latina with an MPH <3",
            "Hi! I'm testing in September as well! Are you still looking for a study partner?",
            "I’m a 31F also battling gnarly undergrad grades! Let’s connect!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hi there still looking for a study partner? Message me if so. Happy studying!!",
            "Hey! are you still lookng for a study partner? Also testing sep 13, similar goals <3 Im 27F, Latina, have a Masters in Public Health and did neuroscience/ psychology in UG <3 DM me!",
            "Hi, I am in Arkansas but i am okay with online, can I DM",
            "Dangg I’m testing in plantation Florida in June.",
            "Buddy we have exam on the same day! How is your prep?",
            "I'm based in Long Beach, CA!",
            "Hi! I am in Miami, FL but I am sort of in the same stage of studying as you and online could work if you're open to it",
            "Interested if you are! I'm located in the IE",
            "Hey if your still looking for a partner I would love to connect. I also have ADHD ! I am taking the exam 08/02 for the first time. I just took my diagnostic today!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 and am in Orange County btw",
            "Feel Free to PM me btw.",
            "Also in Dallas if anyone's still looking for one!",
            "Hi!! Message me if you're still interested!! I'm in portland as well",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Feel free to pm me. Im interested in a study group.",
            "Hi! I'm testing in September as well. Are you still looking for a study partner?",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey! Still looking for a buddy? DM me!",
            "Hey I’m taking the same test day! Let’s make a group chat or something!!",
            "also from van and looking for a study buddy!",
            "You guys looking for one more? I'm also in Van",
            "Hi are you still looking for a study buddy? I'm in van as well",
            "In van as well if you're making a group!",
            "Idk if you’re still looking for a study buddy but I PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "im from edmonton alberta. ill be taking my exam on sept 6. and i am also looking for a study buddy.",
            "Hi this is Ryan, I am also taking it on that date and I am also in LA.  This is my number 6267594429",
            "Hello \nI am not sure if you found someone but I am interested. I am planning on taking the exam In august. I am starting up again.",
            "Interested",
            "Idk if you’re still looking for a study buddy but I PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Can we do this, I am also starting, and I hope to begin fully in April.",
            "Hi!! I am also starting and would be super down to study with you!",
            "I would love to be part of this loop as I am behind schedule; I believe I messaged you guys individually!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey Planning to take the exam in August, let me know in private msg if you are still looking for a study partner. Happy studying!!",
            "I dm'ed you!",
            "Hi, I am a 22F taking the exam in July and also located in Toronto, are you still looking?",
            "If you still want to study lmk!",
            "Hi! I'm testing around that time as well + am from Toronto (Mississauga)! Are you still looking for a study partner?",
            "Hi, If your still looking for a partner I would love to chat :)",
            "Hey I would love to study together. I also live on the East Coast so I am sure we can find a time that works for the both of us.",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Me too let’s make a groupchat or something for the same test date!!",
            "Hey there, I'm from Toronto and I gave the MCAT a go this September and got a score very close to your goal score, but I will, unfortunately, have to re-write the exam (for Ontario schools' stupid CARS requirements arghh, I hate this!). I've currently booked my exam for the end of April (which would give me enough time if I hear back negative from my apps in Feb). Please let me know if you'd like to study together!",
            ">EC books, UEarth, AAMC\n\nHi, I am down, from Edmonton,  I can do it online :) this is my first time studying for MCAT as well. I work full-time and do some volunteer for AHS.",
            "Hi! I am also doing a JW course, and it seems like we started around the same time. I am almost done with content (finishing psych) and will be moving on to practice. Let me know if you want to chat more! I am also in Canada but from Ontario, so remote works better.",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey I’m also in NC! how’s you prep going so far?",
            "Hi! My test date is 3/9/24 and I am aiming for 512-515 range as well! I work night shift as a PCA part-time and would love an accountability buddy too! I tend to study mostly at night. If you or anyone else wants to be accountability buddies, PM me!\n\nAge/gender: 22F",
            "I PM'ed you",
            "I am interested",
            "Pm’ed you!",
            "Hey Im in the metro Detroit area looking for MCAT study  partner. I don't know how to use reddit.",
            "I messaged you :)",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey! i’m also just starting content review. Pm if interested.",
            "Same could do zoom. Feel free to PM!",
            "I am interested",
            "Interested!",
            "I’m down to study together, pretty much have the same work load and just starting mcat prep. Feel free to dm me.",
            "I’m interested",
            "Hiiii are u still looking for a study buddy??",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "I'm from Ohio (cinci) too and I work as a PCA in the ICU! I'm taking mine March 9th and I really need an accountability buddy if ur still up for it!",
            ">Rude\\_Win\\_8033\n\nDMed you",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Wait there’s a September 24th date??",
            "Hi there, have you found a study buddy already?",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hi! I'm a non traditional candidate too and would love to help. Are you still looking for a study group?",
            "PM",
            "Hi! I was going to test 5/24 but rescheduled to 6/27 for a little extra time. I'd love to help each other stay accountable and share resources if you're still looking for a buddy. I really like talking through topics and drawing things out, if it would interest you. I'm in Minnesota so online works for me. 25 F",
            "25F in NC, finished a post-bacc last year and now WFH and studying hoping to take it 6/1, please feel free to dm!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hi! Still looking to connect with a study buddy!",
            "I’m interested ",
            "PM",
            "Hey, I am in richmond as well (chesterfield). I would like to be a study buddy. I just posted my info today. I just DMed you. \n\nThanks.",
            "Hey there, found a study buddy yet? If not, message if still interested I am planning to take the exam in August. Happy studying!!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 and struggle w adhd",
            "I'm also in Buffalo, NY studying for the MCAT. PM me!",
            "Hey! Would love to connect if you’re still looking for an  MCAT buddy. I’m also 22F in Chicago",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "25F same location but will be testing 6/14! Feel free to connect though :)",
            "i'm taking it in aug too! i'm new to reddit but i'll try to pm",
            "Also in Florida! I’m struggling to stay motivated with working 40+ hrs a week :(",
            "Also in Florida",
            "[deleted]",
            "Location (Manhattan, NY, USA).\n\nTest Date September or fall 2024\n\nMCAT Prep Material: e.g. Kaplan books, Jack westin,I will get AAMC and blueprint when its 2-3 months close to exam date\n\nOnline/In-Person/Both/No-Preference: in person and online \n\nOptional (but recommended):\n\nStage of studying/study plan: e.g. Started content review with Kaplan books but haven't been consistent because of winter class which ends 1/23/24\n\nGoal of a Study Buddy: e.g. Heavy on accountability partner, I need someone to remind to be on my toes and vice versa.\n\nGoal Score and Realistic Score: e.g. 515 goal, 510 realistic\n\nOther obligations: e.g. 6 credit course for spring semester begins 1/25/24 ends 5/22/24 \n\n9 credit summer courses begins ( 6/3/24 ends 8/3/24). \n\nFamily - I am the eldest of an immigrant household so basically 2nd mom to 3 younger siblings \n\nOptional (100%):\n\nAge/Gender: e.g. 23F as of February \n\nOther Information/Ice Breakers: e.g. I like kpop songs, kdrama and bollywood movies ",
            "Hello! I am interested. Would love to study together sent a DM!.",
            "Hii, I live in Manhattan, NY and work full time. Would love to be a study buddy, please DM!",
            "Hey! I am looking for a study group I am in the Palo Alto area. 22F with a full time lab position- taking the test 5/10/24",
            "Hey! PM me—I feel we would be a good fit!",
            "Hey! I'm in a similar situation with material (engineering 3rd yr in MA, self learning orgo and biochem). Aiming for May 24th date but haven't scheduled. Aiming for 520 or more, main material right now is KA, Anki and Kaplan books but hopefully more as the date gets closer.",
            "pmed you!",
            "interested! check your dm!",
            "Hey I have the Same test date, I’m using uworld rn. I would love to have some online study sessions or In person as I am in NC. 21M.",
            "Hey, I’m in North Carolina as well. We should study together",
            "Hey I think we would be a good fit! I’m testing on April 26 or 28. And I have same resources too! I’m a 22f from South Georgia",
            "Hi, I will be testing during the second week of May and also live in Maryland. just started studying and would like a study buddy or study group.",
            "I'm in Long Beach, CA! pmed :)",
            "We are literally the same person. I just PM'd you! Let's work and do this together.",
            "SAME. I PM'ed You",
            "same! I've just PM'ed you",
            "Also in the area and messaged you to study!",
            "Hi! My test date is the week after yours, I’d love to study with you.",
            "Hey 24F here. My testdate is also may 4th! Lmk if you wanna make a group",
            "Hi I’m 22F, I’m looking for an in person study buddy!",
            "Hi! I am 34 and looking for somewhat the same!",
            "dm’d you :)",
            "Hi, I also live near los Angeles and please let me know if you're still looking for study buddy. Thank you",
            "Hi! I am 34 and looking for somewhat the same!",
            "We are taking the same day with the same resources!",
            "Hi! I am 34 and looking for somewhat the same!",
            "I am interested",
            "Sent a message!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Same! Let’s make a groupchat with everyone around the same date!!",
            "Hey there! If you are still interested in a study buddy, let me know! I have ADHD, I have little dogs as well, and am SUPER interested in FM and PM&R! My exam is scheduled for August 23rd. :)",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey, I’m testing 8/2 also in Atlanta.",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey! I have the kaplan and UW qbanks. We also have the same goal score/timeline. I'm game to assign a problem set, and meet up later to go over it. Shoot me a link if you already have a group set up on discord.",
            "👋🏾👋🏾👋🏾",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey! I'm planning to take my exam in August, let me know if still interested in a study buddy. Feel free to send me a private msg. Happy studying!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "hey also from van and looking a study buddy!",
            "hi i'm from greater van! this is my post: [https://www.reddit.com/r/Mcat/comments/17h33dj/comment/kt14l9s/](https://www.reddit.com/r/Mcat/comments/17h33dj/comment/kt14l9s/)",
            "Hi are you still looking for a study buddy? I'm in van as well",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hi, i am just staring also, can I Dm",
            "Hey I am also in Chicago! I would love to study together!",
            "Hey! Would love to connect if you’re still looking for an  MCAT buddy. I’m also 22F in Chicago",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hey! I would love to study together!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Hi! I'm also at the absolute beginning of studying with a similar late-summer test date. I had a really similar impetus to begin pursuing medicine, but with my own native language instead of Spanish :)\n\nBadass pinky story, too?! Please lemme know if you're still looking for a study buddy!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "Also testing in august and would love to connect!",
            "Looking for an August study buddy!",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw and am from Orange County!",
            "Hi! I’m on a different part of my study journey, but I’d  be interested in following your journey and maybe being accountability partners. I go to school in Atlanta.",
            "Hi! Are you using the Kaplan full lengths or Blueprint for your prep?",
            "Idk if you’re still looking for a study buddy but PM’d you my profile, lmk if you’re interested! I’m testing august 23 btw",
            "I’m interested!! Please DM me!! FYI.. I am the same age (:",
            "PMed you!",
            "Hey wondering if you took the exam 6/1?",
            " I am in Davie, Florida, too. Test date: 08/17/2024. Message me.",
            "Hi!! I'm also in Las Vegas! are you still looking for a study buddy?",
            "Dmd",
            "Just DMed!!",
            "Hey, still looking for study buddy? I’m testing on June 15th as well",
            "Messaged!",
            "Hi I noticed we have similar goals! Do you want to study together?",
            "glll",
            "I would love to join ur study group! I'm taking mine 3/9/24 and need a group for accountability! I will PM you",
            "Hey I’ll DM you!",
            "Hey are u still interested? Tried dming you",
            "Hello yes I am. I didn’t see a message. I will message you.",
            "I just messaged you."
        ]
    },
    "490 MCAT - Rising M3": {
        "title": "490 MCAT - Rising M3",
        "score": 104,
        "url": "https://www.reddit.com/r/Mcat/comments/1dll0vs/490_mcat_rising_m3/",
        "content": "I just wanted to come back to this thread and say that anything is possible. I got rude comments on my post excited about being accepted into medical school 2 years ago where I mentioned I got into medical school w a 490. While some were positive others were disgusting and really negative. Saying I won’t make it past boards, I’ll fail out of school etc etc etc. Honestly I laughed at some then others I was just thought to myself you know what? A SCORE DOES NOT DEFINE YOU! I’m not telling anyone to apply w low MCAT scores whatsoever. I’m just saying that if you do get into medical school with a low score do not let it define you because your medical school didn’t let it define you. \n\nI didn’t have the right balance nor did I have the resources to take the exam MCAT. I come from a low income family who could not support me (even though they tried their best) and I just tried my best to study with what I had. When coming into medical school I had to let go of what I did previously to get in and grinded like I knew I could. With refunds and school resources I was able to afford and get resources to help support me through school like ALL other students. I was able to use them to level up my study habits as well as use different techniques w/o worrying about $! I just say this to say don’t let a score define you and keep grinding to reach your dream. I’m done w didactics and honored in some of my courses (🖕to the naysayers that said I couldn’t). I love winning and proving haters wrong. Now I am a M3 and ready to take on Clinicals! If you’re reading this know you are good enough and will. Reach your dreams!\n\n- The Person with the 490",
        "num_comments": 37,
        "comments": [
            "Omg coming from someone with a 489 (still retaking soon but already submitted my app) this was so encouraging!! Thank you 🥹 and good luck with M3 year!!",
            "Congrats man what schools did u apply to if u don’t mind me asking",
            "Thanks for sharing. I’m assuming you had a decent GPA despite the low mcat though. When both are low, it’s definitely rare. Either way, you’re another data point of proof that the MCAT really is just an effective gate.",
            "Congrats bro😎 all best to you, thanks for this ",
            "Thank you sharing your uplifting story. Vote me up plz, i want to post...",
            "Well done!!",
            "What school do you go to lmao, 490 -> MD , is wild af",
            "Did you pick a apecilaity yet",
            "Ah congratulations!! You deserve all the happiness and success in the world 🌹🌹 Nothing better than stories of people who never gave up on themselves, it’s the greatest token of love you could ever give yourself :) Too many people allow other peoples’ views to hurt their beliefs of their own abilities- I’m so proud and happy that you showed them!!",
            "What refunds do you mean?",
            "Did you pass step 1? Maybe I missed that in your post.",
            "M1 here. What resources do you recommend during med school? Thx :)",
            "I took the mcat in 1990. I did very well. I progressed through basic sciences, clinical cores, and electives and ranged from A’s to c’s. My old test didn’t have a code on it to be distributed to schools electronically so I took the mcat again 1/26/24. I got a 490. I am applying to Aacomas with that score. I am also studying to take it again soon. I have a few waiver because of my student loan debt. But if someone gave me an A I would be thrilled. I keep wondering how this below average score might correlate to a P/ Fail? I think I would pass step 1 ; I did that in 2004. But the comlex? Is that score pass/ fail or is scored?",
            "So petty. But I'm sorry to say, I'm even pettier and more vindictive than you.",
            "Congrats on ur acceptance! I hope that you’ll be a great doctor.\n\nBut we do have to recognize that there is a trend with higher gpa and mcat scores with higher chances of acceptance. Hope is good to have, but we all have to be realistic about our chances because some schools do screen scores. \n\nI think it’s getting more and more competitive to even get a spot even with great scores ngl as years go by.",
            "MD or DO?",
            "Thank You!! It’ll all work out! Make sure to take practice exams and fill in your weak areas w free resources like Kahn Academy & YouTube! If you have the funds get UWorld and learn from those questions to also fill in gaps. Use Anki if you can for the psych/soc and understanding. As for bio write out pathways and understand the underlying physio of what’s going on. After you know the physiology you can use it to your advantage of being able to answer questions. After studying for boards I know for a fact I went about studying for MCAT totally wrong which showed in my MCAT score but not in intellect. You got this just keep pushing! I believe in you!",
            "I applied broadly! I got to a US MD school.",
            "Thanks and no problem! Keep grinding!",
            "I think its a fair question, especially URM/ORM status and what school",
            "This makes me wonder what the lowest score to an MD school is? Of Fo for that matter? The chart with grades and Do scores shows many people getting in with a 490.",
            "Who cares 🤷‍♂️. I’m contributing to the positive statistics of pass rates. I hope you can do the same. Be blessed.",
            "Yes but I am still keeping my options broad and will decide once I go through rotations.",
            "I’m assuming you’re going off your username to be this way but I promise the MCAT is just a weed out tool because when it comes to actual course work and passing exams some of the ppl with 520s are failing while others who made lower scores are top of the class. It’s all about work ethic and not repeating past mistakes.",
            "MD but put show some respect for the DO* students. It’s a capital O not lowercase.",
            "Hey I just pm (dm) you for further questions",
            "I think a good chunk may care! It helps them use your advice ya know",
            "Yes! A lot of people have sub 500 scores and want to find out if they have a chance, which in your case, probably inspired them more rn. Is it a DO or MD school at least? And were you an in state or OOS? Did you do a postbacc/SMP with them?",
            "You’re actually contributing to a false sense of security and misguiding people by sharing your 1 in 10,000 story (essentially bullshit). Especially while conveniently ignoring every other aspect of your app, especially your school.",
            "Spot on about the sarcasm.\n\nJokes aside, at the same time, there's no denying the MCAT gives an indication of how strong your foundation is. You mentioned reinventing yourself during medical school, which was an extra hill to climb but you managed to pull it off. Meanwhile, most people who got your score would have flunked out of medical school by now. I know a guy who got a 502 and is on the verge of flunking out.",
            "That’s not the reality in all honestly. Classmates who did not make it to 3rd year were the ones w 500+. I think people get complacent and think that what they had coming in will make them ok for coursework and keep their same habits when it doesn’t. You have to revamp your skills to study in medical school and some are resistant to change. I was all for it and it worked. Like I also said in my post I’m sure there are some who took the MCAT like myself and just were fucked bec they couldn’t afford the resources but are excelling now bec of a leveled playing field w having access to get more resources.",
            "\"Classmates who did not make it to 3rd year were the ones w 500+\" Try to remember very few people get into medical school with a sub-500 score, especially MD schools, so that's not really a valid statement. Let me ask you this: if there was one year where where 50% of matriculants had a 500+ and the other had a sub-500, do you think the sub-500 group would not see a substantially higher rate of flunking out?",
            "lol @ the 490 kid also not understanding what anecdotal evidence is. \n\nMy school decided to ignore the MCAT as a metric of importance to level the playing field for people with low scores. Guess who’s failing at my school? Not the 520s. So I guess by your logic, my story cancels yours out?",
            "That's not what I'm arguing! I'm saying in my personal experience at my school. My opinion is not reflective of every medical school in the US! Also l've only loss less than 10 ppl in my class and some boasted abt their mcats and others didn't. They could have also left because of health/other issues unrelated to course work. My post is for those who didn’t do as well as you did. They need to know that they can do this and to start school with a plan because the MCAT does not define what type of physican you'll be.",
            "Proper statistical evidence>>>> anecdotal evidence by a wide margin. I think we can end it here.",
            "You came on my post. You didn’t have to engage but you did. At the end of the day the day still has to end!"
        ]
    },
    "waiting for check in..": {
        "title": "waiting for check in..",
        "score": 6,
        "url": "https://www.reddit.com/r/Mcat/comments/1dlu2ep/waiting_for_check_in/",
        "content": "ahHhhhhHhhh….. sitting in the waiting room waiting to be checked in. we got this guys, yall worked your ass off for this. and a simple reminder that a score does NOT determine our worth!! \n\ncheck in thru the day, id love to hear how yall feel throughout <3",
        "num_comments": 1,
        "comments": [
            "Good luck!! You’re gonna kill it. 528 loading…"
        ]
    },
    "Is this physics equation cheat sheet the only thing I need to remember in terms of equations?": {
        "title": "Is this physics equation cheat sheet the only thing I need to remember in terms of equations?",
        "score": 57,
        "url": "https://i.redd.it/1txw0dk9108d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Nah that sheet is no good. Way too many unnecessary equations.",
            "There are few unnecessary questions but I like those sheet a lot and use it often",
            "Some equations on there are extra I feel",
            "You literally have many equations that are just repeating. One example is T=1/f. Just learn that, you don’t have to memorize that f=1/T lol. \n\nAlso this applies to horizontal and vertical components of a vector: velocity is a vector and so is force. The horizontal component is its magnitude* cos theta while the vertical component is the magnitude* sin theta. Like people please don’t memorize, you should rather understand!",
            "Blueprint has a very good set of formula sheets for all subjects on their site for free. Maybe check that out. Really helped me.",
            "Is angular motion even tested?",
            "I always laugh as a previous physics TA trying to see how premeds do physics. Bro you need to memorize like 4 equations and can derive the rest from basic logic and what the question asks. Why are you trying to brute force memorize physics lmao. Leave that for med school when you have anatomy 🤣",
            "The thing about equations for MCAT is the majority of them you can derive from scratch if you have a solid conceptual understanding and know your units well enough. \n\nWorked for me at least.",
            "There’s some chem equations missing",
            "I used this for studying. Honestly most of it is good. But it’s missing out the key chemistry equations and some bio equations and units you should know. Also it’s good to add orgo stuff too since c/p is getting more orgo heavy, based on my two test attempts and what I’ve observed in the reaction threads. \n\nThe first time I took the mcat I only used this sheet and it did not help that much. You can’t use it in isolation.\n\nIt is nicely formatted though! I chose it bc it blocks off sections in colors which is very helpful for my visual-oriented brain.",
            "Where can one find a higher definition version of it?",
            "Also there is an error on the sheet regarding angular velocity and angular acceleration: alpha is angular acceleration not angular velocity. Angular velocity is omega (w).",
            "Lmao that's what i'm saying like i've never seen any of that",
            "But if you wanna know what topics show up a lot: optics, circuits, kinematics, fluid, work/energy. And obviously force but that should be second nature. Again, I will say don’t memorize these equations. Do practice problems and utilize them and derive them and by practicing that not only will you build intuition to solve these types of problems but you will also memorize the equations."
        ]
    },
    "Savvy Maneuver": {
        "title": "Savvy Maneuver",
        "score": 17,
        "url": "https://i.redd.it/94bj662nk18d1.jpeg",
        "content": "Harvard Medical School wants to know my location ",
        "num_comments": 0,
        "comments": []
    }
}