{
    "Official Discussion Megathread (The Bikeriders / Ultraman: Rising)": {
        "title": "Official Discussion Megathread (The Bikeriders / Ultraman: Rising)",
        "score": 27,
        "url": "https://www.reddit.com/r/movies/comments/1dksy1l/official_discussion_megathread_the_bikeriders/",
        "content": "[The Bikeriders](https://www.reddit.com/r/movies/comments/1dksxab/official_discussion_the_bikeriders_spoilers/?)\n\n[Ultraman: Rising](https://www.reddit.com/r/movies/comments/1dksxbr/official_discussion_ultraman_rising_spoilers/?)",
        "num_comments": 0,
        "comments": []
    },
    "Hi, /r/movies! I am Ariane Louis-Seize, director of Humanist Vampire Seeking Consenting Suicidal Person, in theaters today, rolling out nationwide. It's an award-winning French-Canadian coming-of-age vampire film that screened at festivals worldwide, including TIFF and Venice. AMA!": {
        "title": "Hi, /r/movies! I am Ariane Louis-Seize, director of Humanist Vampire Seeking Consenting Suicidal Person, in theaters today, rolling out nationwide. It's an award-winning French-Canadian coming-of-age vampire film that screened at festivals worldwide, including TIFF and Venice. AMA!",
        "score": 96,
        "url": "https://www.reddit.com/r/movies/comments/1dl7du4/hi_rmovies_i_am_ariane_louisseize_director_of/",
        "content": "**Hi everyone,**\n\nHi, r/movies! I’m Ariane Louis-Seize, the screenwriter and director of *Humanist Vampire Seeking Consenting Suicidal Person*. It's an award-winning, French-Canadian coming-of-age vampire film that's been charming audiences at festivals worldwide, including TIFF and Venice, and has won numerous awards. It's hitting theaters nationwide this week. I'm here to answer all your questions about the film, my journey, and anything else you're curious about! AMA!\n\n**Logline:**  \nSasha is a young vampire with a very serious problem: she’s too sensitive to kill! Frustrated by their daughter’s empathy for humans, Sasha’s parents decide to cut off her blood supply to force her to learn how to hunt… or starve! Just as she decides to reject her vampire instincts and embrace a final death, she meets a lonely teenager named Paul who is willing to give his life to save hers, on the condition that she help fulfill his final wishes before day breaks.\n\n**Watch the Trailer:**  \n[https://www.youtube.com/watch?v=l6Ox75fXY7o](https://www.youtube.com/watch?v=l6Ox75fXY7o)\n\n**Release Date:**  \nHumanist Vampire opens in NY and LA theaters today, followed by a nationwide theatrical rollout!\n\n**Edit: I’m logging off now to get ready for the film’s NYC premiere! Thanks everyone for your questions!  I really enjoyed spending this virtual moment with you all. Please tell all your friends about the movie! Xoxo**\n\nhttps://preview.redd.it/6k6qnlhs5y7d1.jpg?width=1440&format=pjpg&auto=webp&s=fe462da97cf9a44d0ad08ecbaf7c9dea221405fb\n\n>I’m logging off now to get ready for the film’s NYC premiere! Thanks everyone for your questions!  I really enjoyed spending this virtual moment with you all. Please tell all your friends about the movie! Xoxo",
        "num_comments": 47,
        "comments": [
            "Ariane will be answering questions an hour or two after this post goes live (so around 1:00 PM to 2:00 PM Eastern). Please ask away :)",
            "This movie looks fantastic, can't wait to see it!\n\nWe've been watching and reading vampire stories for centuries now, why do you personally think that the concept has such staying power with audiences?\n\nAlso, were there any established vampire \"tropes\" that you were consciously avoiding when making the film? Any specific ones you wanted to honor/homage with the film?",
            "Allo Ariane!\n\nI absolutely loved the movie at TIFF last year, one of my favorites of the festivals. It was super charming/bloody/sweet/hilarious. A really unique mix. Looking forward to catching it again soon for its full release, hopefully in a theater.\n\nThere's one scene in particular that I really loved and couldn't stop thinking about, when Sasha and Paul are listening to the music together that reminded me so much of the [Listening Booth Scene](https://www.youtube.com/watch?v=fkRuHhhYAqg&ab_channel=VivekYadav) from **Before Sunrise**, one of my all-time favorite scenes. Was this intended? I've been hoping it was lol.\n\nIf not, were there other films that you used as influences for **Humanist Vampire**?",
            "Hello!\n\nWhat are some of your most favorite coming of age films? And what about them stands out to you?",
            "Ariane! I loved HVSCSP!! It was so much fun and a superb joy to watch! Feel free to answer 0-all of these:\n\n1. How did the idea/subject matter come about for the film?\n2. How did you convince your producers to keep the super long title (that's surprisingly shorter in French!)\n3. What sold you about Sara and Felix-Antoine during the casting process that they would be PERFECT for their roles?\n4. What did you find most fun and most challenging in making your first feature?\n5. Are you related to French royalty?!\n\nP.S. I loved the set design of the cousin's place! Kudos to the designer(s)!\n\nCongrats on all the award wins and nominations for your debut feature!!",
            "What's your favourite vampire movie/s if you have any?",
            "Humanist Vampire was a lot of fun!  \n  \nAre you working on anything at the moment? Any plans for your next feature?",
            "Who are your favourite directors? Who inspired you to be a director?",
            "Was Armin Meiwes, the German cannibal who only wanted consenting victims, part of the inspiration?",
            "Congrats on making one of the most beautiful films I’ve seen in a while! Can you tell me a bit about how you developed your vision for the film’s cinematography? Your cinematographer has a new fan in me!",
            "Je n’ai pas vraiment de question autre que de te féliciter pour le film! Je te souhaite le meilleur des succès!",
            "Hello, *Humanist Vampire* was one of the best films I saw last year and I loved how you managed to unpacked a hilariously ironic/absurd premise to its fullest implications with so much heart. During my viewing, what struck me the most was how Sasha's story works so, so well as a metaphor or allegory for so many situations--from the obvious (like ethical debates about eating meat) to the abstract (e.g. coming out of the closet)--that it made your film feel at once intimate and universal. Thank you for this all-Canadian gem!\n\nCan you elaborate a bit more on the writing process for *Humanist Vampire*, and how you brought it from initial idea to final script? Were there any ideas or scenes that had to be cut that you wish could've made their way to the final product? Did you have any particular themes or motifs in mind that guided your story development?",
            "I don't have any questions, but fellow Canadian here who got to see this a while back on Crave (twice because I liked it so much, I watched it again right away).  This movie was an absolute delight, an awkward outsider coming of age / meet cute with a slightly dark twisty angle.  And also a fresh take on vampires as well with some unique lore!  I've been talking it up to everyone I know.  It's currently sitting in my top ten of ranked list of Vampire films in my Letterboxd so you done good in my books! We don't get a lot of Canadian Vampire movies so I was excited and appreciative of your entry to the genre.\n\n(PS I'm also learning French - thought this would be a fun one to practice with and it was!  It was really accessible for a language learner).",
            "Just FWIW, absolutely LOVE this film, now desperately hoping it gets (amongst a wider distribution and appreciation) UK theatrical distribution and broader pickup/distribution so that I can get a physical copy of it on Blu Ray domestically; the import fees from Canada or Australia (weirdly) just astronomical!",
            "Hello! Thanks for doing this AMA with us.\n\nWhat's your dream project? And which actor do you want to work with the most?",
            "Okay wait to be so real with you I’ve never been a fan of vampire movies but after reading just the description I think it sounds fantastic! Definitely worth a watch I think",
            "Sara Montpetit seemed like the perfect casting for a teenage vampire! What went into that casting decision and what would be some projects you'd like to collaborate on together in the future?",
            "[removed]",
            "I just want to say, I saw this earlier this year at the Lightbox and loved it. Can’t wait to see what you work on next!",
            "Wow I saw the trailer months ago and thought it looked fantastic!  I don’t even like Vampire films but this just seemed so compelling and well done.  Will definitely be projecting it in my own personal screening room.  My GF is an actress from Transylvania, so I’m sure she’ll enjoy it as well.\n\nPerhaps you can tell us how you got it produced?",
            "I was at the world premiere screening at TIFF, I saw it again at CIFF/ Eau Claire. Congrats!",
            "Hi, could you tell me a bit more about the movie? \n\nE.g. plot, characters, cast",
            "Hey! Thank you so much! To answer your first question, I think the world of vampires is an incredible playground to discuss our relationship with death, others, and the society we live in. Vampires are fascinating because they are both attractive and dangerous, and personally, I love playing in areas where attraction and repulsion meet. I also love misfits. The vampire story always evolves because the society around us evolves.\n\nFor your second question, the only vampire trope that I decided to change is that my vampires age! They age more slowly than humans, but I really wanted the character of Shasha to experience childhood to establish her childhood trauma.",
            "Hey! Thank you for your question and your kind words! I'm sorry to disappoint you, but no, it wasn't a reference to *Before Sunrise*, which I agree is a brilliant film! It is the scene that I am most proud of in my film though. The films that have influenced me the most in making my movie are *A Girl Walks Home Alone at Night*, *Only Lovers Left Alive*, and *Under the Skin*!",
            "My favorite coming-of-age films that come to mind are: *Juno*, *Garden State*, *Little Miss Sunshine*, and *Harold and Maude*. These are films I watched when I was a teenager, and as a little weirdo myself, I related to those characters because they are weird, surprising, vulnerable, and so lovable. More recently, I love *How to Have Sex* and *Bottoms*, obviously for very different reasons! *How to Have Sex* is a brilliant and important film about rape culture, and *Bottoms* is just a joy to watch with the most amazing cast!",
            "I’m running out of time to answer everyone, so I’ll pick two of your questions: \n\n3.What sold me on Sara and Félix-Antoine:\n\nI was sold on both of them individually pretty early on in the casting process, as you can imagine! But what remained to be confirmed was their chemistry together. \n\nThe final step of the process was to have them act out one of the scenes together (the “Emotions” scene!). It was so beautifully awkward - they had both come very prepared, but had approached the scene so differently, that it created a lot of clumsy, awkward moments - which is exactly what I wanted! Funny enough, both actors thought they completely bombed the audition, but I begged to differ :) \n\n[5.Am](http://5.Am) I related to French royalty: \n\nAbsolutely not! In fact, when I travel to France, people get a good laugh out of my surname, which has long disappeared over there but is still somewhat prevalent in Quebec!",
            "My favorite vampire films are *The Hunger*, *A Girl Walks Home Alone at Night*, and *Only Lovers Left Alive*. I also want to add *Under the Skin-*it's not a vampire film, but it inspired me a lot during my creative process.",
            "Thanks for watching!\n\nI’m working on too many things! I have another feature I’m developing in French, an adaptation of a play by a wonderful playwright named Rebecca Deraspe. In the US, I’ve got a few things in the works, including my first English language feature, which is a complete departure from the universe of Humanist Vampire! I also see some TV in my future… stay tuned!",
            "I'm a big David Lynch and Jane Campion fan! *Mulholland Drive* is the film that made me fall in love with cinema as an art form. It's a challenging film, but it is so unique. I love dreamlike worlds and the combination of tension, emotional scenes, dark humor, and colorful, odd characters. My favorite film by Jane Campion is *Sweetie*, her first feature, which has such a distinctive tone and deeply moving characters!",
            "Great question! No, he wasn’t, actually. I didn’t know about him until after the film was released and people started asking me this very question!",
            "Ohhhh, thank you so much! :) I'll pass your kind words to Shawn Pavlin, the cinematographer! I've been working with him since my first short film, so we have great chemistry and have really developed our visual aesthetic together through all of our projects. Before starting this specific project, we watched a bunch of vampire films to spark our inspiration.",
            "Cheers for the kind words :)",
            "Argh, I’m sorry! I don’t have an answer for you right now but I’m forwarding your question to people who might!",
            "Ouuuhhhh, my dream project! That's a tough one! I think my dream project would be to make a very wild musical! And there are so many actors I want to work with! It's impossible to choose just one, but let's say: Mark Ruffalo and Ayo Edebiri!",
            "I love reading that!  I really set out to make a vampire film that would appeal to a broader audience than just vampire fans!  In my humble opinion, I think fans of many different genres will be able to relate to Sacha and Paul’s humanity (so to speak!) and their quest for meaning. The film also borrows a lot of other universes - coming of age and dark comedy being two of them. \n\nI hope you enjoy it!",
            "I agree with you, she was perfect for this role! I was already a fan of hers and had especially enjoyed watching her in Charlotte Le Bon’s FALCON LAKE, and I thought she had such a beautiful, mysteriously vampiric aura to her! It was a very easy casting decision! \n\nAs for future collaboration with Sara, while there’s nothing concrete right now,  I can’t wait to find an opportunity to work with her again, and something tells me it won’t take too long before that happens!",
            "<3",
            "If you’re in NYC or LA, go see it in theatres, and go in blind!  It’ll be more fun that way!\n\nIf you’re elsewhere in the US, there’s a wider release coming. I hope you enjoy it :)",
            "Did anyone ask you whether [the episode of *The IT Crowd*](https://www.youtube.com/watch?v=gOE-q20RcDM) was an inspiration?",
            "I was genuinely not expecting an acknowledgement or response. Wow. Thank you so much (just for the response!) and very best with the films continued success.",
            "That's exciting! Can't wait to see more from you both!",
            "Never!",
            "Thank you <3"
        ]
    },
    "Taylor Wily, ‘Hawaii Five-0’ and ‘Forgetting Sarah Marshall’ Actor, Dies at 56": {
        "title": "Taylor Wily, ‘Hawaii Five-0’ and ‘Forgetting Sarah Marshall’ Actor, Dies at 56",
        "score": 6817,
        "url": "https://www.thewrap.com/taylor-wily-actor-dead-dies-hawaii-five-0-forgetting-sarah-marshall/",
        "content": "",
        "num_comments": 276,
        "comments": [
            "\"Are those sad tissues or happy tissues?\"",
            "Dude was in the first UFC fight ever",
            "\"You need a hug\"",
            "“…It’s like the Sopranos. It’s over…. Find a new show.”",
            "RIP. Hawaii Five-O was one of the rare network shows I watched every night. Loved him in it.",
            "I’m sure he’s having a nice Subway^tm foot long Italian in heaven right now.",
            "Alotta Aloha bruddah & mahalo plenny🤙",
            "Must be sad tissues",
            "Oh man, I just rewatched Forgetting Sarah Marshall last night. He was such a great part of the movie.",
            "Fought in UFC 1 as well. Gone too soon.",
            "https://m.youtube.com/watch?v=oQYwFND7rHE&pp=ygUUaGF3YWlpIGZpdmUgMCBzdWJ3YXk%3D",
            "We'll always remember the Subway footlongs ",
            "Sad tissues 😢",
            "I loved his character in Forgetting Sarah Marshall. \n\n“Are those sad tissues or happy tissues?” \n\nRIP ",
            "Ran into him in Waikiki a few years ago.  Super mello and a really nice person.  I didn’t want to bother him so I kept it short.  Spoke more with his wife, she was really nice too and said he enjoyed meeting and talking with people.  Sad to see him go.",
            "Safe journey, Mr. Wily.",
            "WHAT!!! NO!!! I loved that guy. I ate more shrimp dishes because of him!",
            "Rip shrimp king",
            "Damn and just lost [Akebono](https://en.wikipedia.org/wiki/Akebono_Tar%C5%8D) a few months ago too.",
            "Just watched season 2 of Hawaii Five-0 today. Damn.",
            "Noooooo",
            "\"You look like a gigantic baby. I'm sorry, I didn't mean that at all.\"",
            "That sucks. He got a lot of memorable lines out in Forgetting Sarah Marshall, as evidenced by this thread.",
            "Gonna have some garlic shrimp on his behalf",
            "Damn, dude was young, anybody know cause of death?",
            "Forgetting Sarah Marshall is such a great movie.",
            "FSM is one of my favorite movies, may he rest.",
            "\"I'm not crying, you're crying\"",
            "Telia Tuli! He got his teeth kicked out of his head by Gerard Gordeau. Also had his eye socket lacerated. \n\n\n\nhttps://youtu.be/prcWJgfeuJg?feature=shared",
            "I really liked his character in Hawaii Five-O.  I love characters in media who love to talk about food and who get excited over food.  I do wish they didn't have his character shilling Subway so much, though.",
            "I never knew him from anything but Forgetting Sarah Marshall 😞\n\nHe seemed like a really nice and just down to earth guy though in that film, I can imagine he's really like that in person off camera as well not anymore obviously but before",
            "I loved him in Hawaii Five- 0. He was such an amazing actor.",
            "I only know him from the Subway meme, but damn, 56 is really young. Poor guy.",
            "RIP big man.  Why couldn't it have been Russell Brand?",
            "He look like a gigantic baby",
            "“I’m not crying, I’m not a baby”",
            "Too young",
            "Damn! What sad news. My wife and I met him when back in Hawaii and he was so excited we recognized him and asked to take a picture with him. Such a lovable dude!",
            "Unacceptable.",
            "You look like a giant baby.\n\nRIP",
            "too young....too young",
            "Never realized this was the guy who got kicked in the face in that first UFC lol",
            "Wife and I loved his characters in Forgetting Sarah Marshall and Hawaii Five-O. Was riding past the Ala Moana Park yesterday on the way to Waikiki and jokingly said to my wife, “Wonder if Kamakona is there with the shrimp truck?” Found out later in the evening that he had passed away… so sad.",
            "Such sad news. He was great in both roles. He will be missed.",
            "Ayyyy peanut buddah cup!",
            "Eating a footlong in his honor.",
            "Did he die of bigness?",
            "RIP",
            "RIP. Was watching 5-O today, and dude brought a different flavor to the show.",
            "These are definitely sad tissues :(",
            ":( rest in peace",
            "The part line I always remember from him in Forgetting Sarah Marshall is \"Whipped cream, or berry?\" and I have no idea why. RIP to the man.",
            "Guy was great rip",
            "Oh no. RIP, baby ❤️",
            "who killed him?",
            "We all should eat a subway sandwich in his honor.",
            "Humuhumunukunukuapua`a, yeah bitch.",
            "RIP big guy",
            "Guess we're having garlic shrimp tomorrow night!",
            "I don’t cry, I’m not a baby",
            "rest in love my braddah cheeehooooo",
            "He was a treasure",
            "You mean the first UFC fighter ever ****",
            "Damn doing a rewatch of Hawaii 5-0 and was wondering what all of em were doing.",
            "Rip. Slaughtering a pig tonight in his honor.",
            "UFC legend Taylor Wily",
            "Kamekona NOOOO",
            "This is wild. I just started watching the show again and was wondering if this guy was still around. Sad to hear this as he was one of my favorite characters",
            "RIP",
            "Loved him so much. It hurts. He seemed to be good soul.",
            "“Alriiiight”. He was so cool in Forgetting Sarah Marshall.",
            "Total bummer.",
            "“It’s like The Sopranos, it’s over. Find a new show”",
            "May his soul rest in peace.",
            "Rip to this mma/tv legend.",
            "Mahalo Kamekona, always had a good energy",
            "RIP my boy, he's eating Subway’s Sweet Onion Chicken Teriyaki with Jalapeño and Banana Pepper in heaven now :(",
            "TIL Hawaii 5-0 is in the same TV universe as Magnum, PI and MacGuyver. Though everything is in the same Tommy Westphall Universe",
            "I am a sap and always feel really bad when very overweight people die so young. Ralphie May, John Candy, John Pinette, etc.\n\nI hope Jorge Garcia slims down. Gabriel Iglesias as well.",
            "Forever know as that Hawaiian guy",
            "I guess those subways didn't help",
            "Too many Subway sandwiches?",
            "remember guys, health at every size.",
            "Stop crying",
            "kk",
            "wq6t",
            "These are definitely sad tissues.",
            "Rest in power king.",
            "It’s always in threes—get ready for one more",
            "It doesn't say what he died of...",
            "Wonder what he dies from",
            "My husband and I quote this often (I have allergies and leave tissues wherever I go) and today is a sad tissue day",
            "😭😭😭 \n\n[I'm not crying, I'm not a baby](https://youtu.be/blyUtVUpXLQ?feature=shared)",
            "Today, they're sad tissues.",
            "They're sad,  my friend.  They're sad",
            "Holy shit. I never realized that was him",
            "I'll never forget hearing the story of how he got kicked in his face so hard, his tooth was embedded in the guys foot. That's gnarly. ",
            "Here's the fight vs Gerard Gordeau at UFC 1: https://youtu.be/Za6HeiTJIWI?t=327",
            "Watching his teeth get kicked out of his head in the first few seconds of the match was a very interesting way to see what UFC was going to be all about back in the day.",
            "I remember that fight!  I had no idea that was him.\n\nThat was back when the UFC was really wild.  No weight classes, no rounds, barely any rules, guys would fight multiple times a night, and the concept of \"Mixed Martial Arts\" didn't even really exist.  It was basically a real-life version of \"Street Fighter\".",
            "Gosh those days were crazy. I remember renting the first UFCs at our old video store.",
            "If people are curious about this I highly recommend the ESPN 30 for 30 podcast about UFC1. It’s fascinating even if you know nothing about MMA or sports.         \n\nhttps://30for30podcasts.com/episodes/no-rules-birth-ufc/",
            "This is the subheading of the article.",
            "I think we all need a hug. RIP.",
            "Ya brb just discussing the nuances of the show 20 years later.",
            "/r/thesopranos would like a word",
            "RIP gigantic baby.",
            "He never had the makings of a varsity athlete.",
            "He wasn't the best actor, but it seemed like he always brought 100%",
            "Why, it was so bad!",
            "Man is a legend. Was the star of the single most blatant example of product placement of all time.\n\n\n2nd place goes to \"I Bing-ed it\"",
            "So ono.",
            "🤙",
            "Second worst Subway spokesman.",
            "5 dollar foot longs !",
            "With banana peppers",
            "Boy was laage",
            "I had Subway for lunch today in his honor",
            "Kind of sucks that this is probably his legacy. \n\nAdmittedly, that’s the only clip of Hawaii 5-0 I’ve seen too.",
            "One of the best jokes in an incredible movie. RIP",
            "I've never seen this and it's shameless as hell but I can imagine the writers at least being like \"he's gonna eat 5 and we're going to have the other characters think it's dumb a little.\" \n\nAlso gosh Grace Park is distractingly pretty",
            "I saw this 12 years ago and it's still the only thing I know about the man.",
            "It never fails to shock and awe me. Just absolutely shameless of the show runners.",
            "Sweet onion chicken teriyaki with jalapenos and banana peppers 🤌🏾🤌🏾🤌🏾",
            "Fuckin hell, what's up with the editing of this show? That shit would drive me insane, I mean, it almost did just with this scene.",
            "Aw, dang. I hadn’t heard that, what a bummer.",
            "The guy did not look healthy. He was massively overweight.",
            "Given his size, heart attack seems quite likely",
            "Unconfirmed as of yet.",
            "Honestly, he probably exceeded the life expectancy for someone with a BMI of 57.",
            "No weight of knowing really",
            "Obesity",
            "Obesity",
            "He was a big boy. I mean fat people rarely make it out of their fifties if they reach them to begin with.",
            "Um.",
            "Most likely CHF, an MI, or complications from diabetes. BUT most likely a combination of all of that.",
            "Use the “sad” tissues, not the “happy” ones…",
            "I like the way you think.",
            "[deleted]",
            "50 First Dates? That's a different actor",
            "sadly, i don't think it was trulicity :(",
            "Gabriel Iglesias has already lost like half of himself and is still a pretty big dude. But he's definitely waaaay smaller than he used to be.",
            "So you have happy allergies? Lucky you. I just get sad itchy eyes and running nose.",
            "really cause you look like a gigantic baby ",
            "That’s him? Mind blown. He got fucked up from that kick",
            "I only did because I googled him. I always knew him as Teila Tuli.",
            "Some of his teeth also landed in the audience. This might be apocryphal but supposedly they landed next to Big John McCarthy wife, who got up and walked out.",
            "Man, UFC used to be cool",
            "I love reddit ",
            "Omfg 😅🤣🤣🤣",
            "That was literally mixed martial arts lol",
            "Nice find!",
            "The subreddit for the show is a trip. They all communicate with each other using like 90% quotes and references, and it’s quite active.",
            "Die... die... die... I can't 😔",
            "20 years, just a kid.",
            "You don't ever admit the existence of this thing!!",
            "Ooooooh! You're talking out of turn here!",
            "It always seemed like he was having fun and enjoying himself on screen which is arguably for these types of showes even more important than being a good actor",
            "Because the other cop shows were like killer find who win.\n\nThis one had different things. Killers, bombs. The cast was kind of funny. It wasnt boring or dull to look at.",
            "When someone says they loved a show and you feel the need to ruin it by telling that person it was so bad, it doesn't make you smart. It makes you a terrible person. Be better.",
            "It still airs on ION over air TV every friday.  I watch it religiously while I work.\n\nIt's great because it's so ridiculous and silly.  It doesn't pretend to be super serious and is aware of how ridiculous it is.",
            "Bing it",
            "Lmao, those are the only scenes I remember from Hawaii 5-0.",
            ">the single most blatant example of product placement of all time.\n\nIt is not, but I'm happy that you have not seen Jack and Jill.",
            "The thing with the subway scene is it was entirely in character to be like that. The only out of character thing was the other two letting him go on that long.",
            "Also, every driving sequence looked like a car commercial, and they were sure to get the logos in the shot.",
            "I'd watch that show every once in a while just because of her.",
            "Boomer!",
            "RIP https://youtu.be/TIyvjE4CZnk?si=laAr-RwKh44L8H_F you’ve gotta watch Forgetting Sarah Marshal",
            "Yeah, it's crazy. I don't really mind product placement in shows/movies but this is just a literal commercial in the middle of an episode.",
            "Part of me wonders is the showrunners/directors intentionally made it as bad as possible to try and prevent execs from throwing basically commercials directly into the show. Perhaps their sacrifice saved us from a bleak future of having the characters constantly stop and pitch products like they are in the Truman Show.",
            "His height and weight are on his wiki because he used to be a professional fighter. He had a BMI of 57, which is Obese Class 3. \n\nMorbidly Obese is greater than 40 BMI, Extremely Obese is greater than 50 BMI, and he'd be closer to whatever the term for 60 BMI would be. If there were higher classifications at the same interval he'd be Obese Class 6.",
            "I wouldn't go so far as to call the brother fat, I mean he got a weight problem. What's he gonna do? He's Samoan.",
            "Come on man",
            "Well the important thing is you got to make your joke",
            "I'm going to assume you meant weigh not weight",
            "It’s from “Forgetting Sarah Marshall” you dork",
            "(It’s a movie quote)",
            "Good news. I am 100% not a fan so I don't follow him.\n\nHe does look better here:\nhttps://www.nydailynews.com/wp-content/uploads/migration/2014/07/24/7VPUTBK2UNFPNMEMIQXS4L6QDE.jpg?w=1024",
            "Lol the answer is always sad. I sneeze everywhere",
            "I'm sorry, I didn't mean that at all.",
            "Pretty sure his opponent broke his hand as well from punching wily",
            "are you serious? watch UFC 1 in it's entirety. it's such a mess, the refs didn't know how to call anything, the commentators are clueless, and the fights are sloppy at best and boring at worst. it was a disaster and it's a miracle they had a second tournament, let alone a sport",
            "What changed?",
            "Something something grilled cheese on a radiator",
            "Very observant. The sacred and the propane.",
            "You big mouth fuck",
            "Listen to him. He knows everything.",
            "It’s the most quotable show ever. There’s so many hilarious lines throughout; it’s one of the rare shows that gets better literally every rewatch (and funnier) \n\nAnyway $4 a pound",
            "You never admit the existence of this thing",
            "One of my closest friends is this guy. Every response in the boiz chat is just a GIF of Tony, Paulie, etc.",
            "You ever think what a coincidence it is that Lou Gehrig died of Lou Gehrig's disease?",
            "Discontinue the lithium",
            "Exactly, u/Azmoten, very allegorical. The sacred and the propane.",
            "Why don’t you take your quotations book and shove it up your ass",
            "Alright but you gotta get over it",
            "That had not occurred to us, Dude.",
            "That's every old show on reddit, r/seinfeld is exactly that as well",
            "so it's a Star Wars subreddit...",
            "I wish that got like a 20 min short film",
            "By not dull to look at do you mean because its sunny and has good hawaii vibes? Been curious to give a go as a background/side show if so",
            "Are you telling me that you never believed that Columbo couldn't have solved the case?  Blasphemy, the twirly moustache man clearly has a rock solid alibi THIS time!",
            "Terrible person is a bit far lmao",
            "How does it ruin anything that I thought a show was bad? JFC why do you have your entire existence so wrapped up in other people's opinions?\n\nAnd no, I didn't \"feel the need to ruin it\". I was legitamitely asking why they liked it considering how bad it was. If having other people react to the things you like poses a risk of ruining your enjoyment of that media, then just don't share that you liked it on reddit. /u/Chessh2036 never expressed that concern but I guess you know how everybody experiences life and so you had to step in and protect them because they are weak like you, right? That's not at all condescending to /u/Chessh2036.\n\nEdit: Down vote all you want, Trump lovers. Facts don't care about your feelings. Enjoy those 34 guilty verdicts :)",
            "What were they advertising in that movie?",
            "She's 50, so I think she's Gen X.",
            "I saw it, didn't enjoy the movie and don't wish to remember it lol",
            "It was especially bad during that time.  Every USA show (Burn Notice, White Collar, Psych) and most network shows.  I get wanting the money, but put some effort into it.",
            "Some writers do have a good time with these\n\n\nLike that silly subway plug they did on community. Felt somehow very natural for the other regular insanity of the ahow",
            "He was sumo and that’s pretty ripped though",
            "Laws of thermodynamics still apply to Samoans, chief.",
            "Just because he's dead doesn't mean it's suddenly okay for some bukkake.",
            "Don't be so sensitive ",
            "Sorry haven't seen it, mb. Looked in poor taste from my view",
            "Yeah mb",
            "...I remember that one kick ending the fight?",
            "The commentary is like listening to a bad amateur podcast on a topic none of the hosts know anything about.\n\nThey'll contradict each other but speak like they're in agreement.",
            "I know man, it was so so good.",
            "Idk, it sounds better than a Trump circle jerk followed by two dudes you've never heard of rolling on the mat for 15 minutes while Joe Rogan says \"This could be it!\" 15 times a round. All for the low, low price of your left testicle.",
            "The era of specialization is over. Fighters cross train in many disciplines which has made fights far more evenly matched. There are still brutal knockouts but the chaos of the early days is gone.",
            "It went from being a spectacle to an actual sport.",
            "Well you can’t head kick a downed opponent anymore for starters 😂 This KO would be a disqualification under today’s rules",
            "Early MMA was like dogfighting, or a bar brawl, a spectacle but unorganized, akward, and sometimes bad with little to no rules . Theres more rules and a professional polish to it and the fighters are more athletic, talented and skilled nowadays",
            "The Gracie Family arrived from Brazil and started winning everything. That cleaned it up a bit and made BJJ the preferred/winning style of fighting.",
            "Your brother Billy... Whatever happened there.",
            "Rad i ator.",
            "Why don't you get the fuck out of here, before I shove your quotation book up your fat fucking ass.",
            "In the context of r sopranos I think it’s hilarious. In an unrelated group text it sounds very tiresome.\n\nIf we were on r sopranos though my response would be “alright but you gotta get over it”",
            "He was gay, Lou Gehrig?",
            "Well okay you’re not privy to all the new shit. But that’s what you pay me for.",
            "The chemistry between the cast was a lot of fun too",
            "Yeah terrible person is a stretch I’d say more of a dickhead that tries to be different lol",
            "Where did the Trump stuff come from lmao",
            "You came into an RIP thread to say that the main thing the dude was known for sucked. You were rightly put in place. None of this has anything to do with politics.",
            ">considering how bad it was.\n\nIt's condescending because you've phrased this very subjective opinion as fact while ignoring the validity of their own subjective opinion about it.\n\nThe show was not bad. You didn't like it. Those statements are not equal.\n\nBut most importantly, a thread about the death of an actor is just about the worst place I can imagine to show up and talk about how \"bad\" the recently deceased's show was. Fucking read the room, bro.",
            "Yikes that edit.",
            "She played a pilot on Battlestar Galactica whose call-sign was Boomer.",
            "Edit: spoilers if you haven’t seen Battlestar Galatica.\n\nhttps://en.m.wikipedia.org/wiki/Number_Eight_(Battlestar_Galactica)",
            "The Fiona Hyundai was pretty bad\n\nPsych I don’t remember being as obvious",
            "It's a quote from Pulp Fiction.\n\nWell, close to the quote, anyway.",
            "Cool dude dies and we’ve got Mr. Big Brain Grunt here, *”don’t be so sensitive”*\n\nCool life advice… maybe don’t be a shrinky dink dick.",
            "Watch it.  He’s very funny in it.",
            "Pretty sure he gets dropped with punches first, then finished off with a kick once he was on the ground. ",
            "He hit him once when he was down after the kick and that one hit broke his hand. The fighters didn't wear gloves back then.",
            "To be fair the punches were an afterthought when compared to that kick",
            "\"the sumo discipline is- is very... formal, because it is a very... national sport of uh, of Japan\"",
            "Let me tell ya a couple of tree things",
            "Whatever happened THERE?!?!",
            "Consider it exercise",
            "Gotta be ragebait",
            "I know my limits. 🙋🏼‍♂️",
            "Cute insult. What made him cool?",
            "For sure, it's on my list. Thx",
            "Nah they circled each other for like 45 seconds sizing each other up. Dutch guy kicks him in the mouth and his tooth went flying.",
            "The shooting",
            "Fighting in the first UFC is pretty cool, considering it was basically no-name unknown when it started and is super popular now. But I'm not trying to get in on this beef...",
            "He died and there's a post about it with people saying as much.",
            "https://m.youtube.com/watch?v=Za6HeiTJIWI&pp=ygUFVWZjIDE%3D\n\n\nYes he gets kicked, after getting dropped from punches when he rushed in. ",
            "I'd say that's unique but it would have been cooler if he kept up with his physical fitness instead of dying early ",
            "They'll forget about him when they get to the next page",
            "Not a single one of those landed lol. The big dude trips, it's the punch after the kick that broke his hand, you can see him react to it.",
            "Thx",
            "Yikes that’s a heavy kick. Illegal under today’s rules as well (to head kick an opponent with a knee down)",
            "Did his opponent give the Nazi salute to everyone when he first entered the ring or was he just waving? Or maybe it means something different from where he's from? Not being accusatory, genuinely just curious cuz it looks odd lol.\n\nWild video though, I was in the same boat as everyone else not realizing Wily was in the very first UFC match. Cool piece of history he was a part of.",
            "I wouldn't say he was really fit back then either. He was sumo. They are athletic, but not exactly fit. UFC didn't have weight classes back then.",
            "Ok fatty.",
            "People can still care about a loss and celebrate his life. There's no need to bring negativity. He was funny and brought joy. People remember his performances and choose to celebrate. Don't be that guy. Go for a walk.",
            "No weight classes, basically no rules. It was no eye gouging and biting.. I think no small joint manipulation like fingers or toes.. and then Royce Gracie came along and showed everyone how dominant bjj was for years.",
            "I think half of the training regiment that isn't throwing salt is eating McDonald's ",
            "I believe it's performative grieving "
        ]
    },
    "What are some facts that movies get wrong so often that it annoys you?": {
        "title": "What are some facts that movies get wrong so often that it annoys you?",
        "score": 707,
        "url": "https://www.reddit.com/r/movies/comments/1dlizbg/what_are_some_facts_that_movies_get_wrong_so/",
        "content": "I am not talking about being real picky with some hard science facts that movies get wrong. I mean even when they got consultants, there is room for dramatization and artistic license. No movie is a fact book or should aim to be. Having said that, are there facts that movies get wrong, and lies or misunderstandings they continue to spread that annoy you? For example, misquoting someone, or repeating the idea that we use only 5-10% of our brain, and so forth.",
        "num_comments": 1835,
        "comments": [
            "Firing guns in enclosed spaces not deafening anyone. ",
            "I used to do mechanical design for buildings so the two big ones for me are people being able to crawl through ventilation ducts without their being a bunch of crap inside them. And fire sprinklers all going off at the same time or when someone pulls a fire alarm.",
            "When someone is shot in the shoulder and they're fine just a few scenes later.",
            "Being knocked out for a bit. Being unconscious from being hit on the head can be VERY dangerous. You would not be completely fine when waking up.",
            "Almost everything about computers, ever.",
            "When a character survives severe blunt force trauma. Someone getting thrown into a wall hard enough to break bricks, falling off a building and crushing a car roof, bad car crash, etc. and walking away when I know their organs just got liquified.",
            "Poor New York artists living in giant, stylish industrial spaces that would cost a billion dollars a week to rent.",
            "Computers, especially when showing displays, making little beeping noises to let you know they are computers.",
            "As an asthmatic, I hate it when someone in a movie uses an inhaler.",
            "Cars exploding after catching fire",
            "A gun with a silencer sounds like simultaneously the most satisfying and the most ridiculous effect in cinema",
            "Air ducts are filthy, full of sharp metal, and can't support any weight.",
            "Gasoline still being viable many years into an apocalypse.",
            "Medium to long-distance pistol shot accuracy. Especially while running. A pistol has a very short barrel. It's not a weapon made or used for long-range accuracy. A good shooter with experience might hit a stationary target at 50 yards or meters, but a handgun should not really be considered effective beyond that range.\n\nIf the shooter or target are moving, that drops DRASTICALLY. No one is aiming for a knee or a shoulder, either.",
            "The science person knows ALL science.  Like when they make the doctor on a ship in space tell them about the geology of a planet. ",
            "You can't defibrillate asystole, and if you need to use a defibrillator at all, the person is likely to be clinically fucked up, not leaping to their feet going \"whoa! What happened?\" and racing after bad guys two scenes later.",
            "When someone gets stabbed, they pull the thing out immediately.\n\nIt’s keeping your intestines from becoming *out*estines.",
            "I’m a homicide detective.  There are soooo many in murder mysteries in film and TV.  Go to interview a person, he/she is always home, answers the door after two seconds, always welcomes the detective inside.  Wherever they go there’s always an empty parking space immediately in front of the place you need to go.  Getting lab reports back while you wait (ha!) or getting a call about the results a few minutes after you leave (no, no, I assure you, no).\nThe medical examiner coming to the scene and saying “the victim died between nine and nine-thirty this morning.”  (C’mon !!)\nThey don’t spend hours drafting warrants for phones, video feeds, social media usage, GPS downloads on the suspect’s car, etc. When it’s time to arrest, the suspect is always at home or at work, exactly where they go on the first try.  There are so many more, but you get the idea.  The only correct thing is we guys are all handsome and super fit and all the women officers and CSIs look like super models",
            "The pregnant woman breaks her bag of water and suddenly she’s screaming and it’s an emergency and the baby is falling out.\n\nLabor doesn’t work like that.",
            "Chloroform taking people out in like 5 seconds, when it actually takes 10 minutes or so in real life. ",
            "Being able to “enhance” an image at 10000x and get a crystal clear picture. Clients really do think it’s a feature….",
            "Very few people say \"Goodbye\" when they hang up the phone.  I never noticed before, now I can't stop seeing it.",
            "Anything about cell phones. Especially in the early days when movies would play a dial tone if the other person hung up.",
            "Waiting 24-48 hours to report someone missing",
            "Grizzly Adams *did* have a beard.",
            "Someone hiding a cig or weed when someone walks in, and the other person not smelling it. Ok.",
            "The fake binoculars vignette - If you've adjusted the binoculars correctly for your eyes, you see one big circle and not two adjacent circles....",
            "Every microphone in existence is subject to a howl of feedback the moment someone starts to speak into it",
            "How government works.  Every senior official has dozens and dozens of aides.  Movies always make it seem like its just the senator or CIA director with one aide.  For storytelling, I get it.  But they could have a little more realism by showing the beehive of activity in every government office - especially on national security issues.",
            "There's always the cliche scene in action movies where a doctor is removing a bullet or fragments from a wound as of the victim's life depends on it, but IRL this is not important, and the last thing you want a doctor doing on a fresh gunshot wound is digging around in there with a pair of forceps.",
            "No matter what material the scabbard is made from, the sword will always make a *shing* sound when unsheathed.",
            "This is so random, but when people leave others alone in their office. Not like for a quick second to grab a coffee, but like storming out in anger and leaving them there.\n\nOr assistants having a person wait in someone’s office versus having them wait in the reception area. \n\nTo add to this, leaving computers unlocked. Is that a thing in anyone’s office? \n\nWhich gives them an opportunity to poke around on their computer or the drawers. \n\nIn my professional life, people who had actual offices were very careful to keep them locked even when going out to lunch.",
            "That is NOT what eagles sound like. That's a red-tailed hawk. Eagle calls are way derpier.",
            "High school classes are more than 5 minutes long.",
            "A lot of movies seem to think a reactor \"going critical\" is bad.  It literally means the reactor is on and generating power at a steady rate.",
            "Anything about the Celts or Druids. I have a degree in Celtic Langs, so I am sensitive to the topic.\n\nIf they ever mention \"Druid runes\" I wanna find the writer and shoot them.",
            "The dude with 250lbs of muscle in a post-apocalyptic future. People are starving and this guy thinks it’s okay to eat 4000 calories of protein a day and spend 3 hours working out.",
            "Web sites load instantaneously. And Google returns the most useful results immediately at the top of the first page, often in the form of non-paywalled newspaper headlines with a picture of the bad guy.",
            "When people strangle someone and they're dead in like 30 seconds.",
            "Car doors do not stop bullets",
            "Dialogue in any court room scene is almost always so inaccurate it’s comical.",
            "Sound in space.\n\nChloroform working in like 4 seconds.\n\nHip firing a slide-type pistol not catching your hand.",
            "When people hang off stuff, especially like square blocks on the roof of a building with nothing to wrap you fingers around. Even with two hands most people would slip off in a few seconds at most.",
            "CPR. \n\n\nSo many people learn things from movies. I have never seen CPR actually done correctly in a movie. ",
            "How military ranks work, and how law enforcement agencies are set up (ie, municipal police, county sheriff, state trooper).",
            "Modern journalists are clamoring with cameras from 1945 with giant flashbulbs in daylight.",
            "Pulling the slide back on an automatic pistol, when there is a round already in the chamber.",
            "Car getting shot up by automatic fire on all sides and yet the occupants are completely untouched and the car still runs fine",
            "Hospital drug orders. \n\nExcept for emergency situations, a doctor's order is ***ALWAYS***  reviewed by Pharmacy.  If a physician orders a drug for an off-label use, they will generally have a conversation with a pharmacist before that medication is ever delivered to the unit.  (Looking at you, \"Dr.\" House.).\n\nAnything that's non-formulary to the hospital is going to be substituted, otherwise it might not even be in the hospital.  If the specific drug is required, the pharmacy (not a nurse, doctor or administrator) will contact other hospitals to arrange a transfer.\n\nEdit to add: a Pharmacist will usually be responding to Code Blue also.  In this sort of case, if attending orders \"600 mikes potassium IV stat\" and the patient is 60 pounds, the pharmacy may override or ask for order clarification before prepping the dose.  (So many 'harmless' drugs will kill in the right dose.)",
            "When someone fires a pistol (non revolver) until it runs out of ammo and it clicks repeatedly.",
            "Essentially anything related to psychiatry, psychology and/or therapy.",
            "Calling a burglary a robbery.  Every time.  ",
            "\"Zoom and enhance\"!",
            "Being able to see underwater without goggles or a mask.",
            "Oxygen doesn't burn or explode. It makes other things burn better.\n\nBad: Deadpool igniting the air in his tube.\n\nGoid: Jaws explodes because of compressed air so there's no fireball or burning.",
            "Anyone walking into a medical clinic/hospital and asking for any information about a patient at all (not talking about ER assault stuff).\n\nMy dude you literally need a subpoena and then I pass you off to the clinic director. That is so far above that secretary/nurse, if they gave you anything they would be fired so fast that there would be skid marks. Then they would be sued to hell and back (HIPPA).",
            "Military members saying \"Over and out\".\n\n\"Over\" means you're done speaking and awaiting a response.\n\n\"Out\" means you're ending the conversion.\n\n\"Over and out\" just means you didn't even go to Basic Training.",
            "You're not sucking out the snake venom pardner",
            "As someone who has played countless hours of online and live poker, I can't stand any time poker is shown on screen. It's essentially never correct. Poker is long and boring with stretches of hours where you may play few hands, make no progress monetarily. It's not inherently cinematic, so they manufacture ridiculous coolers for dramatic tension. To make it worse, they use winning a cooler (e.g. quads over full house) as evidence the protagonist is a poker genius.\n\nAlmost everything is always wrong - betting patterns, over reliance on the myth of tells, table conduct, etiquette, staking relationships, time scale of games, frequency of coolers, etc.",
            "if you get stabbed, DO NOT PULL THE KNIFE (object) OUT because you will bleed to death.\n\n  \nAlso if there's a tornado, an overpass is a SHIT option to hide under instead of a ditch. Looking at you, Zack Snyder.",
            "For me, it’s the neck break. It’s really not that easy to break someone’s neck.",
            "The two that i cannot suspend enough disbelief for are people hiding from gunfire behind furniture and common drywall, and people electrocuting themselves in bathrooms and hot tubs.  Every scene may as well be unicorns farting Martian faeries they’re so mind numbingly unrealistic.  It doesn’t even require a special consultant to get that kind of stuff right.  There are always electricians on every set, and anyone who has fired a firearm more than a few times or has helped to build or demolish a building knows bullets will go through walls like rice paper.  It’s just plain lazy writing and careless production.",
            "It is really, really hard to kill someone instantly. When you shoot or stab someone in the trunk, they RARELY start hemorrhaging visibly. The bowel cannot just come all the way out of the abdomen like sausage links - they’re bound by the mesentery. People are almost never in a true “medically induced coma,” and when that phrase is used it usually just refers to sedation. Cutting the jugular can be entirely survivable and requires only gentle pressure to temporize bleeding. A nonrebreather mask is not used for mechanical ventilation. The color and behavior of blood is never right but it’s hard to explain how it’s wrong.",
            "If a diabetic has low blood sugar, they don’t need insulin.",
            "Overly precocious children. It's lazy screenwriting by adults who don't know how to write dialogue for a child character.",
            "Defibrillating a flat line.  You can't restart a stopped heart.  There's fine v fib that looks like a asystole (flat line) but movies make a clear point to show  ___________________\nDefibrillators restart hearts that are out of wack like how you restart your computer",
            "I can’t stand seeing people play instruments in movies and shows when they clearly don’t know how to play properly. Especially violin.",
            "I’m a professional poker player - any scene involving poker is often cringeworthy and features once in a million hands. Also stuff you hear about “playing the man, not the cards” is terrible advice.",
            "You don’t. SHOCK. ASYSTOLE!",
            "‘Paper armor’ in every medieval or fantasy film. Real armor works very well and cutting attacks - which are flamboyant and a favorite in cinema- do absolutely nothing against it. Ok, and just about every other trope about the medieval period…",
            "Secret tracking devices that bleep and flash",
            "Fireballs coming off explosions in space. There’s no fire in space since it’s a vacuum.",
            "The 10% brain power thing.",
            "You can’t jump away from an explosion like that. \n\nYou can’t have a heart-to-heart in the middle of a gunfight.",
            "Sweeping a house with an unloaded gun, then getting to where the action is and deciding to chamber a round. \n\nAlso, arms fully extended with a gun in close quarters.",
            "Making a pump action sound with a double barrel shotgun. The absolute worst is when someone dies, their heart rhythm is asystole (flat line), and the shock the patient back to life. Drives me insane.",
            "Requiem For A Dream got the opiate-eyes backwards.",
            "Whenever they get something wrong about the military, which is often. Uniforms, rank, how everyone acts. They kind of pigeon hole vets into being the same",
            "A very good hacker doesn’t even need a computer. They need a phone and a confident voice. The moment any tech show even brings out a computer hacker typing away, they’ve already failed. Professional hacking looks more like The Wolf of Wall Street.",
            "The size of high school gymnasiums for basketball. TV is more guilty of this. \n\nBars being well-lit and quiet enough to talk to someone.",
            "You cannot launch nuclear weapons with just the codes!",
            "Diabetes. Just.... all of it.",
            "The cold weather. The movies rarely get what dealing with low temperatures, ice, and snow is like. Wear a god damn proper jacket and don't take your gloves off!",
            "Silencers",
            "The way people vomit. It never sounds like the real thing.",
            "Military vehicles are not top of the line. Humvees do not go fast or have the ability to burn rubber.",
            "The arbitrary 90 -110 pound woman doing the leg thing and knocking out a 200lbs man in one hit.",
            "Childbirth being 5 minutes of the mother screaming at the top of her lungs. Bonus points when it's in a hospital, and she's on an epidural.",
            "remember that fan made short where robocop blows all those guys dicks off? i had a guy enthusiastically tell me how that was a scene filmed for the original movie but was too x rated so they had to censor it. he seemed so excited and i didn't have the heart to tell him otherwise",
            "Building sprinkler systems. All the sprinkler heads going off at the same time. Sprinklers systems don’t work that way. Each sprinkler head operates independently from the others. When it gets hot enough, a fusible link or glass bulb breaks and sprinkler provides water to that area.",
            "How people are knocked out.",
            "(Some won't say this is a fact, but anyway...)Troy (2004) the movie collapsing the ten-year-long war into two weeks.",
            "Computers don't make 80s hard drive noises",
            "Getting punched in the face and not swelling up like a balloon.  One hit to the mouth, lips swell up, one hit in the eye, and it is black and blue.",
            "Most things relating to diabetes, especially type 1. You won’t die within 24 hours without insulin, unless you’d already not had insulin for a while beforehand. NEVER give someone with low blood sugar insulin, insulin lowers blood sugar so if they’re low you’ll likely kill them. Never give anyone insulin in general unless you know their dose, it’s different for everyone. \n\nI watched an episode of criminal minds and they figured out candy wasn’t the killer because someone was ‘severely diabetic’ and they wouldn’t have taken the candy which is ridiculous. You can’t really be ‘severely’ diabetic, your pancreas either works or it doesn’t and almost all diabetics have something sugary on them at all times in case their blood sugar drops. People acting as if missing one dose makes them start passing out within minutes. People getting one dose of insulin and miraculously coming back from the brink of a coma within seconds when really you’d need hospital and a constant drip of insulin and glucose and you’ll be in hospital for days. \n\nLow blood sugar can kill you within minutes if you don’t fix it but high blood sugar won’t. The symptoms are vastly different as well, the first sign of high blood sugar is you’ll pee more and feel thirsty, not that you’ll feel weak.",
            "Therapist should not date their patients.",
            "When cops in American movies do stuff it's illegal for them to do, like walk into peoples houses without a warrant \"Let's go pay him a visit\" or the old \"We can do this here, or I can take you downtown\". Actually, no. Cops can't just drag you to the police station unless you're under arrest. Then there's the old <being interrogated  by a cop in a small room sitting next to my lawyer> and the lawyer says \"you don't have to answer that question\". Um, yeah... you don't have to answer ANY questions, and no lawyer would be sitting there allowing her client to be questioned by the cops. American movies are chock full of cops doin' it wrong.",
            "Characters getting knocked unconscious with a bump to the head and not having a concussion from it. It's a lazy way for screenwriters to get a character from Point A to Point B. Go to a hospital! Don't fall asleep! And Lord, PLEASE don't get behind the wheel of a car.",
            "I’m a photographer. Professional photographers use their left hand UNDER the lens of a camera to support the weight and zoom/focus… not ABOVE the lens. Probably 75% of the time… doesn’t matter if they’re an extra or the main character, they get such a simple thing wrong. If they spent five minutes looking at photographers they’d see.",
            "A lot of main characters we are supposed to emphasize with in movies would be completely insufferable assholes in real life. Just nonstop abuse, manipulation, and screwing people over. And their efforts to land a partner are usually nothing more than stalking and harassment.",
            "People in movies ALWAYS lift the seat up and hug the toilet bowl itself when they puke. The seat is bad enough, why would anyone cover themselves in dried piss, too??",
            "“Slightly lower ballistic coefficient, touch more slippery” - Marky Mark in *Shooter*\n\nBC needs to be *higher* for a bullet to be “a touch more slippery”.",
            "https://tvtropes.org/pmwiki/pmwiki.php/Main/ArtisticLicensePhysics",
            "\"The definition of insanity is doing the same thing and expecting a different outcome. Einstein said that.\"",
            "“Luke, I am your father.”",
            "Basically everything about fire alarms and sprinklers.",
            "sound in space , space is silent",
            "The ability to drive between any two points in major cities in a few minutes is a constant nit with me.",
            "stomach wounds that kill instantly, that can take up to days sometimes.",
            "Suggesting using pigs to get rid of a body.\n\nIts far more reliable to wrap the body in chicken wire and put it into a carp lake during a weekends fishing. No one even bats an eyelid wheeling the body along with all your fishing gear.",
            "Someone getting shot in the head, they always fly backwards. No, its instant lights out, you buckle straight down, your body collapses on itself.",
            "Journalism is NEVER portrayed accurately. Never ever. Especially broadcast news.",
            "There’s a reflection in the image. [Can you enhance it?](https://youtu.be/Vxq9yj2pVWk?si=RAtmuMDoPwkoezfn) Lol",
            "Quicksand being so dangerous. I’m looking at you Never Ending Story.",
            "I build elevators for a living. My wife LOVES when I point out every thing with the elevators in movies lol.",
            "That DNA and forensic results come back within hours. In real life it can take up to a year in some cases for results to come back due to the crazy backlog. I get that would make for boring movies and tv though! Haha",
            "Wings on a spaceship are useless in space. You can’t turn like you would in the atmosphere and would need thrusters in multiple directions to maneuver.",
            "To add to this, silencers turning any gun into the sound of a blow dart.",
            "One of my favorite theories ever is that the reason they keep running into zombies in the Walking Dead is because everyone has been shooting guns without ear protection for years on end, so they're really stomping around everywhere, being loud as shit, shouting at each other, but don't realize it, because they can't hear anything anymore.",
            "Or having zero kickback. I was watching a show with a teen girl firing a rifle and there was absolutely zero movement after the shot.",
            "mwap",
            "I'm okay with it not defending anyone, but an action movie with bad sound design loses a lot of points. Weak gunshots lack energy and intensity.",
            "TERRY I DID MY FIRST DESK POP!",
            "I went to a pistol shooting range once. Even with ear protection I was flinching at the sound whenever someone shot. Guns are fucking LOUD.",
            "“The Fugitive” got that part right.",
            "WHAT?",
            "I liked when Rick knocked himself out firing a revolver in a tank in the walking dead",
            "Hell, depending on what’s being fired you’ll be deaf even *outside* if it’s close enough.",
            "And the sprinkler water being so clean.",
            "The movie ABC'S of Death 2 has a segment on this. An amateur hitman plans to crawl through the vents to get his target and they show him imagining the ducts being clean and easy to get through. Then they show the reality of him getting poked by screws and dust flying in his face and he eventually gets stuck and dies of starvation",
            "Also these air ducts are always large enough for a full grown adult to crawl through relatively easily, and strong enough to support their weight.",
            "Dumb question from someone who has never done mechanical design for buildings: What *is* inside ventilation ducts then?",
            "Or the ducts holding the weight of a human or an alien",
            "I’ve also heard that getting shot, especially by a smaller caliber bullet, is unlikely to knock someone over or make them fall down. A bullet hits hard (because it’s moving fast), but has very little mass. Apparently people sometimes fall down when they get shot because they think that’s what’s supposed to happen. Very strange.",
            "*Patriot Games* actually managed to get this more or less right when Harrison Ford is shot in an early scene.",
            "Have you even just INJURED your shoulder? It fucking hurts and takes a lot out of you.  I sleep on that shit wrong it takes me a week to recover.",
            "In high school I was knocked out in a really bad school bus crash. It was only for a few seconds and when I came to adrenaline took over to evauate out the back and get across the road where they had everybody lying down.  But that was that all I had left in me at that moment.  I wasn't on my feet again till hours later leaving the hospital.  My mom took me to the doctor the next day and I was still half out of it.  No shocker of course I had a concussion.\n\nSo yeah its not like having a big lunch and falling asleep at your desk and you get up and OH SHIT IM AWAKE.",
            "Movies are weird in that they show people being too durable AND too fragile. \n\nShot in the stomach in a movie? Instant death. \n\nMassive gaping neck wound? Hold your hand over it. You'll be fine.",
            "Yeah, that is like SUPER bad for you.",
            "I stopped resisting this trope years ago. It's just so handy. I love *so much* the idea of everyone having a PAUSE button on the back of the head that can be activated with a medium impact.",
            "I think it was Archer that incorporated that into the show. Like when someone got knocked out they'd talk about how bad it was and tell them to get an MRI",
            "If you get knocked out from blunt trauma to the head, you have received a brain injury.",
            "You either knocked out for a few seconds, which still means you probably have a concussion. Or you are knocked out for a long time period and you probably have brain damage.",
            "For real. If someone faints and stays out for more than a minute or so, that's big time bad news. A lot of things can make the brain do a soft reset (vagus nerve getting too excited, you faint, brain re establishes normal conditions, you wake back up no problems) but blue screen of death during boot up is very bad.",
            "also, when you get knocked unconscious, unless you've specifically been given sedatives, you SHOULD wake up fairly quickly. if you don't and you're out for hours, even long ass minutes, then something is very, very wrong.\n\n  \nlike you get choked out and pass out, as soon as you start breathing again and your brain gets oxygen, you should be waking back up. if you're not, then the oxygen deprivation obviously did damage.\n\n  \nbut nope, people will get knocked out cold, be out for hours, and then wake up and nothing is wrong.",
            "the way you beat a hacker trying to hack into your system is having two nerds type on the same keyboard at the same time.",
            "It’s a Unix system, I know this!",
            "Hack the planet!",
            "CSI and NCIS are the WORST at these. Or the best, idk \n\n https://youtu.be/hkDD03yeLnU?si=0LHDRCXjlwkECPIb  \n\n https://youtu.be/kl6rsi7BEtk?si=Wqb-GbH4aORQndTS",
            "ENHANCE",
            "\\*typing fast on a keyboard in a high security computer\\*\n\nI'M IN!",
            "Yep, that and the medical buggery that goes on probably because I worked in both of those fields.",
            "It’s going to be worse when they talk about AI",
            "\"I'm almost in!\" *types frantically* \"Oh no, I'm caught in a firewall! They'll be here in 5 minutes!\"",
            "Just saw an anime where the genius protagonist was typing on an infected computer and declared he created  an antivirus",
            "You just have to type faster!",
            "When the screen flashes \"ACCESS DENIED\" in big flashing red letters while beeping loudly enough to wake the dead.",
            "Or, ya know… blown up and flung a long distance in a refrigerator.",
            "Yep, unless you're a super hero you ain't surviving.",
            "Yeah… getting blasted off your feet and blowing back by an explosion… your organs are now all liquid",
            "You're really not going to like Home Alone 1 and 2",
            "Yes, the old Carrie Bradshaw \"I'm a columnist for a bi-weekly newspaper who can live in Manhattan and have a closet full of $700 Manolo Blahniks and Jimmy Choos\" fallacy.",
            "To be fair there was a time when there used to be a lot of abandoned warehouse space in Manhattan after the shipping container suddenly made all of the piers obsolete. The trope of the cool artist squatting in the giant converted industrial space became trendy for this reason and now any place like that has been a multi million dollar condo for the last thirty years.",
            "People yelling “taxi!” Is mine. Just doesn’t happen.",
            "Don't forget every family's suburban house looking spotless and new and nothing like anybody has ever actually lived in it.",
            "I recently watched a video that a pen tester made about someone in lower Manhattan. \n\nHe shows the webpage about the prices for a luxury high rise. $2500. Not too bad. Nope: per ft^2",
            "I've lost the bleeps, I've lost the sweeps, and I've lost the creeps.",
            "I was instructed to empty my lungs, take a hit from the inhaler, hold it in for 10 seconds, exhale and repeat one more time.\n\nIn movies they just hit it once and immediately take a deep satisfying breath. It's stupid.",
            "Stuck behind pay wall, but a study on just how badly they suck at portraying inhaler technique.\n\nTLDR they suck. \nhttps://www.researchgate.net/publication/286445397_Do_the_media_demonstrate_correct_inhaler_technique_in_children",
            "as one my self i think mads mikkelsen in casino royale did a good job",
            "mikey at the end of goonies\n\n\"Ah, who needs it?\" *casually tosses it away*\n\nYOU! YOU LITERALLY NEED IT!",
            "One of the few things The Goonies got wrong. If you don't close your mouth around it and breathe it in, it's like trying to drink something with your mouth wide open and just pouring the liquid in without swallowing. \n\nAlso him throwing his inhaler away because he was confident now.",
            "Then suddenly when the nerdy main character gets a burst of self-confidence, he throws the inhaler away over his shoulder, because life-saving medication is for pussies. \n\n\nThat's not how it works! I wonder how many kids have died in real life choking on their last breath because the movies told them that if they just have self-confidence they can survive an asthma attack.",
            "or going over a cliff and exploding in mid-air!",
            "*Tsew*\n\nThat silencer fight in John Wick is so funny",
            "THP",
            "It's really weird that anyone thinks a suppressor could possibly behave that way. Guns are stupidly loud, even small calibers. And don't even get me started on the fact that the same movie will have someone rack the slide back with a satisfying, and *loud*, \"ka-CHUNK\", but a little piece of metal on the end and suddenly the action of the weapon is completely silent, like it doesn't make that sound every time it's fired.",
            "And would be very noisy too",
            "So not ideal for spying on the bad guy's master plan just before crawling your way out of his prison?",
            "Fuel stabilizer would be the true coveted resource. Sta-Bil would become the gold standard.",
            "Fury Road would have been way lamer with mountain bikes though",
            "5 years into the zombie apocalypse that killed 99% of the population and people look like medieval barbarians  because somehow all those warehouses full of shoes and clothes vanished together with every hardware store and the solar panels and generators and two Taiwans full of Lithium batteries are gone too.",
            "I went to the range with a friend ONE time to practice shooting various 9mm pistols. The starting position was like 7 meters. It's way harder to aim accurately than a rifle.\n\nI remember actually one movie that got this right. It was a a C-grade film in the mid-90s and these two lunkheads found a bag of money or something and steal it. They decide to buy some guns because they know the original criminals who left the money will be coming after them. They go to the range and get all cocky like they're in an 80s action film....and then miss every shot.",
            "Well I guess that partially explains why the main characters never get shot while running away.",
            "Except for McCoy: “Damn it! I’m a doctor, not a ___!”",
            "\nThis was conceivably easier back in the day, when it seemed feasible to have a grasp on all the knowledge of the time, being a generalist much more than the rigidly specific disciplines which evolved since. Like the ship's doctor (again the stereotype) on the sailing ships who could quote their Greek and Latin, identify species and have a good philosophical debate. Even that idea has seen a lot of embellishment from basic fact.\n\nPractically it's an absurd prospect to know *everything*, even back in the day, but the idea of the ship doctor being THE source of knowledge by being only the educated man among the unlettered mariners has carried forward, even when one imagines many people serving in space only get there with quite an extensive education.",
            "I swear if I see another scientist fold a piece of paper and push a pencil through it to explain wormholes, I’m gonna crawl into an air duct and never come out.",
            "I’ve seen doctors shock asystole IRL in the ER a few times. It was always a “fuck it, maybe it’s a fine v-fib… not like they’re getting any deader” type thing with no expectation that it would work.",
            "Not only that, you don’t just shock a person repeatedly until it works and forget about CPR.",
            "Yeah, it's literally in the name. A defibrillator defibrillates a fibrillating heart.",
            "And also nobody does CPR right, or even close.",
            "\"That last hand... nearly killed me.\"",
            "I’m gonna expand on this. Any depictions of respiratory support, like ventilators. Some of that stuff is OUTRAGEOUS. I know these people aren’t trained in proper equipment usage but damn",
            "And it sounds like they are sharpening the knife as it goes into the flesh.",
            "100%! I’m practically shouting at the TV when characters almost instinctively start pulling out a deeply-lodged knife out of their wounds. You have to keep them in place until everything they can be taken care of in surgery!",
            "Just once I'd like to see a detective in a movie repeatedly blow off a DA tech who's been trying to get body cam footage or something for like three months.",
            "Also, some small town in Maine has one murder per week.",
            "I like the one where the urban homicide detectives go to question someone (witness or suspect) at their work and the person is really annoyed that they are keeping him from unloading a truck, or sweeping the floor.  “Get out of here, detectives who are considering arresting me for murder, I got too much to do to try to clear my name!”\n\nEdit:  I have not seen that John Mulaney bit; those scenes have bothered me since before I ever heard of him.  ",
            "Yeah, but almost everything you listed is not done because they don't know it's incorrect, but because they don't want to waste a bunch of film time showing nothing happening on screen. Same reason we don't often see people going to the bathroom.",
            "I'm assuming cases are in color, not dingy hues of blue, green &  grey.",
            "Ooh. Tell us a bit about you! How many murders do you work on per month? What percentage go unsolved? Is there a major satisfaction in solving a case? Which aspects of the job do you enjoy?",
            "I love the premise that every crime has a team of highly motivated competent individuals dropping everything else to focus on **this one crime**.",
            "Baby comes out clean, glowing, with umbilical cord already cut.",
            "My wife was induced for our kids.  For the first one, we'd developed a great relationship with the doc, and she jokingly said, \"I could break your water right now!\"\n\nThen she fucking did it and I watched the whole thing.\n\nI've seen movies, I knew they hammed up how much fluid would come out. I just assumed they'd go over and not so far under. Poor wife must have gushed like a 5gal drum for like 20 seconds",
            "Honestly everything related to women's health is pretty inaccurate.\n\n\nEmergency contraception and medical abortions are often misconstrued as being the same, when they are completely different and work completely differently. Emergency contraception prevents a pregnancy, a medical abortion will terminate an ongoing pregnancy.",
            "The always show the water breaking but never show the mucus plug which comes out first. \n\n(I didn’t know what a mucus plug was until I went into labor. I was told not to come back to the hospital until that happened. Like WTF! - and before you ask I had to stop reading maternity books because I was freaking out left and right afraid to do anything or eat anything)",
            "A more-realistic depiction was in *Micki and Maude,* where a hugely pregnant Maude is auditioning for a symphony orchestra and plays a few notes, then gets a weird look on her face, then says matter-of-factly, \"My water just broke.\" No emergency, no screaming.\n\n(She's shown later playing with the orchestra, so presumably they were kind enough to let her audition later.)",
            "I had to assist my wife with delivering our daughter and boy I was not expecting to take out a blue grey red yellow brown black white potato in my hands.",
            "There needs to be a study done on how much women's expectations of pregnancy or desire to get pregnant at all have been shaped terribly by movies and tv",
            "Sir you know too much about chloroform ",
            "Have tried it. Doesn't take 10 minutes, more like 1-2 minutes, but you need to be breathing it constantly.\n\nFeels very cold on the lungs, then you feel light-headed, and finally the world closes in. You come round quickly, but with a banging headache.\n\nYou would need to have someone cooperate or heavily bound and keep a steady dose once unconscious to make it work.\n\nSauce: As a teen this is up there in the list of stupid shit my bro and I did.",
            "\"Does this rag smell like chloroform to you?\"\n\n\"No, it smells like cum.\"\n\n\"SHIT, wrong rag.\"",
            "Ohhhhh that's a good one. I mean, it's a terminally ingrained trope we'll never get rid of, but it's *so* far from accurate I'm not sure how it caught on. In fact, I'd love to know the first time that bit was ever used.",
            "Computer! Enhance!  Was previously always laughable because you’d just be zooming in to grain on a degraded image in theory.\nI hate to say it but we might be a crossroads with AI where now we can automagically bring in details, even if they are invented / additive / assumed. \nI mean it might not be good, but it’s now a thing for better or for worse. Of course in the movie they always have some pixels swirling around like a slot machine before it reveals an identity.",
            "Do you one better.  In the early nineties you'd sometimes see Photoshop in detective shows and it could select an object (one click) and then simply remove it, leaving whatever was behind it visible.\n\nSaw that shit on at least 3 shows.",
            "Red Dwarf had the best take on it.  \n\n[https://www.youtube.com/watch?v=EMBkWtDAPBY](https://www.youtube.com/watch?v=EMBkWtDAPBY)",
            "They just need to cut to the other person, looking bewildered by the rudeness.",
            "And they answer the phone with \"yeah\". ",
            "I’ve always noticed that! So fucking rude.",
            "Your answer reminds of early days of car chases when they dubbed squealing tires over every scene, even if they were on grass, gravel or dirt roads.",
            "God, i wish cell phones actually gave a clear, repeated audio signal about a connection being lost. Its annyoing to go the whole \"You still there? Can you hear me?\" route when there is a spotty connection, in particular with noise suppression on modern cell phones being so good you do not hear any background if the other side is not speaking.",
            "This one and sharks are evil have done a lot of harm",
            "Happy Gilmore accomplished that feat no more than an hour ago.",
            "You eat pieces of shit for breakfast?!?!",
            "But *only* if they're nervous",
            "Microphones can detect nervousness",
            "As someone in the a/v industry, I suspect the vast majority of people don't know that the level of those microphones is almost always being adjusted by a technician. If there's feedback, it's not because the speaker is feeling awkward. It's because the speaker decided to stand in the wrong spot, and / or is too far from the mic, and / or the sound guy sucks.",
            "I’m in AV and everyone picks up the mic and hammers on it ‘is this thing on?’ and if not it’s quickly followed by ‘this stuff never works’ because you idiot are hammering on highly sensitive equipment!!!",
            "I like to poke fun at this with Game of Thrones/A Song of Ice and Fire. There's a multi-continental spy network that apparently has a completely flat organizational level with no mid-level management. All of the field agents/spies report directly to the one Spymaster. That individual is responsible for knowing every detail of importance in all the world. Bonus points in that many of the spies are children who have had their tongues cut out and therefore can't speak.",
            "\"Madam Secretary\" did that really well.",
            "But the sound it makes when the retrieved bullet is dropped dramatically on the metal tray is so satisfying.",
            "Although I did recently see a IRL video on another site where one fella accidentally shot his buddy in the leg and the shooter immediately leapt on the gunshot wound and pried it open with his fingers because \"you gotta get the bullet out!\"",
            "Lmao funny enough working in a role that isn't INFOSEC or technically security, but having to work closely with those two departments, at least two of those are consistent problems. \n\nPeople will be invited to wait in an office when the front conference room is busy. People just walk away without locking their computers constantly. It's a constant battle and an absurd one when you consider it's just pushing two keys. (Of course, the company sets a time limit and auto-locks for inactivity, but it's a large enough window for someone to get in and start snooping if they were nearby.)\n\nI think there's also very often an attitude with open offices that all your coworkers are around and would notice something off, but really in a day you're so concentrated on your own work you're probably not checking other desks. I know for me I've often gotten in a flow state and looked up to see the shift change happened and I hadn't even noticed the switch.",
            ">In my professional life, people who had actual offices were very careful to keep them locked even when going out to lunch.\n\nExactly!  At some big companies they even make it part of the culture to have people do something silly (set it to a particular mocking internal site or something similar) to your unlocked computer to make sure that you remember the next time.  To add to what you said most of those writing screenplays don't know that large companies are **very** well-aware that their employees can end up being a major point of failure in terms of security.  For that matter sometimes companies even will attempt to phish employees with e-mails to gauge how things look security-wise or see who needs to go back through the technology security trainings.",
            "ALL BIRDS SOUND LIKE THE RED TAILED HAWK IN A CANYON.",
            "Thank you. I understand that something like \"uncontrolled supercriticality\" is probably too much of a mouthful to be spat out in a crisis situation, but \"going critical\" is literally just part of starting the goddamn reactor up and keeping it going.",
            "\nShoot? Get some proper ogham on a cudgel and beat them about the head with it. Not sure if a shillelagh would qualify for the role, though, so just going with the broader and safer whacking stick.",
            "*In ancient times...hundreds of years before the dawn of history...lived a strange race of people...the Druids. No one knows who they were or what they were doing...but their legacy remains...hewn into the living rock...of Stonehenge.*",
            "Do you mean that Druids weren’t just old British wizards?",
            "As a Classicist, I feel this. The Romans and Greeks often get done dirty too.",
            "I'm going to say that if someone shows up looking like that I'm going to try to stay hidden because they're highly suspicious as they're *somehow* sourcing that many calories when there's no established industry and infrastructure to provide those to them.",
            "Greetings from the Humungus, the Lord Humungus, the Warrior of the Wasteland, the Ayatollah of Rock'n'rolla!",
            "Yeah, like, not in MY experience, Mr. Fancy Hollywood Script Writer.",
            "In real life you'd cut off the blood to their brain, they'd pass out, and then you'd leave and they'd wake back up.",
            "The two *hwhaaaat?*",
            "The stereotype of chloroform Instantly knocking someone out got so bad, that the manufacturers offered a payout to anyone who could prove it would render anyone unconscious. Because it doesn’t. Loopy and nauseated, yes. Unconscious, no.",
            "To add to this, when guns make insane amounts of noise just moving around.. watched equilibrium the other day and the amount of rattling noises was hilarious",
            "I love in national Lampoons Loaded Weapon 1 Everytime a character takes their gun out it makes the cocking noise no matter what.  Slays me every time.",
            "You clearly know nothing about guns. Pulling the slide back in such a scenario adds a +35% critical hit chance.",
            "Someone is holding a shotgun on someone for 2 minutes...then for dramatic effect they FINALLY rack and chamber a shell.",
            "House is my favorite TV show ever, but it is so laughably inaccurate at times that it's straight up hilarious. Shocking flatlined patients back to life, the doctors performing every test ever themselves, the breaking into people's houses, the prostitutes in the hospital... They do kind of poke fun at it when they say how much of the hospital budget is allocated to House's lawsuits.",
            "This one is common enough that I’ve gone “wait, am *I* doing it wrong?”",
            "umm, can you *not* see underwater?",
            "I can see pretty well underwater in our semi murky lake with contacts, just have to be sure to squint so I don’t lose them. (Don’t do this it’s dangerous and you could get an infection and lose your eye)",
            "I can see underwater pretty well though.  Certainly well enough to find something for instance.",
            "I can do that, can people not do that? I caught a crayfish out of the St Lawrence river the other day swimming after it underwater. \n\nI’ve always had good underwater vision but chlorinated pool water definitely causes irritation after a while.",
            "Can confirm. Took me a lot of tries to get it right",
            "Or kill them with a pillow. It doesn't really seal around the mouth and lips properly.\n\nViva La Dirt League made a [great video about this](https://youtu.be/34yPfGn658E?si=7S0GvtAWfXIROktl).",
            "I remember watching the terminator TV show and Sarah Conner hides from bad guys firing rifles by ducking behind an armchair, it made me almost stop watching, but when the police are investigating the scene, one of the detective mentions that it's odd that this armchair is full of ballistic plating and kevlar. Still ridiculous but at least they made an effort",
            "my wife always asks me, \"Do they know how to play?\"\n\n\"No, they aren't supposed to put their mouth all the way over the strings.\"",
            "Seriously, can the director not hire a coach for five minutes to show someone how to realistically fake playing?",
            "I think we use 10% of our hearts.",
            "Never heard the word asystole before in my life and it's like 20% of the comments here 😅",
            "Or is someone sitting at a computer playing minesweeper or whatever for a few hours while some program runs in the background doing the necessary work. Or someone sending an email, because they just needed the target to open an attachment which compromised the target network in some minor way.",
            "Not a movie, but there was a Law and Order episode where they spent half the episode trying to figure out how an \"unhackable\" data system got hacked for information. In the end, it turned out an older guy just called customer service, claimed to be the account holder, and sounded so confused and pathetic that the customer service agent gave him the information he needed. And that's exactly why rules are rules in these situations.",
            "That's why Sneakers is so good. It's mostly down the social engineering.",
            "Uhhh depends on the school bud. We had one of those kinds of gyms at Lane Tech HS in Chicago.",
            "I am going to assume you are not from the US, those sized gyms are relatively common here",
            "Ima disagree on this one. The last thing I want is realistic vomiting. 😉",
            "This one might actually be on purpose tbh. Whenever I hear actual vomiting, its enough to make me want to vomit myself.",
            "You never used to see people vomiting in movies and TV shows. They would stick their head in the toilet, or a trash can, or over the side of something, and you would just hear the noises. That changed in the late nineties or early 2000s. I wish it hadn't!",
            "I’m so effing tired of puke scenes.",
            "I know this is movies, but I thought the way the woman reactionarily vomits in the most recent episode of the boys was pretty realistic looking",
            "I once got stuck on a call with someone vomiting. \n\nI feel like accurately capturing that sound is genuinely bad for the audience. Gag reflexes are odd.",
            "That goes quadruple for sneezing. Why can’t even the best actors fake a sneeze convincingly?",
            "When do they do this in movies?",
            "They're also not especially reliable, don't fit many people (and none of those people are particularly comfortable), and they're pretty flimsy / very susceptible to even small arms fire. They're just \"good enough\" for the price the contractor was willing to make them at, like everything else in the army.",
            "Well most cops do illegal stuff constantly so that sounds accurate",
            "Damn dude, clean your toilet...",
            "“Did you ever hear the story about the scorpion giving a frog a ride across the river on its back?”\n\nYes Brad like 100 times, stfu",
            "Okay Tommy Boy!",
            "*fwip fwip fwip*",
            "To add to this, any gun making a shit ton of clicking sounds simply by being wave around or raised to point at someone menacingly.",
            "TBF, it does kind of work with a .22 firing subsonic ammo for hitman scenes.",
            "That’s also a misconception about deaf people. Were thought to be quiet ones but no, we’re the loudest bunch because we don’t realize how much noise we make in routine.",
            "That's......solidly reasonable.",
            "Speaking of guns.\n\nShooting somebody in the legs just to “wound them”\n\nYou’ll actually kill them a lot more often then you think.",
            "I always wondered about that growing up. Then I enlisted and first time firing the M-16A2, our Drill Sergeants made us fire blanks to get a feel for actually firing a weapon, and then movies made more sense to me after that.",
            "I have to sleep with a fan on!",
            "Imagine if John Wick were directed by Michael Mann? There would be no reason for any other sounds in the entire movie because the gunshots would be so deafening.",
            "I love that it actually takes a ton of work to make gunfire sound impressive, simply recording actual gunfire with normal microphones and playing it back isn’t very impressive at all, partly bc mics and speakers aren’t designed to record or reproduce things that are that loud.",
            "That was when it was directed by a skilled director. And he was fired shortly after. Oh.. The walking dead.... What you could have been....",
            "I guess Blade pretty much got the sprinkler water color right then.",
            "Fall of the House of Usher was closer to the truth.",
            "Leave it to a McClane to give us the low down on interior duct condition!",
            "Wouldn’t he die of thirst like weeks before he starved",
            "This sounds like my honeymoon.",
            "Only the most greased up scotsman can accomplish this feat",
            "\"Come out to the coast, we'll get together, have a few laughs...\"",
            "Dust and screws poking through",
            "Dampers to control airflow and turning vanes where the ducts turn to make the air go around corners more smoothly.",
            "In Somalia during the Black Hawk Diwn fiasco they had issues with their bullets passing right through people without quickly \"stopping\" those people. \n\nTurns out it can be shockingly difficult to stop a determined attacker quickly and/or efficiently.",
            "I remember a Walter Hill movie where Bruce Willis shoots a dude and he basically flies backwards through a bunch of shit from the impacts.",
            "Bullets don’t have the kinetic energy to move a person. As you say the shock of being shot can certainly make you fall down, and sometimes muscle spasms as a result of the wound will do the same, but people being blown multiple feet backwards by a gunshot is complete Hollywood nonsense. \n\nThink of it this way: if the blast was strong enough to throw a grown man ten feet backwards, the recoil of the shot would do the same to the person shooting the gun.",
            "Tom Clancy novels are on a different level of realism (until the later series that felt more like super spy stuff)\n\nHis prediction using passenger planes for terrorist attack, lone wolf gunmen, and how Russia couldn't manage logistics to save their life, all spot on",
            "Also, bullets shatter bone. I had a friend have a stupid fall and he just hit the curb and broke some bones in the shoulder, it involved surgery to use metal wire to string everything back togther and then months of immobilization and physical therapy for him to be able to grap something above head level again...",
            "It’s not just that it hurts, you’re literally severing the muscles that allow the arm to move.",
            "For some reason that brings up a redditor's story about him getting knocked out by a guy, and he dreamed an entire life with someone. They dated, got engaged, married, had kids, grandkids, grew old together. It wasn't until he was sitting on the couch staring at the lamp and realized it was all a dream. Took him a few moments to realize. Vivid/lucid (I may be using the term \"lucid\" incorrectly) dreams are weird.\n\nHe woke up being put into the ambulance not long after getting knocked out. Poor guy needed therapy because he legitimately thought it was all real. But to him, it did actually happen!\n\nI've had dreams like that, but not that long. Not a life time's worth...",
            "Yeah, movies make it seem like most gunshot wounds are instant death \n\nUnless it’s a head or heart shot, they aren’t at all",
            "Good guys only get shot in the shoulder, but not the main good guy, it's his buddy who is also a good guy that gets it. He's in the back of an ambulance though, so you know he'll be ok.",
            "My single favorite line from that show.",
            "But you get like, six freebies.",
            "In reality, it takes a highly-skilled Igor to accomplish a nap of any duration with anything like safety, as in Monstrous Regiment. Or I should say Igorina.",
            "It's like, super bad for you.",
            "One day in the future that will be true, then NCIS will be seen as visionaries, like Star Trek and their communication devices and transport beams. Then you'll be sorry",
            "And then you power down the computer you're remoting into the server with…\n\nhttps://youtu.be/u8qgehH3kEQ?si=QsPBx17O-eCIAn1i",
            "That's TV bosh.\nEveryone knows a real hacker by their fingerless gloves",
            "This reminded me of how \"Mr. Robot\" was pretty well made and they tried to make sense of the hacking bits, just not adding random screens and turning the tech chat into something based on real hacking...\nMeanwhile, and almost at the same time, there was that CSI spin off about cyber crime that showed them tracing the ip of the hacker they were looking for with an Excel macro.",
            "Weirdly enough, that *was* a Unix system. It was IRIX running the fsn file manager. So, I mean, she’s not wrong.",
            "Hammond had one IT guy for a theme park.  He was asking for something to break.",
            "What bothered me on that one was that the \"live\" security footage was a QuickTime video!",
            "Well, it was.  \n\nThat was an SGI workstation running \"Irix\" (their Unix clone), and that weird 3d-looking \"file explorer\" was one of the more popular OpenGL demos (actually, IrisGL, which was a precursor to OpenGL).  \n\nIt showed you each directory as a collection of buildings or blocks, and you could double-click on a \"directory\" block to open up the directory.  It also had some support for showing file type icons and file previews mapped onto the surfaces of the blocks.  Made for a jazzy demo.",
            "Okay, I'll fold on that one.",
            "HACK THE PLANET!",
            "Indeed",
            "Such a fun movie. Not accurate at all. I'm just about to finish it again.",
            "The 2 people on one keyboard is one of my favorite bits of all time.\n\nI can guarantee that at several points from script to production, someone spoke up and was like \"y'all are aware that's not how keyboards work, right?\" The writers and their assistants that use keyboards every day. The prop person, who upon reading the script asked \"do I need a 2nd keyboard for their anti-hacking double team effort?\" The tech advisor (usually a retired officer from the relevant field/agency) who's job is to offer their expertise to keep it somewhat realistic. And then the actors on the day, who also presumably have used a keyboard at some point in their life, and were like \"you want us to do what? 'Share the keyboard' how?\"\n\nAnd throughout the whole process, the show runner/director stuck with it and replied to all of them, \"no, this is gonna be great.\"\n\nI fucking love it",
            "Supposedly the writers for those shows had an informal competition going to see who could write the most ridiculous scene involving computers.",
            "Those shows are to computers what Bill and Ted is to time travel.  That first one is one of the two things I was thinking of when I made this post, the other being Skyfall.",
            "Anyone ever hacking into a medical system and actually finding what they need, especially if it is from more than 5 years ago.",
            "To be fair, with the kind of plot armor Indy's got, he didn't really need the refrigerator.",
            "Nukes. Why did it have to be nukes?",
            "Even then, Rhodey should've been soup in his Iron Patriot suit after the fall he took in civil war.",
            "My ex used to watch that show and I absolutely lost my s*** on one episode where she can't make rent but she's worried about which pair of $700 shoes she should return",
            "This is why broad city is so great. The apartments are so realistic, especially Ilana's",
            "Fully agreed but she was depicted as being in financial dire straights several times. I like when the others called her out on her terrible spending.",
            "Or what about the show Friends? Im Australian and even I knew that they had crazy huge apartments for NYC that the characters would never have been able to afford to live in.",
            "Coolest thing I've learned on reddit today!",
            "I didn’t know that.",
            "And this could be a great bit. The five kids just finished running away from the big bad and are hiding in the abandoned house in the woods. The group needs to plan, but one says he needs his inhaler and they wave him off while they discuss. Four are in the foreground around table hashing things out, while in the background the one is going through his long drawn out inhaler ritual. The 4 argue for a while, but eventually reach a consensus on what to do. They are about to leave and one asks the other \n\n\n\"you ready yet?\" He's coming down. \n\n\n\"Yeah I think I'm good.\" \n\n\n\"Did you get all that that?\" \n\n\n\"yeah x, y, and z\" \n\n\n\"ok let's go\"",
            "Agreed.",
            "He can do no wrong.",
            "\"Gonna hit the ground anyway, might as well pre-splode\"\n\n- car, probably",
            "Bahahahaha, the onomatopoeia loudened me",
            "The one where they’re walking down a crowded concourse kind of shooting at each other from under their armpits and nobody notices?",
            "Actually, I think diesel is where it would be at.  Diesel fuel is stable for years, so everyone would want diesel engines and fuel.",
            "I think even that would only extend it for another year or so.",
            "Gas Town was presumably making gas for that one at least.",
            "Sir, that was \"Guzzoline.\" Or so the People Eater said. Lol.",
            "Watch turbo kid and I’ll tell you it’s not.",
            "There's a movie called Turbo Kid and it's basically the same vibe as fury road except they all just have mountain bikes. You got this metal mask wearing monstrosity on this peddle bike in hot pursuit. It's an awesome movie",
            "Kinda disappointed nobody in Fury Road ever had a horse, tho. Not saying they need to ride into battle against the monster trucks, but in a future where gas is rare, I would think regular folks would be mostly getting around on horseback.",
            "Only unionised Doctor. He will do his job to the letter and not a smidge more.",
            "Say hi to Annie's Boobs for me. (Don't say hi to Chang.)",
            "Always my favorite bit of movie lore is Christopher Lee explaining to Peter Jackson that his stabbing scene is inaccurate, and goes on to explain what it sounds like from first hand experience of ww2.",
            "The Wire sort of did this. They made a big deal about how a mountain of paperwork was involved to do any little thing you wanted to do. Several times showed scenes of them just typing in a room, trying to get the paperwork in before the deadline.",
            "Yes!  One a week but only one.  And the killer is always the least likely suspect",
            "She. Travelled. A. Lot.",
            "The affluent and quiet little towns of Midsomer in Midsomer Murders and Oxford in Inspector Morse seem to have a higher homicide rates than Port-au-Prince or literal war zones",
            "I loved Longmire but I swear half the people in Wyoming would be dead by now if it was real.",
            "A tv show, not a movie, but if San Francisco truly has as many complicated and creative murders as in Monk, there really needs to be scientific study on wtf is in the water in that city.",
            "Yeah, like, wouldn't the most beliveable reaction for _anybody_, guilty or not, with the cops showing up like that to go \"WTF what did i do?!\"...",
            "I feel like I've heard this from a comedian? Mulaney maybe. But yes still true",
            "Not only that, but teenagers that have been brought in as murder suspects are always completely self-possessed, and will, whether innocent or guilty, mouth off to the homicide detectives who basically want to put them on death row.",
            "Yes, sure, I fully understand.  It wouldn’t be a good story if it revealed most of it is mundane and super time consuming",
            "True, not to mention the odors",
            "...and visibly two months old ",
            "Coneheads movie. Her water breaking is what you’re thinking of.",
            "And all over the floor no matter how many towels they put down.\n\nAnd the smell, you never get that in the movies.",
            "I had to learn it the hard way when I obtained my first wife.",
            "I think that it's funny when they still do that.",
            "Are you saying that sharks AREN'T responsible for all missing persons?!\n\n'cause that's nuts. We both know they are.",
            "Hollywood ruined the reputation of sharks, catfishes, killer whales, so many aquatic species",
            "Well good for him, moro-Oh my God!!!!",
            "Stupid anxiety-detecting microphones",
            "I never ended up in IT, but I took classes for it. You almost had to 'windows key+L' if you even turned around in your seat because your desktop would end up upside down with the background changed to sexy firefighters or MLP or some other embarrassing nonsense. I had some chrome extensions that I liked to use when I had a few seconds that changed every photo you saw into nic cage, and a subtle one that changed every instance of the word \"cloud\" into \"butt\" so a bunch of files were stored in the butt.",
            "~cannibalism ",
            "Geez, I WISH it worked that quickly!",
            "Two yoots!",
            "Yes, but also that movie is incredible.",
            "...maybe? Things are blurry, and if the water has silt in it then you can't see anything, but in general I can open my eyes underwater and see, like, where people are, that kind of thing. And the fact that I normally wear glasses probably contributes to the blurriness, someone with better eyesight can probably see even better",
            "I read a book on early hackers, including Kevin Mitnick and his early buddies.  One was a woman who ultimately got into computer security.  She's consulting for the Pentagon and the military officers in a conference are basically laughing that this \"little girl\" could cause them any trouble.  In front of them, the \"little girl\" gets one of the officer's (Officer Z) office phone numbers, gets on the phone and speaks with a secretary saying she's \"General X's secretary and Officer Z is trying to show General X something but forgot his ID and password - could she get Officer Z's ID and password, please?\"  She got Officer Z's ID and password - all while the previously derisive Officer Z watched.",
            "The Rock. You clearly need to watch The Rock. It's a special kind of action movie.",
            "Nailed it",
            "My favorite example is the person waving a Glock around in a dramatic showdown with the bad guy and the Glock made no less than five different clicking sounds as they re-posed for drama.\n\nThere’s no manual safety switch.  The round was already chambered.  What were the five clicks? 😹",
            "Similar to swords going *shing* when being unsheathed.",
            "Try having a nose that doesn’t work.\n\nWhen you do t live in a world of smells, you are often the stinkiest.",
            "I've met a fair share of deaf people.  They're either loud or silent, with nothing in between.",
            "Or on the flip side, the people that get shot in the stomach and die instantly in movies",
            "This is how Washington Redskins safety Sean Taylor was killed in 2007. He was shot in the  upper thigh, damaging his femoral artery, which led to massive blood loss.",
            "If you were Korean, that could kill you!",
            "Started out so well and devolved into such a disappointment.",
            "Black sludge that’s quite obviously concentrated evil, judging from the smell and taste, is what presides the reddish rust water",
            "That's it, I'm watching Blade tonight",
            "Haha, good spot.   The 316th member of the esteemed McClane clan no less",
            "There's nary an animal alive can outrun a greased Scotsman",
            "When the British first started to use copper jacketed bullets in the late 19th century they had trouble with immediately stopping their opponents, the solution they came up with was to remove a small portion of the copper jacket near the tip of the bullet which would allow the lead to expand while still having the benefits of a copper jacket.\n\nThis was nicknamed a Dum Dum round after the Dum Dum arsenal, nowadays we would call this type of round a soft point bullet. \n\nThe Dum Dum round was very quickly condemned by the international community and made illegal for use in war(still is even today).",
            "Yeah, adrenaline is a helluva thing to be hopped up on",
            "I remember reading in the book where some of the Somalian attackers took multiple hits that were \"through and through\" and kept fighting (in the short term)",
            "The super spy stuff all came out after Clancy died. Last one he wrote I believe was Teeth of the Tiger",
            "This is what makes me sad about all the TV/film stuff that has been released with his name on it in the past 10 to 15 years.  They're poor adaptations at best.",
            "Those weren’t really predictions so much as things that were already happening.",
            "I wouldn’t give too much credence to it, you read it on Reddit :P",
            "Isn't this the plot of a Star Trek episode?",
            "People get shot in the fucking head and live. \n\nThe stomach one bothers me the most because that would be potentially weeks of agony before death.",
            "Get shot through the shoulder, but can still use their arm or the entry wound is by the collarbone and no one realizes that's where lungs are too. Pumping a shotgun just before a fight instead of immediately. Unlimited ammo.  Hammer cocking sounds for semi-auto pistols.  Pistols out of ammo, but the slide remains closed.  Anything having to do with guns is terrible.",
            "Yeth, marthter",
            "GNU Sir Terry Pratchett",
            "I know, that scene has gone through such a rollercoaster of context for me.\n\n* _As a kid:_ This is so cool!\n* _As a cynical 20-something:_This is so dumb.\n* _When I found out it was a legit system:_ This actually looks exactly like the kind of unfriendly-but-flashy system someone with more INT than WIS would make for a filesystem navigator.",
            "Well, she is a hacker.",
            "Yeah but do you know anybody that could network 8 connection machines and debug 2 million lines of code for what he bid for that job? Because if you can, I’d love to see him try.",
            "Even before the storm, there were glitches all over the place earlier in the movie.",
            "Especially since he “spared no expense”",
            "It's the equivalent of everybody trying to cheap out of stuff with AI. It's a powerful tool that's just going to be used to make crap because they're too cheap to use people. ",
            "The book fleshes out Nedry a little more. Hammond hired him and his team, and then put unrealistic timelines and demands. Eventually leading to Nedry become disgruntled.",
            "The book makes this fact more obvious. When Nedry first gets to the park he finds out he has to fix a lot more than he signed up for.",
            "\"Look at this desk! What a complete slob!\"",
            "Especially since they could easily have hidden the progress bar.\n\nThe video game *Myst* did it, and the whole game was built in HyperCard.",
            "The 3D thing also ties in with the earlier scene that shows scientists using virtual reality to map out genomes etc. Like the people in charge of all the tech associated with Jurassic Park had a fetish for 3D images.",
            "This is exactly what I would say if I'd been involved with either show",
            "God owed him one for finding the ark and sealing the holy grail",
            "Atom bombs. Very dangerous. \n\n\nYou go first Indy.",
            "They talk about this, how she’s spent enough on shoes that she could have bought her apartment. “The old lady who literally lived in her shoe”",
            "They actually explain this in the last episode, it’s well known that the apartment isn’t actually Monica’s, it’s her grandmothers and she’s sort of illegally subletting it (there’s an episode where Joey almost gets them evicted when he annoys the superintendent) and in NYC they have rent control on some properties that stops the rent from being increased, so because they were still under Grandma’s lease and she had previously lived there a very long time the rent was a “freakin’ steal” as Chandler said in the last ep.\n\nWhat’s less clear is Ross, Chandler less so as it’s well established he’s pretty well paid so can support Joey and have the big wedding, but Ross is on a professors salary, I have no idea how much they earn, maybe in the 90s it was enough to afford a NY apartment, idk.",
            "Fact",
            "The expressions on both their faces were priceless - as if they are only mildly annoyed with each other.",
            "Yeah the Mad Max movies get a pass because the production of new gasoline is a major plot point in multiple iterations.",
            "Yeah I was going to say they are still producing it in mad max fury road.",
            "It's apparent food and water are serious issues as well",
            "In the book “The Road” (I think), they mention cows having gone extinct and never being able to eat beef or drink milk that hadn’t already been produced. Fury Road has some little details like human females being milked at the Citadel to suggest similar things might have happened to many of the animals in that world.",
            "Making paperwork dramatic was the greatest thing The Wire did.",
            "And while the we're on things The Wire got right, it had one of my favourite \"trope busting\" scenes ever. \n\nIn Season 2, a bunch of sex trafficked women turn up dead in a shipping container at the docks. So cops from a bunch of different distriects turn out to investigate and they then proceed to have an argument about jurisdiction. \n\nBut instead of the typical, \"this is OUR case!\" it's the complete opposite. Each side is arguing that it's someone else's jurisdiction because who the hell wants 18 probably unsolvable murders on your books?",
            "[Ed Burns](https://www.imdb.com/name/nm0122654/?ref_=ext_shr_lnk), the co-creator and writer/producer for The Wire was a former police officer and went out of his way to make the monotony in the series as real as possible.",
            "And the lab assistant that jumbled up all the samples👌🏼",
            "Also the lacklustre resources they were working with. Most of the characters had typewriters in s1 iirc.",
            "I think during its run Dexter and his adversaries, usually just a handful of people, would account for all of Miami's total yearly homicides all on their own. For a city (and surrounding area) of 6 million. \n\nSpoiler alert: serial killers are nowhere near that common. Dexter would have run out of murderers to kill really, really quickly.",
            "C'mon... we all know Jessica was the killer.  Peaceful time until she shows up.  Then she helps \"solve\" the crimes.  She was Dexter's great aunt who taught him every thing he knew.  And Mr. Cunningham?  I still have not figured out if he was an idiot or she had him by the short hairs.",
            "And the murder rate among her friends and business acquaintances was...?\n\nObviously Miss Marple had the same problem so it's whatever, but it is objectively absurd.",
            "Yeah, but even 5 in her town in the span of a year is weirdly high.",
            "To be ENTIRELY fair, California in the 70s/80s had an ungodly amount of crazy serial killers, and we know exactly what was in the water! \n\nIt was leaded gasoline.",
            "Yep, it was Mulaney talking about Law and Order, and how New Yorkers won’t stop moving crates even when being questioned by police.",
            "And if the actress is Natalie Portman her newborn children are almost ad big as she is (and they are always twins!)",
            "i mean that i can make my peace with, cuz who in their right mind would use ACTUAL infants for filming?",
            "what does it smell like?",
            "Obtained???",
            "Username checks out.",
            "I hate the implication of the word obtained.😂",
            "Catfishes? Is there a killer catfish movie I need to stream tonight?!",
            "Go back to your shanties!",
            "I just opened reddit because I got bored during the process of strangling someone and this is the thread I stumble into, what are the odds?",
            "My enjoyment of the fwip let’s this one slide for me",
            "The dramatic racking of the slide to show they mean business always cracks me up, too. Extra points if its accompanied by some hard-ass line like, “last chance, motherfucker!”",
            "Or, the hero gets shot in the gut, and just holds a cloth to the wound and keeps running around.\n\nOr when they say \"Luckily the bullet went straight through.\"\n\nOr when the bullet didn't go through, so they splash the wound with vodka, pull the slug out with pliers, and then sew it shut. Fixed!   Nooo, everything inside is a jumble and you haven't stopped the internal bleeding!",
            "Ratings.  Watching someone die slowly over the rest of the movie would be traumatising, and not get that coveted PG-13 rating.",
            "Precedes?",
            "I've been knee deep in a septic tank, and I've been to a hotel room where a sprinkler head opened. \nI prefer the septic tank.",
            "\"Oh, I also have some Dum Dums. Do you use this word, Dum Dums, the bullets that make the head explode?\"    \n     \n\"Dum Dums, yea.\"     \n     \n\"Would you like some of these Dum Dums?\"     \n     \n\"I know I shouldn't... but I will.\"",
            "I've always found it interesting that there are rules of war. \"Ok, you can kill each other as much as you want, but not in this fashion\".",
            "Were they? \n\n> However, the 9/11 Commission Report revealed that national security officials did not consider the possibility: “[Counterterror official] Richard Clarke told us that he was concerned about the danger posed by aircraft in the context of protecting the Atlanta Olympics of 1996, the White House complex, and the 2001 G-8 summit in Genoa. But he attributed his awareness more to Tom Clancy novels than to warnings from the intelligence community.”\n\nhttps://en.wikipedia.org/wiki/Debt_of_Honor",
            "TNG had 'The Inner Light', in which Picard lived a whole life as someone else, but he was knocked out by aliens, rather than a blow to the head.  There was also a DS9 episode where Chief O'Brien was convicted of a crime and was imprisoned. After serving for decades, now an old man he learned it was all in his head, and he was still his younger self (it was how prison sentences were served on whichever planet he was on).\n\nOh, and there was an Outer Limits episode with David Hyde Pierce that waa similar to the DS9 ep, though I think in this case, he wasn't a criminal, he was testing the system.\n\nI'll stop now.",
            "One of the \"O'Brien must suffer\" episodes of DS9 had him carry out an entire 40 year prison sentence in his mind, in reality something like an hour passed but to him he was there for that full prison sentence. Had some intense PTSD from the things that happened between him and his cellmate, who was there his entire sentence (and never really existed in the first place). Pretty dark episode.",
            "Reservoir Dogs nails getting shot in the stomach.",
            "Right… but for it to be instant death it pretty much *has* to be a headshot",
            "Another one I hate is when you are only allowed to know what a gun is if you are a criminal, or received government training. Law-abiding civilians must handle every gun like a dead mouse. Certain movies and shows are very dogmatic about it; it's like character classes in an RPG.",
            "\\*Someone with more CHA than INT/WIS would make.\n\nUs high-INT/low-WIS nerds prefer the terminal instead of graphical shit.",
            "I am sorry about his financial problems, I really am. But they are his problems!",
            "\"Spared no expense...\"",
            "He said that but actively cut every corner he could.\n\nThat was part of his character - he was a showman, a charlatan. This is brought out much more in the books, but he was all about the flash, and not the substance. \n\nHim saying \"I spared no expense\" is like a serial cheater saying, \"It'll never happen again\".",
            "I will not get into another financial debate with you, Dennis!",
            "I mean, he did drink from the grail",
            "Trust fund girl who sometimes overextends her usual stream of money",
            "I sat next to an NYU professor on a plane a few years ago.  She was sharing an apartment with five other professors, and they had put in office cubicles for bed spaces.  So no, Ross can’t afford his spacious 2-bedroom (at least) in the Village.",
            "For a world where gasoline is such a valuable commodity, they sure are liberal with their use of flamethrowers.",
            "Hot Fuzz has it beat on that part.",
            "I mean, maybe not the GREATEST thing.",
            "McNulty spending hours calculating the impact of the tides on the dead body in the water, just to shaft Rawls by lumbering him with a murder that’s difficult as fuck to solve by demonstrating the death happened in his jurisdiction before the tide moved the body, is one of my favourite sequences in the entire series.",
            "You do NOT willingly put red on the board!!",
            "David Simon also shadowed the Baltimore PD to an extensive degree. Various scenes in The Wire are directly lifted from true experiences - using the photocopier as a lie detector for example.",
            "I think the guy from Brazil Dexter was loosely based on had 71 confirmed but claimed over 100  \nStill nowhere the amount from Dexter if I recall.",
            "Right! I understand, though.  The script writers have to make it exciting and interesting.",
            "I’ve smelled a whole lot of amniotic fluid in my life. It smells like semen, or saliva. Clean, warm. (The more difficult smell of birth is the combination of blood and shit.)",
            "I meant like catfishing on the Internet lmfao",
            "especially if the movie is stylized to the point where it's obvious that it's not meant to be realistic. like in john wick for example.",
            "Think it was Constantine where a character racked a slide, pulled the hammer and then fired 33 shots from an 8 shot S&W.",
            "No fighting in the war room",
            "Oh, you're right John. Y'know, everything's my problem.",
            "This is portrayed in the film too when he tells Ellie about the flea circus",
            "More people should read the book, it's fantastic and a very different story to the movie",
            "When she made it to NYC she was poor. Used the last of her money to buy a Vogue magazine, rather than food, because she felt it “fed her more”.",
            "Consider the fact that it’s raw as fuck to use flamethrowers.",
            "Maybe the flamethrowers use some other oil byproduct that isn’t suitable for engines 🤷‍♂️ All I know about oil refining is that there’s a lot of byproducts.",
            "Perhaps it’s a valuable commodity *because* of all the flame throwers",
            "I see your argument and raise you: flamethrowers are cool as fuck, especially when they're on a guitar.",
            "I'd argue that hierachy and status is a major part of the societies in Mad Max. Resources are scarce so \"chieftans\" have sprung up who hoard these resources to leverage for power. A display of power is be to be flagrant and over top with ones wealth. \n\nSo spending fuel in excess when it is so valuable is a display of power.",
            "That is true in real life as well, though.\n\n\nThe world going to shit while people squabble over something they'll just waste anyway is Miller's comment on society",
            "You might be thinking of Pedro Lopez of Colombia, who yes, had a terrifying amount of victims that was probably more than a hundred. \n\nBut Lopez and the other serial killers that manage to get that prolific almost uniformly operated in places that were in the middle of wars or other disasters, where even the most basic social services and law enforcement were ineffective. One of the reasons we don't know how many people he killed is that even standard record keeping was unreliable in Colombia, Peru, and Ecuador at the time.",
            "Ahh bummer",
            "I will NOT get drawn into another financial debate with you Dennis. I really will not!",
            "It is, but the book shows it much more clearly.\n\nHe \"spared no expense\", which is obvious when you see that Nedry and Arnold had so much support and such a comfortable salary.",
            "I was also looking forward to the killer catfish movie 😑"
        ]
    },
    "Christopher Nolan's newer films are missing Jonathan Nolan": {
        "title": "Christopher Nolan's newer films are missing Jonathan Nolan",
        "score": 267,
        "url": "https://www.reddit.com/r/movies/comments/1dlluzz/christopher_nolans_newer_films_are_missing/",
        "content": "Let me preface this by saying that I love Christopher Nolan. To me, he's one of the best directors/movie makers, and up until recently, I considered him my #1. Until Dunkirk. It was his first movie after Interstellar, which was (again, in my opinion) a masterpiece. I remember seeing it in IMAX 70mm and had the most unexplainable movie experience of my life. I was silently sobbing by the end of it.\n\nAnd that was after Inception and Dark Knight! So when Dunkirk came out, I had very high expectations, because his films always met those expectations and surpassed them. I remember noticing that his brother wasn't a part of writing it, but I didn't pay much attention to that fact... until I saw the film. Honestly, I considered it a disappointment. It was nothing like his last few movies before it, and it barely impacted me. I thought it was lacking some kind of magic that his films always had. \n\nI was happier with Tenet, and I think that the concept and a lot of the scenes were absolutely amazing! But, again, something about the film was lacking to me. It just didn't hit its mark. It wasn't what I had come to expect from Nolan's films. It didn't have the same heart and execution in its story, and I felt that missing from most scenes. Robert Pattinson was the best part of the movie for me because it's like he got it and he gave it. \n\nThat's when I started to realize that Jonathan Nolan was what was missing. I was giving all the credit to Christopher by considering him my #1 and thinking of Jonathan as only 'helping' him with the scripts. I may be wrong, but I think he was integral to the masterpieces that the films were when they were making them together.\n\nOppenheimer was obviously a fantastic movie, but to me, it was still missing the magic that I'd come to expect from Christpher Nolan. I don't know how else to explain it. There used to be this kind of electricity, heart, and soul. I'm not saying that I think those things were missing entirely, obviously not! Just that I think they were incomplete, and I think it's because he's been making his films without Jonathan for a decade now.\n\nThe writing of Westworld season 1 was like the TV version of what I was missing after Interstellar, especially the writing. I think that Christopher is a master director/filmmaker. But I think he writes great films, not masterpieces. Jonathan IS that missing piece. \n\nI'm not exactly sure why they parted ways, but I hope that they plan to make more films together in the future.\n\nEdit to add: I think that Christopher Nolan fans fall into 2 categories. Those who prefer his films pre-2014 and those who prefer his films post 2014. I want to emphasize that I'm not saying that one side is right or wrong. Just my own opinions. Cinema is about personal preference after all. \n\nEdit again to add: Welp, I don't know how I missed that Chrisophet Nolan wrote all of Inception, which I consider a masterpiece.",
        "num_comments": 164,
        "comments": [
            "Christopher is very cold and clinical. I think his brother kind of lightens up some of those movies. I will say Oppenheimer was pretty great, and the most I’ve enjoyed his movies since they stopped working together.",
            "I'm shocked that there is no mention (at tine of writing) of The Prestige.\n\nTalking about the most incredible writing, the exceptional heart and emotion inherent, the incredible rush of insight in the third act.\n\nThe amazing opening monologue that tells you everything you need to know.\n\nJonathan Nolan's masterpiece.",
            "I have been trying to figure out why I have felt this exact way since after Interstellar. Thank you for this.",
            "Hard agree. I actually didn't know that about the brother's influence. Like you, I thought Dunkirk, Tenet and Oppenheimer were all great films in a technical sense and intellectually but they lacked character stuff. Especially Tenet was let down by the (lack of meaningful) relationships between the characters, which was a shame because it had such an interesting take on time travel (sorry I mean reverse entropy lol). It's like the director spent 10 years on the concept and 10 minutes on whatever role Elizabeth Debicki's character was supposed to play (did you know she was a mother, did you know she saw everything through the lens of her child?)",
            "Strongly recommend the show Person of Interest if you like sci-fi. It was Johnathan Nolan's first series and it is all-time excellent in my opinion. It was overlooked since it was a CBS procedural show, but it does a great job with its overarching story and the last two seasons dive head-first into that arc mostly without the procedural format. \n\nIf you're in the U.S. it's free to watch with ads on Freevee.",
            "Is there a reason why they stopped working together??",
            "He is still my favorite director but I agree the movies with his brother just hit a little different.",
            "Didn't someone already do this about a week ago? I'm almost certain of it.",
            "I do know what you mean and I don’t know if it is just Johnathan absence but it could be someone who is able to challenge Christopher’s vision and he will listen to them.  You can see Christopher vision when it comes to his films and he is a master at his craft.  But being to enhance something without disrupting is not always simple.",
            ">I think that Christopher Nolan fans fall into 2 categories. Those who prefer his films pre-2014 and those who prefer his films post 2014.\n\nBadum tss. I've felt this for so long. Glad someone else noticed it too. Each are whole different eras of Christopher Nolan kino",
            "His movies are so fn noisy now. Constant talking with music crushing your eardrums. Not subtle at all",
            "I agree with everything you said except Oppenheimer. That was a truly fantastic film I'd say as good as interstellar but totally different genre and feel but I'd say it's a masterpiece ",
            "I agree, I don't think it's a coincidence that I didn't enjoy his 3 latest films as much as those before.",
            "I don’t think I can agree with this one. I think you’re onto something that the earlier films were more character driven and there was lots of quality to be found there, but if we’re hyping up Jonathan’s contribution to the writing, we have to also hold him accountable for the writing shortfalls, and there are plenty. I’m not saying Chris Nolan isn’t a genius film maker, but each of his masterpieces is flawed in some way, and all of those ways involve the writing. The over-exposition, missed opportunities and multiple magic beans of Inception is a good example. (Still a great movie in many ways)\n\nAs for Jonathan’s other work (Lisa Joy, too), on one hand I watched Westworld fly off the tracks and the other hand, they seem to be nailing Fallout. \n\nI value both brothers as creators, but it seems both have consistent weak spots in their work.",
            ">I was happier with Tenet\n\nMade me doubt on being dissapointed with Dunkirk, but absolutely lost me there.",
            "He directed Fallout series. He's making his own legend.",
            "I don’t fall into either category because I personally think his crime films that happen to star Batman are his weakest offerings by far.\n\nI think the real issue is his schtick is running out.  There’s only so many ways to appear smarter than other people before you’re just repeating yourself or rambling incoherently.  Actors have said they don’t understand his scripts, and before Oppenheimer came out I told my SO and child that it’s going to be a non-linear film because he doesn’t like stories told in order.  Even Dunkirk had that.  It’s a war movie told out of order…like what…",
            "I think, Christopher's writing wants you to watch what has been made. On the other hand, Jonathan's writing makes you want to watch what has been made. If that makes any sense.\n\nI myself realized this after watching Fallout. Jonathan knows how to connect with audience better than Christopher.",
            "Dunkirk and Oppenheimer are both perfect films imo. I hope Nolan makes more historical films. In both he managed to capture the incredible weight and meaning behind those events. Never seen another director pull that off to that extent.",
            "Dunkirk & Oppenheimer make a mean WW2 double-feature. Probably my two faves from Nolan.",
            "I think I agree, but I also think it’s ironic because I think Jonathan and Lisa’s stuff is really lacking something. After the first Westworld season, the later seasons all kind of fell apart under the weight of their own cleverness and self-seriousness. Peripheral was similar in that it was really compelling at first and then the season finale was so disappointing to me that I had no interest in the next season and didn’t care when it was canceled. And we got bored with Fallout somewhere around episode 4. Maybe the thing his stuff is missing is Christopher, maybe they need each other.",
            "I literally said the same thing to my wife a couple of years ago.\n\nJonathan brought the heart to the projects,  without it it feels very good technically  but empty.\n\nDunkirk and Tenet are great examples.\n\nBoth are great technically but tell me the name of 1 character..... and for tenet it's actually worse , the protagonist  is\n.. protagonist. \n\nStill love Nolan but I really hope he does another movie with his brother  writing.",
            "Love Nolan. Past two movies have fallen below his standards in my opinion. I was disappointed in Oppenheimer because that story is far more interesting than the movie. I read an American Prometheus a few years before and in my opinion the story fell is bit short. \nI totally understand that’s not everyone’s opinion though.",
            "Wow. Dunkirk is a masterpiece. It’s amazing story telling. ",
            "I disagree about Dunkirk. It’s one of hist best movies.  \n\nI really wanted to like Tenant, but I wasn’t convinced that Branagh’s character was a mastermind and the threat wasn’t very clear. \n\nI do enjoy the sense of wonder from his science fiction movies though and his use of mind bending special effects, so I understand what you mean. \n\nI would love to see him do a Robopocalypse movie.",
            "Tenet was a turd but I don’t get how anyone can hate on Dunkirk. It is a masterpiece.",
            "Absolutely agree. It pisses me off that they don’t work together because when they do, they make MAGIC. Without Jonathan i haven’t liked anything Nolan has made. Not even a little.",
            "I agree, those films definitely were less impressive/enjoyable for me. Oppenheimer was super overrated imo in particular, don’t feel chopping up the timeline really served the film, and the actual explosion in the nuke scene was entirely underwhelming visually, though that was still a great scene overall. \n\nThose films all just didn’t really catch me like his other work has, perhaps his brother is why that is, not sure.",
            "Dunkirk is a fantastic movie. One of, if not his best l. Interstellar was half of an interesting movie with some great ideas. Tenet was absolute crap. Idk how you can look at Dunkirk and claim it's anything but phenomenal or use it as evidence of his downfall..",
            "Agreed but have you seen fallout? Never played the games but Jonathan nailed it. Some of the best, most immersive sci fi I’ve seen in recent memory. ",
            "People need to realize when Christopher directs a movie without his brother involved, he's the *sole* director and writer usually. Jonathan's TV stuff is done with multiple writers",
            "Wasn't Jonathan Nolan the one who really wanted Catwoman aka Selina Kyle to be in Dark Knight Rises? Not complaining, but I can see why Jonathan needs to be there. ",
            "His only movies I consider incredible are both Oppenheimer and Dunkirk.  I think Dunkirk is incomparable and genuinely a 10/10. Hope he continues without him",
            "Genuinely surprised by how many people in here think Dunkirk is his masterpiece. I found it to be a pretty by the books war movie that didn’t bring anything new to the genre.",
            "I've started watching Oppenheimer twice and find it really boring, its just people talking.  After about 35 minutes I get bored and do something else.  His other films, once I start watching them, I can't stop until they've finished.",
            "Did you post this before? Having some crazy deja-vu here",
            "I don't mind Jonathan Nolan, prior to Oppenheimer he really needs co writer. ",
            "The only thing that Christopher Nolan's films are missing is clear dialogue. ",
            "This is very true he needs someone to the writing",
            "tenet fuckin rubbed my itch for me i love that shit right in my veins",
            "I'm always amused by the perennial complaint that Nolan's movies are cold sterile places lacking soul and heart. Whether it's true or not, it's ironically one of the aspects I like about his movies. I'd rather be at a distance of characters than the director manipulate me with heavyhanded tactics utilising the camera and soundtrack to make me feel a certain way.  \n\nThe 'cold' nature of Dunkirk was utterly compelling to me. These guys were just random boys thrown into the meatgrinder, you're not meant to fall in love with them, they're just regular folk who have a host of flaws like we all do. Harry Styles character was a bit of a prick and *that's fine*.  \n\nBut more to the point, Michael Mann got the same complaints for most of his career too. People to this day still criticise Heat for being too 'cold and sterile' for them, etc.  \n\nIt's fine though, I wouldn't want a guy like Nolan to change his style. It provides variety to the cinematic landscape, there will always be directors like him and Mann who get the same criticisms, and I'm glad.",
            "Yeah but wtf happened with Westworld. Just started getting real wtf after S2. S2 seems like there was some interference which caused a pivot.",
            "Huh.\n\nI don't like Nolan.",
            "Agree. Dunkirk and Oppenheimer - while excellent - seem to lack heart. Tenet - while also excellent - covers the lack of heart with its heavy concept. \n\nI didnt know John wasnt working on these films. But it makes sense now.",
            "Dunkirk was great.",
            "Jonathan Nolan was recently on Arm Chair Expert and if y’all haven’t I’d really recommend it. I knew next to nothing about him now I’m a huge fan.",
            "\"Christopher Nolan fans fall into 2 categories. Those who prefer his films pre-2014 and those who prefer his films post 2014.\"\n\n  \nNot me, and nobody else I know would fit into your categories.  I think Dunkirk is better than Interstellar, but I really like them both.",
            "It’s so strange, because I think Dunkirk is better than anything he’s done in the past fifteen years. I think it blows Interstellar out of the water.",
            "Nolan started to unravel with Dark Knight Rises. It is an absolute mess of a movie that rides on the triumph of its 2 predecessors within the Nolan trilogy.",
            "I didn't realize this until you posted this, but yeah I totally agree with you.",
            "Sorry but Oppenheimer was outstanding. I agree about Dunkirk. Disagree about Tenet. It was classic Inception-Interstellar Nolan. If anything, Oppenheimer and Dunkirk were sort of departures, with Oppenheimer still being a masterpiece largely due to the fact that both Cillian Murphy and R Downey Jr. were perfectly cast with a tremendous script.",
            "Inception & the Dark Knight are perfection. \n\nWith Interstellar, I felt the movie was bursting at the seams but still entertaining.\n\nEveryone talks about the cool concept of time in Dunkirk. Nothing about the heart of the story and I doubt most people can even remember the characters.\n\nTenet was confusing, had a few cool moments, but was heartless. The final \"battle\" looked ridiculous.\n\nI haven't gotten around to Oppenheimer yet.",
            "Tenet is a borderline masterpiece from Nolan. To be fair, I didn't quite get it the first time viewing it and had to have subtitles on to understand what the characters were saying. Tenet is Nolan's James Bond spy thriller with a twist. After watching some YouTube videos with 3D representations and explanations of the concept of reverse entropy, the whole concept of the movie blew me away.",
            "Surprisingly, I prefer Oppenheimer to his other films specifically because of its script! The characters were more fleshed out than the previous scripts on his films. Of course, I love the Dark Knight. But Oppenheimer is genuinely that one film that I prefer to his other films in general.",
            "Don't know why, but for me Memento, Inception, Dunkirk and Oppenheimer are his best movies. \n\nAlso I wouldn't compare movies to tv series. Possibilities are so different.",
            "Nolan has the same issues as George Lucas. Great director, shitty writer.",
            "Christopher Nolan's movies are only good for one watch (for me), I can't stomach the rigidity. \nI think he's an amazing director. But the only movie I've been able to watch more than once by him is the dark knight.\n\nI have similar feelings to Denis Villeneuve  - but it's not rigidity. It's the emotional momentum, sometimes it just doesn't exist. And the films feel like a spectacle and nothing else, again, think he's an amazing director. \n\nHis films don't hit the same on the 2nd run, and personally I thought dune was only aesthetic. And quite frankly his worst movies.\n\nSomeone's films who I think have great rewatch capacity are S.Craig Zahlers movies (though very few).\n\nAnd I will say that maybe he's not as technically good as the aforementioned but he knows how to create emotional crescendos - usually very violent and stressful ones. His movies evoke distress, and any film that makes me feel anything is doing a fantastic job imo.\n\n\nAnother is Park-chan wook  for very similar reasons to Zahler.\n\nBut also he is  technically masterful.",
            "so overrated.   \n\nhis Batman movies are legendary, but the 3rd act in all 3 can suck my asshole.",
            "Learned about dude very recently when I noticed how incredible some of the Fallout tv episodes were. The first couple episodes are him directing and are extremely well done. \n  \nThe first three episodes effortlessly introduces so so much. I started noticing that so much character introduction, world building, and atmosphere was being done non-verbally and often in the background of a shot where something else is happening. There's a zillion very simple but intelligent and often overlooked decisions that make everything feel funny, easy to follow, and immersive. In the first three episodes he introduce like 9 full season plot threads, 3 main characters, multiple flashbacks, like twenty locations, and goddamn near 50 characters and all of them feel unique and effortless to follow.\n  \nWeird little note but he casts extremely different actors for the characters and they trend towards having very unique body types and appearances which makes it near impossible to confuse any of them. None of the locations were hard to follow, every flashback was easy to follow, lines weren't whispered over Chris Nolan audio mixing, all the humor stuck the landing, was quick, and moved on.\n  \nBack to the casting - I've had trouble with shows and movies with extremely similar looking characters and often have trouble following shows like game of thrones who might introduce 6 decrepit old men with long white hair at once or Haunting of Hill House with completely unestablished time jumps, scene changes, and characters that blend into each other. There was so many characters introduced in the first episode of fallout, and it starts out with them all wearing matching jumpers and you can't confuse a single character because every speaking role is very unique in some immediately visible way. Zach Cherry doesn't look like any other vault dweller, and neither does Dale Cooper, the Wanda Sykes type, the bug eyed pretty main girl, the tiny bug eyed brother, the large man who wants to fuck his cousin, or the blonde preggo pirate one. That's all just one half of one episode and this trend continues for every speaking character in the show and for every location and it is great. Very simple, but it's crazy how many shows and movies don't even consider it. \n  \nAnyhow, I noticed that my favorite Nolan movies had him writing and my least favorite ones did not. Interstellar, dark Knight, memento, and the prestige has him.\n  \nTenet and inception didn't and while they had tons to praise, they had a very distinguishable and often criticized issue with the writing.\n  \nI never got why sometimes I found Nolan movies incredible and sometimes pretty frustrating, and I think duder is why. Apparently I'm a Jonathan Nolan fan and I didn't know it until recently.",
            "I much prefer his stuff without Jonathan. I feel like Jonathan brings out his worst tendencies and generally brings down the film into genre fare",
            "They need each other, Jon keeps tanking projects to retell Person of Interest",
            "You may be onto something although since 2014 he has been doing quite different films. Dunkirk and Oppenheimer are nothing like anything he's done before so maybe Jonathan wouldn't have made a difference. And I think (while not his best) they are both very good. \n\nTenet is the best comparison point. It's easily his worst film. But I can't tell if it's a hot mess because Jonathan was missing or not. Let's not forget The Dark Knight Rises was not good. And Jonathan was involved in that.",
            "Nolan only has three films that were nominated for the most prestigious award categories. Inception, Dunkirk and Oppenheimer. Those are three films that Nolan has sole screenwriting credit for. So it's unlikely that Nolan himself would agree with you that he needs his brother to help him with his screenplays.\n\nAlso it's a shame Dunkirk didn't land for you. It's probably his most accomplished film. And I don't mean that from a technical standpoint.",
            "I disagree completely with pretty much everything said here. Oppenheimer is probably the best script that Nolan has ever written. Obviously it’s all personal taste but looking back on his career, late period Nolan has far surpassed his early stuff for me. Tenet, Oppenheimer, and Dunkirk are all top 5 for me. The Dark Knight is a classic and obviously what made him a household name, but Inception does not hold up for me beyond the impact it had when it released in 2010; Batman Begins is fine, TDKR is a mess, and the The Prestige and Insomniac are fun but a little bumpy. Memento is a classic.\n\nI think Jonathan Nolan’s output since their creative divorce kind of reinforces my feelings that he really didn’t have much to do with Nolan’s success. I stopped westworld around season 2 because it became unbearable, and while people seem to enjoy Fallout, I cannot stand it. I hope the lesser Nolan figures it out, but Oppenheimer really made me doubly excited for Christopher Nolan’s ongoing solo career",
            "Nope. Jon's other shows have been mediocre",
            "There’s a scene in Blade that matched the dark knights scene, actually two of them. In blade, Blade throws a person across two buildings, TDK zip lines between buildings.\n\nThen there’s a mob scene in Blade that doesn’t look anything like the pencil scene in TDK but it feels the exact same. \n\nWas this Jona or the other guy? (Forgetting his name I’m sorry)",
            "Eh I wish I liked INTERSTELLAR. So many little things like that awkward moving robot that was supposed to be the comic relief I guess? Wes Bently death being a YOINK right as he enters the ship? The guy left behind on the ship for 20 years has a little Grey hair instead of just being played be a different older actor?",
            "I feel like the cold and clinical aspect played well into Oppenheimers tone as a film as well. I definitely would have liked it less if there was more “pizaz” to it",
            "Well put. Even with Inception, Leo spent a lot of time ensuring that the movie included a lot of heart and emotion. Watching Tenet helped to fully contextualize that point",
            "Emotion. Feeling. Christopher has none of that. Compare that with Fallout and Westworld and you see what is missing. I haven't cared about a character in any of Christopher's movies since.",
            "I agree. I always thought it was Chrisopher who brought the soul to the movies so it took me time to really see that it wasn't because I didn't want to believe otherwise. But it also made me feel like Jonathan isn't given enough credit by audiences because I think that a lot of us just thought he was kind of helping out in his brother's movies rather than being a crucial piece.",
            "I feel a lot of time the actors need to compensate for Nolan’s writing just by sheer acting skills, lucky for him he has accesses to the best of the best but it still would be nice to have more human or relatable characters in his movies.",
            "A little *The Prestige* Reddit history I stumbled upon. 11-years ago, a Redditor claims that anyone who saw the ending coming is a fucking liar. No one notices that Jonathan Nolan himself comments \"[saw it coming a mile away](https://www.reddit.com/r/AskReddit/comments/1hpxpz/comment/cawvyqd/)\"",
            "The Prestige is my favorite Nolan movie. It is excellent. Every time I watch it I pick up on something new.",
            "That movie IS amazing! I still prefer Interstellar, but that's just my opinion!",
            "Probably my favorite movie of all time, with three of my favorite actors. Just so freaking good",
            "Aww, thank you for your kind response! In glad I could help you articulate the feeling. Honestly, it took me a while to do it myself!",
            "Exactly the same for me!",
            "The heart of tenet is the bromance between JW Washington and Pattinson though, not debicki",
            "I really enjoyed Dunkirk. The pace and the story for me was perfect. I liked the distance the characters had. As they kinda represented the every man. \nPlus I saw it in the imax and that movie works so much better on the giant screen. ",
            "Absolutely I agree with you!",
            "It's a great show! The characters are fantastic and the idea of the show was fresh. And I think it did a similar, successful switcharoo in the third season of the show when it really dived deep into the science fiction as the movie From Dusk Til Dawn did in the half-point where it switched from a kidnapper/robber movie to snake-vampire action-horror.",
            "we just finished our re-rewatch! That show is more relevant than ever!",
            "I assume Jonathan’s stock in the industry reached a point where he could branch off on his own and chose to do so. It’s great when you a collaborative pair work so well together and it sucks when they split up to do solo stuff, but it can be understandable when both probably have very specific visions for projects they want to do on their own.\n\nChuck Russell and Frank Darabont were an amazing partnership for horror in the 80s with their work on Hell Night, Dream Warriors, and The Blob, but Darabont wanted to move on and gave us Shawshank Redemption.\n\nDon Simpson and Jerry Bruckheimer basically reinvented the wheel when it came to action movies in the 80s, but Simpson’s drug use resulted in their partnership breaking down during production of The Rock and he died before it was completed. Bruckheimer still made big hits, but Simpson’s eccentricity was noticeably missing. \n\nBruckheimer and Michael Bay is another one. Bad Boys, The Rock, Armageddon, and Bad Boys 2 show how their styles just worked so well together, and most things they’ve done separately since 2002 really haven’t been the same. For Bruckheimer, National Treasure 1 & 2 and the first Pirates were great, and for Bay, Pain & Gain felt like 1993 Michael Bay, but most everything else has been lacking in one way or the other.\n\nFor the Nolans, I think Jonathan saw a chance to start overseeing productions and took it. Christopher used it as an opportunity to fully realize his own visions. I think when they worked together, they played to their strengths. Jonathan is a much better writer while Christopher has a top 1% director’s mind. I hope they work together again soon.",
            "Jonathan got too big. He also kind of traded Christopher for his wife who he worked on Westworld and Fallout with. That, and they signed their own deal with Amazon. He doesn't really have time for Christopher anymore.\n\nChristopher did say he shows Jonathan his scripts and gets feedback on them. He said he wrote Oppenheimer in the downstairs of a house during COVID while Jonah was writing upstairs.",
            "I have no idea. But honestly I haven't looked it up. I have a twin sister that I'm very close with and we're movie buffs with the same pov on everything. We've always wanted to be actresses and make movies together so it makes me sad that they stopped making movies together. Hopefully they just wanted to make some projects apart (hopefully not permanently) and split amicably.",
            "He's too busy with TV",
            "I agree. But he used to be my #1. Dennis Villenue is now my #1 and Chris Nolan is my #2. That can always change, I still have hope!",
            "It might've been me! My post was deleted with no explanation less than an hour after I posted it. So I tried posting it again tonight. ",
            "I was just going to say the same thing. I saw this exact post a week ago, lol.",
            "And then someone else will do it, and in that thread someone else will and eventually the top keeps spinning",
            "That's a good point! That could be part of it. I don't know.",
            "I totally respect your opinion. I definitely think it was fantastic. And the last line of the film has stuck with me for a year. But I still felt it was missing some things. I think he could've pushed the limit or done more, especially considering the subject, if that makes sense?",
            "It's funny that you should say that, because Inception was also not (co) written by Jonathan.",
            "> The over-exposition, missed opportunities and multiple magic beans of Inception is a good example. (Still a great movie in many ways)\n\nJonathan did not work on Inception.",
            "Lol! I respect that. I really loved the idea of Tenet but I was dissapointed in the execution and the characters. It was also lacking the heart. I like it less ob my second viewing. But I still loved the idea, some of its message,  and the directing.\n\n\nIt was the skeleton of a masterpiece and a reminder of what could've/should've been.",
            "I still haven't seen Oppenheimer but I love love Dunkirk. I appreciate so much kore after rewatching years after release.",
            "Maybe I'm remembering wrong, but didn't Lisa Joy kind of take over for the later seasons of Westworld and Jonathan took a step back? I remember seeing that in a behind the scenes making of the future seasons.\n\n\nI don't think that Jonathan Nolan didn't write or direct any of the episodes of Peripheral.\n\n\nI'm sorry you didn't enjoy Fallout. I really did. \n\n\nI do really agree that they need eachother.",
            "I completely agree with you. My twin sister and I have been discussing this the last few years because he's always been our #1 but right now he's our #2. That can always change though!",
            "I totally respect your opinion! \n\n\nI agree with the rest of your comment :)\n\n\nBranagh is a great actor but I don't think that his character was layered enough. ",
            "Man Tenant was straight trash. Half of the dialogue is total inaudible, and the whole climax is guys screaming at each other while dangling a giant MacGuffin over a hole. That isn't just bad writing, it is borderline intentionally bad writing. Like to parody and mock a bad action flick I would just cut the scene straight out of the movie and put it in a sketch show like SNL",
            "Tenet sounded interesting in the first previews, but it's like it falls flat when you finally see the movie. Several of Nolan's movies have some plot problems but not to the extent that it ruins the movies (always hated the skiing scenes in Inception but it's  more the set than the plot that irritates).\n\nI wonder what the most credible \"mind fuck\" movies are? Google suggest Primer, Mullholland Drive and 2001: A Space Odyssey ",
            ">Idk how you can look at Dunkirk and claim it's anything but phenomenal or use it as evidence of his downfall..\n\nI absolutely love Dunkirk but it's understandable that it was divisive among Nolan fans. If it doesn't immediately grab you with it's simple premise of survival then there isn't much to draw you in. That intense 2 hours you spent in the theatre was two hours of tedious noise for those that didn't click with the film.",
            "I mean, a lot of people didn't care for Dunkirk. I don't think it's phenomenal at all and a real missed opportunity. You must realize not everyone shares your opinion about these movies right?",
            "Strongly recommend the show Person of Interest if you like sci-fi. It was Johnathan Nolan's first series and it is all-time excellent in my opinion. It was overlooked since it was a CBS procedural show, but it does a great job with its overarching story and the last two seasons dive head-first into that arc mostly without the procedural format. \n\nIf you're in the U.S. it's free to watch with ads on Freevee.",
            "I really enjoyed Fallout and I hear that game fans were very pleased!",
            "I didn't know that! I will say that I think Christopher's three newer films are lacking in the female characters area. Not saying he doesn't have female characters in his movies, just that there lacking a certain something that makes me relate to them as a woman. Elizabeth Debicki's character in Tenet is the first that comes to my mind. And I dont count Oppenheimer because it's a historical movie so he didn't exactly write the female characters. ",
            "I have to agree. I love Nolan but I'm always surprised by the praise Dunkirk gets. I just found the whole thing pretty uninteresting and like we'd seen it all before.",
            "Facts. I saw Oppenheimer in theaters and i was fidgeting the whole time. And I’m somebody who LOVES movies. Oppenheimer just did not work for me at all",
            "I did, last week. But it was removed (no reason given) within an hour of my posting it.",
            "I have to disagree. I don't think he's a shitty writer by any means. Dunkirk and Oppenheimer were still amazing movies, in my opinion.",
            "I agree that I think they need eachother! They both make amazing projects separately but make masterpieces together (in my opinion, not stating a fact)!\n\n\nEdit to add: I don't think that Jonathan is doing a bad job at all on his own. ",
            "Dunkirk and Oppenheimer are like nothing he's done before. Because he always made more sc-fi ish type stuff, or just fiction in general. I thought they were great movies too, just not masterpieces. But I don't necessarily think anyone else could've made them better if they were the director/writer. It's just that I think his movies have become colder, more analytical, and are lacking that last level of heart/soul and spark. \n\n\nControversial opinion, but I absolutely loved DKR.",
            "Which ones? Person of Interest was fantastic, and Fallout has been considered a huge success. \n\n\nAlso, I'm not saying that Jonathan was the ONLY reason that those movies were masterpieces. Just that the two brothers together make masterpieces and Jonathan's noticably missing from Christopher's last three movies. Also, Jonathan Nolan hasn't made any movies on his own, only TV series.",
            "Absolutely. It couldn't be a charismatic movie by nature. It would've been disrespectful to have pizaz. But it was missing a little bit of feeling to me personally, for the subject matter. But I will say, the last line of the film has stuck with me for the last year and it really made the whole movie for me. It was almost like the whole movie was to build up that final line and it really made an impact on me.",
            "Westworld had one good season.",
            "Person of Interest is Jonathan Nolan's best work. Best character work, full of emotion and feeling and criminally underrated.",
            "That's actually hilarious lol",
            "Omfg thats really him",
            "I think you articulated it really well…\n\nIt’s not that his new movies are *bad*, they’re just *different*. They have a bit less ‘pizzazz’ as another commenter put it. Which served the tone of Oppenheimer really well. But I think Tenet would have benefited from Jonathan. And I love Dunkirk but I’m open to the possibility that it could’ve been 10-15% better with Jonathan’s input.",
            "Lol, honestly!",
            "I love how articulated your comment is. I completely agree with you. I do hope they do some projects together again while they're doing their own.",
            "Your last paragraph indicates that they split on good terms then! I do hope they make more projects together. I like Lisa Joy but she's no Chris Nolan or Jonathan Nolan. Not yet, at least. Once she kind of took the front seat in Westworld, it went down hill (although, I don't know for certain if it was mostly because of her, I'm just speculating) Plus, she wrote/directed Reminiscence, and while it was beautifully shot, the story wasn't good.",
            "Yep, it most likely was you lol. Bit crap that it was deleted without explanation.",
            "Lol! Hey, the same people are seeing it within an hour of me posting it! That's super cool!",
            "Meanwhile, the sound design will emphasise explosions over coherent dialogue.",
            "Collaboration is easy to talk about but can be hard to do, everyone’s egos can get in the way.  And I do think Christopher has blind spots/weak points, that can be hard to point out to someone who is running the project without it feeling like criticism and Christopher has a tight circle of people he works with, also he comes across as very driven and he is successful.  That makes it hard for anyone new to point out small problems in a constructive manner.   But all of this is speculation, we will know if this is case.  But I do Christopher more recent films are just some sort of interplay between the characters and in Fallout and Westworld that element is there.",
            "Is that right? Interesting, I had forgotten that one. I picked it because it’s the Chris Nolan movie I’m most familiar with. whoops, haha",
            "None of them was, except phps Neil, which was surprising at that time (yeah, i know, he is a good actor, forgetting Twilight, forgetting Twilight). It looked like if he was the only actor, who barely understood the script, with all it's impacts to the persons. Or in other words, his role was \"a little bit dramatic\".",
            "I watched that in a drive-in during the pandemic and attributed the inaudible dialogue largely due to the sound coming through my car radio, turns out it was inaudible for everyone and I haven’t bothered to watch again to check",
            "I rewatched it with a friend and were pausing a lot to talk about what was going on. My opinion of it went way down after discussing it in detail with someone. The movie has some cool visuals but jesus christ.",
            "Yeah, I have very good hearing but I had so much trouble with that movie. It was baffling to me. His response to the mixing criticism made me lose a lot of respect for him too, honestly. Felt pompous or something, not entirely sure how to articulate it.",
            "Primer is definitely one.  I watched that when I was like 16 and sick with the flu. That was an experience.",
            "Nice I’ll check it out, thanks ",
            "Dude I sooo agree. There is something missing as far as a \"strong\" female character in his movies, but Selina Kyle was so different. Although I gotta give props to Elliott Page's character. ",
            "Yeah, I love movies - I watch probably 5-7 of them every week.  I find Oppenheimer weird as well, as the soundtrack while people are talking sounds like something out of an action movie.  It just feels weird.",
            "Your opinion is seemingly in alignment in our reality of good story telling!",
            "I get what you mean but I think Josh Harnett, Mark Rylance and Robert Pattinson all show that he can still handle the heart/soul. Honestly I think he just became interested in different things.\n\nWe will have to agree to disagree on DKR. I liked bits of it but I liked bits of Tenet.",
            "“ I believe we did.”",
            "I'd argue Season 2 was good. If anything, the Akacheta episode alone makes up for the rest of it being such a mess.",
            "While the second wasn't a masterpiece like the first, it was entertaining and I think fair to say reached the level of \"good.\"",
            "I'm speaking of the emotion in those shows. It's what's desperately missing from Christopher's movies. \n\nOverall, Westworld only works for a season. Probably the same for Fallout. But they play emotion and humanity very very well in those seasons.",
            "Lol sitting at 6 upvotes",
            "I mean, they didn't actually ever \"split\" seeing as they were never actually \"together\". Sure, they worked together most of the time but they were never like the Coen Brothers or something. Jonathan's been doing his own thing for a while now, he originally wrote Interstellar by himself and he did Person of Interest for 5 seasons before Westworld came to fruition. Even Chris did Inception without Jonathan.",
            "Thank you!! I've been stewing on this for years and wanted to discuss it online.",
            "WHAT? CAN'T HEAR YOU. I'll just put subtitles on",
            "Also, I think Robert Pattinson just brought the magic that I'm talking about to that role. I also give credit to the little bit that Aaron Taylor Johnson was in the movie. \n\n\nJohn David Washington dissapointed me in Tenet. I don't think he was ready for that type of movie/role. He was amazing in BlacKkKlansman and I think he really found his footing in The Creater, too. Albeit, more as the film went on. ",
            "Mixing is actually one of the reasons I do not see his movies in theaters most of the time. It was really bad in Tenet, but basically all of his movies that I can remember have terrible mixing. The movies are so loud that I want to wear earplugs, but if I do that I can't hear the dialogue. So I usually end up waiting any watching them when I can control the volume and put subtitles on.\n\nIt is not just limited to him, though he is one of the worst offenders. So many big budget movies do exactly the same thing and I legitimately cannot understand why. My theory, based on nothing, is that because the people working on it already know the dialogue they do not recognize how difficult it can be to understand when every other sound in the movie is blaring. And I think they make the sound so loud to try and bring you into the world of the movie more.\n\nRegardless of why though, I hate it. Ruins movies for me.",
            "I'm glad we have the same view! Yeah! I don't know... personally I find his female characters to be kind of too mean and cold. Women can be strong without being ice. Elliot Page's character was great, too. But again, Jonathan wrote those movies too.",
            "I’ve thought a lot about Oppenheimer and how much i do not understand the praise it’s getting. Oppenhiemer being a shit movie is one of my hottest takes apparently lol. Glad to meet somebody who agrees it’s not the best movie ever made haha. What movies have you watched this week btw?",
            "Honestly brings tears to my eyes.",
            "I adore that episode!",
            "It was a great episode but it doesn't make up for the rest by a long shot. Season 3 was weak, 4 improved but still, with one truly great season out of four, OP is giving Jonathan way too much credit",
            "The seasons after 1 tend to work well emotionally but not logically. Which supports the argument that the brothers work best supporting each other and shoring up the other’s weak points.",
            "Can’t say I agree with you. Oppenheimer and Dunkirk had plenty of emotion. I think what you’re looking for is a soap opera.",
            "I, too, want to know what movies you guys have been seeing this week. ",
            "I agree. My twin sister any I say we're the Ying to eachothers' Yang. I feel the same way about the Nolan brothers. Although, I will say that season 1 of Westworld wasn't just fantastic but was a masterpiece.",
            "Dunkirk might be the least emotional war movie Ive ever seen. Its all spectacle, cant even remember the character's names",
            "Oppenheimer lacks so much honest emotion. I personally like Dunkirk,  but certainly not because of the emotion between characters.\n\nTennet is one of the worst movies I've ever seen in terms of character dynamic and emotion. \n\nMaybe you're looking for a textbook?",
            "I think you may be confusing dramatic scoring and visual grandeur for emotion. \n\nLook, I like and enjoyed this films a lot, but it’s hardly a lie to state that his films are, generally, quite analytical and cold in their execution. He’s a very precise filmmaker, kind of like Fincher, but (Christoffer) Nolan always seems to be most interested in the overall story and telling it in a visual way. Characters always come second in his films, they’re necessary to tell the story but he doesn’t really care if they say the best lines or are even seen on screen. Hardy’s roles in both Batman and Dunkirk were both basically just voice roles, and even then often only because you needed a voice to have any exposition, but especially in Dunkirk, what mattered was the *story* and *visual storytelling* of the plane, not necessarily the pilot himself. \n\nHe also often has tons of tension and conflict, but again, that’s not necessarily the same as *emotion*, and even if a character is at some point saying something in an emotional state, *the film* doesn’t necessarily reflect that. It just treats it as any other scene. \n\nI would say Interstellar is probably one of his more emotional films, and even there it’s only in a few short moments where the film allows the entire scene to be truly about emotion.",
            "*Yin",
            "There's more to emotion than the characters having names. They're soldiers, we see the emotion in their courage, their fear, their choices.",
            "Yeah, Nolan is incredibly impressive in technical skill, but doesn't do feelings and strong emotions well most of the time.",
            "I must only like dishonest emotion then."
        ]
    }
}