{
    "It's been an honour.": {
        "title": "It's been an honour.",
        "score": 11965,
        "url": "https://www.reddit.com/r/MurderedByWords/comments/14g36ia/its_been_an_honour/",
        "content": "Hi. A lot of you newer people probably don't know me, but I'm that guy who dragged MurderedByWords out of the grave about five years or so ago. I was a pretty active mod here for awhile, and stepped back once the sub was in good hands. It's been great watching the sub get huge, I still remember hitting the 1mil mark and being super excited about it.\n\nWhile I haven't really been as visible here lately, I've always kept an eye on the place and it's been fun watching it grow. Today I'm formally turning my mod keys in, and I guess I just wanted to say goodbye to the first Reddit community I was ever in charge of. Y'all are great.\n\nRemember, [Be excellent to each other. And party on, dudes.](https://youtu.be/rph_1DODXDU)",
        "num_comments": 524,
        "comments": [
            "It's been great moderating this community with you, Z! I'm not sure what will happen next with this subreddit and with Reddit as a whole, but until the last person out the door shuts off the lights, just know we're holding the fort here for you",
            "Somebody with more wit than me needs to murder this guy with words one last time",
            "This isn't anything close to a murder.\n\n*wipes away tear and salutes\n\n*reports post",
            "Spez is a pig boy. Live long and prosper, fam.",
            "![gif](giphy|L17Rt82QrScQU|downsized)",
            "You were good, son, real good. Maybe even the best. Godspeed you magnificent bastard.",
            "Thank you for your hard work over the years.",
            "Silver lining here is, a lot of ~~admins~~ mods realized they were working free for a shit company and decided to do something better for their lives.",
            "Thanks for all the fish",
            "Thanks for the good stewardship. I enjoy my time here and most likely have you to thank for the quality rules. Have a good time wherever you're going.",
            "[deleted]",
            "I wonder if OP was threatened by reddit admins",
            "Honestly, this is one of my favorite subreddits, and while I don't know you by name, I'm glad that you dedicated yourself to bringing this subreddit back. Thank you so much and hopefully you get to enjoy retiring from the mod life",
            "Take care, King.",
            "Z, thank you for your work. And ignore these ignorant shit-posters: they’re miserable people and not even worthy of a downvote or a single thought.",
            "![gif](giphy|2wh2qSAmEnnlMJZ3aL)",
            "[deleted]",
            "May you find more happiness in rest of your ventures",
            "o7",
            "Thank you, this is a great sub. And you should be proud of your work.",
            "Thank you so much for your work. Party on.",
            "So long and thanks for all the hits",
            "F",
            "Thanks for everything, my dude. Good luck and godspeed!",
            "You're still pretty, even if you're not a mod or active.",
            "o7 Thanks for all you have done over the years.",
            "thanks for your work",
            "Wishing you oceans of luck! (Just don’t go on a sub voyage.)",
            "A big hand please, ladies and gentlemen, for the Great Prophet\nZarquon! He has come! Zarquon has come again!",
            "Hasta La Vista Baby! 😀\n\nI turned in my keys yesterday, I didn't bother making a GoodBye post because I figured no one would care.\n\nTake care of yourself and good luck!",
            "Thank you, just don't be replaced by someone who won't fight against Reddit API disgusting rule changes.",
            "Thank you so much for everything you’ve done :) cya!",
            "Great, now I have to go listen to robbi robbs in time...again. \n\nGodspeed chief.",
            "So long, my friend. You will be missed…",
            "Hey man, I don't know who you are, but I have to say I've always loved the sub. If you were the one responsible for bringing it to the forefront, I have to say thank you. Great job! You've given me many a smile and many a head-shake. Cheers. Be excellent and party on yourself, dude.",
            "![gif](giphy|l0ExbnGIX9sMFS7PG)",
            "reddit has humanized so many mods, sad to see all the good ones go\n\nthank you have take it easy man",
            "Best of luck on all your endeavors",
            "Definitely a good sub, ggs brother",
            "Good day to you Good sir, may your travels bring you joy",
            "Hey thanks for all your time and contribution to making this a good place to visit. It really means a lot.",
            "The divine invisible hand of the market will take up the slack.",
            "Founding mod: \"Hey guys, im out! See yall around!\"\n\nCommunity: \"yeaj no1 cares fuck u bye bitch\"\n\nHas humanity seriously become so uncivil?",
            "Bon voyage my friend",
            "Thanks! Never been a mod, so I don't even know what you've done for us, but thank you!",
            "Shame about this shitshow… Thank you for your work and good luck in your future endeavours.",
            "I wish you the best of luck with your life ahead, take care mate!",
            "o7",
            "So long my friend :)",
            "thanks dude",
            "O7",
            "I eagerly await the Second Coming Of Zarquon. May you always know where your towel is, you hoopy frood.",
            "Thank you!!! THANK YOU !!!!",
            "Thank you for your hard work. \n\nAlso, fuck /u/spez. Aaron Swartz would be disappointed in him.",
            "Totally bodacious, dude!\n\nWishing you all the best, mate. You’ve been a legend 🫡",
            "Thank you for your service sir",
            "fuck spez. \n\nthanks for building a cool sub. I hope it dies now.",
            "Thank you for all of your work over the years.",
            "Party on",
            "I will dearly miss you and the likely demise of this wonderful sub.",
            "Raise a glass. Well done.",
            "Take care my dudes",
            "If you like the subreddit, try looking up the worst facebook meme groups imaginable and you’ll find what will be on here tomorrow",
            "o7",
            "Note to self: the huge dating red flag \"is rude to service staff\" also applies to \"is rude to Reddit mods.\"",
            "Godspeed!",
            "Station!",
            "Fair winds",
            "Glad you took the time to perform this Reddit-Resurrection. Your Frankenstein-zombie-sub is awesome!",
            "So long, partner. I wish you the best!",
            "O7",
            "o7",
            "Farewell! Thank you for all you’ve done for us 😍😊😌",
            "I can't even image modding, let alone building a sub, let alone reviving one from the dead. Thank you for helping build one of my favorite lurk subs, even if I don't comment here much (or have returned here since school ramped up).\n\nSorry for Reddit burning up into a ball of ash right now. Twitch and Reddit are both sucking the oxygen out of what would otherwise be a Discord fire, so yeah. There's a lot of blame, hate, action, and then consequences being thrown around without thought on here. Sit back, take a break, and remember that not the entire world is against you.\n\nSo long, ~~and thanks for all the fish. Don't try to catch any in a deep-sea carbon-fiber 1300-meter-rated-window submarine, though.~~",
            "Cheers mate! 🍻",
            "An inspiring thing you've done here. All good things...",
            "Touch grass nerd, I'll meet you there.",
            "This entire site is starting to look bleak. Thanks, so long, and your mother's a hoor.",
            "Station!",
            "O7",
            "Most triumphant",
            "And we thank you for your work good sir or ma’am, best of luck with wherever life takes you.",
            "Is Reddit kicking you out like other mods?",
            "![gif](giphy|gI5GFZcFy2kQ2Bm1Hw)\n\nThanks for resurrecting it for us.  It's been fun to pop in and see the humor.  Much appreciation and sorry some are making cutting remarks about your exit.  We appreciate that this has been here for our enjoyment and thank you for making that happen.  Best wishes.",
            "Thanks dude!! Good horizons to you, appreciate your hard work over the last bit.",
            "Way to go out on top, Seinfeld.",
            "you don’t even want to wait around for title fight “marky vs tesly “. since no fighting will actually happen",
            "F",
            "I remember seeing your user flair around alot. Hope you're doing well.",
            "There will never be a greater Zarquon.. o7",
            "Thank you",
            "Thanks for your contribution.",
            "Salute!",
            "![gif](giphy|3yP65niAsFzDa)",
            "![gif](giphy|lNQ2RRsEfJqbjg1i0I)\n\nGood luck we'll be fine man!",
            "o7",
            "‘til Milliways",
            "So long",
            "Farewell good sir",
            "F",
            "[removed]",
            "Thanks and best of luck!",
            "o7",
            "💐🫡💐",
            "Thank you for being excellent dude",
            "This has been a great sub to be a part of. There's a growing and thriving little community happening over at squabbles that would welcome the organic growth of a high quality sub such as MBW with open arms. \n\nNot that I'm fanning the flames of a Rexodus or anything...",
            "Thank you!",
            "Hope to see you on the other side!",
            "Thanks for all you have done but good to see you moving on it was always a little uncomfortable for your mom and I with you in the basement.",
            "o7",
            "![gif](giphy|hWw8WWjYFhv3XqsgzY)",
            "o7",
            "Dang.. And I just joined. Sucks to see a person having to leave something they spent so much time on and enjoyed.",
            "🫡",
            "Sir, it has been an honor.",
            "Can you come back? I'm only from /r/all and it's obvious how shit this sub has gone to since you left.",
            "The Great Prophet Zarquon has left the building.",
            "Cya dude",
            "Is there a list of other subs this guy mods?",
            "Well ..... Bye",
            "Best of luck on career prospests",
            "This guy is the type to kill me with sadness",
            "This sub had mods? It was hard to tell given how many \"murders\" are really just passive aggressive quips.",
            "Why did you work for free amd how many hours a week did you put into this? :o",
            "this is just another toxic shithole sub where insecure people jerk themselves off to strangers \"owning\" other people because its easier than leaving their computers and actually dealing with their problems. the human race would have literally been better off if this sub never existed. and before y'all come at me - I know these things because I am right there with you! rip. anyways though props dude, you did good",
            "Of course someone with the ego to call themselves Great was a Reddit mod",
            "K bye.",
            "¯\\\\\\_​(ツ)\\_/¯",
            "Murdered by time. You will be forgotten.",
            "Cool, some guy who worked for free is leaving",
            "So you’re the guy who made it so “no u” counts as a murder as long as reddit likes the person saying it",
            "STOP",
            "[removed]",
            "This sub left the grave?  I’ve only been on here for the few nuggets of gold that get posted on here once every few months",
            "We'll survive. Ciao.",
            "[removed]",
            "[deleted]",
            "\"Be excellent to each other\", he quotes, 'forgetting' that the sub THRIVES on conflict and negativity like a cross between TMZ and r/WPT",
            "[removed]",
            "Lol",
            "[removed]",
            "[removed]",
            "Tldr",
            "Not an airport, dude.",
            "Nobody cares, cya",
            "Ok",
            "Yeah no one cares",
            "[removed]",
            "Hope you enjoyed working for free",
            "[removed]",
            "[removed]",
            "this sub is shit, nobody cares",
            "[deleted]",
            "They need you back on the streets burning down Starbucks and spray painting cop cars?",
            "[deleted]",
            "Cool. Don't care.",
            "REDDIT CONTROVERSY",
            "o7 sir!",
            "Party on, dude.",
            "Godspeed brother🫡",
            "Lots of love you’ll be missed soilder 🫡",
            "🫡",
            "cya bro (im late lol)",
            "Good luck to you brother!",
            "Wait.\n\nWhat?",
            "Nah, I think your level of wit is exactly what he deserves.",
            "\"Yeah, well, your FACE.\"\n\nGot 'eem",
            "My face, your ass!\n\nEdit: No, wait, I got that wrong.\n\nYour ass my face!",
            "He's a mod.",
            "\"once the sub was in good hands\" its only in good hands because you left",
            "I’m fuckin dying laughing",
            "Good luck and godspeed!",
            "Get some rest Slurms, you deserve it.",
            "Definitely a good sub, ggs brother...",
            "*lot of mods\n\nAdmins are actually Reddit employees.",
            "Unfortunately, there are PLENTY of people that will still mod subs for the perceived power they gain.",
            "This isn't Runescape!",
            "\"It's a nice sub you got there. Be a pity if something happened to it.\" --spaz",
            "Every mod of every sub that went dark was. I got a threat about /r/bethstern, it has like 6 users. I told /u/modcodeofconduct to suck my balls and am awaiting my perm ban",
            "Needs more Your Mum jokes, indeed.",
            "What does this even mean?",
            "F",
            "Sorry I'm late, had a terrible time, all sorts of ghastly things cropping up at the last moment.\n\nHow are we for time? Have I just got a min-",
            "Some of us care. Thanks for everything!",
            "[removed]",
            "Haven't heard that name in a while. I loved three fish, but then I was high every time I listened to it/them.",
            "That's because we're humans too, my dudes. The difference between reddit and the rest of the online communities has always been, up until this point anyway, that moderators were in 100% control of creating, maintaining, managing and growing their communities. Twitter, Instagram, Facebook and the rest have \"moderators\" and they are literally just button pushers - Yes this tweet is okay. No this post is bad. Yes this picture is okay....\n\nReddit gave us an empty building. We did the buildout, installed all the equipment and furniture, painted the building and put up signage and branding. We built the customer base and kept them coming back. The rent we paid for the building was the user base we attracted, and the customers were free to show up by whatever method they liked. Now they won't let people in the door if they don't show up in a reddit-owned rickshaw service. So we're protesting, and their answer is to act like we didn't put in the hard work of getting everyone here in the first place, and that they have no qualms about kicking us out and giving our hard work to someone else.\n\nFuck that.",
            "I wonder if OP was threatened by reddit admins",
            ">reddit has humanized so many mods\n\nWhat, by making fun of them, calling them fat basement dwellers?",
            "This post is cringe af.",
            "here's hoping Reddit's IPO starts high, and lands about as low as the Titan debris field.",
            ">Has humanity seriously become so uncivil?\n\nHave you been following the Titan sub memes?",
            "Yes, fuck you.  Sorry just a reflex",
            "See? This mod didn't need to pin their farewell. They just said it and moved on. This is what /u/beerbellybegone should've done.",
            "We have come full circle lmao",
            "[removed]",
            "Lol what?! You take this shit way to seriously",
            "/r/redditalternatives, per a comment up thread, the developer of Sync for Reddit is developing Sync for Lemmy and should have it done in a few weeks",
            "I love Steve Huffman aka Spez. I have a reoccuring dream every night of sneaking into the locker room at Planet Fitness while he works diligently on his perfectly toned body.\n\nI find his locker, which is conveniently covered in slightly scratched off r/ jailbait stickers (where he used to be the PRIME mod in 2008). I reach into his gym bag, find his white Calvin Kleins, and I delicately sniff the exquisite scent of his graceful skid marks.it carries the remnants of last night's dinner: Hungry Man Salsbury Steak and Mashed Potatoes, SunnyD, and Birthday Cake Oreos. I savor the fragrance, working it around my mouth like a fine syrah.\n\nI look over my shoulder to make sure I'm alone. Next I grab his Polo Ralph Lauren Bienne Tumbled Leather Boat Shoes. Tan, because Steve is a fashion Pioneer. I slip my tongue into the leather, plying the crevices for tidbits of my hero. I crack a sly smile- it's clear he doesnt wear socks- the leather is rich with the flavor of his sweaty piggies. The salty schmear enfolds me in ecstacy- my jock strap is full of runny pre-cum, my asshole is pulsing. \n\nA sound behind me breaks me out of my rapture. A gym-goer is returning from the floor. Quickly I return Steven's artifacts to his bag. I quietly close the door and slip out the back of the locker room, a bandit in flight. I'm not deterred- I'll be back. Steven Huffman is my weakness. I crave his sensual touch. Thank you, Spez, for enslaving my heart.",
            "F",
            "I knew his username sounded familiar!",
            "And thanks for all the fish",
            "Outside?",
            "Yes, I’d love to avoid them.",
            "Thanks for adding your own passive aggressive quip",
            "The greatest sin that capitalism imposes is that supposition that anything a person does ought to be monetized.\n\nThat doesnt mean that you should be exploited, but you dont need to be a streamer to enjoy playing games, you dont need an etsy shop if you enjoy knitting or crafting. You dont need a podcast to enjoy movies. Often, as soon as you take what you find fulfillment in and monetize it, it becomes just another job that no longer brings you joy.\n\nIts unfortunate that Reddit is built on exploiting that sense of fulfillment, but that doesnt make what they (the mods) did wrong or bad.",
            "People always ask me that when I'm working on my hobbies like gardening and brewing beer.\n\nIt's because I want to and I enjoy doing it. Some days I work an hour on my garden. Some days it takes 4 hours to brew.",
            "Of course someone with the name tapkeys would post some brain-dead comment they think people want to see instead of just scrolling",
            "👈 Watch out: we’ve got a badass over here",
            "At least we can rest assured even more will forget you",
            "Lol yeah, because how much someone is paid is how we value their work...\n\nLike, if you're going to be an asshole at least make a little bit of sense",
            "And here you are giving less for less",
            "Username checks out.",
            "no u",
            "no u",
            "This isn't an airport. No need to announce your departure",
            "Did you even see the text? It's about people who made the sub popular. I expect you to get MurederedByWords soon lol.",
            "[removed]",
            "We are trying to have a nice moment here.",
            "Life is about so, so much more than money...",
            "Strange criticism from someone with such an active account.",
            "Gives community 5 years of essentially free work and jumpstarts the whole community from the grave.\n\n\"You don't need to announce your departure\"",
            "*THis AiNt aN AirPoRT, yOu dOnT NeEd tO aNnOunCE yOuR dEpaRtuRe.* Bro... just shut the fuck up.",
            "But how else would we know!?!\n\n\n/s",
            "Bro your a 12 year old edgelord get off reddit and go touch grass you absolute swine of a child",
            "Commit fuck off.",
            "🤓",
            "Without mods, subreddits can't build platforms because they will be filled with trash contents, like 99% of contributions from users are useless (prime example being your comment), mods make these places actually worth it",
            "Fuck you, and fuck Spez.",
            "[removed]",
            "Shut up",
            "I care. Asshole.",
            "Why are you here lol",
            "What made you such a putrid person that you would take the time to write this? Move on, go find a father figure in your life.",
            "Eat a dick, scab",
            "What the fuck are you on? 5 wilted leaves of cabbage? Is that all that’s in your head?",
            "He did not work for free. Money isn't the only thing we get paid for what we do.",
            "Siri, what is a hobby?",
            "I bet he did",
            "> This sub was trash even with your free contribution, so I guess it's not a real loss either way.\n\nThen why the fuck are you here crying about shit? God, you're a loser.",
            "Nice comment, I have no idea who you are or the other commenters here who are also a POS. You and people like you make this sub trash. Since Reddit is self destructing I guess it won't be a loss either way.",
            "I have no idea who you are either. Why not unsubscribe and save us the displeasure of seeing your name on comments?",
            "Weed regrets getting smoked by u",
            "[deleted]",
            "I hope the rest of your week is as pleasant as you are.",
            "Hope you always feel like you have to sneeze and never can",
            "Edgy take.",
            "And yet here you still are. How’s that working out for you?",
            "Yet here you are, making a fool of yourself....",
            "Did you forget to put on the pacifier?",
            "Fuck cops",
            "This isn’t a group therapy session. No need to announce your personal feelings. Nice sense of misplaced importance you have. Typical loser commenter, you won’t be loved. Ever.",
            "Typical butt-hurt user who thinks they are entitled to be uncivil to others to show they are badass. Nice sense of misplaced importance you have.",
            "uh oh. you done fucked up. you’re the one with misplaced sense of importance if you have the balls to comment this.",
            "Yikes",
            "and yet here you are.",
            "Good for you Timmy. Have a cookie",
            "He tried to lob a softball and you picked him up and swung him at op instead",
            "🏌️‍♂️",
            "Sick burn!",
            "*Was*.",
            "Ah yes. My mistake.",
            "Tin gods are a dime a dozen",
            "o7 great work soldier",
            "No idea what it is but I subscribed out of solidarity.",
            "115 subs now lol. Awesome pointed post, too",
            "Legendary",
            "Subbed",
            ">/r/bethstern,\n\nI'm membership #132. Do I get a Blockbuster style membership card? Piece of paper hard-laminated?\n\nI don't know why I joined, I wasn't on when the blackout was going on, so I kinda just wanna see what happens with it",
            "The little o is a head, the 7 is an arm and hand.\n\nIt's a salute.\n\nCongratulations, you're one of today's lucky 10,000.",
            "It's a little person giving a salute\n\no7",
            "It's supposed to look like a guy saluting",
            "O is a face and 7 is arm and hand saluting.",
            "Salute\n\no7",
            "(Un)expected Douglas Adams",
            "Pffft, probably not even a good reason for being late.",
            "Says the person replying to every comment. Seems someone else is the attention junkie, don't it?",
            "This is the best way I've heard it explained. Bravo.",
            "[deleted]",
            "No you.",
            "Or just, have you been alive the last 5 years?",
            "[removed]",
            "Oh thats actually great, I love sync and lemmy being ugly was a big turnoff",
            "Thanks, might be the best news we get outside of Spez coming to his senses.",
            "What a terrible day to have eyes.",
            "Babe new copypasta",
            "Thank you for reminding me some questions are best left unanswered.",
            "I mean, I was think Lemmy, but yeah. Sure. Wherever.",
            "can i get a list of the subs u frequent so i can avoid you?",
            "Yeah he was gonna make that comment a post on this sub until you said that.",
            "Passive aggressive quips for everyone!",
            "You don't have to be so blunt about it.",
            "> The greatest sin that capitalism imposes is that supposition that anything a person does ought to be monetized\n\nTruly. I understand the \"go get your bag\" mindset but I also feel like it's fucking poison at the same time.",
            "I just asked the man a simple question, to which he gave me a sensible answer, which I accepted. What on earth are you on about, lol",
            "[deleted]",
            "[removed]",
            "Fait enough mate. Thanks for answering.",
            "Gardening and brewing beer doesn't involve asserting authority over people that don't match your beliefs. If a person's hobby is about controlling people and to seek gratification obtained from the power trips then it's not a hobby, that's a commie shill and should go to China, Russia, Iran or North Korea and apply for a membership at the authoritarian regime.",
            "That wasn't a brain dead comment, yours was. I didn't scroll away. I read it. You think that was a good comeback Steve? Oh and your sister telling you you're good at sex doesn't count.",
            "Oooooooo, wicked burn.  😂😂😂😂",
            "That was lame. White knight harder.",
            "You pointing to yourself lol",
            "Oooooo, you sure told HIM.  😂",
            "I just enjoy getting a bunch of parasocial weirdos worked up. Thanks for contributing",
            ":’( lmao",
            "Stop, you’re making me laugh all the Cheeto dust off my fingers",
            "This wasn’t witty enough to bother copying.",
            "I don’t think you read it lmao. Dude literally talks about how he pulled the sub out of the grave and was happy it’s now in good hands. Regardless, I regret wasting the time it took to post even one comment on this thread. Cheers!",
            "spez thing? Is the user spez relevant?",
            "Amen",
            "What moment I’m fucking laughing at this jannies mad lmaooo",
            "Yeah and it's not working for free moderating subreddits lol",
            "But it fits perfectly with this subreddit. I think it is an appropriate send off.",
            ">Gives community 5 years of essentially free work and jumpstarts the whole community from the grave.\n>\n>\"You don't need to announce your departure\"\n\nYou mean worked for reddit for free because he loves the feeling of power he gets",
            "[deleted]",
            "`git commit -m \"fuck off\"`",
            "[removed]",
            "Nope.",
            "\"putrid person\" for making a comment on a random sub reddit.\nDamn bro, I would touch some grass if were you, calm the fucking down.",
            "Ok, Reddit mod",
            "Ah, a classic.",
            "Agree \n\nHe didn’t work for free. He worked for the personal satisfaction of a job well done.",
            "I got got, you called me out and caught me crying. I did some soul searching and decided to change my ways, so hopefully I can not be a loser in the future. Thank you, kind Redditor.",
            "Why not block me or save yourself the trouble of dredging the bottom of the comment section just to have a go at the most downvoted comments? You enjoy it. Do your thing, baby, I'm here for you.",
            "I'm sorry you're upset that I shit on your janitor's retirement speech :(",
            "Actually no, moron.",
            "thanks!",
            "oh I'm not actually, this sub was just back on /r/all after un-privating. don't worry, I filtered it again",
            "Where is Vin Diesel when you need him",
            "r/MurderedByWords",
            "One cannot care and comment. The two are not mutually exclusive.  Mind blowing, ain't it?",
            "r/murderedbywords",
            "Guess that makes me 10,001",
            "I don't feel very lucky",
            "what about \\\\o",
            "[deleted]",
            "I see it now!",
            "(☞ﾟヮﾟ)☞",
            "Three total comments consisting of a total of a few sentences is replying to every comment? Are you illiterate or just stupid?",
            "let's be honest, no one does care. People are just being polite about it, but I don't think anyone would have noticed otherwise.",
            "And those users posted in communities run by mods who tailor rules. You don’t see many subs with anarchy going on that ended up becoming successful.",
            "I love how you can say this with out a shred of irony while speaking from the position of privilege of having a subreddit for literally any topic your heart desires that isn't overrun with spam and low-effort content.  Half of the subs I moderate I ended up doing it because I was trying to get the existing moderators to do something about the garbage that was flooding the sub, and they eventually went \"I can't do this, if you think you can, I'll mod you and you can have at it\".  \n\nYou mod three subs and the most popular one has 500 members - you have no clue what actual subreddits deal with and what a shitshow a subreddit can turn into without moderation.",
            "And you guys will complain when Reddit turns out like shit with no content of worth",
            "r/MurderedByWords",
            "Or at least been on Reddit for 5 minutes?",
            "I mean... you take time out of your day just to be a cunt unprompted. Definitely a red flag.",
            "Happy Cakeday!",
            "What a terrible day to be literate",
            "Sure.  It’s on my bio.",
            "Oh, easy. Support people lmao. Why wouldnt I want to support people?",
            "I can tell reading comprehension was your low score.",
            "So is it communism or authoritarianism?",
            "I think it's time for bed for a wittle cwanky mannnn",
            "Haha good point. Changed",
            "Don't know why you're being downvoted?",
            "What a sad little life you must lead lol",
            "Oh good thing I don't care",
            "I'm literally laughing my ass off at your stupidity. As you said, the guy literally saved murderedbywords and yet you don't understand that people can be thankful for his hard work. 😆🤦",
            "You guys ever stop and wonder that the reason you are getting downvoted is that the regular user base who checks these comments are disagreeing with you?",
            "If they enjoy doing so, why not? As long as they don't dedicate their entire lives on it",
            "Yeah nothing says need for power like taking over as a mod for a completely dead sub then leaving voluntarily when it’s at its all time peak of active users \n\nYou people are obnoxious, not every mod on Reddit has some power fetish. You don’t hear a word from 99% of mods on this site because they do a fine job so nobody notices them",
            "Some people actually like things. Not everyone is a psychopath that gets off on feeling superior",
            "[removed]",
            "We have other mods, we're just appreciating this one for his work. Fuck you man people like this are what are making reddit so trash",
            "Is that what your fam says when asked if they love you?",
            "Make sure you keep spending time telling people how much you don't care about them, that'll show 'em.",
            "Don't bring janitors into this. They do important work for not enough pay.",
            "Got 'em good, the real murder is always in the comments. Bravo, sir.",
            "Firm. But fair.",
            "Cool. Don't care.",
            "[removed]",
            "[https://xkcd.com/1053/](https://xkcd.com/1053/)\n\nIt's a reference to this comic",
            "I did notsee that emoji",
            "thanks for your service policing these comments chief\n\no7",
            "These are some strong opinions you have about a saying. Go touch gras",
            ">NEXT\n\nlol I understood that reference",
            "I'll be illiterate, you seem to have stupid covered all on your own sweetie.",
            "I like how redditors use the \"you commented so you care\" as if it's some checkmate 🤣 Reddit is a site designed to waste time and occupy your mind, that doesn't mean I care **deeply** about everything I comment on",
            "Oh, yeah I really couldn't care less that a mod is leaving. I'm just not gonna be a dick about it like the beam of sunshine I replied to is. That, and I was bored on my lunch break and needed something to do.",
            "Moderatorship is a revolving door of hall monitors, there never has or will be a lack of willing participants. If one sub fails another relevant one will pop up. Watch as nothing fundamentally changes, no need to speculate, it's already largely passed. Mods pretending like they're the value in reddit is hilarious and aligned with the general narcissism that comes with the small role of power.",
            "Put me in the screenshot",
            "And who was I a cunt to?  Are jokes no longer allowed? Or are you a Reddit Karen?",
            "nice, that was a good one! now screenshot ur comment and post it on this sub!",
            "[deleted]",
            "ESL",
            "Like they know the difference.",
            "Definitely. Hope you feel nice and superior now lmao",
            "You cared enough to go “herp derp that’s so funny I’m gonna say it too” and then actually did it.",
            "[removed]",
            "Who gives a fuck what the regular user base thinks?",
            "No, no i do not. Reddit is a time waster, not something I’d get up in arms about.",
            "I don't believe I ever said they couldn't do it. In my personal opinion, it's a waste of time and done purely because they crave power in life and this is the only way they can get some sembelence of it.\n\nIts very, very sad",
            ">Yeah nothing says need for power like taking over as a mod for a completely dead sub then leaving voluntarily when it’s at its all time peak of active users \n>\n\nNuance is not your forte it seems. \n\n\n>You people are obnoxious\n\nSorry, \"you people\"? That sounds like your going for the racial Angle. I don't tolerate racial abuse \n\n> not every mod on Reddit has some power fetish. You don’t hear a word from 99% of mods on this site because they do a fine job so nobody notices them\n\nBut the once that announce to all the subs they mod about their departure probably do fall into that 1%",
            "[removed]",
            "Yes they do, for various reasons. You can be power hungry and be unable to do something anymore",
            "You are arguing with dip shit spez troll account. It is only 14 days old.",
            "No idea.",
            "Right... yep, makes sense. Thanks again, friend.",
            "[removed]",
            "Actually no, moron.",
            "Good for you Timmy. Have a cookie.",
            "funny how you're commenting on a sub they brought back from the dead",
            "Exactly.",
            "Nice. I feel lucky now.",
            "[deleted]",
            "I agree with tou on that",
            "Can I ask how you think we have power?  It's an internet forum.  We're hardly politicians, deciding on new laws.",
            "So you’re telling me you don’t know how to find what subs I belong to.  😂😂😂 that’s just sad.  Goodbye.",
            "Reading comprehension isnt your strong suit, is it?",
            "Oh cool dude, I'll take that into deep, deep consideration",
            "And yet here you are..... soooooooo 🤷",
            "I guess you never heard of a thing called a hobby  , you should go and get one 😘 . (Unless yours is trying to find ways to feel superior ya loser )",
            "Or maybe it's just a hobby they enjoy because they like this sub. You don't have to over exaggerate it so much",
            "You're not fucking different, what's this comment about them? You wants to hold.power too, the power of being better than people, of being higher than them because you don't have something you're passionate about, well news flash, you're fucking not. It's very, very sad",
            "And like power tripping reddit mods, you have shit head reddiotrs that delight in being the biggest piece of shit possible. Bravo......",
            "What the fuck bro?",
            "TIL \"asshole\" is a race",
            "[deleted]",
            "As a janitor I neither want or need your respect Your absence from this sub would be nice though.",
            "This did make me chuckle actually",
            "This guy can't even come up with his own comebacks. Sheesh.",
            "That does not change my opinion about any of it",
            "Are you purposefully being dense? Moderators do have a form of power, albeit small and inconsequential to real life in most aspects, but the ability to censor and dictate online discussion *is* a form of power and can/does get used inappropriately.",
            "yes thats exactly what i said lol",
            "Don’t strain yourself too much!",
            "[removed]",
            ">I guess you never heard of a thing called a hobby  \n\nYes, i have. I explained in my previous comment why I think it's sad. \n\n>you should go and get one 😘 . (Unless yours is trying to find ways to feel superior ya loser )\n\nNo, i have hobbies thanks",
            ">Or maybe it's just a hobby they enjoy because they like this sub. You don't have to over exaggerate it so much\n\nI didnt exaggerate anything. Their hobby is deciding what people can and can't say.",
            ">You're not fucking different, what's this comment about them?\n\nThat doesn't make any sense \n\n>You wants to hold.power too, the power of being better than people,\n\nThats not what power is\n\n>of being higher than them because you don't have something you're passionate about\n\nThat makes no sense either. \n\n> well news flash, you're fucking not. It's very, very sad\n\nIt looks like you now want the \"power\" to be \"higher than me\" now",
            "[removed]",
            "It's very clear \"what the fuck\" is by my comment - which words are you struggling with?",
            "I never said that. Please read more carefully next time",
            "Wonderful, how are you?",
            "Check the comment time. Someone else used the same comment I did, but after I did.",
            "but you're commenting on the very sub he saved, hypocrite",
            "I’m not like that. I haven’t banned you or removed any of your comments. We’re not the enemy. We just want to keep the subs tidy for the community.",
            "They're being dense haha.",
            "I think I pooped I need help",
            "Lol “regret wasting the time it took to post even one comment” posts 5 comments. Did you… just get murdered by your own words?",
            "This guy seems like he's more than just that. And I was talking more about the carving power shit, that's way too dramatic. Not everyone is like that even if the majority are",
            "[removed]",
            ">For example, you'd put me above (or at least on par) with murderers, racists and paedophiles, because we differ in views about the reason people moderate on reddit?\n\nI mean I'd like to think we are all above murderers, racists, and pedos, but if you think you are just slightly or on par with them, that's on you man. I just called you a shit head.\n\nYou need to believe in yourself more. Have you tried looking into a mirror and trying some self affirmation instead of going off a seemingly decent mod saying good bye to a sub they hold dear?",
            "You people are obnoxious.",
            "[removed]",
            "Your replies are bizarre to me. You asked me a question, I gave an answer. I never suggested you abused your mod privileges. Nothing you've said really relates to or rebukes my original comment at all.",
            "No, i made a foolish decision to play into this shit. Users like you are why this sub sucks so much these days.",
            ">This guy seems like he's more than just that.\n\nWhat are you basing that on? \n\n>And I was talking more about the carving power shit, that's way too dramatic. \n\nDisagree. \n\n\n>Not everyone is like that even if the majority are\n\nSo you agree the majority are then.",
            "\n>I mean I'd like to think we are all above murderers, racists, and pedos, but if you think you are just slightly or on par with them, that's on you man. I just called you a shit head.\n>\n\nIncorrect. Reread the last two comments",
            "Who is \"you people\"?",
            "woah dude why you getting so mad",
            "6",
            "If he dragged this sub out of the grave, idk, that should mean something. And most people agree too. And still, you are too over dramatic about something this basic",
            "lol yeah, I'm crying tears of rage I'm so angry"
        ]
    },
    "Temporary Ban on US Politics": {
        "title": "Temporary Ban on US Politics",
        "score": 8275,
        "url": "https://www.reddit.com/r/MurderedByWords/comments/il1thz/temporary_ban_on_us_politics/",
        "content": "#EDIT: The ban has been extended indefinitely, until such time where the mod team determines it's safe to revoke it. We've noticed that this sub does not suffer from lack of quality content without the political posts, and provides a safe haven from people, both in the US and overseas, who want a slight break from the incessant shitshow that is the US political system. \n\nMembers and subscribers of r/MurderedByWords - You have spoken, and we have listened. \n\nOver the past year we've been deluged with messages, direct chats and modmails asking us to please do something about the incessant political posts on this sub. We have been called \"a less funny version of r/politicalhumor\", which is pretty damn insulting. \n\nHowever, when we tried to have a temporary ban on all political content, the subreddit suffered - Less posts were submitted, which led to less comments and less interaction. We need to remember that the final purpose of this sub is to entertain our subscribers, visitors and lurkers, provide you the content you are looking for. \n\nFast forward to today - It's 2 months before the US Presidential, Congressional and Senatorial Elections, the political posts are getting worse than ever, and with them the requests to do something about it. To that end, the moderation team has discussed this, and beginning from Sept 3, we will be imposing a temporary ban on all things related to the US Elections until after Elections Day (Nov 3). \n\nWhat does this mean? Posts meeting any of these criteria will be removed immediately, and the user will receive a temporary ban:\n\n* If any of the people in the post is in public office, is running for public office, or holds a position in the current administration or the campaign staff \n* If the subject of the post is in public office or running for public office, or holds a position in the current administration or the campaign staff\n* If any of the people in the post or the subject of the post is anyhow related to the Trump or Biden family or to someone who holds a position in the current administration or the campaign staff\n\nExamples of posts which are now prohibited include:\n\n* Orange Man Bad\n* Jeff Tiedrich (who really needs to get a fucking life)\n* Alexandria Ocasio-Cortez tweets\n* Lincoln Project\n* The Conway family\n*  Hunter Biden posts\n\nPlease note that this is **NOT YET** a full ban on all political subjects or a full ban on all political content going beyond the elections. We will be keeping very close attention during the upcoming two months to see how the subreddit and our members react to this ban. If we see that it is successful, we may choose to extend it. We also would appreciate your comments on this post to let us know your thoughts on the subject.",
        "num_comments": 1245,
        "comments": [
            "The entire premise of Murdered By Words is a stinging counterpoint by one individual to an ignorant, egotistical, self-righteous, and/or hypocritical statement made by another individual.   \n\n\nA quick scan of this sub demonstrates that an outsized number of ignorant , egotistical, self-righteous, and/or hypocritical statements come from the right side of the aisle, and the counterpoint \"murders\" come from the left. Trump, his cronies, and his progeny open themselves up to rhetorical homicide on a daily basis. If the right wing followers of this sub don't like how often somebody accurately calls this administration (and related syndicate) on their nonsense, they are more than welcome to downvote, hide the post, make a counter-counterpoint, block the redditor who shared the murder in question, and/or locate an example of a linguistic assassination that goes in the other direction. (If they can find one that doesn't contain hate speech.) They can even unfollow the sub. There are already processes by which they can see fewer \"political\" posts.  \n\n\nInstead, they chose to go the \"snow crystal\" route and complain to you that \"There's too much politics!\" There isn't too much politics. There's too much politics that doesn't fit their worldview for which they can offer no obverse. So they want you to unbalance things for them, and you are obliging them. And in obliging them, you are opening yourself to be further constrained by them. Once Trump and the rest of his swamp are off the table, they're going to complain to you that too many people are going after Charlie Kirk or people making \"All Lives Matter\" tweets. Soon they'll be asking you to ban posts that burn ignorant statements from law enforcement. They will dictate to you the content of this sub rather than the other way around. You said you've been deluged by complaints. Can you quantify that? A thousand complaints? Ten thousand? One hundred thousand? There are **two million members** of this sub. How many \"squeaky wheels\" are making you steer this sub away from a course that I would hazard to guess a vast majority of the members are and have been perfectly content with?   \n\n\nIf being called \"a less funny version of [r/politicalhumor](https://www.reddit.com/r/politicalhumor/)\" is enough to get under your skin, maybe you aren't cut out to moderate a sub that specializes in well-crafted insults. But I would think you'd prefer being called \"a less funny version of [r/politicalhumor](https://www.reddit.com/r/politicalhumor/)\" to \"a castrated version of r/MurderedByWords.\"  \n\n\nThose are my \"thoughts on the subject,\" as requested.",
            "[deleted]",
            "Eh, Americans aren't murdered by words anyway. They are murdered by police.",
            "The only whole “less funny version or r/politicalhumor” is pretty brutal, and you might say that r/murderedbywords got murdered by words, a meta-murder. Those are rare.",
            "I think this is a poorly thought out decision. \n\nI'm not saying this is the case here but Often it feels like mods pushing their agenda onto the users and I've see a lot of subreddits try to ban content like memes or politics only for the user participation to just fall off a cliff. banning one form of content doesn't mean there is good content that will take its place. \n\nThe political content you mentioned that gets posted here receives a lot of traffic. Often the most upvoted posts are political in nature. Just banning the content because some users are complaining is one sided and doesn't acknowledge all the users still voting for this content.",
            "Why ban AOC tweets...? She always gets the point",
            "EU memes incoming !",
            "Would be nice if a certain moderator would stop posting irrelevant images to this sub, thereby directly contributing to the sub's problems.",
            "Does this include things based around political topics as well? Like civil rights, mail, guns, abortion, etc?",
            "can we get a temp ban on your posts?",
            "The political posts are the primary reason I'm here.  By responding to the people who are the loudest, you're doing the same thing that's currently wrong with how politics works in the United States.",
            ">  What does this mean? Posts meeting any of these criteria will be removed immediately, and the user will receive a temporary ban:\n\n> If any of the people in the post is in public office, is running for public office, or holds a position in the current administration or the campaign staff \n\n> If the subject of the post is in public office or running for public office, or holds a position in the current administration or the campaign staff\n\n> If any of the people in the post or the subject of the post is anyhow related to the Trump family or to someone who holds a position in the current administration or the campaign staff\n\n> Examples of posts which are now prohibited include:\n\n>* Orange Man Bad\n>* Jeff Tiedrich (who really needs to get a fucking life)\n>* Alexandria Ocasio-Cortez tweets\n>* Lincoln Project\n>* The Conway family\n\n\nWait, what? Do you really mean this to read the way it does? Because it *sounds* like you're banning any and all criticism of Trump, his family and the GOP, and banning any comment at all from AOC and selected others.\n\nIn other words it sounds extremely dodgy. \n\nI acknowledge that the overall rule covers Biden etc too (\"running for office\") but every one of your examples reads like an attempt to protect the right and repress any criticism of them.",
            "As usual....  Reddit moderators are the weakest snowflakes",
            "so basically there'll be 0 content until early november.",
            "Question.  Jeff T., and George Conway don't fit the three bullet point criteria.  Are there any other random people that are arbitrarily (i/e being included outside the listed criteria) that we should know about?",
            "I was wondering why have not seen any good murder on the main, drop in this sub and saw this pin.",
            "Looks like rightwingers succeeded in working the ref with their incessant whining",
            "It's kind of an interesting rationale to ban a wide swath of content based on complaints, mainly because it seems like you don't mention a sense of how much of the community actually *does* like that content. Are you at all worried that you might be capitulating to a vocal minority? Is there a way to measure that? (I guess beyond the fact that the content gets net upvotes?)\n\nIf the rationale was simply: \"we don't think it fits our vision for the sub\", that's fine, you're the mods and you can choose the scope of the subreddit. But doing it based on complaint count alone seems like an unsound methodology.",
            "Well, there goes the neighborhood.",
            "How are you going to decide what is political and what isn’t?",
            "Boooo",
            "I understand the reason for such a prohibition, however the example you stickied as the og murder, and example for the shape of this sub, is a political one.",
            "Strange how the only examples are anti-Trump.  Hmm.. it is almost.. just aaaaalmost like this is being done in a partisan way.",
            "Oh the censorship thing we all agree is not a good idea. Yeah let's do that.\n\nA murder by words is a murder by words. I don't see why it matters if it comes from a 2 year old or a grown politician.",
            "Can I make a post about an anti-masker? They mention politics, but it is about masks?",
            "Wait I cant help but notice all the examples are left wing examples. AoC tweets are banned, Tiedrich is banned, and ragging on Trump is banned but his tweets are fine?\n\n\nWeird as hell. Guess \"no politics\" actually means \"no threats to MY politics\".",
            "So any plans on enforcing this or...",
            "Who’s the snowflakes now",
            "Orange man bad",
            "Thank you, I don't give a shit about people's idiotic opinions. Not everything has to be \"Drumpf bad\", or \"BiDeN's A sOcIaLiSt!\".",
            "Why isn't an example the pathetic attempts at humor Trump supporters attempt to make? Seems like just banning the low hanging fruit. It's not our fault that Trump and his followers have the cumulative IQ of a microwaved grapefruit.",
            "Wow. This pretty much supports COVID deniers and Trump supporters. Way to take a side. Pathetic.\n\nEdit: Suggestion: instead of banning certain topics, how about we use flairs. People can sort by to avoid topics they don’t want to see.",
            ":/",
            "Also probably a good way to minimize the spread of disinformation.",
            "Does this ban, in any way, apply to the BLM movement? It doesn't say anything about BLM but I want to make absolute certain.",
            "Really? The politics stuff was like 99% of the reason I came here. Ah well.",
            "[removed]",
            "Oh lol, this is a Trumpist sub now, huh?",
            "Oh, cencorship? Unjoin.",
            ">[doesn’t] suffer from lack of quality\n\nHaha okay sure Jan\n\nAlso, “you spoke and we listened”? You might wanna go see a therapist, because you’re hearing voices.",
            "Haha sounds like Trump fans were tired of confronting their own ignorance.",
            "Well let me know when you go back to being interesting I guess? :/",
            "I wish the ban was on all politics, not just specifically American politics. Why did you single out just one country? \nAlso your replies in this thread seem really immature and bratty. You didn't handle this issue well at all.",
            "Poster isn't a mod.  No fucking wonder this is so obviously partisan.",
            "Can you get banned on any of the conways or just skeletor and jabba?",
            "Oh.  I see.  I was wondering why nothing popped up from this Subreddit about Trump catching COVID.  Apparently it's because you hobbled yourselves hoping to get better content.  It doesn't seem to be working.",
            "Oh no what would the political boner peeps will do now?!",
            "Didn't know this subreddit had a political posting problem. I'm only here because of a political post. I'm surprised and kinda appalled to see it here. My reddit app allows me to block subs, and I would hate to have to do that here. I try to limit my exposure to certain topics.",
            "Every other post is political on this sub right now. Maybe start banning the posters.",
            "This ban isn’t being enforced is it? Everything I see here nowadays is just politics",
            "It's 12 sep 23, and I just wanted to pop in here to note that every single thread on page 1 is about US politics.",
            "Is it banned because it shows the dear leader in a poor light?",
            "Finally. \n\nBut what I find worse is lack of proper \"murder\" content. Although there are sometimes good comebacks, lot of the posts are just witty comebacks that four year old can write. Hell, some are even not a comeback at all, just [some personal interpretation](https://www.reddit.com/r/MurderedByWords/comments/iki45f/really_weird_isnt_it/). Why is it here?\n\nI want proper clapbacks, not \"Orange Man Bad\" and similar lame posts for milionth time. Go to r/wittycomebacks or something.",
            "here's an idea, don't click on posts that are clearly political in nature, that might help",
            "I'm ok with this but it's very obvious the mod who posted the message is biased",
            "[deleted]",
            "Thank god, as a non-American I am sick to death of every sub just becoming about spamming one sided US politics posts.",
            "Finally. I was fucking tired of seeing orange man bad posts on this sub. We get it, we all hate trump, but they got a little tiring tbh. Good move by y'all!",
            "I noticed the quality of this sub went downhill a while ago. It's just another example of how politics has now managed to pervade every aspect of our lives and it's pretty much all anyone can talk about ever. Pretty annoying really",
            "Mods have an agenda. Look at their examples",
            "Lovely boot licking mods.... Everything is political, get over it",
            "Easy unsubscribe. This sub was only great once in a blue moon anyways and the political shit was why I was here. Hope it works out for ya!",
            "I notice all the banned content is middle of the road so your post seems to encourage right wing propaganda",
            "> You have spoken, and we have listened.\n\nDid \"we\" though? It seems what you actually did was caved to a few whiners given that there weren't any actual polls released to gauge a more generalized sub opinion.\n\n> However, when we tried to have a temporary ban on all political content, the subreddit suffered - Less posts were submitted, which led to less comments and less interaction.\n\nTwo months later and its pretty obvious the sub has suffered massively. \n\nI recommend you do not repeat this mistake again.",
            "> EDIT: We've noticed that this sub does not suffer from lack of quality content without the political posts\n\nFucking lol. A couple of posts a day that make it through the filter and half of those are political in natural.",
            "it's after nov 3 but the political situation is still insane, are we allowed to post things related to politics yet?",
            "Finally. Thank you so much. It was really tiring.",
            "I'm beginning to feel like a lot of these posts are repetitive. There should be some sort of uniqueness to each roast that comes through, not just the same facts, repeated over and over again. After a while, it just isn't the same \"murder\" as the 1st of its kind was",
            "The goal of this subreddit is trying to please its users? \nHow about you keep content quality and relevant. Or change your subreddit to: r/WhateverOurUsersWantToPost\nThis subreddit is not even entertaining anymore. \nIt is disgustingly political.\nBye Felicia.",
            "Goddammit. Nate Silver just had the best burn on Twitter, I’m so mad we can’t post it.",
            "Isn’t this subreddit dedicated to slamming people online?",
            "Lmao what a shitty mod",
            "Cringe",
            "Political stuff is literally the best murderedByWords content, do these people messaging you to remove it even have an argument for why it's bad?",
            "Obv your not doing a very good job at enforcing this rule tho smh was gonna join but not now bc I'd rather not see politics 24/7",
            "I couldn’t care less what the topic is - I just appreciate when words are used for murder.",
            "Alternate idea... grow some fucking skin. Welcome to Reddit. we are off the cuff. Deal with it. Banning content might make you feel important, but in reality it just makes you a bitch.",
            "Ok...but everything is political. And spiritual. [Gasp!]",
            "What about those poor bastards in Texas?",
            "So the last four years of bullshit was fine but you draw the line when the left wins the election, you're full of shit. These moderators just explained how their ignorant bias was forced on them and they caved completely in the opposite direction instead of applying moderation. Now this sub is officially dead since lets be real its a US app. If you ban US users from posting them change the title to \"Outside of US Murderered by words\". You just banned most people from interacting because you can't do your jobs and clearly have a bias against the left because they won.",
            "This sub is trash",
            "I swear, every post here has to be political for some reason.",
            "Yeah pretty insulting considering r/politicalhumor is already not funny",
            "Boooooo",
            "Temporary you say",
            "fair enough. \n\ni won't argue against the purpose.......but may i suggest removing the word \"temporary\"?",
            "I'm still seeing politics lmfao, but I love the initiative to distance this sub from politics.",
            "Oh thank hod their taking actions to stop this. I ho to reddit for funni image and laugh. Not to constantly see politically-charged posts",
            "Please ban it again.",
            "Literally every post on this sub is just politica",
            "r/agedlikemilk",
            "The whole sub is filled only with what U.S politician replied to another. NNo quality contents for months.",
            "You say the ban is extended indefinitely and yet all I see are post relating to U.S. politics - gets a bit boring after 5 mins",
            "Two years later and this is still a dumbass decision. Reddit MODs are the fucking worsttttt",
            "Heh, temporary",
            "So when is this going to be reinstated ffs.",
            "Yea this sub has become unreasonably biased. I can’t see a post on here without it being a bash against some right wing talking head. \n\nBan politics altogether or not at all.",
            "The funny this is if you check a lot of a recent posts they’re crossovers from r/politicalcomebacks",
            "“Temporary” going on two year ban.  I see the edit…why not just change the title?",
            "What the heck happened? Did y’all stop enforcing the ban?",
            "*Reads top posts* Well that was a lie.\n\n\nThe majority of the posts here are politically charged and or include political figures.",
            "Temporary? So was income tax!",
            "Censorship is pathetic.",
            "Welp subs dead again until November.",
            "Lame. Super lame. The only thing that should matter is if there has been a murder by words.\n\nIn reality you can't ban politics. This sub will continue to be full of political posts that are just not explicit enough to pass your test. You're just feeding the trolls and decreasing the genuine content. Super duper lame.",
            "Thank you for all that you do. This is chill.",
            "Pssh, censorship and taking the side of the oppressor I see. Fuck you incels.",
            "Finally...\n\nYo what all the comments in support of the ban are being downvoted",
            "Excellent.",
            "People are really mad about this. I dont expect anything less from redditors to go for the low hanging fruit.",
            "Thank you!!!",
            "Thank you I’m fucking sick of looking for a good laugh and just seeing shit about politics",
            "Heil Reddit!",
            "Great decision.",
            "Oh thank god. It may not completely fix the issue of low quality posts but hopefully it helps. No matter how much of a dingus Trump is, all the \"orange man bad\" posts gets really tiring after the 4,786th time.",
            "Very happy with this decision. Some of the murders were getting so lame because of this. Your political beliefs aren't the same as mine.......... Boom......... You just got burned.......\n\nGreat job mods",
            "I think you should extend the temporary ban even after the election day,  for like 2 - 3 months. The aftermath of the election will flood this sub with maybe even more US-related \"Murdered by words\"",
            "Should actually keep it neutral just so we don't turn into another political page which isn't what is best for it. It's a good subreddit we shouldn't dive down to that level",
            "thank you lord jesus christ or whoever is responsible for this",
            "> The entire premise of Murdered By Words is a stinging counterpoint by one individual to an ignorant, egotistical, self-righteous, and/or hypocritical statement made by another individual. \n\nNo, it's not. This sub original premise is [*lengthy and detailed* rebuttals](https://old.reddit.com/r/MurderedByWords/comments/bazdpy/this_is_the_comment_that_inspired_this_sub_this/) which essentially \"murder\" the opponent's argument, regardless how ignorant or whatever the original point was. An intellectual verbal K.O, so to say. Not low-hanging Twitter burns and bickering. Politics high-jacked this sub and turned it into orange man bad circlejerk, and now you are complaining that mods are trying to rein the sub back to its origin?\n\nYour \"going after\" attitude is the prime example of what's wrong with the sub and why politics ban was needed. You value pushing your agenda against the evil orange man above all else, expecting everyone to provide you a platform for it for the greater good or something.\n\nMake no mistake, Trump is an incompetent idiot at best, he sucks. But so does the constant whining about him, especially in unrelated subs and especially for non-americans. You remember there's a world outside of America, right? And as soon someone points it out, you deflect to \"well it just doesn't fit your worldview\". No, Trump being an idiot fits my worldview perfectly. But not in every damn sub 24/7. \n\nYes, there's too much politics, and no, it has nothing to do with it fitting anyone's worldview. Let's take a look at some of the top posts. [This](https://www.reddit.com/r/MurderedByWords/comments/iullqa/science_denier_carefully_and_methodically/) is a perfect example of a murder. That's what the sub is about. You know what it wasn't meant to be about, until you lot came along and high-jacked it? [This](https://www.reddit.com/r/MurderedByWords/comments/hj3y39/im_gonna_take_the_surgeons_side_on_this_one/) kind of shit. It's not a murder. It's barely even a good comeback, just a low effort \"no you\". [This](https://www.reddit.com/r/MurderedByWords/comments/ecr60f/murdered_with_one_word_almost_3_years_later/) is not a murder. Funny, but not a murder. [This](https://www.reddit.com/r/MurderedByWords/comments/i05m7a/thats_just_how_it_is_though_isnt_it/), [this](https://www.reddit.com/r/MurderedByWords/comments/hiu76i/very_strange_indeed/), [this](https://www.reddit.com/r/MurderedByWords/comments/dgzfqt/now_sit_your_ass_down_stefan/), [this](https://www.reddit.com/r/MurderedByWords/comments/hh15ne/now_that_is_bravery/) and [this](https://www.reddit.com/r/MurderedByWords/comments/hpx6yv/millennials_are_destroying_the_eating_industry/) aren't murders either. \n\nMind you, the issue isn't limited to politics. As obvious from examples, there's lots of shitty non-murder non-political posts that are upvoted simply because people agree/think they're funny, not because they fit the sub. But politics sure drove nail in the coffin of this sub's quality spearheading the decline. While it'd be preferred if mods just banned Twitter screenshots all-together (since 120 character limit goes against whole point of the sub - detailed and lengthy rebuttals) and short comebacks/burns, banning politics covers a big chunk of problematic content and helps getting rid of users who value political agenda above all else. \n\n\n> They can even unfollow the sub.\n\nMaybe you should follow your own advice and find a proper forum to drive your political agenda. Many are here just for laughs and couldn't care less about Trump and his incompetence, different subs exist for a reason, you know.\n\n---\n\nEdit: I love how some replies accuse me of being a Trump supporter and other things just because I don't think political slapfights fit the sub. You're just further proving my point.\n\n---\n\nEdit 2: The original comment above got so mad that they blocked me, which means I can't reply to any comments below either thanks to the Reddit's stupid system.",
            "That isn't even the case with this sub though. A lot of the time, no one has been \"murdered by words\" it is just a post to bash republicans and get up votes from idiots like you. This sub is just a big leftist circle jerk.. I haven't got anything against someone left leaning, it is people like you who really rub me the wrong way. Murdered by words should NOT be political in any way, shape or form.. \nI'm not going to waste my time having a conversation with you about politics, you are obviously too far gone and are beyond the point of reasoning with due to being consumed by ignorance and stupidity, but I will say with absolute certainty that you are wrong.. This sub had potential and would have been much better with no politics in the first place",
            "This was a masterpiece, thank you!",
            "[removed]",
            "Thanks for letting us know, and thanks for the detailed reply. \n\nObjection to political posts came from both sides of the aisle, from people who were upset the sub had \"strayed\" from its original purpose. \n\nAfter review, we agreed",
            "You start with a completely false premise. \n\n>A quick scan of this sub demonstrates that an outsized number of  ignorant , egotistical, self-righteous, and/or hypocritical statements  come from the right side of the aisle\n\nThis is blatantly false, and evidence that you yourself live in an echo chamber.   \nThe rest of your argument is therefore invalid.",
            "Maybe some of us just don't like politics. Maybe some of us are tired of hearing about whatever inane, dumbass idea Trump has had in the last week, and in fact, are tired of hearing about him at all. Maybe some of us actually want humor instead of political commentary. \n\nYou think that it's only Trump supporters who are for this new rule? I absolutely despise him. I hate so much that I cannot go a SINGLE DAY without hearing about his incompetency! That I can't go a SINGLE DAY without hearing about what a fucking idiot he is! I! DON'T! CARE! ANYMORE! \n\nI am so so so happy that he's been voted out because now, hopefully, I will never EVER have to hear the name \"Trump\" ever again.",
            "LMFAO good job shutting the fuck up after you got decimated here.",
            "Now this would qualify as a proper murder.",
            "I voted for Biden and I still totally disagree with you. Totally and completely.\n\nI’m not even disagreeing that Trump’s administration is a total disaster. But most of Reddit (including this sub) has become an equal and opposite source of stupidity. It’s basically a liberal circle jerk.\n\nMost people don’t want to see this crap nonstop.",
            "So much this. The Trump posts are as diverse as anything, don't let Brownshirt snowflakes convince you that \"Orange Man Bad\" is getting old for anyone but them. Maybe they'd see less of that material if he stopped replacing respectable information sources in his administration with quacks, lying literally on a daily basis, or otherwise dropping trou and presenting his flabby boipussi to the libchads.",
            "Lmao who gives a shit",
            "Just now seeing this, but this sir is a Murdered by Words to the sub and it's mods. \n\nAight guys ya know what? If you want Trump less picked on, maybe don't back Trump so you can detatch yourself from the words ushered in through murder-by-words. I WILL concede it IS low-hanging fruit. If you want to STOP seeing him be so picked on....\n\nMaybe don't back a guy who is low-hanging fruit for this, to then become president, for you to then get upset when people make fun of him. Being that the making-fun-of-him part is so easy, supporting such a person then makes you part of the joke. \n\nI mean I get it in that it's constant that he gets mocked, made fun of and murdered-by-words alongside his supporters.\n\nSo...don't support the guy, assist in the forgetting of that low-hanging-fruit and people will stop being so enamored with the murdering-from-words that is going on, since his previous audience (at that point, assuming people wanna let him go finally) will have moved on. \n\nSince he won't be President anymore, if you combine the above with him also not being President....I believe the desire to murder-by-words will decrease since it will just be useless and actually harmless rambling where people already forgot and stopped caring.\n\nHe won't stop being insane, crazy, stupid and susceptible to SUCH easy murdering-by-words, but making fun of him will be passe. Old news and not topical anymore.\n\nOnly you can help prevent forest fires.",
            "Murdered the subs decision with words. Unsubbed.",
            "Idiot.",
            ">\ta sub that specializes in well-crafted insults\n\nWhich sub are you talking about? It can’t possibly be this one.",
            "People like you ruined this sub, fuck off. Go to /r/politicalhumour",
            "You forget a key point: most of the world isn’t American, and it’s extremely annoying seeing these one liner ‘zingers’ to random dumbass conservatives in the middle of the east midlands",
            "Owange man bad",
            "I came with thinking perhaps the ban is right but you managed to change my mind with this post.",
            "The institution of fascist \"press laws\" would make the mods job easier. I guess that's why this sites mods are censoring in favor of trump",
            "Your entire fucking answer is horseshit",
            "Happy cake day :)",
            "I agree but im at political overload atm.",
            "Imagine thinking your side is the best side lol. They’re both shit, and I’ve seen both sides be murdered by words.",
            "Maybe you should read the actual post they made? And what requirements need to be met for it to be removed? I doubt either of those people from 1945 hold “current positions”.",
            "Or the hospital bill",
            "Here, have my poor student's gold: 🏅",
            "Or the out of control Pandemic Virus that nobody seems to take seriously.",
            "Or their classmates",
            "This would be a good post for this one sub I know. It's called murdered by words.",
            "I wish  I had some spare cash to give u some useless internet awards",
            "And in school",
            "whoa...this..this hit me (much like the police)",
            "As always the _real_ murder is in the comments!",
            "i will be sad if this comment doesn’t blow up. it’s golden",
            "/r/murderedbywords",
            "You mean coronavirus\n/s.",
            "Uff.",
            "Not all Americans.  Some just get a taser.",
            "OOF",
            "And COVID-19.",
            "And floods",
            "Shhhhhh mods will ban you",
            "We’ve turned newspapers into effective weapons, I think we have lol",
            "The fact that r/politicalhumor has no humor makes the insult 10x worse.",
            "100% agreed - haven’t seen a good post on here since this happened. This is relevant content to this sub. It just so happens politics is extremely relevant and the best murders are typically within the political landscape.",
            "Oh, the Trump-loving mods thought it out very well.",
            "Offends Trump supporters.",
            "Because the right is filled with snowflakes and it was always projection",
            "Because she's a politician.",
            "She has her own subreddit, /r/MurderedByAOC/",
            "like all other capitalists the only point she gets is the spear of the glorious proletariat",
            "Didn’t she get caught lying about the siege on the Capitol? Her story doesn’t match the timeline, and her colleagues even said she wasn’t in the building. The building she was in was being escorted out due to a bomb threat. There’s videos from her building where everyone is calmly/patiently walking out. So she doesn’t always get the point. No politician does. Just whatever fills their pockets.",
            "New Zealand is having an election this year too! It’s one of the most popular prime ministers in modern times, who the majority literally consider to have saved them from COVID, vs an actual nightmare of a human being and a party of utter incompetence. Maybe we can do NZ memes.",
            "Please, shower me with them. Anything to end the monotony of “Hehe Cheeto”.",
            "Not at the moment, unless it addresses or includes anyone who matches the criteria above. \n\nThis is of course subject to change",
            "Then go to a different sub",
            "I mean when have you ever seen an anti Biden post hit the top of this subreddit. It’s not to protect just Trump it’s just that Trump posts are the reasoning for this rule in the first place. Not to protect him but because the subreddit is nothing but posts about him and that’s not what he sub is made for",
            "Agreed, Unsubbing.... at least temporarily",
            "We're banning any and all content related to the elections. It's a given fact that Trump is an uneducated buffoon who has caused the deaths of hundreds of thousands of US citizens by his mishandling of the COVID crisis (you can quote me on that). You can get anti-Trump content on nearly every single corner of this website, we've decided to provide a bit of a break from that here",
            "Enough trump spam",
            "90% of this sub is political shit, it's really annoying to just see 99999 posts with trump in a row",
            "Dude , there’s other subs for political bullshit, they’re just putting a stop to it TEMPORARILY.",
            "OK, Zoomer",
            "Can’t we get some good Trudeau memes going? He’s not corrupt right? He’s just such a nice guy with boyish charm. The Trudeaus are the Kennedys of Canada.",
            "I’m guessing Jeffrey Epstein is off limits",
            "Jeff and George's posts are nearly almost always responses to Trump, which matches the first criteria. \n\nWhen not direct responses, they are indirectly criticizing him and his administration's actions, which matches the second criteria",
            "We see every single post and read most of the comments on the popular posts. Objection to political posts come from both sides of the metaphorical aisle",
            "Have you even read the post?",
            "The criteria are pretty clear, verifiable, and testable.",
            "Can we help it that he's such an easy target, and most political posts are against him and the Republicans at the moment? \n\nMaybe the tables will turn if Biden is elected in November, maybe the GOP will still be full of science-denying idiots. Which do you think?",
            "Animemes all over again",
            "I guess it is the most recurrent (with good reason too) but they said in a comment that all anti-Joe Biden will also be banned. So anything related to the election in short.",
            "The moderation team have determined that we'd like to give other content the chance to rise to the top. \n\nThis is not a partisan matter, especially considering our worldwide mod team, including myself, who is not American and does not live in the US.\n\nFinally, no one is blocking you from saying whatever you like on any of the numerous parts of Reddit where political content is welcome. It's just not welcome here anymore (for the near future)",
            "Snowflakes have to protect their old orange sack of shit.",
            "Wait... I can't help but notice that there are no posts about any non republicans or non conservatives anywhere at all ever... Ever..   \nThe irony of your comment is so incredible, I might die from a heart attack from laughing at your stupid ass.",
            "I don't think so they just want the political posts to be on their side..",
            "Only good thing he has is vitamin c",
            "You and I are probably gonna have fun together at ban-camp.",
            "Hey now, outrage fatigue is a very real pain. Besides, theres still /r/quityourbullshit.",
            "Half the political shit in the sub was unfunny. I don’t like trump either but we dont need some random unfunny tweet that gets upvoted because its a liberal flaming a conservative. \n\nAlthough, I don’t really like the AOC tweet ban because she has some nice insults.",
            "I’m as pro-mask and anti-trump as the next guy, but even I’m sick of the 500th “orange man bad” posts. There’s still other subreddits like r/quityourbullshit and r/vaxxhappened, no need to get your panties up in a bunch over this.",
            "MTE Imagine thinking snowflakes saying your sub is less funny than political humor is an insult when the joke is on the people who say that in the first place.",
            "Please note that COVID is not a banned topic. As a matter of fact, we encourage educated, well-rounded criticisms of people who believe COVID is a hoax.",
            "Banning all political content is anti-every politician. The rest of the world doesn't care about you Americans and your dumb fucking politics. Strop spreading it like cancer.",
            ":)",
            "Hehe adding a woman's name instantly makes something funny to me\n\nTHIS ISN'T HOW MODERATING A SUB WORKS, SUSAN, IT JUST ISN'T! (in my best John Oliver voice, he does that all the time and it gets me every time, instant punchline)",
            "If you post some quality content we can get back to being interesting a lot quicker...",
            "Thanks for your input",
            "I imagine it's because American politics are more of a shitfest than others currently, and because American politics have torn apart several subreddits already.",
            "Poster is literally a mod. Please learn to read.",
            "No, it's banned because we're sick and tired of seeing (and removing) the same \"orange man bad\" and \"Sick AOC burn\" posts over and over and over and over again. \n\nThere are enough other political subs where you can get the same type of content, we're acquiescing to our users who have requested a break from the incessant insanity that is the US Elections and the US in general",
            "Please, feel free to upload your own content. I wish you nothing but upvotes and platinum gilding",
            "Careful there, you might trigger the Americans just by saying you don't care for their politics.",
            "I wasn't really tired of seeing all the butt hurt orange fan sad comments though..",
            "Exactly. We're all violently aware of everything that's going on and it just gets really old.",
            "Politics has always been a part of life. There is nothing that doesn't impact politics. This is just head in the sand nonsense.",
            "My particular agenda is karma whoring",
            "Not American, don't live in the US. Neither does about 60% of the mod team, if not more. I'm not sure whose boot we're meant to be licking?",
            "You are the prime example of what's wrong with the sub.",
            "Bye, Felicia!",
            "You realize that this isn't an airplane, right? You don't have to announce your departure.",
            "Why, thank you!",
            "Muh freeze peach",
            "Thank YOU!",
            "OK, Zoomer",
            "That's fucking hilarious. Lets talk about censorship for a second. Conservatives get banned and so do their subs literally all the time. And you all cheer.   \nDo you understand the definition of hypocrisy?",
            "Literally they said a ban on all U.S. politics, not just one side. Stop reading into things. You can post on another submit you have push the division that politicians and the media have set among us by perpetrating an \"us vs them\" mentality that really isn't necessary.",
            "I think its because all in favor of the ban just upvoted and moved on while the political people went into the comments",
            "If we’re lucky it won’t be “murdered by militias in the Second Civil War.”",
            "now this is a murder",
            "Dude, this comment fucked the original comment up!",
            "[removed]",
            "I'm a lurker and really late to providing any kind of feedback to this, but I wanted to say that I definitely appreciate this ban and your great proof as to why it's needed. I'm so, so burnt out of politics right now that I want people to just talk again, not get riled up in self perpetuating echo chambers. I appreciate this sub for the wit and logic the posts typically have. So really, I wanted to say, great post, great ban, much appreciated!",
            "What an absolute shit take. No one says “orange man bad” except Trump supporters using it unironically. Just another pissed off supporter that doesn’t like seeing Trump supporters getting murdered with their awful posts and “logic”.",
            "Twitter murders CAN be murders, they're just laconic murders.",
            "Thank you. I left this sub because of the political bullshit, and I've come back to find a fair amount of people just defaulting to \"boomer bad hur hur hur\" but at least there's no more \"hahahahahahahaahahha tiny hands?!?!?!?\"",
            "Bravo 👏👏",
            "I agree. It’s basically been a bleeding heart liberal circle jerk and anyone with other opinions doesn’t find humorous. The idea that “orange man bad” is just shit-posting at this point.",
            "So much respect to you for laying it out so clearly. And of course, it’s not going to change anyone’s mind. Anyway, thanks for this.",
            "You understand that politics are talked about everywhere by everyone because that's the only way humans let progress happen, and banning it anywhere slows that down?",
            "[deleted]",
            "Yes, this.  Trump sucks, but so does the constant whining about him.  100% agree.",
            "This guy's totally right I just looked through this sub for the first time and even though the no politics rule is in place there's nothing but politics, and all the posts are lame af",
            "I found it. After all these years... the most based comment on Reddit!",
            "I’ve been on this sub for months now and have yet to see consistent ACTUAL murders better than this comment",
            "Thank you for this.  You don't have to be a trump supporter to see that the political murders in here are often ad hominem arguments or appeal to sympathy. They're not murders they're more just feeding one groups needs for constant confirmation bias... \"Don't worry it'll all be ok. Everything you believe in is right. You're a good person. The world's problems would all be solved if everyone just followed your narrowly defined values and beliefs\".",
            "Bruh, the first guy's comment was like the exact definition of this sub, then you just want to whine that he doesn't know what he's talking about, when clearly he does.",
            "I agree with you 100%. This sub, as well as many others have been high jacked by politics. Even me as a right leaning individual wouldn’t want to see politics that I agree with on this sub or others. We’re here to have a good time and escape the reality that awaits us outside. I’ve considered leaving Reddit all together because of so many political posts I see now. I tell this to my friends and people I know, there is a time and place for politics.",
            "Do you see r/MurderedByWords? This is who you are letting run your sub now? Victim mentality. Petty insults. Unfounded assertions. Fear of political discourse. \"I'm not going to waste my time blah blah blah.\" Of course they're not. Their political \"opinions\" are so paper-thin that they insult anyone with a different opinion of being not worth the trouble, because they know they will get shredded by facts. They love to call people snowflakes, but if you dare to point out the documented fact that Trump lies through his teeth they lose their shit and cry \"no fair!\" I'm so glad to be done with this sub. And thank you, /u/ProfessorSexyBoi, for illustrating my point so completely.",
            "Maybe if Republicans wouldn't say so much stupid and easily countered shit, you wouldn't see rebuttals to them as often on this sub. \n\nInstead you're being a massive snowflake crying to mods about how mean lefties are to you.\n\nI have a feeling that if this sub was shitting on lefties all the time, you wouln't have a problem with it being political whatsoever.",
            "We should post it to /r/MurderedByWords!",
            "Read the first reply if you want to see what a true masterpiece is.",
            "I don't believe that the objections came from both sides of the aisle. I think that a lot of conservatives managed to convince you that they were \"life-long Democrats, but\" or \"no fan of Trump, but\" which has become a fairly transparent tactic on social media. I ask again, can you quantify the number of \"complaints\" you received? Was it 1% of the sub membership? 10%? 20%? As to having \"strayed from its original purpose,\" can you explain how political discourse does not fall under your heading of:\n\n\"A place for well-constructed put-downs, comebacks, and counter-arguments.\"\n\n????\n\nAs someone else has pointed out here, you made this decision unilaterally based only on those who have complained. You have not sought input from the other side. There has been no survey made available to the community at large to weigh in. I believe that you are kowtowing to a vocal but fractionally small contingent of this community, and I challenge you to prove otherwise.",
            "Pathetic.",
            "Prove that it was both sides then because you spent nearly the entire arguement protecting and defending right wing politics. We can all see right through your crap.",
            "Sorry for the late reply but holy shit, seriously. I'm so tired of hearing his fucking name. It's been like five or six years of having to hear this dude's name on a daily basis. I have had to hear this fucking guy's name being mentioned every day for over half a decade. Enough is enough. I'm with you, man.",
            "Nah the first reply to him is a murder. And the comment was 100% accurate on all claims",
            "Head back to r/politics, and please, don't come back.",
            "Yes, we know what you are. You don't have to keep introducing yourself, though, admittedly, it does let us know who you voted for.",
            "Well, not anymore. (I assume. I haven't followed this sub in 3 months -- not since their cowardly ban politics.)",
            "A little late to the party, aren't you?",
            "[deleted]",
            "Or Student Debt",
            "Ooof. Yeah, we do have some fucking ridiculous medical bills.",
            "Thanks kind human",
            "COVID is orders of magnitude more dangerous than the cops",
            "I know they don't take it seriously what the hell's the deal maybe they need to go in the hospital instead of some of these good people then end up catching it from people like them",
            "Or an angry white dude with a gun.",
            "[deleted]",
            "Blow up? Poor choice of words for Americans to read when we're so close to 9/11",
            "No we won't. Not for that, anyway",
            "Newspapers, not JUST a weapon against your dog!",
            "[Millwall brick](https://en.wikipedia.org/wiki/Millwall_brick)",
            "bruh",
            "Nice labelling buddy. Gets you nowhere but backwards.",
            "New Zealand politics vs American. \n\nI will take the land of sheep for 50.",
            "Fair enough. Although I feel like if y’all push into that category that the line will become so grey then no one can post anything. Especially since the rules already include any posts in response to political figures which is where the most posts are. It could turn this subreddit into a slightly more sassy r/antimlm and r/niceguys",
            "So, why were your examples so incredibly partisan?",
            "Which means that you aren't banning politics at all. Just specific angles. You're opening yourself up to even more political posts. This is just foolish and dumb.",
            "I did that already. I didn't even need you to explain it, or give permission.",
            "But Biden and his camp haven’t deserved nearly the amount of vitriol the Trump administration does. It’s not even a fair comparison.",
            "A whole post man you dreamin, find me one bad word about Biden. This should be renamed - /r irony /r audacity",
            "Just a question from a lurker, and I’m know I’m late for the party. If the concern is the drop in quality, then why no enforce stricter standards along those lines, or against rehashed content or posts that too closely resemble others like, two murders on the same subject that don’t differ too much from one another.",
            "Yeah, but I'm not here for anti-Trump stuff necessarily, I'm here for good murders, and excluding this stuff is going to exclude a lot of good murders.\n\nI know there's a lot of terrible ones too, but I feel like a blanket ban is overkill.",
            "> You can get anti-Trump content on nearly every single corner of this website.\n\nThis is an interesting argument. You can get porn almost anywhere, but most people use pornhub... My point being that something's existence elsewhere should not disqualify it here. I don't peruse many subs, and especially not political subs. While this particular decision won't change my current habits, it will diminish my experience here. Frankly, this choice does have the potential to force many people away from here, which seems like a bit of a self fulling prophecy in terms of the longevity of this sub.\n\nWhile I generally agree that quality hasn't been great here, I don't think the reason for that has been what is being posted, but rather what hasn't been taken down. The amount of posts the mods leave up dealing with small dick burns, or your mom jokes, etc were never murders, but seem to have just as much traction here as orange bad man posts. At least those political posts are usually murders, where as the others almost never are.",
            "I find it funny for my part",
            "It’s most certainly not. It feeds our souls, yours included.",
            "We don't have anything close to that here in Oz.",
            "RIP",
            "Being dead, he doesn't say much that would get him murdered.",
            "Ah, I misread the first point.",
            "Hey, guess what? This sounds like a really stupid idea from someone who has an axe to grind.\n\nHow about instead of trying to curate content based on political opinions you work on figuring out how to encourage better MBW content?\n\nThat's what people want. Quality.\n\nRegardless of the fact that there are a lot of people who want to see Trump and his ilk murdered by words because he's an American president trying to turn a country that's supposed to be about freedom and opportunity into an authoritarian state.",
            "Right, my point isn't that there aren't objections -- clearly there are -- it's simply that there's a significant chance you could be weighing them too heavily i.e. \"squeaky wheel\" bias. It's quite possible that there's a larger majority of people who *do* like the political content, but simply upvote it and move on.\n\nBut maybe that higher weighting is intentional? Like, you care more about the opinions of your subscribers who care enough to comment rather than those who just vote?\n\nThe only reason I bring it up is because I think comments on reddit, across the board, are skewed heavily negative toward the content of the post. Reddit culture dictates that if you like a piece of content, you upvote it. Posting a comment like \"I liked this\" or \"lol\" will get you heavily downvoted and people will tell you to just upvote the content. But if you have something negative to say about the content, going to the comments is the reddit cultural norm and is more acceptable. It seems like a definite source of bias to base decisions on comment sentiment by itself.",
            "didn’t he say that he isn’t american and said nothing about liking trump literally there are so many subs like this that went to shit because of us politics in the past 2 years and it’s impossible to go on to reddit without seeing the 2nd American civil war happening",
            "\"ban-camp\" The only fun thing that has been said...",
            "That is true. There’s sooo much stupidity that it hurts, but I feel it’s better to keep calling it out rather than letting it go unchallenged. When we don’t, it festers under the surface and we end up with things like QAnon. largely ignorned, but it has now become mainstream.",
            "Didn’t realize we were in r/funny.  I thought this was murderedbywords. \n\nThanks for correcting me.",
            "These people are a cancer to society and should be called out,not protected. If you don’t like it, don read the post. Maybe this place should  use flairs so you can filter them out.",
            "COVID isn’t, but it’s closely tied to Trump. Denial of COVID and a “murder” by someone can easily tread into political territory. We can see it in r/coronavirus where we have to dance around the fact the one party and a certain somebody spreads disinformation. \n\nI don’t know if you saw my suggestion, but why not use flairs? This way topics aren’t banned and users can filter to view what they want and don’t. You guys even admitted that activity drops when you ban political discussions. This would be a win for everyone including you guys have to remove political based posts.",
            "Including Trump?",
            "They clearly just want to ban any anti-trump content because the little trump babies throw a fit.",
            "UK here. I care.",
            "How about you stop including pictures of twitter users attempting to correct news headlines as “murders?” That and also a majority of the things you post to your own sub which violates rule 1, which for some reason is your own flair.",
            "Funny how the mod acknowledges a lack of quality posts in this sub, tries to “fix” that, yet sets a terrible example in their own posts, then tries to smugly talk down to someone as if it’s their responsibility to manage this sub when it should be the mod’s job to do so. But I guess you‘d much rather set a low standard for the sub for an easy way to farm karma huh?",
            "I would love to take a break from the incessant insanity that is the US in general... except that I live here. If this temporary ban happens, I won’t be visiting this subreddit much in the next 2 months apparently.",
            "Yeah, I agree. Politics has indeed always been a part of life. But it doesn't have to be the only topic of conversation all day everyday",
            "*Looks at your post history and how most of your posts on here don’t even fit the sub*",
            "Haha... How big a loser are you responding to a comment from 22 days ago... You're exactly what's wrong with this sub and country.... Fuck the fucktity fuck off",
            "Thank you and the mood team for this. Even though I'm subbed here I haven't bothered to visit because of US politics spam. Trump is such an easy and boring target we might as well archive every reply to his tweets as murders.",
            "Maybe you should start reading things dude. In times of strife, silence is to take the side of the oppressor. Don't @ me boy.",
            "\"Fatality\"",
            "Yep.  When you have murdered them so thoroughly, that they have no reply except to delete what they said out of shame... it doesn't get any better than that!",
            "Natural born killer",
            "That’s what they were trying for.",
            "What did the original one say? It's now deleted.",
            "ولی در هین داغ شدن بلمد نشدم،  😂😂😂",
            "\"Onge man bad\" is an apt description of the crap that gets posted here, but if that's all you got from my comment then you're beyond help and aren't worth the time, sorry. But thanks for providing examples proving my point. You're so obsessed you can't even fathom that some people simple aren't interested in seeing political bickering on every sub.",
            "You're continuing proving my point with your seething, seeing Trump supporters everywhere like boogeyman even when there's none. Let me know when you manage coming with an argument that makes sense.",
            "Not generally, although I'd be impressed if someone manages to squeeze one into 140 character limit.",
            "You understand what \"time and place\" means? I guess not, due to you so perfectly illustrating the issue with the sub and why the ban was needed.\n\nThis is not a sub for political activism, it's a sub for entertainment, just like I couldn't care less about your political progress when I visit r/partyparrot. Different subs exist for a reason, demanding your politics everywhere is just height of selfishness. Besides, thinking that posting screencaps of twitter burns is any kind of \"progress\" is slacktivism deluxe, do something actually useful.",
            "I know that, but aren't you in a bit wrong place for it? This isn't a sub for activism or change tho, it's a sub for entertaining lengthy word put downs.",
            "Sorry, he objectively does not know what he is talking about, \"stingy counterpoint by one individual to an ignorant, egotistical, self-righteous etc\" are not the premise of the sub. \n\n[This is](https://old.reddit.com/r/MurderedByWords/comments/bazdpy/this_is_the_comment_that_inspired_this_sub_this/), which shitty Twitter bickering I linked in my original comment are clearly not part of, so you are both wrong. If you're still confused, read sticky mod comment on the post too instead of defending whining from people that are offended they can't agenda-post as easily anymore. People aren't here to read \"no you\" one liners crusading against Trump, most are probably aren't even American.",
            "Lol I dont even like Trump lol, so you might want to find something else to use against me (I'm white if that helps).. I appreciate your little monologue, but all I was saying is this sub has been taken over by petty radicalists (yes I went there because a lot of these people genuinely are). So no I wasnt going to waste my time talking about politics and that isn't because my arguement is paper thin, it is because it has nothing to do with my point of this not being a political sub.. Ontop of that, I actually have a life outside reddit so didnt really fancy getting into the rabbit hole of politics.. Especially on a sub which shouldn't even fucking have politics in it.\nTake your stupid generalisations and crawl back into the arsehole of r/politics where you belong you silly cretin",
            "Most people don’t give 2 fucks about Trump. In fact contrary to your belief not all redditors are American. \n\nA lot of people don’t like Trump, but are also annoyed that you obsessive freaks can’t shut the fuck up about him for a week. SOME PEOPLE JUST DON’T CARE. \n\nAlso this is not supposed to be a political sub. A lot of people just come to subs like this for a nice cheap laugh, but you buzzkill fun-sucking fucks like to just spit your “orange-man bad” bullshit and ruin everybody’s vibe. \n\nI think I speak for a good amount of people when I say A LOT OF US DON’T GIVE A FUCK ABOUT TRUMP AND AMERICAN PROBLEMS IN GENERAL, AND DON’T WANT TO HEAR ABOUT IT ANYMORE. \n\nYou can have your weirdly obsessive negative opinions about your president, just go to r/politicalhumour and leave other subs alone.",
            "What point? I'll be the first to admit that Trump is a fucking idiot, but that doesn't mean I should be hearing about him all the damn time on a subreddit completely unrelated to politics. Why is it so hard for you to grasp that no one here gives a fuck about what your political opinion is? We just wanna see people get roasted regardless of where they lean on the political spectrum. \n\nTheir is no fear of political discourse here, we just don't want to fucking hear about that bullshit. And for once, the mods listened.",
            "Looking at your comments, you're a lost cause.",
            "Your assumption is wrong. Thats why I don't follow a single political sub. Reddit is my get away from politics (left and right). Also, snowflake? I don't give a shit what people have to say, but there's a place for it and murdered by words isn't that.\nPeople on the left say some absolutely insane shit so your point is kinda wrong there. Ontop of that, if the posts on here were actually clever, well worded insults or whatever, then I wouldn't mind. Most of the time, the posts aren't even good. They are just bashing republicans for the sake of it which is just stupid. \nThis sub is just a big circle jerk for wet farts like yourself who don't know where and when it is appropriate to talk about politics.",
            "Why lol? No one was murdered by words.. All I see is an entitled, wannabe smart arse making pretty inflammatory statements about people right leaning to get jerked off by other naturally lobotomized users like himself.. Then again, that is all this sub is now anyway",
            "They won’t. They have no intention of being transparent. Kinda like the current administration: make an outrageous obviously false claim and provide zero evidence to support it.",
            "2 months and no mod replied. surprised they didn't lock the post.",
            "Ok, homey. BTW - I'm not American, don't live in the US, and you're resurrecting something that's six months old",
            "\"I know you are but what am I?\"\n\nWhat's the 2nd grade like?",
            "What percentage of the political posts in here would you say were well-crafted, and not just elementary school-level insults?",
            "Oh did you stop following after getting murdered by words in the first reply?\n\n\\> cowardly ban on politics.\n\nLmao yea I guess that's one way of looking at it",
            "I’m not saying I support the rule either, I was just pointing out that your earlier comment was not factual. There are plenty of things like the fact that All Cats Are Beautiful is auto botted when anyone says you know what. Or the fact that anyone with a connection to the Trump family is off limit. It’s clearly a partisan rule implementation, but by peddling false arguments like “the pinned post of the subreddit would be removed by these rules” you ruin your own credibility. The only way to convince someone, like the large percentage of the population that doesn’t vote, or maybe someone who’s still undecided is to not make disingenuous arguments that misrepresent the facts. Also, sorry if this is rambly or maybe says the same thing a couple times I’m working off 0 hours sleep.",
            "Or Fines and Fees.",
            "Really, how did that happen?",
            "Yeah, I expect comments like that one to crash and burn around this time.",
            "Man, mods always getting in the way of a good anti-mod circle jerk.  Damn mods.",
            "**Millwall Brick**\n\nA \"Millwall brick\" is an improvised weapon made of a manipulated newspaper, used as a small club. It was named after supporters of Millwall F.C., who had a reputation for football hooliganism. The Millwall brick was allegedly used as a stealth weapon at football matches in England during the 1960s and 1970s.",
            "The right are the ones who literally invented snowflake as an insult.",
            "Considering the entire point of conservatism is to take things backwards you are just admitting to everyone how much of a snowflake you are",
            ">land of sheep\n\nWhich is which?",
            "Their response is generally, \"because there's already so much nonsense on the administration side that we're tired of it.\" which I believe to be a hot sack of shit. If the administration is a giant crap factory, a democracy demands the opportunity for an equal response in the form of critique. This is the most obvious place for that.\n\nThis is a kowtowing to the right-wing cry babies. Welcome to Facebook.",
            "Well then how about that Malcom Turnbull? That guy still really grinds my gears...I think...right? We don’t like him right? 😉lol",
            "Well he's already murdered. You can't double murder someone.",
            "You want to tell Herman Cain that?",
            "You'll notice I am a frequent poster on this subreddit as well. The content is out there, but frequently is drowned out by the politics and Trump nonsense. This will give other content the chance to float to the top. \n\nOut of curiosity, how many quality posts have *you* submitted? Only reason I ask is because I looked and can't seem to find any.",
            "We should do a poll",
            "\"Remember, this IS. NOT. NORMAL. We can *NOT* give in to outrage fatigue!\" - John Oliver",
            "Saying Trump is bad isn’t a murder by words.",
            "That would be better, flairing things as political would allow those who don't want to see them not to, and those who *do* to continue seeing them.",
            "Flairs don't work in mobile which now accounts for something like 75% of Reddit traffic.",
            "Well, it has to be his flair for a reason, right?",
            "Nobody asked.",
            "It kind of does though. Everything has a political element. \n\nAll this change does is ban some overt politics (but not others). This opens the door for the implicitly political posts, which are much more nefarious.",
            "It's sticky, genius, people drop in all the time as its literally at top of the sub. Also I am not even american, which you'd realize by simply clicking my profile. But hey, that actually requires effort instead of shitposting.",
            "My guy this is Reddit, sharing political opinions won't change anything and never has. This sub isn't supposed to be a political sub either, and that's what it was turning into. One subreddit deciding to not be as political when it's not supposed to be a political sub is nth \"taking the side of the oppressor\", whatever that means. Go cry somewhere else.",
            "“Norci wins”",
            "You can look at the start. He copied what he said and responded to it.",
            "کعوی مداوید بنون بهیر 🌹🌹👑👑بای",
            "Its not bickering. A massive global power has an idiot in the United  States White House who asked who the president of Puerto Rico was. He backed the Proud Boys, Parler. There is just sooo much material there to work with. And it has the added benefit of being on the correct/ethical side of history.",
            "[removed]",
            "That’s literally all you said. Your post comes off as obnoxious whining.",
            "Yeah you’re 100% a pissed off supporter. They’re not boogeymen, but they’re dumb/racist/etc. and there’s a lot of them.",
            "To be fair, they could make it a multi-part tweet like most people do on twitter when they're typing something really fucking long-",
            "Challenge accepted. Now I just have to find someone on Twitter that I actually care to destroy. That site is such a brain suck.",
            "The time and place for progress is anywhere; thinking that slowing the flow of information down to a crawl is for \"entertainment\" is childish and stupid. Go take the political compass quiz, there's the question \"there's a worrying fusion of education and entertainment nowadays,\" and I bet that you strongly agree, If you do, don't try to have a conversation with the idea you are not stupid, and if you don't, you have some serious cognitive dissonance going on.",
            "[deleted]",
            "Saying being white is enough to be disrespected, bringing up radicals to describe completely rational people, and the old r/politics call out, the conservative trifecta.",
            "Dude, you are commenting on a post from a month ago. I decided to leave r/murderedbywords shortly after that post because it was fairly obvious to me that they were going to just kowtow to the red snowflake brigade, of which -- despite your rehearsed protestations to the contrary -- you are so obviously a part of. The only contact I have with this sub is when every once in a while some mouth-breather like you gets his Confederate panties in a wad and decides to come \"own the lib.\" Thanks for proving my point, Trumpbot. Now, to put it in simple caps-locked language that even you can comprehend: FUCK OFF, AND LEAVE ME BE. Isn't there someone wearing a mask in CostCo that you need to go call a \"cuck\" or something?",
            "They’re mad that the mods are taking their echo chamber",
            "read it again you,",
            "“Naturally lobotomized” ... I have never heard that phrase. It is hysterical... I see why you are on this thread.",
            "He got you rattled it seems, eh prowdboi?",
            "Lol someone's upset their side lost",
            "Thats nearly as ironic as the op being a mod, while simultaniously having a flair that states the rule they most often break themselves.\n\n__im not even fucking joking.__",
            "I can't believe you idiots are still replying to this. I hope you have a standing desk, because the level of butthurt you demonstrate would make surfing the internet nearly impossible otherwise.",
            "Or other Americans",
            "Or American teenagers",
            "Or lack of mental care",
            "Or depression from all of those",
            "The irony",
            "No... no its not lol. It's to *conserve* tradition. If the point was to go backwards they would be called regressives.",
            "New Zealand literally has lots of sheep !",
            "You’re talking as if Americans are the only people on this fucking sub. A lot of people who don’t care about politics just don’t want to have it clogging up the sub. Not every decision is political, you’re being overdramatic.",
            "The government isn’t censoring “equal response.” The mods are. They’re allowed to. Reddit isn’t a democracy and it’s not beholden to the Constitution. They don’t have to be the purveyors of free speech. The ban on censoring (non-inciting) speech ONLY applies to the government and government entities. Companies, private websites, message boards, etc. can do whatever the fuck they want. And this is coming from a self-professed bleeding heart liberal democratic socialist blue-haired queer sjw who would like nothing more than to see the Fanta Menace go down in flames. Repeat: it’s only the government that can’t suppress speech under the law. Regular people volunteering to moderate a free sub can do what they like, regardless of what “a democracy demands.”\n\nEdit: Thank you kindly for the gold, fellow redditor! 😁",
            "Oh lord. I'd rather punch myself in the crotch with a fist full of rusty nails than try to defend that weasel.",
            "Zombie Cain can do what he likes.",
            "\"The content is out there, but frequently is drowned out by the politics and Trump nonsense.\"\n\nAnd that...right there...is the issue.\n\nIt's not nonsense. We're at a pivotal moment in history. The subject you're tired of is what's on our minds. The content you don't like matters to many. \n\nThousands and thousands of people are dying and suffering because of Trump. His enablers and defenders deserve to get the murdered by words treatment and you're downplaying all of it because, somehow, dealing with what's actually going on in people's minds annoys you. \n\nBut I don't post enough content so somehow my opinion doesn't matter?\n\nYou're an asshole.",
            "We've tried that, but the sheer number of political posts drowns out other quality content, to the point where you can have days with nothing but political posts on Hot and Top/Past Day.\n\nThis will allow other posts to reach the top",
            "It is bickering tho. There is material to work with, but Twitter's 140char limit isn't really gonna make anything fitting the sub out of it, just take Mark Hamill's tweets as example. [This](https://old.reddit.com/r/MurderedByWords/comments/f3omrs/use_the_force_luke/) is not murder in any way or form, it's a childish \"no you\" insults. [This](https://old.reddit.com/r/MurderedByWords/comments/eo112f/murdered_by_luke_skywalker_in_farsi/) isn't murder either, it's political bickering of two separate issues. And [this](https://old.reddit.com/r/MurderedByWords/comments/7m3w35/mark_hamill_has_been_on_fire_lately/) is just jumping the opportunity to sling shit and as far away from murder as you get. \n\nIt's not content fit for the sub when you consider its origins and context, yet it is upvoted simply because people agree with the message, which made the sub into a propaganda channel more than for actual murders. That, combined with eh fact that half of the users aren't even American, and many are tired of politics taking over every single sub, makes it easy to see why many don't want that kind of content. \n\nYet some people, many in this thread alone, seems to see this kind of posts as some kind of internet activism as if posting a burn reply to Trump's tweet will make any difference whatsoever. It won't, other than giving you a false sense of doing something. Yet when people object to this content then you are suddenly a fascist. No, I am just tired of seeing this shit everywhere.",
            "Lmao, you seriously think shitposting some oneliners from twitter \"helps\" 😂\n\n Yes, you should be sorry for shitting down every sub with your politics. Quit playing the victim and keep your hysteria to appropriate subs like r/politics, it's not that hard.\n\nI guess Americans really can't handle the fact that they're not the center of the world, but thankfully mods on here have bit of common sense left.",
            "Holy fuck how delusional do you have to be to think posting zingers on reddit affects the political direction of the country.\n\nJesus you need to take a step back",
            "Do you not see the irony in telling someone \"If my american stuff bothers you, go back to your country\"?",
            "It already is dum dum. Your country is split 50% 50% between left and right, enjoy your hell hole.",
            "“Everyone’s a racist except the people who agree with me on everything!”",
            ">  Let me know when you manage coming with an argument that makes sense. \n\nSwing and miss, keep seething.",
            "Dude’s Swedish, I doubt he supports Trump.",
            "No, showing politics everywhere for sake of \"progress\" is what's stupid, especially if it barely fits the purpose of the sub. Just because there's an ongoing fusion between entertainment and education going on does not mean it warrants being everywhere, and if you think [this](https://www.reddit.com/r/MurderedByWords/comments/7m3w35/mark_hamill_has_been_on_fire_lately) kind of shitty Twitter bickering is \"education\" then I'm not the one with connective dissonance.\n\nAgain, different subreddits exist for a reason, if you want politics then go to a political subreddit and let people have their entertainment for themselves. And I did not say that constantly not being an activist is slacktivism, I said that considering shitposting Twitter screens for progress is slacktivism.",
            "Also, saying that not constantly being an activist is being a slacktivist is pretty dumb.",
            "Good detective work, Professor Bitchboy.. May not have the most extravagant life, but it's enough for me and I enjoy it. Those are 2 very solid hobbies you know lol. \n\nI like how you judge the value of my life by what you see on my reddit. Sure says a lot about you doesn't it mate!\n\nBelieve it or not, I do indeed have a life outside reddit (when I say outside reddit, I also mean you aren't going to find out everything i do by looking at my reddit posts) even though yes, I do use reddit a lot.. I still don't have time to dive into the rabbit hole of politics on a sub that isn't meant to have politics in it",
            "Your stupidity hurts me",
            "People like you are the reason the sub is shit.",
            "\"rEaD iT aGaIn yOu\" Perhaps you should follow your own advice. Assuming your reading comprehension skills are above that of a fourth-grader, you'll understand what I mean.",
            "well yeah no shit lol. did I not make that obvious?",
            "I'm not American or Conservative so I really couldn't care less tbh.\nPeople like you love to make all these assumptions and generalisations and it is genuinely hilarious how wrong you are. \nMaybe you should look at facts and the information presented rather than just saying whatever the fuck you want to suit your narrative and then perhaps you will look less like a babbling retard",
            "I know, I saw it too. What’s also funny is that I recommended flairs and they said it wasn’t possible and would also affect mobile. I linked r/pics as they are a much bigger sub with flairs and how it works. Silence from them.",
            "Someone must be upset that the reply they receive was a prime example of what r/MurderedByWords should be LMAO\n\nSounds like your butthurt over being made a fool",
            "damn this thread made me want to leave the US even more. don’t forget “killed by fires” though, the air quality where i’m at is 200 on a good day.",
            "I mean, we're the original murderers of native Americans, it's a poetic full circle no?",
            "Or my axe!",
            "I laugh to keep from crying",
            "or preventable spread of Covid19",
            "Or [Civil Forfeiture](https://en.wikipedia.org/wiki/Civil_forfeiture_in_the_United_States)",
            "Or the Reddit comment sections",
            "Or Covid.",
            "The US *metaphorically* has lots of sheep!",
            "Your rant is so frustratingly not in response to what I said.",
            "No ones really questioning whether the mods censoring something is legal",
            "Spoken like a true fascist",
            "This mod is on a power trip. You can tell he’s a Trump Supporter that’s been offended. Where are the other mods?",
            "While I agree that the content jab was kinda petty, it still doesn’t change the fact that the feed is still getting clogged up with trump stuff. Trump is an asshole but this sub isn’t about American politics. Of you want to past about politics then go post it in another sub thats politically focused like r/politics",
            "So now the sub has 5 posts in a day. Great job.",
            "Well said, post like those are why I left this subreddit months ago.",
            "No, you’re bickering, and you didn’t have a prob,em with it when Trump was in office?",
            "holy fuck you killed everyone in the thread",
            "Nah I'm american and i agree with you. Social media has a severe effect of creating us vs. them mentalities so people can feel validated, respected, admired, and what not. The middle ground gets no overdramatic attention and is often pushed into one of the two warring sides.\n\nNot only that but pushing people into warring identities has a \"positive\" effect of creating more incentive to donate to your local fear monger.\n\nBruh i just want intellectual conversation, artistic creativity, and dumb jokes. But so far all I'm seeing is self fellatio, copy pasted twitter zingers and buzz words, and arguments in bad faith. Arguments for the purpose to stroke ones ego. Those arguments seriously look like they are the subjects of a narcissistic psychopath analysis. Anyways fuck all the political melodrama, it aint even funny, creative, or intellectual.",
            "Holy fuck I don’t give a fuck. Politics doesn’t matter, considering all anybody cares about is the president, I’m Indian, and I can ask: why? Doesn’t the senate make all the laws, and the Judicial approves them, and the cabinet and Vice President runs all the stuff? What does the president do? Sign a few laws, I guess.",
            "I totally agree, I'm not an American myself and am still pissed abt this",
            "Parlor counts right?",
            "No, the country is split between right and slightly more right.",
            "Don't waste your breath on him, he's one of those that think as soon anyone objects their shitty spam then you're against them. Americans continue proving that they think they're the center of the world.",
            "No, but trump supporter are racist for supporting a racist president. You guys sure are mad. Need some more copium?",
            "All you got, huh? Yeah someone needs some more copium",
            "The people who only look at subs for entertainment and don't get involved in politics will be the next generations boomers; people waiting for them to die so that things can change. Connective dissonance is not a thing.\n\nConsidering doing something that harms no one is not something you should judge someone on.\n\nI don't know why you used that twitter example considering it's donald trump saying some weird *borderline* political shit and then someone making fun of him. It's like me going to r/politics and citing a post there, saying \"look at what happens when there are no politics in a conversation.",
            "You literally said all of this.",
            "People like you are the reason this sub is a hellhole that dries murders that were posted a hundred times will ve posted again,in your crusade againts republicans and the orange man you started karma whorring,this is the best shit the moderators of this sub have done",
            "You sound fun",
            "Jesus, and i thought BBBG was bad, now ive learned the mods cant take criticism. Are there any DECENT mods on this sub?",
            "If you find a country that'll accept Americans let me know.",
            "Oh hai fellow Californian :)",
            "\\*Laughs in Spaniard\n\n\\*Laughs in Norse\n\n\\*Laughs in Native American",
            "I didn't murder any native Americans.",
            "You really brought the mood up on this thread, thanks!",
            "Yes and both sides think the other are the sheep.",
            "I understand. However, I thought your implication was that if they censor a topic, it violates free speech as defined under the Constitution. If I extrapolated too broadly, I apologize, but invoking “democracy” was pretty broad-stroke, implying allowing continued posting of US political stuff was integral to maintaining it. I doubt people’s minds are often changed by a Trump-related post on a subreddit    There are many other subs where people stare aghast at the stupid shit this administration does.",
            "You really do not know what that word means.",
            "Free speech only protects you against government prosecution unless it's hate speech or threats against people.",
            "I am the highest normally active Moderator and you're wrong. bbb isn't a Trump supporter he's simply a moderator that like so many others is bone weary of all the US Political content.\n\nThis ban is temporary and will be lifted after the elections.",
            "No he didn't.",
            "Every law that goes through the cabinet ultimately ends up at the presidents desk and he can approve it or Veto it. President has the final say in most cases that you’re talking about.",
            "Sir, you are in the wrong. I am anti Trump, and live in America, and even I am tired of seeing this crap. It's not the place to say that Trump's bad. It'd be like going to a playground and putting up pro or anti Trump banners there. Imagine you go to a funeral, to morne the death of your dear Mother. She had succumbed to a heart attack a few days before. You cry for your dear Mother, then some a-hole starts saying, \"you know, Trump is a racist and is an awful person! Your mum was right to be a democrat!\" You look up and see someone you invited because you thought they cared, but instead they're pushing their agenda. You ask them to stop, this funeral is for morning your mother, and they say, \"oh, I see! You racist f-er! You like sucking Donald off do ya?\" This is what you are doing to this subreddit by being an apathetic, idiotic twat that either doesn't know basic social structure, which is taught in elementary school, or you are so self absorbed you can't picture a world outside of your echo chamber bubble. If people are telling you you're wrong, instead of calling the a racist fascist with no evidence of it, look within yourself and ask, can I be nice to this person? Might they have a different reason for not liking my political commentary? Did they literally explain it in their post? I honestly hope you'll dig your head out of the sand and realize the world is bigger than any one person's isolated life.",
            "Biden is racist. So all his supporters are too?",
            "You're obviously beyond reach of logic otherwise you wouldn't have typed that Trump supporter drivel to begin with, so I'm not gonna waste any more time. As said, let me know when you have sensible arguments, bye till then.",
            "> The people who only look at subs for entertainment and don't get involved in politics will be the next generations boomers;\n\nYou do realize that people can follow multiple subs, right? You are essentially arguing that you should fill up every possible sub with politics for sake of progress or something so nobody misses out. That's just stupid. Again, different subs exist for a reason so *you can choose* what you want to read at any given moment. \n\nThere's absolutely nothing wrong with keeping certain things entertainment only, sometimes people want education, sometimes only entertainment to relax after a long day. Nobody's going to be next generation boomers just because they don't want consume politics at every turn. \n\n> I don't know why you used that twitter example considering it's donald trump saying some weird borderline political shit and then someone making fun of him.\n\nBecause it is a perfect example of stupid shit that is neither educational nor a murder that got upvoted before the ban simply because people don't like Trump.",
            "By this logic i should see political agenda even at p*rn hub :D since time and place is everywhere",
            "The white thing was just a joke. You say \"rational people\" but I can assure you that a lot of the shit I have seen is not rational whatsoever. The reason I mentioned r/politics is because this isn't a sub-reddit where politics belong so if you want to talk politics, go somewhere else. There is literally nothing more to it lol. \nAlso, as I have said already about a dozen times, I am not a Conservative. I would be doing exactly the same thing if this sub was a right wing fuck fest, but it isn't... \nYou making broad sweeping generalisations like that about   everyone is exactly why no one should take anything you say seriously. You see people as groups, but not as individuals.\nYour smooth brain can't comprehend that people can actually speak out against people on the left, but not associate with the right.\nEven if I was a Conservative, what would be the problem with that? If you can't help but look down on someone right leaning and can not tolerate peoples opinions that differ to yours, then you are narcissistic and stupid.",
            "> in your crusade againts republicans and the orange man you started karma whorring,this is the best shit the moderators of this sub have done \n\nI'm for this rule, what are you talking about? You said \"read it again, you\" on a comment that was criticizing another comment that was against this rule.",
            "Like a bursting colon polyp",
            "Only got a response from one other mod that said the other one wasn’t biased and doesn’t like Trump. I call bullshit and I’m leaning toward that being a second account.",
            "will\ndo",
            "Canada?",
            "hello!",
            "Humans, humans, they just love killin'.",
            "Didn't murder any native Americans *yet*.",
            "You’re confusing the American ideal of free speech with the First Amendment, and hate speech is free speech protected by the first amendment",
            "Awfully privileged of you to simply ignore the existence of politics until after the election",
            "Cant believe no one has stepped in to call out this bullshit yet, but, welp, here we go.\n\nIsnt a trump supporter, huh? Then WHY in the fucking world are these examples so benign? Why, in the name of jesus fucking christ, would you have a single reason to doubt he's not a trump supporter, if everything he's banning is leaning over to him being one? I have an idea: because you're covering for his ass.\n\nThink about it for a moment. You are the highest normally active moderater, correct? And if we're to take your word for it, then surely you'd notice that half of BBB's posts on this site dont fit whatsoever, right? So WHY, then, is BBB still a mod? WHY isn't he facing any punishment? Simple.\n\n___Because he's a mod.___\n\nThese mods are so busy sucking each others dicks, that they dont care what other mods do. They'll cover for them. The mods wont face any punishment. Simply because the mods are sooo much higher then us _feeble_ simpletons, and can get away with whatever the hell they want.\n\nTLDR; Piss off with your bullshit.",
            "Wtf are you even talking about. This is also the dumbest fucking shit I’ve read especially after earlier today.",
            "On a scale of not mad to overthrowing the government, how mad are you that Biden is president?",
            "Man, you are so mad. You even pretend not to be a Trump supporter, but get so butt hurt that it’s hilarious. On a scale of 1 - 10, how mad are you he lost?",
            "Wait i thought i comented this on the critic of the rule.Lol.",
            "Yeah, pretty sure i saw that. Its ironic, because while i dont think that other mod is a second account (though its definitely not impossible, since BBB frequintly breaks the 1st rule of the sub and SOMEHOW doesnt get any punishment), what they themselves said not only doesnt disprove your point (unless being a mod suddenly now magically means you're right in whatever you say), but is also extremely ironic, since they themselves seem pretty biased towards BBB. Why? I dunno, maybe because they're a mod? Doesnt exactly make sense, but like i said, the mod who made this post most frequintly breaks rule 1 and gets zero punishment for it, so i have no fucking clue at this point.",
            "Please don't come to Canada, we only want your money not your trigger happy lunatics",
            "Nah we don't want them here",
            "No thank you, we're good. Sorry, eh? :)",
            "hello from Oregon. hope yall are playing it safe. sucks that the earth hates us",
            "Nah, I think it’s a black vs. white thing right now. Natives aren’t causing any problems.",
            "Out of all 12 of them? I might be against genocide, but Americans/Canadians are pretty damn effective.",
            "r/cursedcomments",
            "Yes, and it's nice and comfy up in here in my Ivory Tower. Is it not magnificent?",
            "This isn't the place moron. The fact you can't see that is horrible. I'm so sorry you sad little person, who can't exit their echo chamber long enough to listen to other people. Those people should be condemned for treason, however what happened today doesn't condone your behavior. Their actions doesn't make yours okey, trying to say otherwise is horrible. Let people have some places of peace! This is why people don't want politics here, it's people like you. It's not a discussion for you, it's attacking people for no f-ing reason, under the guise of \"political justice. You are an idiot, the fact multiple people are telling you that should tell you you're in the wrong.",
            "Neither",
            "I’m thrilled he did. It’ll make more conservatives",
            "not all of us are trigger happy lunatics, and I speak for many people when I ask you to kindly shut the fuck up.",
            "Being from Texas down here, when people were talking about trump building a wall to keep the Mexicans out, we'd quickly inform them that Canada was also building a wall. *To keep us in! *",
            "So you want strong border security in regards to your southern neighbor?",
            "I don't blame you but I wanna go there xD",
            "To be faaaaiiiiiirrrrr.... we been hating the earth for a while, its only right it hurts us back. \n\nHello, from your friendly Idaho neighbor! Hope you and yours are okay and safe!"
        ]
    },
    "Which God, you think? ": {
        "title": "Which God, you think? ",
        "score": 14781,
        "url": "https://www.reddit.com/gallery/1dkyxjf",
        "content": "",
        "num_comments": 796,
        "comments": [
            "Which god? Jupiter? Vishnu? Marduk? Coyote? Zoroaster? Anubis? Odin?",
            "Maybe if we spent a month NOT watching Fox News our brains would start working properly again",
            "Fwiw, the treaty of Tripoli was *not* ratified by <ahem> \"all 50 states\" in 1797.",
            "the Catholic Church designates several months a year to celebrating God and the Saints. It's already done. The thing is, it is extremely unreasonable to expect non-members to follow the designated celebrations of an organisation.",
            "I can't imagine worshipping a God who'd punish me for harmlessly using the free will he gave me.\n\nLike seriously, these morons do nothing but make their God out to be such a horrible bastard.",
            "It’s not like December is known for any major Christian holiday.",
            "I read specter as sphincter and it still made sense to me.",
            "Hopefully not angry Old Testament god and instead more chill New Testament god after he settled down and had a family /s",
            "God? Bah, humbug. The Great Pumpkin in the only true deity.",
            "They don't want theocracy, they want PRIVILEGE. And they think this is how they get it. Because as soon as some other religion gets the same privileges as them (much less the upper hand THEY seek) they're apoplectic. There are no gods--and they see this clearly with everyone else's claim to privilege.\n\nIt's a grift.",
            "Typo. It’s supposed to be “celebrating Gord.” Reach out to any and all Gords in your life and let them know how much they mean to you. Daves are next.",
            "…50 states in 1797? 🤔",
            "As long as you worship the Sun or the Moon too, how about every day of the week?",
            "Not the same god. They originated from the same religion (early Judaism) but you can't still call them the same.",
            "Salem hasn’t had any witch issues ever since. Looks to me like they solved their problem.",
            "Whenever we put religion in charge, it never turns out to be paradise. It turns into Iran or Afghanistan",
            "Why should we give any deity a month? America is not a Christian nation. I don’t give a fuck who downvotes this comment. 22-30 % (moving higher yearly) of Americans have no religion. Almost 1/4 (a bit more) of Americans don’t give a flying fuck about a God. \n\nI can’t wait til that day. We’re going to have two types of people. Those who rely on science, math etc… We will also have the idiots screaming shit like Terrence Howard. \n\nThe Establishment Clause and The Free Exercise Clause prohibits our government from having a religion. It’s in the same Constitution these people are crying about.  It clearly states we have no National Religion.  \n\nIt also says it’s illegal to promote theocracy or promote a specific religion with our taxes. \n\nWhatever though? Amirite. Give the kids the Ten commandments in every school.  On our dollar.",
            "Also, which Sin?  Wearing clothing of 2 different materials? Growing two different crops in the same field? Men wearing hats? Buying a house? Mistreating foreigners? Cussing out your parents? Cooking a goat in the milk of its mother? There are a lot of sins in the bible, but then theyve probably not read it",
            "Christian’s when they die and god asks them why they spent so much time harassing gay people online",
            "God literally created sin.",
            "Worship Satan. That deity represents a mockery and an opposition to religiofascists. Had the christifascists and other religulous idiots not demanded we all worship an abusive sky daddy poƃ person who can’t make mistakes but somehow managed to make the mistake of the person posting stupid religious crap, the idea of satan wouldn’t need to have been. So I play with Satan. The idea of someone like that as an opposite to a hateful poƃ is rather nice.\n\nHail, Satan. :cheerful laughs all around:\n\nhttps://i.redd.it/35yk3pi7l08d1.gif",
            "In the history of humanity, as many theocratic governments have existed, this has never worked. Literally never.",
            "Why belong to an organization that condones pedophilia? Don't they at least have some secret phrases that you can say and they'll even kick you out?",
            "Matthew 7:1-3\n\nJudge not lest ye be judged. \n\n**If you got a problem with sin you're supposed to shut the fuck up about it.**\n\nMatthew 5:38-48\n\n“You have heard that it was said, 'Eye for eye, and tooth for tooth. ' But I tell you, do not resist an evil person. If anyone slaps you on the right cheek, turn to them the other cheek also. And if anyone wants to sue you and take your shirt, hand over your coat as well.\n\n**If someone does sin, you forgive and move on.**",
            "Quickest way to drive people away from Christ is to force them to drive towards Him",
            "*\"if my people, who are called by my name, will humble themselves and pray and seek my face and turn from their wicked ways, then I will hear from heaven, and I will forgive their sin and will heal their land.\"*\n\nFrom my recollection of church teachings, that ain't about us 'worldly' heathen skippy, that's about YOU guys.\n\nHere endeth the reading ya holier than thou hypochristian turnips",
            "how are the religions Gods the same, they all have different dictates and all claim if you pick the wrong one you burn in hell. thats not man-made additions, thats from God directly according to their religions",
            "I know what would make this person happy: Let’s make Ramadan an officially recognized federal holiday. It’s literally a month long religious holiday.",
            "Why only give one month to Vishnu?",
            "Finally, something at least murder-adjacent. Someone call the Lieutenant.",
            "It's 2024 and people still believe that the Christian God the Muslim God and the Jewish god are all different people?? How sad",
            "You know what happened to just about every theocracy that came before us? Their reign ended. Of the remaining, you're currently complaining about their people immigrating here and bringing their religious doctrine with them.",
            "Maybe if we felt less entitled to tell people what they should and shouldn't be celebrating, people could make their own choices and enjoy their own lives without perfect strangers pretending they alone know what's best for everyone.",
            "Wood chippered by words.\n\n/edit oh wait, 16 states in 1797. Not gonna fact check anything else, because I agree in general  :)",
            "Maybe if Christians weren't so violent we could all live in peace.",
            "Why is he still a Catholic?",
            "admits to the pedo preists and still follows the religion",
            "I think if more people focused on God and not what man does when he misinterprets or uses God to force his own agenda we'd all be a lot more rad to each other. \n\nMatthew chapter 23 sums this up best. \n\n23 Then Jesus said to the crowds and to his disciples: 2 “The teachers of the law and the Pharisees sit in Moses’ seat. 3 So you must be careful to do everything they tell you. But do not do what they do, for they do not practice what they preach. 4 They tie up heavy, cumbersome loads and put them on other people’s shoulders, but they themselves are not willing to lift a finger to move them.\n\n5 “Everything they do is done for people to see: They make their phylacteries[a] wide and the tassels on their garments long; 6 they love the place of honor at banquets and the most important seats in the synagogues; 7 they love to be greeted with respect in the marketplaces and to be called ‘Rabbi’ by others.\n\n8 “But you are not to be called ‘Rabbi,’ for you have one Teacher, and you are all brothers. 9 And do not call anyone on earth ‘father,’ for you have one Father, and he is in heaven. 10 Nor are you to be called instructors, for you have one Instructor, the Messiah. 11 The greatest among you will be your servant. 12 For those who exalt themselves will be humbled, and those who humble themselves will be exalted",
            "52 Sundays every year. Add in Christian holidays and there’s plenty of celebrating yet Christians still can’t make it work. The problem isn’t in how many days you get, it’s the quality of your devotion to Christs TRUE teachings.",
            "The largest ring of pedophiles on the planet",
            "God is not great, religion poisons everything.\n-Christopher Hitchens.",
            "Not the heavy set, laughing one at the chinese food place, I'll bet. More likely, the white guy from the middle east I'm betting.",
            "There are many things wrong with the British Empire but I wouldn't say we were ever truly a theocracy",
            "Bacchus and Venus, who else?",
            "\"...and ratified by all 50 states in 1797.\"\n\nHmmm.",
            "I ASSUME YOU ARE TALKING TO TRUMP",
            "Maybe people of god should try live not hate and stop running none believers off before there know god",
            "Ooo a whole month celebrating god. That sounds like such a fun time. Sign me up.",
            "Pretty sure there weren’t 50 states in 1797",
            "\"Ratified by all 50 states in 1797\"\n\nIs anyone gonna tell him?",
            "Eeew! My eyes...",
            "Not 50 states though…. Otherwise spot on murder",
            "Quetzacoatl.",
            "Ratified by all 50 states in 1797?",
            "Kali",
            "Wait til they learn about this month called ‘December’",
            "Going from \"celebrating God for a month\" to a theocracy is quite a leap.",
            "By all means, celebrate god. But leave the government out of it.",
            "What does the meme have to do with founding docs? \nFurther more how can homeboy be taken seriously with \"All 50 states in 1797\"? SMH",
            "I want Ganesh, the uber cool-looking deity!",
            "The Morrigan",
            "Last I looked, the Church spends about 12 months of the year celebrating God. \n\nMaybe if they tried loving thy neighbour as thyself for month instead of judging others they'd see more of God's blessings.",
            "I'm a Catholic, man. And I gotta handle my Catholic. Damn.",
            "Apparently, one that condones murder because that was brutal.",
            "All 50 states in 1797. Hmm someone needs to go back to history class and cone back and try it agian.",
            "Which god, the god of Hades that republicans now worship?",
            "Most Christians cant see the irony in their faith when mixed with their personal lives.",
            "I wish I could put my thoughts into words as well as this man.",
            "It will only see sacrifices & massacres.",
            "“All 50 states”? That’s forward thinking in late 1700s.",
            "Cthulhu Fhtagn",
            "The one that makes balloon animals!",
            "Maybe if they actully read the book they claim to follow they would think differently.",
            "There is no god - there is only JUUL!!!! Wait... I don't think that's right 🤔. \n\nMaybe it was - there is no god, there is only FOOL! That sounds closer... still not quite there though.\n\nHow about - there is no god, there is only TOOL!?! We'll just stick with that. Maynard will be happy, and the wine shall flow eternal. All hail TOOL!",
            "fisters and sisters unite. 😅🙄",
            "That facebook post reads like a racist homophobic christian boomer made it",
            "Lemme guess. Louisiana.",
            "50 states is wrong",
            "The end is coming",
            "I did not know there were 50 states back in 1797.",
            "How about following God when he said, \"Judge not,  least ye be judged.\"?",
            "I vote for Cthulhu.  Those sweet, sweet tentacles.",
            "\"All 50 states by 1797\"\n\nAside from this one comment...I like this rebuke.",
            "They had every month before 1999 for that murderous piece of shit to show up and show them what they desire.",
            "The god of tits and wine!",
            "1796, all 50 stares you say? Mhm may want to check how many states existed in 1796.",
            "I just wanna point out how during the entire month of December everything becomes themed around a Christian holiday",
            "You know who else people accused their neighbors  to have them removed? Soviet Union communists. They were also an atheist society.",
            "\"that we both belong to\" idk why but it hits hard",
            "Bitch, they already have the whole goddamn April and December lol",
            "THEIR GOD. Only their God. It's the ONLY God.... until another majority forces a different one down their humbled throats.",
            "Zeus. Maybe Thor. But probably Zeus.",
            "If God cared he'd do something about it.",
            "This is the kind of Catholic I can respect",
            "I always catch shyte when I point out that Jews, Muslim and Christians all worship the same god from different playbooks. Fucking stupid reason to have killed BILLIONS of people over for literal centuries.",
            "The Old Gods, New Gods, the Seven, Lord of Light, Faceless God?",
            "I’m a big fan of Zeus’s work.",
            "All hail Clavicus Vile 🙇‍♂️🙇‍♂️",
            "“Wait! You said ‘ratified by all 50 states in 1797’, but there weren’t 50 states then! I caught you on one incorrect point which lets me dismiss your entire response as leftist idiocy!” - OOOP, if we give him extremely generous and unearned benefit of the doubt",
            "I agree with the responder but there weren’t 50 states at that time.",
            "It's been watered down by commercialism, but... Christmas?",
            "Ramadan is already a month dedicated to God.",
            "Christmas lasts from November 1st to January 4th. Next argument.",
            "There weren’t 50 states in 1797. Idk if he actually knows what he’s talking about.",
            "More weight",
            "Chthulu?",
            "Ummm. Love the anti-theocracy rant and totally agree  but we didn't have 50 states in 1797....",
            "\"50 states in 1797\" tf you mean??",
            "I agree, but he’s definitely not catholic haha",
            "God!!! Please give us a SIGN!! \nGod: What the heck? A revival? Crime is lowest, Jobs are highest, unemployment lowest, stock market highest, plagues and pestilence lowest, famine non existent here. So what kind of a sign do you want and no I’m not killing all of the gays.",
            "“Ratified by all 50 states in 1797” How can that be?",
            "“month…celebrating sin”? Bro is unable to realize he’s celebrating hatred, division, self-righteousness, arrogance, consumerism, worship of wealth, violence, oppression, greed, hubris, racism, xenophobia, misogyny, classism, and tribalism every day of every month cuz he’s so obsessed with his sex fetishes. Typical “Christian” whose religious beliefs are determined by their political beliefs and not vice versa. Christ’s teachings went “whoosh,” right over his head.",
            "I mean... They spend every day glorifying god, and it doesn't get us anywhere already.",
            "If there’s a gay god, I’d love to meet them.",
            "All 50 states in 1797?\n\nThere were only 16 states in 1796. So one year later, 34 more states were recognized?",
            "If anyone believes that the Christian God is the same a the Muslim god then they have literally 0 understanding of both religions",
            "Cathulu...",
            "Interesting content against a rainbow colored background. LGodBTQ?",
            "Also, here's a thought, if you bigots weren't so filled with hatred for your fellow man, selfishiness, pride, and greed, and worshipping false idols, all the opposite of what Christ preached, maybe then your nation would see revival and God's blessings.\n\nJust sayin'.",
            "We didn't have 50 states in 1797. 🤦‍♂️",
            "There weren’t 50 states in 1797.",
            "Bro, Advent exists. So does Lent. That'd two months, one happy one sombre, to celebrate the Christian faith. Advent even gets marketing and special daily treats, as well as unique songs to play about how awesome jesus is.\n\nEven if this MF not Christian (like I strongly believe he is, because this just smacks of American Evangelical), Ramadan is a month of solemn prayer, and Shravana is another month of religious fasting for Hindus.  Would they prefer those months to be enshrined for capitalism's delights? Harder for fasting months, but Capitalism could work it out!",
            "There weren’t 50 states in 1797. Mic drop",
            "Some of us can celebrate both.  🤷‍♀️",
            "I see gods blessings every day in the faces of my queer children who are bright, college educated and productive members of society.   They also volunteer their time.   What do these “Christian”\nPeople do other than hate on those who don’t think as they do and plot the destruction of a secular state?",
            "I’m thinking… nope",
            "I choose Grenth",
            "imagine worrying so much about who someone else is fucking… if that’s all they think about then maybe they need to reevaluate themselves",
            "All 50 states in 1797.",
            "We have many holidays dedicated to God, and every seventh day.",
            "I agree with the spirit of the post, but I'm confused about something. ELI5, how was something ratified by 50 states in 1791 if there weren't 50 states back then?",
            "Also, it's not like we spend MOST OF NOVEMBER, ALL OF DECEMBER, AND A LARGE CHUNK OF APRIL focusing on Christian holidays....",
            "I want to know more about the 50 states in 1797.",
            "May jesus crist bless yall",
            "Maybe …",
            "How much would it suck if all this time it just hasn't been enough people praying?  All our struggles and misery throughout all of human history, all of it could have been avoided.  \n\nRighhhht.",
            "\"Ratified by all 50 states in 1797?\"",
            "Bit of a self own in there too, pointing out he’s a member of an organisation which supports pedophilia and protects pedophiles.",
            "How could it possibly be ratified by “all” 50 states in 1796?",
            "Ratified by all 50 states in 1797? Um, no..",
            "Odin. It's always Odin",
            "Ok, so, hear me out y'all, there's this one called Slaanesh that...",
            "I want our rainbow back.",
            "![gif](giphy|l0MYQdBdqEpSEm82k)",
            "Fuck the world",
            "Yes a religious harmony month where EVERY religion and spiritual path is respected and celebrated. Yes that",
            "which God?, the only God, YHWH, who allowed ignorant hateful man to kill His son so that y'all might have a chance at salvation. unless you mean the other fake gods who are useless because they don't exist. like man needs religion to kill each other and do wicked acts to each other, if he doesn't respect a God of love how would he respect man? religion can be used by man to do wicked, just like he can use scouts, or a teaching position, or political position or anything because that's man, not God. everyone always wants to blame God for why man is ignorant, and murderous, and a thief, and liar, which are none of God's qualities, just satans.",
            "Ya all them centuries of Jesus and Allah went superb",
            "I'm with George Carlin and am going to pray to Joe Pesci",
            "I missed Shavuot and Hajj. Can I still catch up?",
            "Every Sunday not good enough for you? Wait, are you watching football and drinking beer rather than celebrating your God?",
            "All 50 states?! In 1797?!",
            "Don’t they go to Church every sunday? That is 52 days ffs",
            "So the comeback guy said \"I'm a member of a pedophile organization\" and he's the clever one? What??",
            "There are 52 Sundays in the average year, that’s already way more than a month",
            "I’m all for this, but the USA didn’t have 50 states in 1797.",
            "Doesn't matter which version of The Creator you subscribe to, but y'all clearly ain't ready for that conversation",
            "Amen",
            "50 states in 1791????",
            "I am HERE for Christians calling out Christian hypocrisy!!!",
            "Ah yes, making America great again by accusing any woman who owns valuable real estate as a witch.",
            "Correct me if I’m wrong but isn’t Jewish, Muslim and Christian god the same?",
            "So well said",
            "There are thousands of gods to choose from, it's going to take a lot of research to pick the right one for you.",
            "I very much appreciate the response to such dumb BS, but there weren’t 50 states in 1797. There were 16. And some territories. Because Manifest Destiny (continental expansionism) hadn’t quite caught on yet. It started around 1812. \n\nAnd both Alaska (49) and Hawaii (50) were not officially states until 1959, about six months apart from one another.",
            "I don't want to pick at nits here, but the Jewish, Muslim, and Christian gods are the same god.",
            "Thor.",
            "Christians, Muslims, and Jews do NOT believe in the same God. Christians believe in the God of the Old Testament, and they believe that God inspired the New Testament. They also believe Jesus was divine. Jews believe in the God of the Old Testament, but do not believe that God inspired the New Testament, or that Jesus was divine. Muslims believe that the Old Testament was corrupted, but that the God of Abraham is Allah, and that Allah wrote the Quran and delivered it to Muhammed. They also believe Jesus was a prophet, but not divine. Neither Christians or Jews believe Mohammed was a prophet, or that the Quran was written by anyone other than Mohammed.\n\nSo, do they actually believe in the same God, or is each just loosely based on the same fairy tale?",
            "Don't they that ever Sunday? That's like 52 days. Pride is only 30 days. Their god must be weak as hell",
            "“Ratified by all 50 states in 1797”…wtf did I miss a history lesson?",
            "All praise to Lisa the Rainbow Giraffe, Under the Banner of Heaven!",
            "Was rooting as I was reading the comment then got to “ratified by all 50 states in 1797”. Bruh😑",
            "Am I the only one who read all 50 states in 1797?!???!",
            "Derpa Derpa Derpa!!",
            "Umm. We didn't have all 50 states in 1797. Therefore, 'all 50 states' could not have ratified. \n\nAlaska didn't get admitted until 1959.",
            "There was only 16 states by 1797, with Tennessee being the last one of that year. Hell, Alaska wasn't an American territory until 1959.\n\nhttps://homework.study.com/explanation/how-many-states-were-there-when-george-washington-was-president.html",
            "All the time. You should try it",
            "You mean like December, for Christmas? And February for St. Valentine's Day? Or March/April for Easter? Or every Sunday when you go to church?",
            "You can celebrate Jesus birth all December, and celebrate his sacrifice all during lent, those are more than two months of celebrating god",
            "Or not!",
            "Ratified by all 50 states in 1797? I believe there were 24 states in 1797.",
            "Why, the 'One True God' of course.  /s",
            "It''s basically Christmas from Thanksgiving  till Dec 25 so there's your month...",
            "I can't get past the fact that I originally read the line as \"he and his effed up daughters said your SPHINCTER pinched them.\" Just a horrifically hilarious and weird mental image!!",
            "Pride Month is 30 days. There are 52 Sundays in a year.",
            "Let's spend a month celebrating Kratos",
            "\"ratified by all 50 states in 1797...\"\n\nThis hurts me on the inside. \n\nIf you're gonna make good points but decide to base them on American history, maybe take 2 seconds and fact-check yourself before putting it on the internet.",
            "Fuck you religious folks can’t shut up about your beliefs…. Not everyone follows you doctrine and by shoving it in our faces every second you get isn’t changing anyone’s mind … keep your faith to yourself …..",
            "Idk I kinda like blowing my priest",
            "Speaking in absolutes when discussing topics outside of human comprehension is\nwack.",
            "Obviously, he's taking about Voldemort.",
            "We didn't have 50 states in 1796. The guy is right, we were never intended to be a Christian Country... But damn dude come on. Worst way to wind up losing a debate.",
            "Ratified by all 50 states in 1797?",
            "I wonder how Lot figures into the US?",
            "I knew 50 was wrong but we only had 16 states in 1797 lol",
            "There were 50 states in 1797?",
            "Yeah, waited patiently for god to intervene, but they both fucked me. No god, an eight year old boy can put two and two together…\nThere’s never been any god",
            "https://preview.redd.it/8myxp5dz818d1.jpeg?width=1457&format=pjpg&auto=webp&s=f100962971afa9285c0245cbd873d76bf0a0bdbc",
            "I'm not American, but did the US have 50 states in 1797?",
            "Odin commands me",
            "The commentator is Catholic. Leopards should eat his face.",
            "Definitely Anubis.",
            "God is unconditional love. When love is unconditional then YOU are left to meet all of life's conditions while providing all of the love. Unconditional love is just hate in disguise. Simply put love is: I accept you for who you are and I will let you be that person even at my own expense. Hate is: be the exact kind of person I tell you to be or else I will punish you. It might be my scientific heathen nature but I just can't picture someone who loves me saying \"do what I say or go to hell\". Personally I'm looking forward to finding someone to share the conditions of life with. \n\nSome of the conditions I have in life are: not abandoning me when I need you. :not doing things for me in proportion to what I do for you(not nickel and dimeing for what we do for each other). : telling the truth now when it's hard instead of later when it could be harder. : not holding you responsible for the actions of your family. (Basically not a 1,200 page book about why you deserve to be tortured because of some fruit that was stolen by your great great grandparents). People love to mention the good conditions about having them around that's why it's such a red flag when they say the love is unconditional.",
            "All hail Sheezmu!  Egyptian god of wine and slaughter!\nLMB!",
            "Flying spaghetti monster have a shot",
            "This! You can be religious, and get this - have some critical thought 🤔",
            "Team Satan. Every is welcome, there’s better weather, and more fun in hell. Also, fun chicks got to hell not heaven.",
            "How’s the commenter still a Catholic?  Lmao. I was with him until then",
            "I don't celebrate God and any religious nonsense should be kept in church cynagogs and other religious houses and nowhere else not on public media or public transport if I choose not to belive in a fictional made up being that I believe was a story hook not a religious  boon of worship then I don't want any body who is religious spouting thiervnonsrnse in my personal space",
            "My guy, y'all get literally EVERY FUCKING SUNDAY. How much more do you want? 💀 I know this is primarily Christians who celebrate every Sunday, but that is, presumably, the religion of the person who made the post, as they're usually the more openly bigoted ones.",
            "All fifty states in 1797 huh? Pretty impressive",
            "Muslims, Christians, and Jews worship the God of Abraham. All others are insignificant.",
            "There’s always some brainwashed idiot out there spewing hate in the name of God. It’s always a God who happens to be white and believes in the subjugation of women, who finds homosexuality abhorrent, but is far too often represented in those particular earthbound churches by an egotistical, pedophile groomer. Personally I’ll take whichever religion has a God who doesn’t support this shit!",
            "We need to extend into the idea of pop culture dieties for this one. Go big or go home. Why settle for loki or persephone when we can have Elvis or Jerry springer?",
            "All 50 states...  Lost me.",
            "Jesus Christ is coming back all this blasphemy from you guys is sick the trumpets are gonna sound and people are gonna run but have no where to go may his have mercy on the world but we know how evil wicked nd vile this world is god bless you Matthew , revelation , John read those books",
            "I am convinced that the only reason religion is so popular is that it gives people an excuse to hate. and the church are well aware of this",
            "January march may and june are all named after gods, are those not enough?",
            "“Ratified by all 50 states in 1797.”\n\nThat’s some *creative* counting there.",
            "Point of order there's no way all 50 states ratified something in 1797",
            "Only 16 states in 1797, but I agree with the sentiment.",
            "I hate to point this out as I agree with this. But we only had 16 of the 50 states in 1797.",
            "It's not correct. The thing with the 50 states in 1797.",
            "Apparently neither one knows that there were NOT 50 states in 1797.",
            "This guy is not Catholic.",
            "This may be a minor quibble but… pretty sure there weren’t 50 states in 1797",
            "I mean, I’m not suggesting the whole theocracy thing… but I’d be interested in hearing this person’s reasoning as to all “gods” are the same. Unless they are specifically talking about the 3 listed.\n\nThe Jewish God and Christian God are the same God. But I beg to differ that Allah is the same god. I’ve read the Qur’an and it’s not the same doctrine.\n\nIt’s like saying Republican and Democrat politicians are the exact same since they are politicians of the government… even thought they hold vastly different opinions on certain topics. Or like saying German Shepherds are the same as Chihuahuas since they are both canines.\n\nThey are the “same” in that they are monotheistic deities. Yes, many of their stories are connected. Jesus is mentioned in all 3 religions, but to different capacity. Rules and philosophies are different, punishments are different, commandments are different.\n\nI can guarantee I could find similarities and correlations between some South American gods, with that of Roman gods, with that of south east Asian  gods. Totally unrelated and without influencing each other.",
            "“I think all the great religions of the world—Buddhism, Hinduism, Christianity and Islam—all untrue and harmful. It is evident as a matter of logic that, since they disagree, not more than one of them can be true. With very few exceptions, the religion which a man accepts is that of the community in which he lives, which makes it obvious that the inﬂuence of environment is what has led him to accept the religion in question.“ \n\n— Bertrand Russell",
            "The last time the parties of God had it all their way, we called it the dark ages.",
            "I personally worship Slaanesh from time to time.",
            "Sin is awesome",
            "Gob? I saw gob. Anyone else.",
            "There was only 16 states in 1797",
            "Maybe if we spent a month showing the outcasts of society unconditional love, as Jesus did, Christianity might have some real value.",
            "We need more Christians standing against this nonsense.",
            "All 50 states in 1797? I... don't think that's true.",
            "Christmas starts at the end of September now.",
            "I’m Christian. I’m LGTBQ. Church and state should stay the hell away from each other.",
            "Muslims: Hold my biryani",
            "Bros never heard of Lent before",
            "Witch one? There are like 3000 of them",
            "Yeah cause that worked so well in the past. I don't think I know anyone that doesn't wish they grew up 200 years ago instead of today.",
            "As a catholic, allah is the same god as YHWH yeah sure bud i believe you’re catholic",
            "Yeah well, speaking as a Christian, if we could get the Christmas season down to one month, that'd be great.\n\nTired of the \"Christmas starts after Halloween\" nonsense.",
            "My vote is for Viracocha. Creator of all things.",
            "Literally zero chance, that experiment has been tried so many times over for sustained periods of time exceeding a month. Still got us here.",
            "Yeah, I've read the bible.  God can keep his shitty blessings.  In exchange he can just not murder my children or drown me.",
            "Ratified by all 50 states... In 1797.",
            "I just celebrated summer solstice where we burned a bear in a teepee and am looking forward to sacrificing some goats to the corn gods come harvest. Then we got Samhain and the krampus! Ye old gods of Appalachia will be appeased here. :)\n\nKudos of you get the bear reference.",
            "This one\n\nPhilippians 2:10-11\nKing James Version\n10 That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth;\n\n11 And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father.",
            "This one\n\nPhilippians 2:10-11\n\nKing James Version\n\n10 That at the name of Jesus every knee should bow, of things in heaven, and things in earth, and things under the earth;\n\n11 And that every tongue should confess that Jesus Christ is Lord, to the glory of God the Father.",
            "All 50 states? In 1797? Fascinating!",
            "Christmas decorations go up in November....",
            "God must be the most self centered egotistical narcissist ever if “he created man” just so his ego can be stroked on a regular basis",
            "Don't most religions tell you to worship God every day with equal devotion like if you want to dedicate a month to only worshipping god doesn't that go against the god ur worshipping?",
            "We would be much better off as a species if the leading mental illness, religion, just fucked right off.",
            "the one thing incorrect was back in 1796 there were only 16 states the most one, Tennessee being added that year:  \n[https://simple.wikipedia.org/wiki/List\\_of\\_U.S.\\_states\\_by\\_date\\_of\\_admission\\_to\\_the\\_Union](https://simple.wikipedia.org/wiki/List_of_U.S._states_by_date_of_admission_to_the_Union)",
            "There’s never been a theocracy on US soil. Maybe the natives pre USA but never the US.",
            "In Japan we have 8 million (=Infinite) gods so you can just make shit up and worship as you like.\nI'm going with the god of gays. Never heard of it but there probably is one.",
            "Both are equally cringe.",
            "Interesting, considering that not all 50 states were even states in 1797.",
            "Which God? And what sections, rules and paragraphs of the book of that God are we skipping this time for our own convenience?",
            "Are you sure he didn't mean dog? \n\nCelebrating dogs for a month sounds like an awesome idea.",
            "Why celebrate a God that doesn’t protect their own children?",
            "i vote for Ammit.\n\nShe was not worshipped. She was feared for eating the hearts of the unworthy dead, leaving them souless and lost to the void of Duat, the underworld.",
            "Coyote of course.  We need more common sense than currently exists in politics.  Who else can point out the errors and laugh hysterically while we faceplant, then still have empathy?",
            "Flying Spaghetti Monster?",
            "Dionysus of course, the gayest of gods. Besides wine, the god of intersex and transgender people.",
            "Why not Zoidberg?",
            "Zoroaster was the prophet, his God was Ahura Mazda.",
            "Mut... Nut... Khnum... Ptah\nNephthys... Nekhbet... Sobek... Sekhment\nSokar... Selket... Reshpu... Wadjet\nAnubis... Anukis\nSeshmu... Meshkent... Hemsut... Tefnut\nHeket... Mafdet\nRa... Mut... Nut... Ptah\nHemsut... Tefnut... Sokar... Selket\nSeshmu... Reshpu... Sobek... Wadjet\nHeket... Mafdet... Nephthys... Nekhbet... Ra\n\nMade me think of prince of Egypt lol",
            "I think this is actually a pretty good response to a lot of religious people. Like, pretend to agree with them and then be like \"oh, oh, I thought we were talking about bringing Anubis back to school\" and they have to have a moment of discomfort where they think about it. \"Uh, no.. you know... the real god.. god god.... not one made up by someone else somewhere else.\"",
            "Cthulu bruv. Now drink your ink.",
            "I'm down for Bastet. Because what cat wouldn't want chin-scritches?",
            "Can we go with Hathor. She was pretty hot. ",
            "![gif](giphy|Q9pg5fy7U0KzK)\n\nPastafarianism rules!!",
            "Flying spaghetti monster\n\n![gif](giphy|W5xQQca9pAXoACg1S2)",
            "Wait Coyote is a deity? I thought they(he?) was a figure, like the spider Anansi",
            "flying spaghetti monster of course",
            "Odin. One should follow his local gods.",
            "BAST.\n\nWe all need Bast. Everyone needs more cuddles of cats* in their lives.  And Bast is the perfect god to invoke when you want to clear the rodents and pests from your life.\n\n*  *(I don't care what the official word is. Any group of cats is a \"cuddle\".)*",
            "Quetzalcoatl? Hurakán? Thor? Ra? The flying spaghetti monster?",
            "Gozer. It has got to be Gozer. 😀",
            "Rayquaza? The Scarlett King? Chthulu? Izanagi? Veles? Behemecoatyl? Lucifer Morningstar? Huītzilōpōchtli? The Dagda? Lugh? The Triforce?",
            "[I'm just going to leave this here.](https://youtu.be/l3fAcxcxoZ8?si=EESS1sOYGhuDOKzZ)",
            "I’d go for Ulfar, the Norse god of tidiness.",
            "Kali",
            "How about Hextor, Gruumsh, Nerull or St. Cuthbert???",
            "There are at least 6000 to choose from.",
            "Coyote wins by a nose.",
            "Sure as hell ain't the Flying Spaghetti Monster. He's cool with Pride Month.",
            "Kratos…",
            "I vote for Set, Lord of Semen!!",
            "Hermes. A god of Medicine, Communication, and Money is a very powerful one today.",
            "Bahamut? Takhisis? Pelor? Vecna? They're not giving us much to go on.",
            "There is only Zuul",
            "Ba’al, Hathor, Ra, Apophis, Osiris, Heru-er, Seth, Sokar, Nirrti? They’d be pretty let down and bummed if any of the Goa’uld “Gods”/System Lords did beat SG1 and the SGC and enslaved Earth (which includes America, in case they don’t understand that). \n\nThey might end up going the way of Kinsey if they told any of those Gods there was only “one true God” like he did.",
            "You know what, a hundred years of this place being run by Coyote and I'd bet we'd get our shit together in one way or another. I'd support it.",
            "All in for Marduk!",
            "not to forget all the different denominations",
            "The only right answer here is Quetzalcoatl.",
            "Anubis here. All I can say is, furries.",
            "Baccus and Venus",
            "Ackshually ☝️🤓, Zoroaster isn't a god, but a prophet. The god of the Zoroastrian religion is Ahura Mazda.",
            "Conservatives view their God and their skin color as \"default\"",
            "Marduk FTW",
            "There is only zuul",
            "Jeff,  it's Jeff.",
            "Lesbos, obv.",
            "His Noodliness, the Flying Spaghetti Monster.",
            "I was gonna say, there's a few more than the three mentioned.\n\nI vote for Ahura Mazda, while we're at it.",
            "The Force. Bring forth the Jedi!",
            "Trade Offer, we’ll stop watching TikTok if they’ll stop watching Fox News",
            "Came here to say this too",
            "What do you mean?? I thought they ratified them posthumously upon entry into the Union?!?!",
            "States ratify amendments, treaties are approved by the Senate.",
            "There were 16 states in 1797 lol",
            "Errors like that will usually invalidate a reasonable argument...",
            "The Louisiana Purchase hadn't even happened yet",
            "I take their point but yeah. My state didn't even exist until about 100 years ago.",
            "Condition of joining the union.",
            "Time travel.",
            "Came to comment on this.",
            "No obviously not lol but it was ratified by the Senate at the time, probably what he should have said.",
            "To be fair,whether that statement was accurate or not, or even right \"in principle\" their kind has a confirmation bias so big, it doesnt matter. They reject facts, science and history.",
            "I noticed that myself and thought \"i like and agree with everything being said here,  just one teeeeny-tiny little correction...\"\n\nBut now I want to look up the treaty of Tripoli.",
            "In 1797 we hadn’t yet admitted Alaska and Hawaii, so I think it should be 48 states.",
            "Yeah,no. I don’t disagree though",
            "Every day is a saints day  sooooo many saints so few days. Then the important saints celebrated outside the local area and high holy days and and and ….. the list goes on",
            "How about just Lent? 40 days right there!",
            "This is one of the things that growing up Christian and then realizing I was a lesbian really started to stick out to me. If God \"made me in his image\" and gave me free will, then God made me as I was supposed to be (a lesbian) and the free will granted to me gives me the authority to live as such.\n\nYet then there's these rules set in place that I'm not supposed to do x, y or z because I'm a lesbian (as God made me) and I'm suppose to be miserable so God can be happy? What kind of demented, fucked up thought process is that? Just feels like some petty, human bullshit to me.\n\nIf there is a God, that's sure as shit one I don't want to worship because they come across like a sadist.",
            "Stephen Fry said it well: https://youtu.be/-suvkwNYSQo?si=phD0SFEMlnJhecZQ",
            "Agreed. I once had to deal with a preachy relative who was so up their own butt about what God believed that I had to cut them off with something along these lines.\n\n\n\"Funny how your interpretation of our lord is one that 100% agrees with you and only you. Sounds to me like you're trying to create God in *your* image.\"",
            "If even half of what's in the bible is true, the christian god is flat out evil and unworthy of worship.",
            "More celebrated by Visa and Mastercard than anyone else though...",
            "Easter as well in april",
            "*knock knock*\n\nShould we even celebrate Christmas, or birthdays for that matter? The only people who celebrated them in the Bible were heathens and the celebrations didn't went well...",
            "they get one day a week dedicated to observing their religion. Over the course of a year that 52 days, my math is a bit rusty but 52 is greater then 30.",
            "Same- and then went on to read ‘tacitly’ as ‘tactically’ 😂🤦‍♀️ I don’t know if I should put my glasses on or if subconsciously I just accept religious aggression as historical fact",
            "Fuck your stupid pumpkin. All hail the Grand Macaroni!",
            "Hell yeah!!!",
            "Sunday and Monday only.",
            "Odin gets one a week, so does Thor. And Mars. And Venus. And Saturn. Take your pick.",
            "How about just don’t be a jerk to one another. No gods needed. Also doesn’t require thought crimes - aka punishment for non-belief. What is this? North Korea?",
            "Except that weird period with Cromwell",
            "To be fair, Odin promised to vanquish frost giants and last I checked there weren’t any frost giants around so my vote is for him.",
            "But what of those who follow Khonshu, and his fight to prevent Ammit from returning?!",
            "Also Coyote always had a great sense of humor.",
            "Coyote & Raven, 2024!",
            "Wile E? I could get behind that. Seems like my life. Where do I get my Acme pulpit?",
            "Nah, go OG and go with \"Bob\". \n\nYou too can pull the wool over YOUR OWN EYES!",
            "Apollo did his part too for the twinky bisexuals",
            "Nah, nah, Heracles is where its at. God of Strength, Fortitude, Patron of the Gymnasium AND is famous for having an ENTIRE temple dedicated to one of his MANY boyfriends that gay guys would go pray to? Yes please",
            "I have a Mazda MX-5. Can I still become an Asharan?",
            "By the might of Horus, you must kneel before us!",
            "Just gonna leave a link to [THE BEST VERSION](https://www.youtube.com/watch?v=gqlNY5iX-nA) of that song here.",
            "I̷̡̢̧̢̛͚͙̲͍̪̗͖̳̯̩̗͙̭͕̻̰͖̖͇̺̠̰̲̥̹̩̼͎̜̗̹̭̰̙̩̱̫͈͖̮̪̙͔͙̩̖͕̻̻̯̪̼̩̠̩̝͕͕͎̤͍̟̪͙̱̪̯̻̟͍̻̽̀͒̑͑̋͑͒̿̿̅͒͛̃̉̆̀͌̒̿͌̿͜͜͜͠ͅͅä̶̢̡̲̫̘̺̲̗̠͕͓̙̱̤̖͓͍͔̼̹̳̗̣̪̜̲̳͖̮͎̰͕̣͉͎̜̞̗͈̻̤͉̩̠̦͙̮̣͉̪͈̱̥̙́̍̀̽́͜ͅͅ,̴̡̨̧̢̡̛̛̻͓͖̩͖̤̜͓͙͙̹̭̠̺̝̮͇̦̭̪̞̺̮͖̩̳͕̏̽͐̓͂͒͊̿͛̎̌̆̓̓͋́̉͛̅͊͂̈͒̂̓̏̀̈́̄̓̾̆͋̌͌̈́̊̓̄̓̇̔̉̾̚̕̕͜͝͝͠͠ͅ ̴̧̡̢̢̧̧̢̧̢̹̠͍͇͉̣͕̪̠͙̺̘̥̻͇̫͎̜̼̩̯̥̜̱̥̫͍̳̰̠̮̜͖͎̲͙̩̙̲̟̠͉̭̼̦̘̳̞̙̰̩̜̩̝̫̩̖̫̮̱͇̞̔̃̓̆̔̃̍̚͜͜͜ͅͅC̶̡̡̡̯̼͍͎̬̹̩̙̱̮̪̯͖̗͙̞͓̳̦̪̠̲͎̬̩̹̠̼̦̾͌̍̀͛̋̂͆̅͐̓̈̊̔͗̀̔͋̐̅̈́͠͠͝͠ͅt̷̢̨̛̛̛̛͈̭̺̥̩͓̺̳̘̝̏̽̈́͐͛̒́͆̇̿̂͂̈́̈́̈́̃̈́̓̈̾͑̈́͑̅́̎͗͌́̓̒͊̈́͒͂̈́̚̕͘̕͘͝h̴̨̢̧̡̡̢̡̛̙̱̹̝̮̪̯͍͚̯͉͈̘͕͎̖̱̫̞̬͍͖̲̮̩͇̩̳̬̤͕̬͓̬͍̫̣̯̹̮͖͍̼̗͙̯̪̞̪̥̞͚̹̳̫̬͙̦͔͕̰͋̇̎́͂̎̋̅̑́̿͆͛͗̈́̈́͊͆́̔̓̀̇́͗́̋̓̃̋̿͒̄͛̃͂͗̈͂̈̽̑̌͋͆̈̎̃͛̒̾̀̇͒̍̀̈̌̈͂̋̎͒͌̑̌́͆̈̓͋͗̈́̀̐͑̕̕͜͜͜͜͜͠͝͝͝͝ͅͅu̵̡̧̧̨͍̘̹̬̜̩͚̝͎͓̝͙̥̘͎̼̥̠̲̦̹̠͖͚̦̬̟̳̙̣̥̬͇̗̲͔̪̬̻͔̣̣̘͈̫̱͈͖̙̰͈̜̺̠͖̻̙̰͎̖͗́̄͋̏͗̐̇̈́͆́̍̇̀̚͜͝͠ͅl̴͕̦̣̹͙̜̮͙̯̘̹̖͈̗̻̪͈̀̇̃̆̉̎̈́͗̀̐̿̓̂̒̑̀͒͒̽̉͊̈̑̅̾̂́̈́͛̈́́̓͒̏̍͛̎̉́̀̑̂́͑̒̚͘̚͝h̴̞͉͔̟̗̲̰̝̤͇̹̦̮̬̰̝͚͇̲̮̲̮̘̓̄̋̃͌̀̐͂̂̈́̀͌̄̐̊͌̓̊͌̈́̓͐͌̾̏͛͌͗͋̃͒̅̏̄̓̔́̍̂͂̆̌̿̍͆̄̎́̓̇̃͛́̕̕͘̚̕͝͝͠͝ų̷̨̨̨͉͈̤̟̜̺͔͚̤̳̼̭͔͖̻͈̭̭̟̣͖̼̮͍͕̗͓̼̱͖̺͕̟̫̹̺̣̖͍̦̱̞͈͇̫̣̭͇͕͇̱̩̩͚̭̩͔͖̦͙̦̰̜͍͚̱̣̯͕͖̩̖̲̳̦̳̐̈́̓͒̾̌̈̆̉͌̽̽̚͜͜͜ͅ!̴̢̧̧̢̧̢̡̢̨̢̡̛̛̣̭̺̪̞̼͙̝̫̺̳̦̩͓̟̰̤͎̥̞̘͖͙̰̳͚͉̗̳̬̤̬̫͚̫̪̭͕̠̪̘̰̈͆̔̊͊̓̅̔̎͑̄̋̾̈́͊̑̊̾̋͒̔͊̎̆̉̇̐͛͑̊̅̂̏̀́̈͒̎̽͂̏̂̊͗̓̊̎̌̋̎͐̅̒͌͗̏̓̐́̆͛͐̈͒̍̅͆̑̀̚̚͘͘̕͜͜͜͝͝͝͝͝͠ͅͅͅ",
            "Was looking for Bastet. Or Freya, who rides in a chariot pulled by giant cats. Either way, cats need to be involved.",
            "You just gotta be careful lest she turn into Sekhmet on you",
            "We'll worship Set, and Kleenex will be worth more than Nvidia.\n\n(Seriously though Islam, Judaism, and Christianity all worship the same god.)",
            "Of course Coyote is a deity. He must be immortal for all the times he's fallen from cliffs, or blown himself up in pursuit of the Roadrunner.",
            "Anasi was originally a god of stories",
            "Deity as a concept doesn't necessarily mean the same thing to everyone, but... yes.",
            "Around here that would be Grandpa Thunder, Brother Wolf, Brother Bear, Old Man Coyote, and the rest of that crowd.",
            "There is no president, only Zuul.",
            "If anyone asks if you're a god, always say, yes.",
            "I vote for Hermaeus Mora",
            "Never known a Space Wolf marine to be tidy but works for me",
            "My vote is for Paladine. Failing that, Lolth",
            "Fuck that, Tiamat all the way!",
            "That’s how we get Star Trek future, you know how bad I want Star Trek future and not the Mad Max future we’re headed twards",
            "Me three …",
            "I don't think that's how you use \"posthumous\"",
            "Sir, this is not the Church of LDS.",
            "\\*retroactively.",
            "And there weren’t 50 states then.",
            "I am the senate",
            "I hate that argument style so much, it grinds my gears so badly. “Oh what’s that? A reasonable and well thought out argument with factual data and logical conclusions? Too bad you misspelled a word and now I’m gonna hit you with a clown emoji and invalidate your statement to all the braindead iPad babies who would otherwise read it and maybe learn something.”",
            "No, in a debate you should take the argument they meant to make, not the one they accidentally did. It's called charity, and it's a huge part of not being a dick when you're debating someone. \n\n\nIf you wanted to argue against ops point, you'd mention something like that treaties aren't ratified by the states. There's no need to try to invalidate someone's argument by being a smug pedant.",
            "That would be an unreasonable response to a minor oversight that does not in any way affect the validity of the argument as a whole. \n\nNow I imagine there are plenty of dishonest people that will try, but that isn’t the same thing as invalidating it.",
            "Youre kidding right?",
            "A+ troll here",
            "No, yeah",
            "Good thing they make sure to let us know which Holy Days are *obligations* and which aren't. Always sucks when yours is taken off the list.",
            "If God hates Gay folks so much why does he keep making them? Still waiting for this answer…",
            "I mean I make the literal argument that I am as God made me(I'm trans) and they have set forth this as my challenge of life. Who are you to define how God made me. This was my response to my Mom trying to tell me how God made me.",
            ">*How dare you? How dare you create a world to which there is such misery that is not our fault. It's not right, it's utterly, utterly evil. Why should I respect a capricious, mean-minded, stupid God who creates a world that is so full of injustice and pain. That's what I would say.*\n\n>*Now, if I died and it was Pluto, Hades, and if it was the 12 Greek gods then I would have more truck with it, because the Greeks didn't pretend to not be human in their appetites, in their capriciousness, and in their unreasonableness … they didn't present themselves as being all-seeing, all-wise, all-kind, all-beneficent, because the god that created this universe, if it was created by god, is quite clearly a maniac … utter maniac, totally selfish.*\n\n>*We have to spend our life on our knees thanking him? What kind of god would do that?*\n\nFor those that can't listen to the video right now.",
            "Nobody even cares about Happy Honda Days anymore",
            "Yeah, but Easter doesn't always fall in April. Just this year, it was in March.",
            "Janus, Februa, Mars, Aphrodite, Maia, and Juno all get a month already, too. Not just one month but 6 months spent celebrating a good each.",
            "The only SkyBro that keeps his word.",
            "I would vote for either modern pop culture iteration of Odin for official Deity—Sir Anthony Hopkins seems like a cool dude, and I love Ian McShane any day of the week.",
            "Only because the radical frost giants who wanted to destroy everything wouldn't vote for him or kiss his tushy and they kept saying mean things about him.",
            "Lisa, I'd like to buy your rock.",
            "Nah, Odon just kicked them off midgard, they live in Jotunheim and cut off means to access the other realms so no one realised he was playing both sides.",
            "To be fear, the fire jotunn are the bigger problem as the harbingers of Ragnarok. And I did see a fire jotunn digging through my trash and sending my neighbor to Valhalla yesterday.",
            "I mean Odin sacrificed his eye to gain wisdom, I'm down with the Odin. Better than the know nothing chucklefucks we're dealing with today",
            "<Moon Knight has entered the chat>",
            "Additionally an unlimited line of credit at the Acme company.",
            "The SubGenius must have Slack!",
            "https://preview.redd.it/oyp767zc808d1.jpeg?width=138&format=pjpg&auto=webp&s=1f5f50e52463c99d3d1f31e0fd16e367ce8f0ac1",
            "Apollo is a bit of a dick though. and if you're unlucky enough to get his attention, and he wants to date you, you're basically guaranteed to die or be turned into a tree or a flower or some such shite.",
            "Except he murdered his wife and kids, yeesh",
            "Sick",
            "Kneel to our splendorous pooooooweer!",
            "Horus heresy was pretty nasty..\n\nBut he had the chaos gods behind him, must have been a good guy.",
            "I maintain my belief that all kitties just want chin-scritches. :3",
            "And he's a fucking prick.",
            "Such a wily fellow.",
            "I honestly thought Coyote was referring to the Native American trickster...",
            "Um... Are they not still?",
            "Eilistraee or Selûne are pretty good ones too.",
            "Paladine? All true Dragon god worshipers know that Bahamut is superior, you heretic!\n\n...wait, they're the same deity? (/s, obv)",
            "Star Trek future is best future.",
            "A friend of mine is adamant that the Star Trek future and Mad Max future aren’t options, they’re steps. Mad Max future is a step on the way to Star Trek\n\nNot sure I fully agree, but it’s an interesting alternative",
            "The 21st century was an absolute shitshow in Star Trek.",
            "How about a Water World future? I just want to hang out on a boat with Kevin Costner.",
            "It’s probably going to be more like Fallout than Mad Max, but maybe Mad Max is the Australia-specific result of the Fallout world? Stay tuned to learn more",
            "Me four …",
            "Can it be the church of LSD?",
            "Cult. You meant Cult of LDS.",
            "California became a state in 1850, lol.",
            "Or the ever popular \"cope/copium\" which really means \"I have no way to argue back so I'll just say this meaningless buzz word and feel like I've won\"",
            "I could go either way on this. On the one hand, you're right that it was probably just a mistake. On the other, they didn't misspell a word. They make a factual error and when you get a fact wrong, whoever you're arguing with will latch onto that one mistake like it was their mama's teat and won't let go of it. Especially these Bible thumpers. Even though, \"facts\" only matter to them when their gods tell them a \"fact\" like Noah and his animal porn boat or, Jonah and the swallowing whale that has no stomach acid for some reason.",
            "I generally agree, but I think it also depends on the context and error.\nSpelling mistake?  Not a big deal, unless you are arguing about language, then i might wonder how much of an expert you really are on the subject...\nOr if you got the number of states wrong, it doesnt automatically invalidate the point.  But if the point being made is about US history, I might start to wonder how much of a historian you really are...",
            "You sure aren't gonna get elected anywhere these days with that attitude.",
            "Are you suggesting Hawaii and Alaska aren’t the most recent states??",
            "Indeed",
            "Sarcasm is hard",
            "The greater argument is also, can God not change? It's only mentioned once in the Bible, god changed after Christ was killed. So by all accounts, he's not static. He can and will change with time. Thus, if his 'self' changes, suddenly humans change as we are made in his image. \n\nThe fact that religions try to be streamlined and unyielding is wild. Gods will can change on a dime because by all accounts, he's a 'living' being. You change. I change. He by all accounts, can change and scriptures prove it. The big issue is the human element on interpreting that 'change' because its not like he's gonna come down and say \"this is who I am now humans, deal with it! It's not a phase!!! It's my way of life!\" \n\nIf you look further back, God as actually changed many times. It wasn't God, who is now jehova (to Christians), who was yahweh(hebrews), who was ba'al(canntines), who was... the lost goes on... but they are all the same figure, depending on which scripture you use. And their 'personality' is wildly different. Fun fact; the ancient Hebrews tried to say baal was actually the devil and a completely different god to yahweh. Because they weren't fans of the canannites. Then the two cultures merged and baals name got dropped all together due to the negative stigma the ancient Hebrews used baal for. Remember the plagues in Egypt? Yeah, that wasn't yahweh, that was baal. They invoked baal because they felt yahweh would just nuke everything indiscriminately. As yahweh is known to do. Remember, yahweh made them wonder the desert for 50 years for not trusting him enough. You really want that god smiting your oppressors? He'll smite them so hard, it'll include you and you better be fucking grateful. Or he might just smite you harder than the oppressors!",
            "ah, yes; thank you for thinking of that when i didn’t. (apologies for not having that included in my first comment.)",
            "Is Toyotathon still a thing?  Where everyone jumps?",
            "I pray to Rick Sanchez, but technically he's Odin too. Vote Odin as the USA's new patron diety today!",
            "I’m stealing that word.",
            "Although I will admit that the W. Morgan Sheppard version of Odin or BRIAN BLESSED would also be acceptable.",
            "he built a wall and made the frost giants pay for it?",
            "<Jake Lockley enters the chat>",
            "Eternal salvation or 3X your money back!",
            "https://preview.redd.it/gu9c4mz7t08d1.jpeg?width=2088&format=pjpg&auto=webp&s=1f1536c9916a41b29ccdc2e3b7395eaf19249a27",
            "Better than catching the attention of Zeus or Poseidon. \n\nReally if you catch the attention of any of the male Olympians you'd better hope that it's Ares since he is the only male Olympian not to have assaulted or tried to assault any of his infatuations.",
            "Yeah, and Dionysus had a tendency to turn his female worshippers into madwomen whipped into an ecstatic frenzy of lust, rage, and intoxication.\n\nI mean, pretty much every one of the members of the Dodekatheon were dicks in their own ways excepting Hestia.",
            "About the only Greek deity male, female, or other, that *isn't* a massive dick is Hades, and even then that's only if you go with the older version of him and Persephone where he went to Zeus and asked for her hand in marriage (as was proper at the time) and Demeter was a drama queen throwing a hissy-fit, rather than the later version where he abducted her.\n\nI tend to prefer the older version both because it's older and because worship of Persephone as an underworld deity in Greece actually predates Hades, so her being the willing queen of the underworld after he gets written into the story makes more narrative sense.",
            "I mean, Hera literally drove him into insanity. And wouldn't undo it, so his grandmother Rhea had to undo it.",
            "You put up a fuss.",
            "r/whoosh",
            "I did also.",
            "Used to be god of stories, still is, but used to, Too.\n\n-Mitch",
            "🖖",
            "Star Trek canon has [WW3 run from 2026–2053](https://memory-alpha.fandom.com/wiki/World_War_III) and wipes out 30% of all humans.",
            "I do think it's interesting, though I am curious how we manage to terraform Earth in the 300 to 400 years from now time frame of Star Trek",
            "And my axe…",
            "Yes please!",
            "Be a lot cooler if it was!",
            "Colbert said it best- it’s “truthiness”  - it’s not true, but they feel that it is and that’s good enough for them.",
            "Animal porn boat.  Love it",
            "A sad truth. ",
            "No im suggesting in 1797 there were 16 states not 48.",
            "We weren’t even close to 48 states in 1797.",
            "That last bit really explains the whole suffering is the point mentality a lot of rigid Christians I've met believe. Like everything is through the lens of suffering. You haven't suffered enough, and that's why your life sucks.",
            "I’m waiting until next Memorial Day, not to honor the fallen soldier, but to get 20% off on the price of a couch.",
            "Move away, peasants. I only go to the Lexus December to Remember event. /S",
            "Is he related to the Dirty Sanchez?",
            "\"If God exists, its fkin' me!\"\n\n-Rick Sanchez",
            "Yeah, Rick Sanchez might be the one god I would trust less than the christian god.     \nFun to watch, but I wouldn't even go drinking with that heartless bastard.",
            "The slimline creator.",
            "<Jake Lockley leaves the chat>\n\n<Marc Spector joins the chat>",
            "Hades was pretty chill actually. besides Persephone(who iirc some interpretations say the kidnapping was instigated by Zeus)and even then, to my knowledge, Hades was faithful to her without exception.\n\nArguably, Hades was one of the few(if not only) greek gods that wasnt somehow horrible. xD",
            "Speaking as a Dionysus worshipper, getting whipped up into an ecstatic frenzy of lust, rage, and intoxication is a *feature,* not a bug. You just have to find a safe outlet for it, like a festival or a theater stage.",
            "You put up a fight.",
            "Damn you, autism! **shakes fist**",
            "No, this is Patrick.",
            "I will never forget watching Newt Gingrich saying in a live interview from the 2016 Republican National Convention that the crime statistics showing a marked decrease in crime doesn't matter, what matters is Republican voters *feel* that crime has run out of control. \n\nLike, no shit Newt, they *feel* that way because every Conservative media outlet hammers their audience over the head with a nonstop barrage of The Blacks and The Browns and The Gays and The Commies are burning down American cities every single day, and *your* city/town/village/farm/hermit hole is ***NEXT!!!***\n\nWe need laws against politicians, political entities, and media outlets brazenly lying. Freedom of Speech topped the Bill of Rights to prevent government from persecuting citizens for criticizing said government. It was never intended as a shield for political entities to foment fear, hatred, insurrection, and dissolution of the Union through lies and brainwashing. It was never intended to be a weapon used to turn a secular representative democracy into a fascist theocratic dictatorship but that's exactly what's happening right now.",
            "But Massachusetts is a Commonwealth.",
            "You had exactly a third of that so in a mathematical sense, that’s kind of close, right?",
            "Yeeeaaaah... God is a bit if a bastard to humans. If you can find one story where god was chill with humans in the bible, id love to know it. He had his favorites, but they got the raw end a lot of times too. And typically only got bailed out by angels, not by god. Angels are supposed to work for him, but a lot angels were cast down because they did big no no things. Like uriel, the angel that taught us how to make fire. Or azazel, who taught us how to make weapons, armor, and accessories. All while technically working for god. Before eventually being cast down. And of course, the most famous angel, lucifer. Your own right hand turned on you? And you missed it? What kinda god knows, let's it happen, and punishes everyone, when he could change it? Sounds like a bit of a D bag. But he did send his Son to die for us this time, instead of nuking the whole planet, a third time. Why'd he need his son to die for that? Someone's gotta suffer. Don't worry, when his son comes back, shit is gonna be far worse than the nuclear option...\n\nJesus was a good guy for the most part. A great guy, barring a few exceptions. He was a bit of a racist at points. But outside of the clear and obvious looking down on 'lower' races thing, was a really 'cash money' kind of dude. And he had a lot of really great ideas. Outside of the race stuff, again, that can't be overstated. Hed still help them, but it was very begrudgingly done. Because they needed help, and he could help them. As he was the only one willing. But he wasn't skipping over to help them.",
            "Mattresses are 50-75% off. Get one of those too.",
            "On the central finite curve, at least.",
            "I fucking love you guys.",
            "<Marc Spector leaves the chat>\n\n<Steven Grant joins the chat>",
            "Sir, this is a Wendy's.",
            "I REMEMBER THAT!   I can see the exact shot.   And you KNOW HE BELIEVES WHAT HE’S SAYING.\n\nIt made me absolutely bananas level mad.  Still does.",
            "Who is she? Is she hot?",
            "Shit! Banana levels? Walk away slowly folks...",
            "I like her bangs.",
            "I, too, choose this guys bangs."
        ]
    },
    "God gave you will to make your own choice ": {
        "title": "God gave you will to make your own choice ",
        "score": 5837,
        "url": "https://i.redd.it/t7mhie6x3w7d1.png",
        "content": "",
        "num_comments": 149,
        "comments": [
            "Wait until she learns god gave her a clitoris too.",
            "Look at your bodies, men! Penis, balls, and an ass. God created you for the magnificient job of being a femboy with a boypussy! What can be more important than this?!?!",
            "Well the breasts were full of cancer and had to go. And so the cancer doesn't come back I also had to say good night to my ovaries. Can I just use my brain now and do whatever the fuck I want?",
            "That bitch is _terrifying_, and I say that as another woman.",
            "You need a PhD to do that?",
            "Pretty ironic her name is “The Transformed Wife”. Pretty sure those christians aren’t supportive of trans rights.",
            "Her comment is a bruh moment, God gave people Free Will.",
            "Don't think future local caliphate will be that keen on that...",
            "Isn't there something about if thy right hand offendeth thee cut it off, or some shit?",
            "Look at your bodies, women! You have a tongue, a stomach, a digestive system! God created you for the magnificent job of eating food!\n\nJust because you have parts that facilitate some function, does not mean that it's your sole purpose. I have all the parts necessary to stalk someone down and chew off their fingernails, doesn't mean I'm gonna do it.",
            "I have breasts that can be cancerous at any time (direct genetics), and cystic, possibly-cancerous ovaries and a uterus that also conspire against me! YAY, IMPORTANCE OF BEING A WOMAN!!! (I wish there were a \"jerking-off\" emoji to show disdain)",
            "If you applied that same logic to men we’d have to all be castrated and thrown in jail. Logic fail.",
            "Idk who Ann Strahm is, but she is my hero for that quote",
            "The Transformed Wife?\n\nWhat was she to begin with?",
            "Fucking retarded! Boo!! Booo!!! Get some real content!",
            "She never even mentioned men so that servant quip is just projection",
            "But where did she said they have to be servants for men?",
            "Agree with the first part of her response, but dont understand what the \"slaves for men\" was for. The original tweet doesn't speak to that.",
            "I would not brag about getting a PhD in Gender Studies",
            "The amount of people who hate themselves so much to reject life being the greatest purpose is astounding",
            "You can have a brain and still be a mom, but y'all don't wanna admit the real problem is you don't wanna be a mom (I genuinely don't blame you, the world sucks and refraining from bringing new life into is the merciful thing to do as well as saves you lots of heartache, soul crushing, and money. The world is not fit for children anymore.)",
            "Wow. I thought I am as liberal as it comes, but, isn’t what she saying true ? Women’s bodies are made for creating  and nurturing life.  We are all here because some women gave birth to us. That’s not to say that is the only thing woman are made for , they are made for everything a man’s body is ,but it is also made for giving birth . . . .",
            "I get the feeling from Ann's response that she isn't a very happy person not very inclusive.",
            "Aww. Victims are so cute when they signal😂🤣",
            "God never said that",
            "No she has a point. There is nothing more important than giving the gift of life. That doesn’t mean you can’t do other things and be successful as well, though.",
            "God have her a brain but she’s obviously not using it.",
            "The devil's doorbell!?",
            "\"God\" put pleasure points in the anus of women AND men. It's their plan and intent!",
            "The thing was conservative claimed they just wanted the freedoms to do traditional things but these MAGA fascists want to impose their beliefs on everyone else, by force.",
            "God created you for the magnificent job of porking everything in sight! Women, men, fleshlights, the couch fold, GI Joe with Kung Fu Grip!\n\nI love how when bad shit happens Christians are all like “it’s all part of God’s unknowable plan” but when it comes to this, his will is apparently crystal clear.",
            "Why did God give men a prostate if not to do butt stuff!!???",
            "Well…I would think the people who use said boypussy is\nImportant too…",
            "Yes and unless you have please stop being annoying or atleast leave me out of it",
            "The only thing she has transformed into is a doormat.",
            "wasnt that technically satan",
            "You can choose a ready guide in some celestial voice\nIf you choose not to decide, you still have made a choice\nYou can choose from phantom fears and kindness that can kill\nI will choose a path that's clear, I will choose Freewill",
            "Basically all of the The Transformed Wife's content is around being a \"Trad Wife\", ie a \"traditional\" stay at home wife that is subservient to the provider husband.",
            "Men wrote the Bible to make women subservient to them…",
            "Using her own brainy powers on that one",
            "According to what is it the greatest purpose? How do you arrive at this conclusion?",
            "Yes there is: For ppl who don't want babies, having fun or whatever else they want to do is and will always be more important than \"giving the gift of life\".\n\nThere is absolutely nothing wrong with never having babies because you just don't want to, and there *never* will be anything wrong with it under *any* circumstances.",
            "Ringing the devil’s doorbell does not a Calm Box make!",
            "The scream I scrumpted oh my god",
            "One of my favorite euphemisms",
            "Checkmate boomers, we made it gay.",
            "Amen, men!",
            "Then stay out of it, o doubt people are physically dragging you to these conversations, get over yourself",
            "I don't even know who you are",
            "![gif](giphy|cIIH4mTW6khMVLlKEQ)",
            "Bro who hurts you.",
            "That’s insulting to doormats",
            "Nah, Satan guided them to the knowledge of right and wrong. Something that god was very mad about.",
            "Nah that was God, Satan just presented Adam and Eve a choice (or manipulated eve to make a choice depending on who you ask). And then God gave consequences for that choice. ",
            "No, God gave us free will, why? Because he doesn't want us to be robots, he wants us to enjoy life, but at the same time it is our choice if we love each other like he tells us or not at the end of the day.",
            "Did not knew that, but then i'm not on Twitter at all and i sure dont want to.",
            "You wouldn’t be here if it wasn’t a thing…. No drs no scientist no not anything without it. Name anything else that everything stems from. Creating life is literally everything",
            "Idc if you have kids or not",
            "It sounds like a sad attempt to flex having a PHD?",
            "Psssttt… god’s not real. Pass it on.\n\nEDIT: Awww... the \"atheism is as logical as flat eartherism\" guy deleted his comment. Come back to us baby, we miss you.",
            "I don't understand how it proves that it is the greatest purpose. I just understand that it is a necessary mean to achieve something else?",
            "> Creating life is literally everything\n\nBullshit. The sun would still be fusing hydrogen if life had never started. There'd still be comets, eclipses, volcanoes, sedimentary deposits, oceans, weather, gravity, pulsars, radioactivity, ...\n\nCreating life is literally a miniscule fraction of everything.",
            "No it's not. My purpose in life is to enjoy my life. Neither I nor anyone else who doesnt want to is about to to waste our lives by having to help make and take care of another just because numbskulls like you think ppl's purpose is to make babies 🤣. Waste of my time and waste of my efforts. \n\nThe greatest purpose of my life is to enjoy it, not waste it behind raising children I don't want. And for women who don't want to have children, the same goes. Not and never be their greatest purpose.",
            "In the ancient times women didn't go on hunts or do battle, not because they couldn't. They did plenty of manual labor at home. The reason they didn't go on hunts and do battle was simply because of risk. As everyone understood the most important thing was to keep the blood line going. It is not because they weren't strong enough, it is because their role was much more important and the risk of losing a woman that could give birth successfully was too great. \n\nLife is much less risky now, but this does not mean continuing the human species is any less important. \n\nPlease by all means get your PHD and educate, but both things can be true.",
            "That's not anywhere in my response. You don't get to tell other ppl what should be important to them and not get told off for your bullshit.",
            "In case anyone was curious what comment that guy deleted, he claimed that Atheism was no more logical than Flat Eartherism. :D\n\nhttps://preview.redd.it/obazp27di08d1.png?width=1328&format=png&auto=webp&s=6c8fea617d9e1f3efa9a059975b98135cce4e784",
            "What happened with \"Respect my beliefs!!!\" ?",
            "You realize your hard atheistic logic is about as \"scientific\" and \"logical\" as the flat earth movement. Keep your religion to your self.\n\nedit: love this-\n\n>[–]Jennyfael 1 point 5 minutes ago \n\n>Well… what are your arguments?\n\n>Because it doesnt make much sense. How does not believing something a religion, especially since that is literally the base of all science?\n\n>Doubt is literally the most science thing to exist. And when you can’t prove something in any way, you must doubt it. \n\nDipshit, you must learn about it and test it. The most science thing to exist? The most science thing to do is actually read comparative religions, study breakthroughs in physics, consider the possibility of God, create hypothesis and try and test everything, rather than shitting on people and declaring them to believe in something that is wrong or false. Fucking fake ass evangelical \"scientists\".\n\nFace it, you have adopted a religion. Your faith has stopped your thinking mind. Be a dear and simply respect the faith of others.\n\nEdit 2: And to \n\n>[–]Fun-Outlandishness35 16 points 10 hours ago* \nPsssttt… god’s not real. Pass it on.\nEDIT: Awww... the \"atheism is as logical as flat eartherism\" guy deleted his comment. Come back to us baby, we miss you.\n\nNo, I blocked you, because you are all very toxic and need to totally step back and recognize that.\n\nAwww, the troll on reddit who proclaims himself a scientific fucking genius who knows what exactly exists across the cosmos can't figure out reddit... awww.",
            "Hahahaha good luck, I wish you the best",
            "From the perspective of people. As in the body of the original post we are commenting on. Straw man arguments are weak. Try harder.",
            "Well good thing your folks didn’t think like you or you would not be able to do all the things you think are more important than what gave you the ability to do those things lololol",
            "There can only be one greatest act. And since nothing else can happen without making and growing life. It stands to reason that it must be the single greatest thing all species have. Good luck! Maybe take a problem solving course or read a book on logic. Or hug your mom",
            "I just meant like on a fundamental standpoint. Like for the continuation of the human race and all. Lmao.",
            "I can still see it tho\n\nhttps://preview.redd.it/56mbalrnw08d1.png?width=1080&format=pjpg&auto=webp&s=440efe61a96dd5b5e5b119b3c31842924f519893",
            "https://preview.redd.it/5w41brh6ry7d1.jpeg?width=500&format=pjpg&auto=webp&s=f62c69d6040fbed381d74333d12ed0b6ee47be60",
            "respectfully, due to lack of any evidence at all, god doesnt exist.",
            "I hadn’t thought of it that way before, tell me more.",
            "Well… what are your arguments?\n\nBecause it doesnt make much sense. How does not believing something a religion, especially since that is literally the base of all science?\n\nDoubt is literally the most science thing to exist. And when you can’t prove something in any way, you must doubt it. ",
            "Any claim that can be presented without evidence can be dismissed without evidence. \n\nUnfalsifiable claims are also distinctly unscientific. You can't disprove the Giant Flying Spaghetti Monster, just like how I can't disprove there being an omnipotent god that acts in mysterious and unobservable ways. That doesn't change the fact that they both fail to disprove both the Null Hypothesis Test AND the infinite other hypothesis's that would result from disproving the Null Hypothesis of \"there are no gods or supernatural phenomena\"",
            "Ok?",
            "That's their problem. \n\nStill a waste of my time and efforts and plenty of things are more important, and no amount of squeaking from anyone will ever change that fact, least of all from you or the grifter above.",
            "Maybe you misunderstood me but I was agreeing with you 😂. Yall Reddit people so defensive.",
            "No. \n\nEspecially then. If the people who the human race would depend on to continue it, or even just some of them who would be needed for it, do not want to continue it, then it doesn't deserve to survive. \n\nEg If there's two ppl left who are needed to ensure the survival of the humanity with their bodies and one doesn't want to, then their consent (or lack of in this case) is worth more and should be respected, more than humanity has a right to survive.",
            "That's not how you have a \"civil conversation\"\n\n\n\nIf you want to even have the slightest chance of \"recruiting\" me, then atleast be respectful. \n\n\nHave a nice day though!",
            "Unlike you, I'm not big in arguing with evangelicals who spout shit but don't even know that their religious beliefs are their beliefs, and not facts. Get a life.\n\nEdit: dude said, “wouldn’t that mean your religious beliefs are just beliefs and not facts?”\n\nYes, now you are getting it. u/trans17YT",
            "Make sure to thank your parents for your existence…",
            "That’s funny. You said both things can be true. I’m saying no. But ok",
            "Your argument doesn’t make any logical sense and I’m not even sure why you’re defending it against me, my claim wasn’t exactly bold.",
            "lol, who says anyone is trying to “recruit” you? You have silly beliefs based on ancient superstitions written by people who didn’t know where the sun went at night. \n\nI am just here for the entertainment, and you did not disappoint. Thanks!",
            "That is fucking stupid, are you kidding me?\n\nAlso wishing you a wonderful day, though.",
            "Wouldn’t that also mean that your religious beliefs are just your beliefs, and not facts?",
            "No. My parents deserve no thanks. \n\nStill a waste of my time and efforts to have/raise children I don't want.",
            "Let's do a thought exercise:\n\nA woman is born without the ability to bear a child, since she can't have kids can she never achieve a \"greatest purpose in life\"? What about men, they don't carry children or give birth, can they never achieve their greatest purpose? \n\nWhat if someone invents immortality; does this become the greatest purpose because reproduction will no longer be necessary? \n\nOr do we think that everything is finite and binary in a universe that has proven that anything is possible?",
            "Talking in absolutes is disingenuous to the complexities of life.",
            "You're trying to say that the ability to give life is always meaningful and valuable regardless of whether of the person who has it wants it or not. That would imply for a person to do something like get rid of such an ability would make that a bad decision. \n\n(Or in the context of TheTransformedWife, that not using it to give life is a bad thing).\n\nOr worst case scenario, my example above. None of this is true. \n\nWhether or not having the ability to give life is valuable depends on the person who has the ability and what they want to do with it. \n\nJust because someone else might think it's valuable (or might say it's valuable *for them* when they are not the one with the capability or the one whose capability is being considered) doesn't give them the right to have control over another or shame them for what they would do with or to their own ability. \n\n(For context TheTransformedWife is an anti-abortion, pro-submissive-christian-wife and Trad gender roles *whether you want to or not*, kind of person. And anti-queer too cuz why not apparently. When she's speaking the above shit she speaks like she has the right to speak for all persons capable of making children whether by incubating them or otherwise. Funnily enough I don't think she even lives by her own words, but that's her grift at the very least).",
            "You're trying to ridicule me into not believing, but I let me tell you it's going to be impossible.\n\n\n\nAnd oh! No problems! I'm glad I made your day brighter, in 1 way or another.",
            "This is my point exactly, only suicidal people can’t understand that the gift of life is at the top of the list. I hope you work through whatever is bothering you and come to the realization that life is the most precious thing we have",
            "Woman born without the ability to create life was in fact created by a man and a woman. Ya know her origin story.. I can’t do a lot of things that doesn’t decide its importance. Get real",
            "Speaking of life, where and how does it begin…",
            "Too long didn’t read",
            "I’m not trying to get you to do shit, I am just poking holes in your statements lol\n\nThis is hilarious.",
            ">You’re trying to ridicule me into not believing\n\nNo he’s not lol",
            "Don't feed the trolls. They're just satanists, fuck them.",
            "The ability of \"Giving the gift of life\" is not, and will never be, the most precious thing all ppl have. \n\nMy ability to do so will be thrown in the trash where it belongs as it is of no use or value to me. And in my life, only what I value for me has any value. So if there's something I have that I say is worth nothing, then it is worth nothing, as it's not like I'm donating it or something. Everyone else should have the right to do the same, shame free. And unlike what that grifter would have ppl think, no one is any less for thinking it's an absolutely worthless or useless thing for them to have/have to do - as they would be correct. \n\nBut feel free to keep thinking it is the most valuablefor everyone, if you want. It's not and that fact won't change. \n\nFor your sake, I hope you're not one of those dumbasses that thinks abortion is murder like the idiot you're defending above does, because I celebrate that that can happen free out-of-pocket and fully confidential where I am, everyday.",
            "Right but we're not talking about origin we're talking about \"greatest purpose\" is the greatest purpose in life specific to humans or all species? \n\nIf a woman is born without the ability to carry a child, than her greatest purpose can not be to give birth because it was never a possibility in the first place. \n\nWould you like me to define \"greatest\" for you to help you reason through this?",
            "It began with the Big Bang, which lead to single cell organisms which slowly became Homo sapiens. Did the single cell organism, give birth to Homo sapiens?",
            "Your problem not mine."
        ]
    },
    "Sooo… nonbinary people are also more like God? Because God is also technically nonbinary, having made man AND woman in God’s image… 🧐": {
        "title": "Sooo… nonbinary people are also more like God? Because God is also technically nonbinary, having made man AND woman in God’s image… 🧐",
        "score": 153,
        "url": "https://i.redd.it/n72oz8cxp08d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "I saw hitler drink water in a picture, should i make that correlation too?",
            "This is one of the silliest memes I've seen lately on FB. Genesis 1:26 was a good comeback. Also, the demons only use the plural when there's more than one of them. Grammar.",
            "Wtf is this",
            "Fun fact in Egyptian mythology, the first androgynous person was created to woo a goddess of death as a distraction. In return they were gifted oracle like powers, but the death goddess also cursed them and their kind to forever be outcasts.",
            "Someone apparently never heard of the trinity. Not a burn.\n\nMan I love it when people who don’t know jack about Christianity find a verse and are like “ooooooh gotcha!!!!!” Reminds me of Covid times when all these people don’t know jack about medical jargon and are like “see 95 percent had a comorbiditity!!! So it wasn’t Covid that killed them!!!!”",
            "You can know everything about Christianity to the last detail, but anyone who uses phrases from the bible to promote or defend an argument isn't all there to begin with. It's all strawman from the get-go!\n\nLike, this is a book about an invisible man who created the universe and everything out of thin air (he needed a rib for woman for some reason), and we're going to make this fairy tale the base point of our commentaries about how people should conduct themselves? Don't get me wrong - there's a lot of nice things in there, but there's also a lot of weird shit in there, and a small handful of some real divisive shit as well.\n\nThere's an over-indulgence in biblical morality and society has taken it too far. The middle ages are long gone. Perhaps it's time to put away this primitive reliance on a book filled with magic and mysticism... because it's childish to continue to believe in fantasy as an adult.\n\nIf someone wants to give themselves a plural pronoun, well...let 'em. Who tf cares that much? It hasn't affected my life in the slightest and I doubt it's affected the most vocal critics to the extent they claim. And if there really is a God, I doubt he/she/they really give a fuck because It doesn't seem to give a fuck about anything else going on in this realm.",
            "So your good w owning slaves - I mean as long as you don’t kill them. Raping a child- ya know, as long as you marry her since she is all washed up. Of all the over 600 commandments, which ones do you overlook. Did you read the original script and translate it yourself? Do you Believe men should not lay with men or the original verse men should not lay with a BOY- and they were specifically talking to priests. Guess that didn’t age well. But you do seem to know a lot since you blabbed on for so long. Bet you got a hard on when Louisiana signed a bill that said the 10 commandments are to be in schools even tho the constitution literally says not to. Oh and so does the Bible ! It literally says to not pray in the streets and show off. But ya know 💅🏽… you know it all . Yeshua would be ashamed. But he also wouldn’t blast u on Reddit",
            "Yup, I’m for whoever wants to use whatever pronouns they wish and I will use those pronouns.\n\nAll I’m saying is this is not a burn because in that context they are talking about God as a triune; 3 entities, so using plural is correct regardless of preferred pronouns.\n\nThey think they have some amazing gotcha but they are just proving they stepped in a territory they haven’t studied.",
            "Making a ton of assumptions, no?\n\nAll I’m saying, which is true, is this is a lame burn, because they are talking about plural entities.\n\nYou ramble about a lot of other stuff but never disputed what I actually said.",
            "I'll break it down for you since it appears you need help. \n\nUsing the fact demons refer to themselves as plural when there's more than one of them/speaking as a collective to imply non-binary people are demons, is actually exactly the same as using the fact god refers to themselves in plural to imply he's a demon.\n\nIt's embarrassing to grandstand like people don't know what they're talking about when you didn't even comprehend the simple logical contradiction."
        ]
    }
}