{
    "New sidebar rule! Keep it Civil! Feel free to disagree and engage in spirited debate but violation of this rule will result in disiplinary action which can include a permaban.": {
        "title": "New sidebar rule! Keep it Civil! Feel free to disagree and engage in spirited debate but violation of this rule will result in disiplinary action which can include a permaban.",
        "score": 94,
        "url": "https://www.reddit.com/r/NewsOfTheStupid/comments/xyda0v/new_sidebar_rule_keep_it_civil_feel_free_to/",
        "content": "",
        "num_comments": 4,
        "comments": []
    },
    "Kyle Rittenhouse’s sister slams him for 'not supporting family to avoid eviction'": {
        "title": "Kyle Rittenhouse’s sister slams him for 'not supporting family to avoid eviction'",
        "score": 244,
        "url": "https://www.the-sun.com/news/11685487/kyle-rittenhouses-sister-slams-brother-not-supporting-family/",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Mother raises an insensitive a\\*\\*hole, and is upset that said insensitive a\\*\\*hole won't help her. Leopards, something something, face. Anyway...",
            "Stop buying that AR toast everyday.",
            "Why don’t they pick themselves by their AR straps?",
            "She ask for help and free money instead of working 3 jobs ??? Communist !!!!",
            "The whole family should settle this by group duel. \n\nThey probably won't like that particular name, but a Mexican Standoff might be a good logistical solution.",
            "Bootstraps",
            "Maybe he can shed a few fake tears for her?",
            "What is it with republicans and free money? They love asking for handouts.",
            "You’d think his defenders on social media would chip in and help!",
            "They just simply need to murder someone, and they'll become overnight MAGA rock stars.",
            "With all that influence from the judges...kind of surprised that Kyle can't seem to influence the judges and such for his own immediate family. It's almost like that don't care because there's nothing politically gained by it.",
            "Who woulda thought a murderous shit smear like Kyle Rittenhouse wouldn’t help his family?",
            "You reap what ye sow...🙄",
            "Why do people still expect conservatives to not be selfish? They’ve prove repeatedly that all they really care about is their own wallet",
            "I’m sure they were a healthy, well adjusted family before being threatened by protests 100 miles away",
            "Pure conservatism.   He got his, therefore....",
            "Did she try shooting the order of eviction?",
            "Aw, he wouldn’t share his right-wing racist bucks with her.",
            "I have no sympathy for anyone in that family. They’re all garbage.",
            "Why are we putting these white trash people on the front page?",
            "So what’s the verdict on this guy? Does he have money or is he completely broke? I can’t get a straight answer on Google.",
            "Why the fuck would she think he was going to be altruistic or decent?  He is an unrepentant murderer.  Probably don't expect too much from him, madam.",
            "The had money to buy assault weapons.",
            "Thots and pears",
            "Sympathy is a word in the dictionary, between Shit and Syphilis somewhere..   literally couldn't care less.",
            "Does he even have money? I thought not long ago he was complaining his mom wouldn't help him with legal bills. He's being sued into oblivion hopefully.",
            "It makes me happy to see his family suffer. They supported him and allowed him to become the murdering asshole he is. \n\nI wish them nothing but the worst.",
            "Is anyone surprised he turned out to be a stupid greedy pig?",
            "Trailer trash…",
            "A lovely family of shitbirds.",
            "\"I literally drove you to the protest to murder someone, why can't you pay my rent?\"",
            "I don’t see her considering prostitution. At $30 a pop, she might find 300 desperate guys in a week.",
            "The Kenosha killer has no money and is gonna be sued",
            "All she did was arm her 17 year old son with a high powered rifle, and drop him off across state lines, at night, where he shot three people.\n\nWhy won’t anybody give these people a job?\n\nBut seriously, start by changing your names.",
            "Maybe their begging would feel more authentic if they reframed the two murders that their baby boy Kyle executed as something far more odious than the “tragic” event.  The little swine is a shameless killer and they should say that. Otherwise, don’t expect a dime and see if you can find a used tent.",
            "Kyle Rittenhouse is 100% proof that some kids need spanking.",
            "What a pathetic duo of women looking to fucking Kyle Rittenhouse for help. They all deserve their misery.",
            "You are allowed to say asshole on Reddit.",
            "Only on Reddit.",
            "They're currently busy paying Trump's legal bills.",
            "It worked for Kyle 🤷‍♀️",
            "I usually hear about him complaining people are being mean to him so my guess is that he’s poor. He seems the type to make sure everyone knows if he has an extra $20.",
            "HE had the money to buy the weapons",
            "Thanks asshole",
            "Ok asshole… lol",
            "Voice to text doesn't like swearing",
            "You've got spunk, kid!",
            "I hate Spunk!",
            "Mr. Grant!"
        ]
    },
    "Social Media Roasts Trump For Filling ‘Black Church’ Event In Detroit With Mostly White People": {
        "title": "Social Media Roasts Trump For Filling ‘Black Church’ Event In Detroit With Mostly White People",
        "score": 2148,
        "url": "https://www.yahoo.com/news/social-media-roasts-trump-filling-175659068.html",
        "content": "",
        "num_comments": 98,
        "comments": [
            "TFG just keeps embarrassing himself and his pathetic followers keep defending him.",
            "Maybe he should have had a few more of the white crowd wearing the blacks for Trump t shirts to pull it off better...",
            "“of the 8 Black Trump voters I talked to, just one was from Detroit and zero were congregants.”",
            "Sounds about right for him...",
            "I wonder why they care about that lie in particular.",
            "you know they pay these fucking morons 50 bucks to show up at these.",
            "Who cares?  This guy sold national secrets for profit.   Can we focus on that instead of this?",
            "His dad did the same , was really white of him , and 🍊",
            "It’s almost like he and his base really dislike anyone that doesn’t look like him and his base.",
            "Like that photo of a Blacks for Trump booth with no black people. “Who forgot to bring the negro???”",
            "I guess the blacks for trump worn by white people don’t count.",
            "They should be roasting the dumb motherfucker who let him in in the first place.",
            "churches and bibles are just props to him.",
            "I wonder how many are still following him just because they are to cowardice to admit they were wrong?… oh wait, Boomers as still a thing.",
            "I’m sure he was deliberately sending a message",
            "Turns out that the Black White Supremest vote is very small.",
            "Wait…you’re telling me he DOESN’T have the black vote?? /s.",
            "*MAGA Patriots invest your life savings in Trump Media stock & donate your monthly stock earnings to the GOP!*\n\n \n\n**The White House to The Big House-The Shameful Legacy of MAGA Cult/Jan 6th Leader, Donald J Trump**\n\nTrump is an adjudicated sexual predator, a civil trial accused rapist, and a 34-time convicted criminal felon.\n\nTrump faces an additional 54 criminal indictments in 3 cases delayed from trial by his high-priced legal team.  Trump’s army of lawyers is financed by his rabid base of MAGA cult members & the Oil Industry.\n\nThe vast majority of the 80-plus top senior positions (Vice President, Cabinet, Advisors) from Trump’s 2016 Presidential term have refused to endorse Trump and/or declared Trump is unfit to serve as President,\n\nTrump is a threat to our national security. During his 2016 term, Donald Trump asked national security advisers why the United States couldn’t use nuclear weapons.  He is irrational with a quick temper.  Imagine his tweets replaced with nuclear missiles.  He is Vladimir Putin’s puppet & praises Putin’s military partner, Kim Jong-un. \n\nTrump doesn’t respect the U.S. military saying “Americans Who Died in War Are Losers and Suckers”\n\nTrump supporters include white supremacists, racists & felons like Steve Bannon, David Duke, and Proud Boys\n\nOn 9/11, this was Trump’s reaction, [https://www.washingtonpost.com/politics/2018/09/11/trump-pointed-out-that-he-now-had-tallest-building-lower-manhattan-he-didnt/](https://www.washingtonpost.com/politics/2018/09/11/trump-pointed-out-that-he-now-had-tallest-building-lower-manhattan-he-didnt/)  \n\nA few of the many examples of Trump’s abuses, grifting, debasements, and falsehoods as the U.S. President\n\n·         ABUSES [https://www.cnn.com/2021/01/24/politics/trump-worst-abuses-of-power/index.html](https://www.cnn.com/2021/01/24/politics/trump-worst-abuses-of-power/index.html)\n\n·         GRIFTING [https://www.youtube.com/watch?v=qB9GdOYk0Ls](https://www.youtube.com/watch?v=qB9GdOYk0Ls)\n\n·         DEBASEMENT [https://www.youtube.com/watch?v=VJi641\\_7W10](https://www.youtube.com/watch?v=VJi641_7W10)\n\n·         FALSEHOODS [https://www.youtube.com/watch?v=NsQ2hX\\_noNw](https://www.youtube.com/watch?v=NsQ2hX_noNw)",
            "I’d bet that they were hired off Craigslist to attend",
            "Only low-information morons believe anything Domestic J. Terrorist has to say. The rest of them are in on the grift, enablers or complicit in his criminal endeavors.",
            "Why would a racist have black people in a black church when he is speaking?\n\nTrump could say he had a rally in a black church, but he won't tell you that white Manipulated And Gullible Assholes were the only ones invited.",
            "This is the first time I’ve made it through a paywall to see what people were talking about.\n\nWhy is this not national news?",
            "Black Americans have been used by abusive candidates like Trump.  If you are black American supporting Trump, think again.",
            "The great replacement theory.",
            "That’s because most black people wouldn’t associate with this nut job.",
            "At least they didn’t boo him for 30 minutes and chant “hypocrite”",
            "I am *really* tired of “news” articles that toss out a handful of tweets from random people on the internet saying the things the author wishes they could say but can’t because they’re pretending to have journalistic integrity. \n\nTrump’s complete shit, but so are articles like this.",
            "Just another scam like Trump U, Trump Streaks and “look at my Blacks”.",
            "I think the part that felt very off and pretty sad is where african americans actually ended up. They were put off on the stage like an amusement, showing them off to a crowd of mainly white supporters. There was nothing organic or natural about it. Borderline using them as \"token supporters\" for the crowd and lying about the numbers among everything else. \n\nNo clue how these people fine and contempt with the situation. Honestly I'd be livid and feel like just being used. No dignity or anything, just a prop for a photo-op in attempt to get votes.",
            "See, the trick here is to giving this ass clown any kind of publicity. Bad publicity is just as good as good publicity them because it keeps them in the spotlight.",
            "Republicans don’t see color. They had no idea. 😂",
            "But wasn't Tim there?   His go to BF.",
            "I realize this is ancillary to the topic, but it will never stop being funny to read “X, formerly known as Twitter” with utmost confidence that it will always be this way until the platform eventually shuts down. Also, Trump, he racist",
            "What white people arent allowed in a predominantly  “black” church.  \n\nchristianity isnt just a white thing.  No such thing as white christian nationalism.  Just American christians white and black. Quit with the racism",
            "In All, Trump is a lying shithead and stacks the deck everywhere he goes, his life is nothing more than smoke and mirrors, a house of cards and it's collapsing on Trump",
            "Remember, he represents the party that’s been crying about “Replacement Theory”.",
            "The idea that there are “black” churches and “white” churches is ass backwards to me.  \n\nNot defending Trump (fuck that guy), but I swear a lot of people these days very much want segregation.  \n\nEven Reddit with bullshit like whitepeopletwitter and blackpeopletwitter.",
            "Black or white it shouldn't matter we are American.  The left is obsessed with race.",
            "This, of course, is a lie.",
            "That felon grifter?\n\nOh that fucking guy...",
            "TFG? He has advanced from that! He is now the 1st convicted former president in US history. He has earned his crown and let him wear it. The US courts are slowing down his other crimes! What if this was Obama? Do we need to ask?",
            "You're forgetting his obvious gaffes and glitches",
            "He’s getting more Latinos and more blacks this time, as well.",
            "Nah yall are panicking, and making mountains out of mole hills,  now according to the left, white people cant go to a church where predominantly black people attend.  Christianity isnt just a white thing.",
            "Wouldn't put it past them to show up in blackface",
            "When they said black church what they meant was the church building was black not the congregation /s",
            ">\tSounds about white for him…\n\nFTFY",
            "Maybe because it’s so easy to catch them in? He can lie about Biden being behind the court cases, and make that plausible to anyone who wants to believe it. But trying to tell people “this is a black church” and have a room full of white faces? A bit harder to do.",
            "As opposed to....?\nDie hard supporters DGAF, the Uneducated need to be reminded that he's trash. In whatever flavour sticks.\n\nMake sure you vote and you drag 5 non voters to care enough.",
            "I'm sure we will get onto that, but I have some hearings to hear about some other things first",
            "and this is the real reason he won’t see prison time. Can you imagine the  intel he’d trade for a can of Aquanet, a hamberder, or to avoid getting fucked into the hardest gang in the yard",
            "Ask the judge assigned to the case. She doesn't seem to be in any hurry to focus on it.",
            "It's crazy because black folk in America are generally socially conservative. If they could stop being so fucking racist they'd have a chance in presidential elections, but the fear runs deep in the weak white American.",
            "Becuase of different cultures and worshiping practices as well as language that have had 400+ years of history. It's actually pretty simple if you're not just looking at surface level things.",
            "Differences should be celebrated, not ignored :^)",
            "After Trump left the “black” church full of white people, he attended a rally sponsored by a group of white people who wants nothing to do with  black people. The right does blatant things focused on race, then calls the left “obsessed” for calling them out on it.",
            "They literally picked a church to appear like the black community supports them and they're not racist. They started it with race. We are just calling it out. If yall didn't hate black people we wouldn't have to.",
            "He made the deal about it specifically being a black place. Maybe he shouldn't have led with that?",
            "> Black or white it shouldn't matter we are American.\n\nI think it is quite fitting how you put it that way given Trump did run a campaign against a certain Black American falsely trying to claim he wasn't American and wasn't eligible to be president solely because he was black.",
            "Exactly the point, trumpy boy is a pathological liar lol",
            "There always that one moron in every thread, today, that’s you…. Lmao",
            "The article literally links to videos .....",
            "It is? Prove it then.\n\nEdit: Obviously you can’t.",
            "“of the 8 Black Trump voters I talked to, just one was from Detroit and zero were congregants.”",
            "Tiny fingered grifter",
            "The smellin' felon is one that I heard.",
            "TFG - The FELONY Guy!",
            "They’ll just Obama is actually the one running things behind cadaver Joe. There’s no getting it.",
            "I mean their excuse is honoring Juneteenth",
            "Actually surprised no one did",
            "I stand corrected",
            "Ha ha. I was gonna say this. You beat me to it.",
            "Man, I don’t know.  He’s not a good liar, so much of what he says is patently dishonest.  \n\nPeople bought that the 2020 election was stolen, that’s no less transparently false that the black church thing.  Hell, they still believe it even though it’s been conclusively proven to be false, and conclusively proven that he knew it.",
            "Even a desperate prisoner could not be THAT desperate.",
            "The funny thing is you are oblivious.",
            "Big Reddit man calling people names.  Go play with your cat.",
            "Yeah?  So.",
            "Tiny fingered, diaper wearing, felon grifter.",
            "Tan faced geriatric",
            "Trying to riff off the TFG acronym",
            "He literally said the 2016 election was rigged months before it happened, and then later said it was stolen before he won. How anyone took him seriously about elections after that is beyond me lol",
            "\"Biggest inauguration crowd\" years ago right up to \"I never said lock her up\"\n\nYou could literally write a book, like a JRR Tolkien length book, with only lies he's said",
            "You people really are that much in denial, aren’t you?",
            "You trumpers bend over backwards to kiss that traitors ass. Biggest bunch of ballwashers ever",
            "I want his debate opponent to refer to him as the 34th president.\n\nSince he's the 34th president to be convicted of a felony.",
            "The Fat Guy.",
            "r/whoosh",
            "His primary legacy is the devaluation of reality.  Any lie is as valid as the truth, so they choose to believe a lie.  They know it's a lie, they just don't care.",
            "Short memories.\n\nYou need to keep pointing out the new things because people have internalized the old and \"the past is in the past\"",
            "If the cult will swallow anything you say, why bother to tell the truth?\n\n2 + 2 = 8 in Trump World.",
            "Look at their username. It's straight up racist.\n\nThey're not in denial, they're just being dishonest.",
            "Racist?  Explain.",
            "Your username is a common slur against black people.",
            "Maybe among bigots like you.",
            "🤡"
        ]
    },
    "Justice Samuel Alito absent from Supreme Court session for second day in a row": {
        "title": "Justice Samuel Alito absent from Supreme Court session for second day in a row",
        "score": 683,
        "url": "https://www.cnn.com/2024/06/21/politics/samuel-alito-not-present-supreme-court/index.html",
        "content": "",
        "num_comments": 104,
        "comments": [
            "As a youth I remember I believed that Supreme Court Justices were the very cream of the crop. Insanely smart with character above question. How naive I was.",
            "🤞",
            "Maybe he died and they haven't finished embalming him yet?",
            "He probably is on vacation paid by some billionaires.",
            "Is he at the terrorists convention w Putin?",
            "His wife won’t let him go.",
            "Hes in russia",
            "“Flags schmags! I’ll show them!” - Samuel Alito probably.",
            "What you call a “Good Start”",
            "Weekend at Sammy’s!",
            "Probs feeling ashamed of himself.  /s",
            "Could you imagine if he did die and the conservatives said \"You can't replace him in an election year!!\" Lmao",
            "Maybe he found another empty seat on a private jet chartered by a conservative billionaire with business before the court. ",
            "I hope he’s getting what he deserves.",
            "He’s is Russia collecting his money.  Should be back in time to change the flag to the hammer and sickle.",
            "He can skip days because he's already made up his mind on everything.",
            "Oh no,  I hope oxygen isn’t avoiding his area.\n\n(Don’t ban me, dude is 74 ish years of terrible.)",
            "Doubt he grew a conscience, but maybe finally facing consequences for his actions?",
            "He’s probably out ripping down rainbow flags and replacing them with upside down Trump flags.",
            "His coffin latch broke and he can’t,get out.",
            "Oh please.  OH PLEASE!!!",
            "Gee, I hope nothing gut-wrenchingly horrible has happened... (clutches pearls).",
            "Did Satan finally decide to collect his debt?",
            "All that hate and angst has to have a health impact. If something did happen, it would be divine justice for Biden to jam a nominee through in the closing days of 2024 election while the Dems still have a majority in the Senate. Biden fucking over McConnell and his manufactured Biden rule.nice.",
            "Not sure why this is important, they're just issuing opinions.  But if he's physically sick or has COVID, I'm all ears.",
            "Hopefully he’s dying.",
            "Hopefully he’s exploring other opportunities",
            "Whoever has him, we don’t want him back.",
            "what, do people think he's dead or something? does him not showing up even matter?",
            "Expand the court to 15 and put the most progressive judges in all those slots.",
            "Maybe check the back of the closet door, exotic asphyxiation?",
            "If he returns without a valid written absence excuse, he shouldn't be allowed back.",
            "Dying a slow death in the woods🤞",
            "Maybe he's just not showing up because when you can just make up your rulings based on political affiliation, and nobody holds you to account for anything, showing up for hearings is pointlezs. ",
            "They're gunna weekend at berneys him aren't they",
            "He at a Trump rally or a wanna-be fascist convention? He doing keynote speech for Charlie Kirk’s CPAP festival?",
            "It’s not like you can fire him. Shit, you can’t even really discipline them as long as weenies like Dick Durbin hold power they choose not to exercise.",
            "Can't they just assume he quit and move on?",
            "Maybe he's just dragging his feet in a very intentional, rogue, and highly MAGA way. Do I hope he just vanishes into thin air, yes. It is merely wishful thinking. Our eyes do not deceive us.",
            "Maybe he died, hopefully he died and they're out flag shopping.",
            "Seems like a good time to pack the court.",
            "May he be forever absent!",
            "Does he have to bring in a doctor's note? \n\nI hope he never comes back",
            "Probably on a cruise paid for by a billionaire filing the next case he's voting on",
            "How naive we ALL were.",
            "Some of them really have been. They've just been overshadowed by these idiots. But I still believe that Thurgood Marshall and RBG fall into the cream of the crop category",
            "They were better... the republican/conservative party getting corrupted by the religious and selling themselves to the highest bidder made them far far worse.\n\nBoomers decided their party affiliations in the 60's/70's and that was solidified in the 80s... after that it just became sports teams to  them.  'My team is better.'  \n\nThey're happy fish on the hook selling out their their forefathers and children so they dont have to pay a little bit of taxes to keep the country running. \n\nSuch a worthless group of people.",
            "I seriously think an algorithm could do a better job",
            "Perhaps they still are insanely smart. Like, evil geniuses are. ",
            "We can only hope.",
            "Imagine having millions wishing you have stroked out.",
            "Doesn't matter to R's. They'll pull the \"it's an election year\" bullshit and wouldn't allow any nominations.",
            "If he died the GOP would do everything in their power to gid it until they could get a corrupt president to install and equally corrupt replacement.",
            "I figured he would just spontaneously combust straight to hell.",
            "Maybe he got embalmed and hasn't finished dying yet?",
            "His body double has been subbing for him all this time.",
            "The gop would weekend at Bernie’s him until they can steal another election and install a Republican.",
            "They’ve embalmed him, they just haven’t installed the animatronics yet.",
            "Went flag shopping with the wife.",
            "Not just any billionaire, a billionaire with a case before the court!",
            "Taking some of the \"burden\" from Thomas.",
            "Wiping his ass with the code of conduct they apparently now have.",
            "One way ticket to Epstein island?",
            "Take Kavanaugh and Clarence Fucking Thomas out, too, please.",
            "True. Aileen Cannon is a judge because of weenies like Dick Durbin. He did not even show up to vote, and the Dems let Cannon become a judge. They had the votes to stop it.",
            "And what magical power would that be perchance?",
            "RBG was garbage whose stupid hubris fucked us all. ",
            "Tots and pears",
            "If he had any feelings, they'd be hurt.",
            "I've never wished a man dead, but I've read some obituaries with great pleasure.",
            "And to think he's at #2 on that wish list.",
            "I would imagine that more than a million people globally wish such a thing about a certain convicted felon",
            "Dems control the Senate, and court appointments can't be filibustered. Thank Mitch for that one (Harry Reid for court appointments, Mitch expanded that to SCOTUS appointments).",
            "Under the precedent set my mitch, if it's an election year of a president in his 2nd term that's not OK BUUUT as he said with Amy, if it's a reelection year it's a-ok!\n\nObvious bullshit, but dems control the senate so, like mitch, laugh when asked about it and say of course it will be filled",
            "It’s ok because Biden will win the election and we can nominate next term if needed",
            "Do they have the power this time around? They hold the House but not the Senate. This is a matter for the Senate I believe?\n\nLast time, they held the Senate so they could stonewall as much as they wanted.",
            "Messy but effective!😁",
            "Now that's funny!",
            "I'm not sure anyone could tell the difference.",
            "Subpoenas and hearings. He could make life uncomfortable for them and do the service of displaying the deep corruption on the court from Republican appointees. The general public should have some sense that billionaires have bought and paid for their supposed public servants.",
            "You can be incredibly brilliant and an overall good for society and be so arrogant and self assured that you get hoisted by your own petard. In fact I’d say it happens a lot with smart people. We can lament her bad decisions without labeling her a bad person.",
            "Ill have to agree with this person, she literally fucked her legacy at the finish line",
            "I agree that she should have retired early in the Obama administration; however, I can also understand her fear that he wouldn’t have an opportunity to select her replacement. She took a gamble and lost- at a critical time, unfortunately. Don’t let one poor decision at the end of an amazing career destroy her legacy.",
            "I'm an atheist and I'm praying to whatever is out there that he's left the bench and entered the coffin.",
            "Yeah.  The Biden administration has been teasing a vacancy too, combined with this new information it’s looking like our boy here might be ill.  Hopefully ",
            "Ultimately it will be up to presidents Manchin and Sinema",
            "Well, John Roberts has already told the Senate that the SCOTUS doesn't have to show up for subpoenas, and if they don't like it, they can sue... Which will then get ruled by the same SCOTUS that days they don:t have to come. So, that one is out.\n\nAs for hearings, they are pointless... What does Samuel Alito give a F about hearings that he doesn't have to participate in and won't affect his wealth or job status? He'll just laugh at you and say \"F you\" even harder. He's above the law and he knows it.",
            "Spaghetti monster will save us all. And leftovers for spaghetti sandwiches.",
            "MAGA cult will claim Joe Biden had him killed so he could put a dem in the court",
            "And has taken fucking clarence with him!",
            "Have you considered [Gokuism?](https://thedaoofdragonball.com/spirituality/gokuism-the-church-of-goku/)",
            "Even if they didn’t show up, they could still hold the hearings and highlight the lack of respect to Congress. In short, they could exercise their powers, it doesn’t matter if Alito thinks he’s above the law, what’s more important is that average Joe voter knows Alito thinks he’s above the law.",
            "On sourdough",
            "So? Presidents have total immunity.",
            "Dark Brandon Pelican Briefed him?",
            "Not that there's anything wrong with that",
            "What average Joe voter listens to Senate hearings?\n\nPro publica has done more to highlight the corruption to the public than any Senate hearing ever would. The fact is, the Senate has no power to do anything. Boring hearings would only highlight their impotence and make people mad at the Senate for not doing anything, even though they can't.",
            "I’ll bake! Bread lady, coming through!",
            "Garlic bread you heathen.",
            "Plenty of them hear about hearings when they go on for days and days. I don’t understand your insistence that their national platform and instant access to national media means they’re unable to act. Learned helplessness?"
        ]
    },
    "Women who falsely claimed Brigitte Macron is transgender go on trial in France": {
        "title": "Women who falsely claimed Brigitte Macron is transgender go on trial in France",
        "score": 205,
        "url": "https://www.france24.com/en/live-news/20240619-france-tries-suspects-over-false-brigitte-macron-transgender-claim",
        "content": "",
        "num_comments": 24,
        "comments": [
            "> In 2022, Brigitte Macron filed a complaint for libel against two women who posted a YouTube video in December 2021 alleging she had once been a man named \"Jean-Michel\".\n\n> Messages multiplied on social media claiming that the first lady, formerly Brigitte Trogneux, had never existed and that her brother Jean-Michel had changed gender and assumed that identity.\n\n> Brigitte Macron is among a group of influential women -- including former US first lady Michelle Obama and New Zealand ex-premier Jacinda Ardern -- who have fallen victim to the growing trend of disinformation about their gender or sexuality to mock or humiliate them.",
            "Should be that idiot Candice Owens on trial, she was pushing this narrative hard, without any evidence.",
            "Love how people use transgender as an insult and by love I mean HATE...",
            "Good maybe more of these \"transvestigators\" will get shutdown after this.",
            "Is defamation different in France?  \n\nDo you not have to demonstrate how you were harmed monetarily?",
            "Candace Owens's whole \"professional\" career is on the line on that one. 😁",
            "More transvestigators should be put on trial, maybe then they will wise up that their actions have consequences",
            "On trial?",
            "Good, it’s time people learn that freedom of speech and freedom of consequences are two very different things",
            "It is a man baby, why won't this wig come off!",
            "I wonder if they’ll bring that to the US and since theres no 100% proof biden’s cognitive skills are declining we could prosecute anyone who says that.",
            "If she’d embraced it like a compliment and simply said thank you but I’m not cool enough blah blah the whole thing would’ve just gone away.",
            "Embrace the hurricane of “free speech” people combined with plenty of victim cards being played.",
            "Projection. Show us the scars, Candace.",
            "In many countries, if your reputation is harmed, it’s a valid reason to claim defamation.\n\nThe “damages” part of any verdict is not due to lost income, but compensation for the loss of reputation caused by the defendant.",
            "Why would you willingly portray yourself as a demographic of people that a significant amount of the population literally wants to fucking kill if you aren't actually a member of that demographic?",
            "My schadenfreude couldn’t be more schadenfreudedie.",
            "Wish the US had laws like that. Instead anyone can say anything they want with nothing but pure malice and still have no repercussions.",
            "That's your freedom. Freedom to be a dick to anybody, and freedom to be treated like shit all day every day by whoever feels like it. It's better in other countries. A lot better in a lot of countries.",
            "The US has laws like that, but it takes deep pockets to do anything. Remember the Dominiom voting systems case?\nFox made a record settlement because they knew they were going to lose, and damages would be way more than the\n$787,500,000 settlement. \n\nThere are also things like Slapp suits and Lawfare. Having an openly corrupt and partisan Supreme Court as your highest legal authority doesn’t help though.",
            "Trump/Russia for 3 years is all I heard.. then.. no consequences",
            "Hillary is a murderer for 31 years...."
        ]
    }
}