{
    "Interislander runs aground, passengers in lifejackets": {
        "title": "Interislander runs aground, passengers in lifejackets",
        "score": 207,
        "url": "https://www.nzherald.co.nz/nz/interislander-runs-aground-passengers-in-lifejackets/MESDRBENNFABXJL54YJYXDM7KI/",
        "content": "",
        "num_comments": 151,
        "comments": [
            "Beached as bro.",
            "Apparently the passengers are all okay but God I hope there aren’t any trucks with poor sheep or anything stuck on there.",
            "Good thing we ordered new ferries to replace our ageing fleet, right?\n\nRight?",
            "Managed to get a cabin, who knows how long I'll be on here. You can almost hear the beginning of a horror movie starting.",
            "Oh man, if only we had a bunch of new ships on the way to replace the fleet we have that are past their service life",
            "Brown said the Government was committed to a resilient Cook Strait service but ministers also wanted to see KiwiRail maintain its existing ships to the appropriate standards.\n\n“Which has been a significant issue that we’ve been highly unimpressed with coming into Government”, he said.\n\nSimeon Brown working overtime to make it the last governments fault. \n\nWho cancelled ferry contracts again?",
            "It's almost like we need a new boat. Or two.",
            "Kiwis can't have nice things, we are only allowed old second-hand dungers and stuff done on the cheap,\n\nNZ has low self esteem.",
            "We've just been directed back to our vehicles. Departures are inbound.",
            "From RNZ:\n\n>The ferry will not be refloated this morning\n\n>Marlborough mayor Nadine Taylor says more work needs to be done to assess the situation.\n\n>Taylor, who is acting as spokesperson for the harbourmaster, says given the next high tide is this evening when it will be dark likely the the next attempt to refloat won't happen until next high tide on Sunday.\n\n> She says divers will head out again this morning to get more information about where on the bottom of the vessel the ship is grounded.\n\n> Authorities are now coming up with a plan for getting the passengers off the vessel safely.",
            "Photo from Skyworks. [https://www.facebook.com/photo/?fbid=450385034406784&set=a.218237867621503](https://www.facebook.com/photo/?fbid=450385034406784&set=a.218237867621503)",
            "Can’t park there mate",
            "Looking forward to an update from u/Captain_Snack",
            "what a way to start a holiday",
            "Tell ya what.  The most scared I’ve ever been on a boat was taking that Interislander south through some HEAVY seas to Picton in ‘05.  I just closed my eyes and assumed everyone  knew what they were doing and there was no actual danger.  We got there just fine, so I guess they did!  But 😰!",
            "I think it would be nice to take the ferry across but it really seems like they're all so unreliable, which seems nuts considering how vital of a service it is.",
            "Nicola will have the answer 😂",
            "do we still have those big as tugs, ordered after the Wahine disaster ?",
            "Can't park there mate",
            "Can't even get trucks across the strait safely, but this government wants to re-start live animal exports.",
            "Why is there no live stream of the refloat",
            "She’s off the beach and afloat.",
            "Just seen on NZ Farming that high tide was 930pm, with low tide still three hours away at 230am. Can't imagine that's ideal.",
            "I think this is a great opportunity to build the Cook Strait bridge, finally.",
            "This is why we can’t have nice things!",
            "Did the passengers have to stay on it for 24 hours? Surely not...",
            "Did KiwiRail execs not get kickbacks from the Hyundai brand new ships deal so broke it? Why would they do it? Seems like a lot of leeches in seats of power.",
            "Weird how there were no passengers on board but according to OP they have placed some there in life jackets.",
            "Least it didnt happen halfway across the strait",
            "Sounds like an inside job to me 🤷",
            "No harm, no foul, it operates on the smell of an oily rag.\n\nInsurance will pick up the tab.",
            "Almost looks a deliberate act, sort of steered straight into a fucking big mountain.   Is the captain a Nats C lister supporter.. ..",
            "time for some ice creams",
            "Reports are they are going to try and refloat it this morning, so fingers crossed, toes crossed, eyes crossed, hair crossed.....  it will work and they tow it back to Picton and unload.",
            "fuuuck surely not sheep massacre on ferry",
            "\"I may have committed some *light* insurance fraud\" - Nicola Willis",
            "a lot of people who love to criticize Labour and Greens for bad optics are about to start talking about how new boats wouldn't help the pilots see better",
            "“Arent ya glad we didn’t get the new ones!?? They woulda failed!”",
            "Hi. I'm from the current Government. Can you please pass on to reporters that everything is fine? Thanks.",
            "They would have been some years away,  doesn't excuse not maintaining the safety of the current fleet.",
            "Everything a politician says before the word “but” is false and can be ignored.",
            "How does Simian Brown know that the maintenance of the Ferries is such he is \"unimpressed by it\"\n\nThe maintenaqnce of the ferries is subject regular and on going inspection and approval by, for instance,\n\nKiwi Rails P&I club, essentailly shipowner's mutal insurance clubs, \n\nMarine surveyers such as Llyods for safety inspections, market value, etc. \n\nMaritime New Zealand  regular flag state inspections\n\nAnd there is also Kiwi Rail's own highly qualified and experienced Captains asnd Chief engineers.\n\nBut hey Simian Brown can tell at a glance the maintenance is \"unimpressive\" and pour shit over all these professional mariners.\n\nWhy the fuck isn't the media asking Brown how he knows the maintenance of the ferries is sub standard?",
            "The cancelled ferries have nothing to do with this, do you think the cancelled ferries would have been here by now? look at the company that just serviced the steering (if the steering is found to have been the issue)",
            "[deleted]",
            "[deleted]",
            "if only we could afford them",
            "‘Roughing it’ settler mentality remains strong",
            "Are you a truck driver?",
            "That’s a sick photo",
            "Bloody hell she's high and dry, like she is REALLY *REALLY* ashore.\n\nI was expecting her to be *almost* nosing the side of the channel maybe, but *that's* next level... here's to hoping it's low tide and she can be refloated. Lucky for no injuries by the sounds of it at least.",
            "She's aground all right",
            "Fuck, that doesn't look like a cheap repair",
            "Beautiful!",
            "Ur funny . Jk",
            "Got woken up at 2am, directed to our vehicles at about 2:50 and the the door opened at 3am.\n\nApparently the ship is still broken so wasn't aware of how they moved it.\n\nEverybody on board was pretty silent. Sleepy and tired of the waiting game. Everyone was safe though, and no injuries. That part about the life jackets is untrue. Didn't see a single person or crew wearing them.",
            "Taking my time, feeling a little chilly",
            "Preliminary thoughts are this is a ship failure not a human one. Yes your 05 experience would have had highly competent crew as they do today. These boats were still relatively new back in 05. Now we’re just flogging these poor elderly horses",
            "They make 4,000 crossings a year. They're pretty reliable considering such a high volume. There's bound to be a few issues with such old ships every now and then especially considering the route they take.",
            "Depends on things like\n* Do you think a high capacity, efficent transport system running in parallel with roads Is a good idea. If yes there needs to be some way to move rail rolling stock between the islands.\n\n\n* Do you want competition or are you ok leaving Bluebridge as a monopoly?\n\n\n* Are you ok removing the consistently profitable bit of Kiwirail from the organisation?",
            "Privatisation!!",
            "After the last Interislander incident, harbourmasters in the area started calling for some decent sized tugs that are capapble of working in open water.  They were very concerned that we had so much large traffic moving across and through the strait without tugs capable of helping them out if they get in trouble.",
            "There's a lot to criticise this government over when it comes to ferries. But this point is completely irrelevant.\n\nThe government has nothing to do with live animal transport beyond allowing it. It's not like they're state owned transport vessels piloted by National MPs.",
            "You know they dont go on the same boat aye?",
            "You mean cause it hasnt happened?",
            "Aside from the fact that it would be fucking boring, it’s also not till tomorrow.",
            "Could be worse",
            "This is NZ. We don't build important stuff anymore.",
            "Tax cuts for landlords are more important.",
            "That's in the headline, there are something like 8 truck driver passengers on board, one has commented on their experience a few times in this thread",
            "Tell me you comment on Reddit titles before reading anything without saying it.",
            "Ironically that is precisely when you want a steering failure to occur. Large open spaces allow you to steer by main engines away from navigational dangers and you have time to fix the fault. \n\nNear the shore is the worst time to have your engines or steering fail.",
            "Their reputation is taking a hit. I assume more nervous potential passengers are already avoiding them and incidents once or twice a year will eat away their customer base.",
            "Nonsense thing to speculate.",
            "He was laser focussed on those rocks.",
            "Latest news is not till Sunday am now.",
            "Black sheep 2!",
            "Lol, it would be funny if she was playing that long game this whole time.",
            "Well tbh better optics might have helped the pilots see better...",
            "It'll make a \"steering failure\", which this was, less likely.",
            "Doing well, everybody is trying to sleep or seems a little restless. We even have some snorers, so we've adapted well I'd say.",
            "And that you prefer to receive small tax cuts with increased costs consuming that cut rather than working infrastructure? Thanks.",
            "Cool and Normal™",
            "Stern Comments appreciated. Take a bow.",
            "At least it would only be some years away, and not infinity away.",
            "I agree to a point. But you can't fight entropy when it has the increasing upper hand.",
            "Maybe he reads the news? \n\nhttps://www.rnz.co.nz/news/national/489310/preliminary-inquiry-into-ferry-s-engine-failure-finds-kiwirail-did-not-follow-part-manufacturer-s-advice\n\nEverything you've said is contrary to what went on prior to that part failing..",
            "Oh piss off mate. It's an article about the consequences of ageing infrastructure and this government of fucking failsons cancelled the in progress replacement infrastructure. \n\n\nWhining about it isn't going to change the facts. ",
            "Make what about politics? Political decision making?",
            "From stuff live blog - https://www.stuff.co.nz/nz-news/350319695/live-interislander-ferry-runs-aground-just-outside-picton\n>Interislander General Manager Duncan Roy says the Interislander ferry ran aground due to a steering failure.\n\nSeems pretty clear cut?",
            "Bro. Steering failure.",
            "I made this joke because of a pun you can't do it unironically that's just no fun.\n\n[https://www.reddit.com/r/newzealand/comments/1dl15nb/comment/l9lo1kr/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/newzealand/comments/1dl15nb/comment/l9lo1kr/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
            "$2 a week too much for you?  Not a problem, I can instantly pay for it with a single change to landlords dignity. And I’d have spare change.",
            "Nope. Just paid for vehicle transport. There were about 12 other passenger cars.",
            "She ran aground just after high tide which would add to the lean a bit. Next high tide at 9am tomorrow.",
            "And it looks like it's even high tide...",
            "go to sleep, your grouchy",
            "Wow so you managed to drive off? That's good, sounds like trucks might still be stuck. Scary stuff!",
            "A ship failure is a human failure, just not necessarily any of the crew's.",
            "ya hit just 1 island, and you never hear the end of it....",
            "Yep they were already floating the idea and have mentioned it again today",
            "Are the big tugs in use now?",
            "Pretty legal",
            "Sounds like seeing the land didn't help in this case....  Steering failed. \n\n\nThink Deadpool on the Zamboni....\n\"Sir, it's not that we didn't see the large chunk of the South Island, we just could fucking steer!\"  ",
            "The one Kiwi Ferry experience that isn't sorted by a warm pie and a healthy smattering of watties....\n\n\nThey will have you refloated in a couple of hours!  Think good thoughts for ya mate.",
            "The Kaitaki was built in 1995, she's nearly 30 years old. She's been on Cook Strait since 2008, that's 22 years.\n\nSo you have a very old ship operating  on an intense timetable in one of roughest short sea routes in the world.\n\nMoreover she's been operated by four previous ferry companies under the names, Isle of Innisfree, then Pride of Cherbourg, Stena Challenger and Challenger. She's had a serious vibration problem from launch day which is why she's passed through so many hands. \n\nWho knows what maintenance requirements have dropped out of thye system over the years as the Engineers scramble and improvise to just keep the ship running..\n\nAnyone with experience of managing ships will have every sympathy with the management, Captains and Chief Engineers, trying to keep that old ship in service. .\n\nCertainly they don't deserve criticism from an upstart, short arse shore sider like Brown.\n\nHe wants to have someone to blame when the Kiataki's primary drive chain collapses completely in the not to distant future and no replacement is available..\n\nA 30 year old ferry on Cook Strait, jesus wept.",
            "[removed]",
            "No political decision making caused a boat to crash, other than whoever approved the purchase of this particular boat in 1998",
            "You mean the tenant tax? \n\nYour supposed landlord dignity tax corrections are 2.9bn a year, divided by a population of 5mil is $580 per year, thats more than $10 a week, and thats before we remove children, people on benefits or people on super, so its more like $20 a week, do you still want to pay it?\n\nI mean technically tenants would be paying it, but are you willing to pay it?",
            "Not sure why news outlets are saying it was a frieght only trip. I'm not a truck driver and there were other passengers on board too.\n\nYeah glad to be off and make take bluebridge home on the return hahah",
            "touché",
            "Not a bad idea, a private business wouldnt let this happen",
            "Not as far as I know.  Would cost a lot of money.\n\n[https://www.rnz.co.nz/news/national/490509/mv-shiling-highlights-lack-of-ocean-capable-tug-in-cook-strait](https://www.rnz.co.nz/news/national/490509/mv-shiling-highlights-lack-of-ocean-capable-tug-in-cook-strait)",
            "Hang on, you said it had been inspected by every man and his dog, yet now you say \n\n>Who knows what maintenance requirements have dropped out of thye system over the years as the Engineers scramble and improvise to just keep the ship running..\n\nThere's a disconnect there.",
            "Yep. What people don't realise is that aside from a couple of layup days a year. The ship runs 24/7 except for Saturday nights.",
            "and what, you think things get better or stay the same by sticking your head in the sand and saying LALALALA???",
            "Well feel free to piss off out of this sub you have virtually never posted in before, except to complain that you don't like what's posted.",
            "Your comment has been removed :\n\n**Rule 09: Not engaging in good faith**\n\n> Moderators have discretion to take action on users or content that they think is: trolling; spreading misinformation; intended to derail discussion; intentionally skirting rules; or undermining the functioning of the subreddit (this can include abuse of the block feature or selective history wiping).\n\n\n\n---\n\n[^(Click here to message the moderators if you think this was in error)](https://reddit.com/message/compose/?to=/r/newzealand)",
            "[removed]",
            "Did you miss the new boats being canned? Like what are you people talking about",
            "Do you think I want the tax cuts for landlords for some reason?  My suggestion is that by removing the tax cuts for the landlords we could have paid for the ferry upgrades with cash to spare.",
            "how many passengers were on board?..keep seeing the news mention 8 passengers?,surely there was more than that.\n\n  \n\"Duncan Roy spoke to media at Picton Marina this afternoon after the eight passengers onboard and 12 of the 39 crew had disembarked.\"\n\n[https://www.nzherald.co.nz/nz/kiwrail-and-interislander-bosses-to-front-media-after-vessel-runs-aground-in-south-island/ZTI5DATV6VBYHD6664YZTKRDDM/](https://www.nzherald.co.nz/nz/kiwrail-and-interislander-bosses-to-front-media-after-vessel-runs-aground-in-south-island/ZTI5DATV6VBYHD6664YZTKRDDM/)",
            "Like [Boeing](https://www.bbc.com/news/articles/cw00l7d2ljno)?",
            "I guess the oil and gas industry tugs are cheaper.",
            "[deleted]",
            "Your comment has been removed :\n\n**Rule 3: No personal attacks, harassment or abuse**\n\n> Don't attack the person; address the content you disagree with instead. Being able to disagree and discuss contentious issues is important, but abuse, personal attacks, harassment, and unnecessarily bringing up a user's history are not permitted.  \n> Please keep your interactions with others civil and courteous. If you are being attacked, do not continue the conversation - report the user and disengage.   \n\n^*Note:* ^This ^extends ^to ^people ^outside ^of ^[r/nz](http://reddit.com/r/newzealand). ^eg. ^Attacks ^of ^a ^persons ^appearance, ^even ^if ^they're ^high ^profile ^will ^be ^removed.\n\n\n\n\n---\n\n[^(Click here to message the moderators if you think this was in error)](https://reddit.com/message/compose/?to=/r/newzealand)",
            "No, even if the new ferry wasn't canned this still would have happened.\n\nThis ferry has been a lemon since day 1 in 1998. Successive governments havnt done anything about it. It's not a political decision that caused this to happen",
            "You mean the tenant tax? So your happy for tenants to pay approx $20/wk more in rent for it to cover the interislander? seems like a waste of money",
            "There were more than eight passenger cars.\n\nI counted more about 10-12 from a glance while we were waiting to board.\n\n[Car deck](https://postimg.cc/ThvBZqvX)\n\nNot to mention there were probably walk ons too.\n\nWhere I was sitting for the trip, there was a dude behind me, in front, and a family far to the right. Two guys on the way past deck eight hallway. Three guys sleeping on the couch next to reception.\n\nThe other deck had more people on it too.",
            "Captain Snack got off with their vehicle in the early hours this morning, so the actual passengers must have gone long before the 8 truck drivers. Poor reporting, definitely sounded like everyone was stuck til lunch time",
            "I was thinking more like PaknSave",
            "says the person spending their morning complaining about other people conversing about somehthing they want to talk about. and im the issue?",
            "no one is forcing you to be here and endure the horrible politics talk they are talking about when reading a politics ridden article, fuck off mate",
            "“Successive governments haven’t done anything about it”\n\nExcept can the ordered replacements\n\n“Not a political….”\n\n“Governments”\n\nIf governments aren’t political then what are?????????????????",
            "I have no idea what you are talking about anymore. \n\nAlso, *you’re",
            "So they assume you are driving a commercial vehicle, which doesn't have to be a truck?",
            "> Captain Snack got off with their vehicle in the early hours this morning, \n\nThat’s a neat trick given it is still aground a couple of miles away from the wharf.",
            "yea I just realized the 8 they kept mentioning were truck drivers, Cheers",
            "[deleted]",
            "Ordered replacements and poorly managed the costs which were blowing out of control and could have bought multiple second hand and reliable ferrys for the same price\n\nReplacements wouldnt be here by now so this still would have happened.",
            "Yeah, basic econmics isnt as easy as people seem to think",
            "drop it, you didnt even read the article.\n\n> Finance Minister Nicola Willis refused to give KiwiRail more money for mega ferries soon after the National-led coalition came to power...In December last year, the Government declined KiwiRail’s request for an extra $1.47 billion for the Inter-island Resilience Connection (iReX) after the project’s total cost escalated to almost $3b.",
            "So… politics?\n\nAnd I’m not sure how you’re saying in the same breath “this is a failure over successive governments” and “canning the future replacements is irrelevant because they wouldn’t be here by now”. Like do you want us to think about long term planning or not?",
            "No, Kiwirail maintenance"
        ]
    },
    "Credit: Tavlova on Facebook ": {
        "title": "Credit: Tavlova on Facebook ",
        "score": 181,
        "url": "https://i.redd.it/46t89i0xm28d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I need to get wet, ASAP",
            "But they do have chips.",
            "It’s just taking it’s time, feeling fine.",
            "😂😂😂 brilliant",
            "They also have ghost ships.",
            "Chiips are like $14.",
            "they cancelled the funding for ghost ships"
        ]
    },
    "Anti-LGBT March ": {
        "title": "Anti-LGBT March ",
        "score": 510,
        "url": "https://www.reddit.com/r/newzealand/comments/1dlhzf7/antilgbt_march/",
        "content": "There was just a March with high turn up for an Anti-LGBT cause. Queen Street, Auckland. \n\nBro I’m literally just existing, chanting that it’s been taught in school and shit. Now that’s what you call a propaganda. No one’s making your kid gay, they’re already gay. I have a sunken feeling about this…… ",
        "num_comments": 220,
        "comments": [
            "Just remember that old mate Eftpostle has been trying and failing with his anti-queer crusade for literally decades. Twenty years ago this year, he led a march of thousands of cultists and white supremecists against civil union legislation and what happened? Nothing, nil impact. \nNine years later NZ passed same-sex marriage legislation with an even larger voting majority and Eftposle's influence was so meager he couldn't even muster a protest.\n\nWhile it may seem that a lot of people showed up, they represent practically the entire anti-gay movement because it's pretty much just made up of Destiny cultists and other Christians who ignore the words of Jesus.",
            "Why don’t they use the same energy to fight against those in their churches who molest and abuse children?",
            "What kind of dickhead goes to an Anti-LGBTQ march?",
            "It's Tamaki's hate-mob. The sooner that fuckwit gets recognised as a gang leader the better.",
            "They were doing this outside my kids school this week and interview/harassing his classmates. Just fuck off and let these kids be. Their lives are hard enough, just being a teenager without these loopers  protesting their existence",
            "There's no hate like Christian love.\n\nStill one of my favourite things watching Georgina Beyer tear into the eftpostle 20 odd years ago.\nShowed what real courage looked like.",
            "You should have held up a placard, \"if you protest you're gay.\" Instant defeat.",
            "Isn't getting any news coverage.",
            "It will be those smooth brains from Destiny Church.",
            "Did the eftpostle have anything to do with this? Seems his style.",
            "Why do they care what others do? Sounds like they're jealous ",
            "Who spends so much time concerned about people's bedroom lives. It's just so ew to be this obsessed and not just live your own life.",
            "You know, I'll bet that The Eftpostle will have chowed down on a cock or two in his time.\n\nThe most vocal opponents have such deep closets.",
            "If I had a kid I'd rather them be gay than conservative, at least then I could still respect them.",
            "Nothing but another gang",
            "The irony is Jesus was a \"confirmed bachelor\" who hung out with a bunch of guys he met down at the docks.",
            "Outrageous. We should be marching against this kind of thing.\n\nan Anti-Anti LGBT march if you will",
            "Such a shame I'm not in Auckland, I can think of multiple ways to disperse those fuckwits. \n\nAs for why no-ones counter-protesting them, I'd say it's a safe bet this was organised in semi-secret to avoid the LGBT+ community coming out in force, like they did to counter Posey Parker.",
            "Sad that this kind of horrible ideology has found its way to New Zealand. This is not who we are as a country, but so many have allowed themselves to get influenced by awful, hateful ideologies. I'm sorry OP. You should know that most of us don't feel this way, most of us aren't driven by hate. Don't let these horrible people change who you are or make you feel ashamed for simply existing.",
            "They're emboldened by the American right and how our current pack of cu... uh... Ministers in Government... are basically simple simians aping said American right. Nats have the fixation on cash. ACT have the fixation on freedoms to basically untether the ultra-wealthy from responsibility, and NZF have the frothing cooker bit. Density here just tag along with the latter.",
            "How many people were at this march? You know what Eftpostle does he gets his people to spam huge numbers of Facebook groups pretending that whatever they're into the march is about so not everyone there will even be into what he's into.",
            "It's just the EFTPOStle and his kiddy fiddler friends. They aren't a danger to anyone. \n\nWait! no, I meant drag queens aren't a danger to anyone. These low lives are a very real danger to this country.\n\nWe need to do everything to shut them down. I say we start by taxing the bastards and then going after them for proceeds from crime.",
            "I know right it's not AIDS, we aren't all gonna catch the gay bug. Just let people live, being LGBT isn't hurting anyone",
            "Dont disagree with you in the slightest, but democracy is about allowing all sides to be heard, even if we dont like what they are selling.  Just know that you are on the right side :)",
            "Christians are such loving people",
            "Can't we all just get along",
            "Ready your cans of tomato soup... let's get pouring.",
            "It's best that they don't get any attention, or you're just adding a bit more fuel to the fire unfortunately.",
            "Was this what I was hearing in Dunedin as well this afternoon? Or was that a different protest. Never saw em, just heard em.",
            "Why is he so obsessed with what gays do behind closed doors..?",
            "Pardon my questioning and please don't get offended.\n\nIs there a reason to teach kids more about genders?\n\nIf we have a mortal kombat of subjects like\n\nGender studies vs Math\nGender studies vs Physics\nGender studies vs languages \n\nWhat would happen? \n\nWhat subject would be first and where would gender studies be in your list?",
            "Oh yeeeaahh I remember that March. \"Enough is enough! Enough is enough!\" Ridiculous and meaningless. Might as well have shouted \"Food is Food!\" However, the punching fists in the air and latent violence within the words was chilling \n\nBut you're right. They've achieved literally nothing. Except managing to paint over a rainbow, which they then got charged for and the rainbow was repainted. \n\nSo actually, they've achieved less than nothing. Well done, Brian! Good job!",
            "Exactly! If churches are such centers of moral excellence why are so many of their leaders pedophilias and rapists.",
            "Or the cost of housing and feeding children.. and people in general ",
            "Because that’d be shadowboxing.",
            "The original groomers",
            "Because that'd mean admitting they have problems in their community. And worse problems at that. Can't have the church looking bad.",
            "They won’t because then they would be protesting against themselves",
            "That would hurt revenues",
            "Well you see pedophilia is actually a manifestation of gayness and so church people abusing kids is actually because of gay people so in a way its not the churches fault for ignoring or facilitating it and covering it up, it's societies fault for letting people be gay\n\n##### /s",
            "Because they like those.",
            "Nono that’s called a reverse exorcism.",
            "Because Gods ways are mysterious…",
            "Brian Tamaki and his cult of thugs and bigots.",
            "A dickhead",
            "You know what Eftpostle does he gets his people to spam huge numbers of Facebook groups pretending that whatever they're into the march is about, so not everyone there will even be into what he's into.",
            "People who are being fed a steady stream of social media content about people trying to turn all the kids trans.\n\nContent that's all being produced because it's effectively destabilising democracies around the world, sponsored by groups who are benefiting from that change.",
            "Them operating as a church is the biggest tax fraud out.",
            "[removed]",
            "What would be funny is to turn up at a protest with a whole lot of signs in Latin or some other language that they  don’t understand an tell them it says something anti Gay,  but it actually says the opposite, an see how many wave them round all day - most of them are brainless anyway, probably even if it was written in English they wouldn’t be able to read it",
            "English or Spanish?",
            "We need Shane Gillis.",
            "Good",
            "Yes look how many conservatives are in the news cause of there pedafile behavior.",
            "[removed]",
            "So basically, you don’t like people who aren’t like you?",
            "He was bi at least. His relationship with John the disciple was very gay.",
            "Jesus spent quite a lot of time with Mary Magdalene, and there is some evidence he may have been married to her.\n\nOf course, that doesn't fit the patriarchy of the time that decided which bits of arcane scrolls would be used to comprise the current Bible, and which ones would be ignored.",
            "I listened to a podcast recently with some scholar in ancient languages who claims, after studying ancient bible stuff in their original languages (you know, before the monks and so on mistranslated them to suit their own agenda/political landscape of the time.) that Jesus may have actually been a bit if a child-trafficking pedo. \n\nHonestly, I wouldn't be surprised.",
            "And it backfired cuz they got 0 news coverage and by tomorrow not a soul will care about it",
            "Was Density a typo? Cause that's a great name for their \"church\" (cough cough dodgy startup)",
            "I totally agree that we should up hold the characteristics of a democratic society. Although, given a situation if I was surrounded alone by anti-gay people I think I’d get bashed.",
            "Sure, I’ll get along with anyone who respects my right to exist without fear of violence, harassment or the erosion of basic rights and freedoms. But I refuse to get along with bigots.",
            "I’d be perfectly happy to get along with them and whatever the hell weirdness they’re on about if I didn’t have legitimate reason to worry about them wanting to beat me and anyone like me to death just for funsies.",
            "You remind me of that one girl in Mean Girls that wanted everybody to just get along lmao",
            "I get where you’re coming from, but I think it’s important to call out this bullshit when we see it.",
            "The reason is that otherwise queer kids won't grow up knowing that actually they are allowed to feel that way. Can't just bury your head in the sand and pretend queerness doesn't exist, though that's been tried and has led to mental health outcomes for queer kids which are frankly an indictment on our collective morality as a society that we let such a thing happen.\n\n  \nPS: we're not even talking about gender studies, that's a very different field.",
            "So first off gender studies is not taught at secondary and primary schools. Gender studies is an academic discipline that examines gender roles in society and is taught at universities. \n\nWhat is taught however, is comprehensive age appropriate sex education. Its typically part of the health/PE curriculum, and you can see what is taught when [here](https://thespinoff.co.nz/politics/22-02-2024/heres-exactly-what-students-are-required-to-learn-in-sex-ed).\n\nCrucially schools are required to write to parents and talk about the sex education curriculum, parents can make submissions on the curriculum, and parents can opt their kid out of the class if they prefer.\n\nBroadly speaking the extent of LGBT education is along the lines of \"gay and trans people exist and thats fine.\" There is no proselytising, no sinister globo-homo indoctrination, just the mildest bare bones factual information.",
            "Ofc not, why would I. \n\nHowever, I study physics at university and I am not quite sure where you’re getting math gender studies and physics gender studies from hahaha. Although I believe gender studies within the social science department have always been taught. \n\nLike many topics, if people are interested in it then they should pursue it.",
            "We have sex ed in years 5 and 6, just before kids are hitting puberty. It is totally reasonable, logical and beneficial to address these topics in those classes.",
            "Good thing people don’t use mortal kombat to organise schools.",
            "I remember watching Georgina Beyer have at him on tv. My dad turned the tv off and went on a 20 minute anti-gay rant. That was pretty much the day I decided Christianity was bollocks.",
            "Well said.",
            "It's almost like the churches would have a vested interest in stirring up this kind of deflection.",
            "Dial that back even a step further. It'd mean admitting molesting children is a problem, and not just when they want their enemies to be doing it.",
            "The dicky kind ",
            "Yet we aren't standing up as educated humans and putting them back in their place.",
            "It makes little difference. If they were registered as a company they’d still pay tax only on profit. If they spent all their profit on buying placards to write homophobic slogans on and paying their leader an obscene salary, they’d make zero profit and there’d be zero tax. \n\nCompany profit is only taxed because that profit is ultimately returned to the owners. Their organisation has no legal owner in that way. Yes a huge chunk of the profit goes to a few individuals, but that’s (at least in theory) taxed with PAYE. \n\nThe tax exemption thing isn’t nearly as big a drama as many make it out to be.",
            "Side A: we just want to be able to exist like any other human being. \n\n\nSide B: Side A are disgusting inhuman freaks that should be culled.\n\n\nYou: bOtH sIdEs ArE sO vIoLeNt!!!!!1!!",
            "How does gay people simply existing make them *hateful*? You have drunk too deeply from the kool-aid..",
            "What? Who is the other side you are referring to? The one getting shat on just for existing?",
            "Existing ≠ hateful.",
            "Come on team, don't engage with the troll. \n\n\nTroll shoo shoo get out of here. Psst psst. ",
            "Yeah but one side is \"leave us alone we're not doing anything\" hate and the other is \"reee how dare you be different I want you dead\" hate. Not really the same thing.",
            "LGBT people are only defending there rights to exist. \n LGBT people are going to sit back and told they don't exist anymore.",
            "Your comment has been removed :\n\n**Rule 09: Not engaging in good faith**\n\n> Moderators have discretion to take action on users or content that they think is: trolling; spreading misinformation; intended to derail discussion; intentionally skirting rules; or undermining the functioning of the subreddit (this can include abuse of the block feature or selective history wiping).\n\n\n\n---\n\n[^(Click here to message the moderators if you think this was in error)](https://reddit.com/message/compose/?to=/r/newzealand)",
            "Windings",
            "This should 100% be the approach. As close to nonexistent as possible. No coverage, no soap box. No recognition.\nNothing. \nHe never happened.",
            "Sorry it’s just too unnatural I can’t possibly respect conservatives.",
            "We judge the right by the policies they introduce...",
            "Shit take gay people just want love and happiness and Conservatives want women to loose all rights and to attack and cull the LGBT community.\n\nEven the extreme left doesn’t advocate for death just shared wealth",
            "> If someone's personality predisposes them to being conservative...\n\nIt generally means they're a selfish prick",
            ">you shouldn't judge the right by their fundy Christians.\n\nJust watch me.",
            "There's a difference between not liking someone who is different to you...and not liking someone who believe you and your loved ones are abominations who shouldn't exist or be allowed equal rights.",
            "Well conservatives seem to be showing a lot of not liking people who aren't like them by their voting.",
            "He looks gay af in all his portraits. Always surrounded by men with long hair, often nearly nude. Loving thy neighbour all over town.",
            "No there's not.",
            "Yep! You're spot on there.",
            "Link?",
            "Which is strange, but I guess that's what happens when you organise your bigot pride march on the quiet lawl.",
            "Not a typo and I can't take credit for their nickname, but who cares? Use it! Go forth and spread the good word!",
            "I wish we were all part of the get along gang. Not some of the other scary violent gangs.",
            "Haha! I remember her. The rainbow girl.",
            "That makes sense, it still really sucks that it happens here.",
            " Probably better you ignore them. \n\n They want the attention.",
            "This was such a level headed response I commend you honestly.",
            "TEST YOUR MIGHT... by uppercutting this NCEA exam.",
            "Nice. \n\nGeorgina Beyer was a really amazing woman. Trailblazer too.",
            "??? Who is saying molesting children ISN’T a problem?",
            "I've already signed a petition.  Government is weak.",
            "Don't stick up for them. We not talking about if they were a company.  They are a biker gang bunch of nazis disgusting as a church . Period.",
            "Yeah but but but remember that one time a rainbow protester punched an old lady (who totally definitely wasn't shouting hateful things at anyone probably)? That's totally the same as decades of physical assaults by individuals and the state!\n\n#/S",
            "Because there's never violence with seizing the means of production",
            "Yeah, and if you don’t like your child, what does that make you? My politics and my dad’s politics were diametrically opposite yet I always knew he loved me…",
            "As did twohedwlf...",
            "Oh absolutely, it’s sad how much Tamaki and his ilk get away with.",
            "Yes, but unchecked awfulness just gets worse. While criticising their behaviour is giving them some form of attention, if we don’t criticise their behaviour openly they will simply become more brazen.\n\nI take your point though, it’s just hard to find a balance between completely ignoring them and giving them the attention they crave.",
            "So many people worked up about this issue are being rarked up by misinformation being spread by political opportunists and hate preachers for profit. I'm hoping the much more prosaic truth soothes their concerns.",
            "The people who shelter pedophiles in their organizations and create structures to help them get away with what they do, and spend their lives whatabouting and deflecting when it's brought up against them.\n\n~~Also most libertarians.~~",
            "Not sticking up for them at all. Just saying that “it’s tax fraud!” is the weakest argument out there. They’re a bunch of thugs preying on the vulnerable and attacking minorities - the tax thing is just a total non-issue and a distraction in that context.",
            "Right!? This sub loves to rag on that guy but come on, I don't care how frail and decrepit the bigots are, some of them deserve a punch in the face. If you can't stand the heat, get out of the hateful anti-trans rally!",
            "The only violence is towards those in control I doubt anyone on reddit is at threat.",
            "Oh man that's almost as bad as wanting to legislation enacted against people over it!\n\n*oh wait no it isn't*\n\nTo clarify, i'm talking full conservatives, not swing voters who just voted national last election. People who might go between nat, act and this election's nz first.",
            "You’re talking about the concept of “ the paradox of tolerance” and you’re quite right.",
            "\n Laughing at them and ignoring them is best way. \n\nhttps://en.m.wikipedia.org/wiki/Damnatio_memoriae\n\n That shooter few years back? Idk his name and I cant be bothered googling it.",
            "Fair enough  . But they aren't no dam church",
            "I would punch an old woman if she was wearing nazi symbols and promoting their ideals. If you are choosing to spout that propaganda you are choosing violence, I am simply responding in kind.",
            "Respectfully disagree but you do you.",
            "\n 2016 if everyone ignored Trump do you think he wins? \n\n Or did he get lots of free advertising?",
            "OK now you’re just being silly.",
            " It's been mentioned as a reason he won. Lots of coverage, drowns put everyone else."
        ]
    },
    "So They're Putting Simon Brown Up As The Sacrifice... ": {
        "title": "So They're Putting Simon Brown Up As The Sacrifice... ",
        "score": 229,
        "url": "https://www.reddit.com/r/newzealand/comments/1dlmg8r/so_theyre_putting_simon_brown_up_as_the_sacrifice/",
        "content": "...Meanwhile Luxon, Willis and the leaders of the other parties are all strangely silent. Wont save them on Monday though, question time in the house should be very fun, never mind the press.\n\nAnyhow, if I were more functional I'd do a bingo card up for the excuses Brown will/is making. But at a guess, it'll be:\n\na) It's Labour's fault!\n\nb) It's Kiwirails fault!\n\nc) Free Square\n\nd) It's not our fault, the reports etc didn't say this would happen!\n\nc) It's the contractors fault, they fucked up the steering and totes not mechanical/electrical failure to components at their end of life!\n\ne) Blame The Experts, it's totes not our fault despite KR telling us the ferries needed to be replaced ASAP.\n\nf) Brown attempts to spin some other bullshit to get out, and fails. Because he's an idiot duh.\n\ng) It Cost Tooooo Much!11!1! Even though it was the portside stuff that was the problem, not the boats.\n\nAlas, I lack the focus to be able to sit through Brown doing what he does best and the hard liquor needed to survive it.\n\n  \n\\[Edit\\] - And b) is the \"answer\" Simon Brown has taken, in the form of \"Asset Management\", despite the fact the steering was completely overhauled 3 weeks ago with new parts and probably a shit ton of checks etc. So KR have been keeping up with \"asset management\" you vacuously brained nonce. ",
        "num_comments": 158,
        "comments": [
            "Luxon on Monday - “well the front fell off, that isn’t supposed to happen”",
            "They’ll also throw Kiwirail under the bus.",
            "As always, they are “committed to delivering” something that they have recently decided to not fund.",
            "It might be Simeon's portfolio, and he is an intellectual void at the best of times, but make no mistake, this is Nicola Willis's 'household budget' economics in action\n\nWhere is your second hand Corolla now, Nicola",
            "[removed]",
            "This is the perfect issue for the coalition government. Short term hit with no election in sight, close enough to the last election to blame the previous government, highly visual and affecting an iconic piece of tourism infrastructure.   \n\nPerfect for a hastily arranged privatisation and “Look, we got it all sorted in time for Summer peak cause Chris knows a guy at P&O Ferry Lines! The market works!”",
            "It's a small price to pay to ensure our struggling landlords have some dignity",
            "Tbf Kiwirail had a great solution. It also has maintenance crew working on the Aratere 24/7. I know because I have been crew on the Aratere so when Willis implies that Kiwirail are negligible in it’s maintenance that’s simply untrue",
            "When a large complex machine gets old enough, replacing worn out parts often sends the old ones next to it down the toilet as well because they cant handle the strain of the fully performing new part. Its a cascade failure, where fixing one thing leads you down the road of fixing many other things.\n\nOh you fixed the oil pressure on the power steering pump? Now the hydraulic cylinder is leaking oil. Oh you fixed the oil leak on the cylinder? Now the reservoir tank is overflowing. Oh you replaced the fluid and bled the system and put new fluid in? Now the control arm bushings have cracked because the steering is no longer soft. Oh you fixed the bushings? Now the previous oil leak onto other components has fried them and you need to replace the alternator. Oh you replaced the alternator? Now one of the safety systems has burnt out but you wont find out until you try to brake hard and the ABS doesn’t engage.\n\nThese boats are OLD. And they have been in constant service for 26 years, shit wears out and a maintenance schedule is not going to be comprehensive enough to prevent issues without having the entire engine, electrical and transmission systems taken apart and rebuilt. Which would put them out of service for months.",
            "PRIVATISE EVERYTHING! Because some bloke in the field didn't read the manual ",
            "In cases like this \"Speculation is not helpful, will wait for a full, independent investigation to be carried out\" should not be a good enough answer. Why.not be honest and say \"we know exactly what happened, but will not say until we have worked out how to minimize our liabilities and the news cycle has moved on to other things\" \n\n\nJournalists need to ask the hard questions, even put the words in their mouth. E.g. \"as the minister, are saying to me, that 12/34/72 hours after a ship running aground you still have no idea of the cause of the incident? How is that even possible?\"",
            "Can only blame the current government.  Kiwirail knew there was a problem, and that's why they ordered the new ferries.  This is the reason why they need  new purpose built ferries for cook strait with rail decks.  Cook strait  is one of the most challenging bits of water in the world . A 2nd hand Toyota corolla ferries is just going to end up a lemon. This Government of chaos has no clues.",
            "If in doubt, blame the previous government, just like they constantly blame labour for the country's economy now.  During the 2020 election, they put out information, saying that the country is going to be in trouble coming out of the pandemic and that's why they should be in charge, they also wanted labour to spend more during the pandemic.\n\nThe current condition is the economy is nothing to do with labour, it's a global issue.",
            "The guy is a useful idiot, until he's not.",
            "ok, sacrifice accepted. So long Simeon. Its been great.  \nWe have more ferries, can we put Shane Jones in as next minister of transport, then crash the next ferry ?",
            "Mr Luxon & Ms Willis are strangely silent, I wonder why…….",
            "I heard they had unbolted it to carry out sand blasting",
            "It’s Simeon",
            "I’m looking forward to Nicola teling us we need Ferrari ferries* after all.",
            "You forgot it's Te Pati Maori's fault, it's all MRI's fault.",
            "Did his office receive a paper on this very thing during the last two weeks? If his office did receive it, did they then ignore it? \nIf only there was an official way to get this information …",
            "'nonce'\n\n\nLike, wtf dude?",
            "Meanwhile we might have a new man made reef…",
            "Imagining an alternative universe where Willis hadn't canceled the replacement ferries, how would that have prevented this incident given they weren't due for delivery and commissioning into service until 2027?",
            "Jesus Christ - the incorrect landing of the ferry is nothing to do with the government!!! The steering failed …. Exactly what has happened with THIS ferry before when Labour was in government - just without this issue. This ferry has just had a MAJOR overhaul of its steering issues…. Well, they were not well tested obviously. A little bit of logic would go a long way!",
            "This accident is definitely not the govt’s fault. The fact that we have no options lined up is 100% on them, as is the likelihood that a few years later we’re going to pay more and get less.",
            "Wankers",
            "> b) It's Kiwirails fault!\n\nConsidering they are responsible for the ferries... why would be be anyone else's fault?\n\n\nPerhaps you could spell the dude's name right in your rant as well?",
            "Who the fuck is Simon Brown",
            "Why is any of this possibly Simone Brown's fault? He's not going to get grief over this.\nHe's just the guy who has to tell these two companies to sort their shit.\n\n(Yes, National cancelled the new ferry contracts, but any fall out will be years off...)",
            "It's the weekend.... politicians aren't like keyboard warriors on Reddit",
            "Out of curiosity, why is the Kiwirail ferries the only ones in operation? Why not open the market to allow multiple companies to run ferry services from multiple locations?",
            "Brilliant skit that was! A Kiwi comedy legend.",
            "At least it’s been towed outside the environment.",
            "You reckon?\n https://www.rnz.co.nz/news/national/520250/live-transport-minister-fronts-up-over-ferry-grounding\n\n\\- edit - the front page headline is '\"Live updates: Government 'disappointed' in KiwiRail asset management- Brown\". They use a different title in the article",
            "Well, they can try to, I suspect the media and the House will eat them alive come Monday. Already being called out for it via twitter etc judging from the live feed from Labour/Greens.",
            "Kiwi Rail has a pending government court case for their maintenance management being dangerously incompetent \n\nhttps://www.rnz.co.nz/news/national/507003/maritime-nz-files-charge-against-kiwirail-following-kaitaki-mayday-call\n.\nThey're already well under the bus and they threw themselves there themselves\n\nWhen they've got a proven track record of poor management, poor maintenance procedures, leading to multiple hazardous faults, theres a maritime NZ criminal case open against them... it's hardly the Government throwing kiwirail under the bus to suggest that the current accident comes from the same pattern",
            "It's hardly throwing them under the bus. It is solely KR's responsibility to operate and maintain the ferries, no one else, they fell under the bus all on their own. You lot are jumping on this like it's a big stuff up on the Coalition Government part, it not, but go ahead and get your hopes up lol.",
            "Why wouldn't it be Kiwirail's fault? They are in charge of the Aratere.\n\nHow isn't their fault that the future upgrade was canned? They somehow turned a $775m ferry upgrade into a $3 billion one, with no guarantee at all that would be the final cost.",
            "Simeon’s confused why there are boats in the Ministry for Cars ",
            "Oh don't worry, she'll definitely be a target on Monday at question time, the question is though will she try and dump this all on Simon's lap as her excuse and will anyone believe her lawl?",
            "Either way, does any of it end up doing anything of value.. anything change or will it keep on keep on and us plebs bend over and take it sans lube. It's not like they shoplifted a few times",
            "Imagine Simeon and Nicola at school though. He would have been the guy that the bullies gravitated to and she'd definitely have been the mean girl. She'll throw him under the bus if she can",
            "How would a 2026 upgrade have changed yesterday?",
            "No one likes to see kids cry right?",
            "Your comment has been removed :\n\n**Rule 3: No personal attacks, harassment or abuse**\n\n> Don't attack the person; address the content you disagree with instead. Being able to disagree and discuss contentious issues is important, but abuse, personal attacks, harassment, and unnecessarily bringing up a user's history are not permitted.  \n> Please keep your interactions with others civil and courteous. If you are being attacked, do not continue the conversation - report the user and disengage.   \n\n^*Note:* ^This ^extends ^to ^people ^outside ^of ^[r/nz](http://reddit.com/r/newzealand). ^eg. ^Attacks ^of ^a ^persons ^appearance, ^even ^if ^they're ^high ^profile ^will ^be ^removed.\n\n\n\n\n---\n\n[^(Click here to message the moderators if you think this was in error)](https://reddit.com/message/compose/?to=/r/newzealand)",
            "Except that doesn't work when you've mothballed plans introduced by the previous Government to replace these ferries.  \n\nWillis claims the costs were blowing out to $3b.  Okay, but i thought National were elected because of their business and financial acumen.  Surely Luxon could renegotiate a better deal, he did used to work for an Airline remember?",
            "You stole my line 😂",
            "\"Some if you may die, but it's the sacrifice we're willing to make\" said Nicola and Simeon most likely",
            "Somebody has to take the blame and it sure as shit is never gonna be a politician.",
            "The Aratere's been a dog ever since it was made. She broke down and was adrift in the Atlantic when being sailed over here from the shipyard in Spain. I don't think any maintenance crew could keep her reliable.",
            "Well said",
            "Have my upboat, for what little it's worth... \n\nAnyhow, nailed what I would have liked to be able to say about all the fun that can occur with old stuff. Only touch point I've got is PC's and not even enough to elucidate this issue to the same degree as you. \n\nAs for what broke this time - I suspect it's something to do with the power systems as the ship's old enough that electrical components will have been close to failing without warning and before their end of life \\[insert relevant stats on failure probabilities here, because it's midnight...\\] due to what is basically plain old bad luck. And that failure then knocked out steering.",
            "If Tova doesn't rock up and pull out her classic \"Do you think you should resign, Minister?\" line I'll be even madder than I already am about this shitshow.",
            "In the case of the pylon pretty much everyone in the industry already knows what happened ",
            "I suspect the harder questions will come Monday, especially after the coalition's likely cluster-fuck during question time. \n\nUnfortunately for them this time they don't have a dead cat available they can throw out to distract our ADHD brained media.",
            ">\"Speculation is not helpful, will wait for a full, independent investigation to be carried out\" should not be a good enough answer.\n\nIt's absolutely the right answer. They're still controlling the immediate damage and preventing the situation getting worse.\n\nRushing to conclusions before the information is available is a great way to get the wrong answer and then go barking up the wrong tree. Once you have given a reason, the pressure comes on to implement a fix ASAP. If you haven't done the investigation, you don't know that you've gotten to the root cause. If it turns out to be something else then you've made modifications that could introduce new failures and can't be sure you've fixed what you were trying to.\n\nFor instance, when the ship hit the bridge in Baltimore, it was reported that the ship was having electrical problems before they left. Preliminary investigation report got released months later and it turns out that had nothing to do with it and they weren't even running the same equipment in port and when the accident happened. They still got crucified over the rumours.\n\nIt's much better to find out for certain, before putting out dodgy information.",
            "While I can’t refute Cook Strait being challenging, is there a reference to this I can reuse? I don’t like to make claims based on just reddit.",
            ">Can only blame the current government.\n\nHow would the 2026 delivery of ferries have prevented the Aratere running aground yesterday?\n\nMaybe the cost of the upgrade quadrupled because Kiwirail also budgeted for a time machine lol",
            "No shit, but far too many voters thing the government is totes magic and can work around global issues despite all the evidence to the contrary. Especially the stuff about how Labour managed Covid so well we had the lowest death toll in the developed world and one of the best economic recoveries.",
            "Blame the zopiclone, had insomnia last night and it always creates \"interesting\" side effects the following day.\n\nEdit - oh dear, evidently no one here's experienced the fun of zopiclone it seems. Case in point, typing anything out at present is a pain because I constantly press the wrong keys, never mind the memory fades and other fuckery. Seriously, I wish we'd legalise and subsidise weed for insomnia al-fucking-ready so I could avoid the blah from zopiclone, And no, I don't have the money or resources to source it either to make edibles.",
            "Since the mods took umbridge with my previous snark - Do thy not knowth the english language my good person? For \"nonce\" is a perfectly apt description of Simeon Brown's over all aptitude. \n\nIf you prefer, I can call him \"an utter contemptuous dumb fuck of a car wanking shit-weasel\" if that's more to your tastes.",
            "[removed]",
            "Well, for one everyone would be more reassured as new ferries would have already had their keel's laid down and on their way to completion and delivery. Making this grounding less of an \"told you fucking so\" moment. \n\nOnly way to avoid would have been if the replacements had been sorted back at the last term of Key's government, which they, and the replacements for the NZ Airforce's ageing transport planes should have actually been. Or later, but still better, the 1st Arden term \\[insert standard lefty gripes here about Labour's actions\\]. \n\nBut NZ has this annoying habit of waiting until things are fucking broken or about to break before replacing them. And also refusing to replace shit that needs to be replaced (hello Christchurch Hospital's Riverside Block) and doing money draining patch work instead. And this incident and the cancellation of the replacements fits that pattern to a tee. \n\nSo yeah, people are going to blame National for being idiots and doing the usual thing.",
            "The government didn't crash the ferry, you're right.\n\nBut they did cancel the necessary replacements so...",
            "Except in that overhaul they would have tested everything, meaning that \"logically\" the issue is probably due to the fact the ferry is over 2 decades old and needs to be replaced before it starts failing even worse. \n\nBut no, can't possibly blame the government for cancelling the replacement ferries now can we? Or for ignoring the KR's avoided more failures by getting it's act together since the 2021 fuck up and pretending they learnt nothing. \n\nBut yeah, why use logic and facts when you claim to use them in a reactionary manner right? Far easier to pretend you're the rational, logical one lawl.",
            "The Stupid, It Burns.\n\n1. Kiwirail completely overhauled the steering 3 weeks ago, even called in overseas expertise to do the job.\n2. Kiwirail has also bluntly said the ferries are at their end of life and are more prone to hardware failures and has been trying to replace them since last decade iirc.\n3. Also since the previous breakdown they've overhauled their maintenance stuff already.\n\nWhich all in all makes blaming this on \"asset management\" totally divorced from reality from those 3 points alone. But there's also one other important point - namely the \"end of life span\" bit. Which in ships results in parts breaking more and more until (like our airforce's transport planes) they're regularly out of action due to critical parts breaking.\n\nAnd it doesn't help the Cook Strait crossing is hard on ships either, due the mechanical wear and tear the wave action creates on everything in the ship.\n\nBut hey, why consider context when you can post something utterly droll instead trying to pretend you're smart right?\n\nedit - and here come the downboats for being snarky, because why retort with reason when you can vote instead right?/how dare I be meeeeeeean!",
            "Govt blaming govt SOE. \nWe are literally paying the govt to blame itself\nJust as well we didnt but the Ferrari ferries.",
            "That’s Captain Brown to you, Mysteron!",
            "Critical reading failure detected, please proceed to your nearest high school to be re-educated via year 11-13 english so you avoid making a fool out of yourself in future. \n\nBecause it's very obs I'm not blaming Simeon Brown here, except for his utterly stupid excuse on why this is KR's fault. When really it's years of under investment and political failure. And the fact he shouldn't be the one fronting up, because he's not the one who killed the replacement plan and then fucked around coming up with a new one. \n\nHe's also a vacuously brained nonce and his ministry needs to be renamed to the Ministry of Caaaaaars already.",
            "Except when the shit hits the fan, then they're expected to give a statement at the very least. Especially when it concerns something National proclaimed wasn't needed.",
            "ah... bluebridge?",
            "They are not the only ferry service Wellington to Picton. Bluebridge has been running a competing service for at least 20 years currently with two ships. They used to be locally owned but sold out to Australian interests about 8 years ago. Currently it is owned by a Morgan Stanley partnership. Bluebridge's two ships are also second hand at around 17 and 28 years old. The three Interislander ferries are aged 29 years, 26 years and 26 years old.",
            "WYM?  StraitNZ/BlueBridge isn't owned by KiwiRail.",
            "Well, as the other said, there's also Bluebridge, but due to NZ's size there's not enough of a market for a third player and usually ferries fall in a natural monopoly anyhow due to the costs involved with maintaining passenger shipping.",
            "Letting the market handle anything infrastructure related often ends poorly.",
            "Imagine the mincemeat he'd make of Luxon.",
            "Sheeit I thought it was aussie",
            "Interesting the the union says the ships are at end of life which \"checks notes\" the current government canned.  It's almost like both kiwirail and the union says we need new ships......",
            "I only ever knew one KiwiRail maintenance supervisor, and he was a pompous moron. So I guess that... tracks.",
            "Who’s to say Kiwirail?  Whatever system failed will tell a tale.  You however make two errors.  First, most are dismayed we have no options now we have decided our landlords are more deserving than our essential infrastructure.  Second, that early estimates of cost are necessarily the final.  You also seem to have conflated costs of vessel replacement with the costs of vessel(s) and berthing.  \n\nThank dog we have Nicola working on her cunning plan…\n\nLucky for us,",
            "By somehow you mean \"with increased costs for government mandated earthquake resilience\"\n\n\nThe Coalition of Chaos could have done the same as with yellow stickered buildings - changed the law and told KiwiRail they didn't need the buildings to survive the next earthquake.",
            "Love it. Ministry for Cars: accurate.",
            ">Ministey for Cars\n\nPerfect. I’m using that.",
            "It's a corolla.\nIncorrectly parked.",
            "Nicola got shat on when the three whys men made her not deputy PM and instead minister of finance.  Biggest scapegoat in any party is MOF ",
            "Best tactic for her is to commission Bill English to write an \"independent\" report on the situation. Can be another $500k 'would be better off under the free market' word salad. Added bonus will be to get Kiwirail to pony up the cash from their passenger safety budget or some other unimportant fund",
            "David Seymour has entered the chat.",
            "Damn it, I would happen to be checking out a mastdon feed, so I missed what ever post the Mod team murdered. \n\nA shame, for I would have probably crafted a spicy retort to it.",
            "The Lux is busy trying to negotiate a raise on his $60 food allowance from his wife.",
            "I'm not in the industry and even I can see that the pylon was unbolted for some reason. And when you remove the thing holding something that's tensioned sideways down, that thing that's tensioned sideways falls over.",
            "Waiting for this exact thing to happen. Northland who?",
            "Sorry I don't have the articles off the top of my head . Have read them in the past . I also have some inside knowledge and I can't name that source. I don't think they'll get it off tonight.  I know that piece of coastline well I read earlier they  saying  it's sitting on sand I don't believe that it's rocky as right along there there's no way it can be on sand. They already saying getting it off could be catastrophic. There's rocks along there as big a mini sticking  up.",
            "Maybe read the bloody news? It's been mentioned heavily to do with any news about replacing the ships. \n\nAlso it's a very obvious thing if you've ever been on the ferries during typical conditions. As if the ship's not rolling up and down it's actually abnormally fine for once.",
            "It wouldn't have, but we would have new ferries, so hopefully, this wouldn't happen again .",
            "Huh, I've never had it do anything like that. Worth mentioning to your GP if you haven't already.",
            "Dude you can get legal weed from your GP (or green doctors if your GP doesn’t want to prescribe).",
            "So, I actually only learned in the last couple of years that apparently \"nonce\" means \"pedophile\" to some people. \n\nSurprised me, because I'd always heard it as meaning \"fucking idiot\". But someone who associates it with the other meaning might be thinking that you're being unreasonable in your criticism.",
            "Your comment has been removed :\n\n**Rule 09: Not engaging in good faith**\n\n> Moderators have discretion to take action on users or content that they think is: trolling; spreading misinformation; intended to derail discussion; intentionally skirting rules; or undermining the functioning of the subreddit (this can include abuse of the block feature or selective history wiping).\n\n\n\n---\n\n[^(Click here to message the moderators if you think this was in error)](https://reddit.com/message/compose/?to=/r/newzealand)",
            "You seem angry.\n\nKiwirail can say whatever they want, they are still solely to blame.\n\nThey are a business - they are required, by law, to be run as profitable and cost effectively as any other organisation.\n\nIf they can't figure out a way to get backing for replacement hardware then that is entirely on them.\n\nGoing from 500mil to 3+bill during a project is insane. At that rate they still wouldn't have broken even by 2050.",
            "Well yes.. SOEs are standalone from the government for a reason. They are absolutely right to blame them.\n\nSpending $3+ billion when they weren't going to be broken even by 2050 is a not a good business decision.\n\nSOEs are required ***by law*** to be cost effective and profitable as a non SOE.",
            "Well blow me over. I literally thought Blueridge was owned by Kiwirail. Learn something new every day.",
            "The sketch was on an Aussie show. John Clark moved his career to Australia after starting here",
            "It (the show, Clarke and Dawe) is Australian, but John Clarke was a Kiwi (aka Fred Dagg)",
            "When things are breaking down from poor maintenance and the union hasn't said shit about the maintenance practices being a problem... you've got to consider that the union maintainince staff might be part of the problem. \n\nThe new ships weren't due to arrive till 2025 at earliest, so the existing ships were expected to be maintained and operated for another 2 years. \n\nIf there's major steering failures a couple weeks after a steering system refit job was completed... and the company is in court for severe maintenance mismanagement, then there's clearly rotten at Kiwirail that a new set of ships isnt going to fix.",
            ">Who’s to say Kiwirail?\n\nUhhhh....because it's their ferry? I don't exactly think we'll be blaming Intercity buses.\n\n>  Second, that early estimates of cost are necessarily the final. \n\nSometimes there are cost changes. But an increase of **400%**? That is beyond the pale.The only rationale for this is either incompetent early estimates, or rampant and unconstrained increases in scope. Neither are good. And both point to the previous Govt having zero idea and zero control over the project.\n\n>You also seem to have conflated costs of vessel replacement with the costs of vessel(s) and berthing. \n\nWhat good is an estimate of vessel replacement if you are also not budgeting for needed birthing upgrades? Incompetence.",
            "The earthquake resilience quadrupled the costs? Awwww gummon",
            "She's the muppet master, not the victim",
            "...You do realise you've just provided them with a way out of this right? Because there's probably some poor intern/staffer slaving over the social media feeds looking for some good news they can given Luxon et al. \n\nAnd to the manglement that is our current government, farming it out to Blingish is a \"good idea\" or they can just get 3 airport executives to provide their \"expertise\" again.",
            "Reddit on",
            "More likely the bolts failed, as it's very easy to not tension them properly and have premature bolt failure as a result.",
            "Yeah, but I was after reliable reference, not hearsay, and I don’t consider Stuff or Herald reliable when comparing it to unnamed locations.",
            "So how do you blame the current Govt?\n\nWe would have new ferried for a (hopeful) price of $3b in 2026, you can start playing the blame game then.",
            "I've been on it for 15-16 years, so the side effects to me are normal. At least today it didn't totally wipe me out, though sometimes I can't even tell I've had it aside from a bit more clumsiness.",
            "And that costs far more the I can afford on the Supported Living Payment. Also I need edibles due to a never ending low level lung infection (once a week I cough up green gunk) not playing nicely with smoking. I'm also too dysfunctional to actually make the stuff, as my ADHD went from moderate and manageable to severe and more disabling than the depression that's why I'm on the SLP...",
            "From what I know, that use of nonce was primary a UK thing back in the 90's mostly, I think. Use these days is as a synonym for idiot. And if he was more of one I'd use \"schmuck\" instead but he's far from the threshold for that. \n\nNow Brain Tamaki on the other hand is most definitely a schmuck and a total putz to boot.",
            "LAWL \n\nOh sweet summer child, you doth not know what my anger looks like in the fucking slightest, for one there'd be much free use of \"fuck\" and much more snarky descriptions of your utter lack of intelligence. \n\nAlso, that law is a a load of bullshit, since transport infrastructure  like rail and shipping is often very expensive to run when it comes to a small nation like NZ. Simply because we don't have (or in the case of rail, haven't made use of it) the market size to run things at a sustainable profit. Because replacing infrastructure can and often is very expensive. But in the case of rails, is usually paid off over the life time of the, which is measured in the very long term. \n\nNot that it stops the Ministry for Cars under Brown pushing for negative returns on investments for highways of course, can't possible hold roads up to the same impossible standard after all. \n\nAlso, how the flaming fuck was KR going to prevent this? Because it wasn't caught during the recent intensive maintenance or the steering overhaul 3 weeks ago? Oh right, they couldn't, but in the special little reality distortion you live in they totes could have, and no fact nor argument will change your fucking mind. \n\nBecause like a Young Earth Creationist, or any other variety of reality denying bs, you've got a priori assumptions about how thing work, that are completely divorced from reality and impenetrable to mere reason.   \n  \nWhich I can say with confidence, since you're waving the fuck up with port costs as totes not solvable and totes meaning we had to cancel the contract (with penality clauses) for the new ferries. When instead the government could have redone the port stuff, and got the new ferries anyhow and like any sane government amortised the costs over the life spans of the 2 pieces of infrastructure. Since the port side stuff is meant to last far longer than the ships ffs. \n\nWhich will probably go right over your head completely, due to the aforementioned irrational bs problem you have. Because why bother with accepting reality when you can eat bullshit instead right?   \n  \nAs it just tastes sooo much better when it's from your team!",
            "Business aren’t required by law to be profitable.",
            "What if the contractors who did the recent steering  system install fucked up? Would that not reduce Kiwirail’s liability?  I don’t know where fault lies.  (Nor do you). \n\nCongratulations. You have realised ships need berths. Big ships big berths…\n\nLet’s see Nicola, or you if you’re keen, explain to us all how the recent thwarted upgrade plan didn’t make sense for the long term future of our critical infrastructure.  Other than to meet some numbnuts NACT notion of ‘making savings’, (and rewarding landlords) whatever the cost.",
            "Willis is way out of her depth.\n\nShe's got an BA Hons in Eng Lit. \n\nNo real world senior management experience except for the made up title of general manager of Fonterra's nutrient management programme. \n\nThese Fonterrra jobs are the standard way of getting pretend excutive experience for the politically annoited children of the National party.\n\nLikewise sitting on the board of Export NZ, a division of lobbyist group Business New Zealand.[11][12]\n\nAlso the usual goffa jobs in Bill English's and John Key's parliamentary offices.",
            "It's nothing some other National Spin Master wouldn't have come up with by Monday morning. This isn't their first rodeo.",
            "Let's hope they do that. The worse case scenario is they appear competent enough to re-elect.",
            "Never seen premature bolt failure before...premature nut failure in the other hand....",
            "Shouldn't the harder question be \"why did one tower falling over cut off power to a whole region?\"",
            "lolwut? \n\nThe news is usually taking it straight from KR's own reports and industry experts. If you want to go trolling through 90 pages of KR's business case be my guest, but I need to make dinner and severe ADHD makes it painful to do primary research in the first fucking place. \n\n[https://www.kiwirail.co.nz/assets/Uploads/About-us/Publications/Information-released-by-KiwiRail/New-Interislander-Ferries/12-Detail-Business-Case-external.pdf](https://www.kiwirail.co.nz/assets/Uploads/About-us/Publications/Information-released-by-KiwiRail/New-Interislander-Ferries/12-Detail-Business-Case-external.pdf)",
            "You only take it for occasional short stints, though, right? Z-drugs aren't recommended for long-term ongoing use. https://bpac.org.nz/2021/benzo-zopiclone.aspx\n\n> Long-term use of these medicines is associated with dependency, **an increased risk of falls**, **adverse cognitive effects** and an increased risk of motor vehicle accidents.",
            "The English language is rich and varied. There are many words that would convey your meaning without the risk of confusion. Numpty is one that springs to mind.",
            "Nah man, you’re thinking of “twat”.  “Nonce” definitely doesn’t mean “idiot” in the UK anymore (unsure if it ever did).",
            "Nah man. Nonce means pedo.",
            "Cool. What I said is exactly in line with the law.\n\n> (1)\nThe principal objective of every State enterprise shall be to operate as a successful business and, to this end, to be—\n\n> (a)\nas profitable and efficient as comparable businesses that are not owned by the Crown; and",
            ">What if the contractors who did the recent steering system install fucked up? Would that not reduce Kiwirail’s liability? I don’t know where fault lies. (Nor do you). \n\nI defintely agree. It could have also been human error. Yet reddit is working themselves into a frothy frenzy blaming the current Govt lol.\n\n>Congratulations. You have realised ships need berths. Big ships big berths…\n\nWe can see this but somehow Kiwirail and/or the previous Govt were too incompetent to realise this with the initial cost estimates. Or they lied about it.",
            "Well, yes.  She doesn't have a modicum of financial acumen.  But neither does Luxon.  And he was allowed to sit in a big chair at Air NZ for a while.",
            "I’m sure it is more somewhat more complicated than it sounds but Nutrient management sounds like they looking after a patch of dirt in simple terms lmao",
            "You'd think that's the case, but National's lost a lot of it's previous brains trust if there performance is anything to go by. i.e. Key wouldn't have walked into the this shit show or the one over cancer drugs not being funded. \n\nSo don't bet on them not using interns etc for spin.",
            "We've all been there ",
            "Loose bolts can fatigue and fail - especially axially loaded bolts (in the line of the bolt as opposed to shear.)\n\nYou can strip nuts on installation.\n\nThere are plenty of options for failure!",
            "I watch a lot of the Plainly Difficult youtube channel, and failing bolts are definitely one of the things that can and will go wrong if you fuck them up. But yeah, here I'm referring to the whole assembly, not just the bolt itself, since obs nut issues can happen as well for much the same reasons cited :P \n\nOr using the wrong fucking ones... \n\nAssuming you're not shitposting that is...",
            "Don't know much about about power networks do you? \n\n  \nThing is, NZ is so small much of our power network has only single lines carrying the bulk of the load. Add in heavily centralised power generation and the slow uptick in solar and local wind power generation you've got a recipe for a single point failure knocking power out easily.   \n\n\nLike what happened with Gisborne during the rain event a couple of years ago. Though that was also down to multiple breaks in the grid due to flooding and washouts.",
            "They aren't, but when you've got insomnia as bad as mine, there's fuck all other options. \n\nI could take two 2mg melatonin pills, which seems to work better than 1, but that's $19 for a month's supply, $228 for a bloody years already. So zopiclone it is, because lack of sleep leads to me loosing words (tip of the tongue/lethologica) at best, more insomnia and at worst, depressive ideation of the very unwanted kind. \n\nUnfortunately the FDA treats melatonin as a \"supplement\" so my previous attempt at getting some off Amazon was a shit show. And NZ law only allows 2mg and you have to see a neurologist to get it subsidised. Which is frankly bullshit, as we know it helps those of us with Autism and/or ADHD get to sleep and stay asleep more easily.   \n  \nAnyhow, the melatonin is finally kicking in so bed calls. Hopefully without amitriptyline induced, sleep disrupting night sweats.",
            "And nonce suits the Minister for Cars perfectly well enough, it's also far more succinct than my above mentioned take :P",
            "Google in this case was actually useful, in it's slang use it can also mean idiot, which is what I primarily use it for. Fuck knows where I picked it up, but I do know I didn't see it used for paedophiles anywhere near as much as I've seen it used for an idiot. \n\nUnfortunately Simeon's not enough of a nonce to call him a schmuck, which is just such a wonderful insult to use lawl.",
            "\\[CITATION NEEDED\\]",
            "Who ‘lied’? Kiwirail accepted a shipbuilders contract to replace ageing vessels with safer larger new purpose built vessels.  New berths were required.  \n\nPerhaps think of it like this.  You have two sections of highway and train track.  Between them is a deep gorge with a raging river astride an active tectonic fault buffeted by extreme weather.  The existing connection is rickety at best.  The use case for the connection is constant and growing. \n\nDo you accept the cost of maintaining and future proofing this critical connection having assessed all known challenges, costs and merits or do you second guess those who have and declare (immediate and temporary) cost savings your priority, whatever the ongoing increasing risk or unknown future cost might be?\n\nDo tell.",
            "PM gave her a book or two to read on economics when they were the opposition.",
            "Having had her in charge goes some way to explaining why we have so much nitrogen in our waterways",
            "https://dictionary.cambridge.org/dictionary/english/nonce\n\nhttps://en.m.wiktionary.org/wiki/nonce\n\nhttps://www.collinsdictionary.com/dictionary/english/nonce\n\nAnd for good measure...\n\nhttps://www.urbandictionary.com/define.php?term=Nonce",
            "It's the 2020s. To have a major project that is planned out and decided upon quadruple in budget is insanity. Where has that happened in recent nz history?\n\nI'm glad you ruled out lying about the potential cost. That only leaves incompetence. Which is what it's been all along since Kiwirail unilaterally pulled out of the project to share the berthing replacement costs between four major stakeholders.",
            "Bless thee for actually delivering citations. Unlike some who when challenged throw downvotes and nothing more. \n\nAnyhow, my search for it on google was actually fruitful and showed I'm not the only one who uses it for \"idiot\". No idea where I picked it up myself."
        ]
    },
    "'Didn't someone cancel the order?': Clark takes dig at Govt over ferry running aground": {
        "title": "'Didn't someone cancel the order?': Clark takes dig at Govt over ferry running aground",
        "score": 593,
        "url": "https://www.newshub.co.nz/home/politics/2024/06/former-prime-minister-helen-clark-takes-dig-at-government-over-interislander-running-aground.html",
        "content": "",
        "num_comments": 285,
        "comments": [
            "I’m starting to think maybe it wasn’t such a good idea to cancel a vital project without a backup plan …",
            "National party email received 2 days ago: “Dear Friend --\n\nNational is the party of infrastructure and, in Government, we’re moving at pace to remove the hurdles standing in the way of getting stuff built.\n\nInvesting in infrastructure is a key part of our plan to rebuild the economy and we’ve got so much in the pipeline already.”\n\n  \nlmao sure Chrissy, sure.",
            "Wow, that happened sooner than I thought it would (an example of why we needed new ferries in the first place).",
            "The government labeling the original two new ferries as \"Ferrari's\"  was hugely unrepresentative of what they actually were. A brand new \"Rav4 Hybrid\" would have been more appropriate. Yes they were bigger, and yes they had more bells and whistles, but that's what you get with a 35 year age gap in ship manufacturing. The decision to cancel the new ships WAS PURELY POLITICAL. I expect this incident to be the catalyst excuse the Tory's need to shutdown the Interislander completely, destroying the south island rail network with it. Well done truck lobbyist. You've won!",
            "Would it help if we reframed the cook strait as a very big pothole",
            "Nicola has a plan 😂",
            "Helen pulls no punches - love it.",
            "I’m honestly so pissed off. 😡 \nFirst they defund and cancel replacements, then they blame KiwiRail, next they’ll be trying to axe or sell. \n\nWhat do you wanna bet they have BlueBridge’s owners as backers in their plan to cripple InterIslander.",
            "Aging interislander ferry hits trouble.  No replacement plan in place.  Insert surprised pikachu meme.",
            "A few hours later and we might have had another Wahine",
            "Ha, put the boot in auntie Helen.",
            "Everybody needs to chill down. Landlords got their hand out, there's no need to look at how they afforded it, because our definitely wasn't a short sighted government that did it. /s",
            "LuxOn’S nEw zeALanD\n\nSeriously, it is the perfect metaphor for this government though.",
            "I know it’s not cost efficient to build a floating bridge between the two islands but damn it would be impressive and a real boom to domestic tourism.",
            "I thought part of the problem was that the infrastructure to support these new ferries needed to be changed to accommodate them.",
            "Don't worry bro. The corolla would keep going, at the expense of lives at risk.",
            "Sorry Helen but tax cuts come first.",
            "God I love her!",
            "Hmmm, sounds like people should just use a toll road. Surely a private-public-partnership won’t cost much /s",
            "I dunno Helen, Treasury didn't seem to think it was a good idea to proceed with it. I suppose you would know better\n\n[https://www.nzherald.co.nz/nz/government-releases-documents-behind-decision-to-cancel-cook-strait-mega-ferries/UF33UY3VQ5ELRI5ME37TTXD5HQ/](https://www.nzherald.co.nz/nz/government-releases-documents-behind-decision-to-cancel-cook-strait-mega-ferries/UF33UY3VQ5ELRI5ME37TTXD5HQ/)",
            "The country is run by a bunch of clowns... I don't expect anything less...",
            "Nearly as good as uranium on yer breath lol, but, wrong forum, point scoring zero.",
            "Both Willis and Luxon are as dumb as a sack of hammers.",
            "Imagine if you were the CEO of, I dunno, a company that perhaps flies planes instead of ferries. Seems like a great opportunity.",
            "clearly Labour's fault: they didn't cause the sea levels to rise quickly enough",
            "What if all Kiwis get a loan out and we get the interest written off, as the fares, like rent, will help pay down the principal of the loan ... why not do that instead only real estate investors get hand-ups?",
            "Even if they didn’t cancel the order they still wouldn’t of arrived and this still would of happened",
            "I think this was the perfect excuse for this left circlejerk sub to get their pitchforks out to get outraged at the current government. \n\nWho needs to worry about facts and accountability on why this disaster actually happened when you can just claim the superior moral high ground?",
            "Yea yea the multi year construction that wasnt even started yet would have prevented this incident thats was months after the project was scrapped because it had blowen out. scraped on advice by treasury.",
            "Clarke defending the shambles that was the IREX project tells me everything i need to know.",
            "Was the a National MP driving it. So when it went adrift last years was there a labour MP driving it?",
            "Hi DairyFarmerOnCrack. Thank you for your submission.\n\nThis appears to be a Political post, the flair has been changed to Politics.\n\nPlease feel free to [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fnewzealand) if you believe this was in error.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/newzealand) if you have any questions or concerns.*",
            "God shes hideous",
            "Would the new hyper expensive ferries be here yet?  No.  \nThis is misdirection, because even if the multi billion dollar new ferry program had been continued none of them would have even been built yet.",
            "Hey! National had a back up plan. They would buy something second hand. Theres 20 odd ships on this planet that will be suitable. Surely one will be old and run down enough for us to afford at some point /s",
            "World's longest flying fox sound good...",
            "BuT mUh TaX cUTs!",
            "there is a plan, National will buy a boat from Luxons & co's buddies at a marked up price",
            "You don't say",
            "The New Zealand Defence Force is still recovering from Helen Clark’s ‘cancelled orders’ in the early 2000s",
            "You should screenshot and post that email with all the logos etc.",
            "What they mean by \"removing the hurdles\" is they're working on Fast Track legislation that'll let Shane Jones greenlight whatever he wants based on who bribes him the hardest. Democracy is the hurdle they're removing.",
            "Party of bullshit",
            "Is that for real?",
            "in the pipeline = in the toilet / down the drain?",
            "So, we're getting a human pipeline between Wellington and Picton?",
            "\"Nebulous wishlist\"\nhttps://youtu.be/YBuGeYkE_QI?si=w22jnAUrktMP0I2W",
            "Tuition billboard anyone?",
            "Is this the big one? Or will there be another incident where people die?",
            "They have mentioned how much better they think the bluebridge is doing",
            "What’s a Tory?",
            "My thoughts _exactly_.\n\ncreepy.\n\n&nbsp;\n\nNot you. The current government. Also frustrating.",
            "then they could just cut the programme by 30 to 50 % like they did the roading maintaince plans",
            "You really want them trying to pave it over?",
            "You might hope for a cunning plan but I fear Nicola is more aligned with the intellectual credentials of Mrs Ploppy than Baldrick, who they say, knew one end of a turnip from the other.",
            "Love it how she’s the one who is having a crack at them. Not the opposition. He words are much more effective",
            "She also conveniently forgot to mention that she fucked up the defence force by cancelling orders herself in the 2000s",
            "Rumour is, that as the new ferries were going to make rail more competitive, trucking companies were not happy. And national was happy to help with that.",
            "Fully expecting them to go to market and an international company will get the contract and siphon billions out of the country.",
            "The neoliberal doctrine in a nutshell. The sooner we're rid of that cancer, the better.",
            "Conservatives the world over run public infrastructure into the ground, complain how bad it is and sell it off to private corporations. We are witnessing the first and second steps.",
            "Its no secret that Luxon and Mainfreight are buddy buddy. Mainfreight owns Bluebridge. \n\nI suspect this is entirely their plan to remove Interislander as a competitor.",
            "But kiwi rail said the ferries would only cost a few hundred million then ask for 3.5 billion a few months later because they didn’t bother to include the terminals. Kiwi rail should have been sacked. Before they cancelled the ferry order.",
            "Good on her considering no one else from Labour will.",
            "Exactly! Plus they can put my rent up now so that they can earn even more money :)\n\nObviously I'd be upset but I get $2 extra a week too! (No really... I do! I cant remember if it's rounded up or down, but it's basically $2).\n\nSo why are people saying things don't add up?\n\nObvious I'll use $2 to pay for my $100 rent increase, and then the landlords will give that money back to me (trickle down) and then I will be in a position to pay for whatever ferry service I want :) I'll choose one that doesn't crash, thanks.\n\nAnyway now that I've spelled that out for you and we agree it adds up. Can somebody help me understand one thing I don't quite get... When exactly DOES the money trickle back down? I know times are tough at the moment, but I'm starting to consider autocannabalism as an option. Free food, plus once i heal up there's physically less of me which means less caloric intake overall right? So anyway that part adds up to.. but I'm down to two thumbs remaining and soon i won't be able to type. It'd be really nice if my landlord could trickle down in advanced. Does that ever happen?\n\nAnyway only got one thumb left now. Also is it meant to bleed this much?",
            "Maybe this is how National helps the landlords some more? Want to rent a nice apartment in the sounds with a sea view?  Only $1000 a week.",
            "It even swerved to the right before crashing.",
            "It's not even Luxon. One random corporate douche? He's just a puppet.",
            "The entire problem was the terminals.  The ferries were being built under a $551M fixed price contract.\n\n\nBuilding piers that last 100 years in earthquake zone turns out to be really expensive.",
            "Just dont mention Corn around her without approval",
            "Politicians need to make tough decisions. Its going to cost a lot more if we can't get between our two major islands.",
            "Only on this sub would you get down voted for this comment.",
            "I dunno, at least some clowns are funny",
            "You're missing the point. There is no \"do nothing\" option here, it's a question of whether maintenance of these assets is more expensive than renewal.\n\n\nIt's also astonishing that the Nats cancel the order (renewal) and then criticize the fact that maintenance costs are going up. It's basic asset management.... maintenance keeps getting more expensive as things get older, that's why things eventually get renewed...",
            "Yes, but now we don’t have replacements on the way so not only did this happen, there’s no end date in sight where we don’t have to worry about it happening again",
            "At least we would have a plan for the future, because it's not like these kinds of things are going to stop happening.\n\nIt's like if your car keeps breaking down and is no longer well-suited to your needs. So you decide to order a new car, and while you're waiting the cost of new cars suddenly inflates and becomes far more expensive! Your current car keeps breaking down, but at least you have the confidence of knowing you've got the perfect replacement on the way. But shortly before it's scheduled to arrive, you cancel the order and get a partial refund.",
            "Yea totally but what's the plan now you reckon? ",
            "Ok so the replacement is just around the corner now, right?\n\nNo?\n\nThen what’s your point?",
            "How long does it take to build a boat?",
            "No but the problems are going to keep coming the older they get and the replacements getting pushed further down the road.",
            "Governments only give a shit about treasury advice if it aligns with what they're going to do anyway. It's a laughable excuse when any party does it. ",
            "Responsibility flows upwards. Project Manager, (responsible managers), CEO, Board, Shareholders.\n\n\n> The minister of finance and the minister for the relevant area hold all the shares in each state-owned enterprise. \n\n\nSo ultimately Willis and I assume Brown are responsible for ensuring their Board ensures competence and efficacy of KiwiRail. ",
            "Don't let facts get in the way of R/nz's righteous anger mate you'll get yourself banned",
            "Didn't tell you how to spell her name though.",
            "[removed]",
            "They are going to give every man, woman and child in NZ an inflatable kayak. Currently 55.90 from The Warehouse, but they can probably get a bulk discount / mates rates. \n\nThe population will then be responsible for rowing themselves plus small amounts of freight to “the other side” on a rotational basis.",
            "Sure, I've got a second hand boat you can buy. Don't mind the rust holes, a bit of bog will fix that. Yours for, hmmm, let's see... 3.5 billion should do it. \\*kicks tyres\\*.",
            "Less afford more justify the cost I think.\n\nThe books weren't all that bad until National came in.",
            "Surely there arw cheap ferries available somewhere in the world, that are better than what it's available now .",
            "I would pay to do that",
            "/r/angryupvote",
            "So you recognise the foolishness of National cancelling the deal, and the decades of problems it will most likely cause.",
            "Absolutely! I’m on the mail list for humour reasons.",
            "A human centipede if you will",
            "This is the train freight one. \nSo it will have economic impact - a much higher concern for our current govt vs working class human life",
            "Oh, people will die, then some more, then probably more. It’s the rights way to ignore such things. If not, there would have been one school massacre in the USA and that would have been it. \n\nBest we can hope for is a Nact sponsors vehicle get a scratch whilst on the ferry at some point, then we’ll see action.",
            "There was already a situation earlier in the year where an Interislander has an electrical fault and drifted for a while. It happened while in the strait so it was fine, but imagine if it had happened on approach to Wellington or Picton wharf.",
            "No, this is God's official warning. Like God's previous official warning when it broke down just off the south coast and put hundreds of lives genuinely in danger. He might be going to get bored of warning us, soon.",
            "Please let brook vv explain to the nation that while the deaths are regrettable its actually the lost productivity that hurts the most.",
            "And they've also mentioned that kiwirail maybe shouldn't run ferrys, ignoring the entire point that they run rail ferrys.\n\n\nI'd bet money they will spin off the interislander from kiwirail and privatize it.",
            "Funny enough Bluebridge doesn’t run a rail freight network, so not a threat to the trucking industry…",
            "I think I’ve spelt it wrong, should be Tories. It’s an old school term used to describe a UK conservative politician. NZ picked it up and gets used to describe National and ACT politicians.",
            "You think the team of \"We're gonna build us some roads yo\" hasn't considered it. At this point I wouldn't be _entirely_ surprised.",
            "Nursie would also be a suitable comparison.",
            "The greens are ripping into national too over this - saw some pretty strong words from julianne genter. If only labour had a spine too",
            "Why didn't Labour fund it when they were in Government?",
            "Was that for the jets?  Guess the difference being we were never really going to hold our own of someone wanted to invade but the interislander fleet is pretty critical day to day",
            "Ok but which of the following 2 issues has now actually happened? \n\n\n* NZ got invaded \n\n\n* NZ lost its only interisland rail link",
            "ah yes. we should all attach a list of our past failings to our contemporary commentary so that everyone knows whether or not we once fucked up",
            "National has several freight companies on their donor list who would not be averse to taking over all the railfreight in the south Island as part of their civic duty.",
            "That's not a rumour, that's a fact.",
            "How do the trucking companies think they’re going to cross the strait without a ferry?!! Smh",
            "With the Chinese premier recently visiting, I wouldn’t be surprised if hands were already shaken for a Chinese company to do it.",
            "And they are doing it right now in our hospitals…",
            "> Mainfreight owns Bluebridge.\n\nNo it doesn’t and never has. Bluebridge is owned by StraitNZ, the same people who own Freightlines trucks. \n\nStraitNZ in turn was until around a decade ago NZ owned, but was sold off by its owners to an Australian firm.",
            ">Mainfreight owns Bluebridge.\n\nI've just tried looking this up in the NZ Companies Register. I won't link because the bots automatically decide it's doxing, but...\n\n**STRAITNZ BLUEBRIDGE LIMITED (538668)** is 100% owned by **STRAITNZ LIMITED (6157928)**, which is 100% owned by **STRAITNZ FINANCE LIMITED (6223768)**, which is 100% owned by **STRAITNZ HOLDINGS LIMITED (6157534)** which is 100% owned by **BURGUNDY BIDCO LIMITED (8275360)**, which is 100% owned by **BURGUNDY HOLDCO LIMITED (8275303)**, which is 100% owned by **Terral Holding B.V** located in the Netherlands.\n\nWhere does Mainfreight fit in?",
            "Now all they need is a few useful idiots to repeat their talking points about “cost overruns” and “kiwirail bad”",
            "Not to support the national party in any way, but apparently Mainfreight no longer like National, and donate to the Maori party instead. \n\nBut not to worry, National now gets lots of money from Velocity Freight instead, Mainfreight’s competitor.",
            "Lmao, you just making up bullshit now.",
            "And designed to be completely operational after an earthquake, allowing the port to be used to bring in resources into Wellington after the big one…",
            "Even Grant Robertson was questioning the cost blowouts and asking for scaled back options before it came into National's hands, it's really not that surprising that National pulled the pin on it",
            "Name one funny clown.",
            "Perhaps they should have costed the project properly then, instead of lurching from blow outs to blow outs in a matter of weeks.",
            "Perfect justification for overspending on a flawed project /s",
            "Exactly. So the shitshow of a project quadrupling in price lies with Grant Robertson and Chris Hipkins.\n\nIf they'd kept the costs under control, or accurately planned and costed from the start we wouldn't be having this discussion.\n\nEdit I'm surprised (but shouldn't be) at the number of people here who are fine with project costs blowing out by 400%, with no end in sight. Left wing voters and other people's money I guess.",
            "if that was true why arent you banned? the victim complex never ends",
            "True that.",
            "Your comment has been removed :\n\n**Rule 09: Not engaging in good faith**\n\n> Moderators have discretion to take action on users or content that they think is: trolling; spreading misinformation; intended to derail discussion; intentionally skirting rules; or undermining the functioning of the subreddit (this can include abuse of the block feature or selective history wiping).\n\n\n\n---\n\n[^(Click here to message the moderators if you think this was in error)](https://reddit.com/message/compose/?to=/r/newzealand)",
            "I vote we organise the schedule by wealth, so that the wealthiest take the first shifts. Then when they all drown we sell their assets and buy some ferries.",
            "Maybe they could send the Wynyard Quarter ferry down ? \n\nhttps://www.rnz.co.nz/news/national/517129/free-ferry-trial-extended-as-wynyard-bridge-closure-continues",
            "If you stick em end to end you would probably have enough to cross the straight just by hopping from kayak to kayak. Problem sorted.",
            "Lol that gave me a good laugh",
            "With 2 hp engine thank you Nats.",
            "Turn it upside down and it’s your own home.\nVoila!",
            "Remember when the anti vax crew coming from the south island for the beehive occupation weren't allowed on the ferries without a vax pass? \n\nRemember how they did a call out for people with ships capable of carrying vehicles for some kind of Dumbkirk?\n\nLet's just get that brain trust back to the table for some work shopping...",
            ">3.5 billion should do it. *kicks tyres*.\n\nMate, that sounds amphibious, could easily get another 3 or 4 dollars",
            "Bog? Nah bro, Put that hawk tuah on it",
            "There are bound to be cheap ferries, but not ones that are up to spec. Either not carrying enough, take too much work to modify to met our standards, and possibly not stable enough.\n\nDont forget the cook strait is considered especially dangerous as a water passage by international standards. Which is why it was so infuriating this govt cut the program to build specially designed craft, that i suspect would be 20, maybe 30 years of service? Possibly more? Im pretty sure these ferries we use now are about that old, and were second hand so maybe 50 years of service.\n\nAlso have to remember, that other ferry could be anywhere around the world. I have my doubts that ferries judged unsafe for the cook would handle open water and international travel.",
            "There are cheap ferries. They're the ones bought by poor island nations who aren't too fussy about things like safety and maintenance. They're the ones that turn up in news articles of sinkings and mass fatalities.\n\nWe don't need cheap ferries. We need safe, functional ferries. They aren't cheap.",
            "That's mostly what we've got now, Aratere is the only one left actually designed for the Interislander service including the rail capabilities, Kaiarahi Kaitaki and Valentine are all second hand, and all are ancient.",
            "There really aren't.\n\nCook straight ferries have to be fast loading, roll-on, roll-off and fitted out for high capacity 3 hour voyages, but at the same time due to the nature of the Cook Straight they need to be completely ocean worthy.\n\nThe vast majority of the worlds ferries only have to met one of these requirements, either they take high volume short trips in calmer waters, or they're used for longer ocean voyages.",
            "There are cheap ferries, there are better ferries, there are ferries for sale. I don't think you can even hit 2/3. \n\nRO-RO ferries are also especially tricky, as are ones with rail capacity. To be able to roll on and off a large number of cars, you need fucking big holes at each end of the boat designed to navigate ocean swells. Most boats aren't supposed to have big holes, and those that are aren't usually supposed to see big waves, so you get even more issues to manage.\n\nThe other issue is slapshod buying used ferries makes it harder to maintain — the issue we have now. One requires one set of parts, another requires another, another requires another. If you just buy a bunch at once they can be made with the same parts so you don't need 3 different separate and non-interoperable parts supplies and processes and all that nonsense. So you save money in the long term from just buying a matching set of shiny new ferries.",
            "Roll on roll off, ocean going ferries are pretty specialised class and as soon as you add “first world economy”, everyone leaves the room.",
            "Nicola is that you?",
            "Absolutely. It was stupid and likely they will have to enter new contract arrangements with a worse deal or go for a second hand option with less life expectancy \n\nI’m saying that Helen Clark has very little room to point fingers about short-sightedness and cancelled purchases",
            "They're delivering *something* then.",
            "lol it sounds unbelievable 😂",
            "However it was the road freight companies that funded NACT not the rail freight company or the environment. \n\n\nSo I can actually imagine some seeing the Aratete out as a good thing for their personal gain.",
            "Losing the non-freight ferries would be bad, but not  a huge problem. People can just fly, and Picton would basically drop of the map overnight.\n\nBut the freight ferries.... that's a lot of freight, and that's without considering the infrastructure of getting train freight to a place where it could fly. If this ferry is totalled, we're pretty fucked.\n\nLet's not kid ourselves too much: This failure would have happened no matter who won the last election. The new ferries wouldn't be ready if the contract wasn't cancelled. We'd still be looking down the barrel of an unfortunate few months or years. The problem now is there's no light at the end of the tunnel. Hell, buying a second hand ferry from somewhere may get us out of this problem sooner than building new. Of course, it'll also land us back in this problem sooner.\n\nBeing poor leads to buying expensive things leads to being even poorer.",
            "Unfortunalty this. They are a government for business and money not the people.",
            "Or just run it into the ground and leave bluebridge as the monopoly which would both increase inflation and slow down our economy",
            "The company that owns Bluebridge also owns the trucking companies Freight Lines and Streamline Freight.  So I'm sure they would be quite pleased if inter-island rail transport were to disappear.",
            "That'll be Monday in question time. They want to land blows on Luxon and Willis.",
            "They were",
            "When Helen was in government?",
            "Strike force jets and (ironically) ships were cancelled \n\nYep, I’m not saying National’s move to scrap the ferry replacements was right, I’m saying Helen Clark has no business calling people out for cancelling stuff",
            "It’s nice to try and contribute, even if it’s not a lot.",
            "Apart from your very narrow understanding about what the defence force is actually for, all this shows is recency bias- it’s not a serious risk analysis",
            "Exactly right!",
            "Such as? The donations are public record, can you highlight who these donors are?",
            "The would-have-been ferries had dedicated infrastructure for handling trains. The alternative proposed by the national party will not be able to take trains and only trucks would be able to carry freight.",
            "I thought that would be about visas like they did with Australia recently, but yeah, why not both.",
            "Even without buying the ferries, we are going to have to upgrade the terminals anyway. It’s be insane to continues to have an earthquake prone terminus in the capital city.",
            "Still seems ludicrous to cancel it without a back up plan. They could always tax capital gains to get some more cash",
            "Kanye",
            "National roading budget is over 20 billion short, the cost of the ferries even with blow out was 10% the cost of these roads. National is just interested in helping out their donators rather than the country itself",
            "555mil on a fixed price contract with a South Korean company is a fucking good deal. There's no way in hell the Nats are going to save money by weasling out of it (hello liquidated damages!), and either patching up our current fleet or buying elsewhere.\n\n\nThe cost overruns were due to port infrastructure, and that is where the focus should have been by the Nats to apply their supposed business acumen. ",
            "You think it'll be cheaper in the future?",
            "How was it flawed and how much is the overspend, in your opinion?",
            "That is possibly true. Let's wait and see if those who talked of corolla can walk their talk. ",
            "... I haven't been banned and it was a joke. Did you feel it blow your hair as it went over your head?",
            "Like an Inflatable bridge complete with human chain system?! Good thinking, though it might be problematic if there are things being passed both ways, especially in a strong wind. \n\nStill, we can’t do worse!",
            "Dumbkirk. Fkn lol",
            "Something needs to be done though,  can't continue with this bs, get China to build some ferries there will be cheaper , to the specs needed .national are all about saving not spending.",
            "Delivering spam direct to your inbox",
            "Undoubtedly. \n\nFerries are woke nonsense. Build a bridge. ",
            "It's a tough market at the moment in logistics, this will for sure be a blow to KiwiRails Auckland-Christchurch service and a win for the truckies. If the ferry is a write off it's going to be a tough time for rail.",
            "Road freight is down a lot right now, and quite a few companies are struggling.\n\nIt wouldn't surprise me if this saves a few truckies from going under.",
            "Thank god trucks can float",
            "Absolutely! Follow their filthy money",
            "Except we aren't poor. \n\nWe have a government that is making stupid choices in what is a very rich country for its population.",
            ">This failure would have happened no matter who won the last election. \n\nNo, but there would at least be a plan in place to fix it.",
            "Fair point.",
            "Recency bias?! 😂 \n\n\nYou're joking, right? I wouldn't care if NZ got invaded yesterday or 10 years ago, that'd be a big fucking deal. The issues of the NZDF in the 2000s related to treatment of civilians and detainees overseas, and some reported concerns about general preparedness that as far as I can tell never resulted in any specific incidents with significant impact. \n\n\nIf you want this in PHIL101 speak, maybe ask yourself if you're experiencing some kind of attentional bias.",
            "“ $100,000 from Velocity Freight Limited”\nhttps://www.newshub.co.nz/home/politics/2024/05/national-receives-10-million-donation-haul-during-election-year.html\n\n“ James Francis Speedy gave National a $101,000 donation last year. The Aucklander has owned various transport and harbour businesses.”\n\nhttps://democracyproject.nz/2023/08/25/bryce-edwards-who-is-funding-national-to-victory/\n\n“ Most donations from businesses went to National candidates... Businesses involved in the automotive industry also contributed almost $30,000 to candidates.” \n(The ‘automotive industry’ includes freight and logistics)\n\nhttps://www.rnz.co.nz/news/in-depth/511353/how-electorate-candidates-funded-their-campaigns-and-who-spent-the-most",
            "Of course. Got these people are awful.",
            "She’ll be right",
            "I agree, if they're going to cancel it, they should have at least signalled what their intention is towards solving the problem, even if it's \"we're going to pause this and do a re-assessment of the options\"\n\npersonally I think NZ is out of its depth on this one, we should utilize experts from another country with more experience working on large infrastructure projects to run it e.g. Japan",
            "Absolutely! But the facts will make the NACTZ supporters little heads explode so they either ignore them or turn themselves into pretzels trying to defend this govt of clowns",
            "This isn’t about roads though. This is about mismanagement of a project. How can anyone have confidence if they can’t even cost it right?\n\nAlso, the term is donors, not donators. But feel free to evidence specific donors that would benefit",
            "lol! But if they did that their rich donors wouldn’t benefit",
            "that's impossible to say because the project was barely off the ground, yet managed to balloon several times with no end in sight. It's fairly safe to say the projected cost was by no means going to be the actual final cost",
            "My bad, what's the humour element tho, to help me understand your hilarious joke",
            "I say we should just extend the Mt Vic tunnel.",
            "Fucking brilliant.",
            "The ferries that were on order were price-locked during the middle of the COVID lockdowns when many other customers were cancelling their orders and Hyundai needed work to keep their line moving. We are never going to get a chance to buy such good ships at that low of a price ever again, from anywhere.",
            "Sure, Chinas ferries will be cheaper. Do you really want the cheap option for something like this? Odds are no, they wont be to the same specs the other ships would have been. Otherwise they would have been considered when the project initially started.",
            "The coalition is absolutely not *not* NOT about saving! It's about spending on its mates & other wealthy by making severe cuts in public & social funding.",
            "https://www.stuff.co.nz/national/politics/96756247/is-national-really-better-than-labour-with-the-government-books-well-not-really",
            "Fark me, you just have all the answers don't you? Bright spark Big brain yo!!!",
            "We're gonna build that bridge... and the South Island is gonna pay for it!",
            "If we built a bridge would buses be allowed on it - they are after all owned by transport companies. But each passenger on a bus is one less car burning imported fuel.\n\n\nIt is truely a philosophical dilemma.",
            "The ferry definitely won't be a write-off from this, but it will be expensive and time consuming to fix.   \nThe trucking companies will be rubbing their hands together, and announcing price increases first thing Monday morning",
            "I imagine like any business trucking companies need consumers to buy things before companies selling thing use their services.",
            "> Road freight is down a lot right now\n\nNot like that!",
            "We have massive inequality however and that is effectively making us poorer, as much of the concentrated wealth of the 1% is not reinvested here. Yes this comes back to brain-dead conservative governments and a left block that was too spineless to do enough when they were in power.",
            "If we keep buying old beaten up ferries, maintain them long past their given life span, and let other companies rob our Natural environment and take the profits of shore, we may yet end up one.",
            "Plus, now, with the benefit of hindsight, the now obsolete F16s would have been an expensive folly, given how many times we've been invaded since 1999.",
            "This is an embarrassingly poor response and parts of it are straight up misinformation \n\nHelen Clark’s decision to cancel a series of important defence acquisitions will not be overcome until around 2035. That’s 3 and a half decades of impact. \n\n\nNational’s decision to cancel the replacement ferries was the wrong one but the effects of that decision are not nearly as permanent:\n\n1. The ferry is on sand and may be operational in a few days. We don’t know. \n\n2. A replacement lease ferry could be operational in NZ within about 6-8 weeks\n\n3. Replacement ferries could be purchased and integrated within about 2 years\n\nYou are out of your depth",
            ">this isn’t about roads tho\n\nKiwi rail and roads both come under government infrastructure, both are funded under the same department, they are also definitely related considering ferries connect roading from north island to south\n\n>How can anyone have confidence if they can’t even get the costs right\n\nYou should be saying this about this government, they have more holes in this budget than a cheese grater",
            "Sounds like you’ve not run any sizable projects. \n\nIf it takes you 100 litres of fuel to get your boat back to shore,\n\nbut someone told you 50 would be enough,\n\n  \nwhat do you do? Just float around until you wash up?\n\n  \nWe needed that upgrade.",
            "The Cook Strait is part of SH1. As such, it's a \"road\" of national significance.",
            "So a normal major infrastructure project then.",
            "Don't encourage the mental gymnast, we have real gymnasts going ahead in Paris soon",
            "R/nz is left wing. \nThe ferry debacle is actually bipartisan at this point if you read Grant Robinsons last few correspondences with Kiwirail last year.\n\nSo the comment from Helen digging at Nicola is sort of redundant as Grant was doing it anyway before they got voted out, and Reddit trotting out the same tired tropes to rubbish national is just a bit lame.\n\nBut pointing this out or being too right wing is liable to get your karma dropped till you can't comment on political posts anymore.",
            "No easy answer then , kiwi  rail and national need to work together and get a solution,  instead of pretending it's OK, or privitise it like bluebridge.",
            "Buses for poor people yes. The cheaper the better. \n\nBike lanes of course would just negatively affect profits but with swimming always an option everyone will still have options on how to travel. ",
            "Precisely, it's based on poor policy choices, not the overall wealth or productive capacity of the country.\n\n>left block that was too spineless to do enough when they were in power.\n\nWe didn't really have a left block in power previously. We had a centrist almost Blairite Labour party in power. I would argue though that even they did a lot more address inequality than the current lot ever will.\n\nThe main problem is that we have a media/information culture that enables the brain-dead conservatism to thrive, so much so that it even infects the supposedly left wing mainstream party of workers (Labour).",
            "Yes. Typically (historically) conservative led government decision making has made us poorer in the long run. It is set to continue with the current lot.",
            "Yeah \"we should have increased military spending 20 years ago\" is a pretty tough position to defend, given we can now literally see 20 years into the future from 2004.",
            "There were also ships cancelled by Clark, not just F16s, and ground-based air defence systems \n\nStrike aircraft would have been used to contribute to wider regional and global security cooperative exercises and operations\n\nNow that some piloted aircraft are being replaced by unmanned systems we don’t have the people, tactics and logistics to support a pivot to those systems, which are essential to modern warfare \n\nIt’s also debatable whether F16 generation of fighters are obsolete given how that generation is performing in Ukraine",
            "You've failed to provide examples of real world impact (i.e. incidents) of NZDF equipment procurement issues. \n\n\nThe most basic principle of risk assessment is to consider likelihood x impact. The likelihood and impact of interisland issues are in front of us pretty clearly (this isn't the first issue, either). Nothing you've said indicates a higher level of risk from NZDF issues. You're welcome to try to actually change my mind, if you could be a little less myopic.",
            "Most organisations running sizeable projects don’t anticipate/tolerate blank cheque scenarios.",
            "It’s not a road of national significance https://www.nzta.govt.nz/planning-and-investment/roads-of-national-significance/#:~:text=The%20Roads%20of%20National%20Significance,a%20more%20resilient%20roading%20network.",
            "Wow amazing joke. \n\nThe right are getting better at comedy and making r/newzealand nervous",
            "There's a Cook Strait sized gap between concerns about cost overruns and fully cancelling a necessary project.",
            "hmmm oh yeah good 1.",
            "> R/nz is left wing.\n\nNo it's not mate. It has common sense.",
            "You want to give the service to the private company widely believed to have bribed (sorry I mean lobbied) National to cancel the project in the first place?\n\nNational created this problem, knowing the risk of another breakdown was likely. They dont get to reward their briber. They need to fix it.\n\nAlso, whats the point of privatizing? Wouldnt change the situation at all. Still no new ferries, and no private company I can think of could afford to purchase one, either new or used. I can however imagine National giving the service to their friend, then magically finding new taxpayer funding to pay for the private company's new toy. FUCK THAT!",
            "There was an easy answer,  but govt shat the bed in their storm of repealing anything that the previous one had got underway",
            "The media and unprecedented engineered interference in our last elections have a lot to answer for",
            "We had them for 6 years and they did fuck all",
            "Instead, our SAS contributed. Money saved. You're welcome to your opinion though.",
            "Instead, our SAS contributed. Money saved. You're welcome to your opinion though.",
            "Perfect, let’s do that. But you’ve missed the critical part of risk management which is mitigating/ treating the risk, so I’ll include that\n\n‘Invasion’ of NZ due a failure to sustain a credible military deterrent would be scored as having catastrophic impact with a likelihood of unlikely or rare, coming out at a risk of high or maybe very high. The time and cost to generate a mitigation to this risk is important. And since we skipped a whole generation of critical capabilities, current defence procurement won’t see this back on track until 2035, or beyond.\n\nLoss of inter-island rail transport for a period of time will have economic impact but in the scale of things it’s very low. The likelihood is certain (so it’s actually an issue not a risk but anyway) bringing the total risk score to moderate. The options to mitigate/ treat the risk have been mentioned in a previous comment of mine and what I failed to include was that other transport connections (such as road freight, coastal sea freight and air freight) could be surged to cover the disruption \n\nThe main issue here is not the risk impact but how long it takes to generate a viable mitigation. Observable evidence of an invasion emerging is far too late to act. An intermittently failing component of a transport network can be temporarily replaced very quickly with leased options \n\nI don’t mean this as an insult (but it might sound that way), I don’t think you will change your mind because you don’t understand the issues well enough. That weird ‘treatment of detainees’ comment was fucking wild",
            "It’s not though? Didn’t the wharf need to be bigger?\n\nthats not infinite money. It’s a cost increase for an essential service.\n\nMan people call the Greens luddites but it’s National that would see us with no ferries.",
            "Of course it is. Even Simeon said so ... \"then National Party opposition Transport Spokesperson Simeon Brown described the Cook Strait ferries as the “the biggest pothole on State Highway 1” after multiple technical problems with ageing ships\"",
            "I’m pretty sure we’ve found Simeon’s reddit account here. What a bunch of tosh you’re spouting.",
            "I don't think the right really cares too much whether r/nz is nervous or not. It pretty quickly lost relevance once the majority realized being kind wasn't a strategy for making a country productive.\n\nEither that or they've been down voted to oblivion",
            "Grant was also going to cancel it / withdraw funding so don't think this is a nat/lab problem it's a kiwirail/govt problem.\n\nKiwirail fucked up",
            "I mean, I'm sure there are people on here with a diverse range of values/perspectives.  \nPersonally, I think I've seen more critiques of the current Coalition government than praise, in terms of posts/comments for example.  \nAt the end of the day, I don't think any set of values, ideology or worldview holds a monopoly on ideas such as common sense or truth.",
            "Absolutely… don’t need to dig too deep to see which donors with deep pockets and vested interests ‘advised’ the coalition of chaos to dump the deal. NACTZ supporters now squealing how they wouldn’t be ready now anyway completely missing the point that we now have NOTHING in the pipeline for this essential infrastructure… also squealing that NZ was broke, couldn’t afford them, labour borrowed too much… blah, blah, blah Well let’s look at how much NACTZ are borrowing to pay for kickbacks to landlords and tax cuts for the rich…. Running down all our essential services so they can privatise them for their rich mates at tax payer expense… They are all for socialism and hand outs of tax payer money when it goes to them and the others at the top…",
            "Just remember New Zealand absolutely isn't corrupt. How long until we have our own Sewol Tragedy?",
            "Can you back up your claim of bribery?",
            " just need   a effective ferry service,  whatever is going to make it happen.",
            "New Zealand is susceptible to the kind of misinformation driven interference precisely because we have a culture of glorifying ignorance.\n\nEducation, critical analysis, and the like aren't valued here. This is also exacerbated by a media that is hell bent on serving up the necessary drivel.\n\nThis is not unique to NZ of course, but it is particularly prevalent here, even without Murdoch media.",
            "That's demonstrably false.",
            "Thanks for the validation!",
            "Who is going to invade us, that we have a hope in hell of defending against regardless of what we buy?",
            "You haven't taken into account *marginal* changes in impact. \n\n\nMitigation efforts in relation to the interislander have a huge marginal impact. \n\n\nWhereas, quite frankly, if some country (China is usually the favourite antagonist in this conversation) wants to invade NZ, then it would take an utterly preposterous proportion of our GDP to develop any kind of *credible military deterrent* that would actually make a difference to that level of risk. The contracts would be assessed based upon the marginal change in risk level, i.e. an imperceptible shift between \"extremely low\" and \"extremely low (but now with added helicopters)\". \n\n\nI'm sure you're far too smart to have actually meant to come across as claiming those contracts would have a significant impact on our risk of invasion. (Which is why I tried to lead you in an easier direction a few comments ago - emergency response preparedness - which is actually a far more defensible position)",
            "The [timeline](https://www.beehive.govt.nz/sites/default/files/2023-12/Project%20iRex%20timeline.pdf) would suggest otherwise",
            "I just posted the link to NZTAs list of RONS, and it’s not on it. I’m not disagreeing with its significance however.",
            "That it’s a verifiable fact it isn’t an official road of national significance? Do you have an issue with me spouting facts?",
            "You're delusional if you think that \"productivity\" is the biggest issue that decided the election. That's an issue that only the core right wing base of National and ACT care about. \n\nSwing voters cared about the cost of living crisis but both parties had solutions to this problem and the public had lost faith in Labour. Crime and co-governance were the issues that won the right the election.\n\nAnyway, you still haven't explained how your original comment was  a joke. But I guess you have said some things I find funny, but I don't think they were deliberate jokes.",
            "The terminals were the issue, not the ferries. The ferries were a fixed-price contract, and a fucking good one. There isn't going to be a better deal for purpose-built ferries that would last probably 30 years, maybe more. Looking for cheaper options for the terminals was a good call by Robertson, and it should have been done. National fucked over the entire country by cancelling a good deal without a viable alternative because they wanted to score some 'we're reining in spending, Labor bad' points, hoping the general public was too stupid to know anything beyond 'there was a cost overrun on this project'.",
            "Yep you are right. Unfortunately it might take an actual shipwreck to get some people to see how corrupt this govt is looking",
            "I had to google to double check- the wahine disaster was a ferry in the cook strait! Its steering failed as it entered the habour. 53 people died.",
            "Whatever is going to make it happen (short of time travel) would be reinstating the previous purchase or equivalent except significantly more expensive. \n\nWhich to be clear, everybody involved knew was going to be the result, National just gambled that they could pass it off to Labour before the ferries started breaking down.",
            "I didn’t come up with the [scenarios](https://www.reddit.com/r/newzealand/s/rKlN3fHdgQ)",
            "This is in danger of becoming a meaningful conversation and it turns out neither of us is as stupid as the other initially assumed\n\nI’ve got weekend stuff to do but all I’ll say is that you are right, very few nation states can defend themselves alone \n\nThe marginal component is overcome through investment in capabilities that contribute to a cooperative defence arrangement with like minded countries, where small expenditure delivers disproportionately high ROI",
            "What does this matter at all? The ferry service between our two islands is vital for the nation in many ways you banana. \n\n- We need to replace these ferries\n- The sooner we do it the cheaper it will be\n- We had ordered a great one\n- we cancelled the whole thing because the cost increased for the port.\n\nWhatever we do now will have a worse outcome for NZ. This was blatantly obvious at the time. Nact1st have flushed billions literally down the drain and made it worse. What possible future course is better as a result of having cancelled this work?",
            "I agree Labor had also screwed up co governance and allowed too much crime during thier term as well as stifling productivity. It's all basically the same thing 'just be kind'",
            "Yeah but the boats ordered were incompatible with the current terminals is my understanding"
        ]
    }
}