{
    "The camera man is the real MVP as he saves woman from getting hit by foul ball": {
        "title": "The camera man is the real MVP as he saves woman from getting hit by foul ball",
        "score": 23704,
        "url": "https://v.redd.it/rpqssplnn28d1",
        "content": "",
        "num_comments": 528,
        "comments": [
            "Camera man be like\n\n![gif](giphy|XreQmk7ETCak0)",
            "r/PraiseTheCameraMan indeed",
            "We want to see the reactions wtf\n\nThe internet has been around for so long. Why are people so shitty at clipping videos? Or is it done poorly as some type of ragebaiting technique? It makes no sense to me",
            "I like the woman’s 40 sheets of paper defense…",
            "\"You ladies alright?\"",
            "She thought Paper would win over Rock",
            "For the first time in history, Camera man has intervened to save a person.",
            "a man that has arms like that and looks like that should be in front of a camera. i dunno… it’s 4am i’m drunk and horny…",
            "This guy isn't the cameraman... neither of his hands are touching the moving camera",
            "So she did the \"if I dont see it it will not see me too\"?",
            "If you don't practice catching in the early years, you'll be afraid of it. So, dads all over the world go and play balls. And after that train a little catching and throwing with your loved ones.",
            "What a dude. Cutie too.",
            "Is it me or will the notebook have saved the day as well?",
            "but the cameraman was actually behind her hiding away. not sure if she actually checked that there was a mvp right beside her.",
            "Cameraman doesn’t understand journalistic ethics. You never interfere in the story.",
            "I did a similar thing at a Volleyball game once. Kids volleyball, Grandma came to watch. Ball gets loose at a good clip and is coming toward us.\n\nI didn't actually know it was going to hit her in the head, I just put my hand out between it and her head because it MIGHT happen and it did. It went right into my hand. I can't one hand catch a speeding volleyball so I batted it back onto the court.\n\nIt was cool, I felt cool for a day, lady behind me clapped, someone said \"nice\", Grandma hugged me. Fun day.",
            "She better let him hit",
            "He is a Super-man! 🦸‍♂️",
            "That’s Heidi Watney. Shes the most beautiful sideline reporter in the world. The cameraman did a service of national importance ",
            "So instead of getting just one ball in the face she might end up getting two…",
            "Ser Criston Cole",
            "Pretty sure that flimsy paper note book would have stopped that..",
            "“And that’s how I met your mother.”",
            "I’m late? That saved weeks worth of tv appearances",
            "👍",
            "I watched this without volume and all I ocukd hear was the DBS Ultra Instinct intro.",
            "The way the laughs sync",
            "Good catch and foooinne",
            "Oh the less I know the better",
            "“And that kids, is How I met your mother”",
            "Yea, ya note pad should stop it!",
            "He’s the Man",
            "Don’t forget, he didn’t saved the girl, he got finaly his ball from the game.",
            "👍",
            "White Sox should recruit this guy for shortstop",
            "So where is there part that they married now?",
            "Camera man should be on the team",
            "Not sure he is a camera man. He isn't manning a camera when he catches the ball.",
            "Two kinds of people\n\nBlockers and catchers",
            "A Hero",
            "You mean A2.",
            "👍",
            "It… wasn’t the cameraman? It’s very clearly the guy you see in the last shot. He’s even holding the ball. And in the shot, you can see him holding a beer in his non-catching hand.",
            "That dudes face in the back lol he was cringing before anything happened",
            "Did a search and there are a huge amount of Mandela effect claims that there was a blonde woman with loose hair and gray shirt vs black woman in the Gillette commercial where the baseball catch saves the reporter…. But no one produced this video\n\nWhen did this occur? Who are these people?",
            "Get man on the damn team, what a catch",
            "nice!",
            "He's a very good lawyer.",
            ":o",
            "She having a seizure at the end there or just imitating a seal",
            "/r/praisethecameraman",
            "She looks like the on-field reporter. He knew her.",
            "Someone should edit this and make his hand big and red like looney tunes when he gives the thumbs up",
            "The beautiful Heidi.",
            "\"I just wanted the ball for myself\"\n\nThe cameraman, probably.",
            "😁👍",
            "I wonder if x players sometimes become camera men. Or maybe he wasn't good enough to play but wanted to be oart of the game still.",
            "I wonder if x players sometimes become camera men. Or maybe he wasn't good enough to play but wanted to be oart of the game still.",
            "He’s hot",
            "The cameras moving when he reaches in the front I don’t think he’s the cameraman",
            "This gives me r/dadreflexes vibes",
            "Here's an idea: run netting all the way to the foul poles.",
            "Nice grab…⚾️",
            "Time for some Hawk Tuah",
            "r/praisethecameraman",
            "hopefully he gets some hawk tuah",
            "Bare handing a major league foul ball is hella impressive. That's gonna be one sore mit tomorrow, I tell ya.",
            "Not like the ball would kill",
            "Looks like she wanted that ball to the face!",
            "That is the look of terror in a married man's eyes.",
            "There’s like entire threads in this comment section of guys proudly suggesting they would have reacted without shielding their faces. It’s definitely worth it for the chuckles",
            "That's a sound guy",
            "She better hawk tuey to thank him",
            "good thanks !!",
            "How I met you mother",
            "☺️👍🏽",
            "That pretty ring was about to get dinged. Very fortunate. Here’s to camera guy, hip hip hooray!",
            "Haha, this is why it's good to be kind to people. You never want to give them a reason to not stick their arm out for you. That camera man is a homie. Hope she buys him a xmas gift this year.",
            "Amazing catch, but she already had a shield",
            "Quick! Use your paper as a shield!",
            "He should have given her the ball",
            "Hope he got her phone number. That must have stung his hand.",
            "I’m pretty sure that notepad she was using would have done the trick too.",
            "It’s not the camera op. He’s a floor manager or assistant producer I’d imagine.",
            "Good thing she didn’t have the same reaction with a beer or chili dog in her hand.",
            "Uhh sorry, I have a boyfriend.",
            "Daredevil working as camera man.\n\n![gif](giphy|FnF7vgz2oON3i)",
            "It's like the start of a K drama",
            "Dude still can't get a date",
            "Ask for a date right now.",
            "“So uhhhh what are you doing after this?”",
            "Go Braves!",
            "Still in the friendzone.",
            "Get that man a contract.",
            "👍",
            "This is a good one for r/praisethecameraman",
            "He's getting the Puntaang now",
            "She owes him a blow@&$🫢",
            "You know they eloped after.",
            "Being hot helped",
            "Sigh women",
            "She obviously had her notepad for protection.",
            "That night, she blew him for the first time",
            "This isn’t the person operating the camera with the big lens who caught the ball. The guy who catches the ball is reaching out his right arm behind the cameras lens, which the camera lens is turning to follow the ball as well. This guy can’t possibly reach out from behind his camera and also pan the camera to follow the ball.\n\nThe person operating the camera is the person who took the shot of the woman who was saved and the guy who caught the ball.\n\nGreat save! Just pointing out he’s not the camera operator for the camera seen in the video, he’s likely an audio person or a PA",
            "“Saved”, getting dramatic today aren’t we?",
            "It constantly amazes me how many people seem to have absolute zero levels of survival instinct.",
            "It was a bouncing so it lost a lot of energy already",
            "I was expecting a comment about the commentator's and her laugh syncing up, and all I find are comments on her \"poor survival skills\" by armchair athletes.",
            "And then they fucked",
            "Did she get the D?",
            "why didn't she try to... dodge",
            "Here it comes. I'm just gonna let it bounce off my head!",
            "Is that throw a foul ? What is the point of the rectangle ? Baseball is weird for non Americans.",
            "What's her IG?",
            "Men will be men... even if women don't need us anymore!",
            "0 survival instinct",
            "Ye he got laid",
            "“Since I just saved you from having this ball smack you in your face, how about you let me smack these balls in your face?”",
            "Not really next level tho",
            "I’d like to see the bear do that.",
            "Someone getting a beeej",
            "That's an anime level save.",
            "Not all heroes wear capes.",
            "I ship them 🥺",
            "like a boss",
            "Thank you so much Jesus for your love towards us",
            "and that’s how i met your mother",
            "They would make an adorable couple",
            "someone's getting super laid",
            "Let’s hide like a cat: if I can’t see the projectile, it won’t hit me.",
            "So they’re married now?",
            "Hope he got a hawk tauh as a thank you",
            "I hope he got rewarded post work 😈😈😈",
            "Still in friend zone after that save… damn bro",
            "She needs to repay the favour in kind 😉",
            "I like how she also leaned into the trajectory of the ball",
            "No, I'm pretty sure the guy who kept her from losing teeth that night to a baseball is the MVP. Camera work was good though.",
            "And that kids, is how I met your mother",
            "She better hook him up with the Hawk Thua for that save.",
            "She owe him a hand job",
            "Life or death for 'Watching sportsball'\n\nyay sports ball yeahh",
            "\"And that's how I met your mother\"",
            "She owe him a favor for that ![gif](emote|free_emotes_pack|sunglasses)",
            "even this couldnt save him from the friendzone",
            "earned that pussy yoooo",
            "Later he got in trouble for saving another woman.\n\n\"Who is she?? Do you love her??\"",
            "\"And that, kids, is how Iet your mother.\"",
            "Girls that don't play ball sports have the worst instincts with fast moving objects.",
            "What a chad",
            "She took the worst possible action. Hid behind a thin paper book, blocking her vision while gaining almost no protection. \n\nGood job camera man!",
            "Saved her from a nasty boo boo",
            "She owes him at very least a blowy.",
            "Toxic masculinity. 👎🏼",
            "Simp",
            "Earned a bj",
            " his balls were in her hands later that day",
            "The resulting blow job was thorough, my friends.",
            "And women actually think they are equal/better than men 😂",
            "Yeah, that notebook wasn't gonna block shit.",
            "He's getting that hawk tuah",
            "She really thought paper beats rock in real life 🤣",
            "0 self preservation",
            "Poor attempt from her, why is she even moving towards the position of the ball? Makes no sense.",
            "Survival instic 0",
            "Saved her livelihood. With talent, their face is the money  maker and a broken nose or broken jaw could mean she'd be out of a job",
            "This gif always cracks me up idk why ",
            "\"I'm a really good cameraman.\"\n\n- a blind cameraman who fights crime at night.",
            "That's how I met your mom vibes",
            "That's the sign of a dude who is already looking forward to how hard he is about to get laid by either his partner and/or a whole bar full of folk.",
            "This dude works at meta now! Lmao",
            "I just see a blue square instead of Gifs every time :(",
            "Where is he now?  Edit :  never mind I scrolled  down.",
            "Smoooooooth like butta'",
            "that kid's probably a disgraced police chief by now",
            "That guy is for sure not a camera operator, he is either doing audio or is the stage manager.",
            "Thats tiktok lvl editing. Ruining 90% of all videos",
            "If the video were longer, TikTok zombies wouldn't want to watch it.",
            "you'd think sportscenter would be better than that",
            "In her defense, that much paper would dampen an impact significantly. It's not nothing.",
            "It's a notepad, it would absolutely have massively reduced the impact.",
            "If you watch it closely, the ball looks to be veering left and away from the notebook and right into her face.",
            "Yeah, I'm sure you and the 300 people that upvoted you would have had a better plan with a second and a half advance notice.",
            "Hard cover",
            "Everyone should carry a phone book.",
            "I feel that that ball would have just smashed her paper shield right into her face ",
            "Props to her though for focusing on the game and seeing the foul come straight her way. My mind wanders when I watch baseball, I'd probably get hit in the face",
            "If I can't see it, it can't hurt me",
            "How do you see it coming from that far away and not just, like, lean your upper body in one direction or another?",
            "![gif](giphy|29IaouO2ChKhrBOTuW|downsized)\n\nThis is what the paper defense reminded me of.",
            "I want you to go find the episode of MythBusters that involved them testing paper armor and then get back to me.",
            "This deserves more up votes.",
            "Praisethecamaraman",
            "LOL, y'all are wild.",
            "I want a man in my bed too",
            "Who up playin with they worm?",
            "I think they would make a cute couple",
            "You do you bro!!!",
            "Probably the sound guy",
            "She did “oh fuck, I have a half second to save my face, use what’s already in my hand to shield it”\n\nY’all do know the part with the catch is *slowed down*, right?",
            "Oddly people act really wierd with stray balls. If you're ever playing football with some friends just randomly shout \"Heads\" and everyone immediately ducks and start panic moving in random directions without actually looking up.",
            "It’s a human reaction. You want to protect three important senses or not? Eyes don’t grow back, and if you break your nose, chances are you might not smell as well as you used to. Even fucking up your mouth isn’t desirable. Whereas the skull can take a beating like this pretty decently. \n\nA baseball to the face isn’t pretty, and I have experience with that. Lost 5 front teeth as a kid in a direct pitch to the upper mandible.",
            "no, she did the \"That ball is heading for me, time to shield my face\", if you don't understand that then you should probably get your tapwater checked for traces of lead",
            "This may be surprising to you, but closing your eyes is a natural reflex when something is heading toward your face designed to protect, well, your eyes.",
            "Be gentle, she had a near death experience.",
            "No, she held up what looks like a rather thick notebook which would have done a pretty good job of protecting her.",
            "He’s suck a good friend.  Yeah and she was right.",
            "Ah the ostrich defense",
            "ye olde ostrich trick.. works everytime 60% of the times",
            "\"All over the world\" 😂😂😂😂 Let me tell you a secret...",
            "It wouldn't have, but she could have leaned to her left and avoided the ball altogether.",
            "It’s just you. What exactly do you expect some paper to do against a hard ball coming at your face 80+ mph?",
            "It'd've helped, though \"saved the day\" might be generous. The ball was 66 mph off the bat, so not a relatively hard shot, but certainly enough to hurt, even through a notebook.",
            "You people are such weirdos",
            "That’s just foul",
            "Bro",
            "Spoken like a true virgin",
            "why even scroll predictable-ass reddit comments anymore smh",
            "You mean smash",
            "Why?",
            "Incel.",
            "[deleted]",
            "She better hawk tuah him.",
            "Still in the friendzone.",
            "What a cringey thing to say.",
            "Ah yes, the incel transactional mindset. ",
            "He should at least get to third base with that.\n\n('that catch', not 'that woman')",
            "He got ejected from the game for interference. They claimed he reached over the field.",
            "She better hock too and spit on that thang.",
            "I mean, getting hit in the head with a baseball can fuck a person up",
            "The book would've deflected the ball just fine, what did you want her to do?",
            "You mean like protecting your head?",
            "[removed]",
            "I remember reading a post from my country’s subreddit. Where the op states that there was a guy who was glaring at him from inside his car (when the op pulled up to the restaurant). The op said that he went up to the guy.",
            "You would’ve done the exact same thing except nobody would want to save you",
            "https://en.m.wikipedia.org/wiki/Strike_zone",
            "Foul because it hit the ground near the batter, *then* went out of bounds. It must enter the playing field to be ruled a live ball/good hit.\n\nThe rectangle is the strike zone, 3 strikes you're out.",
            "The rectangle is a visualization of where the pitcher needs to throw the ball for it to count as a strike. Anything outside of the rectangle would only be a strike if the batter swings and misses",
            "Complete with balls to the face. Definitely better late than never.",
            "1.5 secs to react",
            "I wonder what that person is doing right now.",
            "It's the stiffness, bro, the stifness.",
            "Same 😂",
            "“Idk why I find this notoriously funny gif funny”",
            "I understood that reference.",
            "Batman isn’t blind…",
            "A whole bar of folk… or a whole bar of Xanax, amirite?!\n\n_Answer: no, I’m not right. Just a druggie excited to dose up before the flight home from France._",
            "Yep, possibly line producer, but *not* the camera man. Camerman would be more likely to get their $100,000 lens out of the way rather than take one for the talent.",
            "I didn’t think tiktok allowed videos without one word rapidly appearing at a time in huge font directly in the middle of the video taking up 60% of the little space left by various buttons and sub text. There wasn’t a completely random song blaring over it either.",
            "This problem has existed long before TikTok was a thing",
            "*slams into fingertip* \"hnnnggg\"",
            "Even just spreading out the impact to the size of the notebook makes a big difference.",
            "for sure. alter trajectory. We’re talking difference between ER (maybe overnight) and a subpar day",
            "Depends on what's written in it. If she wrote a heavy hard sci Fi novel it will probably stop the ball dead. A few notes about the weather however, won't do much",
            "Nah, that’s just the camera angle.",
            "This made me chortle.",
            "Thats baseball baby! Took a massive left turn from the spin",
            "Personally I don’t use basic reflexes, I simply manifest a time dilation bubble and formulate the best possible defense mathematically",
            "reddits training of doing nothing but play video games all day and watch marvel shit has prepared them for every situation in the world ever.",
            "I would've just moved.",
            "A *wet* phonebook even.",
            "I hear the new ones are here.",
            "The Omar Defense",
            "Eh, spread out force is at least better than direct force. Still would probably hurt tho. GG cameraman",
            "Forming a sort of pre applied bandage",
            "We got sherlock over here",
            "Do you pay attention when you’re at work performing your literal job?",
            "You didn't see it hit the ground and change directions every time?",
            "This might be surprising to learn but the slow motion here is actually only a visual effect added to the video, in reality the ball is going much faster than you can see here",
            "I'm over here stroking my dick I got lotion on my dick right now",
            "> I have a half second\n\nI did the math on this once, before MLB installed nets, and for the area she's in it's more like 250ms if the ball is 110mph off the bat.",
            "What do you mean ? Every redditor here is the flash and could clearly think of something better in that fraction of time. Smh",
            "Yeah wtf, she was obviously shielding her face from getting pelted by a ball, what are people talking about?\n\nWomen really can’t do anything on Reddit",
            "Yeah, but why is it slowed down?  Because the camera man did the fucking reasonable thing and slowed time like an adult. You want me to believe you can just “play back video slower” or what?",
            "It seems to me that both sides of this argument are being a bit hyperbolic. She had more than half a second and shielding her face wasn't really that bad of an idea. Likely the ball would have impacted the notebook and deflected enough to not hit her. Still wouldn't have been pleasant on her hand I'd imagine. Her response wasn't the worst, but it wasn't great either. Realistically taking your eyes off something you need to respond to isn't a great idea. In this case it likely wouldn't have mattered much. \n\nUltimately both sides of the argument are silly imo, someone else caught it. She could have been doing the macarena back there and it wouldn't have mattered.",
            "one time when I was like 9 or 10 I was at my sister's softball game playing in the sand mound and I thought a foul ball was going to hit me on the noggin so I ran as fast as I could. Every time I looked up it was still on top of me, like a homing missile or something. Then I unexpectedly tripped over my shoelace probably a good 10-20 yards away from where I originally started running and when I looked up the ball was headed directly for my belly. My life flashed before my eyes as I put my hands up to protect myself and somehow ended up catching it. To the people in the bleachers it looked like I was a 10 year old that ran 20 yards to make a diving catch on a foul ball and a few people in the bleachers clapped and cheered and got a lot of amusement out of it. I remember getting up and handing the ball to the ref like it was no big deal and my dad was so proud of me that I couldn't stand to tell him that it was really my severe lack of awareness and coordination that caused me to catch the ball.",
            "You might get hit in the face if you look up",
            "Really? Noone taking on that sentence 'people act really weird with stray balls'?",
            "Covering your head and ducking is what you're advised to do when mountain climbing if you get warned of a falling rock.\n\nOne time a guy belaying near me decided instead to look up and got promptly smashed in the face.",
            "I took a hockey ball to the face from about 12 feet away as a teen and broke my jaw. Couldn't smile for ages, and could only eat liquid or very soggy ( ie: no chewing) food. To this day I can't stand the smell of Weetabix.",
            "\"Hey son, let's go outside and play catch!\"\n\n\"Why? Am I training to be the ball boy in tennis or what are we doing here? We're in Sweden, there're no baseball teams here and it's the middle of summer, just go get my skis and let's get to practice dad\".",
            "There's like, 2 countries where baseball is a major sport.\n\nCricket is way more popular across the world.\n\nFriggin Americans, always assuming the world is just like them.",
            "![gif](giphy|EtogbOL6Y7aOQ)",
            "average reddit basement deweller",
            "Why so serious, soldier?",
            "Eh, I think it's pretty fair",
            "Yeah he could do batter.",
            "Dude",
            "It's everywhere. Not just Reddit. The original video on TikTok had a very similar top level comment",
            "Why not try outside for a while",
            "And that kids, is how I met your mother. \n\nShe brought me to your house But now I need to get back to my own home, wife and kids",
            "Bang",
            "Some people let the lizard brain take the wheel. Others lead with the frontal cortex.",
            "Because it'd be a nice thing to do 🙂",
            "Why do you think stupid.",
            "More like uncel tbf.",
            "If only things actually worked like that, the world would be a happy place.",
            "I just saw this meme on Insta today and I'm already sick of it. ",
            "*HAWK TUAH* on that thang!",
            "Wowsers that’s wild. Then what happened?",
            "Adding to this... Also, the little circle that appears briefly is where the ball was (and also has its speed), in this case out of the strike zone. That little circle was not filled in, indicating that it was calculated as a \"ball\" (had he not swung).\n\nSo yeah, unlike cricket where if you swing and miss a bad throw it's still a wide. Also unlike cricket in that it's not played in 360 degrees so there's potential of a foul ball, like in this case.\n\nAnd also none of this strike zone tech actually matters because even though baseball has the technology to call this perfectly (there's a better 3d version, too), flawed human umpires are actually calling the balls and strikes without any help and sometimes get it wrong and those calls are not reviewable or even arguable. It's only the audience who gets to see if umpires got the call right or wrong.\n\nOh! And the only umpire who is any good at the close calls is currently benched this season for allegedly gambling.",
            "![gif](giphy|THWZYFFJueWv6|downsized)\n\nThis is him",
            "dudes name is brent rambo. hes recreated the meme a few years back.\n\n  \n[https://imgur.com/when-you-find-thumbs-up-kid-get-him-to-recreate-meme-as-adult-kYVSsqB](https://imgur.com/when-you-find-thumbs-up-kid-get-him-to-recreate-meme-as-adult-kYVSsqB)",
            "Like right now, right now?",
            "He was my guild leader in EQ and WoW. He also builds amazing custom PCs, and delivered one to me a couple of months ago. Great dude.",
            "Turning in his damn grave",
            "There are no line producers in sports television, but you hit the nail on the head with the price of that camera.",
            "Cameraman saved her 😳\n\nThanks god the text was there, otherwise noone would notice",
            "I cannot overstate how infuriating this trend is.",
            "I like the ai subtitles that are never correct, that really adds some joy to the experience.",
            "Tssssssssssss....",
            "r/commentsyoucanfeel",
            "Even if it takes half a mph off the balls velocity I would try it",
            "Let’s test it on your face",
            "You mean the camera angel",
            "Finally, someone has common sense.",
            "Always these elititst mistings, thinking they are better than the rest of us.",
            "Hmph.  \n\n\n*pushes glasses*",
            "Oh, like Sherlock from Guy Ritchie movies.",
            "Ok, there Dr strange",
            "Okay Dwight",
            "Do you know how many hours I have in Diablo 2? I could teleport to the danger and then use blizzard to take it out. With no friendly fire. Easy. ",
            "don’t forget mass stir baiting to increasingly creepy cartoons with both hands? That’s got to confer a little coordination improvement - in the off hand?",
            "David Foster Wallace is that you?",
            "Nice try boss",
            "Honestly?  Not that much...",
            "This sounds like a trick question",
            "Neither did she",
            "There probably wasn't even a thought process. This reaction is 100% just instinct. You'd do the same reaction with car careening at you.",
            "Luckily this wasn't that fast, statcast puts it at 65.8 mph. Your point still stands though.",
            "They usually get associated with OF references",
            "Or anywhere else, for that matter. /j",
            "> Women really can’t do anything on Reddit\n\nNo, what women appaerently can't take are innocent little digs and jokes at their expense. \n\nYou're not victims here lol",
            "Even in this slowed down clip it was 2 seconds from the bump where she starts shielding to the ball being caught. This seems slower than 0.5x but even if it was we went from half a second to a second which isn't much better.",
            "Task failed successfully.",
            "I got hit in the jaw by a field hockey ball after someone said ‘watch out!’ and I turned around to see what for. \n\nOn the other hand, it might have hit me in the neck or back of my head otherwise. And that might have lead to a shittier outcome than eating through a straw for weeks.",
            "Exactly.",
            "Brännboll is the unofficial national sport in Sweden and every kid here is trained in the importance of the enhandslyra.",
            "I think he just meant, “Hey son, let’s go outside and *insert sport here*”",
            "do cricket plays not catch the ball? they just bring out a new one every play?\n\nwhat a weird comment.",
            "I've got news for you. Cricket uses a lot of the same skills as baseball, including catching and throwing.",
            "what's the second one?",
            "Do you and the other dude not realize he was just suggesting that dads should just play catch (regardless of whatever form that takes) with their kids? Are your American hate boners so strong that logic is lost on you and require you to word vomit online for everyone to see?",
            "2 countries? All of the Americas. and the numerous US influenced pacific countries all have huge baseball presence, and the rest of the world has a decent amount too.\n\nCricket is huge in the rest of the anglosphere, but it’s at best as popular as baseball in the rest of the world.\n\nTalking out your ass is pretty funny though!  Being so confident that others are too focused on their personal PoV then talking out your ass based on your own PoV is so on point for your type. I can tell you live/lived in a current or former British territory entirely based on this comment.  Which one are you in?\n\nPlease don’t post me some link saying cricket has more viewers, I’m well aware that cricket is huge in previous BEIC that houses ~a quarter of the global population.",
            "Aw, is somebody upset that the US still dominates at Cricket even though most of us had no idea we even had a cricket team?",
            "Buddy",
            "Hey, Reddit is on mobile now. You can do both.",
            "After all this I'm confused. Who's the catch, guy or girl?",
            "Must…say..first fucked up thing that comes to mind! We can’t resist precious!",
            "[deleted]",
            "[deleted]",
            "I just learned about it within the last few hours from a Reddit post or comment and found it on knowyourmeme. And guess what – the young lady is merchandising the “phrase”. (It’s “hawk tuah”.)",
            "Yeah, not sure what is so special about it.",
            "No it isn't, he's using the wrong hand for the thumbs up. ^^^/s",
            "After all this years he's still showing gladiators mercy. King.",
            "![gif](giphy|3o7TKGMslz2YfhkuwU|downsized)",
            "Perfect thread combo.",
            "He's him",
            "So cool!! 😎",
            "He’s still doing it!",
            "Very slightly looks like Day9",
            "That's a great name ",
            "Homie has the greatest last name of all time. Only way he could have a better name if he was named Chalupa Batman.",
            "I don't care what the truth of the matter is, that's baby John Carmack and it always will be to me",
            "dead link",
            "Like right this instant. ",
            "\"noone\" lol I always giggle when I see this. It feels right when you type it because \"everyone\" and \"anyone\" aren't two words, so \"noone\" feels like it follows that pattern",
            "Plus, the headphones, she actually had a pretty good chance of just getting rattled, but still, pro catch.",
            "This made me laugh much more than it should have.",
            "![gif](giphy|DzHxWGfHeXpZ8PVA0K)",
            "Or maybe the camera devil",
            "r/unexpectedsanderson",
            "Am I safe to assume you aren’t an on-field sports reporter by profession? Lmao",
            "No ill catch the car bare handed.",
            "Funny",
            "Look whose all misogynistic and aggro this morning. Too much creatine in your morning tea",
            "Calm down; she didn't murder anybody. She just had a different opinion on the Internet. (Or does that defense only work when you use it to defend transphobes?)",
            "I took a hockey ball to the face from about 12 feet away as a teen and broke my jaw. Couldn't smile for ages, and could only eat liquid or very soggy ( ie: no chewing) food. To this day I can't stand the smell of Weetabix.",
            "But no self respecting swede would practice for brännboll. You're shamed into learning it in primary school.",
            "Japan.",
            "Shohei land hell yeah brother",
            "four out of seven central american countries, and eight out of twelve south american countries, have no current representation in mlb. five of them dont even have a national team.     \n\n\n\nhuge presence indeed.",
            "The reason you saw a story about US cricket is because it was a shock result. The US does not dominate at cricket.",
            ">US still dominates at Cricket\n\nI hate Cricket, hate the Brits, and even I know this is idiocy from you. Why so dumb bro?",
            "*flicks tongue and sizzles*",
            "I know we're joking, but I actually have this problem if I'm stressed and hanging around a bunch of people that just constantly throw jokes at each other. On the bright side, I've gotten better at backpedaling and apologizing... Yayyyy!",
            "The bait was literally labeled bait and you still took it",
            "Nobody who has fucked, signed the lease on an apartment, or secured a loan for a vehicle uses the phrase V Card 😂",
            "How sad your life must be 😢",
            "I mean, I acknowledge that isn't how it works, why is that disgusting?",
            "Good for her. The first couple were funny but it's rehashed like crazy already. People literally reply 'hawk tua' in a comment section and it's peak comedy. Also get off my lawn.",
            "I mean, she should. If she doesn't, someone else will. Why not make a little money off your stupid thing that went viral?",
            "He's gone through puberty.",
            "The poor guy spent so many years giving the thumbs up sign with his right hand because people kept asking him because they saw the GIF, that he's now disabled and has to do everything with his left hand.   Ironically, he's German and his first name is \"Hans\"",
            "The newer gif might be mirrored, if not he's using the mouse with his left hand now when he wasn't before.  Which is possible too of course, but less likely.",
            "It's a very disappointing recreation. He should try again.",
            "Fun fact, most historians nowadays agree that thumbs up actually meant \"strike him\", while thumbs down meant \"lower your sword\". Ridley Scott was aware of that when producing Gladiator but chose to inverse it, so that the general public could understand the scene more intuitively.",
            "Yee Haw!",
            "or Jimmy Alyucanet Buffet",
            "It’s a live feed, poor kid got addicted to fame",
            "Air traffic controller\n\n[Joking]",
            "It’s kinda funny.",
            "Conscription applies to all. All bodied shall participate. Differently abled have the platt rack or may throw the ball. There is no exception",
            "Cuba?",
            "Oh shit I'm so sorry I thought you meant the opposite. I think I need to take a long nap after this.",
            "Backwards?",
            "yes it appears hes gotten older",
            "Wore the other hand out during puberty",
            "Good guy Ridley",
            "God, besides BR and Alien, he’s such an egotistical hack",
            "https://imgur.com/a/pew2KfJ",
            "Stwike him centuwion, vewy woughly",
            "It yields a smidgen of funny",
            "Dominican Republic?",
            "Like Benjamin button backwards?",
            "No, his right hand is spent",
            "Or he's just scratching his right knee vigorously.",
            "I worked for him. Not a good experience.",
            "Black Hawk Down? Thelma & Louise?",
            "Venezuela",
            "Nottub nimajneb?",
            "Benjamin ladies buttons 😂",
            "How so",
            "Go on...",
            "You can't just say that and not elaborate.",
            "South Korea",
            "¿qǝuɾɐɯıu qnʇʇoN"
        ]
    },
    "Dog locks target": {
        "title": "Dog locks target",
        "score": 4124,
        "url": "https://v.redd.it/zhisqaegp08d1",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Dogs will literally eat shit and people are bothered by this.",
            "INSANELY intelligent breed.  Malinois are built different.  Sometimes it's the brain.  Usually, it's the brain...",
            "Definitely locks on the target. 😎",
            "My dog would prob just stand there letting the pieces hit him in the nose then ~maybe~ eat them off the ground. He’s not a stupid dog and is very athletic. Hell, he has a hard time with tennis balls, lol. \n\nBut he’s also amazing. Standard Poodle, 72lbs.",
            "![gif](giphy|XepEEIO0SCFLMT6tUL)",
            "I think she got that HAWK TUAH skills",
            "Fuck this is hilarious",
            "Lmfao",
            "What the fuck",
            "And the fake spit? Like a pro",
            "Better than Sora’s lock on",
            "My dog is like 1 in 6 when it comes to catching french fries from across the table. I should show him this in hopes it shames him into practicing.",
            "This video is even more hilarious if you play it in reverse. 👀",
            "My dog would probably go for my mouth after 3 fakes out of frustration lmao",
            "Pff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK\n\nPff CLACK",
            "![gif](giphy|Pn1gZzAY38kbm|downsized)",
            "I got to try this.",
            "That was beautiful!!  Many thanks, OP :)",
            "Top skills",
            "Belgian malinois' are fur missiles.",
            "I was playing around with food when my german shepherd bit me in the face",
            "Now do it in the other way.",
            "It's only fair",
            "Infinitely beautiful.",
            "Playing the video backwards is significantly more entertaining",
            "This is someone’s fetish.",
            "[deleted]",
            "Slow it down to double speed and it's not that impressive\n\nEDIT: I am joking (poorly) about how *very* sped up this video is. It annoys me when people use this cheat to take something from kinda impressive to NFL.",
            "Is this the equivalent of dog putting their tongue into the owners mouth?",
            "[deleted]",
            "As I understand it, if properly trained, this dog can also eat your entire face in a low number of nibles.",
            "Gross as shit",
            "Chinese person eating videos and dogs…",
            "Not a good dog...",
            "I mean some humans also eat ass",
            "Who is bothered by this?",
            "I mean, if you saw your dog trying to eat shit, you'd stop it... right?\n\nPeople aren't disturbed by the dogs actions... lol.",
            "They aren’t even in the top 10 smartest dog breeds. They just fucking work harder than any other breed and want to please.",
            "Don't get one unless you are very experienced already with high energy dogs. It cannot be stressed enough.",
            "You can't even do this over and over again till you get it right, the dog would get bored and bounce, they probably taught him way more than we see here.",
            "![gif](giphy|qVVVfmHDMBZug)",
            "Where is this gif from, what is she saying?",
            "If she don’t hawk tuah, I don’t talk tuah",
            "Right in front of my salad?",
            "Many thanks?",
            "Gooning right now as I speak. 🥵",
            "You are weird with a name like that",
            "slow to double speed? so is it twice as fast or twice as slow?",
            "Not super uncommon for dog training. It keeps the dog's attention on your face. Some of the agility dogs that are always looking at their handler's faces are trained this way.   \n  \nI just use a treat pouch cuz I don't like hotdogs that much",
            "dogs eat literal shit and this is gross?",
            "gotta expose yourself as a racist somehow",
            "Delete your reddit account.",
            "Hahahahahhahahah",
            "Do you imply some don't?",
            "Some humans will also eat shit. Please see <redacted> video for reference.",
            "its the meta",
            "The people all the way at the bottom with the negative votes calling it a bad dog and gross as shit. There was like 4 comments when I saw this and three were like that.",
            "The first few comments were literally calling it a bad dog and gross as shit. They're still all the way at the bottom with negative votes",
            "and they usually are neurotic as fuck",
            "Number one smartest in all recent research.",
            "![gif](giphy|WdOlyL35LPDFQ5UQLf|downsized)",
            "Hawk tuah, spit on that thang",
            "But ... But I wanna talk tuah. May I?",
            "Several thanks.",
            "Currently, it looks like it's around 3x speed. I was suggesting they slow it down to at most 2x.",
            "a question formed as a camouflaged accusation…..you win",
            "Any time there is any social situation that might cause shame, I love saying, \"Don't act like you don't eat ass.\"\n\n\nUsually, whoever was feeling judgemental has a moment of pause.",
            "We've all eaten shit at one point or another whether we realize it or not.",
            "♀️♀️🥤?",
            "You call out that \"people\" are bothered by this. In my books most people find this wholesome. Also reflected by the up- and downvotes. You'll always have the few assholes hating on everything they see because of their own miserable life. Remember, it's the Internet.",
            "Kinda like smart humans\n\n….do crows and ravens have anxiety?",
            "I would be careful. Define smartest dog? We already have issues defining what human intelligence is and how to reliably measure it. However, shepherd breeds usually clock in pretty high. Anecdotally, Malis tend to be pretty smart but also pretty insane. It’s like a partially hyperintelligent human. Very good at some things, completely useless at others.",
            "No it's not",
            "I have some news for y’all….SHAQ eats ass LMAO THIS IS HILARIOUS [link](https://youtu.be/WkDXLor_KbM?feature=shared)"
        ]
    },
    "Ex-vet passerby jumped into a raging river to save an unconscious driver trapped in a sinking car ": {
        "title": "Ex-vet passerby jumped into a raging river to save an unconscious driver trapped in a sinking car ",
        "score": 1963,
        "url": "https://v.redd.it/y4d0cqnd618d1",
        "content": "The dramatic rescue took place in Chengdu, China, and the hero identified as a 53-year-old retired soldier",
        "num_comments": 63,
        "comments": [
            "I always figured veterinarians were good people.  This proves it.",
            "So he was a veteran… but now he’s an ex veteran?",
            "How do you become an “ex-vet”?",
            "That took balls. Props to that dude, as he is a real hero.",
            "Bad.  Ass.",
            "people helping people.",
            "Dude on the right at the end looks like he’s being pulled apart",
            "That's incredible",
            "Veterinarians are awesome, thank you for sharing! 🙌",
            "More info needed",
            "The dude in the blue shirt at the end be Stretch Armstronging it!",
            "She live?",
            "Truly NFL",
            "Courage, skill, quick thinking, and confidence—the guy had it all. \n\nWhat a hero.",
            "This reminds me of the kindest act of human decency I've ever personally heard about outside of the internet. My grandma on my dad's side had her sister pass away, and shortly after doing her memorial service, my grandparents went for a walk on the beach.\n\nThey had my great-aunts ashes with them, and three 20-30 year old surfers took her ashes out into the ocean and let them drift away into the sunset. \n\nWish I could give those guys a hug. True gentlemen.",
            "Swimming enthusiasts?",
            "what does vet have to do with anything?",
            "That's a very bouyant car and a daring off-camera rescue. Well done all",
            "That may be one of the most heroic acts I've seen, that water was wild at the end.. so dangerous to be in that water with a car",
            "What a time to have a nap in your car!",
            "What did you do grandad to save the person.\nGuy in blue: I was a human rope",
            " incredible",
            "China's getting better. Not so long ago nobody would lift a finger to help a stranger out. Kudos.",
            "Sooooo, does the \"ex-vet\" mean he's back on active duty?",
            "$5 he was drunk at wheel.",
            "So did the guy reenlist or stop deworming cattle? You are unclear???",
            "Couldn't have had a medical emergency just as easy as DUI. Respect 🙏",
            "This guy took action instead of recording someone's demise.",
            "I was told (by a friend who lived/ worked in China for four years) that in China,  if you save someone's life  you become responsible for them... weird concept..??",
            "50 social credit score points for you!!",
            "Drive ended up suing the swimmer for the broken window /s",
            "Fuck those guys who kept filming instead of helping ",
            "Thanks for the random Chinese propaganda bot. Wouldn’t be surprised if it was staged.",
            "[deleted]",
            "No! You beat me to it.",
            "Oh I thought it was the swimming enthusiasts. You can always trust one of them!",
            "He re-enlisted.",
            "Yeah, I had a brain fart",
            "Means he's back in active service now.",
            "Yeah yeah I know",
            "Well since you asked. \n\nI got fired from my job today for having sex at work. My boss reamed me out and I said, \"What was I supposed to do, she was just lying there naked!\" He shouted, \"The autopsy! The fucking autopsy!\" Then he fired me and called me the worst Veterinarian ever.",
            "Get divorced?",
            "You could re-enlist",
            "I used to be a vet, I still am, but I used to too!",
            "Yeah, that was a pretty incredible act.",
            "🎶 *Are the luckiest people in the world*🎶",
            "They are, even though this guy is ex 🤣",
            "Based on what do you say that no one would have done something lol?",
            "The dreaded IRR call up. Straight to stop loss for you.",
            "Probably",
            "Which version do you like best?",
            "That's false. Years ago, There were a lot of ambiguity surrounding causing personal injury and being responsible for that person's treatment for life but that's if you caused an accident. So about 10 years ago or so, they passed a Good Samaritan law.",
            "Look dude, they probably couldn't do shit. Tell me what you would have done that the others weren't already doing like giving whatever the \"swimmers\" wanted?",
            "User name checks out.",
            "People like you will scream propaganda and brainwashing at shit like this not knowing you’ve probably been brainwashed to think like this too at even just the mere mention of china.",
            " you don’t need to be active duty to be a veteran",
            "It does suck that reddit doesn’t let you edit the headline, doesn’t it? 😜",
            "You took the L like a champ 🏆👑",
            "My brother in Christ…\n\nYou did WHAT?",
            "This is the best thing I have ever read I'm dying!!!!!!",
            "dont' you stop being a vet when you clock out?"
        ]
    },
    "Architectural Assignment Completed": {
        "title": "Architectural Assignment Completed",
        "score": 11291,
        "url": "https://v.redd.it/v6hno9fn2y7d1",
        "content": "",
        "num_comments": 319,
        "comments": [
            "Their education is worth every penne.",
            "Ngl - I was hoping for a more dramatic ending...",
            "I wanted to see them continue adding weight until it collapsed",
            "They get an A, for al dente.",
            "We had a project like this in my elementary school. The rule was \"one box of fettucine and glue\". \n\nI put together some complicated triangular lattice that supported about 30lb before breaking.\n\nMy friend Cooper put all of the noodles in a slab, drenched them in glue so it was basically a big block of glue and starch and then made two \"glue+noodle\" platforms for ground contact. His held somewhere in the ballpark of 120 lbs before cracking...with the weight consisting of the heaviest kid in class holding a bunch of books.\n\nHe won on a technicality.",
            "That's structural engineering, not architecture, my lil guy",
            "I'm very curious what they used to stick all of them together",
            "Spaghet together, strong",
            "I watched it all the way, only hoping to see it finally collapse after its threshold point. \n\nr/VideosEndingEarly",
            "Still waiting for it to spirelli out of control.",
            "Reminds me of a science fair project I did as a kid. My dad was a structural engineer, and the project we did was to show how much better a suspension bridge was than a non-suspension one. Built both out of popsicle sticks. \nWe built the regular bridge and tested it with canned goods. It held 1 or 2. \nWe literally ran out of cans to stack in the suspension bridge. It was pretty incredible.  \nFor the one that broke, my mom used the band saw and sawed some matchbox cars in half so they looked like they had fallen and were sinking into the \"water\" below. Lol",
            "Then there’s me trying in vain to hang a picture that doesn’t slightly tilt, on a wide open wall, with a level at my disposal.",
            "Brilliant! I can’t believe this is even possible",
            "I'm a science teacher - I neeeed to know what they used to glue it together!",
            "Definitely Italians. Just can't see spaghetti boken",
            "Probably dipped the pastas in glue before assembling too ;)",
            "I did a similar project in my architectural building class but with like small wooden pieces. My teacher put all the text books he had on it and when it didn’t show signs of breaking he stood on it and then stood on it with text books on it and it didn’t even come close to giving out. He said in 15 years no one has made such an indestructible project. As far as I know it’s still hanging from the ceiling of that classroom.",
            "Won a pasta tower competition when I was 13 by a factor of 3x. Held 180lbs. They had to get more weight from the gym. Took a 250lb kid to stand on it before it broke.\n\nI'm an engineer now.....",
            "I'll be impressed when it's cooked spaghetti",
            "City’s around the world are taking notes for future infrastructure.",
            "Pro tip:  if the room is carpeted, build on the floor so you can take advantage of the grip provided by the nap of the carpeting.",
            "Pretty awesome, but isnt this structural engineering?",
            "There is always someone already came up with a way to destroy it easily…\n\nEngineering  always comes in pairs, as a fellow engineer myself.",
            "So how much weight did it hold at the end there?",
            "3 mins 15 seconds.. Pasta my bed time.",
            "I wanted to see it break",
            "Not filming until it breaks is against the Geneva Convention",
            "I mean, if there is no limit on how many spaghetti you can use this should be very easy",
            "Did the weight distribution change significantly because of the platform warping?  It would be really interesting to have a map of the changes in weight distribution and displacement on the bottom platform.  It would be cool to see how much surface area there is on top of the tower as well.",
            "Pretty amaziti",
            "You don’t want to be his cousin during family gatherings",
            "This video did not reach its full potential. I want to see that tower limit so bad, i.e the breaking point.",
            "u/savevideo",
            "Insane",
            "That's some strong glue too!",
            "What's in the sauce??",
            "Their dads own an Italian restaurant where you can order a plate of pasta with fifty pounds of marinara sauce on top.",
            "Taps top of structure*\n\nYou could fit so much spaghetti on this spaghetti.",
            "I can't trust Italians about bridges.",
            "You know that pasta is enriched with iron!",
            "I used to make these as a kid on rainy days.  Never once thought to test the strength with bricks.",
            "Has mhmt.krkco never heard of triangles?",
            "![gif](giphy|bgT142FWjRwV4hWsvX|downsized)",
            "Cremonadiagram?",
            "Impressive. I am so glad some people are wired this way",
            "I had a similar assignment in high school but the structure had a maximum weight limit, had minimum dimensions and I had a 30 minute time limit to build it in using only the provided spaghetti and hot glue. I was one of my fondest memories from that class.",
            "NO! It must collapse under the weight, keep going until destruction!",
            "Can this structure be 3d printed?",
            "It would’ve been cool if they would’ve done a simulated earthquake on the design after it had all that load successfully.",
            "Not architects.  Engineers.",
            "That's it, I'm tagging lionfield.",
            "Sauce?",
            "This was the \"team building\" excercise they made us do when I worked at T-Mobile 🤮🤮",
            "Pfft easy. \n\nΣFᵢ = 0 \n\nΣMᵢ = 0 \n\nWhere’s my prize?\n\n/s",
            "Triangles!",
            "Don't let corporate America see this. All our buildings will be made from dry pasta.",
            "![gif](giphy|3oEjI789af0AVurF60)\n\nThis… but with triangles.",
            "I would have used barbell plates as weights, but i'm not as smart as these guys",
            "What was used as adhesive to connect the noodles together? I have run this project several times, but not found an adhesive I was happy with.",
            "Lads lads lads!",
            "Serious question: how are they fused together?",
            "I was waiting for that other guy who seemed like he wanted to constantly try to put something on there by himself, to do so and cause it to break.",
            "If you enjoy watching this there is in episode of Lego Masters season 2 where they have to build a bridge and see how much weight in can sustain.",
            "r/maybemaybemaybe",
            "Water can't melt spaghetti beams.",
            "Jenga reverse style",
            "I did this in middle school with a few popsicle sticks and a cereal box. I made a triangle type thing. The bucket handle broke before my structure. I was proud. Then some asshole kid from another class broke it before the final face off.",
            "Until it gets hit by a cargo ship.",
            "Now try it with cooked spaghetti...",
            "This guy architects!",
            "I miss being a student at the Al Dente school of architecture.",
            "He cheated…all the pieces were gluten together.",
            "The sequel to Pizza Tower",
            "Now that guy looks like hes going to be making a lot of money in the near future",
            "GET THIS MAN TO BALTIMORE STAT!",
            "He didn't have to place the first brick so carefully.   \nHe could have just dropped it on there.",
            "How is the spaghetti attached to each other? Super glue?",
            "WOOOOOW!!",
            "Now do it with cooked spaghetti!",
            "Sure, Americans might compare the weight to that of a small tortoise. But at least we use weights to decide how much weight something can hold",
            "So they say spaghetti is very brittle and it's an amazing feat to have been able to build a structure capable of holding all that mass but if they doused the spaghetti with super glue, it's way less brittle now isn't it",
            "How unsatisfying! I was waiting for the collapse.",
            "Absolutely amazing.",
            "Why don’t they just put bottle between the stones? \n\nStone - bottles - stone - bottles - stone - bottles. Done.",
            "Everyone else is like,fuck I'm going to fail this class",
            "I want them to slowly clip a single noodle until it collapses",
            "Must played a lot Bridge Builder.",
            "Amazing….",
            "did you not do this?  at my highschool we had a hydralic press for breaking bridges (not towers).  its a pretty standard excercise...",
            "All those captions to describe the obvious and never have they explained how the spaghetti is joined together.",
            "I did one in college, but we had to do a bridge instead. Looks like a bridge is best for testing, since you can put a bunch of things hanging from it and test only it's capabilities to handle weight instead of the students skills in Jenga",
            "Future millionaire club 💪🏾💪🏾💪🏾💪🏾💪🏾",
            "Italian engineering",
            "That is absolutely outstanding work! Nicely done! Hire those cats!!",
            "Put glue on the spegheti",
            "The text is fucking horrendous \"The engineering students are in a class that is engineering related. They are doing a spaghetti project where they have to build their project out of spaghetti in class. The spaghetti is weak and edible but when it is in a structure shape is is strong and inedible. The strong spaghetti students will put a brick on the delicious spaghetti engineering project they made for their class.\"",
            "How were the sphegetti joints connected?",
            "Now try making it with al dente spaghetti.",
            "Im assuming its gluten free? Thats why its so tolerant of the weight",
            "I was the kid with a rubber band and paper clip standing by",
            "*bumps table* Earthquake!",
            "Very impressive, now earthquake test.",
            "I feel like it might have been easier to use another brick instead of all those water bottles.",
            "Now just poke one strand at a time until it fails",
            "So he just wins the class now right?",
            "r/maybemaybemaybe",
            "That’s bonkers",
            "SCIENCE!!!",
            "That’s a fun way to learn engineering. Wish everyone learnt it this way",
            "The secret is in the sauce. \nGreat Job!",
            "Ok... now ram it with a toy boat....",
            "Greedy cunt 🤯",
            "I remember I had to do this in highschool with toothpicks and dum dums.  And our structure was suppose to protect an egg from falling. We were a 4 person group and while everyone else started arguing, I just started building.  Basically did the entire thing by myself without help.\n\nNot only did my structure pass the basic test on an 'earthquake' simulator, the teacher cranked it to max settings and stare dumbfounded at it not only the egg not falling, but the structure itself not even sweating it.\n\nOne of the few moments of my life where I thought I might actually be intelligent ![gif](emote|free_emotes_pack|joy)",
            "I would 100% trip into it.",
            "I was waiting for the moment the structural integrity unraviolied.",
            "This is what kids in other countries are doing while American students are beating each other and their teachers up in class.",
            "Jump to the end. It doesn't crash with all the bottles and bricks on it. Good work.",
            "We had something similar in high school. We had to build a bridge of a certain width using spaghetti and limit amount of glue. Marks are based on a weight of bridge vs load.\n\nAssessment day was fun, we put the bridges between two tables and start hanging weights in the middle of the bridge.",
            "Awesome. Now make it lean.",
            "I would wait until they went to lunch and find my biggest pot for boilin’",
            "Guess they don't like their pasta al bente.",
            "Architectural? Baka Structural Engineering?",
            "They didn’t even test to failure",
            "That's how I play Bridge Constructor.",
            "I didn’t expect it to take beyond the three bricks tbh.",
            "Okay what are the rules for this, like what can you use besides pasta? Because if you just made all strands the same length, a solid tube of them will support my weight if you use a bit of sticky tape. It won’t look anywhere near as impressive as this, but it’ll hold.",
            "They probably had a construction crew of tiny people help them solder the noodles together",
            "An architects dream is an engineers nightmare",
            "Awww, I wanted to see it fall at the end.",
            "Then there's the civil engineering students, who don't understand how putting a median on a 2 lane 25mph road completely obstructs all left turns into and out of cross streets and fucks the traffic up for no reason.",
            "The true difficulty lies in knowing the efforts the complex structure can withstand, and therefore being able to create optimal lattices.",
            "As a french, I'm jealous, we could never achieve that with baguettes.",
            "very cool move to make second layer",
            "Wahnsinn 👀👀",
            "They absolutely used their noodle.",
            "Amazing, my friend",
            "Nextfuckinglevel would be showing the collapse and quantifying the weight.",
            "No chance those are architects.   Architects are useless.",
            "Engineers!",
            "That's quite nerve wracking. Just imagining the thing breaking and a brick hitting someone's foot or even worse someone's crotch!",
            "Seems pretty easy. Just don't put any of the strands in shear. Many spaghettis in compression is strong like bull.\n\n\nWere they allowed to bundle them or single strands only?",
            "think about that when you are driving over the next bridge. they dont put more material inside than they have to.",
            "More bricks instead of bottles",
            "This is a pretty good pasta joke, but I’m sure the pesto’s yet to come.",
            "Very impressive. When I was their age, I was just sitting around stroganoff.",
            "r/angryupvote",
            "in Argentina they do these and it's free 🙂",
            "This has all the makings of a saucy affair",
            "Every bottle",
            "I see I’m too late. I’ll chew on it.",
            "The best part is that it is probably free",
            "Ideally a dumb local news reporter there to interview the students and, naturally, accidentally destroy their creation",
            "This guy JENGAS!",
            "Yeah. Should have keep loading until it breaks. Only then they know the limit",
            "So were the Mythbusters",
            "When we have balsa bridges in college and ran out of weights, we just had people stand on them until they broke. This also demonstrates why you should do it on/near the ground.",
            "Some men just want to watch the world burn..",
            "I wanted to see them start flicking segments off the tower to see if any could be spared.",
            "Maybe yo mama can help",
            "You mean use actual weight to actually test this properly",
            "That’s what happens irl",
            "He is still stacking weight on top.",
            "![gif](giphy|135E47VKw6TM6A)",
            "Always al dente, never scotta!",
            ">He won on a technicality.\n\nRespect to your teacher for not stealing that well deserved W.",
            "We had a paper airplane competition in my design and prototyping class.  The materials were a sheet of paper, glue, tape, and paperclips.  I asked how many paperclips we were allowed to use.  He said we could use as many as we liked.\n\nI taped a box of paper clips together, taped a vaguely air plane shaped piece of paper to it, and threw it as hard as I could and got 2nd place.\n\nI lost to the kid who saw my \"design,\" copied it, and happened to have a stronger throwing arm.  1st and 2nd place went to metal bricks with paper fins.  I was informed that the following year designs were limited to a dozen paper clips.",
            "Had the same thing happen in my H.S. shop class. We were supposed to build a bridge out of X number of popsicle sticks. I built one that incorporated trusses with an arch that held up to like 50 lbs and earned me an A. Two or three other students did the 'slab of glue with popsicle sticks in it' and also got an A because theirs held way more than 50 lbs. 🙄 Still pissed off about it 35+ years later....lol",
            "Have you heard of our lord and savior rebar?",
            "Classic Cooper",
            "We had something similar in class building bridges with just plastic drinking straws and glue. Filled the straws with glue and let them set. Mutherfucker could have held someone sitting on it.",
            "Gloodle supremacy!",
            "Dang, this reminds me of a box building competition I did in high school. I built a nice cross-braced structure, and came 3rd - the first place was just a bunch of the rods as close as possible and pointing straight up.",
            "Similar story. Tried really hard to make a complicated design with triangular supports, got frustrated, quit. An hour before the competition the next day, I dumped the glue on the busted and other spaghetti. Was still wet ( or at least not fully dried) when I submitted it. Took third place. Thing never broke, but sagged so bad that it eventually lost out on length.",
            "Architects would still be arguing over the floor color.",
            "It’s all good…we had the same assignment when I was at Wurster Hall.\n\nThe most successful was done by the most prompt, studious classmate because she finished early and allowed the white glue to properly cure.",
            "Most Architecture schools have multiple semesters of structural classes where assignments like this are fairly common.",
            "Yup, came here to say this.  Worked with a structural engineer and his biggest complaint was architects making superfluous designs that made buildings more difficult to manage (facade access and the like).\n\nEdit for clarification:  I’m not saying architects should be out of a job or that interesting architecture is dumb.  I literally worked in facade access and lightning protection, so some architecture made my job more difficult. Just stating a fact.  I don’t mean to say I want my area to look boring.",
            "You know architects have structural engineering courses, right ? That structural engineering is actually part of architecture despite what engineers tell everyone ? That architects used to do everything themselves since structural engineers literally didn't exist for the longest time, but architects did ? It's a bit like saying \"this isn't a video, this is multiple images shown one after the other with a soundtrack\" \n\nSource : I was in architecture school, literally did stuff like that with spaghetti. It's actually our number one tool to teach structural engineering since it bends and snaps if you don't design well.",
            "  \nto put Architect on your business card legally, you need the equivalent of graduate school.\n\n4+2.. 4 years undergrad, 2 years graduate - half a dozen exams to get your license \n\n  \nyou need to be really good at math.\n\n\n\nWhat is architectural engineering?\n\n[https://www.ae.psu.edu/academics/what-is-architectural-engineering.aspx](https://www.ae.psu.edu/academics/what-is-architectural-engineering.aspx)\n\nUniting scientific principles from structural, mechanical, electrical, lighting, acoustical, and construction engineering, architectural engineers apply their discipline-specific expertise to conceptualize, design, construct, operate and maintain built environments in interdisciplinary team environments. \n\n  \n[https://en.wikipedia.org/wiki/Architectural\\_engineering](https://en.wikipedia.org/wiki/Architectural_engineering)\n\nArchitectural Engineers sometimes incorporate structural as one aspect of their designs; the structural discipline when practiced as a specialty works closely with architects and other engineering specialists.\n\n  \nIn many jurisdictions of the United States, the architectural engineer is a [licensed](https://en.wikipedia.org/wiki/Professional_engineer) engineering professional.[^(\\[13\\])](https://en.wikipedia.org/wiki/Architectural_engineering#cite_note-13) Usually a graduate of an [EAC/ABET-accredited](https://en.wikipedia.org/wiki/ABET) architectural engineering university program preparing students to perform whole-building design in competition with architect-engineer teams;[^(\\[14\\])](https://en.wikipedia.org/wiki/Architectural_engineering#cite_note-auto-14) or for practice in one of structural, mechanical or electrical fields of building design, but with an appreciation of integrated architectural requirements. ",
            "I am curious if they also used ahesive",
            "Probably super glue",
            "Its because they used trusses and they spread that weight over a large area",
            "You’ll need to become a glue teacher to figure that tough one out",
            "Gorilla =)",
            "Glued luck finding out",
            "they speak turkish",
            "One. placed horizontally on the table..\n\n![gif](giphy|Kq6wP0p5e1sOK065Gs|downsized)",
            "I had a weight limit to the structure as well as minimum dimensions to meet.",
            "Not an engineer but i imagine the platform warping actually puts more stress on the spaghetti. I'm guessing but the structure looks built for vertical pressure, and the platform warping gives it a little pressure from the sides. Maybe he built with that in mind but I dunno.\n\nI guess I have not answered your question at all and added next to nothing to this thread",
            "The magic is in the use of those triangular trusses. The same one that is used in bridges etc",
            "[removed]",
            "###[View link](https://rapidsave.com/info?url=/r/nextfuckinglevel/comments/1dl6xo8/architectural_assignment_completed/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/nextfuckinglevel/comments/1dl6xo8/architectural_assignment_completed/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
            "What are you basiling that on?",
            "How Fusilli you are",
            "Took me a sec",
            "I understood that reference.",
            "Oh damn! Even better! I like the way you think. Same result in the end",
            "The italian version on Jenga",
            "I exhaled out of my nose for this one",
            "De la Coco",
            "AREBUH DARE CHE",
            "Gorlami",
            "Nice place. New Brunswick also.",
            "Former teacher here... sounds like he won legitimately if the directions didn't specify the maximum amount of glue.",
            "i had a similar competition, but we only had paper and tape.   I just crushed the paper into as tight a ball as I could and then wrapped the entire thing in tape, taped on two triangle on the sides to be 'wings' and then threw it like a baseball.",
            "It's part of engineering. If the market is flooded with cheap material of certain type, you would want to use that material as much as you can to minimize cost needed to satisfy the requirements \n\nThe teacher just didn't price paperclips correctly. Maybe he needs to take some economics class.",
            "They were ahead of the game, already using laminated beams.",
            "We did the same thing but we had a penalty applied for every stick or dab of glue we used. I ended up getting the highest score for just 4 popsicle sticks glued end to end.",
            "That a random the strain reference",
            "That's interior design",
            "Can confirm\n\nWe did this in first year and our structures were ranked for strength to weight ratio and total mass held. We then had to write reports on the initial and final failure of the structure.\n\nThrough second and third year we still did more work on standards, structural/ mechanical needs, etc",
            "The world would be a boring place if engineers were in charge of aesthetic design.",
            "And throwing in weird windows",
            "It's funny cause it's literally the reason why your friend even has a job in the first place.\n\nArchitects, at least where I'm from, are totally capable of designing a simple structure. So if they just did that, do you really think anyone would waste time and money with a structural engineer ? Of course not, and then he'd be out of work. Stop complaining and do your job. Otherwise, they can just get rid of them by designing ugly ass repetitive shit all over the world.\n\nArchitects were perfectly fine without structural engineers for thousands of years. Structural engineering literally stems from architecture, not the other way around. The only reason we need them now is because the laws and the ways of teaching changed. We could go back and get rid of structural engineers.",
            "As does every other discipline connected to new construction. Architects, landscape architects, and engineers (which is an insanely general term that can include, at minimum, structural, geotechnical, site civil, contractors, mechanical, electrical, plumbing (MEPs), environmental specialists, other specialists where applicable, fabrication, etc.) all need full industry exposure to be fully effective in their respective disciplines. Not expertise in all by any means, but adequate exposure. \n\nI have the utmost respect for architects, and I in a million years could not do what they do. But I also can't deny that the drawings most complained /bitched about and require constant field changes and change orders is the architectural drawings (followed closely by the site civil plans). In my experience, architects can sometimes stray from practicality, and are the most likely of the design team to do so. \n\nFor what its worth, it's not like every architect proposes something absurd. I work with so many that are nothing but amazing and cooperative (and by extension we are in return!!) and our drawings are always coordinated. It's once in a while I work with one that I just...can't.",
            "If they take a baking course as an elective does that mean cooking a cake is architecture as well?",
            "*Hot Glue",
            "And the joke is ruined:)",
            "The parts of the platform that aren’t in contact with the tower can warp all they want, it won’t affect the tower. In this case, the entire platform is warping, so it does affect the forces on the spaghetti tower. This isn’t necessarily a bad thing, it depends on how the tower is constructed. It looks like this tower is built to handle lateral forces as well, but im not overly confident as I only got halfway through my civil engineering degree before switching to computer engineering",
            "I’m sure they had an angel hair watching over them",
            "Oh bolognese to you all with your stupid puns!",
            "Link?",
            "You stepped in my special bubble formula!",
            "Marghe-RAY-ti 🤌",
            "Bravo",
            "my lil guy",
            "*Soviet architecture intensifies*",
            "Maybe.\n\nBut architects should have to give a basic shape, the engineers can then design it and only then can the architects adds superfluous design elements.\n\nThis way the structure is sturdy, safe, efficient first and foremost.\n\nStop letting the decorator dictate how the house is built.",
            "we would all just live in underground buildings",
            "Unless you find some engineers who also have a good sense of artistic design.",
            "I prefer boredom than die young because of structure collapse",
            ">Architects were perfectly fine without structural engineers for thousands of years.\n\nYeah that's why they used to sacrifice their first daughters by burying them alive with the foundations so that 'the bridge can hold this time'.\n\n>It's funny cause it's literally the reason why your friend even has a job in the first place.\n\nBy thal logic that's the reason even architects themselves have a job. If we copy pasted a design everywhere we wouldn't need structural engineers but we wouldn't need architects either.",
            "just like turkey",
            "They all had a great thyme in class.",
            "https://youtu.be/aPjnaD7YRug?si=r_N58z79PfQU8S_K\n\nAnd in the general theme of reporters making things worse (someone will … burst my bubble and and tell me this is fake, just like someone did after a decade of happiness believing Leroy Jenkins to be unstaged.\n\n https://youtu.be/LINXivt-bkY?si=mIO-ft4Bhd2UhQc5",
            "Repeat it one more time but this time let me really hear the music in it.",
            "Architects would still be arguing over the wall materials",
            "Being like 190lbs of pure muscle, I dare call anyone \"lil guy\" despite the meme, in case I'm talking to another one of me.",
            "Eh, architects push the limits. They have a crazy design and structural engineering has to come up with the how. \n\n\nNew material, etc. ",
            "We had decades of software interfaces designed by programmers until UI design made itself known to be very important.  No one is arguing the value of engineers, but Jesus, you math nerds need to get out more - you aren't good at everything despite what you might think.",
            "Such a mindset leads to the current reality: boring and uninspired structures all around cities, making people anxious and unhappy to live in such places.\n\nWhile practicality is indeed important, ignoring human nature and our desire for enjoyment to save pennies impairs the entire purpose of buildings, which are, after all, human concepts. Without human life, buildings are completely useless in this universe.",
            "Your response tells me you know nothing about how building design works. Superfluous design elements do not make buildings functionally less safe. The engineer designs backup structures that allow those superfluous design elements to exist without adding risks to safety.",
            "They exist but they are rare.",
            "Fancy architecture does not come at the cost of structural integrity.",
            "What a creative and oregano solution",
            "Water the odds of that",
            "Gårlaami",
            "With civil engineers, yeah.\n\n\"This concrete won't hold up your wave pattern, man!\"",
            "I never claimed architects don’t have a job, I just find it stupid that the look of a building out prioritizes its structure and practicality.",
            "Most boring and uninspired structures are the result of developers who are far more concerned about ROI than building something beautiful. This results in razor thin budgets for designers and lack of willingness to introduce depth to buildings because of loss of rentable/sellable area.",
            "Wrong.\n\nThe current hellscape was built by people wanting quick to build structures that served a purpose and cost as little as possible.\n\nWhat I suggest is a world where the structural integrity of a building comes first and its aesthetics after as opposed to some eyesore buildings that are “art” pieces and barely hold themselves together.\n\nArchitecture is the makeup and structure is the face; you add makeup to a face to improve its look but adding face to your makeup would make you look like an idiot.",
            "Yes, but it’s ass backwards.\n\nThe architects should work around the structure.\n\nAesthetics are nice, but they should never be placed before the buildings ability to stand on its own, and sometimes aesthetics go too far. Such as the massive reflective pyramid in, I believe, LA that is an active hazard due to reflected and focused light coming off it.",
            "Yeah, a lot of people here who don't seem to know what a structural engineer or an architect do",
            "The strainer they must be under to get this right must be immense!",
            "I think the pasta jokes are over, frijoless we change to another food?",
            "“Wave pattern… my lil guy”",
            "The fact you think the look is more important than than the function is sad.. \n\nSad also because you´re right that sometimes famous buildings are designed form over function. \n\nGood architecture doesn´t. Great architecture has no division between the two.",
            "Architects design space, function and esthetics. In other words how the building works for its residents.\n\nArchitecs are design generalists, they design the whole. Engineers are design specialists, they design specific parts of the building, not the whole.\n\nEsthetics is maybe 1/4 of the architects job.",
            "Alright. I'm just an architect who has been building buildings for 15 years, but what do I know?\n\nThe current hellscape is the result of developers prioritizing ROI over aesthetic beauty, not the aesthetic design of the building not respecting structural primacy.",
            "The structure of a building is determined first and foremost by the functional space requiremenrs of that building. You lay the building out so it works functionally and then adjust the structure to work with the building. The vast majority of structures are very simple and efficient due to the increased costs of creating complex structures.",
            "And who seem to think those are the only two disciplines that go into it. \n\nThe site civil, geotechs, MEPs, etc. of the world don't love the impracticability of some designs either",
            "Stack those bottles any higher and they'd have a farfalle",
            "Lil guys would still be arguing over the architecture, my wave pattern",
            "Uh…\n\nI’m advocating for function and structure over looks.\n\nWhat comment did you read?",
            "This thread is getting prep-osterias",
            "Yours.\n\nI´m an architect. Structure is not what you design first. You start with function, structure follows from there. If well designed structure is part of the logic of the construction. If badly designed structure needs to work around a bad plan, or to support a quirk.\n\nHow are you supposed to design structure before function?  That´s as dumb as designing around a facade. \n\nSubstituting one bad idea for another isn´t improvement.",
            "If this is the future, then the pasta will be forgotten",
            "Yeah…\n\nThat’s what I’m saying; structure before décor—like a facade.\n\nAnd anybody that designs a structure without knowing what it’s for is an idiot. Nobody ever said structure before function; I said structure before aesthetics/design/décor/flowery-foo-foo-crap."
        ]
    },
    "A soccer prodigy showing off his skill set against defenders": {
        "title": "A soccer prodigy showing off his skill set against defenders",
        "score": 17855,
        "url": "https://v.redd.it/4cy1094mhx7d1",
        "content": "",
        "num_comments": 590,
        "comments": [
            "A prodigy is Lamine Yamal. A 16yo starting on Spains national team rn. Tf is this",
            "Ok, I hope I don't sound rude, but this is really nothing special. Maybe in US (just assuming, since it says soccer) it is exceptional, but I am Italian and I swear most of my friends could do this trick when we were playing as kids. And they were nowhere close to be called \"prodigy\"",
            "Maybe this is something special for American standards but me and most of my friends could do this trick before 13 yo while playing in the street and none of us even came close to being a pro player. And this isnt even aplicable on the field, any average defender would press way harder than that dude did. Props to the kid for being good with both feet though.",
            "Definitely not a prodigy. \nThis is a great trick and execution was TOPS however, not prodigy level stuff.",
            "I stood up screaming and then read in the comments that this isn't supposed to be impressive. Watched it again, and now seems less impressive, but still impressive.",
            "Why is the net so big and where is the puck? My Canadian brain cannot handle this.",
            "Lamine yamal is a prodigy, or as close to it as you can come in football. Football is so massive that the required skill to be a prodigy is just absurd, this is just stuff kids do cuz it's fun.",
            "Is being [Him](https://www.youtube.com/watch?v=-SQGJ0rfIEk) now a compliment for Zoomers?",
            "He might be a \"prodigy\" at soccer, but that's not that impressive as far as football moves go. And not very practical in a real game.\n\nAlso HIM? You don't have to sell your soul to the Devil to do this trick.",
            "“Soccer”",
            "Is this really apt for the sub? This is hardly the level for a professional forward.",
            "Okocha",
            "I'm terrible at football, but at least 5 or 6 guys in my class were able to do this kind of thing when we were 12 years old...   \nIt's not about Americans are less skilled, but in many countries it's the national sport and all children play it from the moment they learn to walk.   \nSo no, bro is not HIM 🤯",
            "Why are they all rushing him as if its the greatest shit ever hahahaha",
            "The Brazilian doing this on any dirt pitch and without boots. 🥹",
            "I was doing this when I was ten",
            "Average Brazilian and Portuguese toddler be like",
            "I’m glad everyone’s having their own discussion and all, but is no one looking at how even a slight miss in goal and that footballs shooting straight into a parent or child. Why are they huddled around the goal!",
            "It literally looked like neither the goalie or defender tried. No skill here.",
            "Definitely not next level, even I could do this at 12 and I was terrible lol\n\nThis would never work in a real game, you'd just get pushed or another defender would come across.",
            "Not next level for me",
            "It is called football",
            "\"Bro is HIM\" is such a zoomer phrase",
            "90% of what makes a good footballer is their game intuition. These ball skills are pretty easy to learn\n\nAlso this was absolutely horrible defending which allowed him the free shot",
            "OP needs to learn the definition of prodigy",
            "Goalkeeper is in noob mode too",
            "Nothing prodigy about this.",
            "by their reaction these kids have never seen sny football before.",
            "“Soccer prodigy” … tell me you never watch soccer without telling you never watch soccer",
            "Soccer prodigy, LOL",
            "Cool, now pickup that broom and get back to work pele.",
            "File this under “kids overreacting to dumb shit for a tik tok video”",
            "most american title ever",
            "'Bro is him' I thought they spoke English in the US?",
            "lol try than in a real game and you’ll get leveled",
            "SOCCER prodigy😂",
            "It's called football 😭",
            "Anyone know the tune by any chance?",
            "bro is him... until he gets to a decent semi-pro level and the next pepe will take his legs off",
            "90s Classic got forgotten by the new Generation ;-)",
            "Well if he was so good he would have been recruited by an football youth academy",
            "Football.",
            "But you rarely see these tricks being put to use regularly in matches because team work is more important i suppose?",
            "take 37",
            "And all the teenage boys rejoiced!",
            "That's basic street soccer.... nothing special.",
            "Most of these fútbol/soccer videos end up being one thing -> shit defending",
            "Pele?",
            "No goal.  The ball is out.  Throw-in.",
            "That control was pretty shocking to be honest. About 20 feet in front of him. Keeper could have walked out and caught that.",
            "Can someone explain the ‘bro is HIM’ to this geriatric millennial?",
            "Prodigy? He is at 2 meter from the goal?",
            "Prodigy is really stretching it. Any kid can do it. I learnt it at 9 y/o.",
            "Brazilian standard",
            "But I’m not a rapper",
            "What is with the new rush the field screaming yeah thing? So fucking obnoxious. This is obviously a display of skils so sit back and watch",
            "Yeah? \"brO iS HiM?\"",
            "\"Oh, what a cool shot, I assume the comments must be saying how good of a kick that was\"\n\nThe comments:",
            "* F L E S H*",
            "Can they do it on a cold, rainy night in Stoke tho?",
            "That's football, call that glooby ball soccer.",
            "That's it?",
            "This might actually make me watch soccer",
            "Seeing a lot of non-Americans saying this ain’t shit and they could do this by the age of 9 😂(😒)",
            "the amount of people claiming Lamine Yamal isnt prodigy level just to shit on the phrase 'soccer' is ASTOUNDING",
            "\"I could do this when I was 10. Calling this kid a prodigy is clickbait\". Ok people, stop assuming they're calling him a prodigy based on this single clip. Maybe he is a top rated player globally for his age and this is just a single clip of him.... Reddit is so full of haters waiting in the wings to shit on positivity",
            "Damn. I’m going to go against the grain. I’m impressed lol",
            "Get him!!!",
            "Fucking Yankees...",
            "My 10 year old British kid does this every day…",
            "People really outting themselves for being shitters assuming the crazy part of this is just the rainbow flick, the crazy part is the fucking back heel knock on to volley and how well it was executed. I guarantee everyone going 'I know 100 10 year olds that could do this' could not hit it this clean in 100 tries, all you trolls post up your videos of you doing this, let's see it.",
            "Average English schoolboy does this between puffs of his vape.",
            "Pitch storming? Is this a charity event?",
            "Goalie was way late… easy stop if he came out sooner.",
            "This is like making a fadeaway at a pickup game.",
            "Dude has one move against one defender. Hardly a prodigy.",
            "I'm 37 now and my knees don't work, but back when I was 12-18 and playing in the park every day, I would do this. Well executed and a good finish, but nothing about this indicates 'prodigy'.",
            "He ain't a prodigy. No offense, but you'd get you're arse whooped if you didn't know how to do that here in sxotland",
            "Meanwhile, I manage to trip over my own feet on flat, open ground.",
            "\"Next level\" maybe from amature",
            "The right thing in the right moment.",
            "As long as they think can do it it’s fine with them.",
            "Its called football",
            "Do we dare call that a double rainbow?",
            "Not sure who this is next level. I haven’t played pro football, but a few of my friends did.\n\nMost of them could do shit like that 1-on-1 and in a practice settings, like in the video.\n\nIt wasn’t terribly difficult for them. A couple of them could also pull some Ronaldinho shit mid-game.",
            "Someone call Richmond",
            "JJ Okocha did that to set up  the winning goal in a game for Nigeria U23 vs Zimbabwe in 1996",
            "It may be impressive for american but man even my grandma can do this",
            "Is there an expression for tiktoq that encapsulates the same thing as “did it for the ‘gram”? Because this is all for the camera, it’s nothing special.",
            "Big deal! I could do that in my sleep!",
            "That volley was crisp!",
            "I will never understand why people throw a hissy fit over someone saying \"soccer\". One of the dumbest things to complain about. Get a grip, people.",
            "World Cup and copa America marketing has begun.",
            "average",
            "Prodigy? That's defining it very loosely",
            "Sorry but this isn’t anything special, most young kids who played football with their friends can do this easy. I can still do this no problem today and I don’t play as often.",
            "It's a trick, he'd get bodied trying this in an actual game.",
            "It's football* though",
            "Prodigy? lol. Street trick in a kids game.",
            "Football*",
            "I see a study on the influence of crowds here. \n\nWould you jump off a bridge if your friend did? \nDepends on the number of friends jumping. \n\nWould you goose-skip across a pitch over a decent play from mediocre players? Instantly.",
            "Excellent execution.",
            "Football*\n\nAlso this isnt very impressive of a tricj",
            "People act like this is easy to do because they seem to be focusing on the rainbow flick. It’s not JUST that. It’s that INTO a really nice volley. The two combined make this really impressive",
            "I'm Brazilian and I promise this is 100% true\n\nMy mom taught me this trick when I was like 11",
            "Soccer sucks",
            "![gif](giphy|qbAZ38vckAcik)",
            "I guess this isn’t impressive by soccer player standards but it sure is impressive to the rest of us",
            "This might be impressive in America, but it's also impressive in Poland.",
            "This would never work against a pro defender, let alone 4 and a defensive midfielder.",
            "OP thought it would lend some extra credit if he called the kid a prodigy, we get it, we suck at soccer lol",
            "My 1st skill🙌🏾",
            "A rainbow is one of the first skills you learn playing football and is one of the easiest ones.\n\nAnd secondly, he is 1 v 1 with a defender. How does that make it defenders?",
            "Op doesn’t play sports",
            "It’s one trick in a one on one. Nowhere near a prodigy. 🤦‍♂️",
            "I'm reminded of a 17 year old Sancho taking a touch like that at Dortmund. At full speed..\n\nI couldn't even do it on FIFA multiplayer",
            "As an American, most of us on the soccer team in highschool could do this. It was really just bad defending.",
            "OP has never touched a football ball in his life.",
            "Nope. He is white and his name is Ville Valo..",
            "The defender is the opposite of a prodigy. Kid could be good but this is evidence of nothing. Also, if he was a \"prodigy\" someone would know who he is. Hopefully this hype video got him a scholarship though.",
            "all the shit haircuts running in after like a bunch of Taylor Swift fans",
            "Football",
            "I could do that, and it’s called football fucking murkans",
            "\\*football",
            "Came here for the vitriol comments from soccer fans around outside of US, you do not disappoint.",
            "Fucking TikTok.  Ban it!",
            "In Brazil, slightly below average player.",
            "Nope",
            "Get the fuck off the pitch",
            "Everyone losing their shit annoyed me. He is him annoyed me. Tik tok at the end annoyed me. I'm 35",
            "The words \"soccer\" and \"prodigy\" do not align in this video. C'mon Aerica, get it together.",
            "Tricks are cool and all, but in a game, most of the time something like this is unnecessary and good coaches would train this behavior out of players. \n\nAlso, growing up as a defender I was always taught, that either the man or the ball can get by you, but never both. Defender needed to mark tighter and use physicality to cut the space down between them.",
            "Good night",
            "Five second video is somehow 19 seconds long.",
            "Pretty cool but this is like, playground tier in most football playing countries, I've seen this being done by 5th graders who just played football on the schoolyard. In an actual game my guy would've gotten shoulder charged or at the very least pressed much harder, he might be a prodigy but that clip doesn't show that at all.",
            "Everybodys missing the fact that its not the initial flick thats impressive, its the last kick while hes in a dead sprint to shoot it up 15 feet in the air into the perfect spot thats insane",
            "Well executed trick with a really nice finish but prodigy? Really? These 1 vs 1 comps are fun to watch but they're pretty much exclusively catering to 1 vs 1 dribbling which is a tiny fraction of the game and is often not needed at all by most players most of the time. \n\nFirst touch, scanning, passing and movement are all far, far more important",
            "Football. American \"Football\" is Rugby",
            "Maybe for \"soccer\" this is another level.",
            "It's football.",
            "All these keyboard ballers talking out of their asses saying this kid doesn't have talent \n\nHe didn't break eye contact the entire time. He's the real deal",
            "Everybody acting like this is easy as hell. I bet none of these guys have ever pulled of a rainbow flick in a game and made such a finish afterwards",
            "Yeah plus what the hell is that people doing just standing there, and the folks with professional cameras, and then everyone running and pulling their hair? Looks like some ad or some planned 'viral video' sort of stunt. All very weird.",
            "the guy is spanish moroccan, got some good genes",
            "Now I’m no expert on the sports or football/soccer whatever anyone wants to call it I’m not here for that debate. What in the shit is this? Imma have to research this because that kids playing with people who have been doing it at the professional level since before he was born with most at a near professional level",
            "Lmao word",
            "Fun fact: 35% of Brazilian babies can do this before they learn to walk",
            "I'll supplement this by agreeing, and saying most European football loving Nations had 10-year-olds who could do this",
            "[removed]",
            "Its not even. OP probably doenst know shit about soccer. It's obviously a cool move to pull off the rainbow and score, but to call the kid a prodigy is just dumb. Im ok at soccer, and a goalkeeper. We used to try rainbows all the time because it was fun. Maybe it didn't look as nice, but this isnt even that difficult.",
            "As an American, the title is very click baity. It’s a nifty skill, but I could also do this when I was younger. Also, as I’ve gotten older tricks like this became less used because of how situational they are. Finally if I were defending him I absolutely would’ve tried to body him off before the ball dropped. This is a long winded way of saying you’re right.",
            "> Maybe in US (just assuming, since it says soccer) it is exceptional\n\nYou would be correct. ~American.",
            "It's not special. I'm a Canadian and see kids do this often.",
            "was thinking... do this in premier league and see how fast your play life devolves into hell. lol",
            "Just because millions of people can dunk a basketball, doesn't mean dunking isn't impressive.",
            "Or maybe, it’s just a less then one year old karma farming bot that will give it any title to get clicks.",
            "This is stupid. Prodigy may be an overstatement yeah. Being able to do a rainbow flick isn't hard, but executing it to pass a defender and do a volley shot with a goalie to make that shot is incredibly difficult. I guarantee you most of your friends couldn't do this.",
            "I came to post this. That is a clown, not a prodigy.",
            "As an American who played soccer for 20 years, you’re right, this ain’t nothin special. Im sure it looks super cool to someone who has never watched the sport but this is literally elementary grade stuff",
            "You're not rude, came here to say the same.\n\nI'm from Croatia , I knew this trick when I was 8 years old.\n\nBasically every person who plays football with friends knows this, nothing special lol.",
            "As an American who has played and and then coached youth soccer my whole life (amateur), I have always assumed a normal Brazilian weekend league team could beat a D1 college program.   Maybe not the best program, but a middle of the road D1 program.",
            "Yeah, this is one of the standard tricks you first learn in any football playing nation. Commonly known as the Ozzie / Osvaldo Ardiles flick or the rainbow flick. This guy did it well but I've seen it done just as well by hundreds of other people who were not prodigies.",
            "wtf is with the crowd? This is fairly simple shit.",
            "I'm from the US and I practiced doing a rainbow and a dragged nutmeg every single day until I got it right, as did a lot of my teammates.\n\nIn the 80's.\n\nNot a prodigy, not terribly impressive, but they are little kids and that is cool as fuck to see when you're a little kid, so good job to him.",
            "Yeah. I wish there was more than 1 example at least. I mean I don't understand all the soccer football stuff, but I'd like to see more than a single clip.",
            "Thank you, Canadian here, this is nothing special at all. Certainly not worthy of using \"prodigy\"\n\nShit, half my school when I was a kid used to play around and try to do this kind of stuff, and PLENTY could with a little practice.\n\nRegardless, keep it up, youth in sports is one of the best things for your children!",
            "Uruguayan here, this is such a mid clip lol  \nAt most they'd get an \"Oof\" plus some hand gestures lol",
            "It’s just a shit title",
            "Well, timing it right isn't as easy as it seems.",
            "If you anticipate a little bit, you can get between him and the ball when it comes down. It's actually pretty hard to pull off against a somewhat competent defender.",
            "This isn’t special here either",
            "100% I played right back in high school in the US and a lot of us could do the move but the issues is with a good D man you’re just gonna get boxed out and lose the ball. Not overly impressive if you played but I can see how it can be if you hadnt",
            "also the goal keeper is not very smart for going out like that",
            "One of the first cool tricks we learned at football summer camp when I was like 6 yo",
            "Yeah agree with you - this is a load of bollox. Defender was shite also",
            "I live and grew up in the US and I don't find this special. Pretty much my entire team could do this when I was in elementary school.",
            "Im in America and this was the first thing I taught myself when I was a kid.",
            "As an American, I hit this exact move for the first time wheni was 12. I’m certainly no prodigy. I didn’t even get places in the “all state” team in high school, which was basically just a “we picked the four best players on our team to put into a fantasy high school sports bracket”, so it’s not like I was even one of the better players in my general circle. ",
            "As an American, this didn’t look like anything too crazy that only a “prodigy” could do. Is there talent? Sure but, eh.",
            "Nope. I’m in the US and basically everyone on my highschool team could easily do this.",
            "Yupp basic in Brazil too",
            "Played for 15 years, everyone on the travel team I was a part of for most of those 15 years could do that trick.  Hell I just tried with a plastic bottle and I could still do it, but actual execution and usage of it in a game setting was very very rare.  He was up against someone and did it cleanly and then got the volley off too in the corner. I’m not saying what you said is bullshit, but if every Italian was able to perform like that in games they wouldn’t be 3 pts behind Spain in the euros.",
            "When i was a kid, me and my friends could do this trick as 12 yo. We never thought we were prodigies lol",
            "My bet is an American posted this. But the faint dialogue definitely doesn't sound American. ",
            "This",
            "As someone who kinda sucks at soccer, I learned how to do this in about a week when I was 16 in order to humble some of my buddies in gym class. This dude could be really good, but this clip doesn't prove anything",
            "The touch was heavy, granted, but don’t pretend that most can pull this off. They absolutely cannot.",
            "I can do this trick and I have not played in a club since I am six years old and now I am\nFat mid 30s guy who cannot run. Still can do this trick pretty well.",
            "Yeah we had kids doing this in my youth league. USA for me.",
            "I mean I thought it was special, but I get winded walking to the mailbox and back. The best trick I can pull off is bending down on one knee to pet my dog and then standing back up without using the aid of a table or wall.",
            "Yeah we need to see more from this guy. This flick isn't that hard to execute and neither is the volley outrageous or anything it's a good hit but anyone who's played knows the feeling of catching a shot perfectly because they're not something only the elites can do, we all catch something sweetly every now and then at a minimum",
            "The muppet swarm afterwords like kid scored the winning goal in the WC final is hilarious",
            "Not rude at all, that's one of the first tricks I learned as a kid in the UK, pretty much all of my friends could do exactly that. Nothing special and definitely not a 'prodigy'.",
            "I don’t think that’s in the US, look how excited everybody’s getting about soccer.",
            "I knew I'm not the only one who is not impressed.",
            "From US, I can do this, never play organized soccer. My friends were good and I liked fifa street. It was a nice move and good finished. Not a prodigy.",
            "How’d those Italian protégés do in the last World Cup?",
            "Well if the caption doesn’t exaggerate how do you expect the video to have views ?",
            "It's in France but your right.",
            "Americans are easily amused, like giving a child some interesting candy. Not rude if you’re speaking the truth.",
            "American and yeah this isn’t really a special skill that blows anyone’s mind",
            ">  but this is really nothing special. \n\nIt's crazy on tennis subs, and in comments, the shots that lower level players or non players think are amazing. Meanwhile, IMO the truly amazing things don't even get comments.",
            "I've never seen anything like this before.",
            "I used to think I’m half decent at the game. Was in Brazil for the World Cup. Saw a bunch of kids playing on the beach. Asked them if I could join. Next 30 mins made me feel like a complete idiot. I asked and swapped to being keeper. Still got styled on.",
            "Ever since the media anointed Freddie Adu, who never became what he was destined to become, I’ll wait.",
            "If you can’t kick the ball like that you’re bad at dribbling. And I’m REALLY bad at it",
            "I am an American. You are right. All these kids except the one who scored are just npcs",
            "I'm American and I don't even think id call this exceptional. I played soccer (yes i know) from ages 3 to 18- Covid fucked me up- and I absolutely knew people that could do this. Hell, on a good day, *I* could do this .\n\nBut American and German football are really similar in that they put a lot more emphasis on building solid players that can fit in a team than they do on footwork. My footwork was solid, but there were guys a lot better than me out there when it came to that. \n\nStill, I played for the JV and Varsity teams at the same time and had the most goals out of any player on both, and possibly in the district. Not cuz of my footwork but because i knew where to be and when",
            "Dude, I was thinking the same. This is just the shit average English kid's do when they're playing at the park lol.",
            "I doubt that. Not like this kid against a defender and a rushing goalkeeper he does the trick then puts it top bins. I very much doubt “most” of your friends could do this.",
            "What would a soccer \"prodigy\" look like if not just really good at soccer? How do you determine what a soccer prodigy is? What's your metric?",
            "As an Italian, I can definitely confirm I've never seen someone score sideways into the goal's top right corner AFTER perfectly placing the ball less than 3m in front of the goal line to the left of the goal with a trick like that. \n\nThis is absolute skill. You don't sound rude, but I'd love to see most of your friends do this first try while avoiding hitting dozens of people and dodging defenders. I can guarantee, betting my left testicle, that they can't do this, even on their 50th attempt.",
            "Wow an Italian being dismissive of something not Italian but impressive while simultaneously bragging about Italians. Color me shocked.",
            "Honestly happened like once a day wherever you'd go to kick a ball as a kid. Reactions were always hype though, it's special in the moment for sure",
            "Bro did a double rainbow and then a one time without the ball ever touching the ground to the opposite corner of the goal and people are acting like this kid is mid. Gtfo. For once in your life get off the couch and acknowledge something is awesome you jaded pessimists.",
            "Cant agree more. It must be US since soccer, hype crew and camera setup :)",
            "I am an American casual fan but play a lot of fifa , you are correct. This is like a throwing it off the backboard and dunking the ball in basketball. It was cool about thirty years ago but not now",
            "Used to do this all the time down the park in the UK when I was a teen ,spent ages practicing flicking it up in the air",
            "That goalkeeper wasnt good though",
            "I mean could it be both things? He could be a prodigy but in the clip here he pulled out a relatively simple and cool move smoothly on the spot?",
            "Show us something cooler then",
            "Yeah I know what you mean. I could do\nThis if I trued it a few times with a bit of luck and I don’t even play football really",
            "[deleted]",
            "I think this is the UK.",
            "This isn’t a rainbow.",
            "This video is from England.  But go on ahead and assume it’s the US because we get excited for things we think are cool.",
            "Can confirm. I’d say half my friends had this down, maybe not as smooth as this, by 13 or 14. And we are Irish, not exactly a powerhouse. And the defender stepped off him which would never happen like that. It still looks nice",
            "Its not special even by American standards! Maybe to the average non-fan but any American soccer player would know this isn't special.",
            "All of you people saying \"this is special by American standards.\" are absolutely brain dead.\n\nRising ballers is based in the UK. This video was filmed in the UK. All of these people freaking out in the video are British. Stop pretending only Americans would be impressed by a cool skill.\n\nDon't get me wrong, you don't have to be a soccer prodigy to do this skill. But acting like only Americans would think this is cool is fucking stupid because EVERYONE IN THE VIDEO IS BRITISH.\n\nI mean just go watch any of their 1v1 videos and see how often someone pulls this skill off and scores. Hint: it's not often. I watch a lot of different channels that do these 1v1 videos and skills like this actually working are pretty rare.",
            "Marginal American player here.  I could do a rainbow in my early teens",
            "We are all quite aware the USA sucks at soccer. lol",
            "If this isn't exceptional why are so many people there recording and cheering?",
            "As an American, yes, this was something my soccer playing friends and I could do by 13.",
            "I mean this was my go to move at around 14 and I’m Canadian, so no, it’s not ‘something special for *North* American’ standards lol. OP probably doesn’t follow football and this kind of flair move would look fairly exceptional to most who don’t (that being said, no idea where the ‘prodigy’ comment comes from - nothing about this suggests he’s a prodigy). \n\n…  Also, not speaking to the video in particular, but I will say that just because a 14 year old can do it against other 14 years old’s doesn’t make the move it self inherently unimpressive. Seeing the likes of Neymar or Vincius pull off a rainbow in real time at the top flight is absolutely exceptional. To pull it off against a top-level defender, at the speed of the modern game, is insane.",
            "I knew kids working on rainbows and being pretty decent when I was playing soccer and I quit to focus on other sports when I was like 10 or 11. Very cool move and a lot cleaner than some you’ll see but definitely nothing revolutionary or prodigy level.",
            "This isn’t the US and this isn’t a rainbow.",
            "I imagine the goalie would engage quicker when the ball was in the air.",
            "Wheres the trick? I just see two lads playing ball",
            "It’s just a shit title ",
            "Nah our breaks in practice in America in the 90s consisted of doing tricks like this. Like 3-4 guys on the team could do this at 10-11 years old... I could rainbow kick but I probably couldn't reach that level of launch on the ball, I quit soccer at 14 though so if I continued I probably could\n\nWe would have juggling competitions after practice and you couldn't compete unless you rainbow kicked the ball to yourself.\n\nIt's just that there is no soccer media or culture here, so this stuff doesn't get circulated in general culture.",
            "I think the title is hyperbole, but your comment is also unnecessarily shitting on the move. It would be like saying an American child can go behind the back in Basketball by the time they're 13, but if there is a video where a European kid does it so smooth he breaks the defenders ankles its still a sick move. I'm not going to be like, any average American defender would read the hips on that and keeps his balance off his heels to not get broke. \n\nYou say you'd press up or the move isn't applicable, but the biggest difference between pros and really technically good players is knowing when moves are going to be effective and using them in those moments. Nutmegs are not worth it most of the time if you look at risk/reward, but some of the sickest goals start with nutmegs. All moves can be applicable in the right situation and this dude chose the right one to look nasty here.",
            "These comments are both right and wrong. \n\nThere’s nothing prodigious about this but it’s very well executed and he takes the shot well. He’s clearly not shit but yeah, title is overdoing it.",
            "It's like when a street basketballer does something, you watch it and you're impressed at what they do. But they don't get called prodigy because that would never make sense when there are so many professionals and others who aren't professionals that can do the same thing",
            "It’s cool but not really all that applicable in game situations. I think most commenters are under reacting because they put prodigy in the title.",
            "When I was young, we all learned the behind the back overhead lift thing, but what is impressive here is first of all, the distance, and then the strike at the end.\n\nThat blind self pass at that distance is not easy. He appears to have intended for the ball to end up exactly where it did: in position for a shot on goal with no need for an extra touch to control the ball before striking. I wasn't particularly good at football, but even I could do the flip thing from behind and time the ball to catch it if it was only a few feet away. Getting it to a particular place so far away ahead of me so I could strike with a single touch is something else entirely. This is the kind of thing a talented youth league player can do, but do not be fooled. It is very hard for a casual.",
            "I was impressed, then I read this comment and now I have no idea if I'm impressed or supposed to be impressed.",
            "As a Canadian who doesn't watch soccer, this was impressive to me. Finding out in the comments that it's apparently nothing special is eye opening. I wonder if those same people saw the puck skills that young hockey players can show off would lead them to think they're wayne gretzky 2.0 lol.",
            "It’s perfectly fine to be impressed by this.  A lot of people aren’t impressed by Lebron James or Luka Doncic either.  But just because they say online that they could do this, at least half of them are lying and the other half would mess it up the majority of times they try.",
            "Its basically the first trick you learn when playing soccer as kids in germany. Everyone could do this.",
            "It's impressive, I don't know about the title but it's impressive regardless. People just hating, I swear half of them would be screaming \"OOOOH!\" if they saw this in front of them but because of the title and because it is reddit, they put it down as \"everyone can do that\".",
            "We need the Fox Tracker!!!! I think that's what that stupid idea was called.",
            "Yes.  I hate it.  But I guess that's just me showing my age.",
            "I was hearing it on espn couple years ago and thought it had died off pretty quick.",
            "I honestly thought they were comparing him to Ronaldinho, for some reason. (Cool song, tho)",
            "It's fucking terrible.\n\nBroccoli heads running around \"he is him frfr no cap\"",
            "Pretty sure it’s a reference to the gay devil from powerpuff girls",
            "It's definitely a Millennial sports thing. Been around for quite some time",
            "Also \"defender\". Clearly doesn't know how to defend.",
            "You can thank the Brits for that. America was just copying them.",
            "You mean the word the British created? Yes",
            "That is the name of the sport in many parts of the world, yes. Including the UK which literally has a TV show called “soccer Saturday”",
            "Yes, or \"Association Football\" where association was shortened to \"soccer\" because British people love putting Rs on the end of words like calling China \"Chiner\".",
            "Yes, tho I just learned that nowadays it's called rainbow flick?",
            "My 25yo ass plays football regularly but inconsistent with rainbow flick😭",
            "Fun and cheap hobby for everyone",
            "The account that posted and captioned the video is from the UK. You gonna mock their english too?",
            "It’s called soccer because OP is American.",
            "waaah waaaah",
            "Best part is the post is from the UK. Check the @risingballers brand lol.",
            "[I’m sorry to burst your bubble](https://youtu.be/1pqG1SqX4oY?si=A0_yJ-aWra9k80fq)",
            "Its a UK video. Not \"Aerica\"..",
            "I mean, Reddit is an American company, based in San Francisco. It stands to reason that a large subset of the user base would be American and thus use vernacular familiar to them a la soccer, fries, etc.\n\nHere’s the demographic data, in case you’re interested:\n\nhttps://explodingtopics.com/blog/reddit-users",
            "https://youtu.be/1pqG1SqX4oY?si=A0_yJ-aWra9k80fq",
            "This kid also did not pull of a rainbow flick in a game...",
            "This is no game, he is just showing off. And the other guy does not even try to defend, he is just running two meters along the guy. \n\nAnd yes, its easy as hell. I learned this trick, like everyone else, in my youth by trying it again and again. And for the finish: With no defense and a goalkeeper like this its also \"easy as hell\".",
            "I'm shit at football. But this trick was one we learnt in secondary school/highschool. It was made famous by the Brazilians. The trick is to get the ball to roll up the back of your leg and flick as you faint pass.",
            "This isn't a game",
            "[https://youtu.be/1pqG1SqX4oY?si=A0_yJ-aWra9k80fq](https://youtu.be/1pqG1SqX4oY?si=A0_yJ-aWra9k80fq)",
            "This is in America, assuredly. Also likely to be at a camp event ran by a recruitment organization or travel team affiliate, or at the very least, a YouTuber who uses these clips in their videos.",
            "He's Moroccan & Equatorial Guinean",
            "Half of FC Barcelona's squad is made up of kids. Lamine Yamal and Cubarsi are the latest, both underage yet starting for the first team. Meanwhile they both go to school lmao. Gavi, Pedri, Fermin are only slightly older, but also started for the first team as under 18s.",
            "The least talented Brazilian babies",
            "As a Brazilian, I can confirm it",
            "I don't believe that 350 mazillion babies can do this",
            "Doctors hate these Brazilian babies",
            "Even more fun of a fact, 100% of Brazilian babies are practicing this move on their mother’s bladders.",
            "The other 65% are forced to become permanent off-duty cops",
            "That's because as sperms they have two balls to play with",
            "Argentinian sperm do this using smaller, inferior sperm as a ball",
            "You're joking, but actually one in seven Brazilian kids can do this trick before they enter school age. Google \"Brazil 1:7\" to find out more.",
            "This is actually live footage of a Brazilian birth.",
            "Only when they’re not playing German babies",
            " ilhan mansız did this to Roberto Carlos in wc 2002",
            "I'm trying to figure how many babies is 35% of a Brazilian...that's a lot of babies!",
            "This statistic is obviously a blatant lie. To be Brazilian, babies must be able to do this AND more while still in the womb. If said baby doesn't bicycle kick the soccer ball out before its head breeches, it's tossed into the Amazon River.",
            "I was a Brazilian baby and wasn't able to do this so I was aborted. Now I am back as another nationality.",
            "On sand.. in the rain..",
            "That's the lower 35%. The other 65% can do this while a spermdrop in their father's balls",
            "*Snaps pasta in his direction",
            "🤌",
            "Babadee bubbadee 🤌",
            "I hope I don't sound rude, but almost every country shits on the USA",
            "[deleted]",
            "It’s the “with all due respect” rule. You can’t get mad if I start my sentence with it. You’re not allowed to.",
            "Oh did they \"shit on the US\"?",
            "Technically, the person could still be a prodigy, just not evidenced by the video. I have no idea who he is, but that trick itself doesn’t make him a prodigy. Maybe he has a dozen more. Who knows who cares",
            "where are you from? never heard anyone call it a rainbow move, very interesting",
            "This is not a rainbow flick...looks the same, different technique.\nSome might argue this is easier to pull off tho",
            "Or just kicking the ball away, instead of trying to defend.\n\nOr having a competent goalkeeper, who says thanks for the free save. Its only a trick to impress people that have no idea about football.",
            "There's a lot of Renaldos in these comments acting like this was  something they perfected as a child. You guys are all full of shit. Each and every one of you.",
            "but how do you guys play when everything is cover in 53 meters of snow and ice?",
            "I’ve never seen someone do this here but I don’t catch many games here",
            "Yes….but, please clarify: you are watching Italian and Brazilian kids",
            "Soccer circlejerk would have a field day",
            "This isn’t a rainbow flick. This is an advanced rainbow, which is more of a kick than a flick and is considered much harder than a simple rainbow flick, which can be done standing still.",
            "The goalie didn't try. In a game, that'd be swatted before it even reached head height, much less volley height.",
            "It was really enlightening visiting the US for my study abroad semester - as the captain of my uni’s basketball team I was getting run off the court even in intramurals. Yet somehow I felt like a man amongst children playing soccer, despite being barely allowed to touch the ball back home",
            "It is in switzerland, where the poster is from I dont know though (source: I know the guy in the video + the shirts of some backround kids are from swiss amateur clubs)",
            "This is an ENGLISH youtube channel travels around the world",
            "Foul! No two fouls!",
            "Yeah at that age a prodigy is playing in a top European team, not doing tricks for kids.",
            "Ouch… :(",
            "yeah we were all practicing this trick in 6th grade on the field lol. it's def impressive to Americans who didn't play soccer growing up, but those of us who did see it the same way the civilized world sees it.",
            "American soccer player and fully agree.",
            "> All of you people saying \"this is special by American standards.\" are absolutely brain dead.\n\nThey're not brain dead, they're just European. It can be hard to tell the difference, though.",
            "I imagine it’s not so much the skill that was the reason for the reaction, but maybe it was for the win of this YouTube event of sorts and the guy pulled that move out when it mattered and executed. \n\nProbably the excitement of the spirit of the competition and not solely the skill alone.",
            "You're brain dead...they're saying it because an American posted the video you fucking idiot. The rest of the world doesn't say soccer, bar the Aussies.",
            "The original post by rising ballers doesn't indicate that they believe the guy to be a prodigy; plus the title using the term \"soccer\" is a dead giveaway that OP is American. Still def agree with most of what you said regarding the video.",
            "He didn’t just do a rainbow tho did he",
            "Ya I'm 34 and I can still do this from casual fucking around when i was 14-15. That being said, the shot off the volley is nothing to sniff at, even if it was lucky.",
            "That wasn't a rainbow",
            "Thats 11th placed in the world according to FIFA, USA to you 😤😤 (somehow) ahead of the likes of Germany, Colombia, Uruguay, etc...",
            "11th in the world sucks? You understand how many countries participate in the World Cup qualifiers, right?",
            "Thats the thing, a sick goal is nice but do u know whats even better? Winning the game.\n\nI think we have a different ideia of what is a great player. Doing cool tricks and all that is nice but that doesnt necessarily mean ur any good in the game and certainly doesnt win games. A great player plays with his head up, reading the game, knows when to make that long pass or not, is really fast at changing pace, and probably one of the most important things is the first touch, receiveing the ball with purpose already knowing what he is going to do next. U cant teach that in-game reading quality, the tricks u can learn.",
            "I think all the comments saying that this is a simple rainbow flick are lying or missing the 3rd touch. A normal rainbow flick is done with two touches, the roll up onto the back of the opposite foot, then the flick. This guy does the roll, but the flick is only to give the ball a little height, then he has a third touch with the outside of his right foot is what send the ball forward. Not doing the flick on the second touch freezes the defender slightly before he sends the ball forward, plus the extra touch increases the difficulty of the move. It’s is also the reason why the ball travels much higher and farther forward than what you’d normally be able to achieve with a standard rainbow. Granted it’s not prodigious, but it’s also not an easy skill that most would be able to do on the fly like that.",
            "I'm more impressed by the shot than by the trick before, landing that shot is tough the trick is not",
            "I’m assuming he’s called a prodigy because this isn’t the only time he’s shown great skill. \n\nI’m a basketball guy. I see clips all the time and people are like “well actually he’s not a prodigy, me and my friends did that before”\n\nMeanwhile the kid in the video is going to play for Duke lol. I think people have a hard time understanding that just because there’s only one highlight in the clip doesn’t mean it’s the only amazing thing a player has done",
            "Never heard it before",
            "They dont call it that over there tho",
            "99% of people in the UK call it football.",
            "\"many parts of the world\" means the anglosphere and pacific island nations?\n\nThose are the exact places where football isn't as popular. The overwhelming majority of SA, Africa and mainland Asia call it football.",
            "This is not a rainbow flick. This was an advanced rainbow. A rainbow flick can be done standing still and doesn’t have as much forward power that can be put behind it. The advanced rainbow has multiple steps. There’s a roll, pop, juggle, and kick versus a roll and flick.",
            "Yes, whoever wrote this is clearly missing brain cells.",
            "lol hating on their own",
            "Then use proper terminology. It's football.",
            "That’s a rainbow flick. This is an advanced rainbow the ball isn’t rolling up your back leg when you do the kick. It’s already in the air. The advanced rainbow is very different than a standard rainbow flick.",
            ">Rising Ballers\n5.0\n1 Google review \nMedia company in London, England\nLocated in: Ludgate House\nAddress: 107-111 Fleet St, London EC4A 2AB, United Kingdom\n\nWhoopsie",
            "I saw Pedri and Gavi started at 16 too when I looked into it more. Did not know Fermin or Cubarsi. Just so crazy they’re even remotely able to attend school while doing this, that in itself is a prodigy achievement. And there was an award lamine missed because he was at school. I saw an article say if they reach the euro 2024 final he will quit school, and I can’t blame him; he’s already working a full time job making more a month than his teachers. Contract essentially worth 1billion USD give or take a marginally amount, because of the buyout clause. Good for him",
            "Like ancient Sparta, ancient Brazilians would cast babies that couldn't do this trick off the top of Christ the Redeemer.",
            "need some keepers too",
            "Brazilian babies aren't born. They wash up on a beach, with a futbol juggling off their forehead.",
            "I’m not Brazilian and I cannot do this.",
            "as a brazilian baby, i can confirm this",
            "Pretty sure babies don’t live in bladders.",
            "Damn. Brazilian babies develop in the bladder? Wow. Who knew!?",
            "Not always...",
            "*gasps in Italian",
            "https://www.pewresearch.org/global/2023/06/27/overall-opinion-of-the-u-s/pg_2023-06-27_us-image_1-01-png/",
            "Even the USA!",
            "Because there are a lot of idiots in the world. A bunch are here believing anything they read lmao",
            "They’re jelly",
            "They hate us cuz they anus.",
            "Being number one, we expect everyone else to hate on us.",
            "> a neutral objective reference \n\nThere are **numerous** well known other countries that also call football “soccer”.\n\nThis person was deliberately suggesting that the US is inferior at football for no other reason than “grrr r/americabad”. \n\nJust like *you* suggesting that Americans are offended at any statement other than praise.",
            "Not the guy you replied to, but it’s called a rainbow flick in most English speaking countries.",
            "This is what its been called in the english version of Fifa for a long time. Idk what its called elsewhere, but ive only ever known it as a rainbow. Im American.",
            "There are multiple rainbow moves, but this is an advanced version of it, which is seen as much harder than the standard flicks.",
            "Because it’s not really a rainbow",
            "This is basically a one to one of the \"advanced rainbow\" from the Fifa games fwiw. Not sure what you would call it otherwise, which is why I called it that. Ive never heard it called anything else tbh.",
            "Yeah I mean a competent defender would push the guy away, I think the more impressive wall was that volley",
            "Absolutely agreed",
            "With snowballs and polar bears",
            "With determination and tears",
            "What the fuck is that supposed to mean?",
            "I’m Canadian and I can do this consistently.. in FC24",
            "Oh the irony.",
            "Nope, definitely it was because he waxed that defender with a dope skill. You guys are seriously overestimating how often a move like this gets pulled off...",
            "I don't think that the US is bad team by any means, but Concacaf is absolutely a farmer's confederation.",
            "I mean if you play with numbers enough maybe not being in the top 10 doesn't sound that bad?",
            "You're a certified hater.\n\nYou just wrote a lot of nothing \"hue heu the best player is not the one who does tricks\", no it might not be but any player who's good at dribbling and getting passed 1v1 situation is to KILL for in any team. \n\nThey make every play possible because the teammate and coach knows that they can create situations. It also does not mean that you can just do one or the other, a player who can do tricks and dribble can just as well \"read the game\" and what not. They make the game fun and exciting for everyone.",
            "I mean this is a 1v2 situation drill and not a game. A quick search of this highlight shows it’s from an event in Switzerland, so it looks like even most Europeans think this was a nice move and the kid has talent. Maybe you and your friends could all lock this dude up at 13 and easily score on these crappy European players too. Regardless, as it turns out Americans were not involved.",
            "It’s well timed and executed and has a lot of power behind it. It’s a bit more than a rainbow flick. This is considered an advanced rainbow, which has that extra kick, which is much more than a simple flick. I’d agree not difficult to do in practice, but does take some skill to do it in a match.",
            "Nah dude this is pretty fucking easy. I used to play almost every single day in college 5v5 with random dudes, you see way more impressive stuff than something like this. I'm from south america though, so there's that.",
            "This never works in an actual match. That's why you never see pro players do it.",
            "Personally my dumptruck always used to get in the way when i did it the normal way, so I normally did it similarly to this so I could hit the ball better",
            "No, it is much harder to do a 2 touch rainbow flick as you call it and give the ball that height arc. Doing it in 3 touches is a bit easier.",
            "They created the word",
            "Because you guys don’t have a sport also called football that is the most popular sport in your country.\n\nIn America we need to differentiate between the two, so we use Soccer.",
            "Yes, depending on your definition of “many”, it very well could mean that lol. \n\nI’m aware that it is called football by the overwhelming majority of the world",
            "Guess our culture has rotted London lol",
            "only the skilled and playful may call themselves brazilian. only the skilled, only the playful",
            "I don’t know why but “ancient Brazilians” made me lol",
            "Blame your parents for not being born in Brazil",
            "I'm not a soccer ball and I've never not had this done to me by a nonBrazilian",
            "Are you a baby?",
            "You can fucking type in English too?? Damn.",
            "As a baby confirm, I can Brazilian this",
            "They kick hard enough to reach it",
            "on =/= in",
            "According to my wife they use the bladder as a soccer ball.",
            "Nutsack den?",
            "I’m confused on how my comment is in any way saying babies grow in the bladder. As a baby grows in womb/uterus it puts pressure on organs, I was making a joke about how some women make the statement “it feels like he/she is kicking me in bladder”",
            "*brings out the pineapple for the pizza",
            "Don’t mind me, just over here cutting up my spaghetti with  fork…",
            "Poland, I am SO sorry for all the Polish jokes we used to make as kids, we didn’t know you loved us like that 😢",
            "It's friendly shitting",
            "Page two of that graph shows a huge drop in favorability between 2016-2020. I wonder what changed for those four years.",
            "Why so serious, US is pretty shit at football. Even casual viewers know that",
            "Not sure if it would have an individual name honestly. \nA rainbow flick however flicks the ball with the other leg, has a different method of getting the ball off the ground to start and generally has more of a sideways movement to it",
            "That’s what you call it. It’s the advanced rainbow. Much harder than the rainbow flick, which can be done usually standing still. It’s more of a kick than a flick.",
            "It's a reference to other comments in this thread. Comments like \"fun fact: Brazilian babies can do this at 3 months old\"",
            "The reaction was most definitely because off the skill, but this still happens quite often. We'd get reactions like this at least once a day when I was a kid playing",
            "Oh no. He definitely waxed him. I dig it, i think people are hating here so much lmao. Didn’t mean to discredit the move or anything. \n\nLike the comments that keep saying a goalie would’ve smacked that out, but…if someone did this in a full match, they’d try and do it so it wasn’t so close to the box. \n\nIt’s a fun video, people are overly critical of shit. \n\nI love that he seemingly did this and pulled it off in the heat of a do or die 1v1 in the final or something.",
            "Hard to argue with that.",
            "Well the US makes up like half of the Concacaf population so….",
            "I’m American. I was average in high school if that. I never played beyond this. I could not only do this I could juggle with my heels. If you play for 10 years as a kid you can probably do this.",
            "If a pro player does it in an actual match, they'll get fouled after because opposition players will see it as 'showboating' or 'disrespectful'",
            "Oh yeah, then our definitons just vary.\n\n I just did the math and around 8% of the world call it some variation of soccer, those nations being mainly the anglosphere, south africa and japan",
            "Nah, you're just a fucking hater. This shit would be hype at most places in the world.",
            "Thank u parents for not borning me in Brazil",
            "Least they could do is shag a brazilian, disappointing",
            "I wouldn’t worry about it, I clearly don’t know how to read. My b",
            "I will die defending pineapple on pizza, I don’t care what the definition is it’s fucking delicious",
            "*peels slices of gabagool and tears holes and wears it like a mask",
            "NO, stop, he already snapped it, you don’t need it any smaller!",
            "So, you’re saying that they don’t have a submarine with a screen door installed on the side?",
            "![gif](emote|free_emotes_pack|thinking_face_hmm)![gif](emote|free_emotes_pack|shrug)",
            "11th in the world is shitty? I’m guessing you’re one of those casual viewers.",
            "Even using the more “standard rainbow”, isn’t this trick just a mini-rainbow plus a heel touch?",
            "Lmao this isn't american football.  \nBesides, I think you missed my point. When I say pro players, I mean pro players that aren't ronaldo or neymar, in this generation, because they do these flashy tricks a lot of the time.",
            "As a brazilian, I agree",
            "Dammit. Now I'm hungry.",
            "Do their firing squads no longer stand in a circle?",
            "Aight man chill they suck at world cup okay but I get a feeling you’re a psycho so US is great at everything even soccer",
            "Are one-armed Poles not falling from trees anymore?",
            "Whoa, calm down, no need to name call. I’m just saying it’s insulting to all the countries below the USA in rankings to say they suck."
        ]
    }
}