{
    "/r/NintendoSwitch's Daily Question Thread (06/22/2024)": {
        "title": "/r/NintendoSwitch's Daily Question Thread (06/22/2024)",
        "score": 0,
        "url": "https://www.reddit.com/r/NintendoSwitch/comments/1dlpuhg/rnintendoswitchs_daily_question_thread_06222024/",
        "content": "#/r/NintendoSwitch's Daily Question Thread\n\nThe purpose of this thread is to more accurately connect users seeking help with users who want to provide that help. Our regular \"Helpful Users\" certainly have earned their flairs!\n\n##Before asking your question...\n\n* **Check out the wiki pages listed below.** - *(If you're interested in becoming a wiki contributor, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FNintendoSwitch&subject=I%20am%20interested%20in%20becoming%20a%20Wiki%20Contributor).)*\n* **Perform a quick Google search.** - Sometimes it is actually quicker to search for something than to wait for someone else to answer.\n* **Search the subreddit.** - Many questions have been asked before! reddit's search functions a bit differently than Google. \n\n---\n\n##Helpful Links\n\n###Wiki Resources\n* **[Frequently Asked Questions](https://reddit.com/r/NintendoSwitch/wiki/faq)** - Our FAQ has answers to many questions about the console system and controllers.\n* **[Lost & Found Guide](https://www.reddit.com/r/NintendoSwitch/wiki/lost-switch)** - Did you lose your Switch, or are you someone who found a Switch? Info on how to get it back!\n* **[Tech Support Guide](https://www.reddit.com/r/NintendoSwitch/wiki/techsupport)** - Info on how you should react in case you discover a technical issue on your Switch.\n* **[Error Code Lookup](http://en-americas-support.nintendo.com/app/answers/landing/p/897/c/189)** - Nintendo's Error Lookup System.\n* **[Digital vs Physical Games](https://reddit.com/r/NintendoSwitch/wiki/pvsd)** - Listing the pros and cons of both formats to help you decide what will work best for you.\n* **[Game Share Guide](https://www.reddit.com/r/NintendoSwitch/wiki/gamesharing)** - Info on how you can share your digital games across multiple Nintendo Switch consoles, including playing on both consoles at the same time. \n* **[Other Switch Related Subreddits](https://reddit.com/r/NintendoSwitch/wiki/relatedsubs)**\n\n###Wiki Accessory Information\n* **[Accessories](https://reddit.com/r/NintendoSwitch/wiki/accessories)** - Starter information about controllers, chargers, cables, screen protectors, cases, headsets, LAN adapters, and more.\n* **[MicroSD cards](https://reddit.com/r/NintendoSwitch/wiki/microsd)** - Some more in-depth information about MicroSD cards including what size you should get and which brands are recommended.\n* **[Carrying Cases](https://reddit.com/r/NintendoSwitch/wiki/cases)** - An expanded list of common carrying cases available for the Switch.\n\n###Helpful Reddit Posts\n* **[The /r/NintendoSwitch Best of 2017](https://www.reddit.com/r/NintendoSwitch/comments/7tdj1j/the_rnintendoswitch_best_of_2017_award_winners/), [Best of 2018](https://www.reddit.com/r/NintendoSwitch/comments/abi0x0/the_rnintendoswitch_best_of_2018_award_winners/), [Best of 2019](https://www.reddit.com/r/NintendoSwitch/comments/en99ih/the_rnintendoswitch_best_of_2019_award_winners/), [Best of 2020](https://www.reddit.com/r/NintendoSwitch/comments/lk5hrf/rnintendoswitch_game_of_the_year_2020_voting/), [Best of 2021](https://www.reddit.com/r/NintendoSwitch/comments/sc6120/rnintendoswitch_game_of_the_year_2021_voting/), and [Best of 2022](https://www.reddit.com/r/NintendoSwitch/comments/11vpxdt/rnintendoswitch_game_of_the_year_2022_voting/) Award Winner Recaps** - A good place to start when you're looking for a game recommendation.\n* **[The Switch is not USB-C compliant and overdraws some USB-PD power supplies by 300%](https://www.reddit.com/r/NintendoSwitch/comments/87vmud/the_switch_is_not_usbc_compliant_and_overdraws/)** - Why you shouldn't use just any USB cable, should research portable power banks, and avoid using third-party docks or wall chargers.\n* **[Choosing Your Nintendo Switch Charger: A Comprehensive Guide to Understanding the Options](https://www.reddit.com/r/NintendoSwitch/comments/66i5gs/choosing_your_nintendo_switch_charger_a/)** - What sort of wattage you should look for in a battery bank or wall charger to get the best charging speeds.\n\n###Third Party Links\n* **[Benson Approved USB Type-C Cables](https://www.amazon.com/hz/wishlist/ls/IOGWYK5NXWAE?type=wishlist&filter=unpurchased&sort=price-asc)**\n* **[Benson Approved USB Type-A Cables](https://www.amazon.com/hz/wishlist/ls/KF89JCHI0KT4?type=wishlist&filter=unpurchased&sort=price-asc)**\n\n---\n\n##Reminders\n\n* We have a volunteer run #switch-help channel in our [Discord server](https://discord.gg/switch).\n* Instructions and links to information about homebrew and hacking are against our rules and should take place in their relevant subreddits.\n* Please be patient. Not all questions get immediate answers. If you have an urgent question about something that's gone wrong, consider other resources like Nintendo's error code lookup or help documents on the Switch.\n* Make sure to follow Rule #1 of this subreddit: Remember the human, and be polite when you ask or answer questions.",
        "num_comments": 3,
        "comments": [
            "What are two players four joycons coop games? I know It Takes Two and Minecraft Dungeons, anything else?",
            "I have read the guides and googled and I’m still confused, if not more. \nI have a Lite. Yesterday I got an OLED. I gave my daughter my Lite. She’s playing Barbie on the Lite and I’m trying to play a different game on the OLED and I can’t. It kicks one of us off. We can’t even play different games on each switch? And I can’t transfer her games (Bluey, Peppa, and Barbie) to a new Nintendo user account, I’d have to rebuy, correct? Either way we can’t both play two different games at the same time unless I want to be out another $100+? Thanks!",
            "Oh boy did I get scared earlier today. I was playing Monster Hunter Rise, ranked up and talked to NPCs who had quests for me (keep in mind the game autosaves after each interaction), created custom food buff sets and took pictures with the ingame camera feature for one of these quests. I then proceeded to go on a quest and had to put my Nintendo Switch in sleep mode to do some chores.\n\n\n\nOnce I was able to play again I tried to wake up my Switch but nothing happened. The screen didn't brighten, plugging in the charger didn't cause any reaction and the only thing that helped was forcing the console to turn off and on my staying pressed on the power button for a while. Everything seemed normal, I did expect the game to be closed since the console restarted so I launched it again.\n\n\nThen I realized something was wrong. Loading up my save brought me back right before I talked to the NPCs, created my custom stuff ect. but it shouldn't be possible since the game autosaves after you do basically anything. What's weird is that I still had the pictures I took in the ingame gallery ! So I lost progress on what I did but still retained the pictures ? That's just weird.\n\n\nBecause I like to understand I tried to just close the game without going back to the main menu and see if indeed the autosave feature was just bugged and only completing quests saves the game but no, launched the game again after doing what I did previously and that time the progress didn't reset. This weird sleep crash my Switch experienced had this weird time-travel effect on my game I cannot comprehend.\n\n\nDoes the Switch have many different saves it keeps and in case the latest one corrupts an older one is used ? Please Nintendo Tech Bros, I need an answer for my sanity"
        ]
    },
    "Hi, we're Cococucumber and Echo Generation: Midnight Edition – our turn-based adventure game – is now available on Switch. Ask us anything and win some keys!": {
        "title": "Hi, we're Cococucumber and Echo Generation: Midnight Edition – our turn-based adventure game – is now available on Switch. Ask us anything and win some keys!",
        "score": 55,
        "url": "https://www.reddit.com/r/NintendoSwitch/comments/1dl65pi/hi_were_cococucumber_and_echo_generation_midnight/",
        "content": "Hi r/NintendoSwitch, it’s the Cococucumber team – welcome to the *Echo Generation: Midnight Edition* AMA.\n\nProof: [https://x.com/rNintendoSwitch/status/1804172735876039053](https://x.com/rNintendoSwitch/status/1804172735876039053)\n\nhttps://preview.redd.it/yqlfcr5lwx7d1.jpg?width=1800&format=pjpg&auto=webp&s=a582d546f39c21952210b78a71e9e5fb834a7401\n\n**Echo Generation: Midnight Edition Launch Trailer:**  \n[https://www.youtube.com/watch?v=HcE4rhakhEQ](https://www.youtube.com/watch?v=HcE4rhakhEQ)\n\nWe’re here to celebrate the release of *Echo Generation: Midnight Edition* on Switch and Steam – the second part of our Voxel Trilogy that includes our previous games *Riverbond* and *Ravenlok* – by hosting this AMA and giving away some Switch keys!\n\nTo participate in the giveaway just ask a question or leave a comment. Winners will be randomly selected after 24 hours.\n\n**About** ***Echo Generation: Midnight Edition***\n\nLead a gang of kids to uncover spooky mysteries, battle creatures, and explore the supernatural side of your hometown in Echo Generation: Midnight Edition, a turn-based adventure set in the 90s.\n\nThe updated edition of the game includes many quality-of-life features like new camera controls, fast travel, a quest tracker, support for 12 languages, and more!\n\nGame: Echo Generation: Midnight EditionDev / Pub: CococucumberGenre: Action, Adventure, Turn-based RPGPlayers: SinglePlatforms: Nintendo Switch, Microsoft Windows, Xbox One, Xbox Series X and Series SRelease: June 19, 2024\n\n**Echo Generation: Midnight Edition - Nintendo eShop:**\n\nAmericas: [https://www.nintendo.com/store/products/echo-generation-switch/](https://www.nintendo.com/store/products/echo-generation-switch/)\n\nEurope: [https://www.nintendo.co.uk/Games/Nintendo-Switch-download-software/Echo-Generation-2587335.html?s=countries](https://www.nintendo.co.uk/Games/Nintendo-Switch-download-software/Echo-Generation-2587335.html?s=countries)\n\nAustralia: [https://ec.nintendo.com/AU/en/titles/70010000059519](https://ec.nintendo.com/AU/en/titles/70010000059519)\n\nWe’ll be here from 1pm - 3pm ET so post your questions below and we’ll do our best to answer them!\n\nThanks for your support!  \n  \n- Cococucumber\n\n\n\n--- AMA OVER ---\n\n  \nThank you for joining us for the Echo Generation: Midnight Edition AMA – and for all the wonderful questions and comments! And our thanks to the team at r/NintendoSwitch for hosting us today!\n\nBe sure to join the Echo Generation Discord to continue the conversation and get updates on the game: [https://discord.gg/8pakNCmR](https://discord.gg/8pakNCmR)\n\nAnd check back tomorrow to see who won the giveaway.\n\nHappy Friday!\n\n- Cococucumber",
        "num_comments": 91,
        "comments": [
            "As a game designer, how do you feel out how hard to go on graphics? It looks like you put a lot of work into these environments which sometimes are just a background players walk past. Obviously the game looks very cool, but how do you balance the time and money it takes to get here? I assume this was planned and built into the game design documents?",
            "Are there any plans to bring Ravenlok to the Switch? I absolutely loved it. I also enjoyed Riverbond. Echo Generation is on my list to play!",
            "Congrats! The collectibles and pets sound like fun.\n\nAny particular inspirations? I’m gonna guess Scooby Doo maybe 🤔 \n\nWhat kind of pets are there in the game? 😍",
            "Of all of the enemies in the game which one is a personal favourite of the dev team? Btw the game looks really good and I bet people would love to own it physical.",
            "I like the blocky but 3d style. What inspired this look, versus a full 3d (smooth) look?",
            "I love the art direction! Do you all have any plans for a physical release?",
            "I see here what some of what I assume are bosses look like, but what is the actual combat like? How's it work?",
            "What was the inspiration behind the diverse visual themes?\nI never played or even Heard of the original and when the midnight edition trailer popped on the Direct,me and my gf ( we both do art,my gf works profesionally -candela kerze ig-)thought the art and design looked great,but were kinda confused about the themes ,since we saw giant mechs,skeletons,werewolves,creatures,aliens,all sorts of stuff under these 80s goony like adventure lens.",
            "How long did the game take to develop? Also, how long is the game in length?\n\nLooks great, btw!",
            "What was the biggest development challenge your team faced, and how did you get around that?",
            "Since the game is set in the 90s and i'm a 90s kid i have to ask, what made you choose such a glorious decade?",
            "Thanks for putting out such a great game, happy to support Canadian devs! And the release timing with fathers day when one of the theme of the game is to find the main character's father fits so well. Can the raccoon be a party member? Also, were you inspired by Stranger Things? Would also love to know more about the storyboard process of the game if possible, who came up with the initial idea?",
            "What was the most difficult mechanic to program?",
            "Hey there, loving the art style of what I have seen so far\n\nMy question is, as a Switch player who also enjoys achievements but also the Switch I rely on devs having their Steam/Console achievements in-game in a menu some such.  Would I find the 50 achievements somewhere in this Switch port?\n\nFailing that, any thoughts towards adding them postlaunch through an update as others have done (Blasphemous, Dead Cells)?\n\nEither way, thanks for doing this AMA and best of luck with your release",
            "This looks freakin awesome! There's a nostalgia factor that I can't wait to enjoy! That giant worm battle instantly hooked me (immediately thought of FF7).  \n  \nYou mentioned that Echo Generation is is part of your voxel trilogy, so now I'm curious: what's next? Where do you plan to take Cococucumber?",
            "Any inspiration taken from the show “Are you afraid of the dark”?",
            "Art style looks great!",
            "Can the Raccoons be a party member?",
            "I love the music in the trailer, reminds me of Zombies ate my neighbors. I haven't played the 1st games, but am willing to because this looks fun. Is it a continuation of the story or same world kind of trilogy?",
            "Such a nostalgic feeling, looks great. Good luck to everyone and take care!",
            "This looks interesting,  will I be at a disadvantage for not having played the earlier game?",
            "Looks like a fun game! Congrats on the release. \n\nIf you could develop any Nintendo IP, which one would you choose? What kind of game would you make?",
            "Very cool looking game! I’ve had nightmares of monster moose like that…. What were your inspirations for the bosses/monsters?",
            "It looks so cool, definitely adding it to my wishlist! What was the most difficult part of the development?",
            "What is something cool about the game that was hard to fit into the trailer",
            "How often did you need to scrap ideas or rework them to fit within your core pillars or time constraints? For some games I've worked on in the past, me and my teams would usually need to rework a bunch of ideas even if we thought they would work well at first. I'm curious if this has happened in other games you guys have developed and how often you would spend reworking the ideas.",
            "Love the art style and animations!",
            "Mom, can we have Baldur's Gate 3 on Switch?\n\nBut you already have Baldur's Gate 3 at home!\n\nBaldur's Gate 3 at home: Echo Generation\n\n\nI really hope you don't mind, this was a pitiful joke, just take it as is.\n\nAs for a question: I almost always don't like to read about movies or games I would like to play, because I don't like spoilers. of course, I try to take some info to see if the game is something I would enjoy, sometimes this would be very hard to find out from a trailer, and you have to start digging into reviews or community, who may or may not spoil the game for you, but that's the risk you'll have to take. I tried doing this with your game, as I never heard of it before, and it was hard to find if I would like it or not. of course, I like RPG's, but you know what I mean. \nleaving that aside, I enjoyed the trailer, because it showed actual gameplay, and what the graphics would look like. and I found it to be very pleasing for the eyes, not everything has to be unreal 5 level [and imo very few devs should try to insist on making games look like real life graphics, but that personal bias]. \nwithout playing, I could not rate the gameplay or story, as I tend to find these the most important aspects of any game.\nreturning to graphics now, what would inspire a game developer to choose the aesthetic and color palette so it can deliver the final product? were you already set on something or reached it through trial and error?\n\n and secondly, can you name 3 games that are your favorites because of beautiful graphics [and you get to choose what beautiful means to you, be it realistic or artistic].\n\nthank you and sorry if it's hard to understand my English. good luck with your game!",
            "Don't have a question, just wanted to say I love the look of the game. Turned based games are also my preference so looking forward to try this out at some point.",
            "Most effective way to generate an echo?",
            "Looks super interesting, definitely need to add to my wishlist.",
            "Congrats!!",
            "How long did the game's development take?",
            "How long would you say the game",
            "Your game seems to have a sort of 80s nostalgia aesthetic. Did you draw inspiration from modern throwbacks to the era like It and Stranger Things or more so actual media from the era?",
            "Hey devs, just wanna say I loved your games and wishes you all a lot more years of success.",
            "Was there any particular reason you chose to set the game in the 90s besides the 90s being pure chaos?",
            "What inspired the name?",
            "this looks awesome, excited to see more! can you befriend the townsfolk? are there skill points / trees? i do love a skill point system",
            "Aw man, I missed the AMA. I loved seeing this trailer the other day and look forward to playing it.\n\nMy question is going to be the most important one someone could possibly ask… \n\nRain. Yes or no? And how much of it?",
            "How long did the game take to develop? Also, how long is the game in length?\n\nLooks great, btw!",
            "PS5 release?",
            "This game caught my eye! Thanks for doing the ama and giveaway",
            "Sounds really fun, how did you guys come up with this concept",
            "Bad at questions, but I love the look of your game.  It looks like you made something really unique!",
            "What is the best Canadian band and why is it Rush?",
            "This would have been such a sweet inclusion in the Indies Direct a few weeks ago!",
            "This looks like really cool game, as Q&A in IT I wonder. Have you guys playtested a lot? Where unit tests used a lot in the development ot maybe automation? \n\nSecond question: Are there partivular areas / battles you guys are most proud of?",
            "Looks good",
            "Vanessa: Great question! Since most of the team come from some sort of visual arts / creative background, this graphics has always been a priority for us. However, when building a scene, the initial starting point is more about what needs to happen at that location and how this fits into the story. Echo Generation is in essence a mystery, so we want to pace things out and reveal the story in a satisfying way and the elements that go into that - the graphics, music, dialog, enemy encounters, etc - all have to work together. A lot of the levels and characters have been through multiple iterations throughout development, and for Midnight Edition in particular, we chose to spend more time polishing the areas that are seen the most such as the main characters and the suburb area.",
            "Martin: Thanks, we appreciate your support! Actually, we are working on Ravenlok at the moment and should have more to share later this year…",
            "Simone: There’s a cat (Meowsy), dog (Doggo), robot (BLOPO-11), raccoon (Rex), and an alien jackalope (Noupy). Doggo’s personality shares some similarities to Scooby Doo!",
            "Vicky: I love the entire raccoon population infesting the Suburb area. They’re adorable and can’t stop picking fights with people\n\nSimone: One of my favorites is the Prom Ghost. I love watching players/streamers getting jump-scared haha.\n\nLeona: I like the critters because some of them hide in random areas, and it’s funny how the baby critter calls for backup!\n\nEdgar: The mutated aliens. Their designs are really cool and they were fun to animate!",
            "Vanessa: Glad that you like the blocky look! We’ve been developing a trilogy of games in this 3D pixel art style which we call the ‘Voxel Trilogy’ and it includes Riverbond, Echo Generation, and Ravenlok. There is something charming, retro and so nostalgic about using pixels / voxels, and in a game like Echo Generation, it really makes a lot of sense. In fact, all three games have this tone in common so you should check them out if you’re interested in seeing the evolution of our voxel art style.",
            "Vanessa: Wouldn’t that be great? We’d love to release a physical for Echo Generation: Midnight Edition once we have fixed all the bugs and ported to all digital platforms.",
            "Vicky: Basically, it’s a combination of turn-based combat with minigames associated with each skill. When you succeed in a mini game, you will do bonus damage and apply various status effects depending on the skill. There are comic books around the world you can collect in order to gain more powerful moves.",
            "Martin: The idea was to create a big mashup and pay homage to different films, TV shows, books, and video games such as The X-Files, Metal Gear Solid, Tremors, Pet Sematary, Fright Night, and LucasArts adventure games. Some locations, like the suburb, ditch trail, abandoned house, repair shop, cornfield, downtown, and high school are also inspired by real places from my childhood.",
            "Martin: Thanks! Echo Generation can take between 8 to 10 hours to complete. We started prototyping in the summer of 2018, and production began in early 2020. In total, it took about 2 years of full-time development for the core team, including the Midnight Edition.",
            "Martin: In terms of coding, one of the biggest challenges was to make everything using voxels as it’s not a usual way to create games. We had to create our own custom tools and art pipeline to make it work. When it came to optimizing for the Switch, the hardware limitation was another added challenge. Voxels in particular aren't well suited for the optimization needed for Switch, so we had to problem solve around that while keeping the charm of voxels.",
            "Martin: Ah the 90s, such a great decade with just the \\*right\\* amount of technology. We love the games from that time like the LucasArts adventure games and Final Fantasy VII. I remember when the first 3D console came out and it was revolutionary. All this makes for a very vibrant and fun decade that matches the tone and visuals for what we had in mind for Echo Generation.",
            "Vanessa: Thank you! We love to hear from our Canadian fans, especially for Echo Generation :) The father’s day launch timing was actually a good coincidence but we definitely leaned into that for the launch trailer once we locked on the release date for Midnight Edition. \n\nCan the raccoon be a party member? - Yes\n\nAlso, were you inspired by Stranger Things? - Also yes\n\nAs for the initial idea, the story for Echo Generation came from Martin (Game Director) who introduced the team to all these really cool and obscure 80s and 90s references and said \"let's make a game about this.” Some of the location, scenes and dialog were also inspired by Martin’s childhood, which you'll have to ask him about!",
            "Justin: For me, the most difficult mechanic to code was the minigame attack system. Each minigame has its own unique mechanic and visual differences, so with over 30 minigames, the sheer quantity alone made it quite a challenge.",
            "Martin: There’s currently no internal custom achievements on the Switch version for Midnight Edition, but it's a great suggestion! Perhaps it's something we could consider in the future.",
            "Vanessa: That is a good question. One thing we would love to do is to expand the story and rich world of Echo Generation in a sequel or prequel. Some other possible areas to explore include switching up some of the gameplay and maybe even the art style (though we’ve come to realize that after completing a self-styled voxel trilogy, some fans may want more voxels!) Either way, we’re excited to share what’s next when ready.",
            "Vicky: Not intentionally! A lot of our inspirations came from the same time period and genre, and it's Canadian to boot, so I definitely see how they relate. The Goonies is one of our narrative inspirations alongside other 80s / 90s kids movies; we wanted to invoke the way they touched on scary and sometimes bizarre stories and myths in combination with comedy and adventure.",
            "Vicky: Rex the Raccoon will happily join your party, but he’s in a bit of a bind and you’ll have to help him out of his predicament first though…",
            "Zombies Ate My Neighbors was such a gem! But scary as hell and impossible to beat!\n\nThis game looks fun too, but in more of an Earthbound way.",
            "Vanessa: Thanks! Echo Generation is a standalone and you don’t need to have played the other games in our voxel trilogy to get into this one; the connection between the three games is through the art style.",
            "Simone: You definitely don’t need to have played the earlier release to enjoy playing the Midnight Edition! The general story and gameplay is very similar but with added fixes, improvements and quality of life features. It’s great for new players and those who have played previously.",
            "Vanessa: Thank you! Since Tears of the Kingdom is one of my most played games on Switch, I would love to work on the Zelda IP. Not even to make a new game, just to work with the TotK devs be like “How did you do that?”\n\nJustin: If I had the chance to work on any Nintendo IP I would pick the Legend of Zelda series. Ocarina of Time and Wind Waker were my first impressions of Nintendo and was what made me a fan of their games till this day! As for the type of game I would like to work on, I would like to make something more aligned with their older Zelda games.\n\nEdgar: I would love to work on Zelda. Wind Waker and Twilight Princess were some of my favorite games growing up.\n\nLeona: I would choose Xenoblade Chronicles because I enjoy playing JRPGs and it was one of the games I played the most on the Wii.",
            "Simone: The monster moose/Wendageddon was inspired by Wendigo folklore, werewolves and of course, the Canadian moose. Prom Ghost was inspired by ghosts from Japanese horror like The Ring. The Worm Boss was inspired by Tremors and the Crittants were based on Gremlins.",
            "Thanks for the question! Answered in another reply: [https://www.reddit.com/r/NintendoSwitch/comments/1dl65pi/comment/l9nj4t1/](https://www.reddit.com/r/NintendoSwitch/comments/1dl65pi/comment/l9nj4t1/)",
            "Vanessa: Since Echo Generation has a lot going on story-wise, it’s challenging to choose what to highlight in the trailer. It’s a balance of trying to spark curiosity but at the same time not give too much away. Also, text dialog in a trailer format is harder to work with since it tends to slow down the pacing - which is tough because we want it to be high energy and exciting, especially for a launch trailer. That said, we found that some things like trying to get the humor of the game works well when we do a sequence like the ghost cat lady asking “Are you here to mourn for your pet?” followed by a combat shot of Doggo piling dirt on her.",
            "Vanessa: Great question. There’s actually a pretty big area close to the end of the game that did not make it into the final game because of time constraints so it definitely happens to us too! As for reworking sections of the game, there’s constant iterations happening throughout production but especially at the polish stage since everything is mapped out by then and we can dedicate time towards the areas that have the most impact.",
            "Thank you!",
            "Vicky: To answer the last part of your question, Red Dead Redemption 2 for the art direction - the realistic graphic is very carefully curated to create an emotional feeling for the North American wilderness. I’m very impressed by the nuance they managed to pull off in that. Disco Elysium for the smudgy, almost ethereal painterly graphic that's also incredibly detailed in places. It's very surreal and fits perfectly with the story. And finally, Journey for its minimalistic and yet impressive composition.",
            "Vicky: There are a lot of different kinds of considerations for choosing an aesthetic and color palette and a part of it is ensuring that the art style enhances the theme of the game. In the case of Echo Generation, the voxel style evokes a similar kind of charm and nostalgia that the 80s / 90s theme echoes. \n\nThe decision process is a combination of the initial idea and lots of trial and error. Most artistic processes go through a lot of iterations, and through that process many decisions are made that can sometimes change the initial vision quite drastically!",
            "Thanks for the kind words! We hope you have a chance to play it.",
            "Amazing! Wishing you all nothing but success",
            "Ooh the jackalope is a unique pet to include!\n\nLove Scooby Doo too so that’s good to hear :3",
            "Looking forward to seeing them in game 😁",
            "Oh yeah, I know Riverbond! Didn't know it was the same folks. Nice!",
            "Thanks for the replay,Will be buying It soon,gotta finish flynn son of crimson first!",
            "Interesting! It's amazing how long it takes start to finish for a project like this. Nice work",
            "That does sound like an ordeal!",
            "Well keep us achievement lovers in mind down the road, thanks for the response!",
            "Thanks for all your replies- interesting!",
            "In the middle of buying a house, but once things settle down, I very well may pick it up!",
            "Hi!",
            "Good luck with all of that!"
        ]
    },
    "The most recent direct wasn't leaked because Nintendo figured out Pyoro's gig": {
        "title": "The most recent direct wasn't leaked because Nintendo figured out Pyoro's gig",
        "score": 296,
        "url": "https://www.reddit.com/r/NintendoSwitch/comments/1dloigf/the_most_recent_direct_wasnt_leaked_because/",
        "content": "Pyoro was a major source of Switch leaks over the past few years. It seems like Nintendo finally caught up to him and didn't preload webpages for the new announcements for the direct. \n\n[https://www.bloomberg.com/news/newsletters/2024-06-21/rumors-go-dark-as-video-game-leakers-face-a-reckoning](https://www.bloomberg.com/news/newsletters/2024-06-21/rumors-go-dark-as-video-game-leakers-face-a-reckoning)\n\nAfter this fallout, Pyoro's twitter has gone private. [Pyoro said he didn't know he would be in bloomberg's report.](https://x.com/ethangach/status/1804211699861360693)\n\nSometimes I like leaks and sometimes I hate them, but I was so happy to have a direct that totally surprised me. ",
        "num_comments": 63,
        "comments": [
            "The funny thing is, someone else did leak Brothership and Echoes of Wisdom on Resetera but no one noticed lol",
            "Someone definitely said something about a LOZ game where you actually play as Zelda being in the works.\n\nI generally ignore leaks though because they aren't reliable and I can't handle disappointment.",
            "Good, those leaks took all the fun out of the Directs.",
            "Like always the biggest problem is the people without decency. You need to run a tight ship on the sheep. \n\nIf people wouldn't give clicks, views and follows to these leakers they would stop doing it.\n\nIf people wouldn't pay twice the price to scalpers they would stop doing it.\n\nAnd the list goes on...",
            "Both Pyoro and Midori could have walked away on top. Only took a day to ruin themselves.",
            "Thank goodness. Get those leakers out of here. They're worthless.",
            "Lol ruined his method for a little bit of clout. Hope they’re happy!",
            "The LoZ game was for sure leaked a month or so ago",
            "This is my most hated aspect of this new era of gaming,these damn useless people leaking everything, I vote for a complete ban from all social media for them",
            "I’m glad I did not see any leaks Mario and Luigi caught me off guard",
            "Good riddance, leakers are annoying af, especially Midori and that penguin.",
            "Yeah that mfker is getting a life sentence of infinite generational debt.",
            "Listen, whatever you think about leakers, “I want to be surprised” is a silly thing to complain about. \n\n If you don’t want to you could just… not engage with leaked content or pages where such contents is reposted and discussed?\n\nEdit: y’all make it sound like someone is pointing a gun at your head to use social media daily, like are we being real?",
            "Tee hee",
            "Do you have a link for the post regarding wisdom?",
            "Imo it doesn’t really count as a leak if no one takes it seriously. The next time this account predicts someone, people will definitely take it seriously though.",
            "Honestly that’s been a rumour for almost 30 years now, every time a new game is in the works. it was bound to happen eventually",
            "Edit: you’re right; there was a tweet about this spelling out “This Is a Hint” in May.\n\nhttps://www.nintendolife.com/news/2024/05/rumour-princess-zelda-may-take-the-starring-role-in-an-upcoming-game\n\nIt was also a huge part of speculation about ToTK and the devs answered questions about it in several interviews in recent years. See example from December 2023 here:\n\nhttps://www.nintendolife.com/news/2023/12/eiji-aonuma-comments-on-the-possibility-of-a-playable-zelda-in-the-future",
            "Remembers E3 when 95% of the content were leaked 1 week before. I like how Nintendo took him down I expected to get the first trailer of MP4, not later than the Switch 2 line up. Also getting surprised is a feeling, that I didn't have for a long time with a Nintendo Direct.",
            "Leakers are just lame in general. The only thing they get out of it is ego boost and the “I called it! I was right!” brownie points. Half the time something is “leaked”, it doesn’t come to light until months or more later or it’s entirely wrong and then they just backpedal on it lol. These leakers ain’t nothing fancy like some worship them for.",
            "I can't believe people pay these leakers on sites like patreon.",
            "Same happens with: E3 leaks and Playstation leaks, Samsung leaks, iPhone leaks etc etc \n\nThat's why IMO, companies stopped paying millions to get their games shown on a big stage since it was beeing leaked days or even weeks before",
            "I spose if one wasn’t obsessed with clout, one wouldn’t be a leaker in the first place",
            "Where?",
            "At least on Twitter the *almighty algorithm* just shoves things in your face sometimes, and you can't always stop yourself from reading before you realize what it is.",
            "If you’re active on social media, sometimes it’s hard to avoid these leaks even if you try.",
            ">I'm betting on a top down LoZ game starring Zelda and a new Mario and Luigi title... their Brothership is too iconic y'know\n\nhttps://www.resetera.com/threads/pyoro-leaks-switch-game-announcements-part-4.860007/page-23",
            "I think this is the definition of a leak. It wouldn't count as a rumor tho.",
            "That's not how it works haha, a leak is a leak regardless of people giving it attention or not.",
            "Mental gymnastics",
            "Weird take.",
            "Ah yes the leaks magistrate himself has spoken. NOTHING SHALL BE CONSIDERED A LEAK UNLESS TAKEN SERIOUSLY AND HE WILL BE THY JUDGE OF THY LEAK. \n\nI fucking hate the internet sometimes.",
            "If you follow the Persona community at all, the name Midori is one that popped up a lot over the last year. This was a Japanese woman who was seemingly an employee of SEGA. \n\nShe leaked a ton of information about various upcoming Sega products on twitter, and people started worshipping her. Genuinely they were obsessed, and treated her tweets like Gospel. She'd tweet something and it would spread like wildfire through the whole community. \n\nYeah, last week it got revealed that she was in fact not a Japanese woman, but in fact a dude/multiple dudes from America LARPing as a Japanese woman. There was an enormous meltdown over it.",
            "Facts. In the game Apex Legends the leakers developed a weird complex where they release their leaks in stupid riddles. No thanks, I'll just wait before I bother doing that, personally. But thanks to those who figure it out.",
            "PapaGenos tweeted about it in May.",
            "On Twitter  He posted a tweet saying there’s a LoZ game where you play as Zelda in the works  \n\n\nhttps://mynintendonews.com/2024/05/11/rumour-leaker-says-legend-of-zelda-game-starring-zelda-as-the-main-character-coming/\n\nAnd then a few days before the Direct a forum leaker posted about it and Mario and Luigi Brothership",
            "Why exactly is anyone even still using that site after Musk?",
            "It’s easy, stop giving Elon money. Solved.",
            "Sounds like an easy hurdle to get around, just delete all social media",
            "That's hilarious. Doesn't even look like anyone acknowledged the post at all. Playable Zelda has been rumoured for a while, but dropping Brothership into that comment was so sneaky.",
            "Hol up wat",
            "Ayo",
            "Yeah obviously it fits the dictionary definition. But it had zero impact, which is what I mean by it not really counting.",
            "I forgot how on-the-spectrum this sub is tbh. Was just trying to make conversation.",
            "It's gonna be ok dude. You'll make it through.",
            "Least surprising ending to that story I could imagine",
            "Yeah, screw the dictionary definition. It's YOUR definition that counts.",
            "Who cares? A leak is a leak. It does not need to have impact to “count”. Stop making pretend rules.",
            "Ok, so you're both wrong, stupid, neurodivergent-phobic. Great combo !",
            "Good lord why are people taking what I said so literally. I said \"it doesn't really count\", not \"it's not a leak\".",
            "Obviously it matters to nintendo. A leak that nobody sees is a win for them. I have no idea why people are getting so fired up about this.",
            "This has got to be some sort of record for the most internet rage generated by the most innocuous take.",
            "So, what does 'it doesn't really count as a leak' mean to you?",
            "Your own little definition makes absolutely zero sense.",
            "Hey, quick question, if a tree falls and nobody is around to hear it, does it still count as a tree falling?",
            "I don’t think anyone is angry here. Just incredibly dismissive because of how awful you are.",
            "I meant that there's a substantial difference between a leak that no one knew was a leak until after the announcement because it looked like any other random comment on the internet, and a leak that everyone believes because it comes from a trusted source with a history of being correct.\n\nNintendo only cares about the latter type, and the latter type is the only type that actually has any impact.",
            "Don't forget I'm also a doo-doo head.",
            "But it was still a leak, whether people chose to view it as one or not. You chose the words you used, not the rest of the on-the-spectrum (your words, not mine) sub-reddit who are calling you out.",
            "I stand by my original comment. It doesn't really count because it had no impact. Tree falling in the forest and all that."
        ]
    },
    "Have You Ever Loved a Game So Much You Stopped Playing it or Took a Break Because You Didn’t Want it to End?": {
        "title": "Have You Ever Loved a Game So Much You Stopped Playing it or Took a Break Because You Didn’t Want it to End?",
        "score": 641,
        "url": "https://www.reddit.com/r/NintendoSwitch/comments/1dl6io5/have_you_ever_loved_a_game_so_much_you_stopped/",
        "content": "I started playing Tavern Talk yesterday and only got about an hour in when I had to stop. I love it so much I never want the game to end! 😅 Have you ever slowed down or stopped Switch game bc you never wanted it to end? What game? 🎮 Hopefully I’m not the only person who does this…😅",
        "num_comments": 465,
        "comments": [
            "I’m really bad to get to the final area of a game, prep for the final boss or whatever and then never play it again. I’ve tried to figure out why I do this and I think it’s a combo of not wanting it to end and anxiety about the final fight.",
            "Maybe Breath of the Wild. Exploring the world was so incredible that I didn't want it to end. But for the most part I just play games until I'm bored and then finish the game and stop.",
            "I did it with Breath Of The Wild",
            "It's quite common phenomenon, honestly",
            "No. In my opinion, If the game is good enough to keep it's \"fun momentum\" all the way to the end of the game, then I must complete it. The need for emotional catharsis is too great. Postponing only reduces the impact. If the point of playing the game is to feel something, then you must allow yourself to feel.",
            "Persona 5",
            "TTYD did this to me.",
            "Disco Elysium right now. Made it to the island but can’t continue ",
            "I just play it twice.",
            "I've actually done that with several games where I got to the VERY end of the game and never went ahead and beat them despite putting tons of hours into them.\n\nI got to the end of Tales of Symphonia on the Gamecube and had put a ton of time into unlocking all kinds of things in the game and leveling up my characters through the arena at the end of the game and even powering up the special weapons that you can only power up through killing enemies with them. I was primed to beat the game and then just dropped it for a reason I will never know. Probably because I loved the game and subconsciously never wanted it to end, \n\nSame thing happened with Fire Emblem: Path of Radiance on GC. I was at the very end of the game. Ton of hours invested. Had worked hard to unlock many secrets and had put together an amazing team. Got to the very last battle. Never played the game again for some reason. Again, maybe I loved it so much I didn't want it to end?\n\nThose two are the examples that stand out the most but there are others.",
            "My daughter (who’s 20 now) refuses to finish Dragon Quest XI because she loved it so much. She’s right at the end but put it down.",
            "No I prefer to replay games I like instead.\nFor example my currently favorite Videogame I played through 18 times since I bought it in May 2022.",
            "I just did it for Unicorn Overlord.",
            "quite the opposite, if i’m enjoying a game that much i’m playing it until i hit the credits ",
            "Not a switch game, but I'm currently going through this with Baldur's Gate 3. I have 300 hours and I don't think I've even done half of act 3.",
            "I replayed games several times, but I cannot stop in the middle for long because I forget what I was doing. 😂",
            "Man, I had no idea this was such a common thing. I've been doing it for years. \n\nMost recently I did it with Links Awakening. I got to the final dungeon and stopped playing for over a year. I actually just went back and finished it this week.",
            "Red Dead Redemption 2",
            "Witcher 3",
            "Hollow knight. I’m at the end. Can beat it at any moment but for some reason choose not to. It’s too beautiful 😩",
            "Ori and the Will of the Wisps, and Metroid Dread",
            "Currently doing this with Ori and the Will of the Wisps! The Ori games are so beautiful and knowing there isn’t a third Ori game is really making me want to drag this story out for as long as I can :’)",
            "Twilight princess. Never finished it. Saved right before Ganon.",
            "Zelda Wind Waker",
            "Cyberpunk 2077. Have not done any of the endings.",
            "TLoZ BotW and TotK, but only took breaks, I finished both, was worth playing till the end but the breaks of a few weeks each were good either.",
            "I love Ori and the Will of the Wisps so much I did this. I may do this with Hollow Knight now that I've gotten the 1st ending.",
            "Not a Switch game, but I did this with Tactics Ogre for PS1 back in the day. It was *magical* to me.\n\nThe downside is I picked it up several years later and completely lost my place and party setup 😭",
            "All the time, when I get really into a game I also force myself to only play in very short slots so it doesn't end, with mixed results",
            "Totk....I think a lot of people do this",
            "Yes for a day or two. Viewfinder was like that most recently for me",
            "The Witcher 3",
            "Tears of the Kingdom, I’d rather 100% complete and collect all the stuff before finishing the main quest. Still haven’t finished cause I know how all Zelda’s end with a frozen screenshot and it returns you back to before the last battle wrapped up.",
            "I did it with both Beath of the Wild and Tears. Still on break from tears.",
            "Yes. I was so happy with another code that i left it for a cuple of days saved where you can say you're ready to leave before finally finishing it, the credits made the wait wothwhile with a great paper animated sequence and an amazing song that's still stuck in my head",
            "Dredge and Dave the Diver were like that for me",
            "I'm so happy to hear you're loving Tavern Talk! I was kind of on the fence about whether to get it and I appreciate the review",
            "Yes, and it's not cool because I tend to do it just before the final boss, so when I come back to it they kick my butt because I'm out of practice with the game. It's happened to me in Chrono Trigger and Superstar saga.\n\nOr there are other examples where I won't even come back to it without ever knowing how it ended.",
            "Octopath Traveler 2.\n\nGot to the part where everyone comes together and the game is like, \"Save Now\" and I was like, \"But I have so much left to do!\". Did a bunch more side quests and leveling but still haven't gone back to tackle the actual ending. It's probably been a year and a half.",
            "I regularly put games down I’m enjoying too much to delay gratification and then end up never picking them back up….\n\nStill haven’t finished BG3….",
            "Yes. Took me six years to finish BOTW even though it’s my favorite game ever made. Same thing is happening with tears now. Also super Mario Wonder.",
            "Never. If I don't want it to end yet I just keep playing or start a new game.\n\nI did however take my time with Mario Wonder and RPG. I knew they were short so I didn't play through them in a weekend. I did about an hour or two every other day and filled the gaps with Animal Crossing.",
            "Definitely Hollow Knight",
            "Yes.",
            "I do it with all ace attorney games. I'm always like \"damn it went by so fast! I should save the final case for later.\" I never do that though, beat that case immediately afterwards.",
            "I don’t do it because I don’t want it to end, but when a game is extremely good it will make me so happy/satisfied I can turn it off and feel good about what I experienced. This is how Super Mario Wonder is for me, short sessions that are just pure joy.",
            "Yes, and I still haven't finished Spiritfarer 😔",
            "I did that often with books, but I don't think it ever happened in games. I stop playing a lot of them but for other reasons.",
            "Not on switch, but I can't bring myself to finish Yakuza 7. I love that game with my soul.",
            "I did it with Hollow Knight",
            "I do it with most games, problem is I never pick them back up. \n\nCyberpunk? Finished every quest/side quest but never started the final one to finish it\n\nSkyrim? Played 100 hours without progressing the main story further than about 15 hours, never finished it\n\nElden Ring? Got to Malenia’s tree and stopped there – never actually fought her\n\nDoom Eternal? Literally saved before the final boss room to finish it another day then never opened it again\n\nCuphead? Got to the last area then “saved it for later”\n\nDivinity 2? Got halfway through act 3 then dropped it (moreso because the friend I was playing with’s laptop got fried). Thankfully I’ve made up for that by beating BG3 3 times (including an honor mode run!)\n\n6 legit fantastic games that I was heavily interested in at the time, but for some reason just never ended up finishing it off. I think partly it’s because I like having them hang in the background in case I’m ever bored and want to wrap one up – but at this point I probably won’t open them again. \n\nAwful habit, very hard to break",
            ">!Yes, Spiritfarer. I can’t cope with the thought of it ending so I know they’re there on the boat just hanging out until I can face it !<",
            "I do this with nearly every game I’ve ever played, I really enjoy games that have some sort of mission after the final ending that ties up loose threads Witcher 3 is perfect for this. I play the entire thing then just leave it hanging cause I can’t bring myself for it to be over. Ha",
            "This is the reason I've only beaten Super Mario RPG once despite playing through it at least a dozen times.",
            "I have done this with dozens of games. I frequently play games I love several times through and don't finish them. Final Fantasy IX is probably the biggest offender. I accidentally finished Mario Wonder, I didn't mean to!",
            "I got a month of gamepass to try some games i wanted to play and i got in like 20 minutes of tunic and uninstaled it because i wanted to support them directly",
            "for me its more like this: i want to do every sidequest and collectable before i finish a game i like but i eventually get bored by the repetetiveness and stop playing. it was like this with botw and totk",
            "The human brain remembers things better that are unfinished, rather than finished. I wonder if this has an effect on why this phenomena of nearly completing games happens",
            "Spirit Farer (still didn’t finish it)",
            "Did it recently with Tears of the Kingdom: played over 80 hours and did the wind dungeon and have about 44 shrines, 9 hearts, 26 light roots, and stopped for now cause I wanna finish Rebirth. I have one that's been since 2014 and that's Persona 4 on Vita. I finished Persona 5 vanilla and Royal with both over 250 hrs, and finished Strikers, and Shin Magami V also. So ya I should finish it and I also have Persona 3 Reload. \n\nI can't look up final bosses, I have to finish them the way I want during first playthrough cause I think it's just cheating unless I'm absolutely stuck.",
            "100% mine was Sea of Stars",
            "The God of War (2018).",
            "Oh yeah I’ve done this with games 😅",
            "Oh yes, A Short Hike",
            "TotK... Knowing it took Nintendo 5-6 yrs to get this game out, I knew the next time we see an open world Zelda will be around 2028 which is insane.\n\nI've beaten it but only completed like 60%. Still slow playing it now.",
            "Man, Breath Of The Wild really did that for me. I’d never had such a raw love of a game until then. Sure, I’d had amazing experiences before then, take dark souls, Skyrim, and other free-roams, along with my (now) personal favorite Hollow Knight, but BOTW took the cake. The exploration, the puzzles, it was all so… perfect. The visuals scratched that itch in my art-loving brain, the gameplay was fun, engaging, and sometimes difficult, and the character interactions were lively, and energetic (don’t mind the fact that they moan when they speak to you). I put off the ending for TWO YEARS and finally got to it, and… I was so disappointed. Everything up until then had been amazing. But the true “final boss” was just shoot a couple arrows with an otherwise unobtainable bow. Not to mention that the ganon you actually FIGHT was just an amalgamation of bosses you had already gone against… luckily, TOTK stepped up the boss game HARD. But yeah, that’s my story. thanks for reading :)",
            "Yes many times. On switch specifically BOTW and TOTK. Get to about 80ish hours and I'm leveled up, have the right weapons and have done every main story line except the final boss. So what did I do? I stopped playing the game for about a month or two cuz I just didn't want it to end. Yes there is still extra side quests after but when I beat those games I usually move on from them\n\nI also tend to do this with Persona games and other RPGs on my xbox",
            "Yes. Zelda. Skyrim. Witcher",
            "I call it ~~tears~~ edge of the kingdom for that reason. I know so many people edging that game, waking around with all stats and achievements, way overpowered to defeat Ganon 🥹",
            "Yeah I used to do that but now I also consider that there could one day be no tomorrow and there’s always something else waiting to be discovered",
            "There were 2.\nI played em on PlayStation, Doom 2016/Eternal, and Red Dead Redemption 2\n\nMainly Red Dead Redemption 2 that is probably the best game with the best story in yeaaars, way better than Last of Us 1 & 2.",
            "BOTW and TOTK because the exploration aspect of the game is far better than the actual campaign/story (or lack thereof)",
            "Both BotW and TotK.",
            "Not quite, if I love a game I'll blitz through it to the end-- however, if there is a sequel or spinoff then that gets postponed because then it'll *really* be over hahaha",
            "TOTK. Twice now.",
            "Yes TOTK! Now that I beaten the game. I haven’t played it since",
            "Fallout 3. I was having way too much fun just roaming around and exploring and never did finish the main story.",
            "For sure… BOTW and TOTK… still grinding the end gear loot int he latter… it’s been a year now 😂",
            "Monster Hunter Rise. I have about 300 hours into it and still have SO much more to go. I also have lots of other games in the backlog that I need to get to.",
            "Not on the switch, but Midnight Suns",
            "I stopped my second play-thru of Dragon Quest Monsters 3 at 45 hours just because I didn't want to burn out of the game. This came AFTER my first play-thru was 76 hours. \n\nI plan to start a new game again here in 6ish months after I start to miss it.",
            "My Breath of the Wild save is this lmao",
            "Played Dredge for an hour, realised I'm going to really enjoy it and haven't touched it again as I don't have time 😔",
            "Tears of the Kingdom. I spent hours just wandering around before I finally went and finished. I didn’t want it to end. Still wish Nintendo would put out DLC but I know it’s not happening. I loved Breath but Tears is my all-time favorite game.",
            "Persona 3 reload, over 100 hours and i still am craving for it to be more😭 I got like 2 more days left but I just dont want to see this story end",
            "I usually attribute this to burn out because I will play 20-25 hours of a game and then walk away. It’s true that I’m afraid of getting *too* sucked in because once it’s over it’s easy to feel a little empty inside. As an example BOTW, TTYD, other Zelda games from the past.",
            "That’s been at least 3 times now with Tears of the Kingdom. \n\nLuckily, the depths give me enough to explore that there’s always more to come back to.",
            "Tears of the Kingdom",
            "No; I'm a masochist. My favorite games I can't stop playing (literally nonstop) till I beat em and then I'm just sad and dejected that they're over. So then I go about scouring the earth for the next one. There's been 3 games like that for me so far on switch this year. The first was Oninaki. Then Demon Slayer the Hinokami Chronicles. Now it's Unicorn Overlord.",
            "persona 5 royal",
            "I’m doing this with Tears of the Kingdom currently. I’ve played over 140 hours but only completed 2 dungeons. \n\nI’m currently on the Gerudo quest and about ready to go into the dungeon but I stopped playing to resist temptation. \n\nQuite frankly it might be years until the next 3D Zelda, I’m going to milk TOTK as long as I can.",
            "Witcher 3 and Breath of the Wild come to mind.\n\nI 100% both of them and I took some breaks in between. I remember taking a break on botw before going to the final boss (had done most of the shrines and quests. And in Witcher I took a break after completing the main story and discovering all the points in the map, then came back for the expansions.\n\nAlso in Witcher 3, I've probably done  4+ playthroughs just to see how different choices and actions impact the story, to great success, always surprised when a random action fires a chain of events with massive implications in the story.",
            "Every game I ever bought is like that. \n\nExpect for The Last of us. That game was like a movie",
            "Breath of the wild! I'm still in the search of the 900 Korok seeds before I enter the castle and beat Ganon😂 I just don't want it to end",
            "I did it with the Witcher. I thought I was near the end and I didn't want to rush through the last few quests. So I went to Skellige, and did tons of side quests, visited loads of question marks etc. then I got bored and went away from the game for about six months.\n\nEventually I resumed it and said I might as well finish this off, there were actually a ton more quests to do, far longer than I actually expected. I got much more into the story and finished it all up, then went and played the two DLCs. It was well worth finishing off. I got the bad ending but misinterpreted the meaning of it, and didn't realise I'd made bad choices.",
            "no lol. thats dumb.",
            "I have with the Phoenix Wright Trilogy and Outer Wilds",
            "Rdr1",
            "Gris",
            "Phoenix Wright Trials and Tribulations and Professor Layton & the Unwound Future",
            "Put like 60 hours into ToTK, I have completed all 4 temples but each time I left the dungeon boss unbeaten and I'm hoping to return and finish the game during my summer break next week.\n\nIt's definitely connected to my ADHD and \"anxiety\" about single player story-based games. I love the game, love the series, but at times it hurts my brain to continue pushing through a game because it begins to feel like work. It's not pick up and play and occasionally Id start up in the middle of a temple and have no idea what to do. Where something like Balatro or Tetris doesn't have that slight barrier so I'm way more willing to pick it up at any given time. Single player games often occupy a different part of my brain and take a different mindset for me to sit down and play.",
            "No because if I love a game that much then I realise I actually want to finish it so I can’t start it over again.",
            "I recently got Case of the Golden Idol on Switch and couldn’t put it down. I’ve finished the main story but I’m saving the DLC for a rainy day.",
            "Me when I was a kid",
            "I do that all the time. There are several games I still haven't finished because they're my favorite.\n\n3 that I can remember right now are:\n\nZelda TotK\n\nUnsighted\n\nLittle King Story",
            "No, but I have wholeheartedly finished such games and then added them to my \"perennial\" list to come back and replay in \\~5 years time.  Just long enough for me to forget the details while remembering that I loved the game, so I can rediscover it all over again.",
            "This was me with Vanquish & Spec Ops back in the day.",
            "Dark souls 2 I know most people don't think it's nearly as good as the others but I loved the options for character builds and the pvp was awesome. I don't know how many characters I got to the last boss but I never finished it.",
            "Breath of the Wild/Tears of the Kingdom. Still haven’t finished TOTK 😭",
            "I have both breath of the wild and tears of the kingdom for switch both right at the end of the game and both I just can’t finish.",
            "Elden Ring. I got to the final battle and just don't want it to be over yet. I don't want the credits. I know I can go back and replay, but there's magic in that first encounter.",
            "Nope.",
            "I didnt played last missions of witcher 3 for months. Then i got the bad ending and reload the earliest save to change story enough so that i got a good ending. I was at the university and without any stress, those were great times...",
            "Every time I reach the end of replaying a Zelda game",
            "Mario Wonder I definitely limited my play sessions so it would last longer. Helped that I also had Spider-man 2 to jump between. \n\nI didnt use the online features at all until I had 100%, so once I beat the final final, I turned them on and played a bunch more. \n\nMario Wonder was so good",
            "I did with both BOTW and TOTK.",
            "Yes Tears of the Kingdom as I not waiting 4 years until the next game ffs.",
            "Tears of the Kingdom for me. I got to the final boss and decided I got there too fast. I felt like I was cheating myself out of the game by finishing so soon, so I went back to the surface to do more stuff, and by the time I felt like I had completed enough I had burned myself out.\n\nIt’s been months since I played and I feel like if I want to beat the game I’m going to have to start over. Idk what is wrong with me.",
            "Kind of the opposite for me. I stopped playing Mario Odyssey after New Donk City because I didn't think anything could top its finale and it felt like a great way to end my playthrough.",
            "This is me with games I absolutely love, like I did this with tears of the kingdom, unicorn overlord and Elden ring. Tears of the kingdom and Elden ring I'm at the final boss so not too bad LOL\n\nSometimes I take a break due to excessively playing one game and play something else for a bit to pallette cleanse but then I end up dropping the game entirely :')",
            "Assassin's Creed Syndicate (not on Switch), took some years but eventually I finished it.",
            "Yes … BotW and TotK got this treatment from me!",
            "The first time I remember doing this consciously was Super Mario Galaxy 2. Also did it with Tears of the Kingdom.",
            "Tears of the Kingdom. I’d jump back every few weeks and chip away at it. Finally beat it like 8 or 9 months later. Loved it.",
            "TTYD currently",
            "In even doing this with Xenoblade, it’s taken me 5 years to get to chapter 13 bcus I’m not ready for it to end even though Xenoblade 2 and 3 exist",
            "I've played the first couple discs of FF8 like two dozen times.. Never finished it",
            "It took me over 250 hours to complete BoTW the first time round, I couldn’t bring myself to initiate the final boss fight",
            "I have never finished Kingdom Hearts for that reason",
            "It’s not on Switch, but in Fallout New Vegas, I got to the point where I HAD to choose a side for the last half of the game, and I just stopped lol",
            "Im still on TOTK for the same reason ...",
            "I'm taking my sweet time with Pikmin 1-4. Maybe 5 will come around one day.",
            "I do this often and almost subconsciously. I actually think it’s something I should seek therapy for.",
            "undertale!",
            "Yes. I never finished Final Fantasy X. I’ve played the game 4 times now, but I never defeat the final boss. I quit just before because I know about the sad ending :(",
            "Absolutely. \n\nBOTW, TOTK, Metroid Dread, etc\n\nEven TV shows that I love, I'll often put off the final episode or two, even if I'm just rewatching a season.",
            "Tears of the Kingdom for me. Also Persona 4 Golden on the Vita. Both games I got close to the end, but didn't want it to end so I stopped.",
            "Definitely happens to a lot of people",
            "Yep, currently right before the final battles in TOTK for 7 months, Pokemon Violet for 4, and Horizon Forbidden West for 1 1/2 years. Can't get myself to finish them",
            "Not exactly slow down so much as stopping to look at every nook and cranny and find every little secret. I do not often 100% games. I generally find it tedious, but occasionally there's a game I want to dive deep into. For me, that game is Hollow Knight, and before it was Hollow Knight, it was Metroid Prime. The cool thing is, I've replayed those games so many times now. It's fun to slow down and enjoy a game to its fullest, but it's also fun to come back to a game you truly love to enjoy it all over again.",
            "It was never fully intentional, but subconsciously I think I never wanted Final Fantasy IX to end. Once every 1-3 years for nearly two decades, I'd start from scratch, rush through the first 3 discs, do most of the side-quests & mini-games, find most of the best items & equipment and... stop playing right before the end of the game, usually right before Memoria. I'd always tell myself I was just preparing for the end-game or that I wanted a small break (and sometimes I legitimately would get completely distracted by a new big game), but just never quite had the heart to end that adventure.  \n  \nI did finally do it back in 2017, though! And then again with the modern port like 4 years later.",
            "Xeno 3 for me. I know eventually new land and maps will stop. There will be no more colonies or characters to discover. I dont want this to end..",
            "I do this with TV Series. Still don’t know how Hannibal ends.",
            "Baldurs Gate 3.\n\nI reached Act 3. Saw the giant city. And was ready to play until 5 am. I'm glad I had some restraint, because there was a lot to take in. The carnival alone required all my brain power.",
            "Europa Universalis IV has no end",
            "My bro took the edging game literally..",
            "Not a switch game but Cyberpunk 2077, my first playthrough I stopped before the final mission, did just about everything else in the game though. Started a second character, but didn’t like the build as much so I haven’t gone back to it.",
            "Tears of the Kingdom, I am right there at the end but can't bring myself to go into that end sequence. Same thing happened with Torna the Xenoblade Chronicles 2 DLC. I know the ending I beat the main game years ago but I just can't bring myself to trigger it all.",
            "Totk",
            "No. If I like a game I just play it again after it's over.",
            "For me, this was Tears of the kingdom, on switch.\nOutside of Switch, this has been Cyberpunk 2077 Phantom Liberty, Persona 3 Reload, Baldurs Gate 3, Halo Infinite campaign, and God of War 2016, to name a few.\nI inadvertently do this quite often because I'm scared of losing the mystique of these wonderful worlds I've come to know and love.\nIt has hit hardest with these games in particular because I've played them all during the darkest parts of my life.",
            "I’ve played RDRD2 4 times now, first time all the way through.\n3 times I’ve stopped playing the moment Arthur got sick, cause fuck that, Arthur is one of my favorite video game characters to date.",
            "Legends Arceus; I was doing it on purpose cause I didn’t want the game to end but I lost my save file when my switch decided to brick randomly so I had to send it back for repair. After losing a box of shinies that I grinded before they nerfed Outbreaks, I haven’t really touched the game, outside of re-unlocking the second area /:",
            "I do that a lot. Get super into a game and then set it down and never go back. And can't go back because I don't remember what brilliant plan my past self had. Mamy Pokemon games and rpgs suffered this. I just picked up Monster Hunter Stories knowing I got deeply into Stories 2 for about 75% and stopped dead and probably can't pick it back up.\n\nI almost impulse bought Tavern Talk because I liked the style. But then I read a review saying your decisions don't matter so I was kinda sad. A visual novel with minigame aspect is still good but I thought it was advertised like the gameplay mattered and there was more branching story.",
            "I excitedly bought Baldur’s Gate 3 on launch day and put probably 40+ hours into it in the first five days. I never, ever do that. Especially since I have a family, young kids, a career, bills… I just can’t do that, so when it happens you know it’s special.\n\n  \nBut I dropped the game cold turkey in the middle of Act 2. Not because I got bored, but because the game was SO GOOD, I know the moment I finish it, it’ll land in my Top Three of All Time and I’m unlikely to find anything that compares for years and years.\n\n  \nSo I’m saving the back half for a rainy day.",
            "I put off cyber punk for a few weeks because I didn’t want it to end. I’m still putting off the phantom liberty dlc. A new dlc for cyberpunk just leaked out though so maybe it time to start phantom liberty.",
            "Breath of the wild and tears of the kingdom",
            "All the time....🫠",
            "Cyberpunk and the Witcher 3",
            "Persona 4: The Golden. And I can say that now that it's on switch lol\n\n\nI played it when it first came out on Vita. I was in my early 20s, only son living at home (younger brother had just shipped out to the military, older bro was never really close), so I was lonely,  and the characters were written so well that it felt like hanging out with friends. I was so sad when I had to finally say goodbye",
            "Still haven't finished Pokemon sword & shield because I was waiting for the right time to do the final battle",
            "You can replay it",
            "Not Switch but Baldur's Gate 3. Just thinking of the fact that I finished the game makes me a bit sad. ",
            "I feel like I'm subconsciously doinh this all the time recently, with TV series as well. One example for games eas probably Final Fanatasy XII where I just stopped playing for over half a year. I could've still done a lot of side content I believe before I eventually went in to kill the final boss",
            "Not on the first playthrough I always blast through those sorts of games and avoid spoilers where possible so I don't actually know when the end is.\n\nOn the second playthrough if I really enjoyed the game I will usually get to a point in the story where I can access everything I want to and then start looking at the finer details of the game like side content or even world exploring.",
            "BOTW… still haven’t finished it",
            "This was me for Zelda Tears of the Kingdom! \nI just didn’t want it to end. \nKept avoiding the last battle until I found all the shrines and collected all the hearts. I did a lot of the side quests before finishing it and seeing the ending. \nIt was glorious! \nI need to go back and replay it when they release the Master Version.",
            "All the fucking time!",
            "That's exactly what happened with Metroid Dread. I blasted through 90% of it but I didn't want it to be over. So I stopped. But I wish I would have finished, I'm really bad at picking up the late game combat now but I'm considering starting a second playthrough though just to play again.",
            "ToTK recently, I didn't stop at all, but I delayed it as much as possible doing side quests and collecting stuff until a point were it was nearly impossible to cross paths with plot points, that's when I started doing the Temples, pursuing the Tears etc. After that I replayed it in survival mode, going straight to Ganon with minimal equipment, both experiences were insane.",
            "Yeah lowkey",
            "Outer Wilds. I could feel the end of the mystery approaching and I couldn't bear it. I still consider it one of my top 5 favorites.",
            "This has been a chronic issue I’ve had since childhood. I hate that I do it cause I have a huge back log. But yeah it usually takes a sequel or a re release for me to go back and beat some games I loved but stepped away from. Kinda glad I’m not the only one lol.",
            "My first playthrough of Abzu I purposefully stopped because I wanted to do the second half under better conditions. Lovely little game.",
            "Final Fantasy IV. I couldn’t finish it for years because it meant too much to me when I was kid. About the only story that game me hope as a child growing up in a highly dysfunctional up family.",
            "Oh, all the time.",
            "Persona V lol I've been sitting on the final last hours for like a year now.",
            "I am playing Oninaki. It’s been a year since I bought it. I’m literally still at the part where you’re investigating a death cult. All I’m doing is grinding because I find it fun. My 2 spirits are now at rank 9 just from doing this. The death cult investigation is literally the story mission right after the first boss.",
            "Every RPG I’ve ever played that has the telegraphed final boss journey.",
            "I did it numerous time (since 2021) with CrossCode. I'm still at the big post game DLC. 😅",
            "Yeah some games I try not to play more than 2 or 3 hours at a time to spread it out a bit.",
            "I still need to beat the final boss in skyward sword. Only problem is I forgot how to play lol",
            "Yoshi's Island. Had to pace myself with that one.",
            "Assassin's creed 2 back in 09 - leading into 10. I simply did not want to leave venice for a seemingly railroaded path to the end of Ezio's story.\n\nThat changed obviously. Revelations was such a monotonus mess I couldn't wait for it to be over. But still Creed II will always hold a special place in my heart, no matter how much it was milked afterwards.",
            "Did it with Undertale",
            "Tears of the Kingdom did that for me at release…235+ hours later and Ganon still hadn’t been approached…",
            "In my first play through, I stopped playing Final Fantasy 9 multiple times when it felt like I was coming to the end. Such a rich story and timeless characters, I still think back on them fondly.",
            "I did this with Ni No Kuni Wrath of the white witch on my ps3. I stopped playing right before the white witch fight and never played it again. I have to beat it one of these days lol. Maybe I'll just play it again on my Switch.",
            "Pretty much all the games I play, lol. SMT V, Dark Souls, BOTW, TOTK, and even a lot of games I don’t have on Switch like Elden Ring, Oblivion, Kingdom Come Deliverance, and Fallout 3/NV/4. My brother’s the same way except he just tends to start a new playthrough of a game instead of stopping outright.",
            "Red dead 2, xcom 2, resident evil 4 remake, cyberpunk, Elden ring, and tekken 8",
            "Ghost of Tsushima and Read Dead Redemption 2",
            "If i take a break from a game i never play it again",
            "Moonlighter and Bloodborne",
            "I don't stop playing the game, but once I beat it I'll often walk away for a few years and then come back to 100% it after trying to forget as much as I can. That's what I did with Celeste, it was amazing for the game to feel fresh years later.",
            "Witcher 3",
            "I still haven’t finished Tears of the Kingdom, I’ve been killing those gleeoks left and right and have enough korok seeds and a proper weapon stash to go to endgame but I took a break in favor of the dlc that never came. I will get back and finish it one day though.",
            "I still haven't finished the blood and wine expansion for the witcher 3, I'm on the last section",
            "I feel the same for a lot of games",
            "Yes with Tears of the Kingdom!!",
            "I played Red Dead Redemption up until chapter 5. Never did chapter 6. Couldn’t do it. I knew what was coming.",
            "I wouldn’t say I stop or take a break, but I definitely pace myself and cherish the experience.",
            "Yeah that's why I don't finish good games pretty often",
            "Yes\n\nI haven't beat Zelda Breath of the Wild or Zelda Tears of the Kingdom. I have put over 100 hours into each of those games. But I stopped because I don't want it to end.\n\nSomeday I will go back and finish them.",
            "I still haven't completed Horizon Zero Dawn or Final Fantasy VII",
            "Yeah recently tears of the kingdom 🥺",
            "I feel I will never finish totk",
            "Tears of the Kingdom. I'll play it for a week or two and then take a month break. It's too good to complete all at once.",
            "Definately did it with ToTK…. I pre ordered it and I’m still not done… lol",
            "Was like that for me in breath of the wild and it’s starting to get to that point for totk 😂",
            "tears of the kingdom",
            "Yes. I dunno if it's adhd, but I can name a few. Right now it's Cyberpunk 2077 which I'm close to beating and Tears of the Kingdom. If I'm really invested in the story, it will be the only game I play until I beat it.",
            ">!It would be really funny for me to say Xenoblade 3 as stopping a moment is it's core theme lol.!<",
            "Yes. Zelda minish cap and Breath of the wild.",
            "botw and totk",
            "My wife still hasn’t beaten tears of the kingdom after getting it at release. It took her 2 years to beat breath of the wild.",
            "Definitely not on switch no. ZombiU though yeah. And breath of the wild. On wii u of course",
            "I remember doing this with Super Mario Galaxy 1 on the Wii. And now it's 2024.",
            "I wish I stopped doing this. I do this a lot for shows I like, idk why. I’ll binge up to like the last two episodes and then drop it all of a sudden 😭",
            "I still haven't finished Astral Chain despite only maybe 1 or 2 chapters left. It's been maybe 2 years 😭",
            "ToTK. About 380 hours in and I'm doing anything BUT finishing the game. \n\nHaven't played in a while now as I've only got 2 light roots and a few signposts left to do. I know if I do the boss fight I'll probably never pick it up again short of a 2nd play with mods on PC/emulation.",
            "Doing so right now with Unicorn Overlord.",
            "YES. Persona 5, I’m so close to beating it but keep putting it off bc I don’t want it to end",
            "I have a habit of obsessing over games and getting bored before I finish them because I play them too much at first. So with stardrw valley I’ve been taking a break after I played it every day for a week or so. I want to be able to enjoy it",
            "Zelda!",
            "Once and it was hollow knight. Truly amazing game",
            "Didn't play it on the Switch, but Persona 4 Golden. Eventually had to play it though...",
            "for me this is metroid dread",
            "BotW\nHonestly it's my first Zelda and my first game on Switch\n\nLove it so much, I re played it for 5 times",
            "TOTK. I stopped playing it for an entire year on purpose after w50 hours of exploration and playing so i wouldn't run through it so quickly after all of those years of waiting for the game. I just recently started playing it, and im REALLY glad i did that.\n\nPs I'm also still currently on the on version 1.1.2 of the game, so i can still use the multi-shot arrow duplication glitch if and when needed 😉",
            "Hello, allow me introduce you to Child Me, who restarted FFVI at Kefka’s Tower and FFIX at Memoria multiple times before ever beating them, solely because she was sad it was ending.\n\nTo this day I have to fight the urge to put a game down because it’s winding down and that makes me sad, because these days instead of restarting, I’ll just avoid it for so long I no longer remember how to play and then never beat it.",
            "Don't laugh at me but the reboot DmC was this game for me",
            "Rain world.",
            "PERSONA 5 ROYAL istg that game literally changed my life by how completely spectacular it is but Ive gotten a bit of the way through the >!Maruki Palace!< and I havent touched it in over 2 years. Which now that I say it 2 years is a really long time lmao, I should finish it (I wont)\n\nAlso more recently Tunic, got to the final boss and havent touched it for about a month",
            " Read Dead 2 for me",
            "Oblivion, Fallout NV, and breath of the wild. I ended up just flying around in breath of the wild listning to the ambient",
            "I have stopped playing games I like for various reasons  \nBut never because I didn't want it to end  \nThat doesn't make much sense to me personally, since if I stop early then it ends even before than it has to",
            "Ocarina of Time, 1998/99.",
            "Doing that with Octopath Traveler II.",
            "I never beat the original ff7 because it had too many minigames I could keep playing",
            "fire emblem three houses. there's 4 routes to play but they require you to restart the game almost from scratch and i didn't want to go through everything again, and the game doesn't let you continue playing once you win the final battle, so i definitely spent way too much time basically just talking to all the characters because i'd have to say goodbye to them once i enter the final fight",
            "Yep, usually ends with me never finishing it because I forgot how to play it.",
            "FFVIII and Breath of the Wild",
            "I haven't finished either BOTW or TOTK because I love running around doing nothing too much to start a NG",
            "Not a switch game but Fallout 4! It was my first Fallout game after finally buying my own console and I was just loving it so much. I got to the point where I needed to pick which faction to join and I just walked away and never finished it.",
            "I really don’t understand this. You don’t want it to end, but you stop playing it. It is equivalent with the difference that you don’t actually enjoy the whole game. \n\nIf you don’t want it to end, why don’t you play it again?\n\nI can understand what some here say about the stress of the final boss. For those I would encourage them to face that stress thinking that it is only a game. Nothing happens if you need more time to beat that last time boss, or even if you can’t beat it but you have tried. I wonder how this people behaves on real life adversities? Do they also avoid them? Or they don’t go out of their comfort zone? Games are perfect to get used to uncomfortable situations! Nothing to lose!",
            "BotW. Still haven't finished it and probably never will.\n\nThe same thing happened with TotK. As soon as I unlocked the final boss, I lost interest in playing as that would mean it was over. But I forced myself back in a few months later and completed it.",
            "I took a big break before finishing spiritfarer but I did go back to it. I do play a lot of games to 75-85% completion and drop them like hot potatoes, lol.",
            "I had to limit myself to hour-or-so play sessions while playing through most of Metroid Dread. I enjoyed the exploration so much and knew it wasn’t a terribly long game, so I tried to savor it as much as I could.",
            "Beath of the Wild and Tears of the Kingdom. Currently doing that with TOTK because I only have one of the four quests to do.",
            "I didn't do the final dungeon of Twilight Princess until I got the game again on the Wii U.",
            "Borderlands games. Partially because I get lost, partially because I just like messing around without completing story quests",
            "It doesn’t make sense. If you stop playing a game, you made it end SOONER.",
            "yes plants vs zombies battle for neighborville",
            "Sea of Stars for me. I definitely took my time with it. I haven’t enjoyed a game like it in a long time.",
            "It happened to me with Witcher 3. I don’t wanted  to progress in the main story line and went through bunch of different side quests which were also very entertaining.",
            "I do that and then never finish it",
            "Mega Man Legends\n\nBOTW / TOTK\n\nChrono Trigger\n\nShin Megami Tensei 5\n\nPokémon Gold\n\nNeir Automata",
            "Did it with BOTW in 2017 and currently doing it with TOTK in 2024.",
            "Tears of the Kingdom. I’m close to 100%ing all of the side stuff and only have the last main quest to do I haven’t played it in months bc I know when I return it’ll be over in a few plays sessions",
            "I did this with FFX. Watched the final battle and ending on YouTube lol.",
            "Currently going through this with the Thousand Year Door remake. I loved the game as a kid but right now I'm doing everything except for going to the final boss because I don't want it to end\n\nThat, and I spent actual weeks fighting the final boss when I was younger and I'm afraid I won't be prepared enough lol",
            "This happens to me because I don't particularly enjoy (most) boss fights. They're fine, they're just far down on my list of things I enjoy about video games. I'm motivated to complete boss fights throughout most of the game because I know I'll be rewarded with more of the game I'm enjoying, but the final boss fight doesn't really have that reward.",
            "Ohhh!! I never considered the anxiety piece but yes 100% for me too!",
            "I always feel like I need to do all the optional stuff because of fomo. Then I end up losing interest in it and never finishing. ",
            "I ALWAYS DO THAT",
            "I did this with Metroid Dread lol",
            "Man, I'm not only guilty of this but also passed it on to my son.",
            "I've been noticing myself doing this a lot these days too. Got near the end of Persona 5, haven't gone back yet. Pretty close to the final battle in Fire Emblem: Three Houses, still need to finish it. Same for the final area in Pikmin 4.",
            "   same behavior here dude. have had anxiety issues in the past too. Also don't want it to end. Probably going to be a common theme.\n\nEdit: I will say there's also something kinda melancholy about a game ending, and reading some other comments I do notice some of these games I'll youtube the ending at some point too. It certainly is nice getting through the ending with a whole community commenting on it below a video. So there's something to be said for experiencing it alone vs. with company I think.",
            "Yah. And then I wait so long that I forget how to play and have to re-learn everything if I ever want to complete the game.",
            "Ha, I have done that too",
            "I have a HUGE problem doing this. Once I started adapting that playstyle  (over 2 decades ago) I now play 90% of my gaming like that. \n\nBut in my case I don't think it's about anxiety.  I play games for the mechanics and gameplay. Not the story or the cutscenes. And I don't care about the \"sense of accomplishment\".\n\nSo I just say \"eh.  I played the whole game except this last fight?  I guess I experienced EVERYTHING (gameplay and mechanism), huh?... Alright cool. I don't need to strain my way through this part. I'm done\"\n\nThe exceptions are notable because the game itself is conducive to unique gameplay. Like Shadow of the Collosus.  Or the end boss is so fucking unique (in terms of the rest of the game) that I need to experience it, like Lavos (Chrono trigger) or Metal Gear (MGS).  Or I'm just having so much fun playing the game I didn't notice it ended until the credits rolled (the new Tomb Raider games)\n\nIt's a weird playstyle habit of mine.  But I'm OK w it.  Everyone enjoys video games in their own way.",
            "I put 180 hours into Totk and put it down. I have so many hearts and i believe I maxed stamina. I don’t see what else I could do to get stronger without diminishing returns.",
            "Did this with Dragon Quest 9 and Chrono Trigger when I was a kid. Flipping great games that I just put down right at the final boss and I don't know why. Same thing recently with Cuphead for some damn reason. I enjoyed the heck out of the rest of the game, got to the Dice man, and stopped. That will be easier to finish than the 40+ hour RPG, I just need to de-rust and readjust to the game feel, but I still feel so dumb for doing that.",
            "I've done it to a few games. I call it \"Ni no Kuni-ing it,\" because Ni no Kuni 1 was the first game I did it to that I remember it enough to be noteworthy.\n\n> I think it’s a combo of not wanting it to end and anxiety about the final fight.\n\nThis would definitely be a good explanation for me, especially for the example above. That game was awesome. The final dungeon was also brutal, so I probably had some anxiety about the final fight caused by it.",
            "I do this as well, but for me its mostly because I know I have seen everything the game has to offer if I'm at the end",
            "I've done with with Majora's Mask multiple times and still never beaten the game as a result",
            "LOL this is me! Actually it currently happens with TTYD, I'm in the final chapter and I'm just a few bosses & puzzles away from the final boss, but I'm just not as excited as when I was exploring and figuring out things. It also happened to some other games like The Origami King, TotK, and Mario Odyssey. That's why I prefer \"endless\" games like Animal Crossing or Stardew Valley.",
            "Lmao I did this with BOTW. To this day I have technically never done the final boss battle even after completing TOTK.",
            "I've done this, most recently with Breath of the Wild",
            "I hear you re the anxiety",
            "Haha! I have so many games like that. Usually longer games like ACNH or Spritfarer but now I’m trying to decide if I got bored or if it was a “love this so I won’t end it” thing.. 🤔",
            "Can't somebody please tell me for real a definitive and obviously subjective answer. Which is better to just go with if you have to pick one. I grabbed Tears or the Kingdom and am loving it. Should ibplay Bzoztzw first ot just keeo going with TOTK",
            "Ugh, I do that. My other toxic trait is I keep playing because it's fun as hell, until I hit a really tough point and end up \"taking a break\" and then not playing it again.",
            "I done this with Tears Of The Kingdom, but now i can't get myself to continue it and will most likely have to start a new save",
            "Literally me, did all the shrines, quests, beasts, memories, went to final Ganon duel, stood there, saved, and never finished the game😭 picked up ToTK launch day ftw",
            "I did it with both BotW and TotK... I only finished BotW when I was ready to start TotK. TotK is still waiting for me to get back to it....",
            "Aw! I haven’t even started that one because I feel like I’ll dedicate my whole life to it. 😅 No one will see me for the rest of the summer.",
            "This was literally what I came here to say. I have taken a break from BoTW (i’ve been postponing beating Ganon). Why? Idk really… I have an unopened ToTK waiting for me to open but here we are.",
            "Me too, then TOTK came out and I beat BOTW.\n\nNow I don't want to beat TOTK",
            "Same. I waited several weeks before entering hyrule castle.\nI knew that if I did, I would abandon the game.\nAnd I did.",
            "Same here",
            "This is the answer",
            "I’ve completed a great deal of what the game has to offer. Never once beaten Ganon or even gone to take him on. And I kind of prefer it that way.",
            "I played breath of the wild in 2020 when covid first happend and it kept me sane during lock downs and shit for months. \n\n  \nDidn't play again after until this year, re playing it before TOTK,",
            "I squeezed every drop out of that game before facing the final boss. Then started over in master mode. Then did the same with Tears of the Kingdom",
            "That’s really interesting. I started doing it as a kid with ocarina of time and I’ve almost done it with every game I’ve loved. I’d leave it knowing I could go back and finish it someday or play from the beginning with unfinished story. Most recently I did that to unicorn overlord and TOTK",
            "I don't want to finish FF7 rebirth cause it will make me sad that I don't have more of the world to explore",
            "I tend to do it for games I particularly enjoy, because I feel like I want to optimize my time spent experiencing it, and there's always some reason why \"now\" wouldn't deliver that optimal experience. Don't wanna play it now because I only have 30 minutes, and I don't wanna rush the experience. Don't wanna play it now because I've had a crappy day, and I don't want my bad mood to taint the experience. And so on and so forth.",
            "I get that!! I’m used to being hyperfocused on a new game and going with the joy whether it leads me all the way to completing the game or not. I guess that’s why I’m like “what am I doing rn?”",
            "I especially feel this with story games. I'm thinking of The Last of Us. When I hit the winter segment and realized how invested I was in the characters, I skipped all my classes to complete the game",
            "This is why I haven’t started the game yet despite buying it 2 years ago. I played Persona 3 and 4 during that time and didn’t want them to end. But part of it is also the length of these games. I’m waiting until I feel ready to jump into another 100+ hour epic",
            "I had TTYD on my GameCube and put a ton of hours into it and got to the very end. At the time, I was staying with my best friend living at their house. One time while I was out of the house, his little brother came into our shared room and started playing on my GameCube ( I didn't know he was doing this). He was only like 7-9 years old. He somehow deleted my save file. All my work gone. I never found the strength to begin again. I put soooooo much time into the game already 😫",
            "I’ve never played a Paper Mario. I’ll have to check that out. Not me adding more games I won’t want to finish to my wishlist. 😅",
            "I beat it and now I'm sad. I only have optional boss fights that don't interest me.\n\nI don't have every badge, star piece, recipe or tattle, but I don't care enough to do those. My partners are fully upgraded, I beat the 100 room trial challenge once. I had my comeback as Champion. No more troubles to solve.\n\nBut I want more. D:",
            "Oooh! I hadn’t heard of this game and just looked it up and added it to my wishlist!",
            "How is DE on Switch? I have it on Steam, but have never gotten around to playing it",
            "This is the way. \n\nIt really never crossed my mind to play a game again.",
            "Yeah! This! I’m thinking back to other games I didn’t finish and did I subconsciously just not want to let go? I think I only consciously lovingly put Tavern Talk down bc I know it’s a shorter game and didn’t want to finish it in one sitting. But now I’m like… Spiritfarer… I loved that game but once I felt like I was close to the end I put it down gently and never returned.",
            "I started into act 3 and put it down. Need to jump back in. Absolutely loved the game",
            "Relatable! 😊",
            "The only game that ever made me cry….. multiple times. Beautiful game and story.",
            "So you’re a furry?",
            "What is your favorite game if we can know",
            "I do this too. I've beaten Diablo 3 and Borderlands 3 a bunch of times for both games..",
            "Wait. Wut? 😧 I just realized I’ve never done that. I’ve gone in and out of games like Civ where the battles change every time. But never a game with a story. 🤯",
            "What's the game, we gotta know!",
            "I’m sorry, there exists a game called “Unicorn Overlord” and I haven’t heard about it? Looking that up rn!",
            "Oooh there is a demo!",
            "Yes! I’m usually like this! I’m like “throw some snacks at me from time to time. I’m in this until the end!” 😅",
            "I get it. My husband just finished it after sooooo many hours. And he replayed it with a totally different character type bc he wasnt ready to let go he said some things did change in the game. But he preferred his first play through ending.",
            "I’m so afraid of this. Not for Tavern Talk necessarily. But for other games.",
            "I genuinely thought this post was going to be be crickets. But no! A lot of us are doing this! 🤣🤣",
            "I get it! I feel this so much!",
            "I finished Blind Forrest but I just can’t bring myself to finish Will of the Wisps and I love these games",
            "Same here!",
            "Damn that's my favorite Zelda! The last boss fight is pretty cool, definitely set the precedent for the last 2 Ganon fights in the series imo (along with Wind Waker's). Hopefully we get the remaster so you can finally finish it",
            "I totally get this. I feel like I’m going to have to force myself to finish a game I love and it’s so weird!",
            "Wind waker was such an odd game. It felt kind of unfinished. The last act felt rushed. Was a shame",
            "I feel this.",
            "Ugh! I hate when I come back to a game but have completely lost my bearings! Not the same type of game, but I did that with Animal Crossing and had to start all over again. And if I ever decide to go back to ACNH, I’ll have to start all over again because it’s been too long. 😅",
            "I think this is the first time I have consciously stopped playing a game because I love it so much. I also haven’t usually gone into a game knowing its length. But I heard Tavern Talk is a shorter one so, yes, I want to manage my gameplay and spread out the dopamine. 😊",
            "You’re right! I’m seeing this now!",
            "I just looked up Viewfinder! I love puzzle games! And I do try to slow down on those! I can get hyperfocused, in the best way, on puzzle games!",
            "I lost my husband for a few months to that game. I get it.",
            "It sounds like a lot of people feel the same with these games. I haven’t even started them because I know I’ll be both playing it obsessively and not wanting it to end!",
            "I really enjoy it! If you like the Coffee Talk games, I think you’ll enjoy this one too! 🧝🏼‍♀️🍻",
            "Oh I just started OT2! I started as Throné and just met up with Osvald. I can see not wanting to let go of the team!",
            "This is what I’m afraid of doing!",
            "6 years! You do get it! I love it!",
            "Yeah. I’m going to use this approach for Tavern Talk. I have Palia going and just started Octopath Travellers.",
            "Haha! This is what I usually do!",
            "I love that. I need to check out Mario Wonder!",
            "Me neither! And now I feel like it will be so difficult to go back to. I was very close to the end I think.",
            "I slowed down on a book I was reading recently too! ☺️",
            "dude every time i watch some youtube videos of someone going into a restaurant or just walking some busy streets in japan i kept getting reminded of Y7. it sounds silly but in my head it feels like i actually spent a month vacation exploring kabukicho/yokohama and now every once in awhile i get reminded of it like some fond memory of a real trip lol\n\ni actually delayed finishing the main storyline as well, even tho there's post-game content i just knew once i'm done with the main story i'd put it down. loved every second of it",
            "Oh Skyrim! I don’t think I ever finished that. But I think I just got fatigued.",
            "Same! Still there waiting for me too!",
            "I hate when i accidentally finish a game. 😩",
            "That’s cool!",
            "Oh man! I do this too! 😅 I didn’t realize until I was reading this post. Haha!",
            "Oooh! I wonder! 🧠",
            "Me neither! I didn’t realize it at the time but I totally didn’t want that one to end. And it hasn’t!😅",
            "That’s the game that got me into this state! I accidentally finished it without realizing it in just one short sitting. I was so distraught. I would have done more side quests and exploration first. I will go back to it!",
            "lol. Judging by the comments below, it’s a good name for the game.",
            "I love that idea! Of playing the games again when you’ve forgotten them a bit. I’m going to give this approach a go!",
            "I also OCD'ed on Cozy Grove and as soon as I missed a couple days I couldn't go back.\nI couldn't do the newer AC because a friend was also playing and kept changing things or letting villagers I liked move out.",
            "I get this feeling like I don’t ever want to be in a position that I couldn’t go play TOTK if I want to.  Kind of trying to avoid the inevitable hole that beating breath of the wild gave me lol",
            "P5R doesn't really end for me. You can replay it with different choice (which, yes, don't change anything overall but still make the game feel differently). And if you need a new one play P4G. It's about the same, just in a rural setting but equally great.",
            "This is what I’m afraid of! 😅",
            "Try NieR Replicant. Gameplay is not as good as Automata, but the story is so good!",
            "Okay so this is def a phenomena you experience! Sometimes a game is just too good! 😊",
            "Yeah I can’t even touch ToTk because I love it too much to start.😅",
            "Aw yeah! I haven’t even purchased that game because I know I will never want it to end. 😅",
            "I’ve done this with basically every big game of the Switch era that isn’t Mario or Zelda. Got to the end of so many games, then YouTubed the ending and that was good enough.",
            "That was me and Metroid Dread. Watched the final boss fight, said \"Nope, that's gonna put me in a psych ward.\"",
            "Did exactly this with borderlands TPS, i want to finish it but need to do so much more grinding and I’m never in the mood for it",
            "Same! I’ve put in over 200 hours across multiple saves and have yet to complete the game in any of those pkaythroughs",
            "I’ve gotten to the end of several Final Fantasy games and have never finished a single one for the same reason. And I think it’s partially that my interest in playing a game can only last so long and big RPGs take a long time and often have some ridiculously hard or time consuming side quests at the end, but I like to 100% games, so my will runs out before I’m done.",
            "That’s so funny. Same with me. Same game. I got burned out and never finished it so I watched the final battle and ending on YouTube.",
            "I got to the end boss of FFX and went back played through the entire thing all over again before finishing it back in the day. Some games are so impactful you don’t mind experiencing them twice over the first time around",
            "Playing the same game right now and have the same feelings. I didn’t know this was a “thing” for people other than me tbh. 😂",
            "I feel like early RPGs taught us final boss fights are horrendous.",
            "Same here! And I’m a die hard Metroid fan!",
            "The weird thing is that I didn’t really do it back in the day; it’s a recent development in like the past 10-15 years.",
            "I done the demo for Spiritfarer and loved it. It recently went on sale so I purchased it, briefly played it the other day but have since abandoned it for Cult of the Lamb",
            "My subjective opinion is that it's worth playing both, in the released order BOTW -> TOTK. There's really no story spoilers to worry about because that's not really the focus of the games. But you only get one \"first exploration\" of the surface world and I really enjoyed the zen, natural feeling of BOTW. The climbing. The strategic gliding. Seeing wild horses and sneaking up to catch them. Crossing bodies of water strategically. The traversal is really enjoyable in BOTW. Challenging enough to be engaging but peaceful enough to be relaxing.\n\nTOTK exploration is enjoyable too but it's a different feeling. I did a lot more vehicle building and sky island diving. \n\nMy recommendation is explore BOTW, then play TOTK and focus on sky islands and depth exploration.\n\nCan't really go wrong though. Both games are phenomenal. BOTW is my favorite game of all time.",
            "Both are phenomenal games but the first playthrough of BotW is just magic",
            "Same here, I haven't played it in months and now I'm like a noob",
            "I stopped  playing after the great sky island tutorial and a bit of roaming. I felt so overwhelmed for some reason...like I knew this was going to be a 1000+ hours game. I should probably give it another try soon :P \n\nNever had that problem with botw...",
            "I did this but got really far, just have the spirit temple left to do. The problem is I never want to go back and do a temple so I usually just end up wandering around hoping to find the shrines I missed but there's so few left I end up turning it off lmao.",
            "I haven’t in like 3 weeks I better get on it",
            "Never have I felt more visible. Wanted to drag it out, then spent too long away and now have no idea how to play the game",
            "I loved Tears of the Kingdom. I loved it even more playing through again after a year.\n\nThe second time around it felt a lot less overwhelming knowing what to expect. I rode my horse from stable to stable just helping Penn, escorting Koroks, helping Addison, exploring caves and anything interesting.",
            "Samesies for both. I was really expecting a DLC so I could jump back into the game when it was released. Then it wasn’t. It’s summer break for me, once I get my sad, dead, release day switch back from Nintendo, TOTK is what I’m going to do!",
            "Did this with TOTK yeah. Played it almost day after work for at least a little bit. Loved it so much. Got all the shrines, all the lightroots, did almost all quests. Felt like it was just time, but legit missed the game after it was done. Hell I still do sometimes, but don’t know if I want to invest all that time again for Round 2. It’ll never be the same as Round 1.",
            "Nah just go back to grinding!",
            "Same exact problem, won't even try BOTW because I know I'll get sucked in.",
            "Once I saw TOTK announcement, I quit playing BOW and returned to it only after TOTK release.",
            "Once I saw TOTK announcement, I quit playing BOW and returned to it only after TOTK release.",
            "Are you me?!",
            "I entered the castle and looted but avoided approaching Ganon… I think the time has come to complete it for me.",
            "That was gonna be my answer too",
            "My brother did this to me growing up with Super Mario 64…so many stars…poofed",
            "Nooooo! I think it’s time to revisit game. I never played it on GameCube. It’s been so fun!",
            "Extremely well. The loading times used to be crazy but a recent-ish patch sped them up to like 3-4 seconds instead of 20+",
            "It has to be the only reason or else why would we never finish games we loved? Interesting to think about. I really need to finish some of these games because I still think about them to this day lol.",
            "I am a bit uncertan about the term but I certantly do like anthropomothic animal characters.",
            "My favorite Videogame is \"Fuga Melodies of Steel\".\n\nIts a 20 houer long turn based JRPG about a groupe of anthropomothic animal children that go on a quest to save there families. They live inside a giant ancient mysterious powerful fortress like Tank. Its a bit like Howls Moving castle but based on technology instead of magic.\n\nIf you are interested in trying it out: It has a free demo which is just straight up the first 3 chapters of the game.",
            "I personaly enjoy replaying games becuse on subsequent playthroughs I know better how to play the game well and sometimes characters grow on me more and more over time.",
            "\"Fuga Melodies of Steel\"\n\nIts a 20 houer long turn based JRPG about a groupe of anthropomothic animal children that go on a quest to save there families. They live inside a giant ancient mysterious powerful fortress like Tank. Its a bit like Howls Moving castle but based on technology instead of magic. \n\nShould someone be interested in trying Fuga out: \n\nIts available on PC and most modern consoles like Switch, PS4, PS5 and so on.\n\nFuga has a free demo which is just straight up the first 3 chapters of the game. I highly recommend that demo.\n\nIt has a direct sequel: \"Fuga Melodies of Steel 2\" which released in May 2023. I played through that ine 8 times so far. But I advice against playing the second game before the first game unless you do not care about the story and characters.",
            "The game is excellent. I swear the name is why it wasn’t an instant hit.",
            "Physical copy has been on sale lately if you get lucky. I just got it. I love the style. I wanted physical cos my card is getting full and I figured it was a big game.",
            "I have two playthrough's that are basically at the beginning of act 3 and one with the aforementioned maybe halfway.\n\nDame Aylin's reveal hits so hard every time lol.",
            "Different motivation but same outcome: played Metroid prime remastered a few weeks ago. I died 2 frames before the Endboss went down. Did not go for it again because the was a jumping passage with respawning enemies.\n\nIt was not hard but annoying AF. Could not bring myself to do it again.",
            "I thought Animal Crossing was a really easy game to get back to.",
            "Oh yeah especially when I know it'll be a short game, I really restrict how much I play daily!",
            "Yes this is a great one! I finished it after about 3 days but towards the end I didn’t want it to end yet so I had to slow myself down. \n\nAlso check out Superliminal if you haven’t already.",
            "I’ve kinda learned to live with it - if it brings me joy in the moment and I start losing it, that’s ok; there are always more games to play. And if I come back to it and it’s been a long time….oh no guess I have to start over again 🙃 there are a couple games I’ve played the first like half multiple times because I keep stopping before the end 😆",
            "cant possibly enter the final bossfight without a full inventory. ganondorf will understand",
            "Yes. I did beat all of these games, some several times (Currently running through SMT5V) and they still hit just as hard. Chrono Trigger I've done almost 5 times.",
            "My thought was, “Yeah, my old ass hands just can’t do stuff like that anymore. I’ll pass.” And I loved the game and am I die-hard fan of the series. But I noped out on that.",
            ">!Raven Beak!< Procrastinators Gang Unite!",
            "I love FF, played since SNES days. That said 15 was the first one I actually beat lol",
            "Same, I think? I don't remember doing it when I was younger, but it started, to my recollection, 25ish years ago with Final Fantasy 7.",
            "Oh I love Spiritfarer but could not get into Cult of the Lamb. I have to go back and try it again.",
            "If you could only buy one?",
            "Same",
            "I did the final boss on TotK after not playing at all for months and basically forgot all the controls. However, it turn out 300+ hours of gameplay gets you really OP and I managed to beat the boss first.",
            "Feel just like you. It is such an open space that it is overwhelming and I get distracted a lot when trying to reach a place on the map. I just started again on the same save file, but I can only go for some minutes before I leave it, as I can't remember where I'm at. I'm thinking of starting all over.",
            "Same sort of. I got like 75% of the way through and got distracted. I think by baldurs gate, which I played through half of act 2 and got distracted. Seems like a pattern.\n\nI only just recently finished Elden Ring since the DLC was coming out. Started NG+, so who knows when I’ll actually get to play the dlc. I’ve been distracted by slay the spire",
            "Unless you're exploring literally everything... its like 40-60 hours lol",
            "I finished the game and did all of the shrines, I still turn it on to wander around the world, I find it really peaceful. \n\nSometimes I find caves I never noticed before, or random NPC interactions I missed. This and just swinging around in Spider-Man 2 are my favorite things to play when I just want to wind down for the day",
            "Right? Sometimes you just know and have to make the responsible decision.",
            "That's so strange to me.. you won't play something because you'll enjoy it too much... So you play games that aren't as good?",
            "OMG please tell me why I bought BOTW at the end of the Wii U's life and then never played it. And then I got it again on my Switch when the Switch released, then never played that version either. And I played EVERY Zelda growing up and beat them all, but I have never played BOTW despite owning it twice on two different consoles!",
            "These situations qualify as video game crimes against humanity",
            "Star Fox 64. I had spent so much time on that game and was one medal away from unlocking the jetpack mode on multiplayer. Countless hours practicing to get perfect runs. I was SO close to getting the score I needed for that last medal. \n\nMy little sister was playing and wanted to know the date for some weird reason. So she clocked on \"Date\". The game asked her, \"Do you really want to know the date?\" And she said yes.\n\nData. That menu item was Data.",
            "Yes you are right - Now that the Switch version is out, its definitely time to actually finish TTYD this time around! No best friend's little brothers to ruin things for me",
            "Absolutely! Time to revisit our friends… and enemies!",
            "I love that! You’ve sold me on replaying games! Thanks!",
            "Oh wow, I've never even heard of this before, but it sounds right up my alley. Definitely downloading this demo now. \n\nThanks for sharing!",
            "You do different play throughs at the same time? Thats cool!",
            "Ahhhh!! I hate that. It’s just as bad as a too-easy final boss battle. I need to work for it, but also don’t make it impossible.",
            "It should be, but I have a terrible memory and just felt so discombobulated.",
            "I have accidentally played a game in one go and felt so distraught when I didn’t see it coming to an end. So I want to be careful with this one bc it’s so cute and comforting.",
            "Thanks for the rec! I will check that out too!",
            "I’ve never replayed a game with a storyline but someone else mentioned they do the same and it low key blew my mind. I had the feeling like “well I already know what’s going to happen,” but I reread books and rewatch TV. I’m going to replay some games!",
            "I played Cult of the Lamb for hours for a few days, then I just stopped lol. I really enjoy it though and will revisit it soon. But I have just started Disney dreamlight valley which I purchased on sale",
            "I loved spiritfarer and now love cult of the lamb. They aren't alike, but give it another go!",
            "If you could buy only one, I would personally recommend BOTW. You can't really go wrong though, if you already bought TOTK you will love that too. Others might even recommend TOTK over BOTW. \n\nYou asked for subjective opinions though, my personal experience was that BOTW is like a 9.9/10 and TOTK is like a 9.6/10. Both incredible games. Wish I could forget I played them and play them again haha",
            "I haven’t played either and got a Switch for Xmas last year.  My friend keeps egging me on to get one of them but I can never remember which one is recommended to get.  From what I remember him telling me they are basically the same game",
            "Exactly the same",
            "I'd say that I decided to finish it (main quest) just to stop (or most probably pause) playing it. But as many said, 70% that I'll launch a new save instead of continuing, just to accommodate when coming back.",
            "Ah good point and allow to add my reasoning. While I love gaming, I want to spend my time doing so many things. For myself, I know a game like this is tough to put down. I now tend to focus on games I can learn in a few hours of playing, then can pick up and play for 20-30 minutes without having to remember/keep track of much in terms of progressing through the game. Maybe one day the timing will feel right for BOTW.",
            "ADHD moment",
            "I mean, only you can tell us why you did that... Why not just play it",
            "Damn kids! I hope you have fun!!!",
            "Can you tell me your first impresion after you cleared chapter 1? \n\nThose first impresions can be fun.",
            "For RPG's I often do multi playthrough's at once. I'm impatient and like to see all aspects of choices in the moment and paths that result. I'm also a completionist. BG3 is a bit of a nightmare for someone like that lol.",
            "The boss was not the problem. It was that freaking jumping passage with respawning Metroids. I like to work for a boss to a certain degree.",
            "The exact same thing happened to me, I got a game before spring break once and was really excited to play it but then I cleared the whole thing halfway through break because I played nonstop and I couldn't afford a other game for at least another month or so and it traumatized me",
            "Cult of the Lamb had me hard focused on building up the actual cult in the beginning…didn’t start digging into the dungeons until my cult was basically completed",
            "I saw that you went back to Spiritfarer after a long break and you motivated me to do that same. And I will give Cult of the Lambs another go. Thanks! ☺️",
            "Thank you",
            "They're both great, but I liked TOTK more and definitely got more hooked on it. \n\nBut if you play TOTK first, I could see it being difficult to fully enjoy BOTW if you want to play it after.\n\nSo I'd recommend BOTW first and then TOTK if you can.",
            "People say both I only have totk but I heard they both good",
            "Obviously, only I know why I make my own decisions. Thanks.",
            "I will definitely update this comment once I've cleared it. Not sure I'll be able to get to it tonight, but it's definitely next on my queue.",
            "Yes! Exactly.",
            "Yeah it can be easy to do that, it's all about balance!",
            "Have fun crying for spiritfarer! 😅 My favourite game that makes me ugly cry haha. They are both great games. I am not far in cult of the lamb but I am enjoying it.",
            "Yeah. I cried after playing A Short Hike. I know Spiritfarer is going to have me in my big feels at the end. (Which is probably why I’m avoiding it.)"
        ]
    },
    "Nintendo on Twitter: Which Nintendo Switch games are you looking forward to the most? #NintendoDirect": {
        "title": "Nintendo on Twitter: Which Nintendo Switch games are you looking forward to the most? #NintendoDirect",
        "score": 450,
        "url": "https://twitter.com/NintendoEurope/status/1804167395403083961",
        "content": "",
        "num_comments": 253,
        "comments": [
            "I haven’t played a Mario & Luigi game since partners in time. I’m exited to play a new one. I’m sure I missed a lot in between then and now though.",
            "A lot of them really:\n\n**Mario & Luigi: Brothership:** Mario RPGs are back in full force and I can't be more happy. I have been waiting more than a decade (Because Paper Jam sucked) for a truly new Mario & Luigi.\n\n**The Legend of Zelda: Echoes of Wisdom:** 2D Zelda finally comes back eleven years after ALBW with a twist that makes it as creative as TOTK is. Can't wait to try it out and see how I solve some of those puzzles in the most absurd ways.\n\n- **Dragon Quest III: HD-2D Remake:** It's... it's beautiful. Also more information that has came out hinted at new story beats, new classes and even physical skills being added. And then they drop the bombshell of 1 and 2 also getting remade. Day 1 Purchase.\n\n**Super Mario Party Jamboree:** Finally a game that feels like a true sequel to MP1-8. Super Mario Party was so underwhelming while Superstars had amazing gameplay but lacked in new content. This has both and I can't wait to make new frenemies that want to punch me thanks to this game.\n\n**Ace Attorney Investigations Collection:** Beyond hyped to finally get AAI2 localized, because that game is such a masterpiece and the new HD sprites look so amazing and smooth. This got my biggest scream out of the Direct.\n\n**Donkey Kong Country Returns HD:** It feels dissapointing to get yet another release of this game instead of a new DK... but then I realized that for Returns we have either a jaggy SD version with wiimote waggle to roll at 60 fps, or a portable version that looks way worse at 30 fps but uses buttons and has new levels. Now we have the best of both worlds, the Definitive version. Excited to replay Returns more often now thanks to this.\n\n**Metroid Prime 4 Beyond:** After 7 years of waiting... it's finally here. The hypest part of the trailer was that forest area shown at the very end. I'm so eager to explore it. Maybe I should replay 2 and 3 before it comes out (Welp, it's time to dust off the Trilogy disc and get AA Batteries for the Wiimote).\n\nAlso I'm not really a Fighting game fan but the **Marvel vs Capcom games** (Especially MvC2) getting re-released is such a huge deal, no one thought I'd ever happen again.\n\nWhat a banger of a Direct. Both my time and money are going bankrupt from September and onwards T_T",
            "Donkey Kong wii and zelda and METROID PRIME 4",
            "Metroid Prime 4 and Dragon Quest 3 HD2D",
            "mp4 and capcom fighting collection",
            "I love Mario Party so I'm hyped to play Super Mario Party Jamboree the most\n\nHowever the biggest announcement for me by far was the Marvel vs. Capcom Fighting Collection. If you haven't been following this series closely you probably don't realize how big of a deal this is. The MVC series basically just went from \"This series is dead forever, it is what it is\" to \"Holy shit MVC4 might actually happen\" in seconds. MVC2 getting re-released is also a huge deal since it hasn't been purchasable in 10+ years and is going to revive the community in a notable way.",
            "The Ace Attorney Investigations ports!!  I played the original trilogy and havent started the other games in the series yet, so this is great timing!  \n\nAlso Mario & Luigi!",
            "Echoes of Wisdom\n\nJamboree \n\nBrothership",
            "Metroid Prime 4  \nZelda\n\nNot sure why Illusion Island is in that image because it's a small free DLC coming out, but I'll be playing the DLC.\n\nI'll also be playing Lego Horizon, but on PS5.",
            "Dragon Quest 1-3 HD-2D",
            "Professor Layton gang wya???",
            "Outside of the obvious, MiO looks like it could fill the Ori shaped hole in my heart.",
            "Marvel vs Capcom collection. The fighting community is going nuts over it.",
            "Dragon quest just has a vibe that hooks the crap out of me. I can't wait to re experience 3 with the hd graphics and updated music.",
            "From first-party, absolutely Mario & Luigi and Metroid Prime 4. Both look superb and Prime 4 is finally tying up loose ends I've been waiting for them to resolve for like almost 2 decades\n\nThird-party showing was really good this time. The Dragon Quest III remake looks sick, Mistwalker coming back to console gives me a lot of hope they also give the remaster treatment to both Lost Odyssey and Last Story, Metal Slug tower defense looks really cool, and obviously Marvel vs. Capcom rising from the ashes and more importantly, restoring the prominence of the X-Men over the series as a whole overnight was probably the big announcement of the entire show for me. Seriously cannot wait to play stuff like X-Men vs. Street Fighter and MvC2 online",
            "These predictions look like a stretch. they can’t possibly show metroid prime 4 or a new M&L game in the upcoming 6/18 direct That sounds too good to be true",
            "Marvel vs Capcom Fighting Collection is a day one purchase for me simply for Marvel vs Capcom 2 alone. The rest of that collection is just a cherry on top. The Dragon Quest remakes are also high up on my list. And Zelda. Because her job is tables…",
            "CAPCOM PRESENTS ",
            "MvC2",
            "Mario&Luigi, Zelda, and fantasy life(it comes out in October but wasn’t in the direct), CvM collection, and Epic Mickey(also wasn’t in the direct)",
            "HELLO KITTY ISLAND ADVENTURE?! on switch ?!",
            "The top 3 are at the top for a reason.",
            "Marvel vs Capcom collection unquestionably",
            "Metroid Prime 4, DQ3 and a surprise sequel to one of my all time favorite games, Phantom Brave!",
            "Zelduh",
            "Brothership",
            "Sorry, Nintendo...if it wasn't for the MvC collection, I'd say Prime 4 hands down. But since Prime isn't coming out until next year, I gotta give this one to Capcom",
            "Zelda: Echoes of Wisdom and Ace Attorney Investigations. I’m not too concerned if my wishlist’s a bit light tbh.",
            "AAI collection",
            "LoZ Echoes of Wisdom is a day one buy for me easily!!! Pretty excited for Mario Party and Donkey Kong as well!",
            "Low key I’m psyched for the basketball update on Switch Spots.",
            "Outside of basically all the first party games, I’m *very* interested in Fantasian and Mio.",
            "Everyone seems to be talking crap about it, but I am looking forward to the \"World Championship NES Edition.\"  I am a sucker for mini games and this looks like fun.",
            "IMO, MIO is the most interesting thing from the direct. Like of course I am going to play metroid prime 4 but MIO is the only one that got me interested for real.",
            "mp4 and capcom fighting collection",
            "Any of these couch co-op?",
            "Mario & Luigi Brothership, Metroid Prime 4, Zelda Echoes of Wisdom, Super Mario Party Jamboree and Dragon Quest 3 Remake",
            "Mario and Luigi",
            "This probably won't surprise anyone, but:\n\nMario and Luigi Brothership\n\nThe Legend Of Zelda: Echoes Of Wisdom\n\nMetroid Prime 4 : Beyond",
            "Echoes of Wisdom and Investigations 2 mostly.\n\nI'm gonna wait for reviews to tell me how a Mario & Luigi game without Alphadream will feel like. I imagine it can't be any worse than Paper Jam, but still. I'm skeptical. New artstyle's nice though.\n\nI still haven't played the Metroid Prime games - I love the 2D games though. If Prime 4 doesn't need you to play 2 and 3, maybe I'll jump in there, maybe it'll be Prime 1.\n\nThe Phantom Brave trailer got me curious about the first game, and apparently that one also involved possessing stuff as a main mechanic, so maybe I'll try that out. That's a neat concept for a SRPG.\n\nI know of SaGa, but never played one. Revenge of the Seven's got some nice presentation values and the original RS2's apparently one of the better ones, so I might give that a shot.\n\nAnd Lego Horizons is neat. I like it when the Lego games go the extra mile to fully do the environments in bricks instead of more typical 3D. Makes everything look more cohesive.",
            "Where are the megaman games :( i need a net battle network",
            "I’ve never played a Prime game before but the hype is certainly intriguing. I know that it isn’t simply a FPS but what other big game would you guys say the Prime series most directly feels like?",
            "Trails through daybreak, the hades tmnt game(both coming out best month) and the 3 dragon quest games(though I would be much more excited if they were 3d remakes in the vain of dq11 like how dq7 remake was on 3ds) I'm also somewhat interested in fantasia or whatever that apple arcade rpg with new voice acting is.",
            "that Mio game looks really cool honestly, I haven’t seen anyone talk about it",
            "F-Zero!\n\n&#x200B;\n\noh wait..",
            "Denpa Men baby 🔥🔥🔥",
            "Fantasy life - the girl who steals time",
            "Pokemon Legends: Z-A",
            "Zelda/Mario & Luigi/Dragon Quest/Ace Attorney/Romancing Saga/The Hundred Line/Fantasian & Farmaglia",
            "Zelda and Metroid, it was a good direct but nothing outside of those two has convinced me yet.",
            "Silksong cancelled confirmed.",
            "Lego Horizon",
            "Honestly, a new Animal Crossing game. Still waiting though.",
            "Was looking forward to Luigis Mansion 2 to play co-op with my wife but we're not paying like 60 euro for a remake.",
            "Among us is already on switch why’s it on the list?",
            "Zelda\nDKC\nMario Party - hoping gameplay is similar to Super Mario Party…",
            "Metroid Prime, and Zelda.",
            "Jamboree, finally some fresh content to play couch with casuals.",
            "Zelda and Ace Attorney are my top.\n\nInterested in Mario Party, Strat, and Hello Kitty. Heard so many great things about the Hello Kitty game so I’m excited for it. Farmagia could be fun too.",
            "Dragon Quest III HD-2D Remake and MvC collection.",
            "Skong",
            "Last defense academy and depending on the information, Romancing saga 2 remake.",
            "I was looking forward to the tp/ww port. Honestly tho… dragon quest remakes and Metroid prime 4. Brother ship",
            "Metroid prime 2/3 remaster! Oh wait…",
            "I know I will have the most hours logged into Super Mario Party Jamboree (favorite multiplayer series ever with nothing else close), but Metroid Prime 4 has me super hyped!  Doing a Hard Mode run of Prime Remastered now and will play 2 & 3 for the 1st time afterward. Was hoping for Switch versions of 2 & 3 before I started.",
            "Mario and Luigi Brothership and Marvel vs. Capcom: Fighting Collection.",
            "Metroid Prime 4, no contest.",
            "Xenoblade chronicles X on switch...",
            "Dragon Quest 1-3 and the Marvel vs Capcom collection. ",
            "Mario party",
            " Any news on a 2024 sonic/Mario Olympics gsme",
            "Because Metroid doesn’t have a release date, I have to narrowly say LoZ: EoW over M&L:B. As much as I love the first 3 M&L games, I have Been wanting a Princess Zelda (mainline game) for years! I still can’t believe it’s happening.",
            "I'm looking forward to about half of them.  Which is insane to think about tbh.",
            "Mario Party Jamboree. It sounds fun to play with a total of 20 players.",
            "Mario & Luigi. I'm currently playing through Bowser's Inside Story for the first time after buying it a million years ago and never getting to it, I had forgotten how amazing that series really is.",
            "metroid, m&l, marvel v capcom, just dance 2025, mp jamboree",
            "All the Nintendo first party stuff, but Zelda in particular looks fantastic.",
            "Zelda. Maybe the Mario Luigi Brothership...",
            "Maybe Mario and Luigi but that’s about it. Still was a great direct",
            "Funko fusion looks SOOOO bad and I am SOOOOO excited",
            "Zelda: Echoes of Wisdom - I wish they would've gone with the art style of LttP/LBW, but eh.  This time we have Zelda conjuring up shit to solve puzzles and kick ass.  The Zelda community is undoubtedly going to get real creative, and I can't wait to see it.\n\nMetroid Prime 4: Beyond - Fucking DUH.",
            "Basically all of the JRPGs",
            "Luigi’s Mansion 2 HD then probably the Marvel vs Capcom collection.  Remember playing those Marvel vs Capcom games when I was a kid so looking forward to replaying them and bringing back those memories",
            "When are pre orders going up for the newly announced games?",
            "I’m excited for them to announce a wind waker remake on switch",
            "I have a weird interest in Fantasian",
            "By far Luigi’s Mansion 2 HD. But I’m also really looking forward to a new Mario & Luigi game. I haven’t played one since Superstar Saga.",
            "How have people enjoyed Ace Attorney? Worth getting?\n\nI'm really excited for DQ 1&2 and 3, and of course MvC collection. I want to introduce my sons to these genres.",
            "FANTASIAN. I got my FANTASIAN money already labeled and ready to go now.",
            "Marvel Versus Capcom Collection & Mario & Luigi: Brothership",
            "Everything put out by Square Enix. Metroid Prime 4 has me intrigued.\n\nStill disappointed Nintendo won't print money by rereleasing Wind Waker and Twilight Princess so fans can literally play every mainline Zelda console release on one platform.\n\nThey're damn close with Mario and Donkey Kong too.",
            "Silksong…?",
            "As a Mario fan, I am of course excited for Mario & Luigi Brothership. Am still unsure about Luigi's Mansion 2 HD, since I already have it on my 3DS. I've also been looking at Donkey Kong Country Returns HD. I've never really played any Donkey Kong games before, would this be a good game for someone new to the franchise?",
            "1) Zelda  \n2) MvC: Fighting Collection  \n3) Tales of the Shire (more out of curiosity than actual excitement)",
            "I'm so pumped for the Hundred Line! I was hoping for Zero Escape personally but this is good too",
            "Marvel vs. Capcom Collection. I'm pumped to play them again.\n\nI spent many, many quarters playing them in the arcade (when arcades were still a thing), especially Marvel vs Capcom 2.",
            "On this list I have:\n\n* 5 games day one (M&L, Zelda, Metroid, DK, Ace Attorney)\n\n* 2 games when on sale (Dragon Quest)\n\n* 1 game if I really don't want to play the 3DS version (Luigi, own it, stuck in backlog)",
            "Honestly I might get on dat Mario rpg hype train, haven’t tried a single one but gameplay looks varied and fun",
            "Zelda Echoes of Wisdom! I miss 2D Zelda ",
            "Hello Kitty Island Adventure",
            "I'm definitely looking forward to the Zelda game, and I've been hoping for a Switch release of DKCR ever since I played Tropical Freeze, so I'm pretty happy to have both of those games coming in the near future.\n\n  \nI'm also intrigued by the Horizon Lego game, as I enjoyed those games on Playstation.",
            "That Direct was a banger. Beyond, Echoes of Wisdom, the Dragon Quest HD trilogy, Romancing SaGa 2 remake, and  Brothership. It's a hell of a send off.",
            "Surprisingly, only MVC collection",
            "Bball!",
            "Dragon Quest 3 and metroid prime 4\n\nAlso looking forward to the Saga game and zelda",
            "Just MP.",
            "If it’s good: the NES championship game.\n\nIt has the potential to be really good or really awful based on how much effort was actually put into it.  I’m prone to chasing high scores on stuff like this, but I’m also genuinely worried the game might not have enough content given the quantity/quality of challenges being advertised.\n\nI also expect the game to suffer a but from the fact that all 13 games in it are already on NSO.  In part bc it’s trying to partially sell itself based on multiplayer features.",
            "Silksong. It’s coming. Any day now….🤡",
            "Where's my boy, Kirby??? I want Kirby!",
            "Okay they kinda had me at plant animals, something about the system just clicks for me",
            "DQ3 and Echoes of Wisdom.",
            "Zelda obviously. I think people are sleeping on the echoes mechanics. We're probably going to be able to throw apples and chickens at people",
            "Echoes of Wisdom but I wont lie. The Erdrick Trilogy looks fantastic.",
            "Darkest Dungeon II and it's not even close",
            "Prime 4 and the new Zelda game are the obvious headliners, and I'm greatly looking forward to both. \n\nWasn't at all interested in any of the others initially, but then I realized that Dragon Quest was historically the name for dragon WARRIOR outside of North America. I loved playing DW4 as a kid on the NES, so those piqued my interest too.",
            "Investigations collection, fantasian, and phantom blade.",
            "Metroid Prime 4,Zelda:Echoes of Wisdom,Mario and Luigi:Brothership,Mario Party,Donkey Kong Country Returns.Possibly Luigi's Mansion 2 but only when it's on sale.",
            "Echoes of Wisdom.",
            "Metroid Prime 4 - \nMarvel Vs Capcom Fighting Collection - \nLOZ Echoes Of Wisdom - \nDK Returns of a Return\n\nIn that order.",
            "Any Front Mission 3 news?",
            "Give me Metroid and Zelda!\nDQ should be amazing, too!",
            "I typically wait until games go on sale since I have enough of a backlog to keep me busy.\n\nBut since I found out the developers went into heavy debt to get the game released, I'm keen to buy The Hundred Line on day 1. I love Zero Escape and Danganronpa, so I want to support the developers as much as I can.",
            "Echoes of Wisdom, Metroid Prime 4, Ace Attorney Investigations, Mio (Cyberpunk Hollow Knight FTW), and Marvel Vs Capcom collection.\n\nBrothership also made me interested in playing Mario & Luigi games. With the first game being free on NSO, I’ll be giving that a go once I clear some of my other backlog games.",
            "Switch Sports update",
            "I’m gonna get flack for this but MVC 2 is one of my favorite games of all time. I’m so excited. My wife lost her shit about hello kitty. I’m pumped for Metroid 4, and we are both excited for the new Mario party.",
            "The new Zelda, Tales of the Shire.",
            "MvC2 since I can’t get it on Xbox.",
            "A lot of those honestly, but I am particularly curious about Fantasian 👀",
            "Mario Party Jamboree, the 20 players online game mode looks really fun.",
            "It's free the sports update??\nEdit: nevermind. I watched the trailer. I was just lazy.",
            "MAHVELS BABY!",
            "Them Dragon Quest games have my attention. As a kid those installments were my favorite back when they were Dragon Warrior. I still wish the day the mmo one hits us, but I know that one is probably not happening anytime soon.",
            "The top three are no brainers for me. Other than that, the basketball update may be just the excuse I needed to pull the trigger on Switch Sports. MIO looks looks like a tight platform that I'll certainly keep my eye on, Jamboree could potentially be my first Mario Party, MvC seems like a great excuse to get into fighting games, and the Dragon Quest remakes are certainly a possibility.",
            "Dragon Quest games abd maybe Zelda",
            "Zelda, Donkey Kong and Mario/Luigi.",
            "Metroid and Ace Attorney are my big 2, but I'm intrigued by Mario & Luigi, Zelda, and maybe even Mario Party if my friends also get it. ",
            "Marvel vs Capcom",
            "Zelda: Echoes of Wisdom",
            "Marvel Versus Collection will be the game that finally kills my day 1 Nintendo Switch. Just need that release date",
            "The Legend of Zelda: Echoes of Wisdom.\n\nI am hoping for a special edition.",
            "CAPCOM FIGHTING COLLECTION",
            "Wind waker",
            "Tales of the Shire",
            "Echoes of Wisdom by far",
            "Mario Party to finally have a new couch-coop game we can play on a night hanging out together.",
            "Top 5 for me is easily:   \n1.) Metroid Prime 4  \n2.) Marvel vs. Capcom Fighting Collection  \n3.) Mario & Luigi Brothership  \n4.) Mio  \n5.) Mario Party Jamboree",
            "Zelda, Mario Party, Prime 4, just pretty much all the first party games lol. But especially Zelda. And glad it comes out in September which I was hoping(also with Astrobot that month is stacked lol)\n\nI'm not really into rpgs but Mario and Luigi looks great. Donkey Kong will be fun as well but not really excited for the port as much as the other announcements. For third parties I thought there was more filler this direct and more rpgs I wasn't interested in, but Stray stood out.",
            "Dragon Quest 3 & 1/2 remake. \nDragon Quest 12 (which most likely won’t even be on Switch).",
            "Metroid, Zelda, Mario & Luigi, both Dragon Quests, Marvel vs Capcom and Fantasian are my picks. So many exciting games! I need to pick up the pace with my backlog. 😅",
            "Zelda, of course.\n\n\nBut also still hoping for a port/remake of Soul Bubbles and DodoGo!. Loved those on the DSi, but haven't found same on Switch yet.",
            "Can't wait for zelda echoes of wisdom",
            "My biggest interests are in Metroid Prime 4 and MvC collection. I’ve never actually played a Metroid game, but I do own Prime 1-3. I always said once prime 4 gets a release date that I will finally play them. I did start Zero Mission the other night, and I’m having a good time. Will be playing the Prime games in preparation for 4.",
            "Fairy tail 2. Because I have fallen back down that rabbit hole. *and I hope they have Zeref and Acno as playable characters after you defeat them, because if I can't have the monster trio beating everyone else's butts, WHAT IS EVEN THE POINT* 😭😭😭",
            "This may be a hot take but I’m looking to Donkey Kong Country Returns HD, I never played the original",
            "Im confused, half these games have been out for several years.",
            "Zelda Echoes of Wisdom.\n\nDon't have a lot of time to play. Maybe I'll give it a shot for Prime 4, but I don't really like the Prime, I prefer the main series.",
            "I'ma go with none of em",
            "Metroid\n\nZelda\n\nDarkest dungeon 2\n\nLuigi’s mansion 2 (give us 1 on switch dammit!)\n\nMario Brothership.",
            "Zelda, Stray",
            "Luigi Mansion 2. Never played it before. Only played the 3rd one with my son. It was clunky controls at times, but we really enjoyed it.",
            "Never played a M&L game before so brothership is a great way to bring in new players. The style oozes with charm.\n\nBut because it's around the corner,  Zelda Echoes of Wisdom. It's funny how people are super shocked you play as Zelda when it was something most people immediately started imagining about since the end credits of BotW. It seems Nintendo listened, to me anyway.",
            "Nothing in the direct really interested me that much, though I might pick up NWC nes edition, seems like it’d be a good shake up from the games I normally use for local multiplayer (smash, Mario kart, switch sports, etc)",
            " Nintendo having Lego horizon instead of regular horizon games is like the peak  of a game's Downgrade when it's a PS5/Xbox/PC to switch port",
            "Hello Kitty Island Adventure. I've been waiting for that since the Wii.",
            "This had to be one of my favourite Directs in a while.  So many games I’m excited for!",
            "Only mario and Luigi, Luigi mansion 2, donkey Kong and maybe echoes of wisdom I need more gameplay of it first. None 2nd or 3rd parties interested me.",
            "Could care less about all except the DQ remakes.....HOLD THE PHONE IS DQ1 AND 2 COMING OUT TOGETHER?",
            "This probably won't surprise anyone, but:\n\nMario and Luigi Brothership\n\nThe Legend Of Zelda: Echoes Of Wisdom\n\nMetroid Prime 4 : Beyond",
            "After 7 years I’m thirsty for their next console and whatever the next iteration of Mario might be…. Odyssey 2 perhaps?\n\nI’m an early adopter of every console and by the end I typically lose interest until the next thing comes along. This happened with the NES…. Never got into the Kirby as I had moved on, SNES I missed Earthbound and a bunch of late releases at the time (I have most of them now). Last games I bought for my Switch are Dread and Prime remake…. I’ll likely get MP4 but will want to play it on the next hardware if backwards compatibility is a thing.",
            "Can we get a non-Twitter link/image? Fuck that site.",
            "I've only played Superstar Saga (loved it, meant to play others in the series) but I'm excited about the new one!",
            "Bowsers inside story is great, but other than that I think they mostly were just ok after that",
            "I missed most as well. I did play dream team though. And honestly, you aren’t missing much, or really anything with that one. It wasn’t great.",
            "Are they co-op?",
            "I'm not sure if I've ever played one all the way through but it looks good though.  I'm looking forward to it.",
            "Give Bowser's Inside Story a go. The original, avoid the shitty remake like the plague.",
            "When it comes to DKR:HD, all I keep telling myself is that Nintendo still see the relevance of the franchise. \n\nWith the DK theme park expansion, and I imagine a potential Illumination DK movie, there's got to be a brand new Donkey Kong game coming eventually.",
            "Even the ones that look bad like the Looney Tunes sports game and the Funko Pop mega crossover could be funny to buy and play just for the jank, in a so-bad-it's-good way.",
            "Damn, sir. You have the finest taste.\n\nYou seem so cool that I guess I could even say... i wanna take you for a ride 😎",
            "Zelda and marvel vs capcom",
            "> After 7 years of waiting\n\nWay more than that, Prime 3 came out 17 years ago. Obama was near the beginning of his campaign for president the last time we got a metroid prime game.\n\n^^and ^^it's ^^still ^^coming ^^out ^^before ^^silksong",
            "My brain can't process that Metroid Prime 4 is real so I was wondering why you called Jamboree \"Mario Party 4\".",
            "A new Mario Party could never miss for me ngl",
            "The Investigations Duology happens between Trials & Tribulations and Apollo Justice so I suggest to wait them out before playing the rest (Because the fifth game kind of spoils a plot point from AAI2).\n\nYou could play The Great Ace Attorney Chronicles in the mean time though, that one is isolated from the rest of the series.",
            "> Not sure why Illusion Island is in that image because it's a small free DLC coming out\n\nYeah, I thought that was weird. Same with Among Us. Maybe it's a significant update (I don't play Among Us, so I don't know), but it's still a free update so it was weird seeing both of those in that image.",
            "omg I'm here!!!! I'm so excited for the revival of one of my favourite franchises, it's still unreal to me that Level5 is coming back. I'm so excited for Decapolice and Fantasy Life too. I'm really hoping the unannounced new project at the next Level5 Vision is gonna be Yo Kai Watch as well! ",
            "I don’t know why they’re not re-releasing the older titles … I would happily pay for those.",
            "Yeah this one caught my eye.  Looks absolutely beautiful, and immediately reminded me of Ori but with a similar-but-different aesthetic styling.  I don't think it's getting enough play in the post-direct dialogue.",
            "That's the one that caught my attention the most aside of the big ones !! The artstyle looks superb, I'm very curious to see more",
            "Your Ori-fice",
            "What? Your comment was made on 6/21, after these announcements. This comment is very strange. Both games you mentioned were shown.",
            "Yup, those are the ones I'm most interested in (plus Fantasian, DQ III HD-2D remake and DQ I & II remake).",
            "Donkey Kong Country is. I think the lego game and that retro speedrunning thing both are as well.",
            "Mario Party will definitely be.",
            "Lego Horizon has co-op, online and couch.",
            "I would assume Brothership is coop. Right?",
            "Phantom Brave is a lot of fun! It's one of those games you can get *really* deep into if you want.",
            "You definitely won't have to play Primes 2 & 3 to play Prime 4. I mean, it might give you a bit more context, but Prime 3 was the conclusion to that story arc. Prime 4 is more of a new beginning.",
            "Why? Have you played the original?",
            "The list includes games to receive new content announced at the Direct\n\nSwitch Sports & Illusion Island have also been out for a while, but new content was announced in the Direct",
            "I am honestly curious if Romancing Saga 2 remake will have the mobile content (Ninja and Diviner were part of that content)",
            "Ace Attorney Investigations 2 is considered by many to be the best game in the series.",
            "I could count three games on this image that have been out longer than a week. That's not half.\n\nSome of these are HD ports of existing titles, but these HD versions are definitely not out yet.",
            "Being shocked at doing something the fans requested is pretty normal. They deny and tease us.",
            "Find a way to play Bowser’s Inside Story, that game’s a masterpiece.",
            "Nah Dream Team was still great, Paper Jam was just ok though",
            "I was about 15 when I played Inside Story, I remember thinking it was so absurd that it was great.\n\nThe Kaiju fights, being inside bowser, Midbus being like a WaBowser.\n\n10/10 no notes.",
            "Dream Team was where I stopped with these games. The tutorials were never ending! Partners in Time and Bowsers Inside Story were awesome though",
            "No",
            "I got the remake a while back but haven't played it yet. What's wrong with it?",
            "Yeah, at least having this Remaster tells me that Nintendo cares and wants to keep the IP alive. \n\nThe DK series just happens to have this curse ~~of not being allowed to have new games at the same time as Metroid~~ of not having a proper Developing House after Rare left and Nintendo has struggled for 22 years trying to find one without success. [Their last attempt was Vicarious Visions, but Activision cancelled the project and then put that team to work on Call of Duty.](https://www.nintendolife.com/news/2024/05/details-emerge-of-a-cancelled-donkey-kong-project-from-vicarious-visions)",
            "I just want a DKR3 with K.Rool as the main antagonist. Is that too much to ask for? :(",
            "7 years since its official announcement.\n\nI wouldn't say that I have been waiting for a Prime 4 since Prime 3 ended. After all, Retro Studios said they'd move on to work on fresher projects (DKC Returns). And Sakamoto would continue the series with Metroid Dread (Back then on development for NDS) and then in 2010, Project M, the Magnus Opus that would change the series forever would finally be released and everyone is excited play it!!\n\nHoo boy... did those two projects really pan out so perfectly well /s",
            "🤣",
            "Thanks for the tip!  I've got plenty of backlog to tackle until then, haha.  I've heard TGAAC are really good though, so I was figuring to save em for last.  Gonna trundle along in the original release order, likely!",
            "Bro do you actually think i was being serious",
            "I think they're taking the piss out of people that weren't expecting much from the Direct.",
            "It's a one player game where you control both brothers.  I guess they could make a co-op mode where you control one brother each, but the gameplay/controls would be really basic.\n\nThink of it this way, the gameplay is designed around one person having to be able to manage to control them both together.  So if you split that job up, each player only has half of a job.",
            "Nope. My wife loved the co-op mode in LM3 and really wanted to try another Luigis Mansion game.",
            "Ah okay, thanks!",
            "Do I need to play 1 to understand 2’s story or lore? Or, can I just skip 1 altogether and play 2?",
            "Is this how Switch owners cope with Nintendo?",
            "Dream Team is great once it stops tutorializing everything, but my god does that game love tutorializing everything.",
            "Dream team wasn’t bad at all, but I’m with others in the complaints about the tutorials. \n\nThe game felt long as is and they just made it feel longer in a bad way.",
            "“CANNONBEEF!”",
            "Bruh\n\nDream team is the best in the series really\n\nAnd BiS is over rated too !",
            "Thank you",
            "The first one is if you have the gba copy and a GameCube with the gameboy player with 2 controllers lmao",
            "Right? I haven't played it yet either but I thought it did pretty well",
            "People swear by the original mainly for the original soundtrack and artstyle, as well as the remake having some performance issues at moments and 30 fps. The original is my favorite DS game of all time, but I also think the remake is alright overall. I also like both the original/DS artstyle and the newer/3DS artstyle, but opinions on the artstyle are very dependent on the person. It's really not terrible, but it does have some rough issues.",
            "Imo (as someone who actually rlly likes the Superstar Saga remake), the BiS remake artstyle looks a lot worse, it takes so much longer to get into a battle, and the frame rate is 30fps compared to the original’s 60fps, and you can rlly feel it. At its core it’s still a good game just bc the original is, but I see no reason to play it over the original and no reason it should’ve been remade to begin with.",
            "It's worthless. The 3DS could already play Bowser's Inside Story and it didn't need any fixing like Partners in Time needed with a remake that it never got because of this damn thing.\n\nThe added content is awful, just like it was back in the Superstar Saga remake (but at least that one could justify its own existence), they made the game more ugly with the \"updated\" artstyle for no reason other than cha-ching (which didn't even work, the game flopped. Hard. So hard it's considered one of the biggest failures in the entire Mario franchise and killed the studio behind it.)",
            "Yeah, Retro is great with Donkey Kong, but they most likely don’t have the resources for Donkey Kong and Metroid Prime 4",
            "Yes, your bad grammar made your comment read like either a bot or a foreigner.",
            "Ah, couldn't tell. Usually bad grammar, no punctuation comment are made by folks that aren't thinking very much.",
            "I'd definitely play them in order.",
            "Ports exist on all consoles. Other consoles have far fewer exclusives than the Switch does and revealed far fewer games than this at their own presentations this summer.\n\nIf that's \"coping\" to you, sure. I'm coping just fine.",
            "Did it ever stop tutorializing? I swear I remember getting tutorials near the end of the game still",
            "> dream team is the best in the series really\n\nYou’re joking right? From the aesthetic, to music, to story. It just felt like a rip off of the M&L series.\n\nI mean to each their own. But that one just felt so far away from its source.",
            "I played the remake recently and loved it. I personally enjoyed the new art style and QOL features.",
            "It's not just Retro Studios though. Metroid and Donkey Kong excluding each other has been a thing since the birth of both franchises.\n\n**1981-1983:** Donkey Kong Arcade trilogy gets made and catapults Nintendo into making videogames. Metroid doesn't exist yet.\n\n**1986-1994:** 2D Metroid trilogy gets made and ends in March 1994 with the masterpiece called Super Metroid. Donkey Kong has become non-existent and totally overshadowed by Mario.\n\n**1994-2002:** Donkey Kong under Rare gets into its Golden Age with the Country Trilogy, the Land games, Diddy Kong Racing and DK64, it becomes one of the biggest IPs ever, on par with Mario. Meanwhile, Metroid is in hiatus and skips the whole generation.\n\n**2002-2010:** After Rare gets bought by Microsoft. Donkey Kong Racing, Diddy Kong Pilot and more games get cancelled and in the following years, it only gets ports of Rare's games and some spin offs of dubious quality. Meanwhile, Metroid enters its Golden Age with the Prime Trilogy, 2D gets Fusion and Zero Mission, also spin offs like Prime Hunters (The online community was big back then) and even a great Pinball game.\n\n**2010-2017:** Metroid Other M happens, then Metroid enters a second hiatus and gets nothing for years (Federation Force was basically what DK was getting the whole past decade). At the same time Retro moves on to make DKC Returns  and Tropical Freeze. The latter might be the best game in the series and the best 2D platformer I've played (On par with DKC2).\n\n**2017-Now:** Metroid Prime 4 gets announced and it's finally up to release next year, Samus Returns gets announced the same day, Metroid Dread in 2021, which continues the canon after 19 years. DK is.... missing in action again.... at least we got ports of Returns and Tropical Freeze.... yay.\n\nI shall call this the Metroid Kong curse.",
            "Retro is phenomenal. They really knock it out of the park every time.\n\n\nI'd love to see them handle an original IP backed by the same TLC Nintendo gives to their first party titles like they do with MP and DKC.",
            "There’s no bad grammar at all. A missing capital letter and two full stops?",
            "I played close to release so admittedly it's been a while, but I remember it cooling it around the 10 hour mark. So *only* like half the game is tutorials 😭",
            "It's a rip off of its own series... which it's far away from?\n\nBwuh?",
            "Nope\n\nIt's truly the best\n\nFrom aeshetic to music to story to gameplay\n\nEverything is better for me than BiS !\n\nI guess you can't accept that someone like DT better than the \"holy and all might perfect BiS LOL\"\n\nDon't get me wrong tho, I like BiS, but DT is just better on every aspect.\n\nPeoples only complain about the tutorial stuff which is a bit annoying but nothing that break the whole game really.",
            "Omg, I never noticed that, its amazing how this is a thing",
            "You’re misremembering how [long that game is.](https://howlongtobeat.com/game/5620)",
            "Ehh, the Luigi dream environments were basically a more dull version of the \"inside Bowser\" sections of BiS and the previous games had a bit more consistently entertaining character writing.",
            "I don’t think BiS is perfect. Better yes. But I also think all the M&L games are better than dream team. \n\nOnce the M&L series dropped the pixel aesthetic I’ve found it just looks terrible. Even Brotherhood in terms of aesthetics looks like shit to me.",
            "Nah\n\nIt was better and more creative overall I find it\n\nBut I know my opinion is unpopular lol\n\nBut you will never be able to conveice me that BiS is better.\n\nThe writting were about equal I would say, it's not better nor worse in DT."
        ]
    }
}