{
    "Weekly low-hanging fruit thread #59": {
        "title": "Weekly low-hanging fruit thread #59",
        "score": 44,
        "url": "https://www.reddit.com/r/NonCredibleDefense/comments/1dhbzu1/weekly_lowhanging_fruit_thread_59/",
        "content": "This thread is where all the takes from idiots (looking at you Armchair Warlord) and screenshots of twitter posts/youtube thumbnails go.",
        "num_comments": 88,
        "comments": [
            "This is an outrage, I want my PowerPoint on schedule.",
            "Is a pineapple grenade bowled across a field a low-hanging fruit?",
            "So according to deepstatemap (and various Russian Telegram channels) there's a pocket of hundreds of Russians in Vovchansk that are encircled. \n\nIf they get captured it'd be a gem of a fuckup in a northern offensive that's been full of fuckups since about day 2. And probably inspire Russia to do something super intelligent, like retreat, or better yet launch another offensive.",
            "Apparently Russia decided to stop pretending that the A-50 was downed by friendly fire: per today’s ISW report they charged a Ukrainian commander in court (in absentia) for its destruction.",
            "Open twitter, see \"israel and hezbollah gonna war\"\n\nclose twitter, sleep soundly knowing nothing will happen\n\nTwitter really is the barometer of truth if you inverse it lmao",
            "TIL [there are even more robot/autonomous fighter jets in the Florida Panhandle.](https://warriormaven.com/air/venom-program-air-force-converts-f-16s-into-unmanned-attack-drones) (This in addition to X-62 Vista, ed: possibly trained there although I may be confusing it with the Venom jets, and the Valkyrie jets, all at Eglin). You can also throw in a Cash (Rosanne performed their this January) and the birthplace of New Urbanism (Seaside).\n\nThis has got to be the age-of-AI equivalent of 1910s Vienna where Tito, Freud, Franz Ferdinand, and the two mustachioed tyrants of the 1940s lived within a short tram ride of one another.",
            "[https://x.com/NOELreports/status/1802608137670652117](https://x.com/NOELreports/status/1802608137670652117)  \nNato to grant Polish request for nukes?",
            "[Antonov Airlines just finished delivering a batch of Polish-made Blackhawks to the Philippines.](https://www.facebook.com/permalink.php?story_fbid=pfbid021uFTpA6QyeSfCr69CyGyKaH5CmKVDtsiHpeNaap47upSt9KNnP7fXWMZe1WyT4oKl&id=100069413430533)\n\n\"Philippines set to become world’s largest operator of S-70i Black Hawk choppers.\"",
            "IDF in Arab propaganda: Space laser fleet with dolphin infiltrators\n\nIDF IRL: [With the correct uniform anyone can just walk into a base and pull sensitive files](https://www.i24news.tv/en/news/israel/defense/artc-idf-base-fails-test-infiltrators-collect-classified-data-under-false-identity)",
            "why doesn't Russia just ban smoking in refineries? are they stupid? (yes)",
            "https://www.inquirer.net/406766/brawner-filipino-sailors-fought-bolo-wielding-ccgs-with-bare-hands/\n\n> Philippine Navy personnel assigned in the West Philippine Sea resupply mission figured in a fight with bolo-wielding China coast guard (CCG) using their “bare hands.”\n\n===\n\n> Torres also confirmed that seven firearms were seized by CCG, but they were “inside gun cases” and were not used during the resupply mission.",
            "Hezbollah Just threatened Cyprus\n\nI would like to refer everyone to article 42.7 of the European Parliament, which is basically the equivalent of NATO's article 5\n\nWhat im trying to say is that the western world might glass Iran sooner rather than later",
            "What makes a man turn neutral?\nhttps://kyivindependent.com/patriot-missiles-intended-for-switzerland-to-go-to-ukraine-media/",
            "Gotta get me some of that\n\n#Military Surplussy\n\n(is this anything?)",
            "Hey, which of you posted this? \n\n\nhttps://www.reddit.com/r/whowouldwin/comments/1dju5n2/could_isis_defeat_north_korea/",
            "What's the credibility on The Dam being deliberately built with poor structural integrity as a CCP failsafe in case the more prosperous south tries to revolt against the Beijing administration to the north?",
            "The Houthis sunk another ship in the Red Sea and seriously damaged a 3rd ship. For how much longer will Iran continue to get away with their bullshit?",
            "War is a continuation of logistics.\n\nhttps://www.twz.com/land/shipping-container-launcher-packing-126-kamikaze-drones-hits-the-market",
            "See post with image of fighter jet shootdown at end ( https://www.reddit.com/r/NonCredibleDefense/comments/1djhgyv/youre_wrong/ )\n\nimmediately recognize that it's from a Turkish shootdown of VKS jet over syria.\n\nI should get a new hobby.",
            "Has anyone checked on Perun recently? It's been 4 days now.",
            "Tucker Carlson is modern-day Lord Haw-Haw and Donald Trump is like Mosley?",
            "What are the chances that the EMBT's angular and messy/busy shape will inform the overall visual language of the MGCS's shape (being also busy and angular and stepped even if the exact form is different)? I know there's already renders of the MGCS but that's still a ways away and subject to change.",
            "Should I get a job with Booz Allen Hamilton? They’re hiring an environmental specialist and I’ve been looking to get out of the oil field.",
            "I saw this while being productive on company time and now you have to:  \nhttps://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fp77btbmze07d1.png",
            "ice cream is being supplied to EISENHOWER via UNREP. Victory is assured.\n\n\nhttps://twitter.com/ChowdahHill/status/1803280797836759108",
            "Hey, who has a link to the funny video about Russian vs western air defense radars?",
            "I did not expect to see a Mig-29 appear in a The Angry Beavers episode. It appeared in the episode \"The Mom from U.N.C.L.E.\"",
            "When the Ukrainians launch a drone, they often shout this word. The person setting up the drone shouts it and the Ukrainian drone pilot shouts it in acknowledgement. It’s in this [video](https://youtu.be/WipqeFgzdTc?feature=shared) (at 4:00) What does it mean?",
            "It's not as good as the Taiping Heavenly Kingdom, but someone should make a shitpost about these guys, they would've gone far if it weren't for us meddling Americans: https://en.m.wikipedia.org/wiki/Battle_of_Najaf_(2007)",
            "There needs to be a nuclear variant of SHORAD",
            "So, out of all the new tank models unveiled at eurosatory how.would you rank them?\n\nMy list goes:\n\nEMBT-140ADT\n\nKF51U\n\nLeclerc Evolution\n\nLeopard 2 A-RC\n\nThe barrel/turret ratio on the EMBT is just menacing.",
            "[guys will see this and just think \"hell yeah\"](https://www.youtube.com/watch?v=kVTfkveXLUA) (feat. VARK)",
            "Is war gonzo still around or was that really him in that video last year?",
            "https://x.com/kvothethearcane/status/1804231318240125329",
            "“I’ve been trying to complete the lethal autonomous weapons video but any attempt to fill it out sounds like an Australian accent filtered through sandpaper.”\n\nWhy is he saying that like it’s a bad thing?/s",
            "No. It's not hanging, it's rolling.",
            "Pineapples grow out of the ground so I feel like the requirements for them to be considered low-hanging are higher (that is, lower) than for other fruit that are more high-hanging to begin with.",
            "They sound like perfect targets for a drone to drop \"how to surrender\" leaflets on.",
            "> they charged a Ukrainian commander in court (in absentia)\n\nWhat is the meaning behind this buffoonery?  Is this because Russia isn’t officially at war?  Now he’s charged with vandalism or something?",
            "Maybe that Ukrainian officer can use that when asking for promotion? \"Sir, I believe I'm due to promotion. Here is a russian areest warrant in my name for destroying their critical asset.\"",
            "Cuz we revealed that it was in fact a Patriot not a S-200 or something else.\n\n\n:)",
            "Ah yes. A colleague of mine has been telling me Hezbollah will attack Israel any second now basically since October 7th. You probably won't guess which social media platform he visits frequently...",
            "From a leading security intellectual on twitter, the Ayatollah of Jamescore: \n> The fate of the Middle East currently rests on the World's most dedicated uncontrolled escalation enjoyer (Netanyahu) v. nothing ever happen's strongest soldier (Nasrallah)\n\nhttps://twitter.com/GravitysRa1nbow/status/1801400778013233271",
            "i wouldnt be so sure lol",
            "So I take it this means there’s now a Blackhawk variant with a built-in karaoke system?",
            "If Switzerland refuses the re-export of their weapons and ammo to Ukraine, why should any arms exports to Switzerland take priority over arming Ukraine?\n\nBesides, they're NATO-surrounded freeloaders.",
            "Well, there's a lot of American MRE's floating around, since we're between wars. ",
            "just be a police department in rural Bumfuck Texas and get your own MRAP.",
            "> (is this anything?)\n\nIsn't \"military surplussy\" when you doink a medically-discharged vet?",
            "I’m going to argue Hanlon’s razor here: don’t attribute to malice what can be easily explained by incompetence. In addition to a culture of reporting not communicating problems up the chain (in the initial stages of the Great Leap Forward all the local party cadres were telling how they had so much food they didn’t know what to do with it, leading to massive export quotas as well as instructions *from Mao* that the peasants should gorge themselves on what they did have) the CCP saw nature as an enemy that needed to be conquered. This led to a number of poorly thought out deforestation and irrigation projects that had negative consequences for the population. The Three Gorges Dam is just the largest folly which could potentially surpass all others combined.",
            "if the chinese deliberately built it poorly on top of the usual chinese \"costcutting\" measures it would have already collapsed",
            "I think the US is tired of everyone elses bullshit. Almost none of these ships are even US related. They tried to get a serious international operation going but everyone else wanted to do their own shit.\n\nIndia and Europe need to step the fuck up and protect their shit if they don't wanna be team players.",
            "He made a post about being sick and losing his voice. Here's hoping he's feeling better soon.",
            "Booz Allen has produced luminaries such as noted traitor Edward Snowden and um… I dunno probably has given some jobs to retired generals to secure contracts\n\nSo yeah 👍. Hopefully they don’t work with the Chinese and Russians like McKinsey does",
            "Fuck yeah!  *high-five*",
            "I love that Nazi furries exist.  It completes my worldview.",
            "Wait, he's using the \"X million bombs to bomb Donetsk children\" even though he's anti-Ukraine?\nWas that actually a serious anti-Ukraine meme originally? I thought for sure it was a parody of Russian disinformation campaigns.",
            "I count 96 5 gallon tubs. 5 oz. of Ice cream per serving. So 12,288 servings.  5680 persons aboard the Eisenhower.  So, if each person got one serving a day, that's a bit more than 2 days worth of ice cream. ",
            "The one that is translated as \"taking off\" in the subtitles?",
            "The Iraqis claimed the cult was trying to kill this guy\n> https://en.m.wikipedia.org/w/index.php?title=Ali_al-Sistani&diffonly=true\n\nif they had succeeded that would be basically the \"start a civil war button\" especially if the murder got pinned on the Sunnis.",
            "Being a 50s product, I wouldn't be surprised if Raytheon had a nuclear tipped HAWK it tried to sell. ",
            "well boys i reckon this is it. nukular combat toe to toe with the russkies",
            "Why Vark? ",
            "[deleted]",
            "More importantly, if people have really been thinking he's been doing an ai voice, just do it. Voicecraft is uncanny. How is that not appropriate for a video on militarized ai?",
            "Yeah you have to zip tie it to your nuts for it to be a low-hanging fruit.",
            "Pretty sure they dropped 120mm shells on them with money that had surrender messaging on it. Might be thinking of something different though.",
            "Per ISW, to covey their (wrong) opinion that Ukraine is an illegitimate state. \n\n> The Russian government is charging Ukrainian servicemen and military officials with crimes in absentia as part of its efforts to enforce Russian federal law outside of its jurisdiction and insinuate that Ukraine should not exist as an independent state. … The Russian Investigative Committee ruled on June 17 to detain a Ukrainian commander in absentia on charges that the commander helped down a Russian A-50 long-range radar detection aircraft in February 2024 — a legitimate act of war and a normal event for two warring states.[18] … ISW continues to assess that Russia's decision to place Western officials on its wanted list for violating Russian federal laws outside of Russia is part of its effort to violate the sovereignty of NATO member states and justify possible future Russian aggression against NATO.[21] The Kremlin's prosecution of Ukrainian military personnel and political leadership who are engaged in a fully lawful, defensive war against an invasion by a foreign power in a manner akin to domestic terrorists highlights Russia's enduring belief that the Ukrainian state does not and should not exist as a political entity separate from Russia.",
            "Something like\n\n\"noooooo stop shooting at our poor innocent critical military assets that never hurt a fly\n\nThey were unarmed so shooting at them is no fair\n\nIt's not like they were contributing directly to our war effort that kills thousands upon thousands of civilians Q_Q\n\nThis is totally like that one time where Donetsk separatists that were completely unaffiliated with us shot down that air liner\"",
            "For people that \"really care\" about the conflict, they acting like Israel and Hezbollah haven't been shooting at each other for months is surprising. Like, this is not a secret, [there's AP articles](https://apnews.com/article/israel-lebanon-hezbollah-evacuees-gaza-war-1841834d89af938a8445821567640aea) about the thousands of evacuations on the border, so what the hell are they talking about?",
            "Just don't sing \"My way\" and everything will be fine.",
            "My suburban Blue-State small city police force has one... ",
            "Ah yes, Meal team 6.",
            "\"We want it to be so weak a big gravity bomb can glow it up\"\n\n\n\"That would require reinforcing several parts of it\"",
            "I mean, honestly, let them fuck with the whole world at this point. India, China, and Europe are all capable of launching their own expeditionary forces or applying kinetic consequences to Iran.",
            "Novichoc do be like that /s",
            "russia and china 🤮\n\nso you're saying BAH needs to be reformed from the inside?",
            "🙌🙌",
            "I should ask the mods if they'd allow it to be crosspost",
            "Does it translate literally to “take off” though, or does it literally translate to something else and “take off” is just what it means?",
            "'cos it got Vark",
            "All these death rumors (Pegov, Shoigu, Gerasimov x2) can be answered with \"It's not true and you're an idiot for believing it in the first place.\" you need \"proof of life\"? You never had any real reason to think he was dead!\n\nBunch of meme-posters who know nothing about Russia and don't realize Russia's an actual real country of 140 million. So however unlikely it would be for a milblogger to be fighting in the trenches in a Chechen uniform and sneakers, they apparently concluded it's even less likely there would be _two_ men in Russia with red beards. \n\n_English language_ Wikipedia? Seriously?? Get over your main-character syndrome. You really think they're springing to update English Wikipedia to debunk rumors nobody in Russia heard in the first place, not because of censorship but simply because Russians realize they're in an actual country. The kind of Russians who edit English Wikipedia (without getting paid to do so) aren't the kind that are likely to be fans of Pegov in the first place. And believe it or not, Pegov's not exactly a household name in Russia. He's a big name in a small subculture. Meanwhile the Russian-language Wiki page doesn't even bother with the rumor (and nor should they).\n\nMeanwhile in the real world, Pegov was at a meeting with Belousov together with Sladkov, Rudenko, Kots, and some other major milbloggers just a week ago. As is the case every time people post here about this crap. Just a month ago it was Gerasimov, just days after he'd chaired a CSTO meeting, and had publicly gone and voted in the election and other crap. Did that get reported in Western media? No, because they never gave a damn about the unfounded rumor in the first place, and because those appearances in-themselves weren't interesting. Nor are they reporting on Belousov meeting milbloggers because that's not terribly interesting either. \n\nAgain it's main-character-syndrome. Believe it or not, most shit that goes on in non-English-speaking countries is never reported on in any English-speaking media. Just because a bunch of Western kids start circlejerking on Twitter over this-or-that guy being dead - for literally no reason other than \"someone on the internet said so\" - doesn't mean the Russians give a fuck about that, much less are going to go out of their way to disprove that. Their information bubble is not your information bubble.",
            "[removed]",
            "Yeah I mean I feel like BAH probably cares too much about its federal work to be fucking around with Chinese and Russian state defense firms like McKinsey. Some of these consulting firms don’t know whose side they’re on though",
            "https://context.reverso.net/translation/ukrainian-english/%D0%B7%D0%BB%D1%96%D1%82",
            "This post is automatically removed since you do not meet the minimum karma or age threshold. You must have at least 100 combined karma and your account must be at least 4 months old to post here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NonCredibleDefense) if you have any questions or concerns.*",
            "Ok, I applied. When can I ask about getting my cat ears?",
            "I mean yeah booz basically cares *only* about federal and defense work, i've literally never heard of someone there working on a non federal contract.",
            "Part of the onboarding process",
            "They technically have commercial clients too but it’s a minuscule segment of the pie."
        ]
    },
    "Damn news baiting me with WW3": {
        "title": "Damn news baiting me with WW3",
        "score": 543,
        "url": "https://i.redd.it/ali2cwk3b38d1.png",
        "content": "",
        "num_comments": 42,
        "comments": [
            "I hate news like that, they are misleading and spread misinformation easily.",
            "This and clickbait. I hate clickbait stories and you won’t believe the reason why.",
            "/uj Hey, six different missiles to sink a single cruiser is pretty good news too though, especially since Chinese simulations seem to assume a lot more goes right than American simulations. \n\nThe chances of six missiles slipping past the anti-missile defenses of a fleet to sink a cruiser before the missile delivery systems are sunk, shot down, or otherwise blown to smithereens seems slim in my uneducated opinion.\n\n/ri bait used to be believable",
            "Don’t give me hope. I’ve been wanting the US Navy to turn the PLA Navy into new barrier reefs for years.",
            "Just one cruiser? That's weak, China, Russia has already destroyed 3000 HIMARS and a few dozen Zelinksy in their simulations.",
            "[removed]",
            "If you overwhelm a targets defensive countermeasures, you can eventually cause damage and sink it. How did China discover our ships one weakness?!?!?!",
            "Simulation. Got me.",
            "The Ticos are so clapped out they're doing their best to sink on their own. The Chinese clearly need to up their game.",
            "Probably intentional, I think even an unskilled editor/writer wouldn't have a problem making that headline clearer and more concise. Something like:\n\n\"China Simulates Successful Missile Attack on U.S. Warship.\"",
            "Is clickbait *really* that bad? Our survey results will shock you!",
            "I think the phrasing should be read that 6 missiles need to actually hit, not that 6 missiles were fired. Realistically it'd either be a saturation or attrition attack (i.e. constraining either the firing rate or the ammunition of the defenders) and their firing models will now account for the idea that they need to get 6 missiles of that size to penetrate the defenses.\n\nTrying to take out the attacking systems before that could be achieved would likely run into the same issue of having to saturate or attrit their defenses, and in place of CWIS they'll have a hundred conscripts firing knockoff AKs at incoming cruise missiles and being ready to Mr ~~President~~ Supreme Leader the missile on final approach.",
            "Ackshually that’s super irresponsible because of all the hazardous material on these ships, if they were to be comprehensively fucked in combat all the POL/bad stuff would get into the ocean. Think of the dolphins. \n\nWhat you *should* be hoping for is a bloody and violent, but ultimately entirely land based coup that replaces Winnie the Pooh with someone that supports glorious managed democracy.\n\nNow where *is* that three gorges dam…",
            "China will just claim them as new marine territories.",
            "They still haven't found the Zelensky Cloning Facility, smh.",
            "The bright side is that whenever a US warship sunk by a hostile country, that country will also goes with it.",
            "The US will win at a cost. The PLA Navy is a contender, but still no match for the Department of Defense. Hence why the Chinese don’t really want war.",
            ">Recent us simulations saw all us supercarriers destroyed or severely damaged as an outcome.\n\nCitation needed or I'm removing this as missinfo.",
            "I don’t think that’s what the post is about",
            "Aren't most US exercises basically \"everything that could've gone wrong did\"?",
            "Your post was removed for violating Rule 13: \"No misinformation\"\n\n\"NCD exists make fun of misinformation, not to spread it. You can make outlandish claims, but if your takes don't show signs of satire or exaggeration, they will be removed. Misleading posts and comments may result in a ban. Regardless of source, don’t post obvious propaganda or fake news - double-check facts and don't be an idiot.\"",
            "> Recent us simulations saw all us supercarriers destroyed or severely damaged as an outcome.\n\n\n\nooof. thats part of what makes me really hope that conflict stays cool/cold. I dont have enough bunkers and greenhouses to be ready for the escalation ladder we would be climbing up after a sunk carrier or 6",
            "Yes, but I want Godzilla.",
            "Speaking of the Three Gorges dam, it (and other dams on the Yangtze River) is an ecological disaster as they block migratory fish species and led to their extinction, and CCP's effort to save the fish has been a failure: https://www.nature.com/articles/d41586-024-01444-3\n\n\nSave the fish. Nuke the dam. ",
            ">think of the dolphins. \n\nThe rapists and sadists of the sea?",
            "\"Sir, the U.S Navy has been providing an alarming amount of cutlasses for their men, should we train our glorious PLN recruits with sword-fighting techniques?\"\n\n\"Pfah! What are gonna do? Board us?\"\n\n\n...\n\n\n\n\"YA-HARR MARINES! YA-HARR!\"",
            ">sunk by a hostile country,\n\nSometimes all that's needed to delete a country is that the ship gets sunk and the hostile country has assets nearby. It can be sunk due to poor weather or drunk captain, but the USA god of war accepts the sacrifice either way and blesses the world with another 10 years of beautiful warfare",
            "Nobody wants a war, but deterrence makes nobody not want a war even more",
            "https://taskandpurpose.com/news/war-game-taiwan-china-us/\n\nHere is a source. Not what OP is claiming though, the claim that all are destroyed or severely damaged is blatantly false",
            "Yep.\n\nWhich is why past stories on \"omg US military changed the rule of the wargame so that they win\".\n\nIn the vast majority of those cases, it was more likely the rules set in the wargame was too stacked against the US side that the OPfor can exploit it to get a win, and the rule changed later to make it less stacked so they can actually get useful strategy out of it.",
            "Fog of war? That sounds like the perfect condition for a false flag op",
            "Like the Spanish-American war. Leading theories now and at the time say that it was an accidental detonation due to the crew of the Maine doing something wrong, but the US wanted an excuse to go to war with Spain, so they took it.",
            "I wouldn’t say nobody wants war. You are on r/NonCredibleDefense\n\nBut seriously, there is Hamas, Hezbollah, and of course Russia. Those are the first three that come to mind.",
            "I'm aware of the CSIS wargames and the pros/cons of that excercise. \n\nWhat I'm waiting for here is a citation on recent US simulations projecting a total loss of the carrier force or a retraction.",
            "I can’t remember the text exactly, but my AP US textbook seemed to implicate that it was a false flag, but I could be wrong",
            "Those are nobodies.",
            "I’m pretty sure the only sources that’d claim that would be Chinese/russian ones",
            "Lots of different theories, but the general consensus was that Spain wasn't responsible.",
            "I just see fertilizer.",
            "Agreed. But they can still harm people that don’t deserve it, or are currently harming people that don’t deserve it.",
            "Yep, hence the nasty mod sticky.",
            "I would if there was more action against them."
        ]
    },
    "NATO as usual dropping bombs": {
        "title": "NATO as usual dropping bombs",
        "score": 264,
        "url": "https://v.redd.it/w59swfvgr38d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "We should invade turkey to show putin what an aggressive NATO actually looks like",
            "\"Don't trust it it's propaganda.\"\n\nI know, and it's working\nDouble the defence budget",
            "\"democratize\"",
            "[Sauce](https://www.instagram.com/reel/C8bvKRnNICQ/?igsh=MXJuZjF3c3R2ZjYxMQ==)",
            "Where not like us edit 🧍‍♂️",
            "The most noncredible comment of the day",
            "Too far away, what if we invade germany?",
            "Don't get cheap on me Dodgson",
            "No way bro just leaked his instagram 💀",
            "Pssstt I see falling migs\n\nTrying to be a superpower but is probably a MINOOOOORRRRR (power)",
            "Germany is part of NATO that wouldn't make sense",
            "we won then. Another W for nato",
            "Turkey is too.",
            "yet another win in the column, then!",
            "That's more of an inconvenient marriage of convenience"
        ]
    },
    "I don't understand for remove the my art": {
        "title": "I don't understand for remove the my art",
        "score": 968,
        "url": "https://i.redd.it/7mx1tdk4b18d1.png",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Reddit doesn't like a nearly universal European word for bassoon.",
            "It's the cigarette, not the gay guy.",
            "I still can't understand why the art above was removed. Did I praise communism in the past here, or is there communist praise in this picture?\n\nIf my caption in the art was the issue, I'll admit it, but you clearly banned this painting for hate-mongering.\n\nWhat hate is in this painting, or is it because you dislike that I drew it in the Soviet style? All I wrote there were the words \"Federal Air Force of the Union of Soviet Socialist Republics\" and the full name of the MIG-15 in Russian.\n\nTo begin with, I'm South Korean. I have a strong dislike for the pig upstairs, Winnie the Pooh downstairs, and the Ice Lich King upstairs. But that's just my personal opinion, and I never mentioned anything related to them in that post. I created this art for the upcoming Korean War commemoration (June 25th). The previous art featured a Corsair that participated in the Korean War, and this piece is a continuation of that theme. There's no other meaning to it.\n\nIf a Reddit admin dislikes communism, that's none of my business. It's not hate-mongering; it's just a personal idea that no one has the right to infringe upon. Furthermore, I've never expressed such views.",
            "As a Caucasian male, would it be okay to wear this Tee-shirt to honor the rich history of Soviet aircraft? ",
            "As a card-carrying member of the Alphabet Mafia, I don't care. Use it all you want. We can ***always*** tell when it's meant as an insult and when it's just a word, because that's how words work.",
            "[Just drop the \"T\"](https://www.youtube.com/watch?v=apkbO7797rE) and they won't be so upset",
            "I think the real issue is that it’s not spelled fucking Мцг-15. Wtf is a mtseg-15? It’s М***И***Г. Cyrillic is not that hard.",
            "I dont understand for reading the your title",
            "Maybe they just don't like commie fagots.",
            "Soviet Union also had 9k111 ATGM with the same name. Still used on the battlefield in Ukraine by both sides.  \nMy pals from US marines laughed their asses off when I translated frontline stories from a Ukrainian anti-tank platoon equipped mostly with those.",
            "Reddit doesn't like public praise of any type of fagots.",
            "MiG-15 has hips almost big enough to be a Grumman",
            "Because no maskovian.",
            "Its pronounced Fay-Goh because its the official drink of The Insane Clown Posse (ICP)",
            "Bleh, just ignore them.\n\nUnironically South Park explained it best when it comes to f*ggot, and i say its something to go by.",
            "Mcg-15?",
            "This art very cool, stolen",
            "\"Reddit doesn't like a nearly universal European word for bassoon.\"\n\nStarts with a \"B\", two syllables, we just need to convince the DPRK, (and russia, based on how things are going) to arm all their MIG-15s with bombs.",
            "Its actually the instrument",
            "It the Nato name \"Fagot\" it's one letter off from a derogatory slur for gay people. People from Reddit who didn't know that removed the post because it looks super offensive.",
            "reddit jannie powertripping",
            "'Fagot' is a slur, though the correct spelling as two 'g's instead of one, but Reddit decided it looked similar enough to ban \\*shrug\\*\n\nMaybe add some styles to the text so that Reddit AI isn't able to read it. Like, cut the letters at the middle and shift them a bit to the sides -- enough that they'll still be human-readable while the AI will (hopefully) see two lines of text instead of one.",
            "*i can't tell if it's satire or not*\n\n*I am going mentally zooted*\n\n*Please help*",
            "Praising communism doesn’t get you banned from Reddit so… probably the word f…",
            "To even add people don’t realize there is a rule against politics in this sub, rule 5, so even if you were a communist that doesn’t give the mods a good reason to remove your post since I don’t see any sort of politicly charged messaging in it",
            "I love your style, I just wish it was a Sabre instead of a commie trash plane",
            ">I still can't understand why the art above was removed.\n\nthen why post it again lmao",
            "You're only Caucasian if you're from the Caucasus mountains.\n\nOtherwise you're just sparkling Uralic.",
            "You're going to get questions is all I'm saying.",
            "It's almost like words have nuance, and humans can determine meaning from context, and \"Fuck you, you son of a bitch!\" is the prelude to a brawl, while \"Dillon, you son of a bitch!\" is two old friends bonding over a coming fight against an invisible extraterrestrial hunter.",
            "And add an R",
            "I think it's just the font style OP used, it's probably not a mistake but a design choice",
            "Apparently it is for you because that is very clearly not a Ц. As someone who has used Cyrillic only his entire life I have never seen someone write Ц like that in any font that is actually Cyrillic and not some bs. So yeah bottomline it clearly says МИГ.",
            "It just uses the italicised/cursive version of the cyrillic characters, like a lot of fonts. Idk if it will show up on all systems, but Миг and *Миг* are the same word, but the characters just look different (the italicised/cursive version of и looks more like a u. You can see from the text below that the ц looks visibly different to the и. its not too uncommon in computer fonts and its why you kinda need to at least know the cursive versions of the characters as well.",
            "South Park is epic and smart. Liberal Reddit doesn’t understand that two straight dudes should decide on what slurs are actually offensive to gays😂👌",
            "Erm acshully its the bundle of sticks",
            "Also worth noting it’s pronounced the same",
            "Hard G if you will. /s",
            "If you think it’s a joke, it’s 99% deadpan joke",
            "Because he’s South Korean and isn’t going to back down. \n\n\nThough why he isn’t posting some sweet Saber propaganda, makes me question if he’s not from the North",
            "This is most likely a joke post mate, nothing was removed, tittle is a dead giveaway",
            "Almost all europeans are related to Charlemagne. That makes us all French in some capacity. Fucking disgusting and based at the same time.",
            "You can't spell Caucasian without \"asian\". Also \"cauc\".",
            "*You ever been in a cockpit before?*\n\n*Have you ever been in a turkish prision?*\n\n*Do you like movies about gladiators?*\n\n*Do you hang around gymnasiums?*",
            "I have to rant about this because brain says so.\n\nAbout a month ago I found another youtube channel to fall alseep to; guy named John Sierra, a Tolkien Scholar. Just a dude who loves LOTR so much he read every single word the author ever wrote, and likes to answer lore questions and give readings from the books. It almost feels like secular Bible Study.\n\nSo he's reading the part of Fellowship where they attempt to cross the Redhorn Pass and have to light a campfire by magical means:\n\n> At last reluctantly Gandalf himself took a hand. Picking up a faggot he held it aloft for a moment, and then with a word of command, *naur an edraith ammen*! he thrust the end of his staff into the midst of it.\n\nExcept in the very middle of it, he censors out \"faggot\" and then goes on a rant about how he doesn't want to offend gay people and blah blah blah... and it's just .... the *most awkward and clingiest shit there ever was,* and it's....i can't be mad at the speaker because he's got his heart in the right place but I AM SO FUCKING MAD ANYWAY AAAAAAAHHHH!!!!\n\nIt's like ... partly infantilizing, because it implicitly assumes that I can't tell when i'm supposed to be offended ... it lends credence to right-wing accusations of \"lefty word policing\"..... it even makes *me* all pissed because my logic goes \"If I use this word, I'm going to be ostracized *by my own side*, for using the word that's supposed to insult me, and *I should feel bad about it for my own good*\" so my reasons for not using it are utterly insincere and my emotions are all fucked up and....it feels like ... insincerity? betrayal? something must explain this sick feeling in my gut right now.\n\ni hate everything about this.\n\ne: I'm now angry about stuff on the internet, so I'm gonna go get exercise.",
            "Absolutely atrocious font to use in this context. Didn’t even know they were trying to write the Cyrillic name, thought it was just some lame NCD joke as usual.\n\nThought it was some vagina joke. Muff 15. I don’t fucking know.",
            "A design choice that was a mistake is still a mistake.\n\nForm follows function.",
            "No, South Park is just only piece of media that came to my mind quickly when writing the comment. Somebody surely made elaborate essay on usage and meaning of the word, maybe even in various cultures and socioeconomical groups. I just cant be bothered to go and search it up for comment on Reddit.\n\nThen again i dont live in a country that wages cultural war against itself so theres that. And frankly i am glad i dont.",
            "You are thinking about the word with 2 Gs.",
            "Silence Fagotista",
            "ooerr inactculfact it's the pork ball",
            "I always wondered about that or if it was like french or some shit with half the letters silent.",
            "I’ve always pronounced the plane as Fagoh",
            "It is not.",
            "he's done b-21 Raider and corsair treatments, I'm not questioning",
            "Hey the 15 has a solid look to it, plus the bombastic gold-lined red aesthetic is fun to work with.",
            "Charlemagne was a German who ruled from Aachen.",
            "There was no France during Charlemagne's time. He was born in Austrasia and he spoke Franconian, which is closer to German than anything else.",
            "Karl der Grosse wasn't French.",
            "Shirley, you're not serious.",
            "\"I'm now angry about stuff on the internet, so I'm gonna go get exercise.\"\n\nAt least if the anger regarding Internet idiocy can fuel a work out, then some good can come out of it. There's a silver lining.",
            "The top comment claimed specifically that the mistake is substituting one letter for another, which it isn't. In \"**Ц**\", the \"tail\" goes down below the text baseline. The \"**И**\" in the font style looks like [cursive \"И\"](https://childdevelop.com.ua/doc/images/news/8/835/Propisi_UKR_I_m.png) written in a block letter style, but the letter is still the same.",
            "Erm, aktschually its the plane",
            "Yeah same, I've always pronounced it similar to Peugeot",
            "You misspelled Karl der Große.",
            "One of his sons ruled the Franks tho. So what you are telling me is If I am lucky i am one degree of being french?",
            "Well someone has to initiate the mistake.",
            "But he still sprayed his goo that sprayed its goo all over what is now france. I call that collatoral damage",
            "I am serious. And don't call me SSC-2a *Salish*.",
            "I thought it was pronounced like \"fay goat\"",
            "it might be idk. I kinda just assumed it was French tbh",
            "It is a french loanword, but the pronunciation shifted"
        ]
    },
    "My Minecraft Server is Special": {
        "title": "My Minecraft Server is Special",
        "score": 922,
        "url": "https://i.redd.it/976nol44a08d1.png",
        "content": "Originally Built by *Redacted* on the Server *Redacted*",
        "num_comments": 39,
        "comments": [
            "The cope cage 😭",
            "What tonk is that?",
            "The cope cage with rails is legit. I like the double-footed beds, too. What are the diagonal beams alongside the rails?",
            "This is what men need to feel happy",
            "Has more Blast Resistance compared to an actual Russian Tank",
            "We need an NCD Minecraft server now.",
            "All fun and games until a creeper falls from a phantom",
            "Credits: Build by rika_furude_ on Military Builders",
            "3000 T-80s of Markus Persson",
            "Flans Mod",
            "I love these Minecraft builds where you use every block in an unorthodox way",
            "rail cage",
            "Is it filled with tnt?",
            "Is this textured or pure vanilla (i havent played minecraft since 1.10 so idk)",
            "I can appreciate how long this probably took but it just looks like block vomit. What are the candles supposed to be?",
            "Noooo! Using drones is cheating, guys! 😞😞😞",
            "T-80UD",
            "T-80 by the looks of it",
            "Part of the mod, is my guess.",
            "its all fun and games til you here \"yo bro wheres my diamonds at\" then suddenly you see a mushroom cloud",
            "there's some project that adds trench warfare and artillery and nukes and all that shit. and of course there's some tank and gun mods. that + the industrialization mod (iirc it's called create?) would be peak NCD minecraft.",
            "I second this",
            "Dad is that you?",
            "Yes, the first generation barbecues completely suck.  \nWhy isn't this the latest generation of tactical dirt houses?",
            "I down-vote this comment.",
            "Smoke launchers",
            "I thought UD stood for Utterly Destroyed?",
            "Given that none of the other blocks are modded, I’d guess powered rails and end rods with a texture pack",
            "Minecraft: Congo",
            "Live demonstration of counterforce doctrine or something",
            "There’s create addons that literally allow you to build your own tanks, warships, and aircraft.\nYou can literally become the military industrial complex and the military at the same time",
            "The children yearn for the horrors of industrialized warfare (it’s what all my civ 6 games devolve into)",
            "Oppenminer (if it's ever finished) is peak NCD.",
            "Ultimately Diesel   (russian diesel tanks are real slow)",
            "There are white end rods with candle on top behind that posts. These posts look like darkened version of iron fence with no connections",
            "Maybe he used the debug stick",
            "According to Mental Omega the Chinese nuclear tanks are even slower. For some reason. Now that I think about it I'm not sure why.",
            "Probably iron fence held by a rotated invisible armor stand"
        ]
    }
}