{
    "June 15: Weekly achievement and help thread": {
        "title": "June 15: Weekly achievement and help thread",
        "score": 20,
        "url": "https://www.reddit.com/r/osugame/comments/1dgrhxu/june_15_weekly_achievement_and_help_thread/",
        "content": " For circle clickers new to [r/osugame](https://www.reddit.com/r/osugame/), this is a weekly thread where you can share your latest achievements and have questions answered that don't deserve their own post. If you need help, please first check our [FAQ](https://www.reddit.com/r/osugame/wiki/index), the [osu! wiki](http://osu.ppy.sh/wiki/FAQ), and/or [forums](http://osu.ppy.sh/forum/5) before posting.",
        "num_comments": 47,
        "comments": [
            "gained 1 rank for unknown reason :D im closer to being #1 :3",
            "top 5k ctb this week maybe???\n\nhttps://preview.redd.it/21gd16rq2t6d1.jpeg?width=1170&format=pjpg&auto=webp&s=796d104d628abec01c17a809ec4248ef5b1a0e43",
            "notch hell A rank\n\n[https://osu.ppy.sh/scores/3023478187](https://osu.ppy.sh/scores/3023478187)\n\nyomi yori kyouaku ht pass\n\n[https://osu.ppy.sh/scores/3024010216](https://osu.ppy.sh/scores/3024010216)",
            "I finally found a decent tapping warmup routine that has been working for me the past couple of weeks",
            "hello r/VacSa smp\n\nhttps://preview.redd.it/xtxiyqpsat6d1.png?width=1918&format=png&auto=webp&s=d0fadce3230850ec9472c7b06b50ded415f797c8",
            "My speed/stamina practice is finally paying off.\n\nThis week is gonna be my week",
            "[what are the odds i manage to fc this before 2027?](https://drive.google.com/file/d/1TcUwVH-OC2MxMpIgDmOITJMj9UbCNdA1/view?usp=sharing)",
            "choked new top play 180 pp :(  [https://ordr.issou.best/watch/tDjWCv](https://ordr.issou.best/watch/tDjWCv) \n\n [https://osu.ppy.sh/users/20290985](https://osu.ppy.sh/users/20290985)",
            "https://preview.redd.it/7q2y9212n27d1.jpeg?width=1920&format=pjpg&auto=webp&s=118227ed14339c419d16df9506c0691b810ab14e\n\nMy first 300 after derusting (hoping to get my second ever 400)",
            "Hey, new player looking for advice. I'm having trouble SS maps (especially full length ones) I can S them most of the time, but beat myself up over not being able to SS them. Do you guys have any tips? Currently doing 2.4-2.6 stars\n\nEdit: I think I'm having trouble with rhythm, is there any tips or tricks with that? (Other than play more)",
            "[peaked 800 pp on the same map i peaked 700 the first time... still no 700 :PP](https://clips.twitch.tv/ClearThoughtfulYakinikuFloof-Lr_9KOLf3dPips4s)",
            "[ki ga kurutta noise +dt 6.95* fc for 295pp](https://youtu.be/3nG9DXDe-mM?si=r7rhI_k8C9qL625d)\n\nhonestly still happy with this score regardless of acc since i grinded this map a lot ever since it got ranked, too bad i got mindblock so i got forced to turn off hd which would've made this play worth 300, but i think this is definitely acc fixable tho (i will acc fix my speed plays eventually)",
            "https://preview.redd.it/9qjymcucby7d1.jpeg?width=1920&format=pjpg&auto=webp&s=94ac50ea931ddbbe90abafb7829cbd03737b3f4d\n\ni FINALLY passed the 6\\* through the fire and flames, only took like 110 attempts over 2 years lol :P",
            "hit 5 digit",
            "almost got my 2nd 300pp as a 6 digit \n\nhttps://preview.redd.it/584rkw8hfv6d1.png?width=995&format=png&auto=webp&s=5107077550ce9d47400bb9354256245df8fc01ad",
            "[back at it on the shred machine - hit a devious 600](https://osu.ppy.sh/scores/3003927418). first time i think ive had a B rank in my top 5 in many years",
            "Every thread I check tells me to go to the design tab if I want to add a video or a countdown, but when I check it, this appears. How do I fix it?\n\nhttps://preview.redd.it/8w7lxj5qhx6d1.png?width=317&format=png&auto=webp&s=3fc7a5f07c44557fc739883b26ad67cde2473300",
            "How do I reset all audio offsets on Lazer?\n\nWhen I was last playing I sucked at accing and put audio offset on everything. Now I don't need audio offset and I have to reset the offset on every map as I get to it.",
            "Well, a new trend that's been developing with me is performing as well or better on maps with HDHR than with nomod, which is something I don't really have an explanation for. Today it resulted in a new top play, Ai no Sukima \\[Radiance\\] +HDHR 97.86%, though not one I'm particularly enthused about. Not only is it a piss poor choke at the end, but I usually like to play longer maps with streams and bursts, which always seems to bite me in the ass because I never gain any rank from it, and shit farm maps like these clutter my top scores. It's saddening that the actual scores I'm proud of end up nowhere near my top 10, but sightread chokes on 45-second maps earn me a 219pp top play. I don't even feel particularly bothered to fix acc or even to FC the damn thing because I want to play maps that are fun.\n\n  \nI did get my first real 7\\* pass today though, which is something, because the only reason I got the badge before was for a cheese on some random HP2 map. I got 89% on Highscore \\[Game Over\\], and while it's still a piss-low HP4, I actually had to try to pass it, so that's better than nothing.\n\nHere's the replay of the Ai no Sukima play if you are for whatever reason interested. Please excuse the random 100s this was my first HR attempt: [https://link.issou.best/xcKo7v](https://link.issou.best/xcKo7v)",
            "my cursor sometimes teleports to the left corner despite windows ink being off. Does anyone have a solution to this? My tablet is a wacom CTL4100 btw",
            "new highest SR fc on snow goose https://osu.ppy.sh/scores/3020657082",
            "I just got a tablet and i was wondering if i could install factory drivers(so i can try to use it in digital art). Would this mess with how the tablet performs in osu? For reference not using any drivers besides the ones thats built into lazer",
            "around how long after switching from mouse to tablet should I get used to it and play at the level I was when I switched?",
            "https://preview.redd.it/eu03luzin67d1.jpeg?width=1920&format=pjpg&auto=webp&s=cbcd7354b24e8fb399b81953be6ee48cccbddc64\n\nrandom ahh score i did on kokisu (7 digit on bancho btw)",
            "Fingerlock is a myth created by big magnet to sell more analogue switches",
            "I MISSED THE LAST 2 NOTES OF A MAP AND GOT MY #3 TOP PLAY (+101 ranks)\n\nhttps://preview.redd.it/74bywarrz67d1.jpeg?width=1170&format=pjpg&auto=webp&s=7928f61ade823f7e19a851183f6c5456c29fad2b",
            "Care to share?",
            "just fell to my knees\n\nhttps://preview.redd.it/4phcum9mft6d1.png?width=1920&format=png&auto=webp&s=15f94f103e100386ec21f14bf8034da938b788cb",
            "SSing maps at that range is probably not the best way to improve, rhythms are way too simplified for those maps. Aim for playing higher star ratings and getting FCs.\n\nIf you really just like playing like that for SS then theres no real advice i believe, just listen to the song and maybe turn up hitsound volume",
            "CHOKED 400 ON ASU NO YOZORA HDDT WTF (i just got my first 300 not even 2 weeks ago)\n\n[https://osu.ppy.sh/scores/3033397481](https://osu.ppy.sh/scores/3033397481)",
            "design tab isn't ready on lazer, you'll need to use the stable client",
            "I have that same issue and I think part of it is because hidden to me helps me focus more note per note and makes everything less cluttered. I catch my self looking ahead too much on no mod and get distracted or overwhelmed.",
            "Stream practice 150 - https://osu.ppy.sh/beatmapsets/43701#osu/137126\n\n160 - https://osu.ppy.sh/beatmapsets/241792#osu/558314\n\nSquare practice 180 - https://osu.ppy.sh/beatmapsets/112651#osu/292577\n\nBlend s 180-190 - https://osu.ppy.sh/beatmapsets/859515#osu/2105741\n\negg pain+ - https://osu.ppy.sh/beatmapsets/89799#osu/244486\n\nThis usually gets my single tapping, stream, flow aim, and finger control to a good level if I'm having a longer session.\n\nInspo taken from [Korilak's](https://osu.ppy.sh/users/7260014) guide. It's always taken me forever to get warm but at least this is a more systematic way for me to get to a baseline level.\n\nNote: I'm not a shredder. My comfort deathstream bpm is around 200.",
            "Got it, and by FC you mean like no mistakes A/S?",
            "but the stable version sucks :(",
            "Very possible. I've also been thinking that the AR probably plays a big role as well",
            " ❤ [Various Artists - Stream Practice Maps](//osu.ppy.sh/s/43701 \"Loved\") ❤  by [NewRulerNA](//osu.ppy.sh/u/605540) *([⬇](//osu.ppy.sh/d/43701 \"8 Standard diffs (4.55-6.49★)\"))*\n\n[t+pazolite with siromaru - Chambarising \\[Stream Practice (160)\\]](//osu.ppy.sh/b/558314 \"Graveyard\") by [Bloodmoon](//osu.ppy.sh/u/2429548) *([7.62★](//osu.ppy.sh/d/241792 \"CS4.3 AR9.5 OD6 HP1\n4:49 (4:00 drain)\n160bpm\"))*\n\n ❤ [Various Artists - Square Jump Practice Maps](//osu.ppy.sh/s/112651 \"Loved\") ❤  by [Jemmmmy](//osu.ppy.sh/u/1921587) *([⬇](//osu.ppy.sh/d/112651 \"8 Standard diffs (5.18-7.63★)\"))*\n\n ❤ [K A Z M A S A - Bon Appetit S (Oldskool HappyHardcore Remix) (Short Ver.)](//osu.ppy.sh/s/859515 \"Loved\") ❤  by [BarkingMadDog](//osu.ppy.sh/u/3475189) *([⬇](//osu.ppy.sh/d/859515 \"11 Standard diffs (5.79-9.19★)\"))*\n\n ❤ [ParagonX9 - Chaoz Fantasy](//osu.ppy.sh/s/89799 \"Loved\") ❤  by [onlyforyou](//osu.ppy.sh/u/597858) *([⬇](//osu.ppy.sh/d/89799 \"4 Standard diffs (6.01-7.33★)\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "FC (Full combo) is when you don't miss and don't sliderbreak during a run, sliderbreaking is when you miss the head of the slider (the part where you click the slider) but still follow the slider\n\nAnd a PFC (Perfect full combo) is when you get the maximum combo on a map, meaning you didn't drop any sliderends (the ending of the slider, which if you let go off the slider too early, even if you clicked the sliderhead, will result in a 100 because you didn't follow it to the ending)\n\nMost people will tell you to focus on playing maps you can get 95% or higher acc, this should be pretty good advice for now since you are still playing 2* maps",
            ":(",
            "Got it thank you so much!   \nI'm currently just doing songs I like, but what are ways to find some more songs other than the beatmap listings? Maybe genre based?",
            "https://osucollector.com/\n\nhttps://osu-atlas.ameo.dev/ (cool vizualization that also helps you find some maps)\n\nYou can also download beatmap packs in the osu website or if you want larger ones you could search for them on google\n\nI recommend going to the website and sorting maps by most played and downloading as many as you can, they have some famous songs among rhythm game communities and some pretty good maps too\n\nOverall just go around downloading anything you find interesting, for me the hardest part of osu when starting was getting into the music, I didn't watch anime nor liked japanese stuff so it was a little overwhelming.\n\nKeep in mind 1-3* maps are pretty standardized, they won't be much different from eachother in terms of patterns or structure but you still need to play alot of them to build your fundamentals, this ends up being a good thing in the end because you can just play the songs you like without worring about the map being bad",
            "Thank you for the tools!   \nI listen to a decent amount of japanese songs, but a lot are missing, so this tool would def help with that. I also just want to get better so I can play the songs I like at higher levels.   \nI'm definitely the opposite of you in terms of music choices, I didn't know there was a lot of genres of music, and found out recently from the multiplayer section. \n\nThank you!",
            "Last thing i ask you is to watch this video: https://youtu.be/qUkvt8DThQc?si=oJR6TzpeSWLh_tmn its a guide on most basics and will help you clear some confusion you might have, i watched it when i was starting like a year and a half ago and its pretty good.\n\nHeres my profile if you want to add or call me some other time https://osu.ppy.sh/users/17445788\n\nGood luck!",
            "I'll watch that video. Thank you so much for the help! Just followed you.",
            "Just realised you are the same guy i replied in another weekly thread like a month ago lol\n\nCould you also link your profile so i can add you?"
        ]
    },
    "June 2024: Monthly mapping thread": {
        "title": "June 2024: Monthly mapping thread",
        "score": 19,
        "url": "https://www.reddit.com/r/osugame/comments/1d5wqiz/june_2024_monthly_mapping_thread/",
        "content": "Hello everyone! We know a lot of people want certain songs to be ranked, and a lot of others also want their maps to be played. We decided that every month, a monthly thread for you guys to make requests and ask for feedback will be made! The threads will be stickied as often as possible throughout the month. Also, go check out r/osumapping for feedback or help on your maps at anytime!",
        "num_comments": 25,
        "comments": [
            "Can someone create a 2 star with only rthtmically spaced triples if they can?I want to overwrite my miscle memory of triples and tried out nearly all suggestions in this world and this is my last resort.",
            "Made a copy of Log Off Now's lucky dochy kinda\nhttps://osu.ppy.sh/beatmapsets/2193748",
            "This is actually a sick concept! Not mapping as off late since I'm studying for my finals but I will def post things here when I can.",
            "Needing some help with charting. Making a chart of the song \"Caprice for If\" by Frums, and this part that I'm charting only really has one instrument I feel like I can chart. Trying to get the song to be at least a 4.5, though I don't mind it going down. This portion of the song is fast, and when I've tried charting it other ways it either feels way too easy or way too difficult. I'm also very new to making charts, and this is my very first one so I can definitely understand if it's just because I don't understand charting lol. Couldn't send a video so I'm sending a link to it instead. If wanted, I don't mind to send the chart. [https://drive.google.com/file/d/1lNZ8ngWi9ELnUMDJE\\_T\\_AhEAigwzKC77/view?usp=sharing](https://drive.google.com/file/d/1lNZ8ngWi9ELnUMDJE_T_AhEAigwzKC77/view?usp=sharing)",
            "[https://streamable.com/t6qb4n](https://streamable.com/t6qb4n) how do i emphasise the weird vocal synth in the back while also covering the vocals without using the ctrl-g gimick like in the beginning?\n\nedit: [https://drive.google.com/file/d/1b0bkZWX2eIMqdCvbP4RTgIZw6ljvAs5W/view?usp=sharing](https://drive.google.com/file/d/1b0bkZWX2eIMqdCvbP4RTgIZw6ljvAs5W/view?usp=sharing) i decided to ignore the vocals and emphasize the drums",
            "new map.. it's really uminekocore https://osu.ppy.sh/beatmapsets/2192759#osu/4638566",
            "this month will be my month",
            "Hello, I recently started working on my first ever map and would like to get some feedback from people that know more than I do about mapping. I have never touched the map editor before this so I am sure that there's a lot wrong. Any feedback is appreciated. \n\nMap link: [https://osu.ppy.sh/beatmapsets/2199567#osu/4654951](https://osu.ppy.sh/beatmapsets/2199567#osu/4654951)",
            "Can anyone help me with new beatmap Twenty One Pilots - Navigating? I've done only one difficulty 2.16* If I will create beatmap all alone, I think it will take really long time, so I am calling for help. (Thanks in advance if you at least read it. I won't mind even just a review of my map. Nickname in osu: SpeedTheFox) ",
            "made lower effort boshyman magic girl type aim control and reading map of an old meme song from late 2016\n\n[https://osu.ppy.sh/beatmapsets/2195351#osu/4645076](https://osu.ppy.sh/beatmapsets/2195351#osu/4645076)",
            "Hi everyone! Made a new map, looking for mods. Would be very grateful if somebody will check it out! [https://osu.ppy.sh/beatmapsets/2188731#osu/4628939](https://osu.ppy.sh/beatmapsets/2188731#osu/4628939)",
            "new map.. it's really touhoucore\n\nhttps://osu.ppy.sh/beatmapsets/2199775#osu/4655430",
            "*[Chimame-tai - Nakayoshi! Maru! Nakayoshi! (TV Size) \\[Coffee\\]](//osu.ppy.sh/b/4640938 \"WIP\")* by [Caiaomilgrau](//osu.ppy.sh/u/17445788) *([7.05★](//osu.ppy.sh/d/2193748 \"CS3.8 AR9.8 OD9.8 HP5\n1:26 (1:26 drain)\n248bpm\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "*[zts - miragecoordinator \\[Voyager\\]](//osu.ppy.sh/b/4638566 \"Pending\")* by [Doomsdaddy](//osu.ppy.sh/u/5039710) *([5.01★](//osu.ppy.sh/d/2192759 \"CS4 AR8.7 OD8.2 HP4.7\n5:28 (5:07 drain)\n150bpm\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "nvm",
            "just played it and theres a lot to say but i guess one thing thats worth noting is it feels like what you map doesn't represent what the song says.  (like theres a sound between 6 and 7 at 3 seconds that isnt mapped)\n\nit also isn't timed properly which is pretty important to do first  \nif u want any more suggestions lmk",
            "*[Salem - Salem - Fall Out of Love (Official Audio)](//osu.ppy.sh/s/2199567 \"WIP\")* by [Nanoboosterr](//osu.ppy.sh/u/28577796) *([⬇](//osu.ppy.sh/d/2199567 \"2 Standard diffs (7.77-7.77★)\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "[https://osu.ppy.sh/beatmapsets/2190353/discussion/-/generalAll#/4398812](https://osu.ppy.sh/beatmapsets/2190353/discussion/-/generalAll#/4398812) ignore the yap i just like typing",
            "*[Yeah Yeah Yeahs - Heads Will Roll (JVH-C Remix) (Cut Ver.) \\[DEEZ YEEZYS LIT 100 BOI :OK&#0095;HAND: :FIRE: :FIRE: :FIRE:\\]](//osu.ppy.sh/b/4645076 \"Pending\")* by [Jarran](//osu.ppy.sh/u/11417993) *([7.59★](//osu.ppy.sh/d/2195351 \"CS4 AR8 OD9.5 HP3\n1:14 (1:09 drain)\n155bpm\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "*[Ave Mujica - Symbol I : Fire \\[The rosario burns as the flames roar\\]](//osu.ppy.sh/b/4628939 \"Pending\")* by [Kumeri](//osu.ppy.sh/u/15273979) *([9.06★](//osu.ppy.sh/d/2188731 \"CS3.8 AR9.8 OD9.4 HP5\n5:07 (5:01 drain)\n236bpm\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "*[Para Dot. - Banki-chan wa Choushi ni Noritakute Shikataganai \\[Rokurokubi\\]](//osu.ppy.sh/b/4655430 \"WIP\")* by [Doomsdaddy](//osu.ppy.sh/u/5039710) *([7.36★](//osu.ppy.sh/d/2199775 \"CS3.5 AR9.7 OD9.4 HP5\n5:01 (4:44 drain)\n256bpm\"))*\n\n***\n^(hover over links for details) ^| [^(source code)](//github.com/mcpower/beatmaplinker/) ^| [^(contact dev)](/message/compose/?to=mcpower_)",
            "im proud of you for coming out, i know it's not easy",
            "The timing is something that did feel a little off. How do I make sure it’s timed properly? How will I know when the timing is correct?",
            "at the bottom right theres a Playback Rate option, you can set it to 25% and use that to listen to prominent beats. for timing, pishifat has a really good (old but not outdated) video on it [https://www.youtube.com/watch?v=xauZuMPgiQw](https://www.youtube.com/watch?v=xauZuMPgiQw)\n\na lot of pishifats videos are good for learning to map ( [https://www.youtube.com/watch?v=oL3az8FhlB4&list=PLp7-THR1EUHERrIOV4dGClCGGoLIrQtOx](https://www.youtube.com/watch?v=oL3az8FhlB4&list=PLp7-THR1EUHERrIOV4dGClCGGoLIrQtOx) playlist) so u can watch those if u wanna learn more",
            "Thanks so much I’ll watch these videos and see what improvements I can make."
        ]
    },
    "ninerik admits to cheating.": {
        "title": "ninerik admits to cheating.",
        "score": 801,
        "url": "https://i.redd.it/slw6u58bw08d1.png",
        "content": "",
        "num_comments": 40,
        "comments": [
            "https://preview.redd.it/4cdn49pzy08d1.jpeg?width=720&format=pjpg&auto=webp&s=55fe8f169ff26a82b239cd5ac2b5b99363adcdb4",
            "I can't believe he uses RAPID TRIGGER and osu support hasn't done anything so far, when is he getting restricted and exiled?????\n\nThis is outrageous, never expected this from him",
            "check him hold times",
            "I saw u/Melodic-Time7449 watch u/Victiouss fall to their knees",
            "I saw u/Victiouss fall to his knees",
            "Ain't no way I just saw u/Unfirings watch u/Comfortable-Chip-740 watch u/Melodic-Time7449 look at u/Victiouss fall to his knees",
            "bruh what the hell happening just saw u/Comfortable-Chip-740 watch u/Melodic-Time7449 look at u/Victiouss fall to his knees",
            "That's wild I just saw u/Amissed watch u/hiderin watch u/Unfirings watch u/Comfortable-Chip-740 watch u/Melodic-Time7449 look at u/Victiouss fall to his knees",
            "My day is ruined",
            "im crying and shitting rn how could he do this",
            "i havent been in the osu  community for some time is this actually considering cheating or just irony XD i remember when wooting came out pretty much every top player tried/used it and they got better at speed",
            "That's wild I just saw u/hiderin watch u/Unfirings watch u/Comfortable-Chip-740 watch u/Melodic-Time7449 look at u/Victiouss fall to his knees",
            "That's wild I just saw u/mirka-tut watch u/Amissed watch u/hiderin watch u/Unfirings watch u/Comfortable-Chip-740 watch u/Melodic-Time7449 look at u/Victiouss fall to his knees",
            "ok now whos the best speed player who isnt cheating",
            "i cant believe this",
            "I'm out of the loop here, been getting back to osu after 3 year break. Why is it cheating using rapid trigger? It's amazing for fps titles but I hadn't considered it for osu. It doesn't automatically stream does it?",
            "Congratulations, now go back to fanboying over aetrna... Oh wait, aetrna and mrekk also probably used rapid trigger /j",
            "perfect title, 10/10, no notes.",
            "When will it end",
            "No way I just watched u/Amissed watch u/hiderin watch u/Unfirings watch u/Comfortable-Chip-740 watch u/Melodic-Time7449 look at u/Victiouss fall to his knees",
            "Bro 0.5 mm rapid trigger is barely rapid trigger at all",
            "Since when is using rapid trigger cheating? You still have to make the input?",
            "i think we should keep using this ss til the end of time",
            "/s",
            "Holy shit its 727 ms hold time consistently no way hes cheating 😲😲😲",
            "Yeah I'm in the same boat as you lol, I have no idea what's going on.",
            "It's a joke, there is a setting in wooting called dks which is cheating, and some people started comparing rapid trigger with dks",
            "rapid trigger is allowed, but ninerik was one of the few speed players that weren't using it until now, that's the joke of this post",
            "Poor guy was just asking lmao",
            "Yeah just checked. Using rapid trigger is 100% not considered cheating? Was this post supposed to be satire?",
            "ok grandpa time to go back to the overwatch subreddit",
            "Yes",
            "What? I’m confused a simple google search shows it’s not cheating",
            "Ever heard of a thing called a joke?",
            "Is the joke that rapid trigger isn’t bannable?",
            "Ok seems like no one wants to explain. The joke is that Ninerik does not use rapid trigger for most of his plays before. Now that he does, everyone is surprised ahaha",
            "Ohhhhh ok lol"
        ]
    },
    "There are now 10x more speed 1.4k than aim!": {
        "title": "There are now 10x more speed 1.4k than aim!",
        "score": 270,
        "url": "https://i.redd.it/x26ga198t18d1.jpeg",
        "content": "The only true aim map here is Space Battle 1xSB. If anyone wants to argue otherwise please let me know, thank you.",
        "num_comments": 38,
        "comments": [
            "space battle is like 50% aim 50% speed too, probably most of the pp from the stream parts anyways",
            "damn that's a lot. i think we need to nerf aim",
            "these aim players are so dog man imagine one man carrying the entire skillset🗣️🗣️🗣️",
            "Where is the cloutiful 63 ms play 😡",
            "votd is least aim (28.7%) and space battle is most aim (44.3%)",
            "BUFF AAAAAAAIIIMMMM IM SICK OF SEEING A FUCKING 9 STAR FULLSCREEN JUMPS TV SIZE MAP GIVE BARELY 800PP MEANWHILE SPEED IT GIVES FUCKING 1200 NERF THAT SHIT PLEASE",
            "I only see 5x more speed 1.4k than aim",
            "I did not know there was an aim 1.4K, I put space battle under speed and the closest we got was that tuyu map which I am not going to spell out",
            "Ehh we should nerf aim tbh",
            "I'd say Mrekk's Save Me is another \"aim\" map, at the very least it requires more aim than other options",
            "So uh mildly unrelated question, unless im missing something how is a 2 miss A rank on a 9.82\\* with DT worth more pp than a higher accuracy perfect combo +HD 10.05\\*",
            "wysi",
            "What's a \"PC\"? Perfect combo with sliderbreaks only?",
            "whats the sheet called for all of the top pp plays?",
            "this is a fun comparison but it's not as if aim isn't present in most of these maps either\n\nvalley of the damned, azul remix and snow goose are primarily stamina maps but especially the latter two have quite significant flow aim checks as well\n\nflight of the bumblebee is arguably primarily flowaim & accuracy, for the speed arguments it's \"only\" 260 bpm stamina which pales in comparison to the bpm of pretty much every other speed map this high up in pp/sr\n\nrat race/tsumugishi mono still have significant aim checks (iirc rat race already pushes 900pp before any of the streams hit) and you can't underestimate how hard 350/375bpm streams hit when everything else is like 300 at most\n\nand sidetracked day is sidetracked day, while it's obviously a big tapping check i don't think you can call it \"just speed\" when the circles don't even overlap at the highest spacing",
            "New rework promotes pp on lower acc from high bpm death streams , hope you enjoy the rework",
            "i thought so too so i had to watch it again and jumps are fucked up, speed players trying that map is like monkeys typing Hamlet",
            "how do you measure aim in percentage? really curious",
            "which is the second aim play",
            "You mean Anoyo-iki no bus ni notte Saraba?",
            "The あの世行きのバスに乗ってさらば disrespect is crazy",
            "Sidetracked day is \"aim\" map bro",
            "length bonus probably",
            "no sliderends missed",
            "I think he means aim, not flow aim",
            "yes the pp devs are evil and want to take our children so true and so true",
            "space battle has like 2 fiery rage 1-2 jump patterns that literally any top 100 player can hit, it’s mostly the fked up triples towards the middle (finger control) + the crazy streams at the end.",
            "i thought so too so i had to watch it again and streams are fucked up, aim players trying that map is like monkeys typing Hamlet",
            "[aim pp / (speed pp + aim pp)](https://pp.huismetbenen.nl/rankings/topscores/live)",
            "There are only 5 speed 1.4ks in this photo",
            "Oh true had forgotten about that",
            "any player that's not mrekk trying that map is like monkeys typing Hamlet",
            "oh so pp score calculates as aim pp + tap pp + acc pp? cool",
            "flight of the bumblebee is only 600 combo",
            " especially the triple spam sections idt anyone else has the control for that to hit as consistently as mrekk",
            "+ flashlight pp if used",
            "Based on this website https://pp.huismetbenen.nl/rankings/players/live\nPP including three part which are aim tapping and acc.",
            "His acc is honestly crazy. He SSed the whole part in the beginning"
        ]
    },
    "ninerik | SHK - Flight of the Bumblebee (RST Classic) [Luscent's Extra] +HDNCHR (Riana, 10.05*) 97.49% FC #3 | 1404pp | HIS 1ST 1.4K PP!!!": {
        "title": "ninerik | SHK - Flight of the Bumblebee (RST Classic) [Luscent's Extra] +HDNCHR (Riana, 10.05*) 97.49% FC #3 | 1404pp | HIS 1ST 1.4K PP!!!",
        "score": 1031,
        "url": "https://i.redd.it/3ex2onkojz7d1.png",
        "content": "",
        "num_comments": 131,
        "comments": [
            "#### [SHK - Flight of the Bumblebee (RST Classic) [Luscent's Extra]](https://osu.ppy.sh/b/4614397?m=0) by [Riana](https://osu.ppy.sh/u/1997633 \"93 ranked, 0 qualified, 0 loved, 21 unranked\") (GD by [Luscent](https://osu.ppy.sh/u/2688581 \"59 ranked, 0 qualified, 3 loved, 51 unranked\")) || osu!standard\n**#1: [aimbotcone](https://osu.ppy.sh/u/12952320 \"21,118pp - rank #8 (#1 DE) - 97.64% accuracy - 178,170 playcount\") (+HDNCHR - 98.80% - 1,489pp) || 672x max combo || Ranked (2024) || 41,140 plays**\n\n|         | CS  | AR  | OD   | HP | SR    | BPM | Length | pp (95% &#124; 97.49% &#124; 98% &#124; 99% &#124; 100%)  |\n:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:\n| NoMod   | 4   | 9.2 | 8.3  | 5  | 6.28  | 175 | 01:15  | 222 &#124; 250 &#124; 258 &#124; 277 &#124; 298           |\n| +HDNCHR | 5.2 | 11  | 11.1 | 7  | 10.18 | 262 | 00:50  | 1,304 &#124; 1,405 &#124; 1,430 &#124; 1,497 &#124; 1,569 |\n\n| Player                                   | Rank                 | pp     | Accuracy | Playcount | Top Play                                                                                                                                                                                                       |\n:-:|:-:|:-:|:-:|:-:|:-:\n| [ninerik](https://osu.ppy.sh/u/10549880) | #5&nbsp;(#1&nbsp;NO) | 22,354 | 98.75%   | 170,559   | [SHK&nbsp;&#x2011;&nbsp;Flight&nbsp;of&nbsp;the&nbsp;Bumblebee&nbsp;(RST&nbsp;Classic)&nbsp;[Luscent's&nbsp;Extra]](https://osu.ppy.sh/b/4614397?m=0) +HDNCHR&nbsp;&#124;&nbsp;97.49%&nbsp;&#124;&nbsp;1,404pp |\n\nYouTube links: [[1]](https://youtu.be/6pcUMG_bv3M \"'ninerik (10.05⭐\\) SHK - Flight of the Bumblebee (RST\\) [Luscent's Extra] +HDNCHR 97.49% FC | 1404 PP' by 'osu! replays'\") [[2]](https://youtu.be/Y8JM8Cp7-SE \"'🔴 10.1⭐ ninerik | SHK - Flight of the Bumblebee [Luscent's Extra] +HDNCHR 97.49% FC #3 | 1404pp' by 'cpol'\")\n\n***\n\n^(imperial dead bicycle lol – )[^Source](https://github.com/christopher-dG/osu-bot)^( | )[^Developer](https://reddit.com/u/PM_ME_DOG_PICS_PLS) [&nbsp;](http://x \"Beatmap: Found in events\nosr2mp4-mods: +HDNCHR\")",
            "this is wizard tower for speed players but on steroids",
            "This is legit most broken map since zan'ei",
            "brazil was the problem…",
            "SKIPPED 1.3K WHAT",
            "Crazy that the biggest speed farm of 2024 so far is a  luscent diff lmao.",
            "ok we can nerf flow aim now",
            "Modern d.m.c",
            "And we thought snow goose was the broken one.",
            "everybody out here getting 1.4ks lifeline is so fucked",
            "Map with most 1.3k+ pp's on it?\n\nhttps://preview.redd.it/k0srskyknz7d1.png?width=1158&format=png&auto=webp&s=7132201abffebc502c64784a40dd81e9da14c646",
            "DID HE JUST FUCKING SKIP 1.3K",
            "r/flightofbumblebee",
            "Is this 1.3k skip?",
            "non rt pp record???\n\nedit: ninerik infact used rt, https://x.com/ninerik_/status/1804303905070657837",
            "HE GOT 1.4K WITH SPUNCHBOP TAPPING",
            "[**replay**](https://link.issou.best/F7tVFA)\n\n---\n  ^(rendered by [o!rdr](https://ordr.issou.best/) | [Report issues](https://www.reddit.com/message/compose?to=u/allehS&subject=1dldxud:4643813396:https://link.issou.best/F7tVFA))",
            "MY GOAT 🐐",
            "nerf aim",
            "This is just a theory but I think the map is broken because the circular patterns are slightly spaced and have a lot of notes, which tricks the system into giving more flow aim pp. If what I’m saying is true this could be as broken as Zanei and needs to be fixed.",
            "OMG",
            "Everyday 1.4k meta",
            "This map is like the tutorial mission where you get a really OP car and race against the cops and win to show you how cool the game is, and everyone can do it",
            "doesn't use rapid trigger so i respect more (what tapping with dominant hand does to a man)",
            "I think we should nerf aim and unrank pika girl",
            "[Replay](https://www.youtube.com/watch?v=6pcUMG_bv3M)",
            "[Stream VOD link](https://www.twitch.tv/videos/2178006518?t=1h10m42s) at ~1h 10m 42s\n\n^[Source&#32;code](https://github.com/afk31337/reddit-osu-twitch-vod-bot)&#32;|&#32;[Message&#32;creator](https://www.reddit.com/message/compose?to=u/afk1337&subject=RE:t3_1dldxud)",
            "[https://youtu.be/Y8JM8Cp7-SE](https://youtu.be/Y8JM8Cp7-SE)",
            "Yo wtf",
            "Unfathomable Check:  \nThe 9th (legit; 12th overall) person to do so.\n\ngoink (Oct. 27th, 2020 pre-rework)  \nOliri (Jan. 15th, 2022 pre-restricted)  \nTheMagicAnimals (May 30th, 2022)  \n----------------------------------------  \nmrekk (Feb. 24th, 2023)  \nZoomer (May 24th, 2023)  \nAkolibed (Oct. 8th, 2023)  \nlifeline (Dec. 21st, 2023)  \nIvaxa (Mar. 8th, 2024)  \nSytho (Apr. 2nd, 2024)  \nclowntiful (Apr. 18th, 2024 pre-restricted)  \naimbotcone (Jun. 19th, 2024)  \nninerik (Jun. 21st, 2024)",
            "Rework surely",
            "Brazil speed edition",
            "Mouse pp record",
            "800 upvotes 1.4k",
            "mouse pp record yipe!!!!!!!!!!!!!!!!!!",
            "Every speed player bout to be dick riding this map so hard",
            "1.4k bargain sale",
            "MY SPEED GOAT :D",
            "I sense a rework is on it's way",
            "the speed come back is real",
            "someone needs to fc wizard's tower dthr, two people one missed",
            "Can you explain using Yu-Gi-Oh! terminology?",
            "Epitaph:",
            "nerf aim again….",
            "Should’ve skipped 1.4 by fcing valley of the damned",
            "knowing how to map every style means that you also know how to map meta farm 🐐",
            "idk man luscent has been mapping dt 500-700pp maps for the last few years he's just gone up a bit in difficulty",
            "Would it be bad of me to say I only want high BPM flow aim hard nerfed, while lower BPM stays *somewhat* as is, or is that the general idea? Because HR flow aim really just kinda dies once you get to +900pp aside from Epitaph. Maybe it's the lack of maps, or because the skillset isn't played as much, but most HR +900pp right now is just 1-2 people on a few maps. And I feel they're typically balanced fairly.\n\nI could get into nomod flow aim at a mid tier level being broken, but its just a reddit thread and I feel that's more just an \"aim sucks + length bonus is weird\" issue than anything. Just my opinion though.",
            "not for at least one more year",
            "Speed*",
            "Real asf",
            "I mean like its def “broken” but its broken for the 2 players in the game that can deathstream 300 bpm while flow aiming so . like . ",
            "it is, this is just the 263bpm version\n\n\nwe just need someone to step up",
            "Until the day of reckoning…. 100 1.8k’s in only a day.",
            "Yes",
            "Yes, not non wooting pp record tho",
            "Most probably, everyone else uses rt",
            "And mouse?",
            "you are literally just describing a stream",
            "enkan is the same yet noone farms it, curious",
            "see also: slider top diff",
            "Gnahus top 4 and still no 10 star because he's an aim player in speed oriented economy",
            "come back from what???? lmao",
            "Sadly it is pisslow for the one guy who could pretty easily do it",
            "Make a bounty for whitecat 🤑",
            "Pot of Greed levels of broken",
            "epitaph is broken as fuck but atleast people are just getting 1ks with it and not 1.4ks",
            "cant wait for mrekk team magma to be worth 800pp",
            "What’s the difference between Valley of the damned and valley of the vale?",
            "I think part of the problem with low bpm flow aim is also that there just arent songs that can justify 1200pp+ spaced streams at 190bpm and get ranked. So players need to push bpm instead of aim control to climb the rankings, the people who are technique capped at ~200 just stagnate forever.",
            "Ima be real. No matter what low bpm flow aim is extremely fucking easy.",
            "flow aim + speed*",
            "Only 1 person now lol",
            "Our Savior shall prosper",
            "No. Akolibed uses a drunk deer",
            "So ninerik has a wooting with rapid trigger disabled?",
            "https://preview.redd.it/lk5491muc08d1.jpeg?width=1290&format=pjpg&auto=webp&s=2b1d9ac36f66527321919a511baad3fe8d613d8c\n\nSame guy who farmed this map. But you’re right no one touches enkan. It’s just not the wave/ popular thing to do",
            "you dont remember? its was like a week ago when he was shitting out 3 mod fiery scores. please see a therapist",
            "It's pretty easy for the other guy that can do it but refuses to play DT",
            "you don't believe in the FREDDIE BENSON SWEEP",
            "that doesnt mean its more broken lmao",
            "2 different maps",
            "Definitely true, which is why I never said they should be buffed. I think they are mostly weighted fairly. Just if anything, we shouldn't nerf All Of Flow Aim because 170-220 BPM +HR streams have nothing to do with the speed meta.\n\nIt's late and I don't remember when the speed buff released, but I swear most lower BPM flow aim maps stayed around the same value both before and after speed buff anyway. Sidetracked Day HDHR is still high 900, Songs Comp is still around 1000pp etc.\n\nWould gladly have my memory refreshed on all of that, honestly",
            "Agree to disagree. Every skillset has their set of easy farm, and I could easily point you to tons of low BPM flow aim maps that would be very hard, just as I can with any skillset. I can also point to DT farm that gives 900-1000pp, and these often share a similar amount of FCs to the 900-1000pp HR flow aim maps.\n\nMy thoughts are that devaluing a skillset to its lowest point of farm is completely biased and ignores any actual effort that someone might put into their skillset. People have honestly become kinda toxic towards flow aim in recent times due to speed meta, and its just sad to see. Same thing happened with aim back in the day, and it wasn't any more fun then.\n\nUnless you're a top player, there's no chance you are HDHR FC'ing Sunless Dawn, Sayonara, Inside the Winter Storm, Road of Resistance, or any of the other 900-1000pp flow aim maps, and there's a reason most of these only have a handful of FCs. That's just my opinion, though.",
            "flow aim + speed + od11 scaling on simple rhythm maps*",
            "Nah just speed. Flow aim is a scapegoat. ",
            "Akolibed on a good day:",
            "Aetrna if lesbians didn’t exist",
            "So?",
            "Yeah, i think sometimds he enable it for 300bpm (not sure about this fact)",
            "He's addicted to maimai rn. I would know because im a REAL freddie benson fan that keeps up to date with my 🐐 unlike you.",
            "Broken but at a lower level, meanwhile Zan'ei was broken at mid and high level",
            "Which one did Accolibed get 1500pp on?",
            "flow aim + speed + od11 scaling on simple rhythm maps + lenght bonus*",
            "raw speed is fine. speed combined with flow aim is the culprit imo because it assumes similar flowaim to lower bpm is harder at higher bpm, which is simply not true",
            "Speed with no spacing is barely worth anything",
            "How did i forget akolibed",
            "Akoli's top play is 1711 which was not on a wooting",
            "That’s like lowkey cheating but not rules breaking, just smart",
            "he says it's a better game but still streams osu. probably cause a maimai stream would be a mess",
            "zan ei was broken because pp system legit was bugged or someshit epitaph is broken because of length bonus and flow aim this map is broken because speed and flowaim",
            "Nah Zan'ei is broken on every level, from nomod to HR to DT",
            "Valley of the damned",
            "cumming on fumos buff*",
            "So flow aim is fine and speed is broken...? You're literally saying \"x mechanic isn't broken then when you add speed it's broken\" Glad we agree. ",
            "Rog. Valley of the damned. ATH",
            "Why, he can stream 300bpm just as normal without rt why would it be cheating",
            "Not really a bug, it was more of an abused oversight? Watercolor was a real bug.",
            "Yeah and",
            "and dthr too wasnt mrekk gonna get like 1600 on it",
            "yes but I was talking player range, don't think most 6 -low 5 digits could get that much from it, meanwhile the present map is targeted to high end players",
            "So they’re both speed farm maps?",
            "Remember back in 2018 when flow was giga broken because it assumed it was mega high speed aim or something. Well flow STILL adds to speed pp. Theyve never been able to seperate it yet.\n\nAnd THATS the problem. I just hope whenever its fixed they dont nuke flow completely.",
            "no, I said raw speed is (majorily tbh) fine. Flowaim adds to speed difficulty which makes speed seem overweight, but its just the combination of flowaim and speed that produces such high pp values. Take aetrna's ATH as raw speed score. Imagine how much pp it would give if it were more spaced like usual farm maps. Still no one comes even close to his score on it because raw speed without quick flowaim pp boost is already hard as it is",
            "rog is only worth something because its abuses ar11, valley of the darned is a length abuse map, and ath is just Damn Unfarmable for everyone but 2 people",
            "Rog is only farm because it's OD7 and you can still get 96% acc while doubletapping and barely get any acc penalty for it, with 3 mod there are exactly 2 (legit) players who can farm and get pp out of it, same goes with ATH which is not farm at all",
            "Ath Is kinda underweighted don't lump it in between those two",
            "I know he can stream 300bpm normally, but enabling rapid trigger for that bpm might give him an advantage right?",
            "What are you talking about 💀 Many 6 digits can fc zan'ei.",
            "votd is not farm lmao there’s a 96-note 300 bpm deathstream 4 minutes in, votv is 285 bpm cutstreams and the map is half as long",
            "As if wvery map doesn't abuse something 🤯. Flow aim, length, ar11, od11 whatever. The common factor is always speed.",
            "rog is only farm because high bpm streams are overweighted. fixed that for u",
            "rt doesn't make you stream faster, it just prevents from failing immediately from fingerlockings and saves stamina",
            "correction: many \"\"6 digits\"\" can fc zanei",
            "Votd is the single 96 note stream and it gets 2000 notes of length bonus, it is farm",
            "There isn't a single cutstream in votv, stop saying words you don't understand it makes you look dumb. Both maps are farm for different pp ranges, ofc votd is harder than votv but it also gives 300 more pp",
            "yea the point is that none of those maps are actually getting its pp from speed like it doesnt take a super genius to see that very few people actually farm pure speed maps compared to random permazoomer spawns 1 tapping flow speed farm maps",
            "I never meant it would make him go faster, I meant having an advantage on stamina or finger control actually",
            "by your standards a pure speed map is literally a stacked 1000 note stream in one spot where you put your cursor there then take your hand off your mouse. Any aim, flow, od, ar, length literally anything in the game \"OH SPEED ISNT BROKEN LOOK!\" bro its broken. stop",
            "rt absolutely does not give an advantage in finger control"
        ]
    }
}