{
    "Very pretty Bleeding tooth fungus, it is not toxic but not eaten very much because it is so bitter.": {
        "title": "Very pretty Bleeding tooth fungus, it is not toxic but not eaten very much because it is so bitter.",
        "score": 6589,
        "url": "https://i.redd.it/thrw30xal18d1.png",
        "content": "",
        "num_comments": 248,
        "comments": [
            "That’s straight outta Alice in Wonderland….",
            "\"Why's it so bitter?\"  \n\n\"It doesn't get eaten very much.\"",
            "Who else here wants to pop the red bubbles and see what comes out?",
            "The fact that someone even tried it to figure out if it was toxic or not is terrifying. \n\nNot a lot of foods say ‘don’t eat me- poison!’ nearly so loud.",
            "Forbidden Jelly Belly",
            "Wowza!! So pretty but yeaaaaahhhhh I wouldn’t try eating it 😚",
            "That is one of the most toxic looking things I’ve ever seen",
            "Thanks I hate it",
            "If not dessert, then why dessert shaped?",
            "Found in North America, mostly in the Pacific NW, some places in Europe\n https://en.m.wikipedia.org/wiki/Hydnellum_peckii",
            "Ice cream in refrigerator(repair condition):",
            "Forbidden Boba",
            "Makes for beautiful fabric dyes. Lavender blue to soft lime greens, depending on the mordant used.",
            "![gif](giphy|fkMACK8BcUJRm)",
            "Kind of trypophobia triggering",
            "Looks like AI generated poisonous shrooms.",
            "Maybe it is toxic, but not lethal to human beings, so people who ate it are like \"oh it is really bitter lol\" and shrug it off.",
            "🤮 🤢",
            "This is the stuff aliens imgine earth looks like.",
            "Don't try to regulate my diet.",
            "I'd rather be with it's friend mate, they are much fitter.",
            "What are these pustules? Water or what?",
            "So that fungi Honju in Kaiju 8 is real",
            "Thats nature cake.",
            "Oh my God they are so cool!💕",
            "And terrifying.",
            "They look like something from a fairytale stories. Fascinating, and pretty indeed.",
            "I've always wanted to lick one. It just looks like gusher filling lol.",
            "Well, I would also be bitter if I was eaten.",
            "I like to call them Strawberry Cheesecake Mushrooms.",
            "Looks like a really gourmet dessert",
            "Forbidden pomegranate seeds",
            "Looks like the mushroom kaiju from kaiju no.8",
            "I think those give you extra lives. Edit nevermind fire balls mixed up the colors.",
            "Whoever named that got it spot on",
            "For not being toxic it looks extremely toxic",
            "Reminds me of Amazon Games 'New World'",
            "Are they magical",
            "Wow so beautiful…that’s wild. I’d eat it 😈",
            "What I learned is if nature isnt bothering to hide it, you should probably stay the fuck away.",
            "So it's not toxic, it just sucks. ):",
            "This looks human made...",
            "Who was the first person to see that and go... \"yum\"",
            "I’d like a whole garden of things like this, they are fascinating!",
            "You just reminded I should be studying for my upcoming mycology exam 🥲. Would very much prefer to eat a poisonous mushroom 😂",
            "I’m sure there’s a way to cook it to make it not as bad.",
            "Yum",
            "Its me mario",
            "I wonder what would happen if I ate it...",
            "![gif](giphy|lOcFNW571u2o4hV82Q|downsized)",
            "The boba poppers on that fungus looks so good",
            "It reminds me of minecraft cakes",
            ">but not eaten very much because it is so bitter. \n\nAnd also because of, you know, \\*gestures at it\\*",
            "This makes me uncomfortable, its kinda creepy somehow",
            "Forbidden popping boba",
            "Dafuq kind of person looks at that and thinks \"Seems fine, I guess I'll take a bite and try it\". ",
            "If not sweet and delicious, why dressed up as one ? 😭",
            "Mmmm, the Asmongold shroom",
            "Who looked at that thing and said \"imma gonna eat that\"?",
            "Anyone play Hades 2? You get these from Chaos",
            "That name though, another reason to not eat it 😵‍💫",
            "Anything can and will exist eh.",
            "Looks like a fucking cupcake",
            "I ain’t eating no mushrooms with pimples",
            "Forbidden popping boba over frozen yogurt.",
            "Could be “strawberry dew”, but it’s a fungus, so I guess the name gotta be repelling…",
            "“It’s not toxic”\n\n![gif](giphy|EouEzI5bBR8uk|downsized)",
            "The balls on the first person who ate this.",
            "Watch out for \n\n# Gernichora",
            "I'm partial to both bitter and non-toxic, but no way am I putting anything with bright red skin blobs in my my mouth.",
            "Damn, looks almost as toxic as a COD lobby",
            "Jelly drops on the top, is what it looks like to me.",
            "I want it in my mouth. Now.",
            "It looks, specifically, like a piece of cloth was draped over something, then some shaving foam was spread over it and a medicine-dropper was used to place strawberry jam orbs all over it.",
            "Funghi are AMAZING.. We have lots of knowledge about them, but there is so much more to find ouy",
            "Looks like popcoral from Astroneer.",
            "Kaiju No.8!",
            "Just a lick would be fine right?",
            "I'm sorry:\n\nBleeding. Tooth. Fungus?!\n\nWhoever named this was gettin' nasty.",
            "Thanks, I hate it.",
            "\"His name was Bleeding GUMS Murphy, and he PLAYED the SAXOPHONE!!' [sobs]",
            "Bitter my ass. There is no way this thing doesn't taste like strawberries and cream",
            "is it toxic ?",
            "It's like a reverse toadstool!",
            "It looks like a cornetto ice cream!",
            "Burn it.  I don't like it.",
            "I get trauma from the dude who ate one, where a spider crawled up his nose",
            "big one has a weird “brain bug” from starship troopers vibe to it.\n\n![gif](giphy|xT9IglWMahJY8B8U2k)",
            "wow thats so cool looking",
            "If I recall correctly they were researching compounds of this mushroom for Alzheimer's treatment?  I have been lucky to find one of these in the woods behind my parents home in Michigan!",
            "Shameless repost",
            "I want to make a pastry that emulates every aspect of this fungus.",
            "Are we on Pandorum?",
            "Is there a cream for that?",
            "That’s not the main reason why I wouldn’t eat it.",
            "Looks like cake from the grocery.",
            "Those colours and format... super mario bros mushroom inspiration?\n\n\nMyiamoto was flagged as getting inspiration for his games just relaxing in his backyard...",
            "At first I thought it's some Boba pearls on top of a whipped cream. ",
            "COOL!",
            "Looks cursed, would not eat even if it was tasty.",
            "Loiks like a fancy desert you get at a fancy, 3 michellin star restaurant.",
            "Kinda looks like u would visit god in one bite",
            "Looking like a bleeding tooth probably helped in making it look unappetizing",
            "It's almost like you're not supposed to eat it🤣",
            "I find these all over Shattered Mountain.",
            "bitter? asian would eat it to extinction and say it is healthy af, they always use the healthy excuse when they eat some bitter ass food",
            "![gif](giphy|QYdPWN2IbJrP5ol3He)",
            "Every food we eat today is the results of our ancestors eating anything with trial and error.  \nI honestly think there's nothing in Earth that our ancestors (across multiple civilization) haven't try to eat.  \n\nSo everytime you see something *interesting* in the nature and think, is that thing edible? Our ancestors definitely have tried to eat that, and the reason we didn't see in the kitchen is because it's taste bad or poisonous.",
            "Looks like pomegranate seeds in thick cream.",
            "that's kinda ew no?",
            "The first people to try eating this thing were really throwing caution into the wind.",
            "How could it be bitter if it has delicious raspberry jam on top???",
            "Hm. If totally not toxic, I would eat. I have whack taste bugs, so that would either be neutral/semi-sweet to me or super bitter and it would still be fun to taste.",
            "Alien sock puppets",
            "Try it it might be a crazy trip",
            "This is the western mindset for you \" Is it good to eat or not \"...guys not everything has to be eaten. The Chinese are already doing that.",
            "Out of Star Trek!",
            "We had a saying: if it's bitter, it's a spitter.\n\nMore for acid than shrooms, but when in wonderland...",
            "Straight outta Compton!",
            "Charlie and the chocolate factory. Something you’d find in the chocolate room",
            "It looks like Willy Wonka made it.",
            "outa Kaiju no 8",
            "Or Caelid",
            "Lol l that looks like my penis.",
            "Shout out to the first guy who saw this and ate it",
            "I'd be bitter too if my teeth were bleeding all the time",
            "Man I wish that tasted like little gummy pomegranates though",
            "The ciiiiiiiiircle of liiiiiife",
            "![gif](giphy|88iYsvbegSUn9bSTF8)",
            "Nature: \"I'm going to create a plant and make it look like it comes from the depths of hell covered in the blood of evil incarnate\"\n\nHumans: \"I don't know why, but I gotta put it in my mouth\"",
            "a culinary challenge\n\na few bitter non-toxic sources are the basis of some rare pro flavors\n\nthere's an award waiting to be won with that fungi",
            "There you go, cause-effect.",
            "![gif](giphy|gT1hASt9IOS9iMzvj3|downsized)\n\nIt’s boba on fungi",
            "Red liquid does. Red from the oils of the log it grows on and liquid from water produced due to fast growth",
            "They are hard like rock candy",
            "It's basically fungus shit.",
            "If not candy why candy shaped?",
            "This mushroom actually screams “Eat Me” just look at this thread.  \n  \nHigh contrast, juicy sweet looking attractors. Fungus loves to spread, being fatal to humans is just an accident if they are. These things want to be carried away by bees and mosquitoes and squirrels and deposit their spores.",
            "I read somewhere that geologists lick rocks so I can totally see some mycologist doing this.",
            "[Made me think of this](https://imgb.ifunny.co/images/4c56cdbd3acab006ec8bdaca9865625a313a9ff3468c0c25196f6c22cfcc0052_1.jpg)",
            "Starving to death will do that for you. Also just watching animals eat it and survive will probably give you a bit of confidence.",
            "> The fact that someone even tried it to figure out if it was toxic or not is terrifying.\n\nWell, humans are not necessarily the first to try. There are foodstuffs that are either fed to animals or observed to be eaten by animals first before we decide to try it. \n\nThat being said, there is still a risk to this because some animals can consume items that are still toxic to humans, so while it still ends up as a crap shoot, at least there's a 'filter' first instead of just imagining some weirdo going around in a forest eating up random objects.",
            "Looks nauseating too. Besides the red spores, those nasty little trypophobia-triggering spores underneath the head",
            "I mean… you could eat it",
            "It looks like chiles en nogada",
            "Pretty???",
            "Right? If I was quizzed on toxic flora, this shit would be at the top!",
            "Yet it's edible. It just tastes bad.",
            "You should see my ex",
            "This.",
            "Good to know! I was thinking it would be great cosmetic dye 🤔",
            "Yep! It’s like sweat. They’re mtabolites from the mushroom growing. We excrete some of our metabolites in things like sweat, urine, breath etc.",
            "Nope",
            "You don't have to swallow it to find out it tastes bitter and tasting it isn't going to kill you these things have to be digested. When people die from eating poison mushrooms they aren't just eating one they think it's a regular mushroom and eat many of them or make a whole dish of them",
            "Out of a Sensodyne commercial. ",
            "Out of No Man's Sky or Scavengers Reign.",
            "Looks like zerg swarm hosts",
            "Crazy motherfucker named Ice Cube",
            "Reminds me alot of the Blood Kelp zone in Subnautica.",
            "Straight outta Locash!",
            "Well, results are in. Gary ate the green ones, he's dead now. Joe at the blackish ones and says he can see god's, or dogs? Hard to say, he's also drooling a lot. This funky one that's all white with red goo just tastes weird, still alive though!",
            "To be fair, it looks like candy",
            "They probably saw animals eating it. A good rule of thumb is if a bush with berries is completely untouched by animals it’s probably poisonous.",
            "\"oh WOW THATS BITTER MAYBE NOT\"\n\nThe end",
            "Not all the mushrooms are eaten.",
            "Guarantee it was someone’s younger brother that lost a bet.",
            "Eat under a doctor's recommendation. Haaha",
            "Really? This is how I learn that not only was Bobby Lee in 14 episodes of magnum PI but that he's also been steadily working and appearing on TV shows for like the past 5 years? WTF. I gotta watch more TV.",
            "How.. how do you know??!😳",
            "![gif](giphy|JvgfPEQa9gPmg)",
            "Why lie?",
            "Actually?",
            "> being fatal to humans is just an accident if they are.\n\nNo, it isn't an accident. Many spores simply can't survive the digestive tracts of animals, so mushrooms being eaten means the mycelium can't find new lands. Deadly mushrooms evolved so animals leave them alone, so they can disperse their spores using the wind.",
            "I studied geology for a couple semesters. It's a simple trick to help identify some kinds of rocks because if it tastes salty it reduces your options by a lot.",
            "I think there’s a story about either Lewis or Clark licking a rock and getting really sick, but also heard he was just hungover from too much whiskey. Someone should fact check me tho.",
            "Then after that just to be safe there is also the standard method we've always used to \"taste test\" certain things: rubbing on lips first to see if it burns, followed by taking very small bites at a time and spitting out if nasty.",
            "*drink.  The red things are drops of liquid.",
            "Forbidden pomegranate",
            "people are allowed appreciate nature on different levels than yours",
            "It is *gorgeous* **darrrr**ling!",
            "That shit looks delicious, if I saw it in the woods I would immediately lick its orbs.",
            "Well you'd fail, cause it's not flora lmao",
            "Me too, friend.\n\nTeeth give me heeby-jeebies. Imagining blood oozing through pores/cracks in teeth is next-level.",
            "Don’t forget those ones with the holes in tasted pretty good but those ones that looked the same from that other tree tastes the same but Darryl’s still vomiting blood from them",
            "Sometimes I wonder if that's what the first dogs were used for. Here's a scrawny wild dog scavenging for scraps in our garbage pit, he looks pretty hungry. Let's see if he'll eat this tuber / mushroom / seedpod and what happens after.",
            "Dave also tried the one that looks like a rotting corpses fingers cuz he said if it looks like meat itd probably taste like it. havent heard from him yet tho, hes been gone for a while",
            "I’m still convinced that half the reason we know about what foods are poison and what aren’t is dumbass kids running around eating all the pretty berries and shrooms and they just used the ones that lived to determine whether a food was safe.",
            "So blackish, then?",
            "Or something sweet, fruits containing red trigger our brain to associate red fruits to sweetness.",
            "To be fair, candy was a recent invention. Early humans didn't see those and think \"mmm sweets\" because there were no Swedish Fish yet.",
            "This is true especially for chillies & peppers -- they're designed so that only birds (which don't have receptors for capsaicin) find them edible. Turns out, so do humans :P.",
            "Bobby Lee has been on TV since I can remember and I am 41.",
            "Wasn't he outed as a creep who uses sexual harassment as a \"joke\" even when it makes unconsenting hosts *extremely* unconfortable (male AND female) ?",
            "The internet is a way to knowledge many consider to be…unnatural",
            "Probably just googled bleeding tooth fungus.",
            "Because reddit",
            "Stand instead!",
            "[Liquid.](https://www.youtube.com/shorts/121EoJfYprs?feature=share)",
            "If it tastes arsenicy it reduces your options by even more.",
            "[Yep, Lewis licked some arsenic.](https://i.imgur.com/ED0BJHy.png)\n\n[link to journal](https://lewisandclarkjournals.unl.edu/item/lc.sup.clarke.01#:~:text=In%20testing%20the%20quality%20of%20these%20minerals%2C%20Capt.%20Lewis%20nearly%20poisoned%20himself%20from%20the%20fumes%20and%20taste%20of%20the%20cobalt%20and%20pyrites%20which%20contained%20arsenic.)",
            "I've always assumed they were kinda viscous, perhaps between maple syrup and honey. While you _could_ drink both of those things, I'd say it's also not incorrect to say eat as well.",
            "If these were cupcakes I’d down two of them and then send the rest back bc I’m allergic.",
            "I didn’t authorize that so no.",
            "I feel like you you could express this in a better non-passive-aggressive way. They were not inhibiting others' appreciation, merely exhibiting their distaste non-directionally",
            "Says who?",
            "Fake news",
            "Well shit.",
            "![gif](giphy|QV5vp1BYenfCE)",
            "I'm getting flashbacks to that teeth man from the old Candle Cove show.",
            "Ohhh Darryl ate the solid ones? Yeah bro got lazy. Gotta collect enough of the hollow ones with holes. Fuckin Darryl.",
            "lmao first dog?\n\nYou know that was a wolf right?",
            "Pedro ate the one that looked like a turkey tail and says his gut health has never been better.",
            "When I was a wee lad, I always loved visiting gran because she has a house full of neat stuff. One of the things she has was a subscription to Discover Magazine back when Discover was about science and not scripted/take reality TV shows.\n\nOne of the articles was called Life Signs or Live Signs, and was generally about something medical related. One article stick with me about a bunch of kids who wanted to get high but we're pretty ignorant/didn't live in an urban area and so didn't really have immediate access to \"established\" and decided, \"frell it, let's find out own.\"\n\nOne of the things the four of them decided to smoke put all of them in the ICU for a week hallucinating the dead bodies of their friends. They weren't quite right afterwards. One of them might actually have died.  I want to say it was something related to Jimson weed. It's been a couple whiles since I read it.\n\nBut yeah, kids/teens/adults eating, smoking, drinking, weird stuff is probably where a lot of parental, \"Don't listen to Johnny!\" or \"If You're friends did that would you?!\" comes from.",
            "No but it kind of looks like berries",
            "We're the weird freaks that enjoy having our mouths burned. ",
            "Huh, whaddya know. Turns out the man's been grabbing dicks and forcing himself on women for a while. Sounds about right. Yeesh, it's just a shame.",
            "Nope.",
            "...Is it possible to learn this knowledge?",
            "Wow, I just did that. 🫨\n \nThis pictures do not do it justice. There’s reason it’s called bleeding tooth. 😳😬",
            "The forbidden ikura",
            "Good ol’ wild almonds",
            "Drouillard caught a beaver.",
            "Naw, said \"pretty???\" commenter seems to be a right proper cunt. Equally passive aggressive if not more.\n\n\nAnd it's one of those \"if they weren't inhibiting anyone's appreciation why did they comment, but what if not commenting affected their dis-appreciation, etc etc\" bullshit loop.",
            "Still a useful idea, even if there isn't a clear genetic point. The first wolf descendents that we actively cared for, not just shared the same space with",
            "I forgot about berries lol I'm a neanderthal",
            "Dude forced a guy to smell his dick live and had the host edit footage to make the victim look bad, that one time he enjoyed making an underraged girl cry while fucking her, among other things. Here, you should take a look for yourself\n\n\nhttps://youtu.be/BlkZJlmmHgs?si=eq8OgtoBXId9DuVd",
            "Exactly. Wasn’t taking that bait",
            "I think it's an interesting thought and there may be some sense to it, there are many substances that we can eat but dogs can't, and I can't think of anything in particular that dogs can eat but we can't. Their stomach acid makes them a bit more tolerant to raw and spoiled meats, and harder materials like cartilage and bone but as far as toxicity they would probably be good guinea pigs",
            "If you give a burger to my dog, he will eat everything but the salad, mofo will lick dressing of the salad.  \nSoo, vegetables are toxic?",
            "I'm good I don't want to look at that",
            "Lol \"MorePegasus\".\n\nNah I'm good, if there was any truth to what you said then he would be get canceled, hes got a successful podcast and is featuring in both movies and tv shows.\n\nStay hating, stay mad.",
            "Hey-ey, fuck you, no one is allowed to agree with me. I'm supposed to be wrong!",
            "I listened to the dog on the raw meat thing, now I have brain worms.",
            "If he's hungry enough I bet he'll eat the salad too",
            "That sounds a lot like what everyone was saying about Courtney Love when she called out Harvey Weinstein years before it was widely known what he was doing.",
            "\"If there was any truth to what you said he would get canceled\" yeah that's such a good argument, because there's obviously ZERO pedophile, rapist, tax evader, murdered walking free rn, of course of course.\n\n\nI hope he does it to you so you understand how it feels but you'd probably do it consensually with all the dickriding",
            "Ooooh I’m SO going to aggressively downvote you get ready!",
            "Maybe.  \nBut then you'd have to really starve the dog every time you go foraging.",
            "Well see.\n\nInnocent until proven guilty after all.",
            "Proof is in the pudding.\n\nAnd there is no proof.\n\nNow piss off."
        ]
    },
    "2 neighbors think the country is in distress.": {
        "title": "2 neighbors think the country is in distress.",
        "score": 4552,
        "url": "https://i.redd.it/kao5yxlln18d1.jpeg",
        "content": "",
        "num_comments": 885,
        "comments": [
            "They’re owning a home, they look like nice houses, lawns are perfect and lush, cute little mailboxes out by the quiet street … sign me up for that distress baby",
            "They are absolutely correct: the USA is in distress. I think a certain Kentucky Turtle said it best:\n\n![gif](giphy|BO1AaYgFQtnh08kRtF)",
            "A house right across from my kid's elementary school flew their flag upside down a week ago. The next day they flew the Union Jack. 🤔\n\nIt's the same house that had anti abortion signs up when reproductive rights were on the ballot in Michigan. \n\nJust super chill and well-adjusted people, rallying to force 10-year old girls to carry a pregnancy to term, while they see kids that age all day long. It's sick.",
            "These are the same people who called Colin Kaepernick a terrorist for kneeling during the anthem at NFL games.",
            "maybe they're distressed about the awful green gutter in front of brick?",
            "It is. But not for the reasons they think. I would just laugh hysterically and point at their ignorance every time i see them. Just bust out laughing at them. You don’t even have to say anything.",
            "as a non-American I was looking at this  for several seconds wondering what's going on and then I remembered how Republicans like to act like juveniles",
            "I think it’s so weird how you fly your flags on your properties. Over here in the UK you generally avoid anyone waving the Union Jack around their property. It’s someone who’s got their pants in a twist and drank too much of the nationalism juice.\n\nAnd also, at the same time, so what?  Is it really that inflammatory?",
            "[deleted]",
            "You know, back in my punk rock days, we'd put American flags upside down... but probably for the exact opposite reasons these chodes are doing it.",
            "I'm in Canada and I see a rise in racism and hate coming from the right wing movement. It's all greivences about shit that doesn't affect them. Or it's greivences blamed on the wrong people.\n\nAmerican right wing propaganda is ruining everything and for what? So rich people can live in gated communities while the rest of us burn this shit down? We need to talk to each other like people. These Americans have nothing to complain about in their nice house, nice street with good neighbors.",
            "As a Retired US Marine 0311 and US Army Ranger 11B , Combat Veteran I find this  disgusting. The disrespectful-display and disregard for our Flag is disgraceful.  Men and Women have died in honor of what it represents.  Truly unpatriotic and pathetic.",
            "At times like these, I wish we could form a club to harrass them about it. Just a neverending stream of people, one every 20 to 40 minutes, stopping by and pounding on their front door like \"Are you okay?! I saw the distress signal, did something happen?\"",
            "Some dipshit near my house took his trump flag down and put up the American flag upside down on his flag pole. The first night somebody ripped his flag pole completely out of the ground and stole his flag.",
            "How else will they let everyone know they are a victim!",
            "The country IS in distress, but probably not for the reasons they’ve inverted their flags.",
            "With their nice looking houses and their manicured lawns? The USA needs to start enforcing their flag codes. Fucking entitled useful idiots flirting with fascism.",
            "Time to get rainbow flags",
            "Isn't that the Leopards Eating People's Faces party flag?",
            "I was attacked and told in very impolite terms how unpatriotic it was to have a profile picture of an upside-down flag by the same type of chuckle-fucks who are flying them now.",
            "I flew my flag upside down when Trump was elected. More out of protest to my neighbor flying his Trump flag higher than the American.",
            "I mean, we kind of are. After all one of the frontrunners in the next election is a convicted felon who brags about all the crimes he's done and openly speaks of wanting to turn us into a dictatorship. If that's not worthy of distress, I don't know what is.",
            "It is, but not for the reasons these idiots think.The simultaneous cheapening and deification of the office of the POTUS, the partisan corruption of the SCOTUS, the wholesale purchase of votes by corporations and the rapid spread of christian nationalism at every level of government is eroding the nation's stability and freedom at breakneck speed, and if something doesn't change very soon we will see either a complete governmental collapse or a de facto (maybe even de jure) coup by the christian nationalists turning us into a true theocratic plutocracy within the next 50 to 100 years.",
            "Your neighbor is clearly signaling that they are in distress & require help. You should call the police & ask them to do a welfare check. \n\nA flag flown upside down is no t a sign that the country is in distress, it's a sign the owner of the flag is in distress. Stop posting on reddit & get these poor people the help they clearly need. It's the neighborly thing to do.",
            "And they think Trump can fix it. So they are completely fkn gone mentally.",
            "May be try listening to the on why?   And then opening the door for them to listen to you.   Not Trump supporter but we need rebuild our relations with our neighbors so that stop seeing our political opponents as 'evil'.",
            "Call a welfare check! That’s a sign of trouble. ",
            "Somebody call 911, tell them it seems like someone might be held hostage inside based on signals they’re sending out",
            "Fox News syndrome.",
            "I mean they are not wrong in general. As an outsider, seeing the absolutely gargantuan RIFT that is opening up between american citizens over whether they are team red or team blue is, frankly said, absolutely bonkers and frightening as hell.",
            "The interesting thing is, people from both sides of the aisle feel this way, as well as just about every minority social or racial groups feels this same way as well.  Like who thinks things are going well in the USA right now?  Are we on a good path?  A sustainable path that is leading into a future that we’re excited and invested in?  Does the constitution still maintain all of its power to enable the check and balance on the government?",
            "MAGA Trash no doubt.",
            "It was a hate crime!\n\nIt wasn't a hate crime. \n\nWell I hated it.",
            "It is.\n\nThey just don’t understand they’re the cause",
            "Manicured lawns and collapsing states, I guess",
            "If they were across the street from me, I'd fly an American flag right side up.\n\nIt would be entertaining to watch them get mad at me for flying an American flag.",
            "When they announced the repeal of Roe I hung an upside-down flag, I'm glad my wife made me take it down (crazy assholes with guns a few doors down) now so I'm not inadvertently supporting these treasonous fucks.",
            "It is.....because of people like them.......",
            "\"We have met the enemy, and he is us.\" - Pogo",
            "We are because of people like that...",
            "It is we have a convicted felon running for president",
            "The only thing more sad than a mind corrupted by propaganda, is one that then feels the need to perform public displays of said ignorance.",
            "isn't it though? I keep hearing on the news that Trump is going to end democracy and round up all the coloureds and gays and put them in camps. Even worse, The View might be taken off the air!",
            "My dad lived in Chicago for years. Nothing bad ever happened.  Moved to Tennessee because Chicago was a “liberal shit hole” and it was “dangerous”.  His house has been broken into and he has been harassed on the street while living in Tennessee.  But it’s amazing and perfect.",
            "I swear…one day the history books will show that Russia had kompromat on Donald Trump (and there must be many others) and turned it into the greatest psyop on America in the history of our world.  They have convinced a third of the USA that up is down and black is white.  Truly astonishing.",
            "I never understood the point of flying the flag of the country you're currently in",
            "One of our neighbors did this once. It didn’t last the day, hilariously. It pissed off the Vietnam vet who lives next door, and he called the sheriff’s office. The sheriff came out, the flag was corrected. Don’t know what the sheriff said, but it didn’t happen again.",
            "Louisiana just because the first state to require the ten commandments be posted in EVERY classroom, the separation between church and state is dangerously thin, Roe vs Wade was overturned, housing costs are out of control, antisemitism and anti LGBTQ sentiments are on the rise. I’d say the country is in distress.",
            "More fabricated fear.",
            "Seeing this in suburbia is always so funny to me.",
            "You should go knock on their door and find out what's wrong. Perhaps the British are attacking and they are out of supplies.",
            "NVM….trying to stay positive",
            "They are voting for Trump but are too embarrassed to put those signs out?",
            "If only they got the irony that the country is in distress because of people like them.",
            "They’re too dumb to know which way to fly the flag",
            "Why is this a thing now? Are these the J6 criminals?",
            "Translation: their cult isn’t fully in charge yet. Oh boo hoo.",
            "What a lovely manicured lawn those distressed American citizens have....",
            "They also have a hard time keeping those mow lines straight 🤣🤣🤣",
            "#I can \"feel\" their distress through their well maintained brick houses with manicured plantings... the horror...",
            "Country in distress for them = I didnt get my way, and watch too much internet. They don’t even know what they want.. As a vet this shit pisses me off! Bunch of candy ass spoiled man child’s.",
            "It is, but it's because of Trump supporters like them.",
            "Feel free to anonymously suggest to the FBI they were in DC as “tourists” a couple years ago.",
            "When a presidential candidate and former president is a convicted felon and charged with multiple crimes has support from nearly half of the population, yes i think the country is in bad shape but not in distress yet.",
            "Ironically we're in distress because we have a lot of idiots who think we're in distress.",
            "I just wanted to say, fuck these people and everything they represent.",
            "I know it's hard for this type to read, but it's \"dire distress in instances of extreme danger to life or property\". Your life isn't in danger because your fat orange cult leader lost a trial.",
            "Yep... polite notification... if you are sad cos of your mr orange - it doesn't mean that everyone else are in distress.",
            "SCOTUS election campaigns are coming up",
            "I mean, they are right. You having to live near them is distressing. At least the traitors have identified themselves to you.",
            "I bet they eat cake after dinner...smh",
            "In a way our country is in distress, both sides are very politically divided and every day they push the divide deeper.",
            "That's an offense against the Flag Code. They're traitors to the United States.",
            "Snowflakes",
            "This is why the \"conservatives\" ruined the American Flag - After all this MAGA shit is done, I'll go back to flying Old Glory.",
            "You have two 80 year olds running for president. One a toxic narcissist, the other a senile twit. The campaign itself is at the mercy of social media algorithms, creating echo chambers and causing your country to be more divided than it has ever been. Your healthcare system is a basket case run by insurance companies who make it inaccessible to more than half of your population and regularly runs out and fails a good portion of the other half.\n\nThere is no sign that it's ever going to get better.\n\nHow is your country *not* in distress?",
            "Beautiful homes in a beautiful neighbourhood. Yeah, they got a lot to complain about.",
            "It is definitely in distress. Anytime a douchebag like Trump gets 71m votes…it’s a good indicator that you have an education problem and a mental health problem.",
            "do your neighbors also lick their windows?",
            "They're right. There's a convicted felon running for president.",
            "These are the same people who shriek about  everyone else being “sheeple”. These idiot will never understand irony.",
            "What is it with Americans hanging their counties flag from the front of their house? I’ve even seen it in the poorest neighbourhoods where people are living in squalor and can’t get access to clean drinking water or a doctor. The blind patriotism is odd. I’ve never seen in in any other country, it’s weird,",
            "These are the dip shits that believe they'll do well when democrocy dies. Like the Germans, Italians, Palestinians, Libyans, Georgians, Hungarians, Russians, Turkish, Indians, Iranians, North Koreans, Sudians, Venezuelians, you can add to the list.",
            "You could apply maritime law and assume that their house is sinking.  If they leave for the day you can claim it as an abandoned vessel.",
            "It is in distress. Because of people like them.",
            "I mean it kind of is in distress, there's a chance of a fascist president. I'm worried.",
            "Virtue signaling fuckheads",
            "Maybe they’re just fucking stupid?",
            "As they enjoy owning a home with a nice lawn. God it's so tough out there.",
            "Doesn't this \"violate\" your Flag Code?",
            "My parents have been flying upside down since Jan 6 2021. They think the rise of fascism is terrifying, and have distanced themselves from many of their friends who are Trump supporters. They're probably not aware that it is a dog whistle, or maybe they are, and are just trying to blend in.",
            "From the looks of their front yard and home, it sure looks like they have something to complain about /s",
            "Everyone knows exactly who those idiots voted for",
            "Rebellious/s",
            "Really?  \nHanging the American Flag upside down THIS IS extreme anxiety, sorrow, or pain.",
            "Not to be out of place but what does the upside down flag mean ?",
            "It is?",
            "I think that too\n\nBut with very different reason I assume",
            "or they are signaling that THEY are in dire distress.\n\n...but I mean the world is kind of in a dire state... so...",
            "It’s all subjective, the country could be in depression but if you have a job and providing for family you wouldn’t realize it.",
            "It took me a while to get that the flags are hanging upside down. I have never heard of that before.",
            "[Sam is that you again?](https://www.pbs.org/newshour/show/former-neighbor-disputes-alitos-explanation-of-upside-down-u-s-flag-flying-at-his-home)",
            "Clarence and Sam got jobs for life",
            "[This conversation](https://www.youtube.com/watch?v=3zKaHp0zW7U) right here. \"They're doomed\" - \"Yes...\"",
            "Trashy pics",
            "It kinda is looking at your upcoming election.. Trump and Biden all you yanks got?",
            "That screams dysfunctional family where the parents hates each other and hates their kids as well. I can smell a divorce coming with one or both parents will commit adultery while the children suffer silently. If they are stupid and crazy enough to do that \"distress america\" shit and worship an orange man as their god then I'm pretty sure they also suck at parenting and having relationships.",
            "Boomers",
            "WOLF!! WOLF!!!!",
            "Hanging your countries flag is a bad thing these days it seems. If you hate your country and also hate the people who DONT hate it, why are you even hanging around?\n\nIs there a reason you aren’t just immediately leaving for one of the better countries?",
            "The irony is these people are the problem",
            "It is. It's them, they're the distress.",
            "There will always be someone who thinks the same.",
            "Idk much about laws, but aren't the flags supposed to be legally facing upright. I'm fairly certain that you can't for sure put any flag above the u.s. flag. This just doesn't sit well with me. Then again I'm not used to seeing a u.s. flag upside down.",
            "With their perfectly manicured lawns.\n\nThe fuck outta here.",
            "The distress, like the threat to our republic, is from within. ",
            "What a perfect looking neighborhood.",
            "They look like they are doing well. I don’t get it.",
            "Yeah they look like their at wits end",
            "While they live on the most picturesque American block with the most perfectly cut front yard I've ever seen",
            "Look at their finely manicured lawn.",
            "If my lawn was looking that good in a national crisis....bring on the civil war!!!!",
            "Hire a redneck actor to show up and offer assistance and when they start yammering about nonsense, have him flip out about them crying wolf.",
            "These fuckers probably lost their shit when Kaepernick sneaked for the anthem.",
            "It is the Republican party is ripping it apart, and it is not gonna be pretty for either party or the country.",
            "VERGONYA!!",
            "Maga morons preach the Bible and the 10 command, and they guy they preach has broken all 10 commands already and keep on breaking them.",
            "This is the new Trump flag apparently.",
            "It's probably from Martha's vineyard. There was an immigrant mowing the lawn.",
            "So weird to me how people become obsessed with American politics instead of living their life.\n\nGo outside, find another hobby.",
            "I've lived in neighborhoods where they steal those flags",
            "Saw the same thing near me a few days ago. They also had Trump flags flying on the same flag pole. If Trump is elected again, then the country is in real distress",
            "It IS in distress. It’s just ironic that THEY’RE the ones making it so.",
            "🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️🤦🏼‍♂️",
            "Their pizza deliveries were late and this is how they responded",
            "I mean it IS, but more in the way that’s gonna end up with a bunch of different flags and not that one",
            "I mean it is, just not in the way these people are probably thinking",
            "Uh oh. 😕",
            "It is but I’m willing to bet it’s not in the way they think it is",
            "Yes.",
            "This is just disrespectful",
            "Maybe it’s not Russian enough for them. Learn a few words and make them feel more at home",
            "Well we know one side is..",
            "Should someone go check if they are alright?",
            "Can someone from the military talk some sense into these people? This is the second post I've seen of this in two days.  That means at least three people doing it.\n\nThis is supposed to be only for emergencies.",
            "My 94 year old neighbor just passed.  Her 65 year old daughter was living with her and caring for her.  She has a giant flagpole out front of her home. Like 30 feet tall.  Always fly the American flag. \n\n\nOne day it, about a year ago, I noticed she was flying it upside down.  It became the talk of the neighborhood. Finally a veteran neighbor approached the daughter and told her it was disrespectful to fly it that way.  She was confused. That was the first time she noticed she had accidentally attached it upside down the last time she put it up.  ",
            "What does it mean when the flag is upside down?",
            "Yeah they look like they have it really rough",
            "if you live on the internet and cnn/fox, i bet they think so",
            "patriotic people, at least to this extreme, are weird.. someone should study their brains",
            "Some parts way more than others. 😰",
            "The people that yell “wolves not sheep” certainly jump on common trends don’t they?",
            "As their neighbor I would get possibly largest flag on big-ass mast and fly it proudly.",
            "I'm sad he has the gutters of the company I work for",
            "True, it is in distress,  but no reason for people to go freaking Trump on each other.",
            "24/7 News smh",
            "Better send the police over right away, it's a cry for help!",
            "Is Samuel Alito your neighbor?",
            "Call the cops & tell them you think they are in danger. That's the official US flag code signal for in distress. Let the police handle it. In many states a fake distress signal is a crime.",
            "People who are truly in distress do not have the time or energy to advertise it like that. *gestures* at actual war torn countries. These people are spoiled brats having a tantrum.",
            "Those aren't just your neighbors, they are 2 supreme court justices!",
            "total disrespect of the American flag",
            "Look at their lawns. Their opinions are irrelevant.",
            "the same people were upset when other where neeling for the national anthem-",
            "It is! It's under deep treats of fascist dictatorship and political persecution using both the military and corrupt judges . If  dementia Don and the 2025 agenda get their way",
            "Using the American flag for petty politics, stay classy!",
            "Think?",
            "[https://www.reddit.com/r/flags/comments/1dlq6nb/new\\_us\\_flag\\_design/](https://www.reddit.com/r/flags/comments/1dlq6nb/new_us_flag_design/) \n\nThis you OP? “I’ve never been fond of the current flag design.”\n\nAlso in the pic you posted to this subreddit, it looks like those flags are on one house, not two. Guessing that is your house and also guessing you are trying to make people doing this catch on.",
            "i'll bet these are the \"americans\" who want 'the us they grew up in' back....  for whatever that means.  or, as i like to call them, very unamerican cry-babies. \n\nflying the flag upside down should not be done so because of your opinion.  and, for the record, i am of the opinion, if you do this, it's a sign of disrespect, not only to the flag itself but, a reflection of your ignorance and unwillingness to simply..... try.  ffs, turn off your fucking tv and go outside.  stop listening to the bullshit you hear on the news and go meet your neighbors.  block party get togethers are so much nicer than upside down flags anyway.",
            "According to Fox News we are at end times! It’s actually hilarious if they did not vote.",
            "They also think that they are effectively living under a presidential dictatorship/illegitimate presidency and you are supporting the enemy. Try to understand emotionally and intellectually what that really means.",
            "I got $15 that says brown people mow their yards for them.",
            "Does this support my worldview or the opposite?",
            "Must be nice to be able to afford a flag and a place to put it.",
            "I wonder what they think about players kneeling during the national anthem",
            "Is this from that milk throwing vine?",
            "Yard and house look impeccable though",
            "Holy shit",
            "This is happening more and more along with blacked out flags. Drove up to ATL the other weekend and saw several along the way.",
            "![gif](giphy|xT5LMEYx5AZwu4oiac)",
            "Nothing says they are insecure than having 2 same flags in the same spot. \n\nI'd say the flags are a euphemism of their relationship. They are only together coz flags are together.",
            "Instructions unclear ran dick up flagpole.",
            "I’m sure they are doing everything they can to fight it, right?",
            "Ask if they're protesting because \"if they can go after the president's son for gun crimes, they can come after them for theirs\"",
            "Of course they do, Trump is still alive and free",
            "They might be right, they might be wrong; who cares?  What we can all agree on is those are some nice lawns!",
            "They aren't wrong",
            "It is in distress but not for the reason these chuds think",
            "It’s one of the Golden Girls: Bette White.",
            "They are correct to fly the flag of distress, but I bet they are entirely wrong in their reasons why they do it",
            "How could anyone not think North America isn't in distress? This is the worst it's been economically in a long fuckin time. When you have people who are working 40 hours a week and homeless,  when you have to choose between fueling your car or buying groceries?  People aren't getting it.  Your student wages don't need to be paid for,  American and Canadians are literally starving in the streets,  regular people who were just low income,  forced to become homeless.  So yeah,  the country is in distress, and it's beyond the scope of measure.",
            "November election they might need to do this. Chaos either way. 😅 Senile idiots both of them. 😅😱",
            "I mean our elections 🗳️ between a almost dead person and a felon so I think we’re up shit creek either way 😅",
            "We know where they get their news from. They don’t know they’re being used",
            "First thing I noticed was the nice, landscaped, manicured lawn.  Billions of people around the world would die (and are dying) to get a piece of that \"distress.\"",
            "I've been to distressed countries - manicured lawns are not a thing unless you are part of the problem.",
            "Irony hits hard",
            "So I've had my flag upside down since Dobbs....fuck these pricks.",
            "When I grew up that was a symbol to call the police as there was something wrong in the house. Their flag pole could be seen for miles, but the phones didn't always work.\n\nNow it's 'all the rage'.",
            "If you can mow your lawn - the country is just fine.",
            "Yeah we need a few more little girls and cops kids by illegals in order to really care",
            "Country is in need of help, they ain't wrong for flying the flag for a nation in distress!",
            "If all you ever watched was Fox News and other right wing fear mongering, you’d think the country is in distress too.",
            "I'd agree, but probably not for the same reasons.",
            "you should ask them what help they need",
            "Thanks, Judge Alito! I'm sure since your lovely wife's actions have come to light, there has been an increase in this sort of unpatriotic demonstration. As a country, we are screwed right now. Holding my breath for November. Not feeling confident.",
            "The neighborhood will look very different once the civil war they are all longing for breaks out. Never quite understood where all these guys think they will be going once they had enough. There is no other continent on earth that could adsorb even a small percentage of the US population..",
            "It is in distress… because of idiots like these",
            "\"I heard Chicago is basically gone\" -guy who lives in Ohio",
            "This is what pisses me off so much. I know people associate Trumpism with poor yokels, but most of the instances of this I've personally seen are from people who are well off. They have houses, garages, cars, backyards. As far as there is crime, poverty, violence, and desperation in this country, it doesn't live in their nice suburb. They have enough leisure time to engage with this stupid Trump shit on the internet. They feel safe expressing their idiotic opinions. They have the very best that America can offer anyone, hell, they have the American dream lifestyle the rest of the world still envies. Yet they fucking hate it here, feel like they're oppressed, and want to burn it all to the ground, and want to fantasize about being camo-clad revolutionaries as if they'd enjoy being off their $1,000 couch for even five minutes. So deeply ungrateful.",
            "This reminds me of my parents neighbors lol. White, upper middle class 50-55yo Christians living in a gorgeous house in a gorgeous neighborhood in the south where the population is extremely homogenous in terms of race, religion, sexual orientation, and political leanings.\n\nThey have multiple cars and boats and their property actually has two full sized double story houses on the lot, yet they fly a bunch of flags outside of their homes saying \"don't tread on me\" and \"liberty or death\" like who the fuck do they think is treading on them? They're the majority in every single way lol",
            "Yes. The USA seems in distress, but it looks mainly to be caused by the type of person who likes to fly the flag upside-down. ",
            "Boomers have no problems so they fall for any sense of terror purely on impulse, they crave a reason to have fear… even if it’s fabricated",
            "Said the same thing to neighbor couple years ago. I always mind my own business, because who cares what ppl do buy something about it hit me. I knocked on their door and asked what was the distress they were under and could I help. If not, turn your flag the right way and don't disrespect it.",
            "I'll bet that they are conservative Christians who buy into the persecution propaganda and think that the Democrats want to impose sharia law and take away everybody's guns.",
            "Was thinking the same thing.",
            "Distress me harder!",
            "Look at most trumpers.  They scream they are repressed, scream how the countries in trouble.  Meanwhile they use PTO from their job to load up their family of 4 from their 3k square foot home into their 80k dollar ford with 10+k in mods and 5k in trump crap to drive across the country in hopes of overthrowing an election and murdering some democrats because reasons.   The disconnect in their brains are insane.",
            "Other communities live BETTER they don’t like that.",
            "(((They))) are gonna come along and arrest them for stirring the shit with that upside down flags.  Any moment now…",
            "401K making money, but these Orange shit stains are in distress",
            "I'm sure it's not the country they're worried about it's their white privilege that's under fire.",
            "Excuse me, but were you aware that migrants are running over the borders? These people are in peril",
            "Reminds me of people complaining about gas prices too high, but driving HumV’s that have 8 miles a gallon.",
            "Needs some eggs all over it.",
            "I like to feel my oppression poolside",
            "Lady down the street from me lives in $800K home which is pretty high end here with lush lawn and new vehicles but flys all of these Trump bullshit flags and had the upside down flag for a while as well and I was like yeah life is really terrible for you lady. WTF!?!?",
            "Living in comfort = country can't be in distress?  Just because I don't agree with them doesn't mean I have to agree with you.",
            "Maybe the distress is that they have created an ecosystem devoid of biodiversity. Someone should come along and plant some native plants for them.",
            "Just because I have things good doesn’t mean I think that everyone else has it good. \n\nTwo things can be true.",
            "Their distress is that black and brown people might achieve what they have, which will somehow devalue it. They are people who don't understand that rights and opportunity aren't a finite pool.",
            "No, no. It’s other parts of the country. Other parts they’ve never been to or seen are in serious distress.  It in a way that effects them, but still, they’re scared.",
            "You perfectly encapsulate their disconnect and insanity in this moment. All for a PoS racist traitor.",
            "leave it to boomers\n\nprescription strength victim complexes",
            "The only time that old fart made rational sense.",
            "Hey! We don't want any of that bullshit - Signed United Kingdom",
            "That's super bizarre because in the UK abortion is pretty much a solved issue. The exact framing of our law is weird, but basically everyone outside of Northern Ireland would agree that abortion should be allowed.",
            "I also remember this clown behavior, but we secured abortion as a constitution right in Michigan during this moment. It's a divided state, but progress has been winning the battles since we got rid of Snyder and voted in Whitmer.",
            "Did they hang the Union Jack upside down too?",
            "King George still has loyalists?!!",
            "Twas projection per usual",
            "Exactly",
            "Exactly my initial reaction to this as well.",
            "It's definitely stressing me tf out looking at it.",
            "Wait but what is the actual crisis and why do these people think there is a crisis?",
            "As a fellow non american, what's the reason for the upside down flag? Iirc its only flown when the country is in distress right?",
            "As another non-American, we had a lot of (far-right) farmers here in The Netherlands who did the same. They take the country hostage (they pollute the environment with nitrogen, take too much space and so are a big factor we can’t solve the housing crisis. Meanwhile they cry they are being bullied and act like they have the right to be a farmer. So that is why in a lot or a rural areas a lot of people hang their flag upside down. \n\nFunny enough they are all gone now while the country is getting in a deplorable state. Our new government will have ministers who have literally nazi sympathizers. Of course voted in by the same idiots who hang their flags upside down. ",
            "There is a guy in Moncton NB (Canada) that drives around with an inverted flag on his work truck. Work truck!! \n\nGuess which plumber I'm not hiring.",
            "But remember. It’s the Dems that are snowflakes… somehow.",
            "The only time you see German flags is the times when there is some international football event going on.",
            "It's a performance. They want to broadcast that they are \"good patriots\" but they can never be bothered to read the damn flag code, so they are just showing off their ignorance.\n\nIt's actually a good indication of the state of the Republican party; they pretend to be patriotic while what they are really doing is eroding the rule of law and trying to replace it with theocratic bullshit.",
            "Not many fly the Union Flag either, other than the royals and government buildings, it tends to be the Saltire/Cross of St.George/Welsh Dragon, even on churches.  It probably gets flown a bit in N.Ireland (along with the Irish flag and N.Irish flag) but I've not visited to see.  Around my neck of the woods there's a few Devon flags (and Cornwall flags for the Cornish), but you're just as likely to see one for a football club.\n\nThat will all change for two weeks during the Olympics when Team GB&NI get cheered on, and promptly forgotten about shortly after.\n\nAnd if England make it to the later stages of the Euros, every other car will be flying the flag.",
            "Glad you don't think the North of Ireland is part of the UK 🇮🇪",
            ">It’s someone who’s got their pants in a twist and drank too much of the nationalism juice\n\nIt's the same in the US.   Anyone flying a flag out on their property now has a 95+% chance of being a nationalist prick.",
            "It's deeply disrespectful.  There isn't really an analog in Europe.\n\nImagine if your neighbor sat on their porch every morning and screamed MAYDAY MAYDAY MAYDAY.  You rush over to help.  The emergency is that he doesn't like the PM.",
            "In Wales we'll put the Welsh flag on absolutely anything and everything.",
            "Weird thing to say, especially less than two weeks from Independence Day",
            "I obviously can’t speak for all U.S. citizens, but I can guarantee most of the country is not like this.  I live in a state that is arguably the most diverse in the world. Don’t let the media fool you— America is actually one of the most, if not the most, progressive countries in the world. But hay, America bad, right?!?",
            "They all used to wear red hats, but some of them realized how big of an idiot we could see they were, so this is nice.",
            "Ten bucks says that they have a murder-suicide pact that won't go well for either of them.",
            "100%. I think about this all the time. It is supposed to be an FU to capitalism and the system. I’m not sure what they are trying to say.",
            "They think being MAGA is the new punk rock",
            "Right?! I keep thinking they must be big Anti-Flag fans or something before realizing it’s not that.",
            "I can guarantee the flag owner did not serve. And I’m guessing wouldn’t serve if called.",
            "Basically Reddit Cares IRL",
            "I don't condone harassment. They did technically ask for help, but once a few neighbors have checked in and offered to call 911 for them, it's just crying wolf. They're breaking one of the most basic nursery rhyme taboos. Don't cry wolf. Pretty disgraceful. I'd suggest ignoring them. That's the traditional remedy.",
            "Yes, and we could get them matching outfits, with colors that have nothing to do with the flag… like maybe brown",
            "You don't flip the flag just because you think the country is in distress. That's above our pay grades and at that level they don't use the flag to declare national defense posture. That's what Congressional authorizations of force, DEFCON alert level, Homeland Security NTAS threat levels, and State Dept travel warnings are for. Inverting the flag is just what it says in the flag code. Dire distress in instances of extreme danger to life or property. Like a base being overrun with no reinforcements, a ship sinking or about to be boarded and cut off from the fleet, or a position under siege with jammed comms. Otherwise the flag is a symbol of unity that you fly aloft and free in the wind to establish your position in the formation and establish presence for your camp. You don't even pull this shit on the front lines during a coordinated operation.  It's nonsense in a suburban neighborhood where everyone sips their coffee from their front porches and waves to each other.",
            "Start putting the rainbow flags upside down. Then everyone will start putting their other flags upside down. Then these yahoos will put theirs right side up to be different. \n\n4 dimensional flag chess.",
            "We engage in a mild amount of tomfoolery",
            "The same people who said “yOu ShOuLd ReSpEcT tHe PrEsIdEnT!” and then put “Fuck Joe Biden” stickers on their cars? Those people? The group that support “Law & Order” but are getting ready to vote for a 34 time felon who had a major role in inciting a riot against the federal government? Those people? The people who just “want to be left alone by the government” but think the government should be dictating who other people can marry, what they can do with their bodies and whether or not they want to be pregnant? Those people? \n\nWell, color me shocked. Shocked, I say.",
            "We're infected with a bunch of goons who are eager to throw democracy away just to reinstall their favorite wannabe dictator. But other than that, crime is down, unemployment is down, inflation is down, Dow Jones is higher than ever. I wish certain people would harp more on the things that are going right, maybe the goons would give up if they knew their battle was futile.",
            "Russias stated goal in the foundations of geopolitics",
            "![gif](giphy|P0ZRTYaCmPsJPNd3r0|downsized)",
            "what you can’t hear is the sound of cognitive dissonance these people have to live with.",
            "I’d be interested to know what the sheriff said to the neighbor flying it upside down.  Because it’s not illegal to fly it like that.  In Texas v. Johnson the Supreme Court ruled that even burning the flag is protected free speech.  That said even if it’s not “illegal,”. It wouldn’t be wise to make an enemy out of the local sheriff so you could distress call with the flag",
            "Apparently a couple cult members got big sad that a jury found glorious leader guilty of one of the many crimes he has committed.",
            "Do not do this. Even if you don’t agree with the messaging, it is their right to do it.",
            "Is this a bot-created post upvoted by bots? Is it a parody? I can't tell anymore",
            "If you stand by what you mean, why do it anonymously? Coward.",
            "Flag code isn’t law so it isn’t enforced",
            "Idiot. Its literally the first section of the Code\n\n>(a)The flag should never be displayed with the union down, except as a signal of dire distress in instances of extreme danger to life or property.",
            "That is a disgusting fact",
            "My cousin lives in Chicago and we love to visit. My wife’s conservative family that lives in GA found out and sent us texts for days begging us not to go because it’s so dangerous. \n\nWe just sent them back a few selfies enjoying the city.",
            "I live in Providence and get to hear people from the burbs telling me my neighborhood is a war torn hellscape\n\n\nIt's just a Dominicana neighborhood with a lot of food trucks and barber shops \n\n\nThey could drive and see it in like 15 minutes but there's too many blacks ",
            "I live in Detroit, and people online are like, \"Oh my gosh, I'm so sorry, I heard about Detroit\"  \n  \n  It's like.. yes, please save me from the gentrification that is rebuilding the city better than before, our massive selection of delicious foods from all over the globe (including the best rated pizza in the nation), our endless entertainment venues and 50 bands playing all over the city every night, the ever expanding art scene, culture and museums..  \n  \n  It's so terrible living in a melting pot of civilization. /s",
            "As a guy in Ohio this is sadly true, you'd think anywhere outside of the rural towns are \"lib hellholes\".",
            "Urban death maze",
            "“Cities burned to the ground”\n\nOne of the most hilarious conservative comments I read online regularly still",
            "This is painfully true. \n\n\"Omg, Portland is burning to the ground\" while living in a city/town that crime eclipses most major metros.\n\n\"The air is so bad in Philly\"- in an Ohio city that is top 10 worst in air pollution in the US",
            "\"NYC is the cesspool of the world it's extremely unsafe, if you go to Central park you'll get raped and murdered\" - Exact words from my mother in Ohio... She's never left Ohio.",
            "I hear the same thing about California from so many people who have never been",
            "The Chicago obsession among right wingers is weird. It *only* exists because that's where Obama is from. I lived there for 5 years and I absolutely loved it there. There are rough neighborhoods I'd avoid, but they exist because of poverty and systematic racism that led to de-facto segregation. Crime thrives in places of despair and limited opportunities. If we invested in these neighborhoods and better funded education and a better social safety net there would be less crime and poverty. But then what would the fox news crowd criticize besides taxes.",
            "I have family that speak about downtown areas THEY HAVEN’T BEEN TO IN YEARS like this. Fox News or someone is telling them blue city downtowns are godless war zones and they believe it.",
            "Gone where? Idaho?",
            "Shit man, I leave town for *one weekend*…",
            "\"Portland is still on fire\" - guy who lived in ohio",
            "Yep, a guy in my development in Ohio has an upside down flag and loves talking about Chicago and California",
            "People in East Texas seem convinced California is a post apocalyptic communist dictatorship.",
            "Can confirm; Chicago is completely under the gone. It also sunk under the weight of all those bussed in migrants to the bottom of lake Michigan. \\s",
            "Every time I tell people I live in Seattle they have a meltdown lol",
            "My waistline was gone after a week eating in Chicago. Goddamn, y'all don't play.",
            "I think it’s right wing media and radio. I listen to the radio sometimes, and they’re saying cities are hellscapes if crime and violence\n\nI live in LA, I’m driving around, I don’t see that, I see flowers and people living. It’s a classic move to say “everything is terrible and in chaos … somewhere else, but you should be mad”",
            "I agree with everything you said but I had to laugh at $1000 couch. $1000 is like scraping the bottom of the barrel of couches",
            "The house in this post reminds me of my neighbor. Lovely 2-story house in a southern California suburb within 20 minutes from the ocean, 3 car garage, big backyard with a pool. Drives around his huge shiny lifted truck with not one, not two, but THREE gigantic flags flying on it. One is for JESUS, one is for TRUMP, and one is an upside-down American flag. Dude, *what* distress??",
            "From a position of privilege any push for equal rights can feel like oppression.  When the have nots come for their share of the pie the people living in the cozy suburbs turn into paranoid freaks who think their one step away from having their door kicked in by their lessers.",
            "Man this comment could have been spliced together from things I've said over the last 20y. Obviously, I couldn't agree more. \n\nFox News continuing to sell this idea that Christians are this repressed and beleaguered faction  in the US is absolute insanity. Saying that they believe in and fight for freedom, while outright attacking anyone who disagrees with their favorite OPINIONS, or worse these delusional conspiracies (election was stolen, court trials are a sham), is a level of cognitive dissonance I'll never understand.\n\nIt's not freedom if you hate every other religion, every other lifestyle or culture, and tell anyone with different ideas about society and government to \"get out of our country\".",
            "Well I mean it depends on your community. I live in deep Appalachia and yes these poor yokels are all about trump",
            "I feel like what you're missing here is that having republicans in power means the wealthy pay less. The irony is that for Tony down the block, that doesn't really mean anything, because Tony isn't actually wealthy. Tony just thinks of himself as wealthy, and wants tax cuts for the wealthy. But raising the federal estate tax from 5.5m to 12m like trump did will never effect him or his family.",
            "It is often like that. I live in Sweden, and someone recently explained to me why people vote for extreme right wing party sverige democraterna. It’s because immigrants move into neighborhoods and the crime skyrocketing and the swedes who live there get threatened on a weekly basis. I then explained that I have lived in on of the most segregated “ghetto” in sweden for over 20 years as a white man, and have not once have someone threatened to kill me, and same goes for the rest of the native borns here. He then showed me a clip of some reporters getting threatened, and said that people see that. So it was never about getting threatened themselves, it was adopting the feeling of others getting threatened and being mad over that.\n\nPoint is, people don’t need to feel bad themselves. Lies will make them feel both strong and weak and mad at the same time.\nAnd to be fair, the left often gets upset about things being racist, like cultural appropriation. And when you ask people of said culture they don’t even care or thinks it’s fun. Pretty much the exact same thing.",
            "The Rich folks benefit, and manipulate the poor folk into being the footsoldiers.",
            "1000$ for a couch is actually super cheap these days. (not to take away from your point, wifey is couch shopping)",
            "That's exactly it. They've made it and want to pull up the ladder behind them. The self victimization is just an extremely potent way to accomplish this because it takes the wind out of any of the actual victims. Then you put enough money behind that narrative and it spreads like wildfire.",
            ">the American dream lifestyle the rest of the world still envies\n\nYeah, those times are gone mate. I don't know anyone who envies the American way of living.",
            "That saying “to the privileged, equality looks like oppression” holds true. When they see that “undesirables” may be getting a fair shake, they think it means that their lives are somehow downgraded. Or that that fair shake means they’ll “have less” moving forward. They’re crabs in a barrel.",
            "From my PoV, i associate Trumpism with small-mindedness, low IQ and lack of education. And not all of them are necessary, just one is enough.\n\n-random european",
            "They dont have anything worse to stress about, so they are busy being outraged about stupid stuff. Same thing happens on both sides",
            "These types apparently enjoy cosplaying the idea that they're under attack. Reminds me of a guy in a place I used to work who got real excited talking about FEMA trailers and whatnot. They love the drama.",
            "I was going to say, this picture could have been taken in ANY suburb of the lower 48 lol",
            "You know what’s crazy is leftists have been turning the flag upside down for years, either as a sign of distress or as an anti-US/anti-government message, usually in response to US imperialism or military action. Now the nationalists are doing it, because the president they support is a criminal, found guilty in a court of law by a jury of his peers. Totally different standards of distress. ",
            "The rise of fascism brought on by people (I'm assuming) like the ones who live in these houses in this picture, is way more distressing to me than anything else going on in this country. \n\nCoincidentally they are also the people standing in the way of fixing the other problems we have.",
            "I don't think it's just boomers",
            "Not This boomer, thank you! Stop painting us all with the same brush.",
            "But did nothing about it",
            "Because, you know, it affected him directly. All that other stuff that happens to other people isn't real.",
            "Damn straight - abortion has been legal in Britain since 1967 💪",
            "Honestly, they were probably mistakenly thinking it was the Confederate flag, which is somewhat similar, and those same sort of people usually aren't too bright.",
            "What's wrong with northern Ireland?",
            "Doesn't that just become the Australian flag?",
            "discharging into what looks like mulch. I think the home has foundation damage and is therefore distressed.",
            "I used to mainly blame propaganda style Fox News and similar, but I truly think a lot of these people are now addicted to feeling like victims. Helps them deflect anything that goes wrong in their life and blame an external source.\n\nAnd then some are just flat out needing any cult of personality/group to become their identity. My dad is an immigrant doctor in a Florida retirement town and man the amount of bullshit he hears from people he’s actively helping keep alive… it’s wild.",
            "This started with trump being convicted. They, without proof, are saying his conviction is a sham.",
            "Yes, some dumbasses think the country is in distress because a lifelong fraudster and criminal was found guilty by a jury for crimes and fraud committed in the state of New York. Crimes of which he was clearly guilty. So much distress.",
            "Correct. Republicans are really ignorant over here",
            "Same here in Poland (except they didn't yet figured the flag stuff). Farmers blocked most major cities and even ambulances had to make detours because they didnt want new EU regulations (which among other things forces them to cut pesticide usage). Yet when three kids glue themself to the road because climate is going to shit they call those kids \"terrorists\"...",
            "Canada has a similar idiotic far-right conservative issue. They also have a flag fetish. \n\nI really hope the world votes the far-right into oblivion over the next few years.",
            "Same in the UK tbf, then you'll see flags anywhere from pubs to gardens to attached to people's cars. That's the only time this country comes together on anything haha. I don't care about football one bit myself but the atmosphere is always fun",
            "Yeah idk about that. American flag is fine and very common where I am. A lot of people like having flag poles on their property. Or It is very common practice to put out the US flag in the morning on a deck or railing and take it in at night.\n\nIf I see the confederate flag or Trump flag, then it’s stupid obvious.",
            "That makes absolutely zero sense lol",
            "The only pricks are people like you who get butthurt when someone flies a US flag.",
            "Considering flying the flag upside down is a signal for severe distress, I think it would be appropriate to call the police to report something serious going down, potentially a hostage situation.",
            "They are constantly trying to steal symbols of the oppressed because their entire rhetoric is they are somehow the victims…",
            "Neither are they. But Sean Hannity says they should be very afraid.",
            "Unfortunately I just spent 12 years in the Army and I can't back that guarantee. The peacetime military is a weird place and there are certainly some deeply stupid antipatriots who think an Orange Julius dictatorship is the correct pathway to freedom and justice for all.",
            "The media doesn’t want to give Biden credits to keep the Trump/Biden race a close call. They get more eyeballs and clicks that way. If a candidate wins by a landslide, there’s no interest in the media. The media has to constantly downplay Biden’s achievements and drum up negative news to fuel to the “both sides bad” crowd and get people to obsessively checking in on both candidates to see who’s pulling ahead. \n\nEveryone, and I mean everyone, was expecting 2008-level of economic crisis during and after COVID. Biden managed a soft-landing, with inflation being the biggest pain point. That said, inflation is a global problem, and the US has had much faster inflation recovery than the rest of the world, to now being one of the lowest. \n\nhttps://gfmag.com/data/economic-data/worlds-highest-lowest-inflation-rates/\n\nCrazy how so many people think inflation is a US-only problem.",
            "It's insane how some people can't put together that an extreme majority of the violence in Chicago happens in areas a tourist typically wouldn't visit, like literally every other city.",
            "So basically every place is dangerous, then. Because I bet you anything the places in Chicago that has all the stories about shooting is South side Chicago. The rest is gentrification city. \n\nI lived in Dawson city, Yukon. Where people were murdered in their sleep....................... During the gold rush 100 years ago. \n\nGotta love how context is always disregarded",
            "I get that too. I’m one of the few white people in my building and have to hear all the time how dangerous it is where I live.  Reality, everyone is respectful and quiet, best building management, absolutely love living here.",
            "I live in richmond and had ti explain for over a year to everyone that my city wasn't a war torn hellzone over confederate monuments and my senior mom rides he bicycle to her knitting club through the supposed ear zone",
            "Why too many = 1",
            "I hear you. Most of the time people on Broad street are nicer, talk to you and are more willing to do something for you than any other place in the state.",
            "That sounds nice!",
            "Went to Detroit for the first time last fall for the Metallica shows. Downtown felt far safer than Ottawa’s Byward Market.",
            "Ya, the biggest threat to the D was Kwame fuckin Kilpatrick, and we snipped him off years ago lol",
            "Hell yeah on the pizza!! Detroit style drinks Chicago deep dish’s milkshake!!",
            "People in Iowa would think Ohio is a Lib hell hole compared to them",
            "Lol that's new. I always knew Portland was ultimate hipster, but not \"burning to the ground\".",
            "Mt. Vernon, IN had the highest cancer rate in the nation based on a mathematical formulation of the afflicted, the number of all people per square (whatever measurement of earth measuring with people) and some other formulae that I really don't know. I don't believe it stands today, but at one time, it certainly was. GE enjoyed dumping in the Ohio River (water source for IN, IL, and KY). It was a plastics plant, but they did produce and were fully able to chemiquate the entire recipe, mustard gas. Even more ironically, something in mustard gas was used in initial chemotherapy treatments, also. Big Ole circle of life and death connected through the universe's consistent irony. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nI recently saw a ranking list of mental health care by state and Iowa was number 51. The ranking was specific to the United States only and Iowa got gipped at 51 because the District of Columbia has better mental Healthcare than Iowa..  out of all *50 states,* boned at 51!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n#Context and information",
            "Closest I got to being raped in NYC was passing the trump tower while walking to the natural history museum.",
            "Ohio statewide murder rate 8.5/1000, NY statewide is 4.5.",
            "And the reason we have so many damn guns in Chicago is because they have no / enforce no gun sale laws in Indiana. Gang banger girlfriends and paid stooges make massive straw purchases in Indiana and bring the guns to the west side. When CPD confiscates guns used in crimes there is something like a 75% chance that the gun was bought in Indiana.",
            "In Finland the extreme right wingers started a hoax that an eastern part of our capital is a foreigner infested hellhole. In reality it is 80 % White and a well to do place with some of the newest and best homes in the whole city.",
            "Right wingers never talk about East St. Louis.",
            "Do you know what Rush Limbaugh's annual salary was? $85 million a year. A puppet peddling hatred.",
            "As a Bay Area resident, I feel this so hard lol... We definitely can see some of the poverty and crime here that would be hard to see in suburbs. But none of these motherfuckers ever come here to help anyone or fix anything. They just sit in their houses and hang up distress flags like THEY'RE the ones under attack.",
            "\"... Their headlines are the most depressing fucking thing. 'WAR, DEATH, FAMINE, AIDS, DEPRESSION, RECESSION, WAR, DEATH, FAMINE, AIDS'. but you look out your window *crickets chirping*. Where is all this shit happening!?\"\n\n-Bill Hicks",
            "Go on any rural and/or right leaning subreddit and you'll see the same exact shit.  When asked if they've ever lived in those \"hellscapes\" themselves, they'll without fail talk about \"having been there for a few days 5 years ago\" or \"having relatives there that keep them up to date\" which is code for \"I get all my information about places I've never actually been from echo chambers bouncing around the assumptions of other people that have never actually been there.\" \n\nIt'd be fuckin hilarious if it wasn't so dangerous a mindset.",
            "Like Joe “LA has fallen” Rogan",
            "Cities, predominantly big ones, are typically Democratic. Suburbs and rural areas are predominantly Republican. So those in the country are constantly bombarded with the Great Pumpkins retoric about how city crime is up and how they SO many issues with illegal immigrants (most hired and working on farms  - where? In rural areas) and the urban desolation. Therefore the closed minded Republicans believe what they hear rather than go see how the opposite it true.",
            "That coupled with the suburban lifestyle where you barely interact with anyone because you’re always in your car or in your house. It’s easy to make a boogie man out of places you never go or see",
            "One of the tvs in my gym is always on FOX News and every time I happen to glance at the chyron I see some made up or over exaggerated fearmongering",
            "AM radio where I live is terrifying. It’s like the worst podcast ever, they will say literally ANYTHING on there.",
            "I live just outside of Portland and people here still act like the entire town is engulfed in flame and overrun with homeless criminals.\n\nThats only half true.",
            "Cities are hellscapes of crime and violence.\n\nHowever if you told half these fuckers that they will be arrested for financial crimes, they'd go from \"execute all criminals\" to \"mercy\" so fast your head would spin \"oh it was my accountants who set up that Panama papers stuff\" or \"hey, I thought crypto was risk-free and fit the legal parameters for the pension plan\" or \"everyone else hires maids and gardeners for cash\" or whatever excuse.\n\nAs for violence, it's all class warfare, defunding schools and social safety nets while directing that cash to the wealthy.\n\nBut we don't really define \"crime\" as \"my boss steals my wages regularly\", so he's never going to jail for life based on some \"three strikes\" law.",
            "Funny that most of those right wing media hacks (who have become very rich spewing bullshit) live in those ‘hellscapes’.",
            "Merchants of hate.  Turn on \"Super talk radio\" for 30 seconds and see how quickly the sentiment is all about evil liberals, Trump worship or some type of culture war.  They talk about indoctrination and identity politics but love to pedal it.",
            "95% of internet pro-MAGA content is done through troll farms and propaganda operatives themselves. You’re 100% correct. Real MAGAts watch Fox (more radicalized watch Newsmax, Blaze…) or get their info from radio. If they used the internet more for news, they would stumble upon facts and possibly question their beliefs but they don’t nor do they have the capacity to debate facts with real people. Those comments and replies are fake accounts.",
            "But flowers, artisanal cupcakes, and jazz festivals don't get impressionable people riled up.",
            "This stood out to me too. I’m not well off but immediately thought “Is $1000 a lot for a couch?”  \n  \nI feel like a really nice couch is probably 5-10k but I could be wrong",
            "My current couch is hand-me-down from my best friend.  My last Couch was $35 on Craigslist.\n\nA $1,000 couch is still a luxury I've yet to attain.",
            ">Dude, what distress??\n\nWell, see, the problem is that you are not flying the same flags.  Neighbor is surrounded by godless communists.  He's got to fight back somehow!",
            "This is the one. \n\nThey believe in a zero-sum world. Someone getting anything, means you're taking that away from someone who already had it, you're trying to upset the natural order. And because the natural order for the past generations they can account for is white Christians men on top, then it must mean you're trying to take it from them.",
            "There are many of us in the suburbs who Do Not think this way! I did wonder about and ask my son, the other day, why a few of our neighbors put flags out the other day. Was after Flag Day and before 4th of July and not been there before. I just assumed some right wing statement. Most of neighborhood as usual tho.",
            "This is where the whole Woke BS comes in. It's ridiculous that they even use that term knowing what it really means...yeah it means people 'woke' up to you bullshit. And all the people said was Stop that bullshit already. \n\nTheir reaction: \"We're under attack!!!\"",
            "And the scary part is Fox would only say this stuff if it made them money, which it very obviously does.  Which begs all sorts of questions.",
            "I travel to Sweden often from the US - on a trip to Lund, a right wing American in-law warned me to watch it for all the migrants and crime. They haven't left Ohio in decades. Who told them that Sweden was bad like that, wtf? And Lund... I did go to Malmo too while down there, and that too was perfectly fine (even though they have had problems). They really are being fed non stop info that \"everything leftish is a desperate hellhole. Scandinavia is leftish. Therefore it must be a hellhole.\" Then go hunting for evidence and stories that support their conclusion.",
            "They’re boomers. Can confirm.",
            "Hell yeah",
            "I have a friend who is British and has an umbrella with the Union Jack on it.  Someone came up to us saying, \" its a shame some people think you shouldn't be allowed to show that. Good for you.\"  She thought it was the Confederate flag.....",
            "Catholicism",
            "Different opinions. I won't try and guess why. Abortion was only decriminalised there in 2019 and the populace is generally accepting (70% approval) but I wouldn't call it a 'solved issue' like in the rest of the UK (90% approval, almost never a subject of discussion amongst politicians).",
            "Northern Ireland had abortion legalised only a few years ago and is a more religious/conservative society",
            "To be fair, the country is in distress... Mostly because of the possibility of a certain convicted felon to become president and try to implement fascism... But that's just my opinion.",
            "The jury verdict was unanimous and featured a juror who only got news from Twitter and Truth Social",
            "And this person happens to be a former president and current presidential candidate",
            "We are in distress but because of Trump & MAGA. Not because Trump getting convicted for crimes he commited.",
            "Conversely, the brazen smash and grabs are terrible in Atlanta even in the nice areas with high end restaurants. The police do almost nothing, even when they find the criminals. And I speak from experience. I'd rather go to Chicago or Detroit than Atlanta.",
            "It's also mostly targeted gang violence. Not that innocent people don't get involved occasionally, but for a vast majority of the violence, it's not random out of the blue shit.",
            "Because their \"cities\" are 12 blocks and include no less than 7Subway sandwhich stores and 2 Walmarts- if their \"city\" were to have a \"dangerous area\" (read as anything other than white) it would literally be too dangerous to go into the ENTIRE PLACE because they may run into someone that doesnt look like them carrying a totally legal weapon! Oh no!\n\n\nThats okay- I'd rather they stay away from our Bean. Not like any of them uptight Christian Nationalists would know how to flick a bean if they saw it anyway!",
            "Lived in the city for 25 years and this is 100% true. And not just tourist areas, but 90% of the city is safe, especially the north side. But even with all the gang violence, it’s still not even in the top 20 for murders (per capita). If you go by raw numbers, yes, a city of 8 million people has more murders than a city of 500,000. (I’m using murders only because I know that stat. Crime generally is also relatively low per capita and is much higher in places like Little Rock, Tulsa, Memphis, New Orleans, St. Louis).",
            "Haha I live in Mpls so we frequently go down to Chi especially in the summer. My boomer conservative coworker couldn’t believe some of the pictures I showed her and how amazing Chi is in the summer. Faux News has really done real damage and rotted some brains.",
            "I worked in O'Hare greeting rich people for a limo company. Once in a while someone would be coming from OK, AR or someplace like that and would worry about getting mugged. I'd ask them where they were going to be in the city. It was usually the loop and gold coast and museums. I'd chuckle and tell them they'd be fine.",
            "Definitely not every other city. San Francisco criminals specifically target tourist areas.",
            "They also don’t understand “per capita” because Chicago’s violent crime is lower than a lot of other cities and lower than small town violent crime in general.",
            "People just love to live in fear.",
            "Crime isn’t only on the south side. Plenty of people get shot on the west side, and robberies up north are way more common now.",
            "Of all my time in chicago I only had one issue in a safe area and it was ground breaking because it hadn’t happened there in 20 years. Chicago isn’t even the top 25 violent cities anymore crime has gone way down",
            "This is interesting! Market is def not what it was",
            "I remember that fool.",
            "Deep dish is just tourist bait. Most people in Chicago eat thin crust/tavern style.",
            "Clearly they've never been to carrol county",
            "A lot of things said was news to me.",
            "Chicago also has a building with a felons name on it, no wonder people think it isn't safe here",
            "And this former disc jockey clown was the beginning of the landslide of right wing shitcasting. He found his niche, pumped up the volume for “entertainment value” and $$$ and made his name. My late Father-in-law bought in early on Rush. Listened like it was gospel. Middle class muck raking with that underlying racism and the us-against-them mentality. Be unhappy because things change. Fuck Rush and all that rode in on his greedy coattails.",
            "Same on YouTube these days but a lower level. Folks have worked out the hate and criticism pay more than positive and constructive. Our species is weird, wired for self destruction.",
            "What idiots paid him $85 Million a year?  Rich idiots?",
            "Well he must be rolling around in his grave to see those dumbasses Clay and Buck take over his spot. I actually miss him, compared to those buffoons",
            "The stuff I hear on right wing am radio here in LA sounds like straight up propaganda, and that is what you do. Soviets used to say there were labor strikes and cops killing strikers every damn day in the US, just so people would choose a different way",
            "That’s like when Fox and all the right wing pundits were blasting about Seattle burning to the ground and that the CHOP/CHAZ was a huge free for all in the middle of the city, when in reality it was in a few square blocks that you could barely pick out on a map.",
            "According to talk radio and Fox News, your streets are covered in human excrement and heroin needles. Though I'm sure there are occurrences of it (like any major city is likely to have), they take a tiny thing and blow it up to comical proportions so that you think urban life is an apocalyptic hellscape.",
            "Mine is the friend pissed about CA gun laws … are you moving to California? … no … why are you mad? … well, if you do it, it could weaken gun rights, and you know, Ohio might ban AR-15s",
            "Restoration Hardware sells $30k couches without an ounce of shame so, yeah",
            "I paid 100 bucks for mine",
            "It's honestly so fucking helpful in *immediately* identifying someone that is not going to have any real points in good faith whatsoever.  I'm thankful they adopted it because literally anyone who uses that term nowadays is just not someone who's worth engaging with.",
            "Those people ain’t watching Fox News. Fox News is too far left for them. That’s one America news or infowars material right there",
            "They may be, but this fake feeling is not just with boomers, that's what I meant",
            "😂 amen to that!",
            "The protestant DUP is going to be so pissed of that you called them Catholics.",
            "But.... Atlanta is where Andre 3000 is from. As a fan of Outkast, I wanna visit because they talked about it all the time",
            "Okay but to be fair to APD they have their hands full shooting each other and blaming it on kids in the woods",
            "That’s why they vote for Trump",
            "There’s a few studies that show that an MRI can determine how you vote, based on the size of an area of the brain that responds to fear.",
            "They are addicted to fear and outrage",
            "Probably haven't been more than 50 miles from where they were born.",
            "Fuck Rush and Russia",
            "It's not in a vacuum tho, the algorithms that serve content don't have to funnel hate, yet they do. These behaviors are learned",
            "The advertisers on his programs that knew millions of suckers were tuning in every day. And the radio syndication companies that also knew millions of suckers were tuning in.",
            "No idea who Clay and Buck are. I'd guess they hired them on the cheap.",
            "Fuck RL",
            "It's funny, Radio Liberty still tells me that I live in a totalitarian hell, just like my parents did decades ago.",
            "Our kid lives there and my husband worries because of what Fox is always saying. Thinks it's some kind of war zone.",
            "Same thing with the protests at the federal courthouse in Portland. \"OMG! The entire city is burning!\"",
            "Holy shit",
            "Totally agree with ya. It's a good indicator to avoid those persons",
            "If you hear it you can absolutely know not to waste your time with someone.  Never fails.",
            "I've lived in Atlanta for 10 years...you'll be fine.",
            "That's why they vote Republican.",
            "I had a co worker who listened to them religiously. During the pandemic one was trying to figure out how to avoid putting a mask on his Petri dish of a snowflake child during a flight. He devised that a ring pop meant that the kid was constantly eating and thus absolved of social responsibilities or the effort of parenting. Yeah, while people are dying by the tens of thousands a day due to a saliva transmissible disease, his solution was to give a kid a slobber candy to smear on everything. \n\nLater they went on to ignore the absolute basics of statistics and essentially claim crowded football stadiums cured COVID. \n\nThey basically just take contrarianism as a goal.\n\nAddendum: they rally against the “blue checks” (people with verified twitter accounts). I bothered to look one up one day; guess who had blue checks?",
            "It's Clay Travis, who is some \"lawyer\" who started a website you never heard of called outkick, and Buck Sexton, who I guess was in the CIA once and makes him an expert.\n\nLA and Southern California is a huge market, so if they took over Rush's spot they are someone ... someone stupid, but not exactly garbage bin",
            "Yep. For conservatives, their primary motivation is fear. What a way to live.",
            "For people who like to claim how tough and rugged they are and how fragile the left is, they sure piss and moan the most over any mold inconvenience like wearing a mask. Just constant bitching about every little thing that irks them.",
            "To be fair, mold can be a serious concern. It's important to take precautions when working around it. 😉"
        ]
    },
    "Some items from my great grandfather I found interesting ": {
        "title": "Some items from my great grandfather I found interesting ",
        "score": 1282,
        "url": "https://www.reddit.com/gallery/1dlqm7u",
        "content": "",
        "num_comments": 80,
        "comments": [
            "Great keepsakes, really interesting.\nRespect to your Grandfather.",
            "Idk if this breaks rules here but I found all these items and I figured they were historically significant and interesting. \n\nMy G.Grandfather @ 16 years old: https://imgur.com/a/KlEFIvS\n\nHe eventually ended up in Europe, and fought in the Battle of the Bulge. The firearm was taken from a Nazi officer/soldier (idk), along with his belt and medal apparently.\n\nI’ve been told it’s a Czechoslovakian made Mars .32 caliber",
            "Just in case you're curious about the Japanese flyer - it says that the \"military government miscalculated American strength\".\n\nBit clunky as it's propaganda, but I'm guessing they were given these to hand out or they were dropped over occupied territory.",
            "They are awesome, I've never seen a \"ceased resistance\" leaflet, I bet hardly any survived, and that money looks fascinating too. You should see if any museums would like to loan it to display/record it for posterity.\n\n[Here's an extract from a diary of a member of the 535th AAA battery at the Battle of the Bulge.](https://battleofthebulge.org/2012/03/30/diary-of-john-rafalik-535th-aaa-battery-d/)",
            "Holy shit nut. Keep that stuff in good shape.",
            "Did you get any stories from your grandpa about any of it?? Much respect for his service. \n\nMy grandpa fought in the pacific theatre and did the island hopping. I got stories from him as he (and I) got older but it was difficult for him to talk about. The things he did share though were incredible. It’s so different getting a first hand account.\n\nEdit: Just saw it was your great grandpa. So, probably not. Still a great find and a way to learn about him a bit.",
            "Just so you know OP, that 10 francs bill is worth 90€ today (96$), provided there’s a French flag in the back (which is the rarest edition)\n\nAlso: very cool stuff from your great grandpa!",
            "I think your great grandpa was a big fan of Wolfenstien",
            "Save them as souvenirs. By your comment explaining the items it sounds like your great grandfather was a badass!",
            "Could you flip that Iron Cross around and show us the back?   it seems kinda weird to me given that it says 1813 and has no other markings",
            "Nice pieces of history.\n\nAll my grandads bring backs were stolen by some junkie bastard years ago in a burglary.  \n\nIron Cross, various maps and letters (one signed or stamped by Adolf) from German HQs etc: and all his campaign medals. \n\nAll I have left from him is a German infantry marching compass.",
            "We got some German ammo pouches from my grandpa, he wasn't part of the war, however the German soldiers did pass  by my family's farm when he was young.\n\nFrom what I recall, he made friends with a few of them.\nThis was in Norway, at some point.\n\nMy brothers and I each got one!\nThey're not particularly rare, however it's a nice keepsake to remind me of my grandpa, who is longer around.",
            "What can we hand down from our time for future generations? Nothing as unique as this.",
            "Nice, great Gramps was a nazi killer.  We need more like him in Pierre.",
            "That iron cross is an awesome artifact",
            "It does resemble a Czech Mars, although the grip differs a bit from the one seen in this [Forgotten Weapons ](https://youtu.be/6dIReggB6qs?si=nc-BrhMPZ6w2YiYL) video about it. Might be a wartime simplification thing. The vid has some good info on these guns, if the markings on the left side match what you see in the video then the identification seems solid.",
            "Fascinating!",
            "Wow. I heard of it. But I have never seen it. Square paper money.",
            "Very interesting items.",
            "These are the kind of things that a local history museum would be interested in displaying. They can also help in determining more about the history of each item. You may want to talk to the museum about loaning them for exhibit.",
            "That’s really cool. Makes me want to share some of the stuff my grandfather and great uncle had from WW2",
            "Looks like a sweet 22 Short. I love that caliber. You can be broke and buy a box. Well, You used to.",
            "In Stephen King’s *The Dark Tower*, that first photo reminds me exactly of what the protagonist means when he describes a Docker’s Clutch",
            "Lol you probably shoulda specified it wasn’t his stuff. My first thought was “this guy’s great grandfather was a fucking nazi!!’",
            "Looks like a Belgian browning with simplified wartime grips imho. But could be wrong.",
            "Thank you Kanye, very cool.",
            "Interesting. How did he get his Hands on an Iron Cros from 1813 though? That was over 100 years old in WW2.",
            "Excellent finds! Very cool",
            "Grandpa was a cold war secret agent",
            "Damn, that cross is from 1813??",
            "The last one... The thing with the cross, is that the....",
            "So, you had his ball sack tanned?",
            "Some collectors items there. Could be worth looking some decent cash.",
            "Incredible history. \n\nThe fact that all the money was square; I’ve never seen a Lira, and my grandmother emigrated from Sicily. \n\nI’m sure the Japanese writing is also highly racist but if anyone could translate I’d love to know what it says.",
            "It looks very much like my .32 caliber French MAB model C, which was basically a copy of the FN 1910. There were apparently a ton of 1910 derivatives around, of varying quality.",
            "Yes, it looks just like the Czechoslovakian Mars shown here: https://youtu.be/6dIReggB6qs\n\nThe markings on the left side of the gun should confirm that.",
            ">The .32 Mars had a profile very similar to that of the FN-Browning Model 1910. The Mars pistol was the lowest-priced pistol in its class produced in Czechoslovakia before 1938. Kohout & Co. continued production of Mars pistols during the German occupation. In 1945 production stopped and has never been resumed.\n\n\nhttps://www.tresbohemes.com/2017/08/czechoslovakian-handguns-from-1918-to-1964/",
            "The belt buckle seems to be that of a Policeman or fireman. \n\nhttps://www.worldmilitariaforum.com/forums/index.php?/topic/314104-german-police-belt-buckles/",
            "Damn I'm jelly. Neither of my grandparents had cool shit like this.",
            "id argue not rlly cool to take a medal tho.",
            "Just did a bit of research on it. But apparently there are different classes and variations of the iron cross. The one pictured appears to be an Iron Cross 2nd Class. But it lacks its black, white, and red ribbon. This one was particular to WW2 also. Found it [here](https://www.atthefront.com/product-p/gaek2.htm)",
            "Yeah, you think that now, because whatever future generations decide is unique is not up to those living right now.\n\nCould be certain types of cell phones, playing cards, hell it could even be a shake weight.\n\nOr it'll be American flags/icons given how much war they take part it, if you're speaking specifically on the \"uniqueness\" of war time items.",
            "The United States Forces Certificate didn’t give it away?",
            "They were apparently double sided. The back of the ones from 1939 had \"1813\", indicating the date the award was first created.\n\nThe front would have \"1939\" under a big swastika.",
            "Speculation seems to be abound but it could have been from the same soldier or soldiers he got the other stuff.",
            "The item on the left is an Iron Cross which was a commendation for German military personnel. It's history in one form or another goes back beyond WW2. The item on the right is your pretty standard \"Got Mit UNs\" buckle. The ones with the sole swastika in the middle were police ones if I remember right.",
            "It says “the (Japanese) military commanders have miscalculated American strength”",
            "According to ChatGPT: \"The United States miscalculated its military strength.\", but I'd take that with a large grain of salt.\n\nEdit: I mean take the translation itself with a grain of salt 🤣",
            "I have a similar collection of currency that my grandfather brought home from Europe. My favorite bills in the collection are the square ones. They're not Francs and Lira issued by France and Italy, they're special bills for use by the allied forces. You can see that some of the design details are really similar to U.S. currency.\n\nhttps://en.m.wikipedia.org/wiki/Allied_Military_Currency#:~:text=Allied%20Military%20Currency%20(%22AMC%22,a%20form%20of%20currency%20control.",
            "You might be able to get a translation with Google translate app. Download app, you can't do it with the online version. Then select for 'detect language' , right side of arrow should default to English. Then hit the camera button and point it at the Japanese writing.\n\nThis worked pretty well for me on some Chinese instructions that came with an Amazon purchase, hope it helps with Japanese too!",
            "If this stuff were mine, I'd build a tasteful display case and have it in my house, somewhere out of direct sunlight.  You've got some really cool historic family keepsakes.",
            "Yea I see for the first time Italians used the term Lira. Interesting.",
            "It says 軍閥は米国力を誤算した, which roughly translates to “(Japanese) military leadership(gunbatsu) miscalculated American national strength”. Since it implies that Japan would lose the war, I assume it’s a propaganda leaflet dropped by the US, or possibly a post war propaganda poster. \n\nDefinition of gunbatsu: [https://en.m.wikipedia.org/wiki/Gunbatsu](https://en.m.wikipedia.org/wiki/Gunbatsu)",
            "Just posted a separate comment, missed this haha",
            "Yeah, I've been having a look, could it be a Ruby 32, especially if there are no markings, and yes a derivative of the FN 1910 by Browning. They were apparently very common in France and used by Vichy forces and later issued to Second Line German troops.",
            "Who cares it was a nazi",
            "My first thought was he had taken it off a Nazi soldier.",
            "It’s the internet, you expect people to read???",
            "Since when did the US use the DDMMYYYY format?",
            "A German could of taken the certificate\n\nSo what's more likely someone steals a bit of paper or they fought at the bulge...\n\nOps grandad definitely a nazi /s",
            "No. Its surrounded by lots of nazi stuff",
            "Oh, ok. Didnt know that.",
            "But what were the soldiers doing wit a 100 year old Iron Cross that certainly was not awarded to them? \nExplanation seems to be that this is the back side, as mentioned in another comment below.",
            "So was that an American propaganda or Japanese propaganda poster? I assumed American based off the depiction of the Japanese",
            "I speak a little Japanese, and the first thing that you need to know when using a translation app is that Japanese drops the subject and leaves it open to inference *a lot*. So when something like this doesn’t make a ton of sense, try flipping the subjects and see if that works, if so that’s probably the more accurate translation. In this case “the military strength of the United States was miscalculated” makes a lot more sense on this pamphlet and I would bet a lot of money that is the more accurate translation.",
            ">a large grain of salt.\n\nA Himalayan mountain of salt.",
            "\n\n*drops two nuclear bombs*",
            "I don't think that chatGPT have learned yet to make proper use of obscenity.",
            "Could it be a praga .32 pistol, it looks very similar",
            "Preposterous!",
            "Expect what",
            "Good point but whoever hand wrote the date at the top right did it in American format",
            "[Here's both sides of one.](https://aboutww2militaria.com/ww2-iron-cross-2nd-class-1939-marked-7.html).",
            "Its an American propaganda poster. Japan would never have admit to miscalculating anything or admit to being wrong for a propaganda poster.",
            "The hero we needed",
            "You could be right, I'm no expert but I think there were a lot of variants of these type. It's a very interesting capture gun and possible that, given it was taken from a German Soldier, it might have been a capture twice. Apparently these types were often taken from Restistance who were killed or captured.",
            "Oh very good point"
        ]
    },
    "For the state of Louisiana": {
        "title": "For the state of Louisiana",
        "score": 816,
        "url": "https://i.redd.it/rb3tr3t4g38d1.png",
        "content": "",
        "num_comments": 38,
        "comments": [
            "I told my husband, \"You can't teach kids that this country was started by the Protestants who escaped their county for religious freedom; then turn and force your version of religion on them.\"",
            "This is why their version of Christianity is so dishonest. It is never about doing something positive or good. It's about fighting the libs",
            "Kids deserve free lunches either way",
            "They are Taliban-wanna-be's.",
            "It's just a control game by the crazy religious nuts. It starts with the Ten Commandments until they're eventually teaching this nonsense in the classrooms.",
            "Giving food to children is just about the best use of my tax dollars I can possibly imagine.",
            "That's the most *actual* christian thing I read in a while",
            "God is almighty but need you to worship",
            "The one thing that I have noticed is that these folks are not \"Christian\" by any objective definition. Most are totally ignorant of the scriptures that they claim are the literal word of God, particularly the New Testament. I am a recovering Catholic who was fully ~~brainwashed~~ ~~indoctrinated~~ educated in religious schools until I finished high school. I am fully confident after having had several conversations with them that they don't have the slightest clue what Jesus would have been about, regardless of whatever flavor of \"Christianity\" they belong to. If I were to still be a religious sort, I would label them heretics.",
            "Look up what Minnesota Governor Walz said as well: \"We don't have the 10 commandments posted in our classrooms, but we have free breakfast and lunch.\"",
            "Preach!",
            "looks like USA needs a marcus rashford to shame them into doing something right",
            "Funnily enough Jesus never said to worship him. Neither of these groups know the Bible.",
            "Yep",
            "Nope, that’s still christianity no matter how much it makes your own beliefs look bad",
            "You're assuming they're teaching that first part correctly anyway.",
            "To be fair they wanted the religious freedom to be total fundamentalist freaks",
            "You realize they wanted the religious freedom to be even stricter, moralizing Christians. They then came here and got to do what they want.",
            "\"When fascism comes to the US, it will be wrapped in a flag and carrying a Bible.\"",
            "It’s always in direct opposition to what would actually help more people while showing and experiencing love.",
            "… OOORRRRRR maybe their interpretation of Christianity is a bit different than yours?\n\nBut sure, you probably just know better.",
            "Yep, I don't believe in any gods but I do believe in feeding hungry kids",
            "Seriously, My kids school charges $4 for lunch, and $2.50 for breakfast.  If they were to just eat lunch at school, that's $760/year, which, while not an expensive cost, is still infuriating.  During COVID years, every kid got free lunch and breakfast in my state, that shit helped a lot.",
            "Tax payer subsidized lunches.",
            "Talibangelicals",
            "Which version of the Bible is all about judging others and crushing the poor? I missed that one.",
            "What interpretation would lead someone to believe helping poor children is bad?",
            "Jesus' teachings aren't given in a way open to interpretation, really. Take care of the children and the poor, be kind to your neighbors, pay your taxes and be chill, since none of this matters and heaven rocks. \n\n\nBut yeah I can see how they think they're following the guy.",
            "Like tax payer subsidized roads.\n\nEDIT: I like taxes. Taxes pay for \"civilization\", and I like civilization.",
            "[Which will pay for itself](https://www.restud.com/is-the-social-safety-net-a-long-term-investment-large-scale-evidence-from-the-food-stamps-program/).",
            "Mini Van Taliban",
            "The Republican Jesus interpretation.",
            "We don't call them \"free roads.\" I'm all for providing students lunches, but they're not free.",
            "Can we not get over this point? We know they are not completely free but to that child who needs to eat they are and that’s what matters.",
            "If they werent paid by taxes, you would have to spend a lot more for your road use than what is the portion of your taxes going for the roads.",
            "Even doing nothing is not free when considering opportunity costs. It's actually cheaper on the taxpayer to subsidise food through taxes than not doing it, due to the missed opportunity of empowering future tax payers.\n\n[It is 62x cheaper to do food stamps than to not give out 'free' food.](https://www.restud.com/is-the-social-safety-net-a-long-term-investment-large-scale-evidence-from-the-food-stamps-program/)"
        ]
    },
    "Elsie Allcock Has Lived In The Same House For 105 Years.": {
        "title": "Elsie Allcock Has Lived In The Same House For 105 Years.",
        "score": 7192,
        "url": "https://i.redd.it/8nn506oh008d1.jpeg",
        "content": "",
        "num_comments": 184,
        "comments": [
            "Boy, people really do shrink.",
            "There can’t be very many people who have ever lived in a single home for longer than her in the entire human experience.",
            "105 years in the same house? Elsie Allcock has seen more history from her front porch than most of us have in a lifetime!",
            "105 years of living with the last name “Allcock.”\n\nThat probably does something to ya.",
            "British Woman’s Unwavering Devotion to Her 105-Year-Old Home\n\n(https://allchronology.com/2023/07/18/a-century-of-memories-british-womans-unwavering-devotion-to-her-105-year-old-home/)",
            "House is double glazed and bricks are painted now, and I bet she has the best grandma-grade garden in her block. \n\nAnd she is about a foot shorter :)",
            "Landlord: \"This rent control is killing me!\"",
            "She’s gotten much less creepy over the years.",
            "And only has 34 more payments on it.",
            "Same haircut also",
            "Before color, Elsie was the Jigsaw doll apparently",
            "People really never be leaving their parents’ house.",
            "Is it just me, or in the first image does it look like she's holding onto the railing that doesn't exist yet? Or has possibly been edited out for some reason?",
            "Her height chart be like\n\n\n\n\n-25 \n\n-73\n\n-99\n\n-16\n\n\n\n-13\n\n\n\n-9\n\n  \n\n \n\n \n-4",
            "That's why I can't buy a home /s. Lovely woman wish her well.",
            "And her ghost will live there for 105 more",
            "Incredible! She looks great 😊",
            "She was an old-looking baby. Elsie Button.",
            "What fun pics!",
            "I love what she's done with the place!",
            "Windows been replaced",
            "Elsie is still a lovely woman, great story…",
            "Let’s go for 106!",
            "Imagine her original mortgage payment?",
            "Elsie Allcock Nofun?",
            "wow, how old would that make her?",
            "A lot of us millennials might be saying the same when we inherit our parents house and are never able to financially justify buying property in these modern times.",
            "She looks like she'd like to play a game.",
            "Man she could make bank on it I bet",
            "Shrinkage is inevitable",
            "Nice pictures!",
            "Holy shit",
            "Wow",
            "Life goals",
            "Easy when you were born 100",
            "That’s nothing during the pandemic I didn’t leave my house for 250 years",
            "Allcock, no block",
            "My mom had a cousin like that, spent her entire life in the same NY apartment. \n\nI don’t even think she traveled, ever. The word “agoraphobia” was never said that I can remember, but now that I think about it…",
            "Love the improvements…..the handrail.",
            "And nobody body better F***! With her either.",
            "what a lovely woman",
            "105 years, allcock, all the time.",
            "A few years ago a friend of mine was takes to remodel a 80 year old house that had a single owner that had died, causing the sale of the house by her family. My friend called me in to just look before he started the remodel because everything was still original. Boiler in the basement, a huge hearth in the kitchen for a wood burning oven / stove and a butcher-block wooden countertop with a slope to the sink. It was cool and sad at the same time. In the front living room there was a large, arched window that was beautiful but… just letting cold air through flooding the room. And knowing a woman lived there with very little upkeep for her whole life.",
            "At least they finally painted it something other than black/white/gray",
            "Crazy thing is she lived in and flipped houses for a living for while first",
            "I would to if anyone in my family could afford a house.",
            "That bannister sure grew",
            "My grandfather made it to 105 and I think he was born and died in the same house. Going to find out.",
            "That scared me—thought I was on r/ghosts for a second",
            "Wonder what her quirk is…",
            "She's on the property ladder, just needs to spend $10k on a finance course and learn how to leverage her assets, could be in a 5 bedroom with a double garage and a pool within 2 years!",
            "Home sweet Home",
            "no way! That house must have the best rent control in history",
            "is she still single until now?",
            "Allcock, no balls",
            "She's old",
            "Allcock no breaks",
            "For a steep £50/year since the War.",
            "Looks like she never changed the curtains.",
            "Congrats on the new porch light!",
            "GILF",
            "Id fucking lose it",
            "Did she really took all cocks? Must be an aging recipe.",
            " Ģqevae",
            "Just as scary /s",
            "Wild. I haven't lived in the same place for more than 2 years",
            "So not only that but she is the oldest woman alive.",
            "The bricks are different sizes.",
            "Allcock? no balls?",
            "I bet it’s full of old person smell",
            "It's not just her name, it's also her secret to staying young.",
            "Sounds pretty boring, but maybe that house is just next level comfy",
            "Do these photos make anyone else sad?",
            "Imagine the smell",
            "Photography did that woman no favours in the first shot.",
            "[deleted]",
            "I bet after listening to the advice of Reddit she now owns a dehumidifier,",
            "It isn’t just the home you live in. It is the family you live with.",
            "she should be tortured",
            "Just die already. These type of geezers are hoarding every decent piece of property on the planet.",
            "Almost a full 2 bricks!",
            "Maybe she was in the pool.",
            "My mom used to be maybe an inch shorter than me, but last time I hugged her I noticed she barely reached my nose. ☹️",
            "Oh, fuck. Im gonna be helllla short",
            "Allcocks shrink at some point.",
            "I wonder how her feet feel. My Grandma's feet grew two sizes as the rest of her shrank.",
            "It's not as much difference as it appears since the old photo was taken from a lower angle, making her look taller",
            "She is standing on a step in the earlier photo and she is on the ground level on the second photo.",
            "I’ve seen this photo countless times over the years. I wonder if she’s still alive",
            "My grandma brags about not losing height. She’s in her 90’s and in incredible health.",
            "Compression",
            "Holding onto an overhead bar and hanging until your hands can't hold will help keep the spine lengthened and straight. It's such an overlooked exercise.",
            "Tell me you haven't seen many years without telling me you haven't seen many years.",
            "THATS WHAT I SAID!!!",
            "Maybe its cold out my guy, Allcocks shrink when its cold",
            "My grandfather got close, born on the family farm, inhereted it from his father and died there at 95. Never moved once in his life.",
            "*Connor MacLeod has entered the chat*",
            "Gma just moved out of the house she was born in. She's 99.",
            "Yeah it makes me think of my 101+ granny (still alive) who was born and lived in her house until 99. We wished her to pass in her house. But at some point it is a full time job and unfeasable. She still go there every odd day for lunch when she is not too weak. That lady live with her son I checked. I will gess her son is at least 75 yo, most likely 85...",
            "We have been in this house for 105 yrs. We moved in 2005. Longest 20 yrs EVER.",
            "My grandma is 99 and still lives in her childhood home.",
            "Great granddad was packing",
            "\"Are you at all Bi maim?\"\n\n\n\"No, its Allcock for me!\"",
            "She’s all cock and no balls.",
            "Isn’t the actress’ who played young Rhaenyra on House of the Dragon last name Allcock?",
            "#allcocksmatter",
            "Knew a dude in the military with the last name Adcock. We called him bonus dick.",
            "Explains why she shrunk over the years",
            "Weird title. The home surely must be older than her.",
            "\"Born in June 1918, just before the outbreak of the Great War\"\n\n\nI don't find this source to be very trustworthy. ",
            "Amazing they found a camera that had less resolution to take the photo with",
            "Hypothetically if she was a tenant and the rent control somehow lasted that long, her rent would be about £8/month.",
            "She *is* the landlord?",
            "More like landlord’s grandkid",
            "And more color.",
            "What do you mean? She has a stick now.",
            "I’d much rather fight the right picture. But she has a weapon. Oh wait that’s a handrail… Yea I think I could win that one.",
            "She'll max out the creepy once she passes and starts haunting the shit out of the place.",
            "Got it 100 years ago, probably only cost a tenner",
            "I’ve had the same haircut for 20 years but it’s mostly because I went bald",
            "Took her a while but she finally fixed that detachable jaw",
            "Yes her hand is in a grasping angle/posture. The photo was edited at some point.",
            "More a like a random speck or crack that looks like a part of a hand",
            "....what?\n\nedit: oh those are ages. I kept thinking they were changes in height",
            "Don’t think you’d want that one, connected to another property",
            "She'll be 106 in a week exactly. She was born in the house and then she and her husband bought it.",
            "I would guess 105",
            "depends when she started living in the house  \nI suspect she was born in it",
            "Yeah - so she's like 135?",
            "Yea I’m 40 years in and frankly I don’t want to have to suffer another 65+ years to take this title. She can have it.",
            "Wut. If you inherit a house, that's a substantial amount you can put towards another house...\n\n\nThere's no logic where that statement makes sense. ",
            "Rented for over 50 years now owned for 65!",
            "Lmao I’m fuckin sent mate",
            "Elite.",
            "Looks cheerful inside",
            "iPhone cameras were a lot worse 80~ years ago",
            "that's kodak film for you",
            "This woman went through Nazi bombings and food rations",
            "![gif](giphy|uPeIAUkhYSqCeFSFlv)\n\nHappy cake 🍰 day 🎉",
            "As an American, this is the kind of measuring I can understand. You give me height per brick and a banana for scale and I’ll tell you how far away galactic bodies are within 2 eagle caw caws of margin for error",
            "I wasn’t the only one counting lol",
            "That cracked me up.",
            "I'm going to make the argument of 2 full bricks exactly! Previously was 3.5 bricks down from the doors further arch. Currently 5.5 bricks down from the doors further arch.",
            "That's how much my cocaine stash has shrunk.",
            "Probably Allcock for 105 years.",
            "[LIKE A FRIGHTENED TURTLE](https://media.tenor.com/zbHG7PHrCPAAAAAM/george-costanza-seinfeld.gif)",
            "You're saying Allcocks shrink in the pool?",
            "George?",
            "I don’t know I’m not 100 but I’ve shrunken 2 inches already.",
            "It’s true but you can count the bricks from the base of the windowsill and see she did shrink a pretty decent amount",
            "I wonder how that feels….. I get anxiety staying/living in one spot too long but I have friends who love the neighborhood we all grew up and can’t imagine living anywhere else.",
            "There can be only one.",
            "Of Clan MacLeod? ",
            "She moved out at 99!? So close to hitting three digits.",
            "Actually she was never married. At the age of 22 she decided to legally change her last name to honor something that she cared for greatly.",
            "Allcock, Noballs.",
            "Thor and the search for the Allcock",
            "“Excuse me ma’am…Is that a sock in your pants?” \n\n“No, it’s actually…”",
            "They did not care for coloreds back then.",
            "Suppose she’s got a piece of fresh fruit?",
            "I read the article and apparently they moved in 105 years ago and the rent was £30 in today’s money (article doesn’t specify if this is weekly or monthly). Her family bought it in the 60s for £250, just over £5000 today.\n\nCorrection: her family moved in 1902 before she was born.",
            "They are referencing her height over her years. You know when people mark their height along a door frame.",
            "Doesn't look a year past 125.",
            "I tried to make a light-hearted joke about current housing that wasn’t meant in a mean-spirited way, and I’m sorry if it came out wrong. \n\nThat lady survived a lot to reach that age and bravo for her. I wanna make a joke about her also surviving Margaret Tatcher cause I know of some British ppl that hated her policies lol. Again, I’m sorry, I wasn’t trying be rude or mean.",
            "Wait till you hear about Stone!",
            "2 bananas",
            "How many football fields is that?",
            "I think you just cemented yourself as pun king",
            "All cock and no balls",
            "I WAS IN THE POOL!!!",
            "I too want to move around. I like new surroundings. I even just rearrage the furniture ever now and again just to for the plcae to feel \"new\".",
            "I get anxiety just existing.",
            "All of them.",
            "That is the perfect comment and I’m going to cheerfully steal it to use when the opportunity presents itself. Great stuff and bravo.",
            "Same",
            "You got me",
            "😁",
            "I'll take one butt of wine please. Oh and a couple Nebuchadnezzars for my friends.",
            "I...I didn't mean to.  PEOPLE PLEASE, I DIDN'T WANT THIS.",
            "I don't know how you walk around with those things.",
            "Luckily, you've only gotta drive about 40 rods to get it in a butt where I live.^^^giggity",
            "Too late. As a 48 year old dad, I pledge allegiance to The Pun King. Lead us, oh wise one!"
        ]
    }
}