{
    "Weekly Pricing/Buying/Selling/Grading & General Questions Post": {
        "title": "Weekly Pricing/Buying/Selling/Grading & General Questions Post",
        "score": 4,
        "url": "https://www.reddit.com/r/PokemonTCG/comments/1dhkxkp/weekly_pricingbuyingsellinggrading_general/",
        "content": "Hello! This is this week's weekly pricing, buying, selling, grading, and general questions post. Here you can ask the community what your cards might be worth, if you should buy what you have your mind on, whether or not you should grade a card, etc. Be sure to post images where applicable.\n\nYou can also check out the [Pokemon Quick Info Guide](https://www.reddit.com/user/Lyleberr/comments/mughq3/pokemon_quick_info_guide/) made by u/Lyleberr.",
        "num_comments": 83,
        "comments": [
            "Hey! I'm new to card collecting and was just wondering what the best and ideal way to protect cards is. I don't really know what I'm doing so I just throw every new card to my collection into a penny and dragonsleeve. Should I get plastic toploaders for valuable cards? Is a binder a good idea?\n\nI care about protecting cards for display and collecting, I don't care about their future value. I just want them to be nice and pristine so they look good.",
            "Hello, I'm looking to buy a PSA10 Umbreon Vmax alt art from Ebay and was wondering, if anyone has experiece purchasing more expensive stuff there? Am I covered by money back guarantee in case i recieve a fake one? Somewhere I've read they authenticate the card before shipping, but can't find any more info on that. The seller has a 100% positive feedback, with 700 items sold. But I'm a bit sceptical cause the cert. number on the slab has been blacked out. This is the listing im reffering to. Any info is highly appreciated.",
            "General Question/ how do people deal with scammers? Do you call them out on being one, or ghost them? \nI put up an ISO post on FB, and a guy messaged me saying he had the card I was looking for. He sent a picture from an eBay listing… I asked for a timestamp and a couple hours later, he sent what looks like a slightly zoomed in photo of the same thing, with a photoshopped piece of paper with name/date. It literally has the same dust spots/background as the OG photo just slightly zoomed it and then slightly out of focus. He’s also asking Half the price of the eBay listing (big red flag).",
            "How \"valid\" or \"reputable\" is the grading service via Carmarket?\n\nI know PSA and the likes seems to be on top just due to being on the market for a log time and made themselves a name, but for me, living in the middle of Europe, a \"local\" grading service would be much better imo.",
            "Hi, is there any “must have” apps on the phone for collectors? For values, or to keep track of sets? I’m just getting back in and feel a little overwhelmed but jumping between tcgplayer and hand written lists haha",
            "Just found a bunch of my old cards from middle school, I'm 37 now and have no idea if they're worth anything.  I have a chansey, nidoking, clefairy, ninetails, machamp, poliwrath, hitmonchan, mewtwo, and gyrados.  Any advise on if they're worth getting graded or amhow about doing it?",
            "Newbie here. Any apps or website where I can track both ENG and JPN pokemon cards in my collections?\n\nThank you!",
            "What is a reasonable % for resellers to buy at? Pulled a SIR Perrin and never really sold cards before but idc about trainer cards. I have no idea how close to market I should be looking for.",
            "I’m looking into maybe selling some of my cards, is there a reliable site/source for me to check pricing?",
            "I just got a Twilight Masquerade box, and the signature Ogerpon card in it (the one that comes in its own packaging) was warped... what're the chances I can get it replaced, and how?",
            "I just got a Greninja ex. Tbh I don't know anything about the TCG and I just wanted to know if it was any good",
            "I’ve seen in a few YouTube videos that JP 151 god pack odds are 1 in 6 boxes.\n\nThat’s not true, surely?",
            "Hi, any recommendations for good Pokemon shops in London? Central or South East London ideal, but also North London around the Tottenham area. We recently discovered Collectors Cardhouse which is bloody amazing, but it's just so far from us and we're never in that area. Would love to know about more shops like that around London.",
            "How exactly does grading work? I understand you have to send it in to psa, but the flat cost is per card or per package? I generally don’t understand the grading process but just ripped some packs for the first time the other day and got some cool pulls I would like to get graded",
            "Hey all. I pulled Magikarp - 203/193 from Paldea Evolved. \n\n  \nI want to get it graded, but I'm in South Africa, so grading is done by a 3rd party who sends it off on the local party's behalf. The cost is about $40.\n\n  \nIs this worth it? I see the value does increase substantially for a PSA 10. \n\n  \nAny dust is on the outside of the toploader. [https://imgur.com/a/8OX2aWq](https://imgur.com/a/8OX2aWq)\n\n  \nThanks in advance.",
            "what is the best booster box to get?",
            "I waited a month to buy some cards (gg35 and gg40) now they’ve doubled in price, I’ve noticed this with a bunch of other cards I was planning on getting this month too (although not increased as much as mentioned cards). What’s caused this price increase over the past 1-2 months?",
            "Hey all, my GF loves 151, and I can't find it in any of our local stores. heard there was gonna be a reprint run (now? Soon?) just looking for some info on it and any suggestion of online sites to order it from (US, east coast)",
            "I got selected for the raffle for the worlds tickets in Hawaii. I received Sunday but I would like to trade for Saturday because I watch Pokemon Unite. Please message me if you want to trade. Thank",
            "Is there anywhere I can buy specific Pokémon cards that’s reliable and ships to Canada?\n\nI must acquire shiny clodsire",
            "I have credit on card market and I have to spend it. Looking at Tatsugiri IR or Ogerpon hyper rare. I like both cards. If you had to pick, which one would you buy?",
            "Looking to sell these cards! Can send better pics if you’re interested!\n[https://imgur.com/a/bGAXXep](https://imgur.com/a/bGAXXep)\n\nCharizard #234 - $130\nUnown #177 - $25\nCharmander #168 - $27\nCharmeleon #169 - $23\nBulbasaur #166 - $20\nGalarian Slowking #179 - $40\nMew #193 - $15\nGarchomp #TG23 - $30\nAdd $1 for PWE $5 for BMWT",
            "Looking for a lightly played / near mint 2015 mcdonald’s skitty promo card!",
            "I’m looking for team bags that fit 2 stacks of Pokémon cards horizontally, anybody have any links to bags that fit this description? Regular team bags just fit 1 stack vertically.",
            "I recently got a Celebrations UPC and love the two metal promo cards that came with it. Question is, what's the best way to keep these safe? Leave them in their little plastic clamshells? Or take them out, perfect fit sleeves, then into a one touch into a team bag?",
            "So I got 3 cards from a s/v pack that are miscut where there's like no silver above the card art. Is that sought after or pretty common?",
            "Can someone please help me grade this 151 zard? I'm really bad at determining centering. \n\n[Full card](https://cdn.discordapp.com/attachments/1011308902937268244/1253496883327012954/s-l1200.webp?ex=66761171&is=6674bff1&hm=2b24be80b8e8ba2b9bd8cfa87c343c737a4c3e12b77c498dea582bdc7c7f29b4&)\n\n[Top left](https://media.discordapp.net/attachments/1011308902937268244/1253499911219970208/s-l12001.webp?ex=66761443&is=6674c2c3&hm=7964e7e53dd2758b61ca7a6e26fd9d835dcb2bac0742a05b77d35985c412d2e6&=&format=webp&width=503&height=671)\n\n[Top right](https://media.discordapp.net/attachments/1011308902937268244/1253499910771179591/s-l12002.webp?ex=66761443&is=6674c2c3&hm=01788f1d3f0d911093c91ff35b22bc44b83e4500bf7e79184b801afbcb9a3690&=&format=webp&width=503&height=671)\n\n[Bottom right](https://media.discordapp.net/attachments/1011308902937268244/1253500550088102020/s-l12002.jpg?ex=667614dc&is=6674c35c&hm=619f9366ef418207dedbb6337928b967edff82dfb9660d34ce5d3efd2dfa6c19&=&format=webp&width=503&height=671)\n\n[Bottom left](https://media.discordapp.net/attachments/1011308902937268244/1253500550306336891/s-l12001.jpg?ex=667614dc&is=6674c35c&hm=603594df17f9eae717e0195a1afa7c25b90fcad3f4e922ce80297217b81c0087&=&format=webp&width=503&height=671)",
            "I just bought a 151 upc off of Amazon. Bad decision? Is going to come with opened packs and stuff?",
            "Hi I’m new to Pokémon cards and I wanted to know how much these cards are worth paying for please pm me if you could help me figure this out and I can send you the pics thanks",
            "Hey, I’m looking to try and quickly sell some slabs. I got a Sylveon Vmax Alt Art PSA 10 for $300, and a Urshifu Vmax Rapid Strike Alt Art PSA 10 for $145. Prices are open for negotiating. https://imgur.com/a/7x0SveI",
            "Hey guys, hope you're doing well. I found an old french card binder while cleaning my room, can you please tell me if there's any rare/valuable cards ? \nYou can check the pictures here : [old binder pics](https://www.reddit.com/r/PokemonTCG/s/JgjJ5dEywp)",
            "[https://imgur.com/a/iQllCCc](https://imgur.com/a/iQllCCc)\n\nMost of the cards in these are foil cards, are they worth anything these days?",
            "[removed]",
            "Sounds like you're already double-sleeving, so you're off to a great start! I also use a perfect-fit dragon sleeve and a penny sleeve or equivalent.\n\nAs far as what's best, it boils down to mostly personal preference. I prefer the ease of using a binder and just double-sleeving, but some collectors will keep their cards organized outside a binder in top-loaders or magnetic cases.\n\nFor binders, avoid 3-ring binders; they can cause your cards damage. I use a [TopDeck Binder](https://www.amazon.com/gp/product/B081W1L6FL/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&th=1), but anything similar to this will do. They also make specialty binders that can hold graded cards/top-loaders/magnetic cases.\n\nAnd with binders, always store them vertically and not horizontally on top of each other. You want to make sure you're not adding any unnecessary weight on top of your binder. \n\n  \nAnd lastly, whatever storage method you use, make sure your cards are kept out of direct sunlight! The sun will bleach your cards.",
            "I'm not *super* familiar with how FB groups work, but if there are mods you could try reaching out to them with your concern.\n\nIf not, I think it's a nice gesture to make a post to alert others in the group to be vigilant. I would just make sure to stick to the facts and keep it civil.",
            "I recommend [Pokellector](https://www.pokellector.com/). You can keep track of what you've collected and see averages prices across eBay, TCGPlayer, Cardmarket, and Troll and Toad.\n\nAlso can try [Pikastocks](https://www.pikastocks.com/news) if you want more of a price overview of your collection, but I personally prefer Pokellector.\n\nIf you're dead set on a phone app, check out [Dragonshield.](https://poketcg.dragonshield.com/) Allows you to scan your cards with your phone camera and it was automatically add it to your collection and give you an overview on your collection worth.",
            "I would start off with checking prices on tcg player or PriceCharting the app or maybe even alt the app. Then consider psa grading because it’s what people “know” however they up charge a ton and are in and out constant scandals. If that isn’t up your alley then consider csg. If you think you have a strong ten contender then go for Bennett grading. However, if you want to take out the “human” aspect and biases I would do AGS and have artificial intelligence grade you r cards",
            "Collectr app has English and japanese.",
            "Reasonable to you or to them? I personally wouldn't sell my cards for less than 80% of their value, but typically, resellers will give you anywhere from 55% to 75% of the card's value.",
            "ebay, tcgplayer & cardmarket",
            "If it's this card, it's only about $1 for a new one. \n\nhttps://www.tcgplayer.com/product/552785/pokemon-sv-scarlet-and-violet-promo-cards-teal-mask-ogerpon-123?Language=English",
            "Define \"good\". Also there are multiple versions of that card, so the answer may depend on which one you have too.",
            "If youre lucky",
            "The cost is per card and (for PSA) depends on the value of the card once graded.",
            "The one you like the most.",
            "Paradox Rift or Temporal Forces",
            "There was a JP reprint, but no announcement of an English reprint. I recommend ordering it online from eBay or TCGPlayer.",
            "Ebay or TCGPlayer are both reliable, given that you purchase from sellers with plenty of good reviews.",
            "Tatsugiri",
            "/r/pkmntcgtrades",
            "If you upload photos, we could let you know.",
            "Centering looks good!",
            "A gambler I see",
            "Potentially lol. The rule of thumb is to never buy off of Amazon due to the number of reseals/scammers. Good luck!",
            "Pretty cool cards, but nothing particularly rare or valuable in there.",
            "Lol, if you dont know then you shouldnt be investing",
            "Thank you! I will definitely give them a try 😀. I appreciate the reply.",
            "I guess reasonable wasn't the right term, more standard, and thanks.",
            "Take a look on my profile. Idk what it is to be fair",
            "I worded this weird. Is price based exclusively off rarity? Or are there other factors that play into it? do people buy cards to actually play with them or is Pokémon tcg almost exclusively traded monetarily",
            "i kind of find this comment sweet",
            "why so?",
            "Thanks for help, guess I got my info mixed up, was really hoping there was gonna be an English reprint. Is there still a chance for an English reprint or is that just copium?",
            "alr, ty!",
            "Done! He’s on his merry way to me! :)",
            "Here's a sneak peek of /r/pkmntcgtrades using the [top posts](https://np.reddit.com/r/pkmntcgtrades/top/?sort=top&t=year) of the year!\n\n\\#1: [\\[US,US\\] \\[H\\] A kitten on her way to recovery \\[W\\] To thank ALL of you!](https://np.reddit.com/r/pkmntcgtrades/comments/12fqeo3/usus_h_a_kitten_on_her_way_to_recovery_w_to_thank/)  \n\\#2: [\\[US,US\\]\\[H\\]GIVEAWAY \\[W\\] To appreciate this community](https://np.reddit.com/r/pkmntcgtrades/comments/17a5znt/usushgiveaway_w_to_appreciate_this_community/)  \n\\#3: [\\[US, US\\] \\[H\\] SUBREDDIT GIVEAWAY for 2x PC ETBs!!! \\[W\\] Your participation!](https://np.reddit.com/r/pkmntcgtrades/comments/17xi3o6/us_us_h_subreddit_giveaway_for_2x_pc_etbs_w_your/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "How would I do it on this sub? Imgur?",
            "[deleted]",
            "60%",
            "Well since that's the most sought after card from the set that should probably meet most definitions of good, yes.",
            "The cost breakdown is:\n\nThere are two separate categories to submit under: bulk or single. Bulk is usually for lower-valued cards. Single is for, well, singles. Single tiers prices vary depending on value and how fast you want your card graded. \n\n>do people buy cards to actually play with them?\n\nYes, many people do play, or collect and play. This subreddit is primarily for collectors. For playing the actual game, there's r/pkmntcg.\n\nEdit: I was wrong about needing a membership",
            ">Is price based exclusively off rarity?\n\nNo, it's actually based for the most part on demand / popularity and not actual rarity.",
            "Because I think they have the best combination of  high quality full art cards, good playable cards, and harder pull rates compared to prior Scarlet and Violet sets.",
            "For sure possible. Lot of people think there will be because of the popularity and the JP reprint.",
            "Yes",
            "How silly of me to suggest that if you dont know what you are doing and are taking advice from randos on the internet  then maybe you shouldnt be spending hundreds of dollars on things to try flipping.",
            "Thanks bro :). Now I just need to figure out what to do with him",
            "You’re so awesome for all of that. Cool, am definitely on the right subreddit I don’t have much interest in learning how to play but I love ripping packs lmao",
            "None of those 3 companies require a membership fee to submit. Though PSA and CGC have discounted rates if you do get a paid membership",
            "Oh! Interesting. I’m not sure I’ll ever completely understand it but that’s what apps like collectr are for I guess. I got SO hype for so many cards that were liken $1.20 lol",
            "No problem! :) And you and me both lol.",
            "My bad, you’re totally right."
        ]
    },
    "Self Promo Sunday": {
        "title": "Self Promo Sunday",
        "score": 5,
        "url": "https://www.reddit.com/r/PokemonTCG/comments/1dgv2va/self_promo_sunday/",
        "content": "Hello everyone! Welcome to Self Promo Sunday!\n\nHave a channel, video, social network, or anything else you'd like to post to promote your Pokemon TCG content? Feel free to post it here for the community to see.",
        "num_comments": 20,
        "comments": [
            "Hey everyone! Worked on a meta tier list for the current Pokemon meta! We're aiming to post edicational content on this site to help players grow!\n\nThe meta tier list will be updated as the meta develops! We're open to hearing any of your feedback!\n\n\nhttps://pokemontcgzone.com/pokemon-tcg-standard-meta-tier-list/",
            "Picked up the Mewtwo vs Charizard PSA, still continuing my challenge to fill up my PSA case. 😂\n\nhttps://youtu.be/IyBBq7IOsDU?si=7H11vGPH1LZKgoFU\n\nI make videos about my 20 year old collection 💕",
            "Lugia-tastic pull this week! Check it out in my new video: \n\nhttps://youtu.be/RP6IC5Sfu5M?si=pW9qFia7WDyjBY3D\n\nPlease like, subscribe, and let me know your favorite lugia card in the comments!",
            "If anyone’s curious what it’s like to witness an obsession in real time, you can check out my Vulpix stuff on Instagram!\n\nUsername is joelikesvulpix 👍🏻",
            "Keen on some Twilight Masquerade Booster Box Openings? Some big top 10 pulls from this video :)  \n[https://www.youtube.com/watch?v=WGiAxeziX6I](https://www.youtube.com/watch?v=WGiAxeziX6I)",
            "Want to see CARD PARTY 2? Check out this short I made meeting a bunch of creators! More card party content is on the way!\n\nhttps://youtube.com/shorts/0MFDcwoXG68?si=RmjVhcOjNX7hSjxb",
            "So I've been weighing packs lately just for data collection. Bonus dog. I also just do regular openings too. (I'm just a personal collector) [Weighing Twilight Masquerade](https://youtu.be/oheysxFeujk)",
            "We are PokiPair that have been creating content for just over 1 year :) We focus on English, Japanese and recently, Simplified Chinese Pokemon openings of all kinds. \n\nWe also do hunts, profit and loss and our most enjoyable - pure ripping of new products :D \n\nCome watch us open Pokemon in a lighthearted way: [https://www.youtube.com/@Poki-Pair](https://www.youtube.com/@Poki-Pair)\n\nOur most recent video: [https://www.youtube.com/watch?v=Te2edFajy3c](https://www.youtube.com/watch?v=Te2edFajy3c)\n\nHappy Monday Ya'll!",
            "[https://pokemon.cardsrealm.com/en-us/p/1585](https://pokemon.cardsrealm.com/en-us/p/1585)\n\n\n\nToday, we'll show you the top 10 strongest and most interesting Moltres in the history of Pokémon TCG, considering cards since the Wizards of the Coast era until today.\n\n\n\nMoltres is one of the three legendary Kanto birds, and, just like the other two, it first got a chance to shine in the Pokémon 2000 movie. It has been an iconic Pokémon ever since.\n\n\n\nNote: I won't include Moltres' Galar form in this list because there are only two Galar Moltres in Pokémon TCG: Galarian Moltres V CRE 97 and Galarian Moltres EVS 93.",
            "Just uploaded my first card show buyer POV video!  \n[https://www.youtube.com/watch?v=J4gu62UsfiA](https://www.youtube.com/watch?v=J4gu62UsfiA)",
            "Back with the same concept, but with upgraded gear! Click the link to watch ASMR unpacking from Sunny Island Singapore - [https://www.youtube.com/shorts/axJF7GAr21c](https://www.youtube.com/shorts/axJF7GAr21c)",
            "\\~\\* the girliest pack rips ... hahahaha Just started this youtube channel and already blown away by the community! Check out my channel!! I'll be ripping 36 EVO once I make it to 100 subs <3\n\n[https://www.youtube.com/@StayHappiny](https://www.youtube.com/@StayHappiny)",
            "Shrouded Fable Set Review \n\nhttps://youtu.be/r70L3WMwFsY?si=ZzjdTN6rm_AaXTRm",
            "There's a giveaway going on for 2 japanese booster boxes [https://x.com/poketcgiveaways/status/1804207598238924861?s=46&t=sueJuZtT08x9SqY2WLM0Ag](https://x.com/poketcgiveaways/status/1804207598238924861?s=46&t=sueJuZtT08x9SqY2WLM0Ag)",
            "Join the celebration on our Pokémon livestream: Date: 6/21/2024 Time: 8:45 PM EST Chaos Card Climb, Giveaways, Rip & Ship & more! [https://www.youtube.com/live/8nZTXrqtqd0?si=gbKrJnWD5zGfw5Hs](https://www.youtube.com/live/8nZTXrqtqd0?si=gbKrJnWD5zGfw5Hs) Get ready for Pokémon giveaways and non-stop fun!",
            "Hey everyone, my name is Bob, I live in Japan and I open Pokémon cards (mostly Japanese, but occasionally English).\n\nI just hit 12,000 subs and still cannot believe it! Thanks to everyone that has subscribed to the channel. 😁 🎉 \n\nThis week, my friend from the US came to Japan to visit me and brought a Pokémon 151 ETB for us to open together! We got some pretty awesome stuff! 😊 \n\nhttps://youtu.be/oYmC4E_sNEk?si=mq6fzU-9G-bGekb_\n\nThank you once again to everyone that has subscribed! You're all amazing! 😍",
            "Hi everyone!  \nOver the last months, I worked to build an app to keep track of your collection that would hopefully fill the gaps of all the other apps. So I created TCG Masterdex 🥳\n\nThe main features of the app are:\n\n✅ Track your cards   \n🌍 International and Japanese sets available  \n🏷️ Organize with Tags   \n📒 Create Sub-Collections   \n✨ Wishlists   \n🥇 Graded Card Tracking   \n🔎 Advanced Search   \n🎨 Track Card Variants   \n💰 Latest Card Prices   \n⏰ eBay Last Sold Prices   \n💷 Multi-Currency Support\n\nThis is the very first release and I still have a few things to add, but please give it a try and let me know your thoughts and feedback when you get the chance, I always look for improvements 😅.. And ofc if you like it, feel free to share it with your friends 😊.\n\nLinks to the app can be found here: [https://tcgmasterdex.app/](https://tcgmasterdex.app/)"
        ]
    },
    "Finally complete 😴": {
        "title": "Finally complete 😴",
        "score": 283,
        "url": "https://i.redd.it/x4egdonoj18d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "I love how you did the placement of the cards.",
            "what a awesome arrangement!! these are all such cool cards",
            "Beautiful but triggered because the Kanto evolution are in the reverse order, and Espeon is before Umbreon in Pokédex 😂",
            "This is fantastic! One of the best things I've seen on this subreddit, ever.",
            "This is such a flex",
            "Beautiful",
            "So freakin beautiful!!! 10/10 collection!!",
            "Looks good. The jolteon ones are my favorite, but I'm pretty biased lol",
            "That's kinda sick",
            "These are the most beautiful two pages I've ever seen. I'm trying to get the Galarian Gallery glaceon. It might be my favorite card ever. At least one of my favorites.",
            "I am so fucking jealous",
            "Amazing!!! Best page ever",
            "Congrats!!!!!!!",
            "Incredible. What sets are these cards from?",
            "This is sick!",
            "Damn, impressive binder pages",
            "I don’t know what it is about the Eeveelution full arts, but they just hit different compared to all other full arts. Especially that umbreon! Sweet page, I know that was not cheap😂",
            "Now just the 3 pack blister promos xD. Sweet collection",
            "Nice 👌\nThe first double page of my pc is the exact same, except with the non-alt VMAXs taking up a third of it instead of the alt arts for… well, budgetary reasons, lol.",
            "WOW, now what? The hunt is over.",
            "Good job mate 👍🏼 you did well. Now carry on my wayward soul... lay your weary head to rest ... don't you evolving cries no more ... no more...",
            "Sylveon is my favorite."
        ]
    },
    "Tried My Luck in Vegas Last Night": {
        "title": "Tried My Luck in Vegas Last Night",
        "score": 632,
        "url": "https://i.redd.it/7zhgauo95y7d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "That is the most fitting prize card to be dispensed at a Vegas slot machine. So cool!",
            "Damn I was in Vegas last weekend and had no idea something like this existed",
            "Where in Vegas?",
            "Seems like op paid exactly what it’s going for according to price charting",
            "I wanna try this so bad lol",
            "What’s that??",
            "That's an awesome card. I always loved Meowth as a kid. Great first edition pull",
            "Meowth thats right",
            "Now I can get down with this type of gambling",
            "Can’t say I wouldn’t test my luck too",
            "My wife and I are going to Vegas for our anniversary this November. I will definitely do a few real life gacha pulls.",
            "I'd be down for 10 of these if I was anywhere near Vegas",
            "Damn this is so cool",
            "Thaaaats right!",
            "Breaking even isn't bad at all!",
            "Nice!!",
            "I wonder what the big hits are out of that machine or is just Gem mint 10 basic cards?",
            "How much does that machine cost to use? Seems really cool. Congrats on the pull!",
            "Same, I brought a PSA 10 moonbreon to vegas just cuz I felt like I had to... sad I didn't find this either",
            "[Plaza hotel & casino](https://maps.app.goo.gl/g7M9R63sYmNiaGh86?g_st=ic)",
            "Yes, but he got his dopamine fix",
            "How much is it?",
            "Yep, some copies actually go for [even less than $50](https://ebay.us/VDRoWS), but still not bad as a pull from a mystery pack.",
            "I live in Vegas. This is bad for me...",
            "https://www.reddit.com/r/PokemonTCG/s/g68mc3xUXV",
            "Miauz, genau!",
            "Bulk gem 10 cards",
            "I have not stayed in that one. How is it?",
            "I’m not saying it sucks I’m just saying it’s good I’d be happy with it",
            "$50",
            "That person made off with a damn good deal compared to the rest",
            "[deleted]",
            "Literally in a gambling mecca of the country so fits right in I’d say",
            "Why do you care? Let people gamble away. I've never gambled but never had an issue with others that do, as long as it doesn't affect me, who cares.",
            "Except I've already seen several people pull stuff worth more than they paid...?",
            "It’s the exact same thing as getting fleeced every time you buy and open packs of pokemon cards. That’s gambling too you’re basically already on a gambling subreddit",
            "What do you think adults buying packs is considered? Gambling....",
            "The basis of the Pokémon TCG is gambling lol",
            "Yeah I'm not into card tables and seldomly play slots. I'm more of walk the strip + drink as I see the lights or snake my way through the casino.\n\nSeeing a PSA machine like that will definitely get me to drop maybe $150-$200 easily for shits",
            "[deleted]",
            "[deleted]",
            "Not really. With packs you actually have a chance at getting something really nice, but this machine is pure profit with nothing but junk inside. If someone can provide video proof Ill beleive it, but until then this is morally corrupt. Its no different than the \"mystery\" packs you see on the shelves packed with bulk.",
            "That will get 3-4 slabs... Be sure to post your pulls when you do it!",
            "It’s not always a loss. People have posted their pulls and there are some cards valued at $70-80. While I agree that the business will make a profit, not every $50 pull is worth less than $50.",
            "Ahhhh yes so this guy has never once opened a pack of Pokémon cards I guess. Good Moses smell the roses.",
            "You do realize that gambling in itself is always a loss as well right? The house always wins.",
            "You’re… kinda right? I’d probably do it once myself anyways though, just for fun. Lil mystery slab that will have a memory attached.\n\nHave you opened packs before? Some people gamble for fun. I love playing blackjack myself, but I just like the strategy and all that, I’m putting the minimum bet every time and usually going ~even.\n\nNobody (should) be doing this trying to make big money.",
            "https://imgur.com/a/DdM7gCJ\n\nHere’s a link to dudes pulls. The charmander is a win. Yeah you’re not gonna win everytime, obviously. Same with a pack of Pokémon cards🤷‍♂️",
            "Yeah they are thinking about it backwards. Yes if you buy every card you will lose money. Because the machine is there to make money. But like you said I've already seen people pull decent stuff.",
            "[deleted]",
            "Fair enough"
        ]
    },
    "This is how stupid the english market is right now.": {
        "title": "This is how stupid the english market is right now.",
        "score": 697,
        "url": "https://www.reddit.com/gallery/1dl6hvi",
        "content": "$30 for this card in english, instead I got it for 4.50 in japanese and the quality looks so much better. ",
        "num_comments": 327,
        "comments": [
            "I picked up the entire clay burst ar set for less then $20 on eBay…my Japanese collection has been growing pretty rapidly lately",
            "There is a card shop near me that specializes in Japanese cards. I go there to get my singles and booster boxes when a new set comes out. The price difference is insane. Just looking to collect, not \"invest\"",
            "Its unfortunate. People are coordinating buyouts for cards to stoke FOMO and cause the prices to skyrocket as a result and its working. Its so obvious too because every price chart has a large spike around the same date",
            "Keep in mind that Japanese equivalents are easier to pull since each booster box comes with 3 ARs.",
            "Let’s use an example of an older card. Psa 10 gold star gyrados in Japanese goes for 2200$-2800$. The same card in English sells for 13,000$-17,000$. English is just more desireable. If you’re buying for art get Japanese, just don’t expect the same value later(excluding Japanese specific promos)",
            "It’s because Japanese art rares are seeded lol. It is much easier to pull art rares in Japanese than in English cause you’re guaranteed several per box. Japanese art rares won’t hold the same value as the English counterparts because of this. English is the way to go if you want art rares that will have a higher value ceiling. Japanese is the way if you just want the art for your collection without paying the premium.",
            "Why do you have to offend 90% of sub like that?",
            "I think a large part is the yen is doing so bad with japans economy. I only get japaneee cards now. I think when there economy recovers  the cards will also jump in price….i also think Japanese cards just look better.",
            "Prices have actually been coming down/correcting",
            "Yeah if I'm buying a full art, I'm buying it for the art. On japanese cards, the text is less blocky and covers significantly less of the art, as well as being cheaper and being of higher quality. I give 0 shits about my modern collection being worth money down the road, cause I only get 1 of each of the cards I like, and I'm never selling 🤷‍♂️\n\n\nI'm totally fine with the market the way it is, I snagged this card and the groudon for like $2 each a month ago and have enjoyed looking at them in my binder while I spend my big money on vintage :)",
            "This is just a fundamental lack of knowledge about how Japanese and English differ:\n\nJapanese boxes have minimum guarantees. This is why almost every single Japanese AR is only around $2-$3, because you’re literally guaranteed to get 3 of them per box. There is no guarantee in English.\n\nNot only that, but Japanese sets are (usually) only half the size of English sets. In this case, we are talking about Japanese Clay Burst, which combined with Japanese Triplet Beat to create English Paldea Evolved. This means that there is a much smaller pool of cards to pull from. (According to another comment here since I’m too lazy to look it up,) there are 12 total AR’s in Clay Burst. This means in every clay burst box, you have a 3/12 or 1/4 chance to pull this tyranitar (provided no dupes).\n\nIn English, the pull rate for this tyranitar is 1/480.\n\nClay burst boxes are also only about $35-$45, for 30 packs with 5 cards per pack.",
            "Seriously. It took 3 years for SWSH and being out of print before prices went up but S&V which everyone hated until a month ago, having been released only a year and still in print suddenly goes up too? Somethings definitely afoot in the English market",
            "I’ve skimmed the thread and not seen anyone say it which I find hilarious, but you can’t use Japanese cards to play in any tournaments in the whole of the western hemisphere",
            "japanese is always cheeper because the market for japanese cards is much much smaller. like just ask yourself how many people in the world speak english vs japanese, english is such a wide spread language that the country with the most english speakers in it is china and japan has english classes in its public school system.",
            "This is why I haven't got Groudon from paradox rift in English yet its ridiculous",
            "I fucking hate pumpers and investors",
            "Agreed. The magikarp English is going through the roof. Several hundred dollars! No… I’ll get the Japanese version for $30",
            "People want English cards for the investment opportunity, not because they are better.",
            "japanese market has always been like that though, not sure its the english market that is playing up here lol",
            "If are lucky enough to pull a good English card then you must rely on extra luck that it isn't miscut or messed up in some way.",
            "English has more demand . Only the woman trainers in JPN overcome the English counterparts",
            "Now do that with waifu cards. The Japanese ones are way higher. What do you have to say about that?",
            "It’s definitely true that “poke investors” are buying out and artificially inflating prices, but modern sets get printed to hell and back in Japan, and it doesn’t really happen in English. Like, the demand for English is so much greater than Japanese it’s not even comparable. 151 JP went from $170 a box all the way down to $60 a box recently with a reprint. A booster box of the Japanese set the TTAR is from is like $30, lol.",
            "Japanese is split into two sets with 3 guaranteed a box and boxes are $35 msrp.  Much easier to pull",
            "For now this exists... Eventually it will cycle",
            "Japanese is back to how it used to be. A year ago they were the more expensive option now you can get them for cheaper while English is getting price manipulated",
            "Hard to hit in English 🤷🏻‍♂️",
            "Shocking that english collectors prefer english cards",
            "I just like being able to read my cards without brushing up on Japanese 🤷‍♂️",
            "People freaking out a card Is $30 makes me realise I made the right choice moving over from yugioh lmao",
            "These cards are way easier to pull in Japan as well. I think you spend $50-$60 and get 3/12 of them or something. Someone confirm my math",
            "This is not sustainable. These cards are going to crash hard as people will be sitting on sealed SV products. Don't buy into the fomo.",
            "This set is still being printed..... people need to stop being dumb.",
            "You can get a 20 pack booster box of japanese 151 for just a bit more, than the price of 6 english packs.",
            "I agree, which is why I’m loading up on Japanese 151 and a few other sets. Also buying single cards that I really like",
            "The reason it’s more expensive in English because of how shit the Quality Control is, yes in Japan you get guaranteed hits and the quality is much better. In the US you have to go through so much garbage before you get an actual good looking card that won’t have a print line or be off center that any card without either is automatically valued higher",
            "I've been buying evolving skies alts in Japanese lately because they're cheaper it's mad",
            "Do you know why? I don’t think it’s stupid at all. Your guaranteed hits from Japanese booster box’s. In English your not. There also printed a lot less in English and printed way more in Japanese.",
            "Even though you get 3 per box, there are still 12 to collect and you'd probably still have to buy more than 4 boxes to make the 12 card set. It just seems to me like Japanese ARs will be priced much higher in the future, but then again I don't have sales records or know how many cards were printed.",
            "I’ve got so many Japanese versions of AR cards that are ridiculous in English. This Tyranitar, Groudon from raging surf/paradox rift, Magikarp from triple beat/paldea evolved are just some examples",
            "But it’s Japanese",
            "America shits on everything else full atop",
            "I'm feeling the same with Digimon prices here in Brazil...",
            "Well that’s not a fair comparison. Same card, yes, but the language makes a huge difference to a majority of people here in the US. You’re also guaranteed 3 Art Rares per booster box. \n\n$35 MSRP for a Japanese booster with a guaranteed hit rate of 3/20 packs for an AR vs $165 MSRP for an English booster box with an average of 1/13 hit rate for an IR means some cards are going to be expensive in English and most will be very cheap in Japanese. \n\nEven taking the average market price of an English booster box into account, you still get 3 times as many ARs than IRs for every dollar you spend.\n\nI love collecting Japanese cards but I wouldn’t say you found a steal or anything, you just paid average market price for those Japanese card. If you don’t mind the language, great. But unfortunately many folks do mind and there are just so many more of them that $4.50 is a fair price for that card.",
            "I think it's people realizing that sword and shield is sunsetting, as more and more stuff becomes scarlet violet. I don't think it's that deep we have seen it with other gens.....",
            "same, I've been buying a lot of vstar universe singles. They're so cheap for the art.",
            "Honestly thinking I might pick up the magikarp in JPN if the prices don’t go down.",
            "Sure, but go ahead and look up literally any full art or SIR supporter card with a girl depicted on it between the ages of 5-25 in Japanese and get back to me on which market is worse",
            "That's a badass card too.",
            "I don’t even mind, all my personal collection is Japanese anyways it’s usually cheaper and the texture is insane",
            "That’s why I buy Japanese now",
            "On one end there's some manipulation at play and on the other end there's just more japanese cards due to higher chance at pulling it and decreased interest in japanese cards. Clay burst was opened like crazy and saw a big reprint, so the japanese price doesn't surprise me.",
            "That japanese magikarp is $82.20 in a PSA 10\n\nIn English its 172 raw",
            "This is how stupid people with 0 market intellect react. The market is the market. Most english don't want stuff they can't read.",
            "151 is the same. Tons of the IR's are dirt cheap in japanese",
            "The Groudon from paradox rift is the same way",
            "Literally gave one of these to a friend when it boomed to 60",
            "So people want it in English.\n\nWhy is that a problem?",
            "I’m really hoping for a pokemon card crash one of these days lol prices are getting too ridiculous",
            "Yeah I got this guy JP along with the raichu from the same set I believe? It’s a SIR and he’s floating over a bed.",
            "I just buy Japanese cards for cheaper lol, I get the same experience for less. I also actually collect and don’t resell lmao",
            "I mean Japan’s economy is in shambles right now and a majority of collectors in the US want the English version. Not to mention less overall Japanese collectors. \n\nIt’s really not that surprising IMO",
            "Did the same but with groudon an magikarp in japanese! Two of my fav chase cards I gave up on but in even better quality!!",
            "I find English card prices can also be higher because the quality sucks with English TCG whereas the quality for Japanese is much better in general so finding a PSA 10 of one card in English, for example, may be much more difficult than finding that same card as a PSA 10 in Japanese.",
            "Same! I get all ARs from Japan instead of English IR. Pretty big price difference, and all I care about is the art anyway",
            "Agreed, Japanese cards have way better quality.",
            "I heard the Japanese cards have better detail on the artwork too, which is more important to me since I just collect and don’t play the game.",
            "Wow I love that art! I’m checking eBay now",
            "Pretty accurate i bought the Eevee ar for about 9$ over the close to 50$ in English. People make no sense. You can't claim it's due to rarity when other ars are going for less than japanese singles. It's all about popularity and price manipulation. Guarantee the zorua from shrouded fable will see a pretty nice increase too as well as that duskull Evo line.",
            "Japanese also just look better",
            "Don't understand why art rares are so expensive?",
            "I bought that same exact card in Japanese for that very reason. It’s crazy how much they ask for some cards in English. Maybe I need to look for more soon lol",
            "It goes the opposite way for waifu cards. I collect mainly in Japanese but all waifu cards I have to get in English because I can't afford otherwise lmao.",
            "I prefer JP cards tbh, much better quality control and if grading more likely to get a better grade and obviously not to mention the huge price difference on some of these cards, another example is the magikarp from PE the JP one is a fraction of the price",
            "cry in thai translation 😂😂😂😂😂 (and yes it cost 30-50 cent)",
            "Not really a fair comparison. However, I am buying probably 90% Japanese and 10% English at the moment. Especially focusing on top tier Japanese only cards.",
            "Probably has less English versions, demand is all that matters in the pricing market",
            "I love Japanese 10/10 over English cards.",
            "Lol can you just google yen/us chart ?",
            "Japanese cards have always been worth less though.. because the bigger online market is in the west and english speakers seem to prefer english cards",
            "I don’t get it either. I’ve been chasing a moonbreon. I’m just going to order a Chinese version for 1/3 of what the English copy is, cheaper then I’ve seen some Korean and a fraction of a Japanese",
            "It’s beautiful Japanese are better quality so there’s not scarcity to rarity. As silly as that sounds. It’s also because English is nostalgic and much more liquid. Way more people want English are there’s a lot of high demand sellers who will liquify but only English. I know - weird.",
            "But seriously it’s all y’all fault for fomoing into silly prices from tcg player buyouts",
            "Japanese is better anyway",
            "Not sure if u noticed but card games based in Japan are cheaper in Japan because over there it’s for fun and cheaper for their own (yes I say their own, Japanese society largely favors Japanese people over foreigners it’s a known fact get over it) over here, the tcgs are money makers. Ocg’s (I assume the Japanese/korean/Chinese versions across tcgs are all called ocgs) will always be cheaper",
            "The amount of y’all here that think this card is deserving of $30 is concerning",
            "Lcs was selling one of these for $40, couple weeks back I got the Japanese version in a Beckett 9.5 for $40",
            "Funny I see this as soon as I bought all the Paldea evolved illustration rares, full arts and special illustration rares. Yeah it’s really crazy, it all added up to a price I wasn’t expecting and it’s only going to go up more than likely from here on out.",
            "Uh, that’s because the card is valued more by *English*  collectors. The values aren’t ***Universal*** across the board.\n\nCheck the prices in other languages. If you don’t care about future value, just want the card, buy in the cheapest language. Some want the card in their own *tongue*, that will drive that card higher (based on demand/pull rate/etc).",
            "Crying in french cards market😭 for exemple groudon AR in jap is like 5€ in french in he's 90€ \nWalking wake SAR in jap=40€ and in french 190€",
            "English market ahaha laughs in french",
            "i buy 2 ETB or booster box when a set comes out and whatever I didn’t pull I buy the single a few months later in Japanese or English which ever is cheapest",
            "My dude, don't watch the French market then ahah",
            "Glad I mastered this when it was cheap and people were fomoing 151.\n\nIt really is a lovely set.",
            "Many people have zero interest in Japanese. Demand is higher in English. Makes sense to me.",
            "Supply and demand 🤷‍♂️ there is lots of supply when there is Less demand lol everyone is swallowing up the couple english cards they want 🤷‍♂️",
            "If you're a broke boy just say so.",
            "I can't wait till all these pokeinvestors profit just burns into the ground with these modern sets.",
            "Exactly the reason why I decided to collect Art Rares in Japanese.\n\nAlso bit curious about how US market for japanese cards works, here in Europe the average cost of an AR is like 2€ (2,14$), for example this specific card is listed for 2,50€ on CardMarket.\n\nBut I guess this difference is due to a bigger demand but on a similar \"population\"(?)",
            "although it may be pumpers - there’s also increases in sites like boxed.gg that offer loot box style pack openings.\n\nwhen people cash out of those loot boxes, the sites rush to fulfill which leads to buyouts and lower supply and thus larger prices. almost like a short squeeze.",
            "Japanese cards are better quality, it’s the same image and you get it for half the price. Most people on this sub are not playing the game so why bother with obtaining the English version? You know who is in the card anyway",
            "Different rarities, Japanese is easier to get",
            "Everyone in the hobby is an idiot",
            "its not my problem that you simply dont understand why the japanese cards are cheaper. but good luck. its great for those who just want cheap cards. I bought a gastly for like 3 bucks until they cooled off to 15. then I went in heavy and bought up as many as I could at 15. back at 30 now :p",
            "I'm literally just buying Japanese Illustration rares, sometimes English if I find em for a good deal. I just want the artwork realistically",
            "Jap boxes are seeded English are not",
            "The English cards are always more valuable than the JP ones. It’s just the market. \n\nI had no idea this card was valuable, need to throw mine in a top loader asap.",
            "I always just assumed that Pokemon was just more popular here in the states and people prefer to own cards that they can read. I know that's why I prefer english.",
            "Lmao damn I bought for $30 a few months ago i was loving my gains",
            "cant read it dont want it. I'm genuinly glad that you are happy in your purchase though",
            "Why can’t you Japanese guys do some critical thinking and link Japan’s failing economy to the card market. And long term these aren’t good investments, the huge reason English is more valuable is because there is way more English speaking people on earth than Japanese speaking people and that’s not changing anytime soon. It’s funny cause in the reselling circles these guys are buying so much Japanese product rn and reselling it to the same people claiming the English market is being tampered with. Just go on whatnot and see how many of them are selling Japanese packs rn. If you only care about having the card then yeah buy the cheaper version if we’re talking anything else I always go English.",
            "Hmmm… congrats i guess? Let people spend their money as they wish goddamn",
            "Were you around during 2021? Lol",
            "I like being able to read the card too tho",
            "It costs extra to reprint something in another language. Even toys that are reprinted with English info etc cost more. Also you have import taxes, that’s actually placed on you the consumer. It’s a shame",
            "Thats why i only buy japanese slaps, plus the cards are as they were intended, in japanese, beautiful! the english pokemon market is out of this world",
            "Which is weird to see. I gifted a Japanese guy a few english Mawile cards from way back when the first couple of sets with Mawile available. He was happy af. \n\nThose cards costed between cents to  a few bucks. In Japan? $200 dollars or some shit. Is baffling the price of cards in Japan, even with newer sets.",
            "You do realize why it’s 4.50 in JP right….?",
            "I feel like this is a bad example tho cause it’s always been like a $30+ card since release in English. It’s just one of those pokemon that are more sought after in English like how zards tend to be a bit more expensive in English as well. That being said the additional price hike recently is definitely artificial but the $4 jp vs the $30 English is honestly just natural for some",
            "Get ready for half of the sub to be offended for pointing it out.\n\nI feel like half the people on here are investors now.",
            "And Jpn QC is so much better as well",
            "Nooo, make that price fluctuate lol",
            "Well it's not a secret rare in the Japanese version like the English",
            "lol. Finally someone says it.",
            "Almost as if there are more English players than Japanese players and production rates are different *gasp*",
            "Do you have it in English?",
            "This is how stupid the *Japan market is rn. Some of the MOST beautiful artwork of all time and people forget they will stop printing these eventually. Pokémon always goes up. Always.",
            "Japanese modern is so trash",
            "Duck you",
            "Japan is in a recession right now, take advantage!",
            "Might look into this! Thanks",
            "This might be what I look into next",
            "My lcs new release Japanese booster boxes go for 75. Is that normal? Cause I can get them for half that online",
            "Dont tell the pokeinvestors that, they think this is all normal lmao",
            "What are the odds of these prices going back down? I waited a bit too long to buy a few cards and I really don’t wanna pay double what I would’ve paid before the spikes…",
            "That Steelix too",
            "I'm waiting out crown zenith for this same reason. Funny to me that they moved to IRs and SIRs that quickly.",
            "Do you have any actual evidence of coordinated shilling? Or you are literally just citing the spike in price.\n\nWhat exactly would a natural rise in alt art prices look like on a graph? Because to me it would look just like the charts do now...",
            "It’s pretty simple to understand, it’s simple organic FOMO. Paldea evolved is very limited at the moment. It’s been many people’s favourite set and the chase for the PSA 10 magikarp has dwindled supply. Because supply has dwindled, people are having FOMO about the product and in turn the market is naturally having the cheaper stock sold out in both singles and sealed. This is why there is a huge spike for all singles and sealed during that time, there is now a retrace because the market is trying to find the new normal. \n\nWill there be a reprint? More than likely. So prices will go down again before the market eats up the new supply and the same thing happens again.",
            "a logical collector would jus buy japanese during this time",
            "yeah its true, i bought 100 umbreon vmax secret rares (rainbow) based on a tip i received from the pokemon underground secret cabal of buyout artists and they are like 55 bucks ea now, i paid 25 ea.",
            "So essentially, in Japan, you spend $280 for on average 1 of each illustration. In English, you're spending $1680 to get on average one of each illustration. This is why Japan is so cheap. Do your homework lol",
            "I wish they did the same for English sets.",
            "I missed out on the Neo sets 20 years ago and I would love to collect them, but with the current prices its out of reach. I dont need 1st ed or even need it to be in English. I just want the images, so I'll likely build my own Neo sets from Japanese cards, but in English set order. Its far cheaper, and I no longer give a damn about hyper inflated card prices for newer sets or even the perceived value of my vintage collection. Its all going to my daughter one day anyways. I'd be fine with prices tanking, just so I can have the images I want without paying $100+ USD for a piece of nostalgia made from cardboard.",
            "That might be true for mid era but it’s not for everything Japanese. Go take a look at the prices of the original gold stars from Dragon Frontiers or any vintage shiny cards. The high end Japanese market has very deep pockets.",
            "Value goes up just not like the English does. Something about reading the cards makes it more expensive",
            "I agree.  This I think is the main reason as well. Also the chances of getting a particular art rare is higher since Japanese sets are smaller and English sets are made up of 2-3 Japanese sets (except for special sets like 151).",
            "Your argument is valid, same thing with Jolteon/Vaporeon/Flareon VMAX promo box (english) vs contest counterparts (japanese).\n\nReally kinda depend on “rarity” but my argument for Tyranitar and other ARs is these cards would be print to death at least for years so English version of these cards have no qualms being that high at this point of their lifespan.",
            "This is also why things like full art trainers in Japanese can be quite expansive compared to the English copies, they are in the secret rare slot which are one per booster box but can be anything from regular full arts to alt arts/gold rare.",
            "I find it interesting that typically there are quite a bigger percentage of English PSA 10s compared to Japanese PSA 10s. I’m wondering if this will affect any shift in value from English to Japanese",
            "english also guarantees ARs in their booster boxes. It’s just that the english have been manipulated heavily",
            "It’s true the market is dumb, you just have to respect his opinion",
            "With Japanese being the OG language, I like to think that the artwork was meant to be displayed with Japanese characters.",
            "Couldn't agree more.",
            "Where do you mainly get Japanese cards from",
            "Japanese economy will recover any day now has been said since the 90's...\n\nJust as soon all the new kids enter the workforce!\n\n*Checks demographics of Japan*\n\nOh...",
            "Some cards. Many are still ridiculously overpriced",
            "Sorry for the stupid question (only collecting for about 2 weeks), but don't JP cards go out of print quicker thus the scale balances slightly?",
            "You're telling me higher supply + lower demand = cheaper card? But everyone here keeps telling me it's market manipulation?!? How could that be???",
            "The pull rates are also a lot harder",
            "With one very minor exception, if you can prove your country of residence (aka current address) is Japan and participating in an International Tournament then you are allowed to use Japanese cards but may require permission from the TO to do so. For Special Events and Regionals it is not typically allowed but some exceptions have occurred depending on TO. Some Japanese players go to TPCi events (i.e. Oceania) because Japanese tournaments tend to be invite only and invitations are based on placement in a Bo1 format.",
            "Pretty sure everyone buying Japanese cards are intending to collect.",
            "I don't think that matters too much. Out of the hundreds of collectors I personally know, none play the tcg. I'm not saying people don't play it, but I think it's a pretty small % of collectors",
            "You had 6 months to buy it for $20",
            "It’s 140 , it’s a lot but not several hundred",
            "you can get the japanese for much less than that thankfully, even the psa 10 is like 40-50",
            "I mean I also like English better because I speak English. It’s nice to own a card that you can read. \n\nI don’t feel like this is an uncommon opinion too, we grew up with English WOTC cards and now we want English modern cards.",
            "Nah, I just wanna be able to read it.",
            "I just joined an error group, and misprints and miscuts actually sell for a decent amount more than I expected",
            "I checked. I'm correct. So essentially, in Japan, you spend $280 for on average 1 of each illustration. In English, you're spending $1680 to get on average one of each illustration. This is why Japan is so cheap. Do your homework lol",
            "I remember when everyone was hyping up Japanese boxes it was ridiculous the prices they were reaching, glad its back to normal now. I remember thinking about buying a booster bundle of twilight masquerade and then I was like wait I could just spend $10 more and get a whole box of mask of change lol",
            "Bought a box today for $40 lol",
            "Booster boxes in pokemon center vending machines are $26.94 per, if you can find them. Which works out to $89.80 for 20 packs. Luckily I have three of them near me. I know not everyone is as fortunate :[",
            "I’ve bought so many ar cards in Japanese just cuz the english price was ridiculous. Got the groudon for $6, all the kanto starter ar’s for like a 5th of the price in english",
            "Are you just ebay'ing the Japanese versions? I'm collecting mostly gen 1-2 special art cards and prices have started to really suck.",
            "The point isn't that it's more expensive, it's how much more expensive English singles have gotten in the last couple months. Look at the chart op posted. The rise in the price has nothing to do with qc",
            "Look at the price chart this card randomly doubles in less than a week, paldea evolved is a set not that hard to find. It’s nothing about guaranteed hits",
            "A lot of SV sets haven't even had their reprints yet.. the prices shouldn't be this high yet.",
            "I agree, cards in Spanish, French are also in better quality. The texture and card weight feels different from US.",
            "This is not true. There’s a tonne of examples of Japanese cards being worth more than their English counterparts - it’s not as simple as one language is more valuable than the other. Look at Moonbreon for example",
            "If you play the game, this matters, but if you just collect, what kind of goofball is sitting there reading the gameplay effects of the cards 😭, and like, you can easily recognize it’s a tyranitar, no need to read the name either.",
            "I’ve been around since 2005 I know how stupid this hobby has gotten with people treating it like the stock market",
            " it was getting better last year. Now it's bad again.",
            "Did you not look at the next slide lol",
            "Its not a secret rare in the english set either?? LOL",
            "Omg you mean how the production rate in english is higher than in Japanese? Or how this card has absolutely nothing to do with playability so the number of players doesn’t even matter?? gasp",
            "Don’t mention how much easier it is to pull in JP, it’ll break them.",
            "Found the pokeinvestor guys",
            "It's crazy how many cheap japanese cards there are right now. Even the vintage cards! I can finally get the vintage cards I wanted lol",
            "The ones who say it’s normal are in on it.",
            "\"it's jUsT dEmAnd!\"\n\nYeah I'm not buying it.",
            "No actually holder thinks this is normal lol",
            "I stopped buying singles altogether because of this bs, fuck modern Pokemon.  I'm going back to MTG. At least the game itself is fun, and this FOMO crap doesn't happen.",
            "A year after the 30th anniversary. So awhile. I hope it's earlier though.\n\nWe are due for another 2001 crash eventually. In 2001 the high prices and over saturated market caused the pokemon tcg market to crash.",
            "This article explains it very well https://infinite.tcgplayer.com/article/Why-Are-Pokémon-Card-Prices-Going-Nuts/749ec65a-e803-4f7a-9401-6291ed4f8e42/",
            "[legal action against some manipulators](https://www.pokebeach.com/2024/05/cardmarket-takes-legal-action-against-pokemon-tcg-market-manipulators-seeks-damages)",
            "natural rises are steady slow climbs, not sudden high jumps. easy to tell the difference on a chart",
            "TCGPlayer literally confirmed that buyouts are happening in the article linked by the other commenter. You have no idea what you're talking about",
            "That’s assuming you think this is a dip and not a return to normal due to the yen collapsing \n\nWithout trying to be too political \n\nThe dollar right now is being propped up by government spending during an election year and like 3 stocks inflating the overall market. \n\nThe us dollar could see a return to normal soon too",
            "That's not what logic is",
            "So essentially, in Japan, you spend $280 for on average 1 of each illustration. In English, you're spending $1680 to get on average one of each illustration. This is why Japan is so cheap. Do your homework lol",
            "Guaranteed hits would be nice. Especially with the bigger sets",
            "That's what I'm doing. I'm surprised how cheap some neo cards are. Well compared to English ones.",
            "Thats what im doing after completing my Base-Rocket sets. I typically buy bundles of cards and Im about half way through the Neo’s. Most are Japanese and when I get an english version I just swap it in and sell the Japanese copy in a lot.",
            "I’m currently doing that now! I got slowing, crobat, delibird. Steelix, kindgra and ampharos NM for 52 dollars !",
            "I collected the entire neo genesis and discovery set in Japanese by buying singles and non-holo bundles. Cost me around £600 for both sets.",
            "It is the way for modern though. You can snag a moonbreon for cheap if not in English.",
            "So essentially, in Japan, you spend $280 for on average 1 of each illustration. In English, you're spending $1680 to get on average one of each illustration. This is why Japan is so cheap.",
            "Indeed. It makes sense that English would be worth more, but not necessarily THIS much more, at least not this early when the sets are still readily available (though I can kinda understand the Magikarp because it is a unique and loved art style, coupled with the fact that paldea evolved has so many art rares that it dilutes the pull rates heavily). But for rarity sake alone, English being worth more than Japanese should be expected.",
            "It's only because there are more English cards graded. The Japanese have a higher pop % because of better QC",
            "Sure, you get 2-3 ARs per English booster box, but Paldea Evolved has 36 ARs in the set vs 12 in Clay Burst. That means a 1/4 shot to pull the Tyranitar from a Clay Burst box, but a 1/12 or 1/18 shot at pulling it from a Paldea Evolved box. \n\nThat's not market manipulation, that's just math. Couple that with the fact English collectors would rather have English instead of another language, and English print quality has been in the shitter for a while, both of which drive the demand for NM copies higher, further increasing the price.",
            "This is not true. English boxes are not seeded with guaranteed hits.",
            "No, no they don’t guarantee any hits from English. Lol",
            "That’s how I feel. Sure I can’t read it but it just looks cool/fitting.",
            "eBay. Takes about 2-4 weeks for delivery.",
            "Printing is pretty weird and erratic, usually just based on demand for the set, like Japanese 151 just got reprinted and tanked all the prices of the sealed product, but then you also have cases like the eeveelution alt art promo boxes in English which had a very short print run. It just kinda depends and there isn’t a perfect science to it",
            "Price I don’t like = market manipulation\n\nIn fairness to the masses, there have been documented cases of market manipulation on sites like cardmarket (they even sued the guy), however, it’s definitely not as common as people think. In the case of this tyranitar, it and the sleepy raichu were massively popular IR’s from Paldea Evolved, just like the legendary Kanda Karp. When Kanda Karp shot up and stabilized, it was only a matter of time till tyranitar and sleepy raichu got a share of the wealth.\n\nAnd plus, even if the price was manipulated, it’s stable now because it’s been this way for a while, it deserves the value.",
            "No way SV pull rates are harder than SwSh lol ",
            "managed to get it in japanese months ago and was too busy trying get iron hands before they became lucrative, still doesn't make sense how both Tyranitar and Groudon being competitively mid cards are nearing $50-$60 and the people who wanted t-tar had even more time to react",
            "wait til you see the psa 10 price O.o",
            "Talking about psa 10",
            "PSA 10 recently solds as of last night are 80-90",
            "Yep Japanese is cool and the obviously stunning but I wanna be able to read what the cards says lol",
            "Seriously people always talk about investing and english versus japanese has better quality printing. I just want cards in a language I understand so that I can enjoy flipping through the cards in my binders. Plus I enjoy playing the game. Got nothing to do with investment or money.",
            "i’d recommend looking into buyee. it’s super easy and allows for you to get the jpn cards you want at a fraction of the cost",
            "I just started getting back into Pokemon, SV 151 brought me back. I’m doing both buying to resell in a few years and starting to collect for myself. The art and quality is way better today than it used to be back in the early 2000s. I also buy English bb when it’s in the $90-$110 range. But mostly trying to scoop up as much Japanese as I can.",
            "If you dig around on ebay you can find good prices.\n\nI just got a japanese groudon and tyranitar IR for $9 total",
            "Thank you someone that actually understands the point of my post. Its not just this card too. Groudon and altaria from paradox rift, the dreaded magikarp and raichu from paldea",
            "Paldea evolved is actually sold out on pokemon center and nobody has it. I was lucky enough to find a case the other day and we did get a carp out of it. That’s why prices are going up on the set. I do know buyouts happen. But it’s always been this way. Even vintage Japanese is way cheaper than English. And price charting id never use for raw cards it just averages all eBay sold.",
            "Except it is harder to find, for now. Retail shelves are now filled with TWM, Temporal, Paldean Fates and will soon be gearing up for Shrouded Fable. Online vendors have cleared out the bulk of PE stock and booster box prices have shot up 25% in the past couple months. It’s a popular set, but a reprint will likely happen along with correction.",
            "Will they reprint in the west like they have done in japan?",
            "I'm shocked to see the moonbreon is more expensive in Japanese",
            "Everytime I see a comment talking about \"I like being able to read the cards\" I think the same thing. How often are people actually reading the cards? I guess some people really value the English cards.",
            "Guess I’m a goofball cuz I like to read my cards",
            "Did you not read my comment talking about how yes the additional price hike recently (the jump up on the slide) isn’t natural but the $30 to $4 comparison is just natural",
            "I mean, you got a nice price for a card you like. What's the problem?",
            "Half of this sub is investors now. It's kind of sad",
            "Holy dude, Assuming just made us both look like dummies. I simply have a preference for English over Japanese.",
            "Shhhh, not so loud!!",
            "For real. I picked up the full team rocket set in MN/M including all holos.",
            "Where are you guys buying them??",
            "Japanese everything is cheap but you'll most likely pay insane amounts for shipping if you buy anything over 0.5kg unless you have a plug in the states",
            "From where ? eBay ?",
            "Or just prefer to play dumb",
            "It’s just demand… from market manipulators",
            "Quite literally",
            "As far as I know Pokémon hasn’t released a set that only had (literally) 1 chase card. Talk about FOMO.. as if no one was buying up boxes trying to pull the One True Ring.",
            "You mean the game that pretty much has sold out with all the stupid collabs they have",
            ">I stopped buying singles altogether because of this bs, fuck modern Pokemon. I'm going back to MTG. At least the game itself is fun, and this FOMO crap doesn't happen.\n\nXDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD",
            "Not a crash but pokemon definitely has gotten cheaper now then like 2022. Vintage prices are still a lot but definitely lower than the all time highs",
            "We also had a spike around 2016 with the 20th anniversary and the release of Pokemon Go, things calmed down a bit in late 2017-2018.",
            "So essentially, in Japan, you spend $280 for on average 1 of each illustration. In English, you're spending $1680 to get on average one of each illustration. This is why Japan is so cheap. Do your homework lol",
            "From the article\n\nGiven the number of Pokémon cards being printed (9.7 billion in 2022), actually cornering the market on any of them is next to impossible.\n\nAgreed. Also, with the number of TCG collectors, investors, whatever you call them increasing since 2020 and staying, it makes sense that card prices climb.\n\nIt's anyone's guess but even with a drop in price, my guess is any dip ends up being temporary and prices continue climbing as sets go out of print. Hope not as I'd like to get a moonbreon and many other alt arts one day, at a reasonable price.",
            "This is even worse. At least when someone buys a lot of copies in an attempt to boost prices, they assume some sort of risk. Reserving cards without the intent to pay for them is pure scummy behaviour.",
            "Ty for an actual link. I'd still argue finding some manipulators on a european market is a long way from wholesale international mass market manipulation of every single alt art card. but I appreciate the link/evidence",
            "That's much different than buying up cards and reselling at higher prices",
            "so when fusion strike [rocketed](https://www.pricecharting.com/game/pokemon-fusion-strike/booster-box) from $135 in Feb to $225 in March, that was manipulation?",
            "I think you need to work on your reading comprehension, it clearly says \"cardmarket the tcgplayer of europe\". Please quote where it says TCGPlayer confirmed buyouts, use direct quotes please. good luck.",
            "The US dollar was propped up but high rates re bringing it down. It is not yet currently propped up. JPY is in an extremely tough spot",
            "Japenese moonbreon is more than English",
            "Korean, German, French, Chinese, you’re correct. Go check moonbreon prices for a PSA 10 on eBay right now and you’ll see that’s just not true for Japanese. Even sold items. There’s a solid, large market for Japanese that a lot of people seem to not be aware of or believe?",
            "Magikarp in japanese in a  psa 10 is less than half english raw lol",
            "Are there more English cards in general? \nIt’s just odd to me that English cards (worth grading) are more scarce and are harder to grade, yet there is 50% more graded. Japanese are much easier to get 10s. It seems like there is much more English product than Japanese",
            "true, but that wouldn’t explain why some high popularity pokemon with great art ARs are super high price while others are low. At some point you have to admit there’s a good bit of manipulation going on there",
            "Scarlet and Violet era boxes are definitely seeded in some fashion. \n\nSV base - Obsidian boxes generally had ~4 EXs, 2-3 ARs, 2-3 Full Arts, and 1-2 Gold/SIRs\n\nParadox Rift and onwards has been ~6 EXs, 2-3 ARs, 2-3 FAs and 0-1 Gold/SIRs (and 1-2 ACE Spec cards starting with Temporal).\n\nThere are outliers and there is no official guarantee from TPCi, but watch almost any SV era box get opened and the hit rate will be just about what I put above.",
            "They are. Disregarding errors, booster boxes have a set amount of hits, meaning you cant do too well or too poorly, as u/DarkEckoGaming explained in his response. They arent exactly seeded how JPN are, but they are seeded similarly",
            "they pseudo guarantee them with soft limits. every SV era box has roughly the same amount of hits, you never see boxes with more/less than a certain amount of ARs, SIRs, URs etc.",
            "Such a weird market. I really didn't think rarity would be quite this extreme when I got into it a few weeks ago. Already learnt the lesson that if you want to collect, get a booster box then just buy singles...",
            "That’s the ethos of this sub. Get mad when highly demanded, rare cards become expensive. Instead of studying the market, they just throw up their hands and say “I haTe iNveStoRs” and chalk it up to market manipulation. Meanwhile, they spent a year ignoring IRs at rock bottom prices while spending hundreds of dollars ripping packs to no avail. Most of these SIRs/IRs follow the same trends- Set is released and the first wave of them hit the market at high prices before they plummet 50-70% while a shit ton of sealed product is opened and more cards hit the market en masse. You get a good 6-12 months of floor prices before a catalyst (generally when PC booster boxes go out of stock/ dwindling retail/online vendor supply/FOMO) sets off the price and you get a nice spike, a correction, and a new floor. We literally just saw this play out with pretty much every single SWSH SIR/IR.",
            "It didn’t say graded , but ok",
            "damn it must have shot up recently, i remember it being much much cheaper in the past",
            "To me that doesn't matter. I pretty much know the name of every pokemon. I don't need the name at top.\n\nAs for the battle text, I don't need to know that. \n\nFor the flavor text, it's disappointing i cant read it. But I can just look it up online.",
            "Strange that everyone misses this, I can even read Japanese and I don’t collect Japanese cards, my collection is in English because that’s what I collected and played with as a kid.",
            "Suruga-ya is great for modern ARs, most of the standard ARs are 500Y a pop and they run free shipping promos all the time. With the yen in the shitter right now, I got like 10 ARs for about $35 shipped, where getting the English versions would’ve run something like $180.",
            "Anything you need to especially look out for?",
            "Yes but you said it’s been $30 since release that isn’t true lol",
            "The English price isn't nice compared to what it was a few months back. That's the point.",
            "Yeah I can tell by the amount of how much is this worth or should I keep it sealed posts I’ve seen the last couple months lol",
            "It's usually free to import Japanese cards to the UK, both in import handling and shipping \n\nI bought a load on eBay, all free shipping. Some were singles at £1.87 including postage. Insane.",
            " If someone needs a plug, DM me! I got y’all! :)",
            "Go on the investing sub lol 95% of them have no common sense 😂",
            "Eh orcish bowmasters, and the one ring are both high value cards in the set ~$100 range due to playability. Mtg I expect about 0.5 EV out of each dollar spent (some sets like MH3 you virtually get 1:1), compared to pokemon where 0.2 is a good set",
            "Yes, very true, but how much is TOR? You're also forgetting(maybe not aware) other chase cards from that set on top of serialized cards. I can still buy a LOTR box for cheaper than Modern Pokemon. A regular LOTR booster box is $170 compared to some SWSH sets that are over $300. If you wanna talk collectors booster box, $515 and you generally make most if not some of your money back, comapred to ES at $700 for a booster box and crying after it because the sets pull rates suck. Sorry for the book, lol.\n\n*edited for spelling*",
            "They have their limited runs, like everything now, of course! I think you're referring to their Secret Lair Drops(correct me). The really popular ones seem to be more victim to that, more of my opinion, though. I don't have much experience with SLDs. Depending on what the theme is, how and what format it plays, and other factors that aren't as important as the prior ones make all the difference. I know personally I have seen plenty of SLDs still available on TCGplayer when I was interested in The Evil Dead themed one.",
            "I'm glad I could amuse you? Go check price differences and pull rates 🤣.",
            "Vintage prices are expected because they are out of print, no hell these modern cards of which many of them are still avaliable spike so suddenly.\n\nI enjoyed the times when all these investors latched on to other things to manipulate early in the SV era and prices for these are reasonable.",
            "booster boxes that sell out on PC are different than the singles market…one is to be expected the other is sus asf",
            "tcgplayer did release an article explaining the buyouts happening though, Im a part of some buyout groups its a real thing. I have 100 umbreon vmax secret rainbows because of this and they went from 25 ea on tcgplayer to like 60",
            "Korean then for art ha. They’re like 350",
            "Good point though",
            "Yessir thx for this!",
            "You spend on average, $280 to pull a magikarp in Japan. $1680 for english",
            "Not entirely sure what the printed number of cards is for English vs. Japanese. But on pop reports most of the time there are alot more English cards graded In total, but Japanese usually have a higher gem rate %. English QC has gone to shit with SV. Obsidian flames, 151, and Paradox rift I've seen a ton of chases from those sets all with whitening on the backs pack fresh. The Jpn same cards were mint pack fresh.",
            "I believe those are just the general pull rates. If you opened 36 sleeved booster packs of a scarlet and violet set, you would typically pull the same hits of a booster box. Pull rates in general are up from sword and shield, SIRs are no where near as hard to pull as alt art vmaxes.",
            "This is how averages work. Generally, you will get a certain amount. Sometimes, you're a little off. Rarely, you're a lot off.",
            "Holy cook, perfectly summed up the cretins here. It’s so weird how they have this intense hatred for investors",
            "How do you buy them? I can't find any by using the search function",
            "My apologies I did misremember it was floating in the low $20s. However growth from low 20s upper teens to $27-$30 is definitely natural considering we have not seen a reprint of paldea yet. Once we get that then it could drop back down. Again the $50+ price was 100% manipulative",
            "well said, at least with LOTR you can get your money back even without a serialized",
            "They ment the universes beyond sets like LotR, fallout, Dr who, warhammer 40k and assassins creed and cards in sets that are completely irrelevant like transformers in brother’s war.",
            "I don’t know what it’s called but having Jurassic Park, LOTR, Assassin’s Creed… etc MTG cards is just stupid",
            "Ok, what about gengar vmax doubling almost doubling from $97 to $177 in 2 months in oct 22'? Blatant market manipulation or just an undervauled card being properly repriced? The jump from $97 to $177 is \"natural\" but this recent jump from $186 to $300 is manipulated? Can you explain the difference between the two spikes?",
            "Yeah that’s what I’m saying, there has to be way more English because there’s more graded but the quality is  worse. So you’d have to submit many more English cards to get a 10, but at the same time the pull rates are way worse. \nSo either there are way less Japanese cards or they are significantly less desirable.\nWhich is interesting also because the quality and visual appeal is way better in Japanese.\nThat’s why my theory is the pendulum will swing in Japanese favor at some point. Could be years though",
            "If those are the \"general pull rates\" then that is what seeded basically means. This isn't just me speculating, I have opened up 100s of booster boxes from the Svarlet & Violet era, all of which are archived on Youtube. I've also watched hundreds more get opened by other channels. I could pull up any random one and the the amount of each type of hits will be right in the ball park of what I typed out.",
            "lol that’s just not the case whatsoever. Booster Boxes limit you to a max amount of hits, and it’s impossible to get above that without an error box.",
            "That’s the catch, the site is a bit clunky and their search functions are a mess. Googling the Pokémon’s Japanese name and copypasting the katakana works, and on the pages for specific cards, there are links to browse the sets they’re from. I typically navigate to the “Toy/Hobby” section, then “Categories,” “Trading Cards/other cards,” “Pokémon Trading Card Game.”",
            "Exactly! I feel I need to mention for others there isn't just ONE The One Ring, lol. There are 3-4 different printing, including Post Malone's serialized one.",
            "Don't forget they also have Transformers, Doctor Who, Final Fantasy, Fallout, Clue (Yes, the boardgame), and Hatsume Miku collabs.",
            "nobodys talking abt alt arts being in the manipulated value pile, boss. you gave the explanation in your own post, “in 2 months” rather than in 2 days. they show up as different spikes. 💀",
            "the demand for english is a lot higher than japanese so it would make sense that they print a lot more english product. english is also distributed and sold in multiple countries like the US and UK while japanese boxes say \"For Sale in Japan Only\" on them.",
            "Seeded means a guarantee of pulls, excluding factory errors and god packs. When you’re talking about average chances to get hits over hundreds of booster boxes, you’re talking about pull rates. That lack of a guarantee means English booster boxes aren’t seeded.",
            "Interested to see any evidence of that, or do you just say so because you've never seen above your \"limit\" outside an error box. What the limit for, for example, paldea evolved? If someone gets just one more hit than that, do they have an error box? \n\nError boxes are really obvious when they happen because every single pack has a hit. Error boxes are not when a booster box has slightly more hits than you'd expect. That's just the law of averages.",
            "Boss, you didn't even look at the  [chart](https://www.pricecharting.com/game/pokemon-fusion-strike/gengar-vmax-271?q=gengar+vmax+%23271). The 186 to 300$ was also two months (feb to april), not two days. Good effort, now try again. Explain to me what's the difference between the gengar vmax doubling in price in 2022 and it's \"natural\", but then when it doubles in 2 months in 2024 it's an \"obvious spike?\"",
            "Can you really call it a price increase in two days though? Maybe all the lower listings have just been bought out and less people are opening that set right now. If new listings are listed higher starting now, wouldn’t that be more accurate as a price increase?",
            "Show me a booster box from the Scarlet & Violet era that doesn't have at least 2 ARs. \n\nIf it were truly random, you'd have boxes with 10 EXs and no ARs, or 2 EXs and 6 ARs. But that does not happen, except in rare circumstances. So rare in fact, that Ive not seen a single one have pulls like that. If the pulls you get out of a box are always similar in nature to what I typed out, the boxes are effectively seeded.",
            "Error boxes come in many different forms based off of the type of error. Watch any SV box opening and tell me the amount of hits you see throughout the box. Not a single one will be outside the expected range for the set.",
            "Wasn’t that around the same time Fusion Strike finally went out of stock on PC?",
            "\"Maybe all the lower listings were bought out in two days\" 💀 defining a buyout in real time",
            "It also wasn't two days it was 2 months, just like the first price spike. u/BlockheadJay is just talking out their ass.",
            "Seeding means a very specific thing and it is a crucial process that the Japanese factories have to do to circumvent gambling laws. There is a guarantee that you’ll get a specific number of cards based on rarity, with small deviations. There’s no such need for TPC in the US to follow this process. You are highly unlikely to get an S&V box without at least 2 ARs, but it’s not impossible and it’s not an error when you do - it’s just probability in action. ‘Effectively seeded’ lacks the critical component of Japanese guarantees and is just looking at the improved pull rates of the rarer cards and trying to create some order where there is really no evidence of factories ensuring a box has a certain combination of hits",
            "And what is that expected range? I quite simply don't believe an extra basic v in a box qualifies it as an error. I don't think quality control is flipping their lids trying to solve the grave problem of a slightly higher than average hit rate in a box. If there were guarantees in a box, they would be announced by the pokemon company. The thing is, they're not. So any assertion of \"gurantees\" or \"seeding\" is just speculation and, frankly, misinformation. \n\nYou've set up an argument where even if proven wrong, you can just claim it proves your point. If I show you a box outside the \"expected range\" you'll just say it's an error, no matter how close it is or how far it is from that range or how frequently those \"errors\" occur.",
            "Not saying that ALL the lower listings were bought out in the past two days… just saying the remaining ones could have, and new listings are just higher now."
        ]
    }
}