{
    "Secondaries Directory (2024-2025)": {
        "title": "Secondaries Directory (2024-2025)",
        "score": 53,
        "url": "https://www.reddit.com/r/premed/comments/1d9oln4/secondaries_directory_20242025/",
        "content": "# Welcome to the 2025 application cycle!\n\nAMCAS, AACOMAS, and TMDSAS are all open for submission[.](https://imgur.com/a/pMgZxRU) If you've had a chance to submit your primary application and want to get ahead on writing secondary essays, this post is for you. Verified AMCAS applications will be transmitted to schools on **June 28th** at 7 am EST. AACOMAS applications are sent to schools as soon as you're verified. Same for TMDSAS.\n\nIf you want to track how far along AMCAS is with verification you can check the following:\n\n* [The AMCAS Verification Tracker](https://amcas-tracker.hpsa.org/)\n* [The sidebar of AAMC's AMCAS information page](https://students-residents.aamc.org/applying-medical-school-amcas/applying-medical-school-amcas)\n\nHere are some resources you can use to prewrite essays, track which schools have sent out secondaries, and monitors schools' progress through the cycle.\n\n**Student Doctor Network (SDN):**\n\n* 2024-2025 Threads: [MD Schools](https://forums.studentdoctor.net/forums/2023-2024-md-medical-school-specific-discussions.1198/) and [DO Schools](https://forums.studentdoctor.net/forums/2023-2024-do-medical-school-specific-discussions.1199/)\n* 2023-2024 Threads: [MD Schools](https://forums.studentdoctor.net/forums/md-medical-school-specific-discussions-prior-years.962/) and [DO Schools](https://forums.studentdoctor.net/forums/osteopathic-medical-school-discussions-prior-years.603/)\n\nI recommend you follow all the current cycle threads for your school list. Once secondaries have been sent, the prompts will be posted and edited in to the first comment in the thread. If secondaries have not been posted yet this year, refer to last cycle's threads for prewriting.\n\n**Reminder of Rule 10: Use SDN school-specific threads for school-specific questions.**\n\nThe biggest issue with Reddit is that it is not organized to track information longitudinally. Popular posts get buried after a day or two. Even if you do not like SDN, it is set up better for the organization of information by school over time. We will still ask that you use SDN school-specific threads for school-specific questions and discussion, sorry.\n\n**Consider using** [**CycleTrack**](https://cycletrack.org/)**!**\n\n* [Explanation of CycleTrack](https://www.reddit.com/r/premed/comments/uxo150/cycletrack_an_application_cycle_tracker_and/)\n* [CycleTrack School Explorer](https://cycletrack.org/explorer)\n\nCreated by [u/DanielRunsMSN](https://www.reddit.com/user/DanielRunsMSN/) and [/u/Infamous-Sail-1](https://www.reddit.com/user/Infamous-Sail-1), both MD/PhD students, \"[CycleTrack](https://cycletrack.org/) is a free tool for creating school lists, tracking application cycle actions, visualizing your cycle with graphs and contributing your de-identified data to make the application process more transparent and more accessible.\"\n\nGood luck this cycle everyone!",
        "num_comments": 9,
        "comments": [
            "What other medical schools have released their secondary prompts in advance? Right now, I know UChicago and UMichigan have them on their website.",
            "WOO",
            "I'm pre-writing some secondary applications and would love to speak to students who've been to the following schools so I can learn more about their programs and your individual experiences. I'd appreciate it if any students from this school would reach out. I wouldn't mind even talking on Zoom to learn about the programs. I'm not going into this blind, I've already pre-written some essays, but I want to learn more about specific experiences. Thank you for taking the time to read this!\n\nUniversity of Colorado SOM\n\nSpencer Fox Eccles SOM (Utah)\n\nEmory University\n\nFeinberg School of Medicine (Northwestern University)\n\nLoma Linda (California)",
            "Thank you so much for the post. I appreciate the advice and look forward to this cycle!",
            "Good luck everyone!",
            "NYU too",
            "Western MI and Mayo too",
            "Where can I find the one for Western Michigan?"
        ]
    },
    "Weekly Essay Help - Week of June 16, 2024": {
        "title": "Weekly Essay Help - Week of June 16, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/premed/comments/1dh620j/weekly_essay_help_week_of_june_16_2024/",
        "content": "Hi everyone!\n\nIt's time for our weekly essay help thread!\n\nPlease **use this thread to request feedback on your essays**, including your personal statement, work/activities descriptions, most meaningful activity essays, and secondary application essays. **All other posts requesting essay feedback will be removed.**\n\nBefore asking for help writing an application essay, please read through our [**\"Essays\" wiki page**](https://www.reddit.com/r/premed/wiki/essays) which covers both the personal statement and secondary application essays. It also includes links to previous posts/guides that have been helpful to users in the past.\n\n**Please be respectful in giving and receiving feedback, and remember to take all feedback with a grain of salt.** Whether someone is applying this cycle or has already been admitted in a previous cycle does not inherently make them a better writer or more suited to provide feedback than another person. If you are a current or previous medical student who has served on a med school's admissions committee, please make that clear when you are offering to provide feedback to current applicants.\n\nReminder of Rule 7 which prohibits advertising and/or self-promotion. Anyone requesting payment for essay review should be reported to the moderators and will be banned from the subreddit.\n\nGood luck!",
        "num_comments": 69,
        "comments": [
            "Hello, I'm wondering if any medical students are available to help me brainstorm some topics for different general essay types for secondaries. I have lists of potential topics and would love some feedback. Feel free to shoot me a dm or respond to this comment.",
            "Hi!! In regards to the 'adversity'/challenge you faced secondary prompt, I was thinking about writing about my sophomore year of college and having terrible roommates (heavily excluded me, came to the point that when I would enter the kitchen, they would move to someone's room to avoid me, super dramatic, terrible stuff)\n\nIs this part of the no nos of mental health? Is this too naive of an answer? \n\nAny feedback would be appreciated!",
            "Hello! I wanted some advice for the TMDSAS optional essay. I'm debating between writing about my experience with chronic migraines and how it lead me to do research on disabilities or my experiences starting college when I was fifteen. I'm a pretty boring applicant so those are really the only things I can thing of writing about but I'm also worried about both of those being red flags.",
            "Can someone review my PS?\n\nI know I am late. I have been really trying to get in, but with life stuff happening it’s been difficult.\n\nThe plan is to submit my app by this weekend, I have written my PS, so anyone mind giving me some feedback for it please?? \n\nI appreciate all your help and sending you all the love and luck for this upcoming cycle.",
            "Hi Everyone I'm currently applying as a gap year student and would like if someone were able to read my personal statement and critique it.",
            "hi! I know I'm also really late but have been trying to balance various things in my life right now.\n\nMy goal is to submit within a few days and I've written my PS and revised it a few times. \n\nWould someone please be willing to take a look at my essay? I appreciate any and all feedback. Thank you sm!!!",
            "hello all, can anybody review my PS?",
            "Hi all! Doing some prewriting for secondaries and was hoping for feedback on NYU Grossman prompt.\n\nI am wanting to answer this prompt:\n\nThe most meaningful achievements are often non-academic in nature. Describe the personal accomplishment that makes you most proud. Why is this important to you?\n\nI was originally going to talk about how I committed to my college for a sport because I had to work my @\\*\\* off to do this as I was a very NON-athletic kid but I knew I wanted to play this sport in college. However, I marked my sport as a meaningful activity and kind of already spoke to it in my primary. I don't want to be too repetitive. So, as a second option I was thinking of talking about how I decided NOT to retake my MCAT although my score wasn't exactly where I wanted it. This was a huge growth moment for me as I am very hard on myself academically. However, I decided to enjoy my senior year and spend time with friends/professors/classmates rather than focusing on being a perfectionist. Third option would be an essay talking about the impact I've had on my older brother after my dad passed. He started to skip school/hang with the wrong crowd and I was kind of his rock/worked to show him all that he was capable of.\n\nAny thoughts? Or should I bag both of these ideas....",
            "Hello, kinda stuck on my PS and looking for anyone that can help me read and provide constructive feedback. I'm still trying to cut it down but having a tough time removing anything lol. Please PM and I'll send a google doc link (you can leave comments but not edit :)) Also wouldn't mind swapping and reading someone else's, thanks so much in advance :)",
            "hi everyone! i'm planning to submit my app this weekend -- would anyone be willing to look over my PS? i'm down to swap as well :)",
            "Hi everyone! I'm still working on my primary and need someone to read over my PS! Willing to swap, just PM me!",
            "Hi, I'm looking for some feedback on the diversity/what makes you unique secondary, details are a little too personal to post in the comments but I would appreciate any and all insight!",
            "Hi! Would love some feedback on my personal statement, it’s the only thing holding me back from submitting rn. Please and thank you!",
            "Hi all - looking for help with PS review. Willing to read others and give feedback!",
            "Hello! I'm a first time applicant hoping to submit my primary soon and I would love it if someone could review my personal statement and provide feedback – my friends/family have read it but I'd like to hear honest unbiased opinions. If anyone would be willing to take a look and share their thoughts/suggestions, that would be greatly appreciated! :)\n\nEdit: Willing to swap!",
            "Can someone review my PS PLEASE!",
            "Hello! I am applying for the first time and am a Canadian applicant. I would greatly appreciate it if any current med students could kindly look at my activity descriptions as I hope to submit my primaries soon. thank you in advance!",
            "HI! Looking for a group to review prewritten secondary drafts. WOuld be happy to review yours as well,",
            "looking for some feedback on my PS! down to swap :)",
            "Hi! I was hoping to have someone review my personal statement- I am a few years out of school and no longer have access to my undergraduate pre-med advisor. Thank you in advance :,)",
            "Hi everyone, 3rd time re-applicant here, hoping to submit my primary this week. If anyone would be willing to take a look at my personal statement and/or my work/activities draft I would really appreciate it. Thank you!",
            "Anyone want to get on disc and work on secondary topics together via live chat ",
            "Hi everyone, I'm hoping to submit soon and would love for feedback on my PS and work and activities.  This is my first time applying, and as a broke student taking a gap year I can't afford to pay, so please no requests for paid edits.   \n  \nWilling to swap!",
            "Hi everyone, looking for someone to review my W&A section!",
            "Hello everyone, I have been starting to prewrite many of my secondary essays and would love to swap with someone or find some time to meet over the phone/zoom to review and edit essays or discuss schools, values, and certain secondary prompts. PM me if you are interested!",
            "If you dm a list of your potential topics I would be happy to give some feedback :)",
            "What are the \"no nos of mental health\"? I've been seeing this a lot but I don't think I quite understand what it means.",
            "I think it's all about how you write about the experience. Don't focus too much on the nit-picky, he said she said details of the drama but focus on how it made you feel, how you responded, and what you learned. You can definitely twist it to have an overall positive message about how this experience would motivate you to promote inclusion within your community. Doesn't sound like a meant health concern. If this was really impactful for you, write about it!!",
            "ahhh this might be a little bit risky to write about. I would avoid writing about someone else in a negative way just because of the impression it gives (no matter how justified you are)",
            "I'm happy to read it, send me a google doc link!",
            "send me a link if you still need someone to read it!",
            "I'm down to read it if you still need someone; just pm me with a Google Doc link!",
            "If you can write about the sport from a new perspective not already covered elsewhere it could work, but I think showing the adcom a side of you that they haven’t seen already would be better. \n\nI would put the MCAT in the academic category. Even though you chose not to retake, you are picking an academic adjacent topic and I’d worry that it looks like you can’t find anything not academic related to talk about which makes it seem as though you aren’t well-rounded. \n\nThe third option is better because it isn’t academic at all. If you can write about that experience in a way that answers the prompt I think it would be the best choice of what you’ve listed.",
            "send me a link if you still need someone to read it!",
            "hi!! i'm down to read over your statement, just pm me a link! would you be interested in looking at mine as well?",
            "Hey there! I can read your PS statement. I just finished mine and I would appreciate if you could comment on mine as well :)",
            "just PMed you! :)",
            "send me a link if you still need someone to read it!",
            "send me a link if you still need someone to read it!",
            "I'm down to read it if you still need someone; just pm me with a Google Doc link!",
            "hi, i'm down to swap!",
            "Willing to read/swap if you're still looking for someone!",
            "I'm down to read it if you still need someone; just pm me with a Google Doc link!",
            "PM'ing!",
            "down to read as well",
            "I'm can take a look at it if you still need! Send me a google doc link :)",
            "howdy - recently started writing mine and would love to have an outside person review :')",
            "I'm down too!",
            "Hello! Just about to start writing mine and would love to cross-reference secondaries. Msg me!",
            "Also looking to swap/edit prewritten secondaries!!!",
            "I would be happy to join the group!",
            "Down to read if you still need someone to!",
            "I'm down to read it if you still need someone; just pm me with a Google Doc link!",
            "I'm down to read it if you still need someone; just pm me with a Google Doc link!",
            "down to swap with u!",
            "I'm down to read it if you still need someone; just pm me with a Google Doc link!",
            "Sent you, check your inbox please",
            "sounds good!",
            "Thank you so much!!",
            "Thanks! Will send later tonight, tweaking some things at the moment :)",
            "Hello! Sorry for the late reply, I think I've got enough people giving me feedback at this moment. I appreciate it and will be down to read yours though!",
            "Hey! No problem, I'd love to read yours. Shoot me a pm and I'll send my doc link later today :)",
            "PM’ed you!",
            "PMed you!",
            "Dmed u",
            "Sent u a dm",
            "just pm'ed!",
            "Please PM me if anyone is interested. I would love to discuss secondary prompts and swap to edit essays",
            "PM'ing!"
        ]
    },
    "Current Med Students: Was undergrad harder for anyone?": {
        "title": "Current Med Students: Was undergrad harder for anyone?",
        "score": 23,
        "url": "https://www.reddit.com/r/premed/comments/1dlof1o/current_med_students_was_undergrad_harder_for/",
        "content": "This is a little long, I apologize in advance. \n\nI am an incoming M1. I think about how stressful undergrad was for me and I have a difficult time believing medical school could be worse (but all of the nightmare stories make me feel like it's possible). \n\nIn undergrad, I paid for my tuition out of pocket by working a flexible job. When I wasn't in school, at work, or studying, I was trying to fulfill my EC's by volunteering at the hospital or joining premed clubs. I did not have free time at all. Thankfully, I averaged about 5-7 hours of sleep each night. I had little to no money, usually about $35 on average in my checking and savings. I paid for all of my own groceries, car insurance, car repairs, and supplies. I did not have money to go to the doctor, so I just ignored my health. I could not afford fast food, scraped by with paying for gas (drove about 2 hrs total each day between school, work, and home). My mother allowed me to live with her and I did not have to pay rent, but our relationship was strained so there was no emotional support at home. My stress triggered periodic seizures (I have been recently diagnosed with with Epilepsy). My life was wake up, go to school, study, go to work, study, go to sleep, do it again. It was bad some days. I am grateful to say that I still graduated with a good GPA, so my study habits were likely efficient. \n\nI also had a boyfriend that helped me cope. He recalls us hanging out, which meant me studying in the same room that he was playing video games in. I haven't been on a true vacation since I was a child. I am not writing this to gain sympathy, but to paint a picture of my daily life in undergrad. So could medical school be worse? I am trying to guage what the experience will be like. For reference, I was about 20-22 in undergrad and I am 25 now. \n\nThank you very much to anyone who can contribute a story. ",
        "num_comments": 12,
        "comments": [
            "Obviously everyone's experience is different, but for me, I feel like my undergrad experience was worse. There's just so much to juggle in undergrad between academics and ECs and more, and the uncertainty of it all weighed on me a lot. I go to a P/F med school and I think that really contributes to my med school experience being better, on top of the fact that really outside of school/prepping for step1 I didn't have much else to handle in my first year.\n\nI will say that either way, you just need to have a good sense of boundaries and work-life balance, and be good about taking care of yourself. As someone who's not very good at that sometimes, that can make the experience much worse than it needs to be.",
            "P/F preclinical is “easier” when you’re focused on learning and passing without necessarily shooting for an A in every class. Outside of (some) basic science stuff the content also feels much more relevant to day-to-day practice and that’s a potent motivator to study hard. Ton of volume but not overwhelming if you chip away at it every day. I almost never studied past like 6 or 7pm M1 and M2. \n\nClinical years have their own stresses and you’ll work harder but it’s not comparable to undergrad. People don’t flunk out during M3/M4 for doing poorly on exams, they flunk out (very rarely) for unprofessional behavior.",
            "Dawg, you're going to be a doctor. Drink some chamomile tea, watch a movie, and go to sleep. You'll be fine, and you'll have outstanding people by your side to help you through everything you need. A big shoutout to you for getting accepted - I'm shooting for that this cycle. Proud of you for the strength to get as far as you have, trust me, I know how difficult life can be with your story similar to mine. \n\nI'm 27, and although I don't know how medical school is personally, I do know that adcoms never would have accepted you into their school if they were not confident in your ability to be an amazing and successful student at their institution. That shows people believe in you, need just need to believe in yourself.",
            "This will depend on what specialty you’re interested in as well. Want to do primary care, Neuro, psych, pathology, etc.? Then you can just get by passing and not worry about the rat race of research. If you want something like ortho, ent, plastics, optho, and the likes, then it will be similar to undergrad in that you need to pump out resesrch and ECs. BUT you won’t be working so that’s a huge load off. Since I don’t wanna do anything surgical, med school has been super chill so far and I just focus on studying, socializing, and doing bare bones research. Med school is fun so enjoy it!!!",
            "I was a chemistry major in college and junior year in college when I was taking 3+ upper division chemistry classes per quarter (including Pchem) was the most stress I’ve ever had in my educational career. Way worse than studying for Step 1 and Step 2. Going to a med school with P/F preclinical years def helped a lot. Med school will be busy and stressful, but tbh you develop your skills and it’s very manageable",
            "My undergrad experience was quite similar to yours (although I didn’t have the same health concerns and I hope you are doing well now!) in that I worked multiple jobs and was extremely stressed and busy all of the time. Constantly struggled with money and funded everything myself. I have also lived on my own since my senior year of high school. I felt like I learned to thrive in the chaos. My undergrad classes were very tough (Chem major) and as a non trad I was basically taking all science all the time. I had many breakdowns about balancing it all. \n\nThat all went away in medical school. It was the first time I was ever “just a student” and sure there’s a lot of volume, but it’s manageable. Honestly, it was far far harder for me to adjust to having so much of my own time to manage, and not having a job/being out in the world/contributing financially to the household ect. than the content. I think studying is a balance and it depends if your school is true P/F and when your exams are. We had exams every Monday during M1 and every other during M2. This made hanging out of weekends kinda tough, but we still made time even if it was only a couple hours bc of an exam. You can 100% do this!!",
            "For what it’s worth, I am enjoying med school way more than undergrad so far and I think that’s helped me in addition to P/F",
            "They are different. I sleep a lot more in med school than I did in college. The volume of content of medical school is much more challenging.",
            "your dedication is so impressive. you’re gonna make a fantastic doctor! only up from here",
            "Thank you for your input. I have made personal goals about my health and I definitely want to maintain them in med school. My school will also be pass/fail and I think that will ease the mental load. Thank you for your feedback!!",
            "Thank you for your kind words. That genuinely means a lot to me!!!!"
        ]
    },
    "And then they try to use the family card when you go off on them and imply because you're family, you have to tolerate their BS": {
        "title": "And then they try to use the family card when you go off on them and imply because you're family, you have to tolerate their BS",
        "score": 48,
        "url": "https://i.redd.it/wif2tsfkm08d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "All my coworkers are like “have you been accepted anywhere yet?” 😭😭 obviously they wouldn’t know any better but it kills me to explain the process hahah. \nAnd my family members being like “did you apply to that free school in New York” lol",
            "“you still going to school in california?” “well im applying there but it’s super competitive” “…so you’re going?” 🫠",
            "The key is to not explain and just nod in agreement.",
            "Too bad New York COL is through the roof. It’ll be like paying tuition for medical school.",
            "Look who finished residency."
        ]
    },
    "Too lazy": {
        "title": "Too lazy",
        "score": 86,
        "url": "https://www.reddit.com/r/premed/comments/1dlcufp/too_lazy/",
        "content": "Who else procrastinating writing their secondaries af rn\n\nI submitted my primary early this month but I haven't prewritten anything at all. Please tell me people are in similar situations so I feel like we're in this together",
        "num_comments": 41,
        "comments": [
            "Me every time I sit down to try and write a secondary my brain just turns off",
            "I want to vigorously bang my head against a desk every time I sit down to write secondaries",
            "i have been going so slow. ive written 6 essays total, dont know how some people have done 20+ schools. waiting for the crunch time stress to hit and make me go faster lol",
            "I overestimated my ability to brainstorm and write for 8 hours a day. I was hoping I could return to a normal work schedule soon but it seems I’ll have to do part time work and secondaries to make this bearable. Also, still waiting on my mcat score so I’m a bit hesitant to brainstorm essays for schools that I may not qualify for.",
            "I have done one secondary per day starting 6/1 - although I cannot guarantee their quality isn’t on par with a ChatGPT generic cookie cutter diversity response 💀 It feels like I’m pooping out of my brain onto the page for every secondary I complete.",
            "Writing is a different kind of pain. I’d do it a million times before taking the MCAT again tho",
            "i just revert back to researching each school & i applied to 38 schools 😭 \ni’ve just been focusing on prewriting ideas for general prompts/themes to expand on in the mean time",
            "Mine procrastination is rooted in fear that the schools will change their secondaries this year and now I’ve invested all that time writing for nothing.",
            "Still procrastinating on my personal statement - to submit, just cant seem to get it done.",
            "Same I can’t get myself to sit down and write them especially after looking at how many essays there are to write",
            "I am so cooked, wrote 5 or 6 essays so far applied 40 schools",
            "ME TOO praise God there's people like me struggling out there",
            "I am writing but the product is trash",
            "glad to see other people are in the same boat. i keep telling myself im applying to indiana which doesn’t have a secondary so im not that stressed until i remember there are 28 other schools im applying to that do have a secondary :(",
            "14 schools done but I can't guarantee that it is past 3rd grade level of writing. Me like diversity and helping people, i love your school because it does research",
            "I just finished submitting my primaries last week (got my MCAT back), and I cannot make myself sit down to pre write anything. I scored kinda low and am having to poly broadly, which means potentially lots of essays. 😫",
            "literalllyyy. currently riding on the excuse of oh lemme get through my preview and casper first but. AAAAAAAA",
            "Start when you feel ready.  You only get your youth once.  If you already got your primary in, you’re in a good spot.  If you applied to 31 schools and write 1 per day July, you’ll be borderline early with your submissions.  Mostly likely you’ll be able to write 2-3 per day once you get past the first 10~",
            "Applied to 38 AMCAS schools and I ain't even touched a single one. I applied relatively \"late\" (FOR THIS SUB) last week tho, so I probs won't be verified until late July. I need to get started soon so that my turnaround is almost instant...",
            "For more information on secondary application essays, please visit our [Essays Wiki](https://www.reddit.com/r/premed/wiki/essays). To find secondary essays for each school, check out the following links to SDN:\n- 2025 Cycle: [MD Schools](https://forums.studentdoctor.net/forums/2023-2024-md-medical-school-specific-discussions.1198/) and [DO Schools](https://forums.studentdoctor.net/forums/2023-2024-do-medical-school-specific-discussions.1199/)\n- 2024 Cycle: [MD Schools](https://forums.studentdoctor.net/forums/md-medical-school-specific-discussions-prior-years.962/) and [DO Schools](https://forums.studentdoctor.net/forums/osteopathic-medical-school-discussions-prior-years.603/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/premed) if you have any questions or concerns.*",
            "Haha same",
            "I rationalize it by telling myself that I'm preparing for ca$per and I'll work on them afterward.\n\nI'm also procrastinating preparing for ca$per.",
            "I didn’t even pre-write the primary. Actually, I applied super late and submitted secondaries between October/November.",
            "I have like 10 words in every prompt and that's all I've got.",
            "I prewrote for two schools and am convinced the rest will be copy paste",
            "Me watching secondaries flood my throw away email (Texas applicant) … but haven’t taken Casper yet so I’m just telling myself I have plenty of time 😭",
            "Me but it’s easier if you get either drunk or high. The essay ideas flow much easier and my words are more passionate and impactful. I’d just edit them sober lmao",
            "Never seen such a relatable reply.",
            "underrated comment",
            "me too - i've done a few rough rough *rough* drafts D,:",
            "me too lol",
            "i feel so generic as hell im so scared - i get so anxious writing secondaries for my dream schools I'm like \"I'm so basic help\"",
            "I'd rather take the MCAT 3 more times than write essays I'm going insane",
            "i relate with this so much - i applied 32 :,(",
            "How much is that already?? 40??😭",
            "*I prewrote for two*\n\n*Schools and am convinced the rest*\n\n*Will be copy paste*\n\n\\- Immortal\\_lunch66\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "Would you not change some of them to match the mission statement at least?",
            "POV I’ve done 2 ❤️ (and they were ROUGH drafts)",
            "Of course I will I was kinda joking"
        ]
    }
}