{
    "Join us on the /r/Productivity Official Discord Server!": {
        "title": "Join us on the /r/Productivity Official Discord Server!",
        "score": 237,
        "url": "https://discord.com/invite/productivity",
        "content": "",
        "num_comments": 1,
        "comments": []
    },
    "Weekly help me be productive/I need advice thread": {
        "title": "Weekly help me be productive/I need advice thread",
        "score": 3,
        "url": "https://www.reddit.com/r/productivity/comments/1dhp8uw/weekly_help_me_be_productivei_need_advice_thread/",
        "content": "If you’re looking for specific advice for your situation, please post here.",
        "num_comments": 8,
        "comments": [
            "I am interested in trying the 4 am waking-up thing. I tried it one day, and even though it was good, I didn't think it would suit my situation. \n\nSo I am living alone and I am a solopreneur. Apart from work, I got food to make, a house to clean, and other chores. These things take a lot of my time, and it gets hard to actually focus on the work. For example, when I woke up at 4 am, I worked from 4-9 am. Then I cleaned the house and got to prep for lunch. All this took me 5 hours. So now I have a few hours before I sleep at 8 pm. Is there anything I can do to fix this? I think I need to cut down on those 5 hours, but honestly, making food takes a bit of time lol. Any advice is appreciated.",
            "I have the motivation and headspace of a tea spoon and are looking for apps that can kick my butt.\n\n\n\nI have tried Habitica and Finch, but I just add the tasks I already do and it kinda takes away the point. I like the concept of the apps with RPG elements, but I am looking for something that can just give me tasks. Like, \"Hey, I think this is the time for you to clean the bathroom - you have three days\"\n\n  \nDoes something like this exist?",
            "I tried the 4am wake up over a month period and found I was tired in the afternoon.  Now I get up at 5am and I feel better for having that extra hour sleep.\n\nHere are a few suggestions that I have personally done:\n\n1 - Priortise my goals - Trying to do everything means I personally get stressed, overwhelmed and generally procrastinate.  I have had to learn to prioritise a few things rather than loads.  Focus on fewer areas where you can put more effort into it.\n\n2 - I paid for a cleaner to clean my house.  It was the best thing I did. It gave me back so much time.\n\n3 - Do what is right for you, not what everyone else says to do.  I'm slowly learning to listen to my body and intuition more and I'm seeing such a difference.  So 5am work for some but not for others.  \n\nHope that helps.  If you want more help message me.",
            "what's your business venture about?  I am also looking to to start a side business, maybe can you guide me a little?",
            "[removed]",
            "Thank you for the advice. It's the second day and I feel productive enough. It's a little hard to sleep at 8pm because maybe my body is used to sleeping around 11 pm - 12 am. I wish I could hire cleaning people or cook, but I am considering it for the future. And yass! I am listening to my body, therapy really taught me this. I am not being hard on myself. I am just trying to experiment.",
            "I am the owner of a boutique SEO Agency. I can't tell you much about side businesses because I don't have any :)",
            "Hello, r/productivity does not allow advertising, including and not limited to other forms of promotion, as well as the solicitation/surveying of products & services; this content has been removed. \n\n>*If you are not sure or believe this is an error please [send us modmail here](https://www.reddit.com/message/compose?to=/r/productivity&subject=RE: Advertising content removal: possible error).*\n\n^(Trying to circumvent this warning may result in a ban if contents are still related to advertising. *There are no special exceptions.*)"
        ]
    },
    "Who are your favourite productivity/learning related creators right now? ": {
        "title": "Who are your favourite productivity/learning related creators right now? ",
        "score": 74,
        "url": "https://www.reddit.com/r/productivity/comments/1dlki9r/who_are_your_favourite_productivitylearning/",
        "content": "Looking for new people to add to my podcast / Instagram / YouTube / blog rotation. I already follow / subscribe to Tim Ferriss, Andrew Huberman, Jocko Willink, James Clear, Veritasium, AthleanX and a few others but looking to branch out. \n\nInterested in anyone producing good quality productivity/learning content regardless of topic and follower size - just want to have those high quality information flows ",
        "num_comments": 23,
        "comments": [
            "Cal Newport and Deep Work are a game changer for focus and flow.",
            "All of these are YouTube channels.\n\nPRODUCTIVITY:\n\nElizabeth Filips does a lot of research (with the sources in the description), talks about things I’ve never heard before in the productivity community and the editing is great.\n\nJustin Sung is a former doctor and a full-time learning coach and gives the best advice for studying and learning any skill. \n\nRuri Ohama has really helpful and impactful videos about self-improvement. She’s great for people who are overwhelmed and procrastinate. She also talks about business and language learning.\n\nEscaping Ordinary makes stunning visual summaries of the most popular productivity books.\n\nHealthygamerGG is a psychiatrist who gives mental health advice, particularly targeted to men, excellent listener and communicator.\n\nClark Kegley has a lot of videos about shadow work, detachment and identity shifting to become more productive.\n\nFinally, Ali Abdaal is a former doctor and I think the most popular productivity expert on YouTube. He talks about all topics related to that (book summaries, tech, habits, journaling, finances…). His book is good.\n\nGENERAL KNOWLEDGE:\n\nKurzgesagt: science\n\nScott Manley: space\n\nSEA: space\n\nCurious Droid: aerospace history and technology\n\nMark Felton: history (WW2)\n\nAperture: philosophy \n\nTale Foundry: fiction and writing\n\nReligionForBreakfast: religion\n\nJohnny Harris: politics & current affairs\n\nPatrick Boyle: economics\n\nAnswer in Progress: random questions\n\noliSUNvia: social science, media & gen z trends\n\nBroey Deschanel: movies & pop culture\n\nThe Game Theorists, The Film Theorists, The Food Theorists, The Style Theorists: four channels with four entertaining hosts (they were all owned by MatPat before)",
            "Ali Abdaal has some good content.",
            "Love Thomas Frank for general productivity and his second channel Thomas Frank explains for Notion",
            "Surprisingly (for me since I didn’t like this book) - Mark Manson",
            "Add in modern wisdom. Great one",
            "I'm a huge fan of Dan Carlin for history. Would also recommend Adam Grant for productivity",
            "Rian Doris on YT",
            "[Rian Doris](https://www.youtube.com/@riandoris) on YouTube. Watch his video on [How To Force Your Brain To Crave Doing Hard Things](https://youtu.be/K8ZgwZf1E3E?si=T-PDrhqXsyVIpPVm). It's really good!",
            "KaseySnowArt on twitter. She does warm-up and study streams and they're great! We call it the art gym",
            "Spoonfedstudy is the best productivity channel on youtube rn imo",
            "The Diary of a CEO for me are THE BEST from neuro science for improving brain health to authors of best seller books like 'The 48 Laws of Power' Steven Barrettcover it all^^",
            "What he does best is theory. Too many productivity YouTubers focus on apps and tools. They also often only have careers as content creators focused on productivity. Cal Newport has a normal job.\n\nFor those with a more normal office environment, Jeff Su is good. Also a person with a normal job.",
            "Those first few are great, thank you!",
            "And what are the most interesitng things you learned about productivity?",
            "Hahaha U seriously think Mark Felton is good? He's a plagiarist and sensationalist, and not even a reak historian. U must be pretty stoopid to like Johny Harris and the rest too.",
            "Ditto for Dan Carlin - have given some of his series multiple relistens. Heard some of Grant’s stuff through other pods but not his own stuff - will give it a go!",
            "Honestly I always forget to take notes but from memory these are the most common points:\n\n1. To achieve flow state you should hide all distractions (phone in another room) and have a clear to-do list with big tasks broken down into actionable steps.\n2. A dopamine detox (no junk food, social media, porn, alcohol, ect for a certain period) can be helpful.\n3. Don’t work and relax at the same place.\n4. “Body doubling” can be helpful for accountability (go to a library, cafe, find a work buddy online or work with friends in the same room).\n5. Always plan the next day the evening before and prepare everything so as to make as little effort as possible in the morning (gym clothes, work materials, ect).\n6. Habits are everything. To build good ones and to break bad ones, the good ones have to be visible, attractive, easy (reduce friction) and satisfying (track your progress). Make sure the bad ones are the opposite.\n7. Good night routine: take the time to wind down, dim the lights, no electronics, journal, read, plan the next day.\n8. Get 7-8 hours of sleep and go to bed and wake up at the same time everyday.\n9. To sleep well: relatively cold room, no light at all, exercise during the day, avoid caffeine too late.\n10. Good morning routine: wake up early to avoid rushing, don’t snooze (otherwise your first action of the day is to procrastinate), get sunlight, drink a big glass of water, meditate.\n11. Shift your identity if you want to change (“I try to stop smoking” vs “I’m not a smoker”, “I’m lazy” vs “I’m someone who never skips gym). \n12. Best study techniques: active recall, space repetition, past papers, blurting, Feynman technique, flashcards, mind maps, non linear notes, interleaving, pomodoro + taking breaks (worst: summarizing, rereading, highlighting, multitasking). Intensity (deep work in flow state) > time spend.\n13. Notion and Google Calendar are amazing tools to plan your life. Time blocking is a good method for Google Calendar. Batch similar tasks.\n14. Manage your energy and not only your time: work at the time of the day when you’re the most productive and “eat the frog” (the biggest/hardest task should be the first task of your day to build momentum).\n15. Set SMART goals: specific, measurable, attainable, realistic and time-bound. Prioritize you goals and tasks (the Eisenhower Matrix helps).\n16. Always reflect at the end of the week to recognise what you’re grateful for, what gave you energy, what drained you, what worked, what didn’t and what you can improve. And clean you physical and digital spaces. Meal prep for the next week.\n17. Let go of perfectionism and just start. Motivation comes after action, not the other way around. The 5-minute rule: set a timer for 5-minutes, work seriously until the timer goes and you can stop. But you will be motivated to continue.\n18. Set boundaries and don’t hesitate to say no when it’s not a clear yes. Be more fully present and invested in you life and mental health to avoid FOMO (fear of missing out).\n19. Before grabbing your phone to scroll ask yourself if it’s intentional or just automatic. The app One Sec helps.\n20. Identify the “why” behind your studies/job.\n21. Discipline is a muscle you have to train so you have to go outside of your comfort zone and just start. Tips: take a cold shower, 5-second rule (if a decision presents itself, you've got five seconds to act), start small, practice delayed gratification, change the location.\n\nThat’s all I can think of right now, I know it’s quite basic but yeah.",
            "All this information about productivity but forgets to take notes was funny to me. 😀 it's the first thing of gtd, capture.",
            "I know lol I don’t apply most of the points I wrote too (my sleep schedule is all over the place, I’m always cramming, I don’t even have routines, ect) because I’m overwhelmed by college but I’ll try to change this summer 😂",
            "Yeah this comment of hers is pretty helpful, too bad she's stoopid."
        ]
    },
    "Why i don’t take my life seriously ": {
        "title": "Why i don’t take my life seriously ",
        "score": 69,
        "url": "https://www.reddit.com/r/productivity/comments/1dlgyl5/why_i_dont_take_my_life_seriously/",
        "content": "Hello, I’m 33 years old soon i will be 34, \nI waste the last 8 years on being lazy doing nothing i spent all my time scrolling watching videos, porn, and Netflix.\nI got a job as electrician in a company it is the first time get a serious job, i just started learning about electricity industrial, its been almost a year and i feel i still didn’t learn much. \nEverytime i say i would study to emprove my skills i find myself holding my phone watching porn or scrolling, i find it hard to focus on something requires concentration, and when i force myself to do it i quickly forget about what i learned.\nIm not addicted to social as long as i am addicted to browsing, i deleted all social media apps even youtube, but i found myself using browser to use youtube. \nSometimes i get curious about an artist who came to my mind and search about his or hers about their network stupid stuffs which will not benefit me.\nI spend more than 2 hours scrolling porn on x or reddit,\nI quit porn now it’s been a week even that i still wasting my time on the phone \nI don’t know what to do, i miss being productive, i miss having a goal and working on it instead of wasting my life ",
        "num_comments": 40,
        "comments": [
            "You're not hopeless like these other comments allude to. I think you just need to do a life audit and work on your mindset.",
            "seek professional help",
            "Because your life isn‘t serious. Maybe the goals you think you should have suck and you just need to find better ones or an idea of how a fulfilling life would look like for you",
            "Before or after or while you're scrolling, stop and ask yourself who you could do something for, no matter how small that something might be. Someone will come to mind. And usually something. \n\nTry to do it. Might be as simple as sending a text, or asking someone how they're doing, or thanking someone at work for teaching you or helping you with something. Most of us are gonna spend time scrolling, wasting time, and stuck in our own head and problems. But we can also choose to stop being alone and start being together. Doing something for someone else is often the best thing you can do for yourself. Those small choices and efforts matter. \n\nYou matter.",
            "You probably have ADHD and it’s out of your control but meds could help. Your description sounds very much like it. It’s essentially Executive dysfunction It’s very common. Try and get help or watch videos on YouTube about it.",
            "the fact that you realize it, is a great first step. What i found useful in my journey so far is brute force (coz motivation is a scam). Improve a little each day. You will fail. Its ok. Get back up next day and repeat. And most importantly, Sleep early, wake up early.  \nLet's go...we can do it.💪",
            "Yeah you have ADHD dude. Zero control of your executive functions and a slave immediate releases of dopamine. Go see a psychiatrist and get evaluated. ",
            "Try writing.\n\nOpen a notepad and start writing your thoughts, more often that not, we already have the answers to our own problems, its just we don't see it clearly.\n\nA profesional help can also be important if you need the extra push.\n\n> i spent all my time scrolling watching videos, porn, and Netflix\n\nIts the dopamine rush that's fking with your brain here, try to limit your social media consumption to two or one time a day. Like don't open it at all until its your time of the day to use the app.",
            "Same 🛶",
            "As for free options: do sat kriya you can find how to do this on youtube, its to help you with your sexual energy and rise that energy to other levels of your energetic body so that you can push through addictions. Even just 3 minutes a day of sat kriya is extremely helpful for this as well as other benefits. Start affirmations in the morning/ anytime of day say out loud \" I am willing to make a new decision\" or \"I am willing to make changes to improve myself little by little\" when you know you're about to step into an old habit. Meditating, journaling your thoughts emotions, finding new hobbies to replace the old could be helpful!",
            "Dopamine addiction. You won't seek out goals if you constantly reward yourself. Stop with hedonism, see what comes up after the withrawals. Is it a cheap immediate gratification, then you probably are going to build anything. If it seems challenging but interesting, then its probably long term rewarding and will help you grow as a person. Read \"atomic habits\" and \"dopamine: the molecule of more\" good luck chuck",
            "Find something different that is addicting like coffee that will change it up for you - I only say this because I got addicted to caffeine on purpose that way it would force myself to work out",
            "I know this is flooding social media right now but it could be worth getting tested for adhd. This kind of sounds like a case that could be a late diagnosis. \n\nAlso in general it could be worth looking into how serious you take yourself and love yourself. There are a lot of “should be’s” and “could haves”, but none of that stuff really matters until we really value ourselves and know what we want. When you build a track record of 8 years of NOT doing what you said you would do, it makes it hard to believe that you will really make a change, especially when you first attempt to change. You subconsciously teach yourself that you can’t be trusted, so to remedy that, you have to slowly teach yourself the opposite, by keeping the smallest promises to yourself and then working your way up. It’s hard but you can do it. Look up the Japanese principle of kaizen. \n\nI’d recommend listening to the audiobook atomic habits by James clear. I say listen to the audiobook because it’s easier to commit to. Even for just 5 minutes. Again I know it’s pretty over saturated social media but this book is really helpful in breaking down habits and the science behind how our minds handles them.\n\nAlso look into the principle of changing your systems Vs making goals. This is a games changer in seeing how you plan your daily choices. \n\nI haven’t listened to this one yet but I’ve heard Scattered Minds by Gabor Maté is also very good for those who could possibly have adhd or show similar symptoms. \n\nTherapy can help you build a plan for the the next steps. \n\nYou’re battling a multilayered struggle. Many of us are and there’s nothing wrong with you. It’s more common than you think. Please don’t beat yourself up and give yourself grace. It’s the only way to stick the journey through to a more satisfying life. \n\nI struggle with the same things and I’m starting to see differently through. As long as you are here, still in this earth, you are doing great. Don’t let anyone tell you any different, that includes yourself too",
            "Try mushrooms. Im 100% serious. It helped me realize that I was a shitty worker and motivated me to do better because my boss is a good person that deserves better than me.\n\nAlso helped me with my other relationships in my life",
            "You’re trying so that’s the first step. Good luck. Going through something similar. \nI think scrolling negatively impacts my brain and destroys any and all motivation to learn new things that take longer than 5 minutes.",
            "Try meditation.Sit with yourself.\nGo deeper into your mind what you want from life.",
            "You’re not serious because your goals are not. You need stakes. If you’re comfortable, live hard.",
            "Just do you, you will die eventually, so die doing the things that gives you peace",
            "Professional help and/or books that explain why it's happening to you and millions of other people. Books like \"What is Internet doing to our brain\", which make you more conscious about how tech companies exploit our brain biases and how it changes our memory, attention span, and a lot more.",
            "Since you mentioned YouTube, consider watching Andrew Huberman's episode on addiction. There is typically a scientific way to address a problem once you know the mechanism of the problem  [https://www.youtube.com/watch?v=p3JLaF\\_4Tz8](https://www.youtube.com/watch?v=p3JLaF_4Tz8)",
            "Worth looking into ADHD. Sounds a lot like it tbh. Or just see some professional help in general. It doesn’t really matter whether you get a diagnosis out of it or not. They will be able to help you lead a more fulfilling life.",
            "I've heard that the Peruvians have some sort of \"marching powder\" (a powder of sorts I guess) that should have similar effects. It's even more addicting so it must be betterer too, right babe??",
            "ur cooked bro",
            "True",
            "Take out a piece of paper. Write down you goal, daily. Make a box by each I item, when it completed, check it off. It’s a proven fact that checking of completed items, gives you a bit of an adrenaline rush. Then you want to get more done. The has worked for me for 45 years. \nIT REALLY WORKS, just do it.",
            "I do now",
            "Yes we can",
            " also during a period of change, the key is to be kind to yourself! pay attention to the words/ thoughts you say about yourself.  Read Louise Hay (watch her youtube vides), read joe dispenza, listen to inspiring youtube videos etc!",
            "I read atomic habits two years ago and i forgot all about it",
            "Thank you so much",
            "They are not for everyone though. Be cautious and don't take too much OP, you can't take less.",
            "Thanks for recommending",
            "I started seeing a therapist it’s in our first sessions",
            "Thank you so much",
            "I’m so glad for you. And if you feel this therapist isn’t right for you then don’t hesitate to change to a different one. All the best :)"
        ]
    },
    "I have been a chronic procrastinator for years .How do I get back my life together?": {
        "title": "I have been a chronic procrastinator for years .How do I get back my life together?",
        "score": 3,
        "url": "https://www.reddit.com/r/productivity/comments/1dlu74h/i_have_been_a_chronic_procrastinator_for_years/",
        "content": "I am in my mid twenties , the typical burnt out gifted kid , I did very well until 10 th grade but my tendency to procrastinate started from around 7 th grade.It was manageable , it became overwhelming now it is all consuming.\n\nI have literally wasted a few years in daydreaming, collecting random information, internet rabbit holes, overthinking and social media .\n\nThe hope in me hasn't given out yet, over the years in college I began to understand myself through friendships and relationships , from just looking at myself as a failure or a lazy person or someone with the self esteen of a brick , I do understand myself better .\n\nI have been on therapy for a year now diagnosed with both anxiety and depression, my binge eating lead to obesity , I have a bad sleep cycle , I feel very crippled and emotionally devastated.\n\nMy belief in me in zilch , I do start working on these things and I follow through for a week or maybe a month max and then give up .\n\nNow I have an exam to enter postgrad , I really want to get out of this rut , I want redemption, I want to be happy , at peace with myself , I have understood no job is going to be 10/10\n\nIf you like what you do , if that aligns with your ethics, purpose and vision go for it , before  a  few years even turning upto my job was difficult . How do I start?\n\nWhen I begin to even jot down things to study , I escape it with music , yt and breaks.Why am I so scared ? I fear I am going to be this way , I don't want to .I watch and read productivity related stuff butI am not able to take the first step .\n\nIs it belief or will power , what do I need to start?\n\nWhen these feelings arise , I literally feel like a 3 year  old , overwhelmed, scared and want someone to save me.",
        "num_comments": 0,
        "comments": []
    }
}