{
    "Weekly Questions Megathread - June 18, 2024": {
        "title": "Weekly Questions Megathread - June 18, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/projectzomboid/comments/1dicxxu/weekly_questions_megathread_june_18_2024/",
        "content": "Don't feel like your question warrants its own thread? This is the place for you. No matter if you just want to know if the game will run on your specific machine or if you're looking for useful tips because you've just gotten the game.\n\n&#x200B;\n\nYou can also hit us up on our [Discord](https://discordapp.com/invite/theindiestone).\n\n&#x200B;\n\nYou might find some of the answers to your questions in our [Wiki](https://pzwiki.net/wiki/Main_Page).",
        "num_comments": 42,
        "comments": [
            "What's the best way to level up maintenance?",
            "Day 2 of asking for gorier deaths. I really want to be physically ripped apart.",
            "For map/location mod such as Raven Creek, is there a way to reduce the car wreckage? It is so annoying to drive your car around.",
            "Other than survivor houses, is there a best place to search for machetes?",
            "What's a good way to find a server/people to play with? I don't see a thread dedicated to this and the in-game browser only shows 5 empty servers ...",
            "If I turn zombie respawn off in sandbox, does that affect the initial zombie population increase up to that 30 day peak?  I still want the population growth peak, but want them to stay dead once I clear a neighborhood.",
            "Dammit! :(  My girl Heather Romero just got bitten while clearing out downtown West Point. Lasted 2 months and 22 days, put down about 2600 zeds. She was badass with a spear and machete, but maybe not so great at defending while going up staircases.\n\nAnybody know of a mod or some file-fu to export her diary?",
            "How would you say the Guns of 93 Mod compares to VFE or Firearms B41 Revamped?",
            "I have a question about a sticky situation I'm in on a multiplayer server I play on.\n\nLast night I was driving a car and it got stuck due to the black void and for some reason zeds spawned around me so I couldn't get out of the car to run away. I just logged off due to panic, now my question is what's going to happen with my character? I haven't logged on since as I'm afraid she might be dead already, or I'm still surrounded by the hundreds of zeds I left behind. I'm scared to log in, what should I do?\n\nMaybe it's a silly question, I don't know but I'm genuinely seeking help with this. Also it's a live server meaning time goes on even without players being on, will the zeds move away from me in this case?",
            "What is the sound radius for guns in vanilla? How many tiles for a shotgun versus a pistol?",
            "My modlist keeps breaking as soon as I reopen my single player world, happened to me in two of the worlds making them unplayable even after I reload them in. Is there anyway to prevent this from happening?",
            "Hey guys, I've got a question, i build my base in Muldraugh Mass-Genfac Co. warehouse, I decided to expand on the second floor a bit, so sledged some railings and built some floors\n\nProblem 1: Newly placed floors are considered to be outdoors. How do I fix that? \n\nProblem 2: I've tried to fix that by building wooden floors on the third floor to maybe make that a viable roof. That didn't work so I disassembled wooden floors on the third floor and now I have holes in the roof. \nHow can I patch the holes with the same texture as the rest of the roof? The first problem still stands. \n\nI've seen youtubers that were able to somehow make viable roofing on second floor expansion and I've tried using debug mode to perhaps place tiles that are in the game but haven't found that option\n\nPlease help 🙏",
            "Yooo first comment, Is it true that b42 should be released in the first half of the year? Or was it postponed? I'm just not in the subject and haven't been interested in it for a long time",
            "Non cheese way. Use crowbars. Maintenance is leveled when you hit something, and whatever you hit it with doesn’t take damage. Crowbars have the lowest chance of that happening, so for obvious reasons it’s the best. \n\nFor cheesing, apparently you can shove a garage door, and that will lvl it up, but I’ve never done this so can’t confirm it. ",
            "Another vote for the crowbar.  But also, selecting a trait or profession that increases maintenance (or any skill), will give that skill an XP gain % boost.  Maintenance levels much faster if you chose repair man or chef/burger flipper.  Also selecting the handy trait for -8 will give a boost.  Finally I think fast learner also affects the speed it levels.",
            "Well, we're one step closer to that in b42 with model joining animations. No promises tho, of course",
            "for an ingame method just get propane tanks, a torch and a welding mask. Gives you plenty of metalworking xp and resources as well. Alternatively you can just tow and push wrecks to the sides of the road.",
            "From [the wiki](https://pzwiki.net/wiki/Machete)\n\n* The best method of finding a machete is looting hardware stores. The [West Point](https://pzwiki.net/wiki/West_Point) and [Riverside](https://pzwiki.net/wiki/Riverside) shopping district each have a hardware store.\n* Pawn shops and military surplus stores have a high chance of spawning machetes. Both can be found in [Louisville](https://pzwiki.net/wiki/Louisville).\n* Machetes can spawn in metal shelves in warehouses.\n* Machetes can also be found inside barricaded buildings.",
            "Usually random servers advertise from time to time on here, and sometimes you see random Workshop mods that are made for X server, but as far as I know there's no dedicated resource for finding them. Every server is a Discord community like everything nowadays, so it doesn't make it easy to find them. I imagine if you simply ask and make a post, saying you want an RP server or a casual PvE server or whatever you'll get some hits judging by past threads.",
            "There’s a PZ discord that has a sub thread for servers. Both servers advertising and people looking. ",
            "If I understand correctly, any cells you load as you advance towards peak day will have permanently lower values since you first loaded in the cell before peak day.\n\nFor example, day 1 you spawn in Rosewood and the starting cell on day 1 of 28 has, random number here, 100 zombies. If you drive into Muldraugh on day 7 of 28, then maybe that cell has 250 zombies as the desired max, but if you had got there on day 1 it may have only been 100.\n\nSo after the first 28 days are over, any cell you go to will have the peak population, but any cells you already explored will have a reduced amount depending on how early you first loaded the cell.",
            "maybe spawn another survivor in the same world and go get it? if you want a copy outside pz, you can copy it to your clipboard using ctrl c while in game and then paste wherever when back in windows…\n\nedit ctrl+a also works to select all…",
            "This might not be true, but the Zombies have either moved away by this point, or despawned if there aren't any players nearby.",
            "The [wiki page on weapons](https://pzwiki.net/wiki/Weapons) is updated for the current version, look for the sound radius symbol in the tables of the guns.\n\nFor example the most quiet gun is the M36 revolver with a noise radius of 30, while all of the shotguns have the max noise radius of 100.",
            "Answer 1: You can't, from my knowledge.\n\nAnswer 2: More Builds mod or other similar alternatives.",
            "Given recent [news](https://www.reddit.com/r/projectzomboid/comments/1dj4jcm/lemmy_speaks_out_against_the_spiteful_community/), it will definitely be postponed until later this year (if even that). The devs are apparently stressed out of their minds, pulling their hair out, and regret ever saying \"first half of this year\". That timeframe was apparently a very optimistic estimate, and things got so bad they even considered selling the company.",
            "\"First half of the year\" was an approximate timeframe that was given by one dev back in december 2023, in a reply of a comment on reddit. But it doesn't look like they will make it in time.\n\nThey have very recently decided to polish and bug-fix what they currently have to release it publically in beta state, instead of waiting for the crafting overhaul to be fully complete.\n\nThough they haven’t worked out exactly what will be in the first iteration of b42, there’ll still be a lot of new crafting for people to sink their teeth into, from stuff like the blacksmithing, pottery, woodworking, food preservation, extra fluid and workstation mechanics, new crafting system and much more. Certain crafting tech trees they’d hoped to be in the initial 42 Unstable release will be pushed back though, to avoid any more unnecessary delays.",
            "I think shoving zombies works too so long as you have a weapon equipped",
            "Oh right! The push car mod!",
            ">*but any cells you already explored will have a reduced amount depending on how early you first loaded the cell.*\n\nAnd that is specifically because I turned off Zombie spawn?  But if I left zombie spawn as default, then the hypothetical day 1 cell could climb to the example peak of 250?   What I'm reading is that by turning off zombie spawn, the cell I'm currently in gets excluded from that day 1 to day 30 population climb, right?",
            "Thanks for the response, I'll probably log back on today and see what happens then.",
            "Selling?????💀💀💀Hell nah i ain't playing new pz if they do so",
            "Its not a mod, you can push cars in vanilla. Just bump into the car as slow as possible so you dont damage your own ride and then once youre touching floor it. Helps to have a car with good acceleration. \n\nIts often easier to just tow cars out of the way though, less risk of breaking your own car and faster. Less convenient though as youll have to hop out, hook them together and get back in every time though so Id push cars close to the sides out of the way and tow those in the middle of the road.",
            "You're correct. With respawn disabled, loaded cells get locked at whatever their first loaded 'desired population' is. Even if you come back later, the cell's already loaded and set to that lower desired population because it was visited prior to peak day.\n\nWith respawn on, the desired population of the cell will continue to rise until peak day whether or not you've loaded that cell before.",
            "No problem, have fun playing!",
            "Like I said *considered*, they did not accept.",
            "It is hard to even drive, and you are asking to drive to push the car away...\nAnyway, the push car mod did exist, tho it is the character that pushes the car.",
            "Thank you.  You have been most helpful.",
            "It's still means something, it's already alarming that devs don't feel good. Also where did you get this info about \"selling\"?",
            "He's not asking, he's giving u options bc u asked lol",
            "Read Lemmy's statement to the community, it's the link I have above.",
            "From what I've gathered as a one year vet, he said the same thing multiple times as early as 13 years ago. They just stressed and jumped the gun, I'm sure things will work out fine. Just keep playing, modding, taking breaks, and waiting. It'll be here eventually."
        ]
    },
    "THURSDOID DROPPED": {
        "title": "THURSDOID DROPPED",
        "score": 771,
        "url": "https://projectzomboid.com/blog/news/2024/05/glowing-onez/",
        "content": "",
        "num_comments": 415,
        "comments": [
            "Well muldraugh police station is about to become a sick base location",
            ">As another part of us bedding down in the lore, meanwhile, we are also making sure that characters in broadcasts, flyers and newspapers who have an evident place of work (or place of demise) have their zombified forms spawn at the relevant location on the map.\n\n>This is something of a side project for a few of our coders, but will hopefully pay dividends for when players are exploring new locations and getting to know the locals.\n\nFuck yeah!",
            "Friendship ended with Rosewood Firestation, now B42 Muldraugh Police Station is my best friend",
            "This is exciting. I was getting rather worried about how almost every “update” regarding build 42 also involved showcasing some sort of new deep mechanic being added. Not that I don’t appreciate everything TIS does or that I think I know better, I just love the game and am rather excited! \n\nI’m sure it’s challenging to gauge what goes into an update and what doesn’t - especially when working on something you’re so passionate about. \n\nYou see similar in other games. Stardew Valley dev decided to add more features to the 1.6 update in a bug fix patch a few weeks after 1.6 dropped. And he’s still going to have to port all that over to console! Just creating more work for himself out of the love of making the game better haha. \n\nI’m sure whatever ends up being added will satiate most of us for a while. Especially once mods will be able to settle back in and utilize new features / improvements.",
            "Good god they put a cap on feature creep, they actually did it! Can’t wait for the unstable release good on the devs",
            "Thank goodness they reeled in scope creep! There’s so much to look forward to already in this build that I’d gotten nervous a few thursoids back when they stated they planned to duplicate the entire crafting tree. I’m happy keeping my trucks running through scavenging for now, thanks!",
            "12/31/24 is still this year, lol",
            "I had no idea about the map glow up! That alone is giving me hype.",
            "So it's a least 2 months away at minimum for unstable, even with them holding back some of the work. I was hoping this Thursdoid would be the one they announced it. Oh well. I'm sure it will be worth the wait.",
            "Love the touch ups on buildings but I can't unsee how small those parking lots are and it triggers me.",
            "Somehow with every blog post npcs seem further and further away xd",
            "Changes look awesome! The keyrings are so cute. I'll be happy no matter what they release. Building a game is hard!",
            "I dont think many people here were around for the first 41 IWBUMS...",
            "Map upgrades look really cool. Lighting though not integral, seems very nice to boost the atmosphere. And a bit of new collection items to loot is fun, but god this really sucks. Though you should probably only listen to official channels, I believe a lot of people were going off of the dev that said unstable in first half of 2024, and now finding out that we won't even get that despite them reeling in some of the crafting certainly is disappointing. I for one was thinking we might be getting an unstable date now, and being told its not even imminent sucks. \n\nOn one hand we shouldn't hate on this, as this at the very least points towards there being no crunch culture at TIS, and as supporters we should be happy. But it is hard to then know where the line is between a healthy development cycle and a slow one, as most would probably believe this to be the latter. \n\nYou can criticize TIS for the speed of updates, sure. But at the end of the day there is no reason to hate, if you're in this sub I assume it's because you love this game and want to see the team succed. But yeah this one sucks and there's nothing to do about it other than hoping the team will deliver when the time comes.",
            "I wonder if their speed of development is bottlenecked by funding or if it's something else. The time between updates has left me (and many others, I'm sure) quite jaded.\n\nI love this game, I've been playing on and off for over a decade now, but come on man. I'm growing old here",
            "Every Thursdoid that comes out I'm like, ok what have you added to B42 now? I thought this patch was animals, crafting, and backend work to add NPCs later.\n\nNot redesigned cities, new key chains, new lighting systems, multiplayer wars, newspapers, collectables, basements, more floors, item look variations, visual refresh, ambient noise, gun upgrades, procedurally generated wilderness, code refactoring as a result of all of the above... scope creep has massively impacted this patch and I think TIS really need to bring an expert in to get a handle on this. A proper project manager. Because this is ridiculous.\n\nDid some of this need to be done as part of the crafting update, like gun upgrades and the wilderness, yeah probably. But did redesigned cities? I've seen a lot of EA projects and I would expect updated visuals and a major map revamp as the single last update before launch not included in a mechanics update.\n\nPlease put unstable out instead of giving us sexy keychains.",
            "I am at work and can't read it, can someone tell if theres release date of B42?",
            "Oh boy, the amount of expectation management in this post",
            "It looks like it's going to be awesome when it comes out, but it's a pitty some content isn't going to make it, I hope they still can add the machinery system (the one they used to craft orange juice when they showed it) into the game.",
            "Stupid Sexy Keyring",
            "Babe wake up it's another monthly reminder about how Build 42 isn't out yet.",
            "Not the biggest fan of the Muldraugh glow up, I like the new models, but they don't really fit the rural sh*thole vibe that the originals have. They would, however look fantastic in West Point.",
            "really disappointing one tbh, i feel like we're hearing about the same things since last summer. and now we're hearing about these things being cut back for unstable ? \n\nmap rework looks sick tho",
            "8 paragraph long explanation just to say \"we are cutting the crafting content that we advartised for the last year\". \n\nGreat job guys! Not only you are working at a tortoise pace, you are also cutting the content that slightly justifies your development speed. Only thing decent in this post is the lighting. \n\nBut, I can understand you. I would also get lazy if my community will be sold to the addition of a couple of buildings and keychains in a 1 month development time.",
            "Muldraugh buildings looking quite nice ngl, hope the rest of the towns will also get a second pass eventually. They're big enough from a... horizontal perspective ? But could really use a vertical glow-up like this as well that doesn't change their identity or the \"balance\" too much, even if it's maybe not that realistic considering the time and place (no idea). \n\nCrafting being taken out of Unstable is kind of a big bummer considering that's 90% of what I'm interested in, but eh.",
            "Lol, so they're doing basically what they ended up doing when MP was about to drop, it was Christmas time and they're like hey guys, ya know what? It's not perfected yet but here's MP earlier than what we were planning on.",
            "i can smell b42 i know it has to be someday soon now, maybe next minute? maybe next hour? maybe next day? maybe next week? maybe next month? maybe next year? maybe next decade? maybe next century?",
            "I’m glad TIS has listened to the people. I trust it was quite alarming when even on this very own subreddit, people were clamoring for the release of the unstable. With reasons of feature creep being the hold up.",
            "Y'know, putting aside the embarrassingly long development time here, it'd be nice if, on the rare occasions where I see devs interacting with people, they weren't being smarmy jerks at even the lightest criticism. Like, they have to be aware that these abnormally long development times and that's why people are annoyed, right?",
            "Not sure how to feel about the map changes. The redesigns looks really cool, but way too high-class for Muldraugh, especially Muldraugh in 1993. It looks less backwater and podunk, and more like the outskirts of Louisville.\n\nI think they can use that police station in another town, but I think the one for Muldraugh should maybe have a single floor and a chainlink fence. That new fence looks like something you'd expect the military to put up. Unless there's the implication that some of the exterior was only added in the few days before the game begins.\n\nI like the touch-ups that the old locations are getting, but I hope their rural aesthetic isn't sacrificed in the process. That's what I really liked about them, that they weren't just fancy cities or high-class towns. They were just towns.\n\nI'm sure map mods can change that if these are \"permanent\" upgrades, but hopefully the rural feel of the towns aren't completely taken away in B42.\n\nOther than that, these Thursdoids don't really feel up-to-par. Feels like we're waiting a month just to get more of, \"Hey, B42 still isn't out yet, no idea when lol, look at the fancy lighting and the CHICKENS!\" They're still cool, but it just feels samey.\n\nI just hope the world doesn't end first at this point, because that would be disappointing. :)",
            "Are animals off the table now for this update?\n\nHope not, as lighting updates and new crafting trees, while nice, aren't what most of us are looking for after the last update.",
            "I'll just assume this year means next year like I should've in the first place.",
            "Its hilarious how damn bad these devs are at doing literally anything.  Years and years and years between any updates good god at some point just make the video game.  I bought this game 12 YEARS AGO with promises for a game that will never be made.  \n\nAt this point I tune in about once a year to see whats up and every check in is simply pathetic.  Were on what year 3? 4? of this patch and all they can say is \"it will be unstable and buggy and missing features and worse than you think...and also its not coming any time soon\".  Their big update of this news update is to cover their ass for the fact that IT SUCKS LMAO. So is anyone actually making this game?\n\nSpending 10 years to do what? Add cars to a video game? Give the player animations? What the hell have they actually done in the span of a decade",
            "Very mixed feelings about this one.\n\nI would prefer a delay rather than see content be cut, but I understand a lot of people are frustrated with the development timeline. Also, it's pretty clear to me that TIS struggles with knowing when to stop adding extraneous features to an update, so maybe it's for the best.\n\nNow, as for Muldraugh. Funnily enough, I was just commenting today on another thread about how Muldraugh in-game is a perfect reflection of the quintessential run down rural American town. The old police station, school, and church were very fitting for a small, poor town like Muldraugh. For instance, the old church they showed being replaced in this blog is basically a 1-1 replica of one of the actual churches in IRL Muldraugh if you look at satellite imagery. Now they're seemingly being replaced with gargantuan structures that verge on being unrealistic for the size of town we're talking about here - a town with a population of 1000 in 2024, a 20% poverty rate, and a median household income half that of the national average. Hell, the town doesn't even have sidewalks for the most part.\n\nPart of what attracted me to PZ in the first place was that it wasn't flashy like other zombie games. The experience felt realistic, and part of that was the environments - it really felt like you were wandering in the aftermath of a zombie apocalypse in rural America. I get that they want to use the new tiles they have and get Muldraugh up to speed with the detail of the newer towns, but it feels like they're sacrificing the feel of the city in the process. \n\nThe other content, especially the lighting, looks good. But I really hope they reconsider those changes to Muldraugh.",
            "Personally, I have not cared at all about the crafting changes, and a lot of this is plenty fine for me. I've really liked the \"finding random crap and making it work\" aspect of Zomboid, and I was never a fan of craftables. I think they generally make the game a lot more boring and discourage adventuring out for things you need.",
            "Man, I'm chomping at the bit just for all the visual updates.",
            "so where is this weeks? or am I still not clear on how this works?",
            "I'm really trying but this is bullshit. Same thing as rimworld fix the broken shit before you put more crap in it.",
            "Obviously a bit disappointed that features are being cut however it seems like we will still have blacksmithing to play with which is what most are looking forward to. \n\nDoes anyone know if animals are dropping with this update?",
            "I noticed in the school building upgrade screenshot that it has ladders on the roof. I know there's already some decorative ladders in the game, but considering the tile depth and new building heights being added this update I wonder if they'll finally let us use ladders.",
            "What angers me, is that the goal post on the muldraugh soccer field (bottom right) is off center. Game is literally unplayable.",
            "Not sure how I feel about the Muldraugh glow up tbh. The images show such huge changes, I'm not sure it fits Muldraugh's vibe. I mean, these big buildings would feel more at home in Louisville. But maybe I have my nostalgia glasses on. I'm still excited to explore them.\n\nGood to see the unstable beta is just around the corner, even without the full crafting in place. Looking forward to it !",
            "Developers out here pretending like they didn't smugly shoot down the naysayers earlier this year by saying it'd obviously be released H1 2024. Now they're just for the first time acknowledging there is zero high level management happening, they should probably rein in the autistic freelance feature creep, and the current state of their build is far from playable. 🤣",
            "I really really do like this alot as the game felt like it was slowly growing more and more stale, the playerbase dwindling and features so utterly nebulous on the horizon. hope the wrap up wont take too long and im more than excited to finally partake in the cavalcade of new features!",
            "bruh the wording in the first few sentences made me think they were dropping the update\n\n“My disappointment is immeasurable, and my day is ruined.”",
            "You've been at this shit for three years and you cannot deliver *one* complete update?\n\nModders doing this in their freetime are getting more work done than you.",
            "I'd be fired from my job so fast for this kind of performance",
            "bruh its prob coming somewhere around september - december because they mentioned that the build is still buggy and needs more work",
            "> As such the Unstable build is not imminent, but with this readjustment of our plans the pile of stuff that needs to be done before release has gotten a lot shorter. How quickly we’ll get the build shipshape remains to be seen, it will take some time to settle, but we’ll likely have a much better picture by the next time the blog rolls around.\n\nSo we know we're not getting B42 next month even with the removal of certain features in the crafting system. \n\nIndie stone has stated in the past we will never have a long development cycle like B41 ever again. We are fast approaching the 3 year mark(How long B41 took).\n\nThis team is a joke and all we were shown were duck key rings this month and ppl are hyped.",
            "I'm so excited!\n\nI agree with the IWBUMS release sooner. I'd rather play now with 80% of new features than wait months for 90% of them, and it sounds like the Devs also have this same mindset. Can't wait to play Beta!",
            "\"The president called WHO's announcement unwelcome and economically unsound\" \n\n\nIt is just a flu, bro /s",
            "My favorite base spot was the warehouses behind the muld police station. Can’t wait to go back and move into the station instead lol",
            "Honestly, I’m pretty much at peace with the wait now. It’s been so long, what’s another 6 months? My gf asked me a few months ago when the update was gonna drop and I said to just forget about it and get on with life. Sure, we’ll probably get GTA6 before build 42, but I’m glad they’re working on the game and it gives me something to look forward to.",
            "muld police station looks fucking amazing. so excited for b42",
            "Reading these comments are depressing",
            "I know it’s literally been forever, but I really wish more people understood how actually long and unexpectedly tedious updating a game can be. I agree that it’s been such a long time but even adding something simple causes a rabbit hole of code to mess around with not to mention adding multiple huge changes like in build 42. With the amount of love these devs obviously have for this game, I honestly don’t blame them for wanting to do this the right way, even if it comes at the price of time.",
            "The church, school , and police station actually have some life to them now. I never realized how dull they were until looking at the comparison 😅",
            "I can already see myself talking to my grandchildren: \"Back in the days we used Spears Billy! Spears and Crowbars Billy! None of them B42 crafted weapons Billy!\"",
            "Am I the only one who's ok with waiting? Like it's not like there's nothing else to do other than play this videogame. When it drops I'll play it, until then I'll be doing something else.",
            "I totally understand that people, and TIS, are both annoyed at how much feature creep has made its way into the plans for Build 42; this is a very reasonable cause for delays.\n\n>People would much rather see the build out and get to play with all it has to offer, rather than be upset about the things never made it into the first Unstable release as originally planned.\n\nI am unsure if I am in the minority or not, but I don't mind that this is taking so long. I have a lot of other games to play, and I do keep popping into Zomboid and playing a run every now and then. I'm patient. I think I may be in the latter category if they release the Unstable version without all of the features they're working on. I don't understand the need to rush and postpone features for the sake of getting an Unstable branch ready. If it's all in scope for Build 42, take all the time you need. This build is shaping up to be an absolute banger, but getting it into our hands before it's finished or ready for testing may sour the experience.\n\nOn the other hand, getting feedback early for what you already have done so you can work on it while finishing the build is a good idea. I'm unsure if this is the goal for releasing it early though. I sense, based on the language, that it's a matter of wanting to rush instead of a matter of quality. These builds have always taken years, but everyone continues to love the game and the work you put in. Getting feedback early might actually delay the features you're still finishing, unless you have idle hands that you want to use. If this was the mentality, I would be totally on board to start testing the Unstable build while the rest is finished, but instead it sounds like rushing for the sake of rushing.\n\n>stubbornly holding things back until we get there it only going to delay people getting a hold on all the other cool stuff in the Build that they’ve been waiting for.\n\nIn my opinion - so what? What is the value in reducing the delay of the cool stuff you've been working on? Does anybody actually care about receiving the build in a timely manner?\n\nI am very curious to know if people are on this page or have different opinions about this.",
            "Yeah, but are baseboard and corner shadows going to delete along with the wall when you destroy them? Priorities!",
            "I just check like 1.5 hours ago haha I must have just missed it !",
            "gunna have to redraw the maps",
            "Let's gooooo all i can say is : This is about to be crazy",
            "This is gonna be frickin’ sweet",
            "I'm not sure if making the muldraugh police look modern is the right decision here. muldraugh was always interesting because it looks as impoverished in game as it does in RL.",
            "is no one talking about the new street around the muldragh police dept?",
            "Question, if unstable drops, will mp come with it?",
            "Personally love the map changes! It's going to really spice up exploration for me. I do have to say I'd prefer mini updates of what's finished rather than having to wait so long for everything all at once. I'm pretty patient, but having only purchased PZ all those years ago for NPCs and still seemingly having them still be years off is disheartening.",
            "Consensual raiding requiring people to give warning and written consent with both faction names and player names revealed is such a stupid idea, these devs have clearly never played a pvp server nor have any understanding of it.",
            "The church!! The school!!\n\nI need a blue fox key ring immediately.",
            "Rosewood mini church glowup",
            "I'm very excited to see it releases. But I also wish that they could do something about map chunk doesn't load, it seems very important thing to get resolved. ><",
            "Guys, no need to divide the patch into several parts, just do what you do for as long as it takes. We still love you and will wait for the new patch as long as necessary. Don't worry about it. You are the best and your game is simply wonderful. I think that many of your fans will support me",
            "is it rrally a good idea to cut down on features to release faster? shouldn't they delay a few more months instead?",
            "[deleted]",
            "Really exciting",
            "I guess its time move from my base in west westpoint to the Mauldrough station.\nAfter 7-9 months after the update to Player with me mods (which I totally need for every run because there are so important)",
            "I mean, it looks pretty slick, but don't forget that the zeds can take down high fences now.",
            "Might have to revisit it in a run. Muldraugh might have more treats in store.",
            "Looks more like a military installation than a police station.",
            "Always has been 🔫",
            "Why?",
            "This is the best feature for any open world game. Have small lore scattered around the map in big quantities. Much like how random encounters happen in RDR 2.",
            "This makes me really want to go on a bunch of mini-quests to find people. mainly the general, the pastor who dies in that radio broadcast, and a couple of the reporters from the exclusion zone.\n\nalthough the General is immune, so I'm not sure if he would be dead.",
            "Can't wait to blast Zombie McGrew!",
            "Finally be able to give the pastor a proper burial.",
            "Yeah this is so exciting. I love all the little story telling elements",
            "> This is something of a side project for a few of our coders, but will hopefully pay dividends for when players are exploring new locations and getting to know the locals.\n\nCORRECT.",
            "I'll be in the underground tunnels looking for a Metro2033 D6 equivalent",
            "You never know, Rosewood Fire Station might get a glow up too!",
            "I lied. I need the sexy key ring now.",
            "Hard to believe that the 400 fps teaser was over two years ago now hah",
            "For now. Definitely glad they restrained themselves for this, but I'm hoping they don't end up doing the same thing for B43. Hopefully they maintain this going forward post B42.",
            "I'm glad they have as well, we'll be able to finally get our hands on features that were teased over two years ago now, like the massive performance improvements; I just hope that they're as effective as they were made to seem.\n\nWith luck, it'll be out before October, that way I can set up something creepy with all the new skeletons",
            "As long as the crafting framework is in place, mods can fill in pretty quickly.",
            "I'm excited about a new build with lots more to do, but I'm currently a couple months into my best run, so I'm not too sad about having to wait!",
            "Yeah way too much feature/scope creep.\n\nI can't say how they _should_ have done it because I don't know who has skills to work on what, but I know at least how I would _ideally plan_ for it: for stuff like farming system and crafting rework to be the only changes, and then have a separate major patch to do more technology-oriented stuff like graphics renderer and line of sight change, basements, etc. (or reversed order, since I personally care a bit more about the graphics change and line of sight change and basements) Of course doing it that way in such a strict sense might mean some people wouldn't have anything to do at some times, so it's obviously more complicated and difficult to organize.",
            "Did I miss them saying that?  \nWhich thursdoid, if you know?",
            "Hopeful people will read this in the American format.\n\nBut real patient gamers know this is European time formatting and the update will drop on the 31st month of the year.",
            "Until it’s pushed back to 2025 for “additional tweaking bug fixes”",
            "I am betting end of year or early 2025.",
            "I reckon unstable by the end of the year with release end 2025. I think they've really struggled with scope for this patch!",
            "must not be any minimum parking requirements in Knox Country. based, if you ask me",
            "Oh jeez. You could’ve just kept that to yourself, my man. That’s definitely one of those things you wish you could unsee. Lmao.",
            "Yeah these are UK parking not US parking.",
            "NPCs will be the very last thing they actually implement into b43, even if it makes it into b43 which is hopeful thinking I think with the feature creep.",
            "I’ve been waiting like 10 years for NPCs at this point. I don’t think they’re ever coming.",
            "I see it in another light. Ten years ago, NPC's would be just a disappointment. Today, if an open-source language model is embedded with the game, a medium-sized one, we may have the NPC's that the game truly deserves. Just google about “LLM's NPCs city experiment”. The code to do it is literally on GitHub, for all to see. Just replace ChatGPT with a local mode. I'm sure the devs may be experimenting with this.",
            "I've owned the game through fully legal means since build 23. I feel that I've gotten my money's worth out of it.\n\n(But yea... the wait for 41 IWBUMS was a looong one)",
            "I've been here long before cars were a thing. Most people don't know how LONG the wait is. But it's always worth it. Let the devs cook.",
            "New gens don’t know how long the wait was",
            "I was a young high schooler watching MayaTutors play this game back in like 2011 or something.\n\nI can wait.",
            "I remember buying the game near 2010-2011 and playing it in my astronomy class in duel enrollment. back when everything was 2D and the zombies were gray aliens. ah good times. oh and the one guy with a shotgun who would kill you after you killed Kate with a pillow.",
            "This is a much longer wait than the delay between the last update of B40 and the release of B41 though. B41 had a lot of of wait time _within_ it until its final update, but they were still regular, frequent, meaningful updates being pushed to the players, and some of them were very significant.\n\nB40 to B41 was an extremely long wait, and yet this B41 to B42 one is even worse.",
            "I will say it wasn't just any random Dev. It was Lemmy101, one of the creators of The Indie Stone/Project Zomboid. Thats about as official as it gets. So his words hold a lot of weight when it comes to saying things like that, which is why I imagine many people actually believed we were getting it first half 2024.",
            "I just feel like they should just stop adding so much stuff over this update and release it bit by bit in unstable beta already.\n\nReleasing B41, advertising the game, it getting a lot of attention from new players and then edging us with an update that is never coming was such a weird thing to do. Not saying that the game is dead, it has more than 24k people online right now. But the lack of content really made it stale for longtime players. I spent 900h+ on the game and idk, i just can't really play it anymore, even with mods.",
            ">But yeah this one sucks and there's nothing to do about it other than hoping the team will deliver when the time comes.\n\nSucks indeed, but at least that's where it's a very good thing they're independent. They made a mistake with the announced release date, but at least they can just go \"sorry, our bad, we'll deliver later\" and once it comes out everyone will forget about the delay.\n\nIf it was some triple A company, we'd get the release on time, and it would be a bug-filled mess that everyone would hate and it would heavily damage the game. It's always better to disappoint a bit now than to disappoint massively later.",
            "I don't think it's funding. The game is selling very well right now and they've hired on lots of staff.\n\nI think it's just ambition and the difficulties of working with the engine they have. They're effectively trying to create a 3D world and game in a 2D environment.",
            "I think it’s the combo of not overworking the staff while also trying to add a lot of new systems into one big update. Like there’s a map expansion, new crafting trees, animals, B42 is packed with content which takes a long ass time to make. \n\nA dev cycle like this is super risky: it can make updates take way too long killing interest in the game (only mods have prevented that), it can cause so, so many bugs that have hard to identify causes. It’s bad for content creators who have nothing to make videos on (again, something mods have only prevented), and because the updates are so big pretty much every mod is guaranteed to be broken on release of a new version\n\nI’d rather have smaller updates faster but hey it’s not my game.",
            "I’ve put hundreds of hours into this game. I’ve played it since 2013. However I just can’t get excited about something that feels so fucking slow in development. I’m not trying to be a jerk or anything I still love the game but I really kind of gave up on the idea of it ever being finished.",
            "They don't want to crunch their staff. Simple as that. Combine that with the size of their team, the updates aren't going to be nearly as fast as bigger studios that not only have hundreds of employees but they also work ridiculous hours.",
            "yes they should release some little updates, at least patches to fix some bugs and inconsistency, like wearing wet clothes during winter doesn't freeze you, not being able to use maggots as bait for birds, map issues... some small things they could fix at least once a month.",
            "The bottleneck seems to be management and feature creep.",
            "Their speed of development is bottlenecked by the crafting stuff. They have repeated so for the last few blogposts",
            "That's a great point! They are a software company with terrible project management skills. They don't know where to put their resources into and where to focus. That's why they try to do everything at once and end up completing nothing.\n\nIt is like they are trying to write a 10 book series but instead of writing 20 pages for the 1st book each day, they are writing 2 pages for all 10 books everyday. That's why they never get anything done. They really need a professional's help.",
            "They can't put everyone on the crafting stuff to finish it, it would be counter productive. While the crafting stuff is being worked on, the other devs have to do something, they can't sit around and do nothing, so yes they do add more unrelated stuff, but it's not actually delaying anything. You can't just throw twenty people on the same feature... And besides, some devs have their specialties. For example they have 3 people dedicated to map design, so of course the map is gonna get updated every build, and these guys can't work on the crafting stuff anyway.",
            "Good one",
            "It says they might have more information next time, but it isn't imminent.",
            "No but they've decided to roll back the scope creep of the new crafting trees in favour of getting it out faster. It'll still be big, but not quite as massive as they want it to be. Not yet. They still have full plans to get it to where they want it in post-release updates between them and 43 ",
            "Probably sometime around when Fallout 5 is released",
            "I don’t know, Muldraugh never seemed like a backwater town to me, just a small rural town. Maybe that would fit better in Dixie or something.",
            "They could be giving it a large extension and completely revamping the identity of the town",
            "I swear I remember weekly Thursdoids having more content than these new monthly ones. A month for a few keyrings, lighting improvements (which was already shown before) a new newspaper and a few building redesigns kinda makes me say \"is that it?\" i can't lie.",
            "yeah I would feel more excited by something like \"hey we have fixed all those map issues, and those bugs too! keep reporting them we are making progress\" instead I don't even report them anymore because there is zero feedback, I don't even know if they look at those issues.",
            "fr lmfao insane how braindead these pz cucks are lol.. prob just gonna say some dumb shit like “let them cook” 👆🤓 “I waited a millennium for b41, I can wait more!” Not surprised they said the update isn’t imminent a month before the supposed drop for unstable, it is TIS after all",
            "Bruh... I'm a 8 years player. I'm qutting right now. Those devs sucks",
            "It's not being cut. It's just releasing at a different time. That's something that should have always been planned to do in the first place. They should get updates out to players \"as soon as reasonably possible\" rather than chunking everything together in a single update. Certainly some stuff makes sense to delay releasing until another thing is ready, but that should only be the case when they are intertwined systems, which I suspect isn't too common in this case (or at least not much intertwining present).\n\nAnd while I'm assuming that you understood that it's not being cut, you still shouldn't use the term \"cut\".",
            "> Crafting being taken out of Unstable is kind of a big bummer considering that's 90% of what I'm interested in, but eh.\n\nIt sounds like it'll only be a portion of the crafting trees. Really hoping they make it into Unstable later on rather than being pushed to B43.",
            "> As such the Unstable build is not imminent, but with this readjustment of our plans the pile of stuff that needs to be done before release has gotten a lot shorter. How quickly we’ll get the build shipshape remains to be seen, it will take some time to settle, but we’ll likely have a much better picture by the next time the blog rolls around.\n\nListen to what exactly? The unstable build is not imminent. They even straight up tells us its not coming out next month either and thats with pushed back content that was originally promised.\n\nWe aint getting this til the very end of the year(Dec just like Build 41) or next year.",
            "I get more and more concerned with the state of the world every day. There's a real possibility WW3 breaks out or we all die in a nuclear holocaust soon.",
            "Exactly, at this point they are selling the dream rather than the actual product. Vanilla game is a half baked good and mods are actually making this game interesting and playable. Looks like a great scam to run tbh.",
            "We got a delay *and* a content cut lol.",
            "i think you are getting fooled by the detail brought to the rooftops which definitely give more sense of the size of buildings in general. some footprints have been increased but not that much and in general for the better i would say. i should also add that we are not doing a 1:1 reproduction of Muldraugh and we have creative license. thanks for feedback",
            "Yeah I'm with you completely. I don't think it's rose tinted glasses either. I can appreciate that they aren't flat roofs any more, but I think they could do it in a way that, as you said, doesn't sacrifice the small town feel.\n\n\nI think the police station is way too big and I'm not a fan of how it fits, even if it looks nice. The Church is good, but I'm not sold on the garden. I do actually like the new school however and I think that is an improvement. \n\n\nI understand they don't *have* to make it a 1:1 scale town, and that's fine just don't lose the small town feeling.\n\n\nMight not even be that big of a deal though we'll have to see, and I 100% need to collect all the keychains.",
            "The structures they revamped to feel more fit for a Louisville suburb than a small town, for sure. The vanilla assets do need a new coat of paint, but they went for an entirely different color.",
            "Yeah supply runs into town will always be more fun than crafting for me. I don’t think I’ve ever done much crafting in this game other than spears.",
            "That's fine that you feel that way, but a major part of b42 was supposed to be making a better endgame with the crafting etc.",
            "This is one thing I have been concerned about with B42. Just sitting in one spot removes a lot of the core challenge of the game. I did hear explanations and/or counter-arguments as to how it won't be much of an issue though. There will still be cool stuff that can only be found by venturing out.",
            "It used to be every two weeks but now its once a month.\n\nNext one should be on the 27th.\n\nI wouldn't hold my breath for a release date or anything. Can almost guarantee the next one will be more of the same.",
            "At least Rimworld releases a big content update every year or two.\n\nThere has been at least two big updates with additional DLC content since 41 released.\n\nMeanwhile over here its like 'don't worry guys, future updates will roll out quicker and won't take as long as 41.'\n\nNearly 3 years later and still nothing.",
            "I am on the same page with you my friend but don't do Rimworld injustice. It is 10 times better and more polished game than PZ.",
            "Yeah, we're getting both wild animals and things like cows that can be farmed. \n\nI seriously doubt they would cut that from the release because it's integral to the crafting and it looked pretty complete when we last saw it.",
            "I thought I saw something that it was being pushed back as well. I don't have a source, just a vague memory from reading something on this sub.",
            "Just gotta wait 2 years for ladder climbing to go into beta and then maybe 1 year and a half until its finally polished for stable.",
            "The way I see it is if Muldraugh is getting an upgrade, Louisville will get a substantial one as well at some point.",
            "Having actually driven through Muldraugh, I kind of agree. The new buildings look really cool... but they do not look like the kind of infrastructure you'd find in a tiny, rural town full of poverty. \n\nMuldraugh doesn't even have its own dedicated police department in real life, and while the town isn't a 1:1 replica of the real place, the B42 building has way less \"small town police force\" vibes.",
            "I agree with you. The amount of grace and dickriding TIS gets is absolutely insane. They are very lucky to have a cult following of very forgiving fans. Modders have already done most of the things B42 even offers, albeit wonky. You can play on custom maps, you can make plumbing systems, full on factories, you can mine, hell, there’s even NPCs. And modders did all of this for *free*. At the will of the potentially toxic modder community *demanding* x and y out of said modders. \n\nOh, but TIS takes well over a year to even offer a release date of the new build? Well I’m happy they’re anti-crunching!!!!!\n\nIt’s a joke, and an insult to people who have paid money to invest in an EA project.",
            ">We are fast approaching the 3 year mark(How long B41 took).\n\nNo we are not and this subreddit keeps spreading this lie. B41 was still getting development work up until the 41.78.16 release which was December 2022. They didn't move everyone on to B42 until 2023. It's been a year and a half so far of full scale development for B42.",
            "The key rings are fucking awesome. Womp womp.",
            "We already have a fully fleshed out game where people sink in thousands of hours. We will be getting a completely new game when B42 is released. B41 is still drawing a large crowd to streamers and youtubers.\n\nWe have a bugfree game right now with a crapton of awesome mods and you still cannot be satisfied. What is your fucking problem? Maybe you should just abandon this game and leave.",
            "> As such the Unstable build is not imminent, but with this readjustment of our plans the pile of stuff that needs to be done before release has gotten a lot shorter. How quickly we’ll get the build shipshape remains to be seen, it will take some time to settle, but we’ll likely have a much better picture by the next time the blog rolls around.\n\nYou ppl dont read do ya?\nIts not coming out sooner. See ya in December or next year!",
            "That really isn't our problem. They are the producers and we are the consumers. They produce, we pay money and we consume. Simple. Their slow production is a problem they have to solve and I don't have to emphatize with it or know anything about coding because they don't emphatize with us about what we have to go through to earn money. Stop being romantic and think for a second. Devs are not your family or friends.",
            "Most likely not.\n\nIt didn't the last time, while they work out kinks.",
            "You'll need to be far more specific than that.",
            "I really hope this is satire",
            "While agreed-- the year long wait doesn't help and some portions of the community have been absolutely rabid for it. Many Mods are also on hold until its release in order to determine what's broken/what they need to do to get it all working with b42.",
            "this is only for the unstable release",
            "It's specifically for the Unstable release. They're going to release the Unstable build and continue working on the stable release of B42, with patches for B42 adding bits and pieces that they won't have completely ready in time.\n\n> shouldn't they delay a few more months instead?\n\nThey could but people will just start bitching even more about how it's 'taking too long' for B42 to release.",
            "Idk how game dev works but honestly Id rather they do monthly or regular updates over dropping builds. There are features that seem fully fleshed out that they tease at from years ago, why cant they just put it in the game and update it?",
            "I'm sure they've considered both possibilities and I understand why they've chosen this.\n\nThey promised no build would take as long as B41 took to get out, and they'd harm their credibility if they took more time, not to mention the unpleasantness that would ensue from the entitled folk.",
            "what features are these?",
            "Noone got the sarcasm 🙃",
            "> but now B42 is getting somewhat kneecapped to get a build out for Unstable.\n\nNo it isn't? Unstable will release with less stuff, sure, but B42 will have all its content. Think of it like a minecraft snapshot. It's also a good idea for them to polish what they have before continuing to add stuff.",
            "> I just hate how little patience people seem to have now.\n\nBuild 41 released 2.5 years ago...",
            "They can WHAT??",
            "This is why we need concrete walls.",
            "Isn't it's opt-in option in sandbox? Like, you need to choose it for them to do so.",
            "This is kind of a bad change.",
            "As is fairly correct with rural Southern police stations.",
            "It's why Skyrim is so fun to explore, I love finding Easter eggs in that game!",
            "Still could be dead, even if immune. I'd imagine he could've been rescued and brought to a government facility considering his rank, or he could've been left behind and killed during the chaos of the infection spreading.",
            "\"YOU TOLD US THAT THE KNOX INFECTION WAS CONTAINED!\"\n\n\\*BLAST\\*\n\n\"IS IT CONTAINED NOW?\"\n\n\\*BLAST\\*\n\n\"IS IT FUCKING CONTAINED NOW!?\"\n\n\\*BLAST\\*\n\n\"IS IT?\"\n\n\\*BLAST\\*\n\n\"IS IT!?\"\n\n\\*BLAST\\*",
            "Have they said that Subway tunnels or something similar are coming? /gen",
            "I looked at the thursdoid released after mp for build 41 was out and it was titled what’s next for 2022 lol it’s crazy it’s 2024",
            "I was thinking about how to plan my late summer vacation days to play B42 at the beginning of LAST YEAR! I  really was naive in hindsight, but the confirmation that it will come this year was such a relieve for me.",
            "This one, literally the OP",
            "Lousy Smarch weather!",
            "Iv been on reddit for about 5 years. Your profile is the first that features a living being.",
            "Twenyninember",
            "*Release* end 2025? My god, you're optimistic, it's gonna take 2 years from unstable just to get multiplayer working again",
            "ZOMBOID CYCLIST ACTION",
            "Why are people concerned about parking lots being smaller?",
            "if there are NPCs in the game before 2030, I will be shocked. Maybe by its 20th anniversary in early access in 2033.",
            "I bought it for like $20 mid 2021, just before multiplayer came out. I've put 1100 hours into it and I'll probably put at least 500 more hours in with each update. One of the best games for value ever.",
            "I bought the game a few months before B41 dropped.   I wasn’t into the game enough to understand its significance, so I was just, “Oh, cool, new update” and kept playing 😂\n\nEdit: I now have 1700+ hours in and frequently visit the TIS forum.  Given I bought it for $20, that’s about 1.2 cents per hour.  Not bad at all. 😎",
            "I personally wish they released the performance update with the rendering fixes and maybe the lighting update together in a B41.5 somewhere halfway to B42.\n\nI'm excited about the new crafting for sure, but I'd much rather be enjoying the game with better performance and true darkness while waiting.",
            "Important to keep in mind something like 10,000 sales is only like 1 developer-year.\n\n$5 M revenue is like $3 M after Steam and other takers. That is not enough for a staff of 10 even for 5 years.",
            "> I’d rather have smaller updates faster but hey it’s not my game.\n\nMeanwhile, I'm kinda happy for the longer cycle because shorter cycles (like in CK3, Stellaris, etc) very, very regularly break my modlists and very frequently those mods never get updated afterwards.\n\nThe long cycle means I can pack my Zomboid with 300+ mods and enjoy a good 200+/- hour playthrough over half a year and not stress about losing it halfway through.\n\nFor a game this open-ended and this easily modded, I don't mind it.",
            "I think at the end of the day TIS is just too ambitious for their own good. They've decided to implement a crafting system which will, in their own words, take you from primitive survival to medieval blacksmithing with no man-made tools.\n\nNow, don't get me wrong, that's incredibly cool, and I'm super excited to play with it. But how necessary is that in a zombie apocalypse game? I don't think many players will want to be doing a wilderness survival playstyle with no zombies or scavenging from cities, nor will many multiplayer servers be progressing so far that there are no man made supplies left. It's just not really in the spirit or scope of the game IMO.",
            "They have explained why they don't do small updates.\n\nImagine they split b42 in four updates for example. They would end up bugfixing and rewriting code for each update. Whereas with one big update, they can bugfix one time and rewrite the code all at once. So in the end, the four updates would take much longer to release than the one big update.\n\nNow does that actually mean it's the better approach? I'm not sure.",
            "That's the camp I'm in. Love everything that's been done and I'm still enjoying the hell out of [current build], but I feel lie a kid waiting for a Christmas that never comes",
            "I'm okay with it never being finished, I just feel that they are both too slow _and_ too incompetent (at least with the older code) in development.\n\nTons of great games stay great never being fully \"finished\", like a lot of live service games (WoW, FF14), or other regularly updated games (Stardew Valley, No Man's Sky)\n\nLike Taking Stardew Valley as an example, I think a single developer —literally one guy— did two whole major content updates on his own faster than TIS has done a single update for PZ.",
            "Don’t worry about future updates, just enjoy the game you have in front of you. More may be coming, but the current build is still an excellent game for many reasons. \n\nSame deal as with Factorio. It may be getting a huge update with tons of QOL fixes and improvements, but the current build is still by far the best factory sim out there. They’ll only be extending their lead",
            ">Size of their team\n\nHades indie team has similar size and they pumped out 2 games in 6 years. Cut the bullshit bro.",
            "Ding ding ding, there’s a lot of detours in the road",
            "It's not feature creep, the other devs have to work on something while the crafting team finishes crafting. Would you prefer nothing was being done while the crafting is being worked on? And no you can't throw 20 people on the same feature and expect it to go faster. That's not how it works.\n\nManagement, maybe. But to me it's pretty clear it's the crafting overhaul that's holding everything back",
            ">  They are a software company with terrible project management skills.\n\nThe entire gaming industry is in dire need of project managers.",
            "That's what a professional project manager is for. If you have a bunch of staff with certain skills sitting around doing nothing and contributing nothing to the current development sprint then they should not be employed by your company. As far as I can tell the big issue with this game's development is they hire a bunch of community mates they like working with who don't actually have the correct skills to loosen the bottleneck preventing releases. Thus we get an update every 4 years containing a load of half baked garbage like nutrition that doesn't work, doesn't get corrected and no one ever wanted.",
            "How cool would it have been if they saved up the map work and dropped it all at the same time instead of dribs and drabs?",
            "I expected nothing and I’m still disappointed 😔 (only with release date due to my own hype)",
            "Thanks mate",
            "gta6 before b42, what a time to be alive...?",
            "Even a small rural town might not have stuff quite that nice in the 90s, it really depends. The large parking lots felt a lot more true-to-life. As for individual buildings, I think the new church is great but the new PD seems almost too high-end for the town.",
            "Yeah I’m also a bit disappointed. I’ve been following the game since the Desura days, still waiting on those NPCs. I love this game, I really do and it’s such a special piece of art to me, but man it feels like it’s been several years of waiting for very little payoff. I’m just.. not all that hyped for the eventual animals/crafting overhaul, honestly. It’s not what I’d prioritize but hey, I’m no developer and I don’t claim to know better than them. I will say, the lighting does look fantastic.",
            ">I swear I remember weekly Thursdoids having more content than these new monthly ones.\n\nDamn, you're right...",
            "I remember when they changed it to monthly they said something like that they weren't slowing down development but there was simply less new stuff to visually show off now. We've seen most of the main features at this point, it's down to them to put it all together and finish it off",
            "I imagine their priority is playtesting, bug-fixing, and refactoring code atm.",
            "They did weekly Thursdoidz when they had a lot of new cool stuff to show off. They switched to monthly because there's not as much to show off. They're just tightening the screws now.",
            "Yeah this was one of the worst ones yet, along with the blow of waiting so long to find out we'll be getting less.\n\nWish the game was open source lol",
            "I started playing PZ with my GF back about 8 years ago now... We've played it a bit up until about a year ago when they last did any update. It's changed a lot, for sure.\n\nHowever, friends I want to play with (about 4 friends) who used to play on my server are now refusing because they'd rather just wait for the next update. The server MP runs like crap on a 24core machine and 24gb of ram allocated to it. It just hasn't got the polish or shine, or performance I was hoping for after 8 years of struggling to manage this.\n\nSo now, I have no friends who want to play it, my partner and I have burned it out a bit playing it alone, and we kind of have explored everything. We haven't played it constantly those 8 years, sometimes there's a year or two gap so it feels fresh again. I shouldn't be doing that with a game that lists itself as a early-access game.\n\nMy life has changed a lot in 8 years, PZ, not as much as I'd hoped.  \nI have hope still. I'm not angry at the devs at all, I program and develop things too, but I have to manage my own projects and things on my own. If I had a team like PZ did, I don't think it'd still be dragging at a snails pace with repeated updated every month.\n\nWe used to get more content updates and progress with the weekly updates sometimes, let alone the monthly ones.\n\nSorry, I had to go out and say my part. I've left a top mark review on Steam from years ago, but my floating view right now is... Meh.",
            "Oh yeah I'm pretty sure those'll be in B42, just not in the initial Unstable branch. If blacksmithing and some stuff is in as they say it'll still be something to have fun with in the meantime, I just really wanted to try out the masonry and bow making and whatnot ya know :D",
            "That's about how I read it. They put too much on the plate to handle and teased it would be this year. Now they are realizing they more in their mouth than they could chew and need to cut some content until later down the roadmap.\n\nSo December as a deadline is probably the best for em since it will be around steam winter sales and bring in another wave of fresh players.",
            "So much for the first half of the year.",
            "I give b42 only slightly higher odds of coming out this year then Putin starting a nuclear war.",
            "First time I've seen this comment section not be absolutely filled with glazing.",
            "I understand that you have to stretch a lot of it for the sake of gameplay, but like, the police station here really doesn't even feel like a police station, let alone one fitting a small town. I can't think of a single police station I've ever seen that has a double sided barbed wire fence with a concrete base, gatehouse, and a giant garage with skylights in it. The county jail and state police office down the street from me doesn't even have that kind of security (or architecture.)\n\nDon't get me wrong, I like that these buildings are getting attention again, but it seems like such a stark departure from what we've seen even in the new towns you guys are working on.\n\nIt's such an interestingly choice to set the game in rural Kentucky and it's that exact atmosphere of a rural town, as opposed to some generic city, that drew me to the game. Now, it feels like that atmosphere is being stripped away in favor of making Muldraugh into a generic city.",
            "The police station is uncharacteristically large for a town the size of Muldraugh, though - instead of being a small one-story office (enough for a handful of cops), it's now a two-story building with its own communications antenna, reinforced fences, a guard shack, and garages. \n\nWhether it's strictly bigger or not, it makes even the West Point police station **seem** small. The building *looks nicer* than the old one, because it's got a less boxy shape and more details, but it's hard to imagine a town like Muldraugh even having the resources or funding to construct something like it, and it's questionable why they would need it.\n\nIMO it's missing the vibe and feels out of place. It's a great design, but it would feel much more at home in a larger town or city.",
            "It's not really the correspondence to irl Muldraugh that bothers me, seeing as the old version of Muldraugh wasn't a 1-1 recreation either. It could be a completely fictional town and road layout and I wouldn't mind. What I liked was the immersive feel of exploring a real rural American town that's been overtaken by the zombie apocalypse, and to me it seems like the newer buildings have lost that feel.\n\nUsing the parking lot to the left as a measurement, it appears the new police station has around double the footprint of the old one, including now having a second story and a fence. The new school looks to be largely the same footprint, but it's now a two story building. Church is the same size as I can tell, but generally a lot fancier with stained glass windows.\n\nThis is just my opinion, of course. But I don't think adding more detail to existing towns necessarily mandates making the buildings larger, or appear more \"fancy.\" Arguably, introducing more depictions of wear and tear could be more visually interesting.",
            "well, why not both ? i love both !",
            "That's disappointing. Last week's update said they should know more this week about releasing B42 after they put a few things on hold.",
            "RimWorld devs aren't really innocent, it kinda sucks how small the free updates are because they'd rather do DLCs than improve the base game. Not saying the free updates are bad, but anomaly was a huge let down for a lot of players. I'd rather wait for a huge base game update than have a dlc that feels like a mod pack rather than a proper dlc that adds on to the game",
            "And West Point, too. That one really needs a glow up. And let's not even talk about March Ridge\n\nMuldraugh is the first town in the game so I'm just a bit sad I'm gonna lose that feeling of familiarity with these locations. But I'm sure it's worth it ; the images show they've added new houses around too, so technically the town's population increases",
            "It already will be. There will be larger than 4 story tall buildings downtown now.",
            "Yeah I think... would a town of 1000 people have a 2-story school? How many kids realistically would go there? It looks nearly the size of  my high school which taught 600 kids between the ages of 11 and 16! Also where do the teachers park or are they expected to walk to work lol",
            "Absolutely agree. It's incredible that out of all the communities I've been a part of, this is the only one who extolls \"anti-crunch\" to a comical extreme. Like I've legitimately never seen this anywhere else, which makes me wonder if it's the result of serious astroturfing.",
            "> 41.78.16 \n\nBuild 41 released in 2021.\n\nUpdates after that are irrelevant.\n\nYou stop telling lies. They stated this in Jan 2022.\n\nhttps://projectzomboid.com/blog/news/2022/01/2022-and-beyond/\n\nhttps://i.imgur.com/1vfDX0K.png",
            "You're literally the reason why TIS takes so long to do anything. Yall need to stop glazing this horrible studio. I'm ready to bet you bought the game like a year ago or during b41, so you don't understand.\n\nA modder could make those keychains in less than an half an hour",
            "Bug free when 90% of my deaths have happens because when I pressed to go left my guy went right into the horde of zombies. Bug free when multiplayer desyncs all of the time. Bug free when foraging doesn't work on half the map. Cope more dude.",
            "Bug free game? I literally had to help mod the game to make the zombies in MP not despawn.",
            "it's so funny to see those clueless newcomers who bought the game after b41 glaze the game and defend the studio",
            "Based on that, all we know is it is not releasing in June. I bet it releases in the fall, probably October.",
            "Did you not read? They litterally said they are polishing up the crafting portions to push it for unstable instead of finishing said crafting and then releasing to unstable, and will finish crafting as the beta is ongoing. They want people to play unstable with what they have ready to test.",
            "*Devs are not your family or friends.*\n\n  \nChrist, so much this. The glazing is cringe. It's cool to appreciate their work and let them know, but to act like nothing is wrong, or nothing can go wrong is frustrating.",
            ">Idk how game dev works but honestly Id rather they do monthly or regular updates over dropping builds\n\nThat would be completely unsustainable for a team of their size. They refuse to crunch their staff (thank god. Crunch in the games industry is still a rampant issue) and doing updates that regularly for a game like this would *absolutely* cause crunch because of the work they put in to each update. Some of the stuff they've been working on for this update like the crafting overhaul has taken them *months* to do. They could not get this kind of thing out in a month. It would likely wreck the entire game.",
            "Your preference is 100% fair. I’m not a fan of these large “build x” updates either. I’d much rather a continuous (3 month or 6 month timeline) update schedule rather than these massive updates that takes years. \n\nIt’s just counterintuitive, they get by because their game fits its niche perfectly but in most scenarios this wouldn’t fly. It 100% kills hype or just has people lose interest, stop modding in anticipation, content creators run low on new things, etc. \n\nI’m fine with waiting but I agree in that it isn’t my preferred release schedule either.",
            "If you allow the public access to your game, then you constantly have to devote resources to fixing issues that can happen which means much slower development of future builds. There is a reason TIS at some point said \"B41 is in a satisfying state, we know there are some small issues remaining, but we're now focusing all our efforts on B42\".\n\nEspecially when you do deep changes to the structure of the game (which most crying wojak redditors here do), the amount of work would be tripled if they had to do monthly updates and fix issues for everyone instead of being able to just write them in a backlog and continuing working on the core stuff.",
            "[deleted]",
            "They've made it so even the fences that already exist in the world can be destroyed in B42. You're gonna have to actually make the effort to keep your base repaired now if you build somewhere with lots of zombies that can wander over.",
            "Heh. \n\nOnly large hordes though.",
            "Ngl this is been a thing for a while I thought. I remember playing a year ago and jumping a high fence to escape the massive hoard behind me, and then suddenly there was a massive crashing sound.",
            "NOOOOO (I say, knowing full well that this was inevitable)",
            "I'm not a dev and don't have perfect memory, but iirc there's an opt-out if you don't like it. Personally i'll find out how fast they go down with only a few zeds before making a decision. I think the idea that a horde can take it down is neat, but 2-3 shouldn't hurt it at all. If a single zed can munch through it in a single night, i'll turn it off, but otherwise, i'll keep it on.",
            "Not really tbh. It's a little stupid that zombies can't take them down at all now. I'm sure they'll be mods to tone down how easily they can do it, but better to have it in than to not imo",
            "I like it. It's kind of stupid having to prioritize finding a base with existing fences because the ones you build are objectively worse. And it'll make places like Louisville more dangerous, like a city should be.",
            "Nah it’s a good one because atm if you build a base near a place that has high fences and a gate your 100% safe which isn’t fun bc it’s no threat",
            "It is not. A couple of zombies won't be able to do it. Large hordes will.",
            "Don't rural areas sometimes not even have a police station in their jurisdiction, hence all the *ahem* bear arms out around them parts? Lol",
            "I like to think he World War Z-ed himself and was evacuated to an aircraft carrier sometime before he recorded the final message we hear from him.",
            "I don't imagine Subway tunnels are coming, considering the fact that there are no subways in the region. I could totally see them adding Sewers, however.",
            "They've mentioned a sewer system under Louisville a few times over the last couple years",
            "I'm sure this is the bit they're referring to:\n> a few thursoids back when they stated they planned to duplicate the entire crafting tree",
            "The duplicating of the crafting tree, not the obvious scope creep block",
            "\"Don't touch Willy\" Good advice.",
            "I thought it was Octember",
            "It creeps people out, which is the intended effect",
            "Honestly I don't know why we don't consider this a basically dead game at this point. All we've got is promises of work!",
            "Concerned? I’m not concerned I just think they are very small looking, even for a tiny ass KY town. I’d know as I live here. It’s really not even some kind of complaint, it’s just one of those things you can’t unsee. 6 parking spots for large buildings is typical for you guys elsewhere? Triple that at the dollar store closest to me, easily. But, like I said, it’s such a minor thing. I wouldn’t have even noticed it if it wasn’t pointed out to me.",
            "Americans, most likely. I didn't notice anything weird with the parking lots.\n\nBut yeah, the game takes place in the US so they're probably right.",
            "YES! There are some things that I don’t understand why they have not released in a separate update.\n\nThe depth buffer, the better lighting, the adaptive music, character vocals. Most of this could have been released in advance months ago in a small update imo. \n\nI love TIS, I’m not shitting on them at all (I know they are probably reading) but i don’t understand how they work tbh.",
            "The performance updates might be why the tentative \"first half of 2024\" got pushed back.  \nI think the lighting engine and foliage upgrades might have necessitated a major map rework, especially considering the persistent bug with player built structures/add ons to existing world structures.",
            "I agree. Longer time between updates means overall more mod stability.",
            "Yeah it is a bit of an odd choice and definitely more so something that should have been a later addition. Though it's a much bigger feature, I would have rather they had put the focus they had for the crafting system into NPCs instead for example. I think that's something that would really separate the game compared to its competition AND give it the endgame material people have been asking for. \n\nAt this point, I don't expect any sort of NPC/B43 release until I'm starting to hit my very late 20s, and I'm only 24 atm",
            "> I don't think many players will want to be doing a wilderness survival playstyle with no zombies or scavenging from cities, nor will many multiplayer servers be progressing so far that there are no man made supplies left.\n\nI think you massively underestimate the amount of players who like doing iron man runs. I agree that most servers probably won't end up utilizing the whole \"no need to ever reset the map\" thing but I know tons of people including myself who would greatly appreciate being able to do a completely primitive run without needing to use a huge host of crafting mods and still needing to spawn yourself the few essentials.\n\nThat being said I do agree with the devs that it's not needed right off rip. It's for sure the right decision to balance and bug fix what they've got so they can get it in our hands and then add on to it up until stable release.",
            "Yeah I agree, I think servers will just keep loot respawn on.",
            "This is my honest feeling too.  Super cool, but... won't player groups just turn on loot respawn for their servers, or reset them now and then? How much real market is there for players wanting to go away from fighting zombies and looting, and instead building a medieval village somewhere in a map corner?",
            "Probably unpopular opinion, but I wish they never did this in the first place, the thought of building your own Kiln to craft swords n shit seems unbelievably goofy for this game.",
            "100% agree.\n\nFocusing on adding The Flintstones Mode instead of adding for example basic NPCs to a Zombie Survival game it’s a poor decision no matter how you look at it.\n\nYou want to expand crafting? Great. You can do it by revamping the UI and adding tons of recipes that more or less blend with the game atmosphere. \n\nBut adding stone ovens and crafting moose dungarees to live your own caveman experience seems like kids going “YOU KNOW WHAT WOULD BE COOL?” and no adults in the room to set some boundaries.",
            "They always talk about this idea of a long term server that goes on for years and I honestly can't believe anything like that would actually take off in meaningful enough numbers. ",
            "Picture this: I, a kid in high school, just bought this awesome new zombie game in early access thinking, “Wow! This is like DayZ but more fun! And NPCs are coming?! This game will be amazing!!”\n\nSome time passes…\n\nYears pass…\n\nA decade goes by…\n\nFast forward to today, I’m in my thirties now, planning to get engaged, hoping to buy a house soon and maybe start a family. Yet NPCs in PZ STILL aren’t a thing because TIS have feature creep out the ass and don’t know how to rein it in. \n\nIt’s a fun game as is, but damn I’m tired of waiting for the ONE feature I got so excited for and convinced me to actually buy the game in the first place. \n\nLike I don’t just sit around and think about PZ NPCs or anything and am happily playing other games and doing other things with my life now, but anytime I DO think of PZ anymore I just get annoyed at how unreasonably long it’s taken TIS to fulfill a decades old promise because they decided blacksmithing or some nonsense was a more important feature than the thing they promised more than a decade ago. \n\nSorry, had to get that out. That’s the end of this (now an) old man rant. Carry on lol.",
            "Are you really just going to stalk my comments on this post? Go. Away. Comparing roguelikes to a game like Zomboid is idiotic.",
            "Apples to oranges, these are completely different games in scope and size. I love Hades, but Project Zomboid is comprised of way more different moving parts, besides being an open world game.",
            "If it wasn't feature creep than they wouldn't be cutting **features** to speed up the release. They wanted to do a lot more than what could be done in a timely manner with the new crafting system, so they are cutting parts of it out. That's literally feature creep. \n\n> Management, maybe. But to me it's pretty clear it's the crafting overhaul that's holding everything back\n\nIt's pretty clear following the games development for over 10 years that Project Zomboid pretty consistently seems to hit the same problem beats over and over despite the circumstances seemingly always improving around them. (more money, more developers, foundational overhauls etc)\n\nThis indicates a management issue.",
            "They're not doing nothing, they're adding stuff, just not the bottleneck stuff.",
            "Skyrim 2 Electric Boogaloo",
            "Bi-weekly*",
            "People bitch endlessly in every update, what are you talking about?",
            "Because you typically get banned for breaking the be pleasant rule.",
            "sorry i just realized i wrote from an account that i created inadvertedly, i did the revamp. yes the police station has a larger footprint and it's intended, same for the school. hopefully you will revise your judgement after visiting the interiors. cheers",
            "They said they would have a better idea by the time the next blog comes out, which is a month away.\n\nBut they also said 9 months ago that everything but crafting was in the final polish stage.\n\nI don't really believe anything they say anymore. \n\nWould not be surprised if it ends up being December or next year.",
            "Right? Like… nobody is asking TIS to work 60 hours a week on PZ, or live at their studio (even though I’m pretty sure all of their employees are remote). It’s just shitty and unfair to people who have spent money on the game to:\n\nA. Release an EA game and then take literal YEARS to update it\nB. Not only refuse to update it “until it’s ready” (we’ve heard this with so many EA and kickstarter games already), but ALSO refuse to drop any sort of tangible timeline. \n\nEA devs tend to do one or the other, sure. But doing both? TIS for some reason are the only people I’ve seen get away with it. It’s unfair to consumers who invested in a product, it’s unfair to streamers who bring TIS extra income, it’s unfair to modders who update the game for free and keep it alive just to get chasitized by 14 year olds AND ADULTS screaming at them for updates. \n\nAgain, I’m not anti-TIS, but I’m not going to act blind to what they’re doing. It’s horrible business practice, and while I’ll easily put another 2k hours into PZ, I personally will not invest into TIS if they were to make another game.",
            "I don't disagree that it's taken longer than it maybe should have, but I feel like this update will increase performance and make things a lot smoother as well as the content planned, which should mean that future updates don't take as long. \n\nBut why would people want crunch? That's not a good mindset. You can say that they should add more people to help etc, which they have in some places, but then there's the too many cooks in the kitchen saying. \n\nAll in all if performance and desync in multiplayer is fixed that would be as good as the big content update planned, and for a game that's $30 AUD (which goes on sale quite a bit so can easily be gotten for $20), I have definitely gotten my money's worth and they're free updates that provide lots of content. Sure mods have helped a lot, but implementing some of those mods into the actual game is a lot harder than people make out, it's one thing to make a mod, but that can conflict with other things and give those errors. \n\nJust seems a bit greedy to be saying that things should be done just to please people that are impatient, it's their game, they can take as much time as they like, they're an indie company that have provided a game that's a lot better than most AAA. They could release build 42 and call that the full release and call it a day, but they won't, they will keep working to provide even more content at their own pace. If that doesn't suit you then move on, no biggy, you're not obligated to keep playing.",
            "> Updates after that are irrelevant.\n\nThat is fucking hilarious lol",
            "Funny how you ignore the **Build 41 Polish** part of that flowchart you linked. You know? The part they worked on until December 2022! Goddamn, all you're doing is proving yourself wrong.\n\n>Updates after that are irrelevant.\n\nThis is such a weird comment to make when they were still actively working on B41 even after it's initial stable release. It was still being worked on and B42 will clearly end up going the same way.",
            "For real, literally had to pour over their own code to see why zombies would vanish in MP. It's hilarious that the playerbase doesn't notice such a glaring bug at times or out right denies it's existence.",
            "> As such the Unstable build is not imminent\n\n\nCan you not read?",
            "fr,  like why is the fanbase like this , this Reddit and the steam discussions, etc are filled with people like this who think the devs can do no wrong",
            "The only stuff they're holding back on is crafting, which frankly isn't all too impressive. We are most likely getting the basements and skyscrapers, the lighting update, animals, etc which are fantastic.",
            "Is that really such a bad thing, though? Being able to test an update in small increments will give the developers more focused feedback, if something isn't quite working out they'll be able to fix/course-correct before commiting",
            "That makes sense. Pretty cool",
            "I wonder will we be able to reinforce the fence with high metal working skill? 🤔",
            "Excited about this cause I cheese it way too much",
            "Something to worry about in a year.",
            "Haha sky base go brrrrr",
            "At this point, we might try to have concrete barriers or stuff which zeds cannot easily destroy easily.",
            "day 1 mod to revert back to the game we actually know and like i guess",
            "From what they mentioned in a previous post, it will be several pushing, and it will not break instantly, but you will see the fence buckling under the weight of them all pushing, so you have time to clear them/evacuate.",
            "With how TIS rolls, there will probably be a sandbox setting to turn that off/on",
            "I'll admit, I'm not a great player since I've only played on and off since the beginning and I abuse the hell out of tall fences. It has yet to backfire on me but I'm sure I'll fail to climb it one day",
            "Only issue I could see is that if zeds really stick to fences in an attempt to topple them over it could lead to some very easy kills with anything that goes through them.\n\n\nIf half fence camping was considered big enough of an issue to warrant the introduction of the fence lunge then I don't wanna imagine what they'd cook up to counter what could essentially be an even more broken cheese strat.",
            "Its primarily the distance between the police station and the people not the size of the station itself that is the issue and cause of that",
            "they talked about sewers at some point, but nothing confirmed for B42 i think",
            "I’m not sure there are any sewers large enough to make a base in, and there’s the obvious problem that during rains storms they may completely flood.",
            "Oh cool, yeah I hear you. I thought people were using parking lots in a cool new way I've never heard of.",
            "Yes I live in small town Kentucky and they’re glaringly small even for a city with a population of a few thousand. It’s not like it’s a massive issue it’s just a bit odd looking, I likely wouldn’t have ever noticed it, were it not pointed out.",
            "I'm European as well, but I want to feel immersed when playing a game that takes place in America. Another issue I have is the lack of guns (but that's a balance issue) and confederate flags (which should be pretty common there, at least at that time, according to my friends from the US, but I understand why the devs don't want to add them).",
            "Well, they already said why. They prefer to release big updates where a lot of new features come together and allow them to make more drastic changes before release, which I'm totally on board for...\n\nBut yeah, it would have been better if general improvements to the engine like performance, rendering etc were released as standalone instead of as part of a \"new content\" release (Which is now happening anyway, at least partially).\n\nEspecially the new rendering system taking advantage of the VRAM to not redraw cells every frame. That sort of development is HUGE and should be a priority update imo.\n\nEither way, I'm not too broken up about it. They want each build to feel distinctively different, and I can't argue about that. It makes B42 look shinier than it would otherwise be.",
            "I think they said once that they had some people working on NPCs alongside the work on B42, but I don't know if that's still or was ever the case in reality.\n\nI just wish they would fix fundamental problems with the game before adding massive new systems. For instance, I don't think there's been any mention of first aid being changed in B42, despite the fact that it's an infamously useless and poorly fleshed out system. Infections don't even do anything right now. Personally, I think treating injuries is a lot more important to a zombie apocalypse experience than a lot of the content being added in B42.",
            "> 24\n\n> b43 before 30\n\nidk bro seems kinda optimistic\n\n:(",
            "Yeah, at the moment servers just turn on loot respawn or wipe regularly. \n\nTIS has said they want B42 to make it so that servers never have to wipe, but that's just not realistic IMO.",
            "The walking dead comic is one of my favorite forms of zombie media and it literally goes the post apocalyptic wild West route so I don't think it's that weird of a design choice. It feels very on brand in fact.",
            "Somebody never seen the 2b2t Minecraft server. If the game had the framework to support a server infinitely without need of a reset I think a few would use it. It wouldn't be mainstream tho.",
            "I hope that they've worked a lot in the background of server stability to go with it!",
            "Same boat brother. 2010-2011, one of those years. Freshman year winter break. I found Minecraft Alpha the same week",
            "The good thing is that now the tech exists for NPC's. Pack an open-source language model on it, and there are precedents of using simulations with LLM's controlling NPC's in believable settings. The bad thing is that the game may require better hardware to run the model. Ten years ago, achieving this would be either lackluster or no short of wizardry, today, it is achievable for pretty much anyone with a coding background, it may yield hallucinations here and there, but that still fits an apocalyptic setting.",
            "Apparently one dude has been working on NPCs this whole time? It might be they just can't do it, especially the way people imagine them working.",
            "I am going to sound like a dick but early access games should be brought on what they have currently future plans should not be thought about.",
            "Keep coping my guy.\n\nHades while different in scope/size it was beautiful hand drawn animation, deep battle system, and won tons of awards. They pushed out multiple updates/dlc and and a sequel in half the time.\n\nAlso its laughable u say PZ is a open world game and implying its a larger scale. It has no NPC's, lore, stories, car animations, proper crafting system, end game, etc etc. Its full of spaghetti code and bad optimizations that chugs on high end machines. Modders literally keeps this game afloat.\n\nHades 1 Game Size - 10.1GB\n\nHades 2 Game Size - 10 GB\n\nProject Zomboid - 6.7 GB\n\n\nIts well known PZ development is notoriously slow asf.",
            "The Crafting Overhaul was planned from the start as one of the pillars of b42. 'Feature creep' refers to gradual additions of new features/content to a game beyond its original scope. So I wouldn't say the Crafting Overhaul was part of that\n\nThey're not cutting on feature creep, they're cutting on content that was planned for 2-3 years, which is arguably worse",
            "Not to this degree and not ever upvoted.",
            "Me reading \"we\" in your comment:\n\n![gif](giphy|ANbD1CCdA3iI8)",
            "I'm not trying to be judgey. These are just my personal thoughts - obviously we're only being shown a small snippet of the changes in this Thursdoid. Who knows, maybe it'll grow on me.",
            "The revamp looks amazing. I got my value out of this game a long time ago, all this work being put in to it is incredible and appreciated. Take all the time you need, i can't (can) wait to play it!",
            "> But why would people want crunch?\n\nNobody's advocating for crunch, people are advocating for realistic timelines that make sense with the amount of staff and developer time they have. What we have now feels like the devs are only working on it part-time for some reason, which isn't helped by the glacial pace of updates.\n\n> Just seems a bit greedy to be saying that things should be done just to please people that are impatient\n\nI don't think it's greedy to expect the devs to release content on a more sensible timeline that has a direct impact on the game's popularity. Sure, more frequent updates break mods or whatever, but updates keep people coming back and engaged with the game. Take Stardew Valley, for example, which released in January 2016 by a single developer. 1.1 was released in October of that year, and after various updates even had multiplayer released in August 2018. But ConcernedApe didn't stop with that, and added even more content with 1.4 in 2019 and 1.5 in 2020. The developer even started work on a new game before coming back to drop 1.6 in 2024. And that's just one example, to say nothing of the other games that will be started and completed before Zomboid. \n\n> a game that's a lot better than most AAA\n\nAt least these AAA games generally tend to be finished products.\n\n> They could release build 42 and call that the full release and call it a day, but they won't, they will keep working to provide even more content at their own pace\n\nYep, I'm sure it'll finish one of these years, just like Dwarf Fortress...\n\nEdit: Lmao they blocked me within 2 minutes of my reply. Wild amounts of cope",
            "Funny how you ignored that Indie Stone literally stated the Builds after B41 will never take as long ever again.\n\nIt was written in JAN 2022. Keep deflecting.",
            "Glad it's not just me that saw that and was stunned at such a comment.",
            "No, he’s got a point. Though, wording updates of importance as CONTENT updates would work much better. We haven’t had a legitimate CONTENT update since build 41, 3 years ago.",
            "Funny how you ignored that Indie Stone literally stated the Builds after B41 will never take as long ever again.\n\nIt was written in JAN 2022. Keep deflecting.",
            "That doesn't mean it isn't sooner, it is coming out sooner than if they kept adding stuff. Sooner doesn't mean soon or within the next month or whatever, it just means sooner than they had in mind because they have now cut back on some content. \n\nSo yeah, whilst it's not imminent, it's still sooner than it would have been, which I still see as being at least 3 months away.",
            "imminent as of now.\n\n35 days is not imminent but soon enough for exemple.\ni bet for september or august. otherwise it would have been december or early 2025.",
            "Steam is REALLY bad. I literally see the same people in every thread defending them. \n\nI have no clue why people are like this. I guess because in a way they contribute to their hobby, so it elevates them? It's fine to appreciate that, but god damn let's not act like they do no wrong.\n\nSomeone seriously said in this thread about how they should be glad that they already get a BUG FREE game to play LOL",
            "[deleted]",
            "That’s how I see it. Snapshots in pz is probably a good idea actually",
            "Yeah. I imagine it might be a sandbox setting if people really want it. I'll leave it on personally. I never use prefabs anyway now. I like to build my own base from scratch. Feels more rewarding.",
            "Don't know about that, but indestructible brick fences has already been confirmed.  So the eventual goal might be to slowly replace a metal fence with brick over time.",
            "More like 6 months",
            "I believe they did mention that anything we build via masonry will be unbreakable by the zombies? Although that'd likely be actual brick walls for houses more than anything. Concrete barriers could work though...",
            "Or succeed in climbing the fence only to land directly in a small horde since your character doesn't look over the fence hes trying to jump.",
            "Haha, nah man. But I’m sure there’s a legitimate reason they made them have so few parking spaces, it probably wouldn’t look proper if they made them smaller just to fit more in there. it’s just a little thing but no harm done. Anyways, have a good one!",
            "They don't release them because that way they don't have to answer to anyone and fucking up is not an issue. If it was officially released, then players would demand quick bugfixes every time something happened and that would divert the devs from what they're doing to fixing bugs as a priority constantly.\n\nA long as the build is not being shared, this pressure/stress doesn't exist, and the devs can profoundly fix issues and improve systems instead of speedrunning bandaids.",
            "First aid, mechanics, electrics, all useless once you have a couple of levels. Foraging only works on half the map. But hey we're getting fancy keychains!",
            "It goes well if all the atmosphere goes with it.\n\nIf you’re forging a medieval sword in a medieval oven in the back of a gas station that is more lr less pristine… I dunno, feels tacky and zero immersive.\n\nIt’s like watching 28 Days Later and including a character that looks like a caveman, with clothes that look like a mammoth and a giant club. It doesn’t feel realistic.\n\nFor a game like Project Zomboid, crafting should expand with things like tuning your car/truck to make a post-apocalyptic tank full of spikes and metal scrap parts. Attaching a taser to a baseball bat to electrify zombies. Create electrified fences or a homemade flamethrower with a modified watering can. Dead Rising and Dead Island kind of crafting. At least that’s the first thing that comes to mind.\n\nIt is cool to forge medieval axes and craft mithril armors? Sure… but I would like to have a functional bow in the game… not a tribal bow, not a medieval bow, a REGULAR BOW, and that thing, which is one of the cliche weapons in the zombie genre, is not in the game yet after all these years. No bows, no crossbows, no slingshots. Coming from TIS, we’ll have shurikens, throwable axes and trebuchets first.\n\nI’m ok with them making the game they like, and if they like Minecraft and Factorio with zombies that’s fine, but again, not including basic stuff first (like proper animations, basic vehicles like bikes…) before going nuts with overkill crafting, seems like they don’t listen to their own community or even think about what makes sense.\n\nIf I read this post a year ago, the vast majority of the people will be divided between cheering and criticizing everyone that was complaining. In the past months, I’m see the quantity of people blaming them of poor development/managing rising, and… the amount of downvoting is going down.\n\nFeels like a lot of people ditched the game because of it or they’re tired of waiting.",
            "I mean you aren’t wrong and I make the same argument nowadays, but you have to remember this was so long ago that Steam Greenlight (what became Steam Early Access) was barely even a thing yet. This was the Wild West of early access still. \n\nI actually bought PZ when it was still on Desura, a client so old it doesn’t even exist anymore lol.",
            "If everyone followed that then none of the early access games would receive the money needed for development.",
            "You can't just compare GB.",
            "I never saw such moronic take. Im in awe.\nwow.",
            "there you go :)",
            "Agree tobiferous..",
            "Man a lot of what you're saying is just greedy, saying they work part time on it, you really have no idea so I'm not going to try and argue, they can release content in their own time, they're not rushing for your benefit.",
            "You are on that Terance Howard math lmao",
            "No deflection, there's just no arguing with someone who makes their own math.",
            "> No build will ever take as long as Build 41 did\n\nIndie Stone",
            "You are right, no argument here, but I'd like to point out that we are in fact not entitled to more content updates.\n\nThe devs could drop B42 next month and call it full release and get out of EA, but they choose to make these expansive improvements for the game.\n\nJust people they choose to keep us updated on their work, let's not let entitlement creep up on us.",
            "Buddy, what part of B41 was STILL being developed even after it's stable release do you not get? Fuck me... I'm not deflecting anything, you're ignoring the actual timeline of development for B41 and how they didn't just stop developing it when it hit stable release.",
            "Guys you are missing the fact that they made a tweet back on January talking about the update coming out this year, specially considering they never give ETA's",
            "I'm biased, and I think I'm frankly going to spend zero time with the crafting system, I already do. I'd rather find a baseball bat than meld together a metal rod to use.",
            "Iirc it was already confirmed there will be a sandbox setting to toggle destructible fences in the new build.",
            "It would be best if high fences (even player built ones) only took damage if a set amount of zombies concentrated on a single tile, because there's no way in hell a single zombie can break a fence made of metal. It would make metalworking so much more worth it.",
            "... Quick, someone get me the data on how many years of bricklaying I'd need to do in-game to wall off an entire city.",
            "Oh ok, cool. So masonry might be a new skill, I’m assuming. Neat. Thanks for the info.",
            "Very optimistic. I like it.",
            "Yea there's always that too\n\n\nThough right now I'm using the gated community in rosewood as my base so the walls are kind of like my entrance lol",
            "Well a lot of this would simply come down to balancing. They've said it before but with all this new crafting will come a huge overhaul to the way we grind skills. One of these changes will be players won't be able to jack of all trades max level all skill trees, you will instead have to build your character based around how you plan to play (all of which can be adjusted, or disabled in sandbox settings). So overall grinding seems like it will be much harder.\n\nAs for dead rising levels of crafting I wouldn't at all be surprised if some of that finds it's way into the game as a form of low level crafting. In face I'm pretty sure we've already seen some things along those lines in screenshots. Lastly, I imagine a lot of these crafts le weapons such as bows and crossbows will have non crafted pre apocalypse versions available for early game so I don't think that will be a problem either.\n\nOverall I get what you're and don't necessarily disagree but I really don't think the end result will allow players to look like mad max medieval soldiers a few weeks into the end of the world.",
            "I bought Kenshi back on Desura and while there were promises made then that never came to fruition, that became a complete and fully fledged game that they're now making the sequel to. Zomboid still not at 1.0 it's CRAZY",
            "I mean this was still said back then to. Any game you buy period should be assumed to not be updated and what you buy is all there will ever be.",
            "I immediately gave up, not worth responding to something like that LOL",
            "lol Nice. Love your work btw. Progress is looking great. \n\nAmazing how much the roof details really bring a building to life.",
            ">No build will ever take as long as Build 41 did\n\nIndie Stone",
            "Nasko. Please give Lemmy a hug from me, tell him we miss him\n\nNext thursdoid could we have another tease of basements if possible \n\nMuch love",
            "yeah, true. We aren’t entitled to anything, if they wanted to stop working on the game, they could. I would rather take updates as DLC if it meant they got released faster though, that’s just me",
            "> No build will ever take as long as Build 41 did\n\nIndie Stone, Jan 2022\n\nhttps://projectzomboid.com/blog/news/2022/01/2022-and-beyond/",
            "Unless you expect B42 to release in a perfect state or something ridiculous like that it's reasonable to assume it will have its own period of polish. Hell, we already know of several features that won't make the cut but have already been explored and worked on, maybe those will get added with following updates before the focus fully shifts to B43, it'd make sense.\n\nSo ultimately, the guy's probably gonna end up right at the end of the day. \n\nNot that I condone the attitude, mind you, just saying.",
            "I certainly hope so. One of my favorite base locations relies on this fence to not be overrun, since it's kind of next-door to one of the most disproportionately high population cells (relative to surrounding cells) in the map (which leads to a nigh-endless stream of wandering Zombies, even on tame settings). This change kind of kills that location as a potential base, except if you have a *massive* amount of players there.\n\nBrick fences certainly help, but it turns bases that previously took a lot of work to get going (outside of a few given houses, most locations with such a fence lacked many amenities and required the player to have decent skills to obtain appliances) into bases that take a *crapton* more work to get going.",
            "There is a mod for that, but yes I agree I think it should be part of the base game.",
            "There's a mod that does this called long standing walls for wood & metal walls and it's amazing because it feels right, the walls don't feel flimsey but they also don't feel like health sponges either.\n\n\nI highly recommend the devs look into making this mod vanilla.",
            "I think that was their tentative plan. Something like a crowd of several dozen zombies before the fence starts to buckle world war z style",
            "Data is in, sir!  *beep* *boop* *beep* Results: a shit ton",
            "Brickie here, you could do it with 0 experience, but that doesn't mean it'll be straight/strong 😂",
            "Bricklaying lvl 1 gonna be like:  \n   \nhttps://www.reddit.com/r/TheSimpsons/comments/1ibzs3/ahh_yeah_thats_one_finelooking_barbecue_pit_why/",
            "Not \"might be\", it is.  Pottery and Brick Kilns have been confirmed.",
            "Well I’m more centered in the look and feel of the game and you’re talking more about gameplay and systems.",
            "Why does it need to be?",
            "It really wasn’t, not like it is today. But keep using that as an excuse for a dev team taking over ten years to release a single feature they promised, when they’ve even said themselves the main reason the game still exists in early access is because they haven’t fulfilled that specific promise yet.\n\nLike I said before, game is fun as is so it’s not like I’m looking for a refund or something. But if you don’t see this situation as ridiculous as I’ve described it, then there’s nothing I can say to counter your copium.\n\nEDIT: Also you post in GenZ. Were you even a teenager a decade ago? How the hell would you know what the early access industry was like back then?",
            "ty <3. actually the rooftop to wall surface ratio from an isometric perspective leans strongly towards the roof when buildings are 1 or 2 stores high. which is typical for a town like muldraugh IRL.",
            "Keep slobbing",
            "Double that. I was sorry to see him let down and disappear. I hope to see y'all rejuvenated and excited as ever soon. Indie Stone deserves to feel the hype as much as the community does.",
            "I give up. It's like talking to a brick wall.",
            "Dude, I need to catch up lol Thanks again",
            "Have you tried the 10 years later map? If the devs rework erosion and building degradation to be more in line with that over long lengths of time I personally think it would look really cool to see players running around with makeshift clothing, armor and weapons.",
            "Because Kenshi is massively more complex and is done. I want Zomboid to be the best game it can be and it's wild that after more than a decade it doesn't have the key feature it wanted to have from the beginning even.",
            "It's not copium I think both are stupid here you guys are just more annoying here.",
            "That’s what arguing against the truth feels like",
            "Sure. What I mean is that they’re putting hundreds of hours in creating things that only a fraction of the players will use and they will get along with a specific scenario and purpose, instead of improving or including stuff that should be core parts or tools of the game.\n\nIs like spending years in designing a system of  autonomous driving for a car but not including four wheels in it.\n\nThey’re saying the crafting system is so complex that they need to fraction it, but still we don’t have proper animations for cars, sitting/sleeping, showering… fire sprites that look like Super Mario from the NES… no bikes, no throwable weapons, no physical changes on the characters based on how much they weight or the exercise they make.\n\nI don’t know. I understand that different players have different priorities. But for a game that is trying to be “realistic”, I do prefer to see a realistic approach on what I see in-game vs. a realistic approach for how a complex system works by using boring UI windows.\n\nEven a simple animation like the character kneeling and opening their bag to take or leave heavy objects, does a lot to feel more immersed, instead of 99% of the animations of the game looking like the character is solving a rubik cube.\n\nIf the character carries extra stuff, create 2-3 walking and running animations that portray that feeling. Instead we have animations that look like the character is trying not to shit on his pants.\n\nAgain… sometimes I feel like they take the game to the “doesn’t matter the looks of it” and they’re happy with the players filling these gaps like if they’re playing some D&D.",
            "They are different games with different goals, I followed Kenshi from its earliest days of development, I played the Zomboid demo when it first came out, the only difference is one had the 'came out' label and the other continued development. Nobody has gotten less because Zomboid didn't wrap things and start making a sequel, there is so much more to the game than NPCs - which are being introduced in the form of animals soon already.",
            "I'm so sorry that speaking my opinion of a game I've owned and played for over 10 years is so annoying to you. \n\nHere's a solution, I'll block you so you don't have to be personally accosted anymore by my kvetching on a public forum.\n\nArrivederci!",
            "explain to me how the limited number of devs are suppose to write a update for a build they haven't finished updating yet as a base for the next game. have you ever coded in java before? clearly you dont understand how you cant make a build against a version thats obsolete."
        ]
    },
    "\"Find a way to forget reality\"": {
        "title": "\"Find a way to forget reality\"",
        "score": 996,
        "url": "https://i.redd.it/ihf7c61wb08d1.jpeg",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Oh when they add npcs, it would be soooo cool that you could spawn with a randomly generated family and they can get eaten and shit\n\n*eaten by zombs (cannibalism would be a fun addition though)",
            "Isn’t there a flaw where eating stale food literally kills you?",
            "i mean my guess is losing all their friends and family's pushed them to the edge and literally all it takes for them to fully lose it can be something as insignificat as, yes,  piece of stale bread",
            "I have a few mods that enhance the depression experience; one gives a trait that gives my character depression at random and one where they'll cry out of force if they're depressed for too long.\n\nI imagine that at random moments outside of fighting the dead, my character will remember that their family and friends are among the dead and will start feeling unmotivated to survive yet have to continue forward because it's all they can do now and if I don't do something about their depression, they have a crying fit because they're remembering too much of the old life where things weren't so bad and they're going to be alone forever. But then I have them read a hentai book that removes their depression completely or drink some liquor so they can sleep peacefully for the night.",
            "Eats 20 eggs back to back: Delicious\n\nEats a salad that has a bit too much of the same item: **DEPRESSION**",
            "The protagonist may be a sociopath, but they have *standards*",
            "In multiplayer, you can talk to yourself in \"/say\" to reduce boredom",
            "Yurrrr",
            "But have you ever eaten really stale bread.",
            "I would make a whole community like in the walking dead. Id make my character slowly crazy and pull a governor and secretly place traps on areas and kill any witnesses",
            "Then people would band together to end the living and the dead from cannibalising. If you want a safe place i have a safehouse setup on the traintracks called Terminus that anyone tired of all that can come and survive!",
            "im almost positive they've said they'd never add child zombies. but also I think rimworld devs said they'd never add children and reproduction so here we are",
            "Cannibalism is cannon.",
            "I really hope they will give us the option of disabling NPCs for the game. I like being a lone wolf in the apocalypse.",
            "You're thinking of rotten bread.",
            "Yeah weak stomach I think",
            "yeah when I’m sitting alone in the dark, exhausted, covered in blood and grime, and when the food I decide to eat is a piece of stale fuckin bread? The reality of the situation is definitely setting it.",
            "I need those mods. I love mods like that but some are too random and danger moodles: insanity is too punishing",
            "You just made me realize this NPC update is going to turn PZ into Rimworld.",
            "I love the community of this game lol",
            "Im keeping all those freeloading boozers outside - they might sully the dignity of my mannequin collections",
            "Just a little sidenote but I've seen my colonists fuck but the women never get pregnant. I also have no dlc, if that changes something",
            "Oh it's definitely going to happen, as soon as NPCs are added, with how buggy NPCs can be and with how much you can edit the settings, that setting is guaranteed with the update adding NPCs, probably also for animals as well.",
            "No",
            "yeah man shit given the circumsances i'd probably lose it too",
            "I believe I have the More Traits mod which has the Depression trait and the Break Into Tears mod which gives you the option to cry as well as two traits, one forcing you to cry at a certain percentage and the other going into a mental breakdown which you can't do anything about until it ends.\n\nI've tried the Schizophrenic mod before and it was a wild start. I haven't touched it since and I need to at some point.",
            "Rimworld: but more Zombies and Less Rimming",
            "😭😭😭 the crossover of generations",
            "PZ with NPCs vs Rimworld with the Zombieland mod",
            "I see this as an absolute win, personally.",
            "Me too man me too",
            "yeah they \"Got Some Lovin'\" before i believe it's the newest DLC that added getting kids. Maybe the last one? I dunno, I only have royalty. but yes, it's a thing now, largely based on a very popular mod that added it before. I think they were a little squeamish after Australia? or somewhere briefly banned the game because human cowboy hats",
            "Most popular mod is gonna be \"More Rimming\"",
            "Oh there's a mod that adds zombies? That's neat.",
            ">human cowboy hats\n \nLol",
            "I cant wait til someone adds a mod that kills your character if they don't eat at a table.",
            "Zombies are also vanilla now with Anomaly expansion, though it's more resurrection through mist of scifi nanites gone rogue than virus/magic.\n\nThat said, undead chicken zombies are a thang.",
            "https://www.eurogamer.net/rimworld-ban-overturned-in-australia-following-successful-appeal\n\n>high impact themes and drug use\n\nlololol",
            "Hell I'd almost start a gofundme and contribute to it personally for whoever advocates to make us one such mod"
        ]
    },
    "Something you may not know... about the camera.": {
        "title": "Something you may not know... about the camera.",
        "score": 87,
        "url": "https://v.redd.it/71c5mbl7538d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Top tip, I learned something.",
            "Mad respect. ",
            "For panning the camera while driving there is also an option to automatically do that, so you can see further ahead and have more time to react to obstacles etc.",
            "Isnt the default key for sprinting left alt though? So youd be making your camera loose while sprinting, seems like it might possibly cause issues.",
            "I'm glad you did. I wasn't sure this video would be good enough with this tip, that's why there is a bonus content part.",
            "Indeed, if you go to options, display, you can check \"Pan camera while driving\" it can be a bit slow to pan though so I prefer to do it manually.",
            "I can only offer two in return, that you probably already know:\n\n- Shift-E will toggle nearby curtains open/shut\n- When working with big inventories, you can do all the dragging back and forth while paused and then unpause to see it all happen. Stops you getting chomped while focusing on shifting shit.",
            "I didn't know the last one, thanks that's really useful."
        ]
    },
    "“1000 Zomboids stare”": {
        "title": "“1000 Zomboids stare”",
        "score": 212,
        "url": "https://www.reddit.com/gallery/1dln02k",
        "content": "",
        "num_comments": 3,
        "comments": [
            "I have a trade. I give you an upvote. You give me that fucking meme because holy shit",
            "![gif](giphy|RLEL5FIxVDJAnbFzWb)",
            "Two thousand tile stare"
        ]
    }
}