{
    "The Future of r/RandomThoughts (MOD APPLICATIONS OPEN)": {
        "title": "The Future of r/RandomThoughts (MOD APPLICATIONS OPEN)",
        "score": 37,
        "url": "https://www.reddit.com/r/RandomThoughts/comments/169jp15/the_future_of_rrandomthoughts_mod_applications/",
        "content": "Hello!\n\nBefore getting into anything I'd like to thank [u/TheImperious1](https://www.reddit.com/u/TheImperious1/) for the time he took to open this subreddit back up some months back, the time you put into the care of this sub is appreciated and we are all grateful for it. Enjoy your retirement from the sub!\n\nAt this time our team is drafting changes to make for the convenience of not only ourselves when modding but also for the convenience of you, the users. These changes will include rule changes. We plan to make them easier to understand which we believe will make them easier to follow and lead to less confusion in the future. An announcement will be made when these new rules are ready, please be on the lookout for that.\n\nIn addition to this we plan to implement some browsing changes including the removal of the ability to post links. we believe this will lead to less spam bots such as Temu and Onlyfans bots.\n\nLastly, Mod applications are reopening starting now. If you believe you will be a good fit for our team feel free to apply, even if you have no prior modding experience.  (We will not be hiring right away if you are selected)  [Application Link](https://docs.google.com/forms/d/1_ndAtJBvlBwryjuWnq1PGtWX6cTJ9_vh8f4330sGYIc/edit?pli=1)\n\nThank you all for being apart of the sub!",
        "num_comments": 33,
        "comments": [
            "Sorry about the repost, the initial application link was incorrect",
            "This place is growing. I keep getting interested in discussions just in time to see them locked/removed. I get halfway through the OPs opening text while scrolling, and open the thread to find it removed. No offense to you whatsoever, but You're kind of swatting perfectly good content away like it's your job. I wanna make the suggestion to just let it ride. You are NOT going to prevent redditors from being rude to one another and off topic. You might as well just close it down if that's your goal. And how exactly was the pizza sandwich thread off topic? This is random thoughts. I really liked this place because the content could vary by a lot. Now it's like you're rushing and scrambling to keep it small and pleasant, but all that's happening is people getting frustrated with the unnecessary censorship.",
            "So I’m assuming that this is voluntary a no money is being offered…. What about other valuable considerations?\n\nLook I’m sure this would look good on my résumé …..if I need one .",
            "[removed]",
            "Does it pay well? My qualifications are as follows: High speed connection and home, No social life or full time job, middle of the road computer skills.",
            "I just joined, haven't read a single post, and am a terrible worker. Let me be an admin.",
            "[removed]",
            "![gif](giphy|ndVYrBydU3MdAhYSDI|downsized)\n\nSomeone is falling for me.",
            "Entirely voluntary since we don't make profit to pay our staff unfortunately. I know some of the team uses Reddit moderating to help with their own teamworking skills so it may have that for considerations.",
            "Modding, even on more serious sites like stack exchange, will do absolutely zero for you on a resume.\n\nTo think otherwise makes you part of the problem...you actually think that Reddit matters, and worse that you can gain a kind of power Identity from it.",
            "**Your submission has been REMOVED for the following reason(s):**\n\n> Your submission appears to be hateful or harassing towards another member, or you may be involved in a heated argument with another user, this behaviour is not welcome here, please take all drama off this sub, if you continue after receiving this warning, you may be subject to a 2-3 day ban to avoid you continuing. \n\n^(This removal was done manually by the mod team and was not done in error, if you'd still like to appeal this removal please **[send us a modmail](https://www.reddit.com/message/compose?to=%2Fr%2FRandomThoughts)**)",
            "![img](avatar_exp|159332707|fire)\n\nWhy not?",
            "[removed]",
            "   Not at all looking for \"power\" it was just a random thought.\n\n    Reddit does matter, why else would millions of people use it daily ? \n\n    For whatever reason people from all over the world have for doing so,  even if just as to exchange thoughts, ideas, gathering  outside ones own perspective for a different point on of view,  even just discussion and discovery about whatever topic that they may have  an interest in . \n\n    Reddit my not matter to you, but here you are doing exactly what reddit was meant to do.",
            "![img](avatar_exp|164130467|winner)\n\nHello fellow meme lord"
        ]
    },
    "What do you wish society normalized?": {
        "title": "What do you wish society normalized?",
        "score": 682,
        "url": "https://www.reddit.com/r/RandomThoughts/comments/1dlhr9v/what_do_you_wish_society_normalized/",
        "content": "Mine is farting. Somebody farted today at an event I was at and I felt so bad for him bc everyone looked back and started laughing. Me included bc I made eye contact with someone who was laughing…and the fact that we were all strangers made it 10x funnier 😭 (I was quiet about it tho)\n",
        "num_comments": 802,
        "comments": [
            "If this submission above is not a random thought, please report it.\n\n  \n# Explore a new world of random thoughts on our [**discord server**](https://discord.com/invite/8tEqw3ZWQV)! Express yourself with your favorite quotes, positive vibes, and anything else you can think of!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RandomThoughts) if you have any questions or concerns.*",
            "Not every service needs a god damn tip.",
            "Not needing small talk to request something. \n\nSometimes it’s so fake that it’s painful to talk about",
            "Not having to be talkative, I get asked \"why are you so quiet?\" But they aren't asked \"can you shut it?\"",
            "Capes",
            "Adults who choose not to drink alcohol just because.",
            "Real pockets in all women's clothing",
            "Dressing out of fashion, or in old fashion\n\nI would walk around practically dressed like a cowboy, but I’m not in the south the I’d get weird looks",
            "Second half stuff. Cheaper and better for the environment",
            "No shame in mental problems",
            "Dressing up for no reason. I love dressing up but rarely have a reason to",
            "Four day work weeks!",
            "Verifying information before claiming it's true.",
            "I have several suggestions.  \n\n1.  Bring back dueling for serious personal insults. You better be prepared to defend your bullshit with bodily harm.    \n\n2.  Holding CEOs accountable for their decisions by holding their bonus and stock options in-trust for 5 years AFTER they leave office.   \n\n3. Term limits for politicians and judges with their pensions NOT being inflation adjusted, just like regular Joe and Jane taxpayer.    \n\nI want the people in power to be held accountable for their actions.",
            "I don’t mind the sound of someone farting.  It’s the smell that I can’t get used to",
            "Wearing napkins around the neck during meals. It would save on dry cleaning.",
            "Not talking, sometimes I just don't have anything to talk about or to ad to a conversion. Also when someone has put on earbuds it usually means they don't wanna talk so stop talking to me",
            "Going to go pee more than once while at the same place",
            "I'm with you on the farting! I have partial paralysis from my waist down, which means the muscles that would hold in a fart just do not work. So I often fart in public and get laughed at while I just mumble \"I can't help it\" and leave if I can.",
            "Girls approaching guys",
            "Women with alopecia",
            "Asking for help/talking about mental illness",
            "Wearing a bra. Gaaaaahhhhd I hate it now. Something with my third kid I was just like “FTS”. I know some people have big knockers and are comfortable wearing them, but set my c cups FREE",
            "I agree with the farting. I farted once in 5th grade on accident during story time and I was bullied for the rest of the semester about it. I would have preferred they laugh, but instead they backed away from me and made me feel ashamed. Even my teacher made a dirty look and said it was disgusting! I changed schools after that.",
            "Being able to punch someone in the face with no assault charges being filed if someone is in your face talking shit, or lying about you. I think shit talkers would think twice if they knew there would be repercussions for their actions but none to the person who decked them.",
            "saying no without further information",
            "would be expressing vulnerability and emotions openly. \n\nIt's common nowadays to like being strong, or pretending to be strong.",
            "Keeping your sexuality to yourself. And I don’t mean that like “if you’re gay keep it at home” I mean I’m tired of hanging out with friends and then someone bringing up sex/porn/fetishes. I don’t care how close we are, keep it away from me. Stop soiling the fun to talk about what makes you hard, I don’t need to know",
            "longer hair on guys and shorter hair on girls. it's kind of weird that we've gendered hair length",
            "Different sleep schedules. A significant amount of people have DSPS but businesses close so early. They say retail is dying. Maybe close the stores when people are working in the office and open them after people get off work.",
            "autism. the world is cruel to me sometimes :>",
            "Being able to push shit heads into a wood chipper",
            "Men do cry and want to be held, coming from a sensitive man",
            "I would love to walk around in a Regency dress with feathers in my hair or just wear something outrageous and not be judged",
            "trans people",
            "Wearing clothes that are not like new anymore. Even if there's a tiny hole or a stain on it. We throw away so much clothes because other people might think we're shabby. As long as you don't smell and there's no private parts showing, I really don't thing it should be a problem (to some extend).",
            "Open and honest discussions about human sexuality when appropriate.",
            "I’d love to dress in massive elegant ball gowns every day in public. Going to ikea? Wear a massive pink fluffy dress! But unfortunately I’ll get weird looks 😭",
            "I wish society would normalise men parenting their kids, not \"babysitting\"",
            "Atheism.",
            "universal human rights as an everyday morality",
            "not posting every damn thing on social media. cutting some social media would be nice. some apps are pointless.",
            "Agreed fighting. \n\nYou have an altercation. You agree to fight. You step outside. Fight. Then it's over. I guess that was your parking space, my bad.",
            "Genuinely caring about Men's mental health.",
            "Adults pooping/pissing their pants accidentally. \n\nShit happens (pun intended), we don’t need to add a layer of social shame to the clean up process. \n\nFrankly it’s just a particularly socially acceptable form of ableism.",
            "Voluntary euthanasia.",
            "I feel like since I've become an adult, farting has been normalized. Not sure who you're hanging around, is it children?",
            "cloaks. i want to look like an adventurer while going to work.",
            "Not having friends. I don't have time or energy to maintain long lasting friendships 😭",
            "[removed]",
            "Commonsense",
            "Short men",
            "Treating Depression the same as cancer or other diseases.",
            "having some makeup free days (for normalisation you need to get 0 comments of \"are you sick/are you poorly\")",
            "Going to the hotel breakfast in pajamas ",
            "I’d say this is a western society thing - giving money as a gift. \n\nIn East Asian culture, particularly China, it’s quite the norm. It’s wrapped in a red pocket and given on celebratory occasions. \n\nTo me gift cards are worse versions of this. Why give gift cards when money will do? It’s environmentally friendly, it helps the person in need, it takes the guess work out of choosing a gift. \n\nI had asked about this some folks and I was abit surprised how polarizing it can be.",
            "Nudity. We worry waaaaaay too much about exposing our bodies. We all have them. I pretty much know what yours looks like, you pretty much know what mine looks like. Let’s get over ourselves.",
            "I wish Western society normalized adults living at home with their folks due to the economy being so shit.  It's always been this stigmatized thing and I'd like to see us evolve as a society to a place where moving back home with family is not only acceptable but applauded 🎉",
            "Not wearing bra",
            "autism. it's not normalized and it's still difficult to live with autism due to the ableist society.",
            "I agree about the farting if a person excuses themselves. I just had a coworker fart in front of me on break and I said no problem glad you're comfortable and better out than in. I only laughed when she rushed to escape her own cloud 🤣 but I made it clear first I'm a firm advocate for normal functions and she was safe with me.",
            "Laughing is the \"normalized\" behavior.  One need not be embarassed.",
            "Education. ",
            "Every body 💨 just as every body 💩",
            "General empathy and proper ethics rather than Hollywood idealism and objectivism needs to be normalised not only for the sake of our planet but for ourselves, otherwise we are doomed to fall into a consumerist hellscape.",
            "Employers expecting average people who dont want to work but they are there just for money for food and bills",
            "It’s okay if it was you, op, you don’t have to pretend.",
            "Draping myself in velvet.",
            "Americans need to appreciate that animation is a medium, not a genre. They think it’s either Disney or family guy. \nI’d like to see more dramatic animated shows and movies from American studios.",
            "Wearing my bonnet outside, lol. I have really long hair and hate putting it tight ponytails, so my bonnet is perfect because not only is it practical to keep it in one place but it's literally protecting it from friction, which is something all curly/really wavy hair peeps should be concerned about.",
            "Being sad. I wish I didn’t have to smile all the time for people to like me and for everything to be ok.",
            "Being left handed\n\n\n\nBy that i mean have more options for left handed tools and equipment",
            "That people with addiction aren’t bad people, they just need help",
            "That fat people exist.\n\nOpt for larger seats in public places like restaurants, waiting rooms. Conscientious of if the armrests will painfully cut into someone’s legs. Like why would you want half of your customers/clients to be uncomfortable and in pain while they are supporting your business?\n\nStop having separate straight size and plus size sections. Just make *everything* in *all* sizes and put them on the racks all together. Why is the swimsuit section at target 4x larger than the plus size section? Why is the straight size section 6-8x larger? Why is the plus size section just matronly clothes? Why do they think I want a shirt that says “body positivity” or “thick thighs” or some shit.\n\nMake seatbelts in cars longer. I’m so damn tired of getting in a friend’s car and the seatbelt locks on my three times just trying to put it on. And once I get it on it locks if I move at all or we go over a bump.\n\nFor reference I am a woman’s size 26",
            "Not asking \"how are you\", or \"pleasure to meet you\" when u actually don't care. Just a normal hello should be acceptable.",
            "Letting people just live their lifes",
            "Hitting on complete strangers. I don't like it at all. I didn't care until it started happening to me when I started my job in October and was taking the bus to work every day. It's usually the insane old maniacs who sit around doing nothing until they see you smoking and want a cig or looking decent and wanna \"talk.\"\n\nI don't see how they think I'm cute with my short, fat self but I'm going to work, just leave me alone.\n\nI think farting is pretty normalized. People just don't wanna smell it. If my mom is about to fart in the moving, locked car then I'm rolling that window down as soon as I can. \n\nFarts are funny and they ease the tension...",
            "Not having to go to college, get married, and have kids.\n\n(I am still in high school but I get told by my parents about my future and how I would go to college, get a job, and move out when I get married and have kids. I just don't want those things, not the job part but everything else. I know I am still a child and adults are going to say I will change my mind when I get older. Maybe they are right, but I know I am not good with school, I am not and never will be stable enough to have a lifelong partner or to have a person to take care of. So, I want people to stop talking about this picture-perfect life with college, marriage, and a kid to take care of because it is a lot of pressure and maybe something that can be hard to accomplish.)",
            "People who are well composed, I have a stick up my bum and I like it. I get asked a lot to losen up, dance more, talk more, drink more. like no please I like who I am.",
            "Not normalizing everything and thinking that every new belief and principle is a step forward.",
            "people who have a bit or a lot of a belly wearing crop tops or low rise jeans.   \nnot everyone is going to have the \"perfect flat stomach\" so why cant we normalize people who have confidence.  \n(idk if I just made any sense, sorry)",
            "No being a good enough answer without being expected to give an explanation",
            "Scientific Fact",
            "Universal basic income",
            "Hating disney. They massacred star wars, marvel and now doctor who. Now I could excuse the first 2 but DW, NO. I will not stand by and let my brothers in the sontaran empire suffer this indignation. SONTAR HA",
            "Mental health",
            "Casual alcoholism. Why can’t I have vodka on my cereal and Irish up every drink? Why are we encouraging people to go through this miserable existence sober? “Don’t operate machinery pissed up” - why not? It’s the risk of losing a testicle that makes it fun! Stop demonising piss heads NOW.",
            "Crying in public. Sometimes you just feel bad and crying is a healthy way to express that. \n\nAlso generally expressing that you feel bad at the moment. Answering anything negative to the question \"How are you?\" feels like such a taboo",
            "eating bugs. they’re packed with nutrients! also, periods.",
            "Social anxiety",
            "Being topless.",
            "Farting is not embarrassing in mature adult circles, we might laugh but it's not at someone, it's with them.",
            "Being honest and direct.",
            "Prostitution. For both parties involved. Let’s stop pretending that sex isn’t transactional on one level or another and just get on with our lives, could we please?",
            "looking after your mental health, and the stigma of addiction. \n\nalso, farts",
            "licking your plate clean!",
            "realize the pressure",
            "Let's not do anything to farts that stops them being funny.",
            "Health, longevity.",
            "Headhunting",
            "Chicken wings being sold as its broken parts as one whole piece. One while wing should be wing tip, flat, AND a flat.",
            "Minding people’s own business. I mean that specifically where people have hobbies that they enjoy and others make fun of them for it. If you really find it cringey or weird, DON’T DAMN WELL GIVE IT ATTENTION",
            "Coding.",
            "Dressing what ppl likes to wear and no judgement from other. 😅",
            "Reality",
            "Not eating literal poison food from grocery stores. Wish people realized it’s not real food…..",
            "Women as sexual beings",
            "Lol tbh if I farted I’d feel so much better if people  laughed than if they made disgusted looks or were awkwardly silent. I feel like it breaks the tension. And the wind. I’ll see myself out.",
            "Divorce shaming.",
            "Thinking loud, talking to yourself",
            "Being silent while around others. I used to lead an outdoor mindfulness group, and intentionally being in silence with others is beautiful. I wish that silence was the default situation, and that people only spoke if they had something to say.",
            "Not needing to be professional in professional settings. We all know that we're bullshitting each other and wasting so much time pretending we're not. We can get the same messages across and get the same shit done without having to put on a mask that wastes so much time and energy and that we all know is a show, a mask, and an act.",
            "Everyone is different, everyone trying to normalize lahat, pero hindi nila matangap na lahat ay mag kakaiba ng opinion at values, magkakaiba tayo then pag dila gusto ang sinabi ng isa then after nun icancel na agad.",
            "Being kind to own another instead of aggressive.",
            "Not having children \nNot getting married or even in a long term monogamous partnership",
            "Being blunt and honest (While still being respectful and not hurtful, ofc) ppl waste so much time and energy hiding and sugarcoating stuff, lying, and holding back that it's annoying atp. And what's more annoying is that 99% of the time we can tell the truth by reading body language or tone or expressions or gut feelings... Etc. So why not get it over with and just be honest and blunt when we both know the truth?",
            "people not related by blood living together or near by as family",
            "Politicians telling the truth",
            "I totally agree with the farting. Mine is darker. People need to normalize talking about death. It was mentioned on 30 morbid minutes and they said that it's really taboo in the US. People need to get their stuff organic for when they do eventually die because we are not immortal and for some reason, we think that we are",
            "Nah wth, I don’t wanna smell your ass. Go to the bathroom to fart you uncultured animal.",
            "Aw no, poor guy. \n\nidk why farting is seen as weird but burping is acceptable. it's just air coming out of a hole.",
            "I wish society normalized having a companion animal. Any animal as long as it helps their owner. I wanna be like ash with his Pikachu.",
            "Men showing emotion.",
            "Farting",
            "Im with you on farting, and I strongly stand behind women's nipples. \n\nIt's summer and godddamnit it's easier to leave my B's out. I have smaller breasts so I don't have to wear a bra for support but everyone stares at my nipples poking through the shirt! Like men don't have nipples! We have nipples in common godddamnit! You know how they look! Why is there a stigma around the nipples but juggs can hang out as long as you don't see the nipple it's okay. It's madness it's like something out of middle-ages.\n\nMind your own beeswax leave my nubbins alone.",
            "Shitting yourself as an adult.\n\nI’m a proud IBS victim and I will proudly admit to shitting myself because I have no fear of being looked down upon.\n\nFYI it’s being about 8 months with a few close calls in between.",
            "1. traditionally female cloth on men  \n2. traditionally manly cloth  on women",
            "Violent crime.",
            "Kindness",
            "Female sexual pleasure - not just for the sake of turning on a man, but for its own sake. I feel like everybody thinks it's normal for a guy to masturbate, but for women it's like really? You do *that*? Also, teenage boys are taught to embrace their sexualities and go ahead and wank as often as they need but teenage girls are only taught about their reproductive system:( We need to do better than that!",
            "Nakedness. Like, when you're taking a shower at a gym or something. Or bathing naked in a lake. Or nakedness in art. Stripped of the sexual context, just appreciating the beauty of the human body in all forms and shapes.",
            "I wish there wasn’t this big, bad omen around choosing to be single. Idk If I’m the only [christian] guy that doesn’t want a relationship, PRIMARILY because of hereditary mental illness. AKA Bipolar Disorder.\n\nI feel like I’ve been through the mud with most people I know. The most common statement being: “There’s someone for everyone.” Well, look at the gender population statistics in the world and see for yourself that this is complete nonsense. I know they just want to show me support. But I don’t want my potential children to bear the same fate as me. \n\nAnd for some reason, I’ve had to explain to EVERYONE I’ve ever encountered, that knows me well enough, why I want to be single. Goddammit, we were BORN SINGLE. Why can’t It be normal to stay that way. Even if I only made it my choice 10 years after I realised that things would never change. Make living life to the fullest normal again. Thanks 🙏",
            "Saying how you feel instead of having to act cool and nonchalant. Why do I have to act like I don't care about things and people when I do",
            "for me it would be being nerd about a topic, like it's okay to be overly interested in something and can stay on it for days on end.\n\npeople always make fun of anyone's interest if it's different than the trends or so, we are allowed to like stuff just because we find it interesting not everyone have to like it at some point of there lives to make it normal to do first.",
            "Wish passwords were OPTIONAL on online accounts. I get irrational rage when I have to reset  PW's I never wanted in the first place.  I will sign a waiver. Like, I'll take that chance that someone could break into my Pinterest account.",
            "Small fart fine but a diabolical loud fart within 2 feet maybe not",
            "Not tipping like the rest of the world!",
            "Accepting that capitalism doesn't work and being called a 'Commie' isn't a bad thing.",
            "Normal hygiene and/or normal body looks. For example, most of the time, you don't have to shower daily. When I say it to others, they think i'm a smelly homeless person. Like what?! Also, teeth. It's important to brush your teeth and take care of them. Even when you do all that it's not white. People act like you're disgusting, just because i can't blind you with my teeth doesn't mean i'm a monster. I think the media and celebrities are at fault for that one. And just the overal weight, colour, race and other bs that's a barrier needs to go away and be normal.",
            "Having 2 girlfriends.",
            "Not eating 3 meals a day. Just because I’m quite skinny and don’t need to eat 3 meals a day, it doesn’t mean I’m anorexic… and just because I eat more than you in one sitting in that 1 meal I eat for the whole day, I’m also not bulimic (when you don’t know I haven’t eaten all day)",
            "Man body shaming for baldness. Destroys my ego everyday. And it’s so normalized, nobody cares. Even the ones that think they are nice laugh about stupid jokes like \"your getting old, the valley gets bigger up there\"",
            "Kissing our dads",
            "not needing to wear makeup or get plastic surgery or get body shamed.",
            "Being quiet",
            "People having to walk the talk.\n\nYou sell infant formula? That's the one you give your kids.\n\nYou sell food? That's the same you eat.\n\nYou're a politician? You use exclusively public services, and wages are tied to established minimum wage.",
            "Critical thinking",
            "Minding your own business",
            "Putting rapist in prison",
            "Putting rapist in prison",
            "Being a nudist.\n\nIt’s extremely difficult to get friends to go to a nudist resort with me. There’s nothing to be afraid of, it’s only weird for maybe five minutes your first time.",
            "Poly amourous life style. People do it anyway… just don’t tell their SO…🙄",
            "Talking on public transport, especially the train - the best conversations happen on them",
            "Eye for an eye.",
            "Еating everything you see.",
            "Women's pants having pockets, like actual usable deep pockets.",
            "\"Autority System\"\n\nToday, no one respect anyones opinion or advice anymore, offcource if its not someone with 1000000 subscribers or whatever. \"Wise\" influencers telling you to be yourself, but no one knows who they are. This is why everyone cares only about money and no understanding who they want to be as personalitys and what part in society they ACTUALLY want to be . Future of society is in danger, as system will be crashed because of it. \n\nMr.Chaos, welcome.",
            "Body hair on women. Shave if you want, don’t shave if you don’t want.",
            "Not having kids, or not getting married. I feel as though I can love someone without signing papers and such, and I just don’t want the added responsibility of kids",
            "no fr… my stomach will hurt so bad if i hold in my fart",
            "Acceptance that men who are balding are not sick and they don't  need a cure /treatment.",
            "Being single is a choice, not failure to find someone to share life with",
            "Not being rude to staff because you can't control yourself",
            "Being a virgin.\n\nWhether you choose to be or not, it really shouldn’t be shamed or made fun of to be one….. Especially when it shouldn’t be anyone else’s business in the first place aside from your partner. \n\nCome to think of it, that’s another thing that should be normalized (or re-normalized): Kinda wish we could go back to keeping quiet about our sex lives. Not completely to a point where we don’t talk about sex at all. But I don’t have to hear about how good your partner is in bed like you’re trying to sell them off to me at an auction.",
            "Coming up to someone asking \"hey wanna be friends?\"",
            "Women's body hair. Aging. No make up. ",
            "Well, mine is also farting, but like, different.\nIf I were that dude, I would have let it rip shamelessly, with my own thundering laughter, in hopes of either making others laugh, or just intimidation, depending on the circumstance.",
            "Common sense,\n mistakes are the best teachers, \ndifficulties in life are beneficial to your growth as a person,\nand nobody needs brand new everything all the time. \n\nTo name a few.",
            "Wanting to be alone. Throughout the years, I've been asked questions like \"Why don't you socialize?\" and \"Why don't you want to go out with friends?\", but I've never asked anything to them. Should I?",
            "ASD and ADHD",
            "Wait what? You want farting to be normalized? Just what?",
            "Not faking social shit to ‘be polite’.",
            "Listening to your story, I'd add more to the list\n- teeth naturally becomming yellow\n- body smells\n- average boop and dick sizes\n- objectively not being a 10/10 when it comes societies view of beauty (like seriously, especially in the digital age of filters this is gradually becoming very dystopian)",
            "Crapping in the street, easy and good for you",
            "Had my kids sports day this week. It was a hot day on freshly mown grass and it was kicking my hayfever off. Thankfully I’d been to visit a relative in hospital so I had a mask in the car. It worked wonders and I was able to enjoy breathing without all the allergy nonsense but the looks I was getting was remarkable.",
            "Can we just eliminate social norms all together?",
            "Using a service and not being contacted or having to fill out a questionnaire on the service after.",
            "Being asexual to a degree. I need to feel comfortable with you to be intimate… still being single while everyone else is in a relationship. I choose not to bring girls around just so you can judge me",
            "* be in online meeting\n* sense fart approaching\n* mute microphone\n* fart\n* unmute microphone\n* notice microphone is muted\n* realize I unmuted, farted, and muted again",
            "SA and CSA Victims should be allowed to speak up about what they have been through without getting victim blamed or ridiculed. Stop blamng victims for something that isn't their fault.",
            "Debate without hate",
            "Not wanting to marry at a young age",
            "Helping each other!\n\nIt’s about the only thing that could make trickle down economics work and everyone pitches in helping each other along. \nNo I don’t mean communism. I just mean being decent helpful human beings.",
            "for humans to feel safe and free to be the human being they need to be instead of the robots we are indoctrinated and conditioned to act like.",
            "Atheism",
            "Farts will always be funny.",
            "Not trying to normalize everything.",
            "unshaved legs for girls at summer. \nI know, I shouldn't care about opinions, but it's hard when every third is staring at you like at pterodactyl :D",
            "Not telling people my birthday. I’m not a female and I’m not a kid. I don’t care to be the center of attention, it’s just another day",
            "Allowing delivery tips to be asked for ONLY after delivery. Not even the option for tipping before delivery. That way everyone can live with peace of mind that their food isn't getting messed with all bc they planned on tipping cash rather than on the app but the driver is to psycho to wait and see.",
            "nipples. womens nipples. Man, i hate wearing a bra. If my top has the support needed, then thats all im using. My BF mentions EVERYTIME, \" i can see ur nipples\". Like, yes, my boobs have nipples, who knew lol",
            "I wish we could fight it out. There's a few people, who just need a good smack in the right time. But they would be the First to call police(some are pd🤷) and as much as I want to smack sense into them, it's not worth the charge.",
            "Bullies being held accountable.",
            "Accept that heroes save lives, they don’t take them. Killing some dude that is defending his family and his country from illegal invaders does not make anyone a hero.",
            "Being single.",
            "Being overtly friendly to people, just because. \n\nI am constantly left feeling like a weirdo because I just randomly talk to anyone around me like we're old friends. \n\nIn my mind, regardless of how often I'm reminded that reality isn't like this, I feel like we're all passengers on this trip through life, the very few bodies of atoms making molecules, making biological machines, with a consciousness at the helm. \n\nCompared to all of the atoms in the universe that DON'T have any consciousness, I think that's pretty special. \n\nBut, I am often reminded that others don't have the same feeling about those around them, and am made to feel a little ashamed by \"I don't know you, don't talk to me\" responses to me. My wife is also often embarrassed by my friendliness, randomly talking to strangers around me. \n\nI understand it isn't the norm, but I forget that any time I see someone who is experiencing the same thing that I am, sharing the same space and time. \n\nIt is what it is, anyway... I guess I'll just have to be content with that. To be fair, there are also a TON of people who respond positively to the sudden chatter or comment on the situation. I'll take the good with the bad, I suppose. :D\n\nBy the way, nice to meet all of you!",
            "Seeking to understand and obtain knowledge from bugs rather than killing them.",
            "The right to say \"Sorry, I'm not interested in this conversation\" and obligating the other person to respect that person's wishes. I shouldn't have to stand there and listen to you rant about something I'm not interested in hearing and I am not rude for speaking up about it.",
            "Making cars that don't turn unless the driver uses a turn signal. I just saw this in a different post but I think it's brilliant hahaha",
            "Not talking when you don’t wanna, like you ever just chilling and someone keeps yapping, and you just needa reply “damn that’s crazy” or “fr? Damnnn”.\n\nNormalise just not replying, hate it when people don’t get hints 😭",
            "Women topless where men are also allowed topless",
            "Bet he felt like he was on The Voice when you all turned",
            "Wearing headphones at a restaurant",
            "Being vegan. I care about animals and advocate for their rights, what’s so fucked up about being against torture just because it makes you uncomfortable?",
            "Add corporal punishment for the crimes of the elite. Public shaming and harassment if you're rich and pay less tax percentage than the middle class. You work in congress and commit insider trading? Tar and feather. You steal Public funds? You go to the public plaza while people throw rotten tomatoes at you for a few hours. You're a judge and accept a bribe? You get to walk around downtown ringing a bell and alerting the public of your crime. All this on top of the normal sentence.",
            "Burping, Im not gonna hold it in, It may not be normalized but im sure as sh!t gonna do it anyway and normalize it as much as I can",
            "More open to critical topics such as suicide. You shouldn't have to be afraid of being locked up just because you tell the wrong person that you're having suicidal thoughts.",
            "There's a reason people don't like it when you fart.",
            "Caring about the environment. So often seen as a fringe or extreme view. Excuse me for wanting breathable air and drinkable water.",
            "Obesity/ weight gain by choice.",
            "Not paying for stupid sh*t",
            "Politics retirement",
            "Consensual fighting. I mean for fun. I took up HEMA some time ago and sometimes sword fighting turns quickly into wrestling. When it happens with someone I trust it's really fun.\nI think it's pointless when adults are so against children fighting in any way. Violence is not okay but children (usually boys) like to fight for fun and I can't see anything wrong with it. It's a opportunity to teach them about consent and being able to stop oneself immediately when the other kid tells them to.",
            "Matriarchy and peace.",
            "Being fit should be normal. Being overweight and obese is way too normalised today",
            "Fashion, it’s so annoying that you get judged on based of what I wear, so what I wanna wear a eyeliner as a man why do you give a fvk?",
            "Body hair on women",
            "Give a minimum amount of money to those most in need. There are always more than a few cents left over for anyone and it would be good to take advantage of that to support those most in need.",
            "That it’s OK to withdraw yourself from company if you are an introvert without ppl getting offended or thinking they did something to upset you.",
            "Not wearing a bra",
            "I honestly believe that BDSM should be more normalized.  People shouldn't be shamed for these things, so long as all involved are consenting adults.",
            "Getting resources to those in need and homeless people.",
            "I wish it was more stigmatized actually",
            "Rest. Not working until burning yourself out.",
            "Therapy. Whenever you mention your therapist, people get uncomfortable. Therapy is a positive thing to do for self improvement, why are you getting all weird about it?",
            "Going to therapy.",
            "Sweating. We are approaching summer, I cannot suffer from 45°C degrees AND worry about the appearance of the clothes I'm obliged to wear",
            "- Telling people they're boring and stop that conversation right there.\n\nOf course, you don't have to be blunt, but man... some people have nothing interesting to tell, and as much as I want to be polite, it feels like nails on a chalkboard to keep listening.\n\n- Living with your parents when you're 30+. There are so many reasons people aren't able to move out and \"just buy a house\". Especially with current cost of living. But people still act like you're doing something utterly wrong and unacceptable. Sure, carry your weight in your parents household, help with chores, pay \"rent\" stuff like that. But I just wish people would not give you looks \n\n- Latebloomers. Not everyone has his career figured out in his early 20s. Some people find their purpose and calling later in life. Plenty of famous people didn't get famous or succesful in their 30s or 40s.\n\n- Open conversations about drugs. Not everyone who does drugs is a homeless crackhead. There is something like recreational use. And yes, I will acknowledge that not everyone can handle that. But for some reason, someone doing E at a festival gets the stinkeye, while those same people get wasted on alcohol every weekend. Normalize it, or judge everyone equally for all drugs (including alcohol; and I dare even say caffeine)\n\n- I was gonna say tipping, but I'm not from the US,  so that entire concept is foreign to me already. But from what I've heard/read from it... yeah, normalize giving waitresses (and waiters of course) a normal pay. Tipping can be a nice bonus if you're doing a good job for a customer, but it shouldn't be a make or break factor to pay your rent or food",
            "Farts will always be funny. I don’t think they were laughing at him, but rather the fart itself.",
            "Trying to fix something instead of just throwing it away to go buy a new one instead. \n\nThe amount of things I’ve accidentally broken and was told to “just go get a new one instead of trying to fix it” like BRO you won’t even let me play with the idea of fixing it on my own???  Do you do this with relationships??\n\nIt irks me especially so when it’s something that’s needs like- tape to be fixed.",
            "Listening to sad music doesn’t mean I’m depressed… okay maybe a little but it shouldn’t be stigmatized",
            "People are different but all worth the same",
            "Intelligence.",
            "EUTHANASIA\n\nEven for people on prison....for anybody. Even peiple with life sentence or just 10 years.\n\nEuthanasia should be a human right\n\n\nAlso migrating is a human Right. And it should be normalized.",
            "Farts will.always be funny but they are also antisocial.",
            "minding their own businesses, god life would be beautiful",
            "Not forming your opinions based in what social media shows you. \nDeveloping personal opinions from life experiences and seeking out and learning information from proper/ multiple sources. \n\nIt’s weird talking to people that have no clue what they are actually talking about, and speaking to several people in a day that speak about the same “reel” ect that they saw and forming whole thought processes and opinions\nBased on a social media “opinion”\nThat could\nOr\nCould or could not be factual.\nDo some digging people. Learn and seek answers in several places before you form an opinion.",
            "Telling the truth. \n\nPeople lies all the time for the dumbest reasons and then there are problems untouched and hidden. Like. Tf. Tell the damn truth, “offend” people by saying what they do wrong. \n\nHopefully people will notice their mistakes and fix them. Or get mad and make up easily. It’s embarrassing how little tolerance and how much ego people have",
            "Being naked",
            "[deleted]",
            "Healthy and science based handling of drugs.\nNow it’s culture based wich is risky and stupid imo",
            "not wearing a bra. for the people who have small small boobs is completely useless and i don't think that a  nipple can make any kind of damage or offense.  obviously, everyone has the freedom to choose if wearing it or not, without shame.",
            "Not tipping , free public toilets,Farting,Naked female breasts!",
            "Farting is a natural thing. I say fart. It is not toxic.",
            "Normalize setting and respecting personal boundaries in all types of relationships",
            "I think everybody should be able to laugh at farts including the farter! Whoever dealt it- lightened the mood in a room full of blowhards! My friend was teaching a yoga class and her boyfriend totally let one rip during happy baby. We were all silent until he let out a little “pardon me.” And we all cracked up together! 🤭😜😝🤪",
            "Shitting in public toilets",
            "That sex work is work",
            "Just doing nothing. Some days I just don't want to do anything, whether it's working, socialising, chores etc I just want to sit on my butt and not feel bad or like I'm being unproductive.",
            "Kindness, empathy and decency",
            "Pissing in public.",
            "Not having kids.\n\nI don't want kids, I won't regret it, they're expensive and annoying.",
            "After the lgbtq+ and mental health awareness stuff, I reckon my next answer would be silly walks",
            "Dad's are parents too.\n\nSo many people, usually women, see a dad with his kids and comment, \"On babysitter duty?\", \"NO, I'M PARENTING\".",
            "STOP TIPPING CULTURE",
            "I wish it was as normal to wear a masquerade costume or extreme clothing. I would be so much happier if I could buy new guittar strings from a panda or groceries from a neon rave-butterfly.\n\nBut I would honestly hate if everything would smell of fart tbh",
            "Differences between people of all sorts...",
            "anything that is not the absurd beauty standards, being mean, not having sex, just living in our own paces instead of being ‘too late in life’. so many more.",
            "Normalise not tipping in general and breaking the tipping culture",
            "Silences. Sometimes I just don’t want or don’t know what to talk about and it’s not awkward yk i just don’t know, there’s no awkwardness in silence unless you kinda force that feeling",
            "The left and right of politics getting along instead of fighting between houses and blaming each side when they can fulfill their promises not because of either side but because of the upper echelon of society. Whatever those nasty conspiracy theorists call the 1% or whatever because they just make it look like either side is stopping the other when it’s probably just whoever has all the cash. Banks have a lot of cash? Don’t know if it’s the banks but it ain’t the left or right more or less they both want progression and just have different t views on how to get there. Both sides should get a long. Because really they want the same things and try to do the same things just differently.",
            "For real! I hate how many companies ask for tips that hadn’t before, like some corporate fad. “What if we guilted our customers into willingly giving us more money? Genius! This will definitely have no negative consequences! Gimme the green 🤑” ugh 🙄",
            "Agreed. There are 5 groups I tip for: servers in a sit-down restaurant (sorry, mcdonalds employee, you don't make the cut), bartenders, food delivery drivers, barbers and uber/taxi drivers. If you fall outside of these 5 groups, you aren't getting a dime over the price of what I'm getting.",
            "This is an American problem",
            "this is normal just in america. in europe it’s not",
            "They're TRYING to normalize tipping for every service. Personally, it's making me do more things for myself because I don't want to be bothered to figure out tip or deal with annoyed and apathetic staff at many places anyway.",
            "I live in northern Mexico, where tipping at restaurants is normalized. I don't like it, but sure, it's tolerable, I'm used to tipping.\n\nLast spring I visited New York City. I loved the trip, but god damn it was I offended by the tipping. The absolute worst one was when I was asked by a tablet for a 10% tip on an $8 USD basic coffee that was ok, on a place that barely had any sitting space, and they fucking made me get up and put my dish and cup separately on an organizer. I don't mind doing stuff like that if it's the norm there, but don't make me add a tip because of some \"service\" when there is none!",
            "That seems to be a North American issue.\n\nI went to Europe and my god the service is so good in some places and they will REFUSE tips if you bring it up.",
            "That's only the US. This is already normalized in a lot of places. Some countries even find tipping offensive.",
            "None services NEED a tip. If ur business cant function with paying livable wages tour business sucks and shouldnt exist",
            "No service \"needs\" a tip at all, by definition tips arent obligatory, that would be called a tax",
            "Already normalized even in the U.S. It's a pretty small minority of services.",
            "Society, or the USA?",
            "Dude I was at a festival the other day and just got a bottle of water from a drink stand and I was handed a tip tablet. The water was $1.50 minimum tip is $0.22. The attendant told me that “you should tip service workers especially since we are in a recession” YOU JUST GRABBED A WATER BOTTLE OUT OF A COOLER?",
            "Agree. My friend and I were bank tellers and jokingly said we should put tip jars at our windows",
            "So don't tip.",
            "I'm so thankful that people here in Germany are very direct. If they need something, they tell you.",
            "100% agreed.",
            "Move to Germany or one of the Nordic countries. It's a haven for people who dislike small talk haha\nBut in all seriousness, many cultures have already normalized it :)",
            "I’m the newest employee at my job so I still have occasional questions about how we operate and do things. The dude who is most knowledgeable also will talk your ear off so I only go to him as a last resort",
            "!!!",
            "Define small talk. Can I at least ask how your days been before I make a request? \n\n1. I walk up to you, ask how your days been, and then comment on the weather or some other mundane crap before asking for a dollar?? \n\n2. Give me a dollar!",
            "Eye on what I'm after\nI don't need another friend\nNod and watch your lips move\nIf you need me to pretend",
            "This is so true. Very painful to listen to.",
            "Yea thats an american thing . Most of europe goes straight to the point",
            "Ive had people get mad that I just get straight to the point, Idc are you helping or not because no need for wasted time",
            "agree. tbh its so awkward to talk about something which is nonsense and doesn't relate with anything",
            "I think you should start asking that.",
            "Oh this one yes. I’ve always been a quiet person and growing up my whole family would be like “why are you so quiet?” “What do you think about all the time” meanwhile my mom can talk nonstop, my dad can, and my oldest brother can talk a good bit too. Like I’m thinking about how I wish you guys would be quiet.",
            ">But they aren't asked \"can you shut it?\"\n\nI think you just don't notice because it's not happening to you.",
            "I'm not a really talkative person myself. People give me shit all the time about it , saying I'm rude. But I have nothing to talk about half the time. I'm only chatty with people I'm close to. If it's groups of more than 3 I have difficulty being talkative. I get really overwhelmed. I love it when people take the lead when they talk to me, certain people can help me out of my shell. My bfs roommate is cool in that regard because he's the type that says hello to everyone and his energy is warm and not intimidating. As well as a few clients at my work who come in and their energy and personality are bubbly and talkative. \n\nI also feel like the reason I'm not talkative is because I was told to shut up a lot as a kid. I was an only child so never really got to socialise much at home. I moved schools a lot so I was kind of alienated from my peers. When you're a kid and you get told things like children should be seen and not heard, it gets carried into adulthood. I only mentally realised I was an adult when I was 27, only then realising I don't have to be quiet or walk on eggshells around adults anymore, because I am an adult. Lol",
            "It’s called “listening”, Derrick, you should try it more often",
            "Yes, they are, I get your pain, but overly talkative people also get blamed for that, or get framed in a very narcissistic way.",
            "I get asked that all the time, I feel like saying because I don’t say very thought in my head, one lady i work with talks very loud and never shuts up. I’m quite get over it, I talk when I have to, I am perfectly  content not saying a word all day, when I told them that they looked at me like I’m insane.",
            "That’s the main checkbox for Finnish 🇫🇮 naturalisation. Helsinki is your spirit city.",
            "Should always answer with, \"you fill all the quiet voids...\"",
            "I absolutely say “please stop talking”. 😂😂 doing my part to normalize it",
            "I get asked all the time why I’m so quiet. What’s there to constantly talk about…",
            "Man ima be real, saying \"why are you so quiet\" is usualy a sign the person cares about your well being and thinks you may want to contribute to the convo, they may insist but in general the net good done for the ppl that are insecure is greater than the annoyences for yall\n\nAnd telling someone to s(tf)u is undermining a social exchanges that is already rare today, (also rude asf, how tf r yall so comicly evil)\n\nIn conclusion, these the facts, Fazit et sciens de diei:\n\nThere is something very human missing from this proposal",
            "Not all capes wear heroes",
            "NO CAPES",
            "Not a chance in hell. No more of my wife derriere to appreciate during the day? Get out of here!",
            "It is kind of insane that not consuming poison is something that needs to be justified.",
            "These are some of the comments I've received when I told people I didn't drink ranging from the age of 12 to 30;\n\n\"oh,well how do you have fun then?\" - heard too many times to count\n\n\"is it religious reasons?\"\n\n\"now you've said that *i* can't have fun now! You've ruined it!\" - I didn't even know this person, nor did I care.\n\n\"oh... Is it becayse you have a *whispers* problem?\" - this is my personal favourite becayse I was around 14 at the time.\n\nI'm glad now I'm in my 30s more people my age are choosing not to drink or at least to drink less, it makes it easier to just ask for a soft drink (but I do still get perverse pleasure out of making people make me a cup of tea or coffee at gatherings and bars) \n\nI've just never liked the taste or understood the point of getting hammered, so I never did it.",
            "It is even worse in your youth. Have been asked 5 times by the same dude over the the course of time that evening why I wouldn't even drink a sip.",
            "I’m the type to drink fruit juice while everyone else drinks alcohol",
            "Yeah it's funny that people think if you don't drink you're not fun. But like why do you need to drink to gain enjoyment? I can enjoy myself unaided by alcohol so who's really the one that isn't fun?",
            "The only alcohol I ever tasted was in liquor chocolates and that shit tasted like disinfectant spray. Fucking disgusting, actually tastes just as bad, as it smells. I cannot believe people like that shit",
            "That I can fit my whole hand AND wrist into, please!!",
            "YES. You don’t know how long I spend looking for clothes pockets in that actually look nice and then when I finally find something they’re FAKE or TINY and it’s pure torture. Especially whenever you see all of the lovely massive pockets in men’s clothing…",
            "i’d only stare bc u look so cool tho",
            "Yes! I'd love to casually wear more medieval-like clothing. Maybe not true medieval, but fantasy interpretations often seen in television today.",
            "frr, like let people be creative!",
            "As someone who loved to dress like a regal 18-19th man (nobody understood my choice of clothes), I could tell you more or less how to try to incorporate this in your outfit; perhaps, you might not dress up like an entire cowboy as a you wish but it's progress.\n\nHighlight which is the main pieces of clothings and how you can adapt it to modern fashion style? I know you say old fashion, but it's a replacement. I couldn't have pulled off a large coats with exaggerated clevets and extremely tight pants or the weird shoes with brooches, but I could adapt it to formal coats which covered my tights, tight-fitting leggings (not yoga pants btw) and boots.\n\nHopefully, this will help you!\n\n![gif](giphy|7AsKFHnTCM2YM)",
            "If I could afford it, I’d like to dress in ball gowns/met-gala type clothing. Elegantly everyday. The problem is: \n1.) i would be so incredibly hot(sweaty)\n2.) society. (But tbh if I’m rich enough to afford it, I’m rich enough to not care. #liveyourlife!)",
            "I want to wear a cape.",
            "I'm in the UK and there's an old man who lives near me who dresses like that. I think it's cool.",
            "This. Every day that I dont leave the house dressed like a noir detective from the 50s is a day wasted.",
            "Life has no dress code.\n\nThe only time you shouldn't dress exactly how you want is if you're in a situation where They're expectations affect You. Going to court? Put on a suit. Going to a situation where you're paying someone? Do what you want.",
            "Hat tip",
            "I learnt to just not care what people think. I used to wear cowboy boots and I live in England.",
            "Oh my gosh agrees, I would dress everyday like I'm going to the RenFaire if I could 😭",
            "Fashion: men wearing skirts. Kilts or otherwise.",
            "![gif](giphy|eKOe5R2gKg5UejLwtC|downsized)",
            "You mean second hand?",
            "Along similar lines.. using your old stuff unless there is a need for a new one. Like smart phones, watches. But this will be a dream, because this is bad for the capitalist economy.",
            "Good games are always decided in the second half.",
            "It's pretty fucked up, ain't it? We're literally mechsuits piloted by a lump of matter that's powered by chemicals and electricity, and people shame others when that lump of matter doesn't function properly. Drives me up the wall when people criticize things others have absolutely zero control over.",
            "…And to bounce off this: someone not needing to be in eminent danger in order to get help/services. \nAlso not waiting until disaster strikes to take something seriously or get more help for it.",
            "I feel like there is some nuance here to expand on. While I totally agree that people should not be ashamed for having mental health problems, they should also not be proud of it. What they should be proud of is if they sought help and are now getting help to deal with their mental heath problems. \n\nI'll give you an example from my own life. I was bullied a lot by my older brother when I was younger, and he beat me up a lot. This year, finally, at the age of 45, I started getting therapy for it, and it's been very helpful as a way for me to explore it and process my thoughts and feelings about it all in a safe environment with a trained professional. \n\nThat's the key point. If I hadn't got therapy and I merely said, \"My brother bullied me and it left me mentally damaged,\" that might not really help anyone. Sure, other people who were bullied could relate, but we might all just wallow in our mutual self-pity. Whereas by saying how therapy has helped me, it might cause other bullied people to seek therapy and get the help they need.\n\nI honestly wish I'd got therapy for this many years ago. Psychotherapy should be a standard thing that everyone feels comfortable seeking out if they have any mental or emotional issues bothering them. It should also be free to people on low income.",
            "But you do have a reason and it's because you feel like it. That's the only reason you need.",
            "You would love Seville in Spain! They dress so well…",
            "This is truffle season\nTom Ford tuxedos for no reason\n\n\nJiggaman",
            "And six hour days",
            "Afternoon naps!",
            "I agree with you for everything but the first. \n\n>Bring back dueling for serious personal insults. You better be prepared to defend your bullshit with bodily harm. \n\nHow do you know if many people won't use it as an excuse to get rid of people more easily and illegally, I could shout at someone that they called my mother a cow and killed them but it was a coworker who I didn't like but he deserved to live. (As long as he didn't make something awful, he wasn't just my cup of tea)\n\nEven if he hadn't die, odds of live-changing injuries sucked anyway.",
            "Isn't that normal? Hehehe",
            "People that can't cope with silence frustrate me. It's completely fine to be sat in a car journey for X amount of time and not speak. \n\nIt's different rules if you're in a pub or bar, because if you're all sat around a table in silence that is awkward but there's tonnes of times where silence is fine.",
            "Please don't tell me I have a new social rule to worry about, my bladder is tiny lol",
            "Wait? That’s not normal?",
            "That all depends on what you are doing. If you're drinking beer for a couple of hours it's only normal that you go and pee.",
            "Drunk doesn't care",
            "I'm sorry. That sounds so uncomfortable. Farting is still one of the few politeness rules people uphold for some reason even though it's a totally normal bodily function.",
            "You should instead reply with \"I am one with the farts and the farts are with me\".",
            "Problem with that is with the reactions girls get.",
            "They totally can!! Just don't make direct eye contact, and approach at an angle, basically making a spiral trajectory.  Once you're close, come up to his side by facing the opposite direction as him and then offer your hand with the back of your hand facing up. Let him sniff it for a few seconds. If he seems receptive you can try scratching him gently on the shoulder, then go from there. \n\n\nGood luck!!",
            "Also asking for help as someone with chronic illness. Like someone could have a short term back injury from an accident and everyone will be happy to help them, but if your injury is long term, and won't ever heal, it suddenly becomes so much harder to find help. If your disability lasts longer than a couple of years, people suddenly treat you as if you're just not trying hard enough and if you tried harder your chronic disability would just disappear.",
            "I unfortunately have to wear a bra because I'm nearing 60 and I measure as a 42/Long. So I gotta roll them old girls up and stuff em into C cups so I look like a hot young 50 year old.",
            "I have a huge chest and hate bras. Although if bras my size were affordable, it would probably be more comfortable with a bra than without. But it's near impossible to find bras my size, and when I do find them, they're *always* like four times more expensive than I can afford to spend. And while a well fitting bra could be more comfortable than being braless, being braless is a thousand times more comfortable than an ill fitting bra.",
            "I haven’t worn a bra since 6th grade and I only wear skin tight tank tops now",
            "Be free.",
            "i only do cuz my boobs are big and ...lordy that summer under boob sweat isnt worth it!",
            "C cup girl here too, and I've always been more comfy not wearing any tbh either",
            "Lmao @ knockers. I love that you said that",
            "I had something similar happen to me. A fart popped out accidentally once when I was a kid. An adult told me I was dirty in front of about 6 other kids. I grew up believing I was dirty and unlikeable. Affected me well into adulthood.",
            "Your teacher was so immature! I’m so sorry she did that.",
            "Ugh, that was so unnecessary, on the behalves of both your classmates and—even worse—your teacher. I really hope you did better after you changed schools.",
            "I had a dad that would punish me for it. I have IBS and I vowed never to get upset at someone for that reason because of him.",
            "Honestly just kids being able to do this to a bully who was intimidating them would probably stop a few bullies here and there.",
            "No is a full sentence",
            "I mean you should want to become strong, one strenght is psychological honesty, self humanization and knowing how being open can make u stronger",
            "Same. I’m no prude. I don’t care what you do with your private parts. I don’t want hear about it. Let’s talk about something else.",
            "This has a little something to do with your friend as well..",
            "I think that's already normalized. How many times I've heard men with a type for short hair woman and women with an attraction for long hair men.",
            "I'm fairly certain that the average hair length on boys in my rising 6th grader's class is longer than on girls.",
            "To be fair, some of us don’t have that option anymore.",
            "Night owl discrimination IS a problem",
            "I have a circadian rhythm disorder, and society expects me to just \"get up in the morning\". It doesn't work like that when it's a neurological issue with no cure. I can't get a job because of it. Some of us can't magically stick to a 24 hour cycle.",
            "This. It sucks most when its not obvious, because usually people are quite understanding when they know what is going on, but when you can pretend to be a human almost well enough people sometimes give you shit when i am just doing my best.",
            "🤣🤣🤣  oh.  This is why I’m so glad I work from home. Far less chance of jail time. My last job had a very nice gym and I used it every day. Someone asked me, “why do you workout so much?”   \n\n“I workout for your health, not mine.”",
            "Once they go brown, they go to chipper? 😂",
            "I have two young boys, I see them trying so hard to be stoic... I don't want them to be stoic... It's ok to cry, I am here for them always and forever... \n\nI've actually instituted 'cuddle cups' into my house... Sometimes our cuddle cups are empty and need to be refilled, sometimes someone has a few extra cuddles left in their cup to share and sometimes, we just just get extra top ups in our cuddle cups... It's sounds childish, but hey, they will come and tell me that their cuddle cups are empty...",
            "I think the problem people find is when it actually is appropriate.\n\n\nYou have parents force feeding kids discussions about sexuality and if they feel like they are more a boy or a girl when they still don't understand why they can't have a cupcake for dinner.",
            "I would love it when someone said I'm trans, non binary or whatever and people would just not blink/care.  Hate reading about how families, friggin families, disown their kids for stuff.",
            "I just look at people who dress fancy because I think they're fabulous.",
            "Own those looks, babe! They all secretly want to do the same, but don't have the courage.",
            "Stay away from the escalator",
            "Do it fuck them all",
            "Isn't that normalized in most countries?",
            "Amen!",
            "Still get dirty looks in the American South for my lack of belief in God. It sucks. Sometimes it feels like coming out as an atheist can have the same ramifications as coming out as gay, if you're in certain parts of the world",
            "Thank you Jesus.",
            "Come to the UK lol",
            "Yes, it's the default state. It's not a system of belief, not an organization, not a religion, there's no membership, no rules, no fees, and there's no incentive to be atheist either. No shiny reward at the end. It's just what we are. You can't choose to believe in something supernatural if you don't.",
            "Yes.",
            "Yes, and if men cared about women's mental health, that'd be great too.",
            "I would just feel bad for an adult if that happened. I wouldn’t judge them.",
            "Well, it was dead silent except for the 1 person talking, so when it happened, it was the most random, all-of-a-sudden noise ever. It caught some ppl of guard, and while glancing beside me, I made eye contact with someone and their face was deep red from quietly laughing and I just couldn’t take it😭",
            "Well, I’m saying normalized in a way that if you were to fart in front of your family. You’re close, you’ve known each of them for your whole entire life, so if you were to fart, and it stunk, it would be a “hahaha ew” type thing and not a “haha I’m laughing AT you, not with you, and judging you” that’s what I think it should be like.",
            "I am almost 50 and have never worn makeup. Nobody comments - they know it’s not my thing. I just hate how it feels and life is too short. Try it!",
            "wait its not normal?",
            "Respectfully, no",
            "No thanks. Don’t wanna see that shit",
            "Came here to say this. If I never again had to put on clothes to go outside on a hot August day I’d be just fine. Heck, if I never again had to put on clothes I’d be just fine.",
            "with the way the world is today? no. that’s a horrible idea.",
            "As the parent of two adult children, no.\nI love my kids, I get along pretty well with them, but there is no way in hell I want to live with them.\n\nEdit. I do support them financially IF they require it.",
            "Oh god yes. No, I'm not super passionate about (insert boring old job here), and won't go the extra mile with a smile on my face because I truly love what I do. I'll do the thing for money, within reason. I'd rather not, though. That's real life.",
            "I know right? My hair is 4b/4c and I hate that people will think I look like a bum if I go out in a bonnet.",
            "So much this. They want so desperately for us to not exist, but like, my literal physical reality isn't something I can just decide to leave at home when it's inconvenient. We deserve the same basic human consideration as anyone else living in any other kind of body.",
            "Our local doctors offices have some small/normal size chairs and some extra wide chairs. I’m seeing this more and more. Our GP clinic also has two sizes of wheelchairs. Maybe it’s something we are moving towards.",
            "I think it's mainly the fact that larger usually means it's going to cost more. So businesses don't want to spend more money on fatter people.",
            "In Eastern European cultures \"how are you\" is a genuine question, not a greeting, and that's great.",
            "Shame because sometimes i DO care about how people are but my social anxiety makes it difficult to actually express that - i.e sometimes words just won't come out.",
            "I agree with this more than I agree with walking around nude. I mean, how are boobs a “private” body part? It’s like a man’s chest, just with extra tissue/fat. The difference between a woman’s boobs and a fat mans chest is literally nothing but the shape(if that). So honestly, what is the difference?",
            "Yes, I cover this in a previous comment.\n\nLol and I just noticed your username",
            "Heck no. Keep that one off the list please. 🤺",
            "Please don't do that around other human beings.",
            "We are guilted onto paying the wages the owners of the business SHOULD be paying. \n\nYou shouldn't have to tip for someone doing their job well, you should be able to keep money from those doing a shitty job.",
            "That’s a solid list and I’m on board for everyday services,  but please add boat crew to that list if you go on snorkel or dive tours on vacation, sure I’m speaking as a whiny former boat crew and captain but those guys serve your food, serve your drinks , make sure you are safe, guide you to the coolest shit, and do all the boating things to make sure the boat runs. A ten or a twenty per family helps immensely after a long day out on the water.",
            "What about salon services (eg, haircut, massage, manicure)?",
            "some will still try to start small talk with you just to ask the actual question.\ni usually just spit it out and don't try to cushion it up",
            "I live in Denmark and find lots of small talk in the stores and at work 😰",
            "Hello, can you give me a dollar? \n\nPolite, acknowledges the other person's existence and directly to the point.",
            "If you actually want to know. But if not needing small talk were normalized, you wouldn't feel awkward and it wouldn't be considered rude to just get to the point.",
            "In which scenario would you do that small talk like that?\n\nCause I just imagined the situation with colleagues at work. I greet them in the morning and may or may not have small talk according to how much I and the other person feels like. So your question how my day (or well maybe yesterday as it's just morning yet) has been would come at that point.\n\nBut over the day when I have a question or request or something, I just go over to them and get to the point immediately, no need to start a small talk every time we interact. For example at fridays we eat bockwurst normally and one colleague get's them for the rest of us and asks everyone if they want one. So she comes in the room, askes if we want one, we answer and that's all. Sometimes we may do a bit small talk like talking about the weather cause she's about to go outside to get them, but not that much small talk if at all.\n\nDoesn't mean there's no small talk over the day, but just when people feel like, not as necessity for being polite or something like that.",
            "I preface my emails with \"I hope you are having a good day\"\n\nIt acknowledges the human, without forcing a useless conversation about how cold/hot/wet/dry/unpredictable the weather is and how we feel about it. \n\nMost of the time it is a quick \"I'm good, hope you are too\" them straight into an answer. However with some closer colleagues it's has prompted them to reach out for a more personal discussion so that I can support them",
            "Chatting bollocks first is law in the UK.",
            "If they don't, I will ",
            "I'm usually thinking, how can some people talk about so much useless nonsense?",
            "I agree as well I'm super quiet so My family is like that too",
            "Yes and it hurts a lot, being someone who loves to Express feelings through words it's really painful when people who u thought were quite interested in your talk start telling everyone how much u blabber.\nI feel like no one should be tagged as talkative or quite",
            "Ah man",
            "![gif](giphy|cZUU06p00qz8k)",
            "And how you can feel left out because you decided not to drink said poison",
            "Tell them you are a vampire and cannot consume regular human food or drink",
            "Funnily enough, if youve tasted disinfectant spray that likely was alcohol too!",
            "PREACH",
            ">That I can fit my whole hand AND wrist into, please!!\n\nWhen there's already things inside it",
            "Thanks man",
            "Honestly I would too. Cowboys are awesome",
            "Wholesome ",
            "While I love the look of that, the closest I’d go to that is something akin to Hobbits, maybe a cloak",
            "....id dress like I lived at the RenFaire lmao elf ears n all",
            "Yes!",
            "No one is stopping you from dressing like you want though!\n\nI mean, getting stared at is annoying and I'd rather not be stared at either if I had the choice. But I value my personal expression of style more than I value not being stared at, so fuck that shit.\n\nAlso, I noticed it really depends on the place how stare-y people are: in the NL for example, in Utrecht or Den Bosch I feel the most judged and stared at, but in Amsterdam no one seems to give a fuck because there are three other people on my bus dressed even crazier than me. In Utrecht I sometimes feel a little self conscious about dressing to flamboyantly, but that feeling disappears when I come in Amsterdam and turns into regret for not dressing *more* like my true self!\n\nReally, there's no point in letting the responses of your surroundings dictate how you dress every day.",
            "This is the way! Nowadays it's become completely accepted to mix and match whatever you want. You can wear a full on suit but replace the vest and shirt by something completely not suit related. I started walking around in paper-bag-style pants + t-shirt + gilet and no one bats an eye",
            "On the contrary, I'd like if it was acceptable to dress like you do at home, everywhere. (Shorts+baggy shirt at work would take my productivity to another level ngl)",
            "That would be so cool man",
            "Leaving a room would be so awesome!",
            "I have a poncho now too, maybe we should both just say fuck it",
            "no, second half stuff, like second half of your biscuit/sandwich - cheaper and good for the environment lol",
            "Some people pull off working 6 hours a day (or less) because their job is shrouded in mystery.",
            "Dueling used to be legal for defending personal honor and existed in Europe and USA until about 150 years ago.    \nThere were set rules for duels and people had the option of picking their weapon of choice and all.   \nYou could not just challenge anyone without showing cause or witnesses.   \n\nThe reason I picked duels is because false allegations against people have become ridiculous in recent times. And just mere allegations without proof from 20+ years ago can destroy careers and lives.   \nFalse allegations will only stop when there are real consequnces.",
            "lol don’t worry about it girl 😭 I wish I didn’t worry about it",
            "They always accuse me of being pregnant or pretending to need to use the bathroom",
            "Well I never drink beer I just chug a bottle of water at once 😓",
            "Yes it is normal but altho i do not mind the sound one makes i rather not smell one or make others smell my fart.\nSome of us create some searious \"mustard gas\".",
            "Imagine what reactions guys get then :/ Besides, I honestly never seen a bad reaction to a woman approaching a man - but I haven't seen many, so I absolutely might be wrong",
            "The imagery of this is ✨golden✨ 🤣",
            "42 long That was my dad's suit size.",
            "coming from a b lmao",
            "Some redditors may not believe you and request proof or something ",
            "I don't wear one past 4 pm",
            "r/beetlejuicing",
            "technically, most of us baldies could have long hair, but obviously we shouldn't.",
            "Most western countries? Probably. Most countries all over the world? Probably not",
            "Not really.",
            "You're welcome.",
            "Never understood why do people put gender in this thing as well",
            "Sadly not everyone emotionally developed past the primary school bully phase.",
            "I would absolutely loudly shame anyone who laughs at them though!",
            "That’s when you:   \nA) blame the dog or   \nB) say loudly, “Who stepped on a duck?!”",
            "Just reading this made me laugh. I do feel bad for the farter through.",
            "is that not how it is in your family? I'm really sorry your family is so unkind. This is low key some abusive shit you're talking about.",
            "I used to fart at my brother. Mum thought was hilarious",
            "Jst so u know. It gets worse when naked in hot temparature...excessive dehydration , skin rashes sun burn skin cncer nd wht not........ Better to wear light coloured cotton clothes which are flowy",
            "if women were to walk around topless they’d be sexually assaulted even more so than they are now. saying this as a women btw.",
            "Hahaha! Yes. This is what I live for. I'm glad you came here for your Farteducation. Lol",
            "Yes, exactly this! It’s the employer’s job to pay their staff a living wage and guilting the customers into willingly giving up money for that is absurd.",
            "Exactly. I no longer do it. If more people followed suit, it wouldn't be a problem. But people are too embarrassed to ",
            "I don't mean to be a dick, but \"doing all the boating things to make sure the boat runs\" sounds like it's an essential part of the job and not an extra I should be tipping for. \n\nLikewise if food etc is included in the presumably not trivial price for the day out. If it's not mentioned and it's there, like when your Uber has sweets and a bottle of water, then sure, I'll happily tip above and beyond.",
            "I've never had the opportunity to experience anything like that but if I did, I would certainly expand my list. I definitely do not make enough money to experience anything like that though lol I barely make enough to pay my rent and put money in my savings every month, nevermind expensive foreign vacations lol\n\n I kinda just listed the 4 most frequent situations in which I tip lol",
            "When we moved we gave the moving crew we hired a very nice tip. But we also had a lot of heavy Woodworking equipment (like a 700 lbs planer) that needed to be moved. Those guys did it like Champs with a smile on their face. We felt genuinely humbled by their service so we left them with like 100 each.",
            "This is the way. No manipulative behavior.",
            "But why are they drinking disinfectant spray?",
            "Yep! Cause how dare you call it a pocket otherwise!!",
            "My wife has a couple of dresses like that because it definitely has an effect on me. She occasionally gets rid of the kids and goes full on cosplay for the evening which is always fun.",
            "Is it cut in half or does the second half come with bite marks?",
            "Okay, now I agree with you completly, I've thought on unregulated dueling but this sounds good as long as a proper research to confirm it is bullshitty allegations and that both parties are willingfully to cooperate, then, okay.",
            ">The reason I picked duels is because false allegations against people have become ridiculous in recent times. And just mere allegations without proof from 20+ years ago can destroy careers and lives.\n\nSure that have. \n\nRegardless, dueling largely means you can get away with being a dick to anyone, so long as you're good with a weapon.",
            "I feel like along the same lines, but to a lesser extent, we should just normalize being able to punch a guy out if he is saying shit. Since I was a kid it was always “zero tolerance” so even if I was being bullied and one day finally fought back, we got punished equally. I think the assholes know this is the case and that most people won’t retaliate with violence to it gives them carte Blanche to say whatever the hell they say. If they were worried about getting socked in the face, and no assault charges being filed, they may reconsider their words.",
            "This historical part is not entirely true, and why dueling ended.  Dueling was always class oriented, one could not challenge across classes. But there was no requirement for proof or witnesses to the insult.  Good duelists who enjoyed bullying or killing people would challenge on minimal or no pretext.  One could decline, but it was social suicide to decline.",
            "The reaction not being bad doesn't mean it's the reaction the woman wanted :)",
            "Women get a different kind of reaction. They often get dismissed because the approached men feel emasculated. \n\nAsking women to approach men, while men think it's their \"job\" is just not an ideal situation.",
            "I only tip if someone was genuinely nice to me/us, then I WANT to tip. But other then that, and **especially** if there is even the slightest insinuation of \"expecting\" a tip, forget it.",
            "As per your wish, I will go for the former, you?",
            "Well, but that is not exclusive to one gender, being rejected is always a bummer :(",
            "Am I picky if I want to know who the person that the bite marks belong to before I decide?",
            "What I meant is that men can be rejected, but are not called derogatory terms when trying because of societal expectations about how should a woman behave and how making the first step is experienced as emasculating to some men. Those are deeper problem for a women than a man not being attractive enough and not getting the women above his league that he wants (It's always the least attractive men who have problem approaching women).",
            "![gif](giphy|2yDhH9fwWd06k|downsized)"
        ]
    },
    "Boobs are so freaking heavy": {
        "title": "Boobs are so freaking heavy",
        "score": 179,
        "url": "https://www.reddit.com/r/RandomThoughts/comments/1dlmf8n/boobs_are_so_freaking_heavy/",
        "content": "",
        "num_comments": 175,
        "comments": [
            "If this submission above is not a random thought, please report it.\n\n  \n# Explore a new world of random thoughts on our [**discord server**](https://discord.com/invite/8tEqw3ZWQV)! Express yourself with your favorite quotes, positive vibes, and anything else you can think of!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RandomThoughts) if you have any questions or concerns.*",
            "not all heroes wear D cups lol",
            "“You know when you grab a breast and you feel it and it feels like a bag of sand?”",
            "Fun fact: The strongest piece of clothing is a bra..... It supports 2 milk factories 😂😂",
            "       Boobs are so F-in annoying sometimes (I’m a girl)",
            "Yes they are!!",
            "Back problems are coming soon near you",
            "Boobs are so fricking heavy and man do they hurt! Mine currently feel like water balloons filled with hot water and Iam so over it.",
            "Yes, they are! :D Whenever my partner lifts them a bit up from behind or front, I honestly lose balance for a moment. :D",
            "Totally agree.\n\nI notice them most these days when I'm jogging.\n\n(Male 50 years old)",
            "Not mine :(",
            "I like boobies.",
            "Yep😑 but they’re also squishy built in stress balls",
            "Hm as an B cup I cant agree.",
            "I would be happy to hold them for a while for you.",
            "I have chronic back pain as a guy and I'm very glad I don't have boobs!",
            "Not all of them lol",
            "Definitely not mine.",
            "Ha .. especially when they fake 😒",
            "If only I could share a piece of my boobs with my friends, i will.",
            "fr but you don't realise it until you lift them up and feel the difference",
            "Maybe consider a reduction",
            "Yeah and what is with the head?? So heavy and the neck so narrow!",
            "Yes. A 34DD chest is fucking heavy.",
            "Its okay light boobie people, because we don’t have increased back problems, every big booba woman I know would like them smaller. I haven’t worn a bra in 10 years, big booba can’t do that, those two punching bags would be floppin in the wind knocking out small children and elderly people.",
            "I have heard that comment....",
            "Whew!! I mean 😮‍💨",
            " Facts",
            "Agreed",
            "Who's gonna carry the boobs.? \n- David Goggins.🫡",
            "Are they really?",
            "I'll hold your boobs for you",
            "So true!!  But having a good bra can really make a difference!!! ♥️♥️♥️",
            "My ex was HH… I’m convinced I was concussed occasionally during our shenanigans.",
            "I was an Aussie 10J before pregnancy, had a reduction to a 10FF. The bastard things grew back, now saving for a second reduction, instantly lost just under 4kg after first op which still left me stacked, but manageable.",
            "🎵got them heavy boobs, heavy boobs, dense like dying stars🎵",
            "I'm just here to offer you my support",
            "I'll give you a hand if you need it.",
            "The amount of boob jokes here do not seem to understand the back pain problems",
            "Not all of them....",
            "Really? I'm gonna have to do some \"research\"",
            "Yes.  I have extremely large breasts.  They are heavy.  I hate them.",
            "I'm a DD",
            "It depends",
            "For real how do women do it. I lifted my gfs boobs from behind and my back hurt in like 5 minutes",
            "Yup. I’m a J cup and my back is so fucked up by them that I don’t even know how to relax it anymore. And they’re always in the way when carrying stuff or reaching cross body or lying down or any time really ",
            "Highly annoying when you jump",
            "You’re not wrong. Some even come with a whole human attached.",
            "I was just thinking I want to cut off\nMy boobs",
            "wtf is G?",
            "Gigantic?",
            "More heavy the better from my perspective.",
            "Ya I cross dress some times and man those puppies. Holy crow I'm glad I get to take them off after.",
            "And hot",
            "Tell me about it. F cup and back and neck problems.",
            "If any woman is having difficulty with her boobs. I can help by holding them up with my hands.",
            "Uh, thank you for this information? Lol",
            "Can you back up this statement?",
            "Your right some wear G cups",
            "Stop ruining my dream",
            "Bag of sand…?  Have you ever felt a breast before, man?",
            "I hate bras.😂🤣",
            "r/angryupvote",
            "Thank you for carrying them",
            "it is a very heavy burden.",
            "As a member of men, we can happily hold them up for you",
            "Look at it this way.  You have extra training resistance when doing crunches",
            "You both know how to have fun don’t you",
            "😂",
            "![gif](giphy|7mQbDHkoSsWl2)",
            "Win-win",
            "i *was* going to say something inappropriate, but i don't think i will.\n\ngood luck with your boobs, sir 🫡",
            "You are beautiful regardless 😎",
            "I think you will find that most men don’t care. \n\nBig. Small. Flat. We just like ’em, regardless.",
            "Real",
            "I'm feeling a bit stressed today...",
            "Not the hero we wanted, but the hero we needed.",
            "I had to do physiotherapy sessions for my upper back because my boobs grew too fast when I was a teenager. Imagine my facial expression when the doc told me that my back pain was caused by my boobs lol",
            "With some D cups, I would have the posture of a shrimp",
            "Lol",
            "Yet when i offer to hold them up i get called a creep smh.",
            "Same! I’m so tired of this weight 😮‍💨",
            "Dense like dying stars lol. I mean if they were that dense they would suck us in.",
            "Sounds like you should being doing it more then 😂",
            "Sucks to hear that, hope you can find some relief from the pain.",
            "Bruh, the sub is called *random thoughts*, what were you expecting?",
            "🤨",
            "My ex had G cups and one day we did the water displacement weighing test out of boredom for each of her boobs.\n\nEach boob weighed around 1.3kg 🤯",
            "Anything D and over can get you a state healthcare covered breast reduction here. It's an actual health hazard.",
            "I was a 34G in high school. 17 years old, 180lbs, 5’2”. The back pain was awful.\n\nBy age 20-21 I got down to 110-115lbs and still a D cup, but I’d say half the cup was extra skin.\n\nI’m 35 now, breastfed two kids and I’m back down to 110lbs and a sad, saggy D cup.\n\nThese titties have been through a lot 🤣",
            "I thought the last one was F. One learns something new everyday lmao",
            "have you ever felt a bag of sand?",
            "Its a quote from 40 yr old virgin movie",
            "Have you?",
            "Me too 😂😂 I only wear one if I absolutely have to. I went to a wedding at the start of June wore one then but haven't worn one since 😂😂",
            "Thank you for thanking us.Its a real pain!!",
            "\"Share the load\" - Samwise Gamgee",
            "One of my favourite things ever, I have J cups and they are ridiculously heavy even for me to hold up. When someone else holds them up for a bit I feel like I could die of happiness",
            "If you did your loved would dim. Especially during pms, my boobs are tender asf",
            "Ha ha you have mistaken me for someone who wants to do crunches.",
            "An ex of mine had H cups at 19... I know she had back pain, but she never mentioned it because she knew mine was much worse. I always tried to tell her both matter. Hers was a constant ache and mine's a fear of muscle spasms that are intense when they happen \n\nBecause of her, I've always had sympathy for well endowed women",
            "well a tip for you is not to offer and instead just tell them you're sorry for this problem and if they need anything",
            "Hey, I upvoted the post, I just thought it was funny how wacky the post is.",
            "It’s a struggle my dude",
            "Mine weight around that too and it's not fun for your back",
            "A strong back is a healthy back :)!",
            "It’s keeps going up the alphabet lol",
            "My best friend has HH breasts and a backache!",
            "A nice, big, booby bag of sand",
            "😂🤣",
            "A movie about a default redditor.",
            "Same!!😂🤣Let the girls be free!!Wee !!",
            "Not even to work or shopping",
            "We’re just trying to help so you can live pain free",
            "Well im not allowed to ask but just putting it out there that i wont say no.",
            "I'll be glad to hold them",
            "![gif](giphy|l3q2wBNtZ24k1v1Pa|downsized)\n\nI love Crunches.  They’re delicious!",
            "Thank you then! I have a constant ache like her too. It’s a pain in the ass honestly\n\nI am so sorry for your pain too",
            "well sorry to hear that they can cause you so much discomfort. If there is anything i can do let me know.",
            "A better solution would be to not ask. People might be shy to ask for help!\n(Obvious sarcasm)",
            "One must imagine G cups owners happy",
            "a friend of mine (dont know the cup size though) had breast reduction surgery and had wonderful results. no backache anymore.",
            "whoa",
            "uh oh! a friend of mine (dont know the cup size though) had breast reduction surgery and had wonderful results. no backache anymore.",
            "So real, when my back doesn't hurt, it's a miracle 😫",
            "J cups here.  Extreme back pain.  I HATE them and can't wait to get a reduction.",
            "Speaking my language",
            "Braille nipples?",
            "I think you mean redditor mod. lol",
            "In hot weather I fold my t-shirt up underneath them to absorb the sweat. I never remember my mom or aunts doing that. But I'd be too uncomfortable 😂😂",
            "We thank you for your service 🫡",
            "Do bras not offer any bit of comfort? Do they not save frim back pain either? Do they worsen back pain with heavy ones?",
            "I had to quit working due to a neurological condition. And I get groceries delivered.",
            "exactly like that",
            "I am not",
            "I had 5.5 lbs removed from my chest, it is amazing to just breathe without that weight there.  And the shoulder pain, gone.",
            "I have J cups. It sucks but I'm nervous of surgery more.",
            "Girl! *hug*",
            "You poor thing!",
            "is it safe to do a breast reduction?",
            "Have you tried losing weight? I can't imagine most of that is breast tissue.",
            "It says DONT TOUCH, ask me how I know...",
            "😂🤣",
            "If your boobs are on the large side you can roll up a hand or tea towel and leave it in the underboob. Same effect as the t-shirt minus the sweat stains on your shirt.",
            "Sorry to hear",
            "Hubby doesn't shop for you",
            "It was a reference to Camus' \"one must imagine Sisyphus happy\"",
            "Why are yours g cup",
            "Same",
            "The hot ones are.",
            "Fair enough, I am afraid of surgeries as well. My consciousness will be gone and I will lie there motionless...",
            "a friend of mine (dont know the cup size though) had breast reduction surgery and had wonderful results. no backache anymore.",
            "I mean.. they were H cups when I was 150lb with a BMI of 22, so only one cup is due to weight gain.  But thanks I guess.",
            "Good tip. Thanks 👍",
            "It's ok. I mean, I loved my job. I was a healthcare assistant in theatres. But I couldn't avoid de-sterelising things",
            "I'm single. Every once in a while I'll ask my son to pick up some bits at the shop. But I've been divorced since 2014. And I'm happy that way.",
            "Sisyphus would like smaller cups, just more of them.",
            "loser energy",
            "You sound like a very pleasant",
            "I'm a goddamn joy to be around 😂😂",
            "I bet sweet loving and  hilarious",
            "My reddit page hadn't scared you away"
        ]
    },
    "Anyone else wonder if the colors you see are the same as everyone else?": {
        "title": "Anyone else wonder if the colors you see are the same as everyone else?",
        "score": 34,
        "url": "https://www.reddit.com/r/RandomThoughts/comments/1dlrzv9/anyone_else_wonder_if_the_colors_you_see_are_the/",
        "content": "Think about it\n\nThe only reason I say that something is red is because I was taught at a young age that whenever I saw that color, I called it red. You could be seeing what I would call green or blue or whatever but still call it red because you were taught that whatever color you are seeing is red.\n\nI understand the whole thing about measuring light waves determines the color and such (sort of), but still. The names of the colors are just words that could be literally anything. I could teach my daughter to say blue when she sees yellow, green when she sees purple, etc. And if no one ever corrected her, it would change nothing about the world. You feel me?",
        "num_comments": 18,
        "comments": [
            "If this submission above is not a random thought, please report it.\n\n  \n# Explore a new world of random thoughts on our [**discord server**](https://discord.com/invite/8tEqw3ZWQV)! Express yourself with your favorite quotes, positive vibes, and anything else you can think of!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RandomThoughts) if you have any questions or concerns.*",
            "I am more curious about what my dog sees tbh",
            "Is it a random thought if it pops up a lot on Reddit?",
            "I have thought the same thing…\n\nI mean maybe that’s why we have favorite colors\n\nWhat I see as “blue” and call “blue” is my favorite color\n\nBut maybe you see “purple” as a “blue color” and so to you, you say you like “purple” when in fact you like the blue color",
            "\"this is a made up word\"\n\"all words are made up\"",
            "I was thinking that what if everyone else sees entirely different colours to you. Not seeing your red as blue or whatever but if everyone else sees an entirely different colour spectrum, consisting of colours you couldn't possibly imagine",
            "I see slightly different colors with each eye. Who knows which is correct?! Perhaps neither!",
            "I'm pretty sure this isn't the case purely because of emotional connection to colours. Everyone knows blue to be calm and nice, and red to be either angry or romantic. That association alone tells me that we all see the same colours. The thing we all see differently tho is shades of colour",
            "My father is red-green colour blind. I know for a fact that I see colours very diffretly than he does.",
            "I’m slightly colorblind. I have trouble distinguishing greens from yellows and browns from oranges",
            "This concept is called qualia in philosophy https://en.wikipedia.org/wiki/Qualia",
            "There’s a great app called Pawspective. It shows you how they see colours. Game changer when I buy him a new toy!",
            "That is, they like your blue color",
            "But my favourite colour changes so surely we don’t just all have the same favourite colour",
            "I read it somewhere that the Sky we look at is actually violet and appears to be blue coz of the way our eyes work",
            "But is that connection intrinsic or because we’ve been taught it?",
            "I believe it's intrinsic because we all have the same emotional reaction to colours, despite having been taught it or not. For instance, if u walk into a glowing blue room, you'll feel very calm. But if u walk into a glowing red room, you'll feel hesitant, maybe a little paranoid, you'll be a little more aware. Our bodies all have the same reactions to the same colours because of the colour they actually are, not what we might perceive them to be. \n\nWe also understand blue to be sad, as in saying to someone \"You're feeling blue\", or yellow being happy. That's impossible to all be on the same page on if it wasn't an innate reaction that's the same in all of us"
        ]
    },
    "Sometimes taking extra precautions to not be creepy, makes a person more creepy. ": {
        "title": "Sometimes taking extra precautions to not be creepy, makes a person more creepy. ",
        "score": 37,
        "url": "https://www.reddit.com/r/RandomThoughts/comments/1dlrein/sometimes_taking_extra_precautions_to_not_be/",
        "content": "",
        "num_comments": 13,
        "comments": [
            "If this submission above is not a random thought, please report it.\n\n  \n# Explore a new world of random thoughts on our [**discord server**](https://discord.com/invite/8tEqw3ZWQV)! Express yourself with your favorite quotes, positive vibes, and anything else you can think of!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RandomThoughts) if you have any questions or concerns.*",
            "Walking behind a woman or girl in the dark, and saying (or calling) 'I'm not following you - you're safe' - well......",
            "Have this all the time. I’m a big guy no I’ll be wandering along and look up and notice that there’s a woman walking ahead of me at night and think “maybe I should make some more noise so she doesn’t think I’m sneaking up” (I walk very quietly normally, so I get told a lot). \n\nAnd then I think maybe that’s creepy, so I figure if I overtake her that will mean it’s less scary as I’m no longer following her.\n\nAnd then we are both running and it all just gets a bit weird.\n\n/s",
            "You can’t win can you",
            "You're not responsible for someone else's paranoia.",
            "walking behind women irl...trying so much not to sniff imagining \"what if I was a pervert?\" I almost sniff people. help. :-)",
            "Reminds me a few weeks ago I was alone after a late night music event walking to my car and when I found it and got in, before shutting my door, a man (who was before with a group of 3 women near me) goes “you sure you’re going to be okay?” and touched my window. At the moment I thought he was just trying to be helpful but once I shut my door I felt creeped out by him doing what he did and didn’t know what his intentions really were.",
            "... True.. just cant win ever xd",
            "Just be yourself and you won’t be creepy.",
            "I think the best way to solve this situation it´s to pop your phone and pretend to be talking with your mom, GF or any women.",
            "Still preferable to actually stalking her, at least 🙃",
            "Also the knife I have is for my kitchen's cutlery set.",
            "Don’t try just make sure you look boring and generic incase they record you"
        ]
    }
}