{
    "Bei Fragen zu Verschwörungstheorien: r/VTbetroffene": {
        "title": "Bei Fragen zu Verschwörungstheorien: r/VTbetroffene",
        "score": 11,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dge11z/bei_fragen_zu_verschwörungstheorien_rvtbetroffene/",
        "content": "Liebe Mitglieder von r/Ratschlag,\r  \n\r  \nwir, die Moderatoren von r/VTbetroffene, möchten euch darauf hinweisen, dass unser Subreddit speziell für diejenigen gedacht ist, die Unterstützung im Umgang mit Personen suchen, die an Verschwörungstheorien glauben. Dort findet ihr eine engagierte Community, die sich auf genau dieses Thema spezialisiert hat und euch gezielte Ratschläge und Unterstützung bieten kann.\r  \n\r  \nSolltet ihr also Fragen oder Sorgen haben, wie ihr mit Familienmitgliedern, Freunden oder Kollegen umgehen könnt, die an Verschwörungstheorien glauben, laden wir euch herzlich ein, eure Beiträge direkt in r/VTbetroffene zu posten. Dort seid ihr bestens aufgehoben und trefft auf Menschen, die ähnliche Erfahrungen gemacht haben und euch besser helfen können.\n\n\r  \nUnser Sub verfügt auch über ein kleines [Wiki](https://www.reddit.com/r/VTbetroffene/wiki/index/), das viele häufig gestellte Fragen bereits im Voraus beantwortet. Dort findet ihr unter anderem wertvolle Buchempfehlungen zum Thema sowie eine Liste von Beratungsstellen im gesamten DACH-Raum, sortiert nach Region.\n\n\r  \nVielen Dank fürs Lesen und weitersagen.\r  \n\r  \nHerzliche Grüße,\r  \nDie Moderatoren von r/VTbetroffene\n\n&#x200B;\n\nHinweis: Dieser Post wurde in Abstimmung mit den Moderatoren von r/Ratschlag erstellt, um sicherzustellen, dass ihr schneller die passende Unterstützung findet.",
        "num_comments": 0,
        "comments": []
    },
    "Wo kann ich hin wenn ich weder Geld noch ein Handy habe?": {
        "title": "Wo kann ich hin wenn ich weder Geld noch ein Handy habe?",
        "score": 80,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dlstn5/wo_kann_ich_hin_wenn_ich_weder_geld_noch_ein/",
        "content": "Hallo alle zusammen.\n\nTut mir im Voraus erstmal leid falls ich sehr durcheinander klinge, das bin ich nämlich.\n\nIch (w16) hatte einen grossen Streit mit meiner Mutter (w46).\n\nEs ging darum, das ich mein Geld was ich bald brauche um eine Gitarren Miete abzubezahlen, ihr leihen soll damit sie essen kauft. (Es ist ende Monat und wir sind sehr sehr knapp bei Kasse und haben gar kein Geld mehr, nichtmal für essen.) Nagut, das ist ein kein Problem, aber sie wollte das ich unbedingt Poulet kaufe. Ich bin aber Vegetarierin und werde davon nichts essen und sicher nicht 13chf für etwas ausgeben was ich nicht esse. Meine Mutter hat aber eben gemeint das sie Tagelang von einem Poulet leben könnte mit meinem Bruder (m11). Ich will noch hinzufügen das wir Pasta, Reis etc... Zuhause hätten und sie diese Sachen einfach nicht essen will... Ich habe mich dann entschieden einkaufen zu gehen, habe ihr aber ausdrücklich voher gesagt das ich kein Poulet kaufen werde. Ich habe einen grossen Salat (Sie hat mich auch um den Salat gebeten) und eine Packung Reisnudeln gekauft. Als ich zurück kam, mache ich mir gebratene Nudeln, aber genug das alle davon essen können bestimmt so 2 Tage. Aber als ich fast fertig war, kam meine Mutter in die Küche und sah das ich Gebratene Nudeln machte. Mein Bruder freute sich davon zu essen, weil er auch sehr hungrig war. Meine Mutter hat mich dann gefragt wo das Poulet sei, als ich ihr dann sagte das ich keins kaufen war, ist sie total ausgerastet. Sie nahm die Pfanne voll mit Nudeln und spülte sie das WC hinunter, danach kam sie nochmal in die Küche und nahm einen Topf voll mit Bohnen (Sie kochte die gerade) und spülte auch herunter. Sie hat dann gesagt das niemand dann essen wird. Und hat mich angeschrien, ich bin dann in mein Zimmer gerannt und an mein Handy gegangen. Ich habe auf meinem Handy, all mein Geld, ich habe kein Bar oder eine Karte. Sie ist dann plötzlich in mein Zimmer gekommen und hat mir mein Handy weggerissen und es Versteckt, ich schreibe gerade auf meinem Schullaptop. Ich weiss nicht was ich machen soll, sie hat mir auch verboten aus meinem Zimmer zu gehen und ich denke sie würde mich schlagen wenn ich raus gehen würde. Ich habe wirklich Angst und weiss nicht was ich machen soll... Ich will wegrennen, aber habe nichtmal Geld für ein Zugticket oder eine Flasche Wasser, ich weiss wirklich nicht weiter. Ich habe auch keine Kollegen zu welchen ich gehen kann und weder eine Krankenkasse oder so, weil meine Mutter sie seit Monaten einfach nicht zahlt.\n\nIch muss einfach weg von hier, ich kann das alles nicht mehr.\n\nIch hoffe mir kann jemand hier weiter helfen.",
        "num_comments": 61,
        "comments": [
            "Schreib dem Jugendamt eine Email, besser bevor deine Mutter dir den Laptop nimmt. Schilder denen die Gesamtsituation, ganz offensichtlich sind das besorgniserregende Zustände. Sollte deine Mutter dich schlagen, dann gehst du aus der Wohnung und holst die Polizei. Offensichtlich lebst du nicht in Deutschland, aber hier bist du auch versichert wenn du der Krankenkasse Geld schuldest, zumindest für Notfallbehandlungen.",
            "Setz dich mit dem für deinen Kanton / Wohnort zuständigen Jugendamt in Verbindung. \n\nKeine Krankenversicherung und nichts zu essen, dass geht so nicht. \n\nWeglaufen ist aber auch keine Lösung, du würdest auf der Strasse landen und hättest noch mehr Probleme. \n\nVersuche zusammen mit dem Jugendamt eine Lösung zu finden. Ja, du kannst freiwillig in ein Heim gehen. Red mit dem Jugendamt.",
            "Du kannst dem Jugendamt auch schreiben. \nOder hier https://www.143.ch/\n\nDie können dir weiter helfen. \nDie Situation kann für niemanden so weitergehen. \nDeiner Muttee scheint es ebenfalls nicht gut zu gehen und sie braucht Hilfe. Aber sie ist nicht in der Lage dazu bzw. erkennt nicht die traumatischen Konsequenzen die sie bei dir/euch verursacht. Sie wird das jetzt nicht verstehen. Aber es ist dringend notwendig, dass ihr Hilfe braucht. \n\nDu schaffst das! ",
            "Ich arbeite beruflich im Kinder- /Jugendschutzbereich. Falls OP schreibt in welchem Kanton sie wohnt, kann ich  ggf. Kontaktdaten von Hilfeangeboten posten.",
            "Die Probleme sind nicht neu oder?  \nHast du Kontakt zum Vater?  Großeltern? Tanke Onkel? Cousin?  \nFreundin bei der du unterkommen kannst für eine Weile?",
            "Also das Amt geht natürlich immer. Aber wie sieht es denn in der Schule aus? Habt Ihr Vertrauenslehrer oder dergleichen? Eventuell können die dir auch helfen, falls du nicht zum Amt möchtest. Außerdem ist es bei sowas immer gut persönlich mit Menschen zu reden.",
            "Neben allem wichtigen und offensichtlichen was hier geschrieben wird mein Gedanke zum Geld-Thema: Solltest du dringend an dein Geld kommen müssen (zum Beispiel wenn du was zu essen brauchst), wird dir deine Bank anhand deines Ausweises und ggf. anderen Bankdaten die du hast sicherlich weiterhelfen können.",
            "An deiner Stelle würde ich mir mal Beratung bei der Jugendhilfe suchen. Sorry, das ist häusliche Gewalt.",
            "r/Digital_Streetwork oO",
            "Kompliziert.   \nAlso nach dem was du schreibst, ist das Verhalten deiner Mutter absolut toxisch.\n\nWas ich nicht weiß, ist ob diese toxischen Verhaltensmuster schon immer standard sind, oder ob das jetzt plötzlich aufgetreten ist.  \n**Du musst auf jeden Fall weg von deiner Mutter, genau wie dein Bruder. Und zwar dringend.**\n\nIn Deutschland wäre das Jugendamt Ansprechpartner.\n\nSollten diese Verhaltensmuster bei deiner Ma jedoch plötzlich aufgetreten sein, würde ich auch empfehlen, deiner Mutter helfen zu lassen. Ich kenne die Situation in der Schweiz nicht, aber in Deutschland gibt es einen sozialpsychiatrischen Dienst, den man zur Hilfe rufen kann.  \nSollten diese Verhaltensmuster standard sein, wird deiner Mutter wahrscheinlich die Einsicht fehlen, sich helfen zu lassen.\n\nDas liest sich wie eine schwere Lebenskrise deiner Mutter, in die ihr als Kinder mit reingezogen werdet.\n\nAus heutiger Erfahrung weiß ich, dass es keinen Grund gibt, sich so einer Krise als Kind oder Jugendliche/r auszusetzen. Das hinterlässt nur Schaden.",
            "Du kannst auch in eine krisenambulanz. Die gibt es meistens bei unikliniken und psychiatrischen Einrichtungen. Lass dich davon nicht abschrecken. Die Leute sind dort geschult, wie sie in solchen Krisensituationen zu handeln haben. Du kannst übrigens auch die 112 einschalten und im Notfall kommen sie mit der Polizei.\n\nBitte denk nicht, dass das übertrieben ist oder du die Ressourcen anderen wegnimmst oder du deiner Mutter damit schadest bzw andere Gedanken, die dich davon abhalten, es durchzuziehen. Du hast ein Recht auf unversehrtheit. Körperlich und psychisch! Deine Mutter hat die Verantwortung dafür zu sorgen und sie tut es nicht. Du bist auch nicht schwach doer sonstiges. Ich wünsche dir alles Gute!",
            "Polizei rufen .. und die Sache schildern .\nEs wird auch Inophut-Name  stellen geben.\nDas Jugendamt wird dann automatisch verständigt . \nSowas ist das allerletzte .",
            "Ich kenne mich mit dem Schweizer System nicht aus, aber wenn das Geld für Essen nicht mehr reicht, gibt es doch normalerweise Hilfe vom Amt? Da würde ich mich auch hinwenden, wenn ich Hilfe bräuchte.",
            "Das Jugendamt wird dir weiterhelfen. Wenn es eskaliert dann die polizei. Das Jugendamt wird euch nicht gleich ins Heim stecken. Die versuchen normalerweise deine Mutter und euch Kinder zu unterstützen und Hilfe anzubieten.",
            "Hoi OP! \n\nBin sehr bestürzt das alles zu lesen. \n\n143 anrufen oder zum Polizeiposten gehen wären noch eine Option. \n\nAm Montag eine Lehrperson einweihen oder zum schulpsychologischen Dienst gehen. Jugendberatungsstelle, wenn's eine gibt. \n\nViel Kraft!",
            "Kesb behörde vo dim Kanton.  \nDini Mueter chat kei Sorg zu dir und zu dim Brüder ha.\n\nSgäbt sozialhilf.  \nDini Määr muess über ihre schatte springe und hilf holfe, was sie aberr nicht macht.  \nKontaktier Dkesb",
            "KJND",
            "Probiers mau mit Schuälkollegä usw. für 1 Tag oder so chunnsch dört immer unger. Nächer hou dir hiuf aber nimm unbedingt di laptop mit. I welem Kanton bisch?",
            "Wie viele andere schon geschrieben haben- an das Jugendamt wenden, die helfen auch am Wochenende! Ich bin mit 16 auch in Obhut genommen worden und anschließend in eine Jugendwohngruppe gekommen. Das war damals nicht einfach aber das Beste was mir passieren konnte. Hab keine Angst davor, vieles lässt sich mit ein bisschen Abstand wieder einrenken. Außerdem ist das Ziel solcher Einrichtungen meist nicht die Familien dauerhaft zu trennen, sondern a) dir und deinem Bruder die Möglichkeit zu geben erstmal runterzukommen und euch zu erholen b) mit professioneller Unterstützung die familiäre Situation aufzuarbeiten und c) sofern möglich und gewollt wieder eine Annäherung an die Familie und Zusammenführung zu ermöglichen. Melde dich bei denen und schildere was passiert- auch um deines Bruders Willen der mit seinen 11 Jahren der Situation noch mehr ausgeliefert ist als du! Kopf hoch und Alles Gute für euch beide",
            "1.Das was deine Mutter macht ist nicht ok. (dass sie sich so provozieren lässt, weil du nicht kaufst, was sie wollte, ist ganz ehrlich ihr Problem. Das sollte sie lösen, dafur gibts Familienhilfen etc.\n\n2. Hab keine Angst vor Polizei oder Jugendamt, niemand \"steckt\" euch ins Heim. Bei eurem Alter (und der Überfüllung der Jugendeinrichtungen, schätze mal in Schweiz ähnlich wie Deutschland), versuchen die zunächst ALLES um eure Situation IN eurer Familie zu verbessern, anstatt euch irgendwo unterzubringen, Fremdplatzierung (\"Heim\" etc) müsstest du in deinem Alter schon eher aus freien Stücken wollen, bis das passiert.\n\n3. die Polizei ist verpflichtet zu helfen, selbst wenn sie dich \"nur\" an die zuständige Stelle verweist. Google die nächste örtliche polizei Dienststelle, geh dort hin, Schilder die Situation, lass dir helfen.",
            "Du schreibst jemandem den du kennst und die rufen die Polizei. Und dann kommst du erstmal bei Freunden oder Familie unter oder wenn du essen brauchst frag deine Nachbarn",
            "Du wusstest doch vorher, was passiert, wenn Du nicht das kaufst, was Du kaufen solltest. Und dann hätte es Fleisch und Salat gegeben und alle wären zufrieden gewesen.\n\nUnd wenn man kein Geld hat, dann steht die Gitarrenmiete doch wohl an zweiter Stelle.",
            "Oh je, fühl dich gedrückt falls du magst. Ich habe als Kind ähnliche Situationen mit meiner Mutter gehabt und kann dir nur raten dich mit dem Jugendamt und der Polizei in Verbindung zu setzen. Kein Kind, selbst wenn es noch so alt ist, sollte jemals Angst vor seinen Eltern haben müssen. Da was deine Mutter da macht ist absolut nicht in Ordnung und ich bin mir sehr sicher das sie dringend psychiatrische Hilfe braucht aber das ist nicht deine Aufgabe. \nHab keine Angst mit dem Jugendamt zu sprechen, die hatte ich in dem Alter jedenfalls. Vielleicht kommt ja auch eine Wohngruppe mit anderen gleichaltrigen in Frage. Das Jugendamt hat viele davon und ich habe mich damals sehr wohlgefühlt.\nAlles gute dir!",
            "Falls du kannst deinen Bruder nehmen und zu einer Polizeiwache gehen. Oder ggf. Auch zu einem Krankenhaus. Ihr seid beide Minderjährig und psychische Gewalt ist auch Gewalt. Auch wenn ihr vielleicht keine äußeren sichtbaren Schäden habt, leidet ihr ja dennoch. Ich weiß natürlich nicht, ob du es schaffst dich mit deinem Bruder rauszuschleichen, aber ihr braucht Hilfe. Wenn ihr dann erzählt was los ist, spiel die Situation bloß nicht runter. Das was ihr erlebt ist schlimm und je ehrlicher man ist, desto eher kann einem geholfen werden. Ihr werdet keinen Ärger kriegen.wenn ihr an solchen Orten um Hilfe bittet. Das war damals meine größte Angst, deshalb möchte ich euch diese Angst nehmen.",
            "Hat kein handy aber reddit\n\n.\nJa nee is klar",
            "Nein, leider keinen Kontakt. Auch keine anderen Familien Mitglieder in der Nähe...",
            "Ich war schon früher einpaar mal bei der Schulsozialarbeit wegen den Zustäden Zuhause hat aber nichts wirklich geändert... Ausserdem ist Samstag und Schule beginnt erst wieder am Montag",
            "Hab leider keine Bank :( Ich kann wirklich nur auf das Geld zugreifen wenn ich mein Handy habe, da es sich um eine Prepaid bezahlt App handelt (Twint Prepaid)...",
            "PS: Und wenn es total eskaliert, schnapp deinen Bruder, raus und ruf die Polizei.",
            "Eher u/Digital_Streetwork damit sie ihren Ping bekommen",
            "Inobhutnahme (In-[Obhut](https://de.wikipedia.org/wiki/Obhut)-Nahme)\n\n\n\nSorry, bin sonst nicht pingelig aber da ist alles falsch. Bitte nicht persönlich nehmen.",
            "Gibt es schon, meine Mutter hat mir auchmal gesagt das sie sich an die gewendet hat, aber ich weiss nicht ob man ihr glauben schenken kann...",
            "Danke, ich denke das warte ich tun. Ich will wirklich nicht zur Polizei gehen aber am Montag werde ich definitiv zur Schulsozialarbeit",
            "han ebe huere angscht zu kesb zgah... ich wött nöd in es heim, ich denk das isch no viel schlimmer... kei ahnig warum sie kei sozial hilf beanträgt, aber ich fühl mich so als würd ich sie go verpetzte...",
            "[deleted]",
            "Leb leider nicht in Deutschland :(",
            "Han kei kollege zum unter cho au ned würk schuelkollege... bii kanton zug",
            "Hast du den Text überhaupt gelesen?",
            "Post gelesen?",
            "Ich schreibe auf einem Laptop...",
            "Da hat die toxische Mutter ja alle Arbeit geleistet.",
            "Okay, dann schau mal nach Ämtern. Vielleicht gibt es auch so etwas wie Frauenhäuser oder Anlaufstationen.\n\nWenn es wirklich akut ist: geh zur Polizei. Die können dich erstmal beruhigen und dich in der Situation schützen. Frag, ob du Dort mit einem Sozialarbeiter reden kannst oder sie einen Ort kennen, wo du hin kannst.",
            "Hm okey :/ Ach man, ich hoffe durch die Hinweise der anderen kommst du schnell aus deiner Situation raus. Es braucht viel Mut und Überwindung sich diesen ganzen Dingen zu stellen, aber es wird ganz sicher nur besser werden!",
            "Ich kenne mich mit Twint nicht aus.. aber wäre es möglich das du auf deinen Laptop einen Android Emulator installierst, dich in die App einloggst und dein Geld an einen/eine Freund/Freundin sendest?\nDann von dort auf ein Bankkonto und abheben.",
            "Ich denke an dich! \n\nVielleicht hilft der sozialpsychologische Dienst mit einem betreuten Wohnplatz für Jugendliche. Ich denke nicht, dass du mit deinem Alter in ein Heim kommst.\n\nLängerfristig: schau dass du mit Schule, Lehre etc. unabhängig sein kannst (als Job Coach empfehle ich gerne auch die Berufsberatung). Geh in eine WG, mach ein Budget und baue die dann mit Arbeit ein eigenes Leben. \nSorge dir selbst so, wie du es dir von \"Eltern\" (als Konzept, nicht die realen Menschen) wünschen würdest! \n\nDeine Mutter braucht professionelle Hilfe, dein Bruder Unterstützung! Aber du musst primär für dich schauen!\n\nVielleicht würde auch dir professionelle Unterstützung helfen, bei allem was du erlebt hast...\n\nIch bin fast 40 und habe keinen Kontakt mehr zu meinen Adoptiveltern. Ich gehe meinen Weg. \nGute Freunde, ggf. liebevolle Partnerschaft (hatte ich mehrere, bin jetzt gewollt solo), ein guter Wohnort mit Arbeit, bescheiden aber schön leben, all das macht mein Glück. Kämpfen lohnt sich und wir sind es wert!\n\nIch wünsche dir von Herzen alles Gute! Bitte nimm alle Hilfe und Unterstützung von Aussen an! Melde dich auch bei einem Jugendzentrum, sozialen Gefässen für Kinder und Jugendliche etc.!",
            "Du bisch eh gli 18ni.  \nAber so chats nid witergah, din Brüder muess nu wachse de bruecht en gueti ernährig.  \nSheim isch nid grad die erschti Option.\n\nSuscht red mal mitemne Lehrer, es würdet dir unglaublich viel Lüüt hälfe wenn offe und ehrlich mit ihne wärsch.\n\nEs fühlt sich so ah also ob du sie verpetztesch, ja mag sie, aber das was sie macht isch unter allem.  \nIch bi mal inere ähnliche Situation gsi wie du, und zeinige was ich i mim läbe bereue isch dass ich nid früener schnurre uftah han, und dass ich mich nid früener gwehrt han.\n\nDkesb het  kei Interessi üch ines heim inezstecke wenns nid muss sie.\n\nBitte mach eis vo beidem:  \nLehrer alüte wo du guet magsch und dems problem schildere.  \nKesb alüte.\n\nDe Lehrer hilft dir sicher au am wucheend, kei scham.",
            "Sie ist aus der Schweiz, muss ja niemand verstehen ausser sie.  \nFür dich noch translated:\n\nKesb Behörde von deinem Kanton.  \nDeine Mum kann keine Sorge zu dir und deinem Bruder tragen.\n\nes gäbte sozialhilfe  \nDeine Mum muss über ihren schatten springen und sich hilfe holen, was sie aber nicht tut.  \nKontaktiere die Kesb.",
            "Komisch, ich hab nie Kontakt mit Schweizern gehabt, außer mal einen Krimi auf Schwizerdütsch geschaut, und ich konnte das ohne Probleme verstehen, was OP  und andere geschrieben haben, dabei wohne ich in einem quasi dialektfreien Teil Deutschlands.\nVielleicht mal dran denken, dass OP 16 und in einer sehr schwierigen Situation ist, bevor man sich über sowas aufregt.",
            "Geht eben nicht, man kann Twint nur auf einem Gerät haben und ich denke wenn ich wechseln wollen würde, müsste ich mein Handy haben",
            "Mini lehrpersone wissed das es zuhause nöd grad guet läuft... als ich es ihne und de ssa zum erschte mal erzählt han het es sich scho etwas gbessert aber sie war huere wütend das ich es denne gseit han... ahlüte isch kei schlechti idee aber lehrperson chan au nöd viel mache... no dazue han ich gar keis natel meh, aber merci für dine vorschlag",
            "Ich lese nur \"Kebab Behörde\"",
            "außer IHR\n\nSorry, nur Spaß, hat mich gefreut das zu lesen und verstehen kann mans auch mMn.\n\nGrüezi nach CH",
            "Für Twint brauchst du ja auch ein Konto",
            "Chasch ja de Kesb es Email schriebe.  \n  \nViel Glück und wehr dich geg dini Mueter, es isch eigentlich nid in ornig was sie da macht mit üch.",
            "Schrib dim Lehrer und frag in ob är dir öppis cha vermittlä. De weiss är bscheid und du bechunsch hiuf",
            "Nooo, hab mein Mittagessen vergessen und jetzt hast du mich zum Dönerheisshunger verflucht :')",
            "Grüezi *",
            "Es ist halt auch persönlicher, weil die  meisten schweizer untereinander auch auf dialekt schreiben.\n\nGrüessli gen Norden :)",
            "Nein, gibt Twint Prepaid was man mit Geld aufladen kann, braucht kein Konto",
            "Ich weiß, dass das eventuell keine Option für dich ist, aber ein Tipp von mir: Pfarrer/Pfarrerinnen haben für solche Fälle oft eine Notkasse, aus welchen sie einmalig kleine Beträge ausgeben können. Falls du in einer Kirche bist und Pfarrer/Pfarrerin  kennst oder weißt wo ein Pfarrhaus in deinem Wohnort steht (oft neben der Kirche), klingel dort und erkläre deine Geschichte. \n\n\n Woher ich das weiß: mein Mann ist evangelischer Pfarrer (aber in Deutschland, denke aber das ist in der Schweiz nicht anders).\n\n\nHier hat es viele gute Tips - du schaffst das!",
            "Das mit dem Pfarrer ist eine EXTREM gute Idee!"
        ]
    },
    "Woran erkenne ich (m31), dass meine Arbeitskollegin (w27) auf mich steht?": {
        "title": "Woran erkenne ich (m31), dass meine Arbeitskollegin (w27) auf mich steht?",
        "score": 87,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dlr7do/woran_erkenne_ich_m31_dass_meine_arbeitskollegin/",
        "content": "Hallo zusammen, ich brauche bitte mal euren Rat: Ich habe seit wenigen Monaten eine neue Arbeitskollegin und ich habe irgendwie das Gefühl, dass zwischen uns eine gewisse Chemie herrscht. Wir haben von unseren Stellen her viel miteinander zu tun, quatschen gerne über Gott und die Welt, lachen viel zusammen und verbringen eigentlich fast jede Pause miteinander. Ich denke ich habe mich ein bisschen in sie verknallt, da ich auch nach der Arbeit oft an sie denke und mich bei jeder Nachricht von ihr freue.\n\nDa ich im Arbeitskontext keine Grenzen überschreiten möchte, wollte ich euch mal fragen auf welche Anzeichen ich achten kann, die mir zeigen könnten, dass sie ähnlich empfindet oder ob das einfach ihre Art ist.\n\nVielen Dank schon mal für eure Ratschläge!",
        "num_comments": 172,
        "comments": [
            "Ich hab meinen Kollegen einfach gefragt, ob er eigentlich auch Lust hätte, mal nach der Arbeit mit mir ein Bier trinken zu gehen. \n(Wobei „einfach“ gelogen ist, ich war ein komplettes Nervenbündel und musste 3 Tage meinen Mut zusammenkratzen). \nEr hat direkt ja gesagt und sich Mega gefreut. Ist keine Beziehung draus geworden, aber mittlerweile eine schöne Freundschaft! :)",
            "Wenn ihr mal zusammen Feierabend macht, kannst du ja erwähnen, dass du tierisch hungrig bist und anschließend direkt was essen gehen möchtest und sie fragen, ob sie mitkommen möchte. Sowas fände ich unverbindlich und wenn sie nicht interessiert ist, wird sie es dir hoffentlich schmerzfrei aber subtil kommunizieren. Besten Erfolg!",
            "Ich hab sie gefragt, ob wir abends was trinken gehen wollen. Hat geklappt.",
            "Hier ein guter Guide  \n[https://www.youtube.com/watch?v=xa-4IAR\\_9Yw](https://www.youtube.com/watch?v=xa-4IAR_9Yw)",
            "Ganz ehrlich du fragst sie einfach ob sie mal Lust auf einen Kaffee/Spaziergang/… hat und lebst mit der Antwort. Da kannst du dir noch so viel den Kopf zerbrechen die Wahrheit wirst du nur so rausfinden",
            "Bruder, egal was du tust mach es verdammt nochmal nicht peinlich, das wäre sonst für den Rest eurer Anstellung die Hölle auf Erden 😀",
            "Frag sie mal ob sie Lust hat nach der Arbeit was zu machen. Das wär ja mal der erste Hinweis, ob sie lediglich an einer Arbeitsbeziehung interessiert ist.",
            "wenn sie beim sex die augen offen hat steht sie auf dich",
            "Zettel mit „willst du mit mir gehen?“\nJa [ ] Nein [ ] Vielleicht [ ] \nübergeben",
            "Respekt für das professionelle, erwachsene Verhalten. Leider kein Ratschlag von mir.",
            "Wenn du direkt vor ihr laut furzt und sie lächelt dich dann an dann findet sie dich nett.",
            "Golden Rule: don't fuck the company",
            "Stromberg sagte: Tauche deinen Füller niemals in Firmentinte",
            "Vielleicht aber höchstwahrscheinlich nicht.",
            "Oft gibt es aber auch keine exakte Grenze. Genau so wie du dir unsicher bist, ob sie mehr will, kann sie sich auch unsicher sein.\nWahrscheinlich fragt sie sich das gleiche, ob du auf sie stehst, aber traut sich nicht mehr zu machen. Du kannst versuchen eure Beziehung in eine romantische Richtung zu lenken (Essen gehen o.ä. nach Feierabend) und wenn sie nicht interessiert ist an mehr, wird sie das hoffentlich kommunizieren.\nViel Erfolg!",
            "Hast du mal beobachtet, wie sich sich anderen gegenüber auf der Arbeit verhält? Wenn du andere Muster als bei dir siehst, könnte das ein gutes Zeichen sein.\nOder wenn ihr in einer Gruppe von Kollegen steht, ist sie zu dir geneigt und spricht eher mit dir oder erwähnt dich?",
            "Ich habe meinen Partner bei der Arbeit kennengelernt. Bei einer Feier auf der Arbeit hat es gefunkt. Danach habe ich Gründe gefunden, um mit ihm Kaffeepause zu machen. Irgendwann habe ich meinen ganzen Mut zusammengenommen und ihn beim Kaffee gefragt, ob wir das Gespräch am Abend fortsetzen wollen. Wir sind jetzt fünf Jahre zusammen, aber ich arbeite mittlerweile woanders (nicht seinetwegen).",
            "Das frag ich mich auch, weil ich oft höre, dass sich viele Paare auf der Arbeit kennengelernt haben. Vielleicht war das in der Generation unserer Eltern einfacher..",
            "[deleted]",
            "Hallo,\n\nes gibt da theoretisch einige Merkmale (z. Bsp. über Deine Witze lachen, Nähe suchen, mit ihren Haaren spielen), die jedoch erstens nicht immer leicht zu erkennen und zweitens letztlich doch unsicher sind.\n\nWas ich ungünstig finde:\n\n* \"*verbringen eigentlich fast jede Pause miteinander.*\" Das ist eine Aktivität unter Freunden, nicht beginnenden romantischen / sexuellen Partnern. Passt Du nicht auf / beeilst Dich nicht, sieht sie Dich womöglich sehr bald als \"guten Freund\".\n* *\"Ich denke ich habe mich ein bisschen in sie verknallt, da ich auch nach der Arbeit oft an sie denke und mich bei jeder Nachricht von ihr freue.\"* Das spricht dafür, dass Deine Gefühle weiter sind als Eure Situation.\n\nWas Du tun könntest: Sie fragen, ob sie mit Dir ausgehen möchte, und zwar idealerweise a) nicht während der Arbeitszeit / beruflichem Setting und b) auf eine Art und Weise, dass es auch  noch als platonisches Treffen unter Arbeitskollegen interpretiert werden könnte. Also eher \"Hast Du Lust aufs Public Viewing heute Abend?\" statt \"Magst Du mal was trinken gehen?\".\n\nViel Erfolg!",
            "Lade sie auf einen Kaffee nach Feierabend ein.",
            "Punkt 1: all das was sie macht heißt, sie findet dich sympathisch, heißt aber NICHT, dass sie romantisches Interesse hat.\n\nPunkt 2: zuerst muss das was zwischen euch ist nicht-arbeits-Boden erreichen. Frag sie, ob sie nach der Arbeit was mit dir Essen will oder ob sie am Samstag/Sonntag zu diesem Fest/Event/whatever in der Stadt gehen will. Wenn ja, hat das privaten Boden erreicht. Heißt aber immer noch NICHT, dass sie auf dich steht.\n\nPunkt 3: unternehmt ein paar mal was privat, sag ihr, dass du sie magst und schau wie es ab da weiter geht.\n\nPunkt 4: es gibt kein \"Beeil dich, sonst Friendzone\". Entweder sie mag dich und findet dich attraktiv oder eben nicht.\n\nPunkt 5: don't fuck the company. Und wenn du es versuchst und es schief geht, dann lass du dich versetzen. Denn dann hast du eure Arbeitsbeziehung beendet.",
            "Naja du kannst sie ja mal fragen ob ihr abends was unternehmen wollt. Ich mache auch ab und zu was abends mit Kolleg*Innen, auch ohne das jemand auf jemanden steht. Aber vielleicht für dich eine gute Idee, um mehr Zeit miteinander verbringen zu können.",
            "Dont tip your pen into company ink.",
            "Don't fuck on the job. Klingt wie ne ausgelutschte Binsenweisheit, ist aber was dran. Quelle: Erfahrung",
            "Don't do it bro",
            "Männer haben schnell das Gefühl dass es knistert und die Frau auf den Mann steht. In 90% der Fälle ist das falsch. Einfach nichts machen. Wenn die Frau Interesse hat, dann zieht sie das auch durch - keine Sorge.",
            "Ratschlag an dich:\" Ist dir deine Ruhe lieb, ficke niemals im Betrieb\"",
            "Never fuck the company!",
            "Naja, auf der Arbeit ist man gezwungenermaßen zusammen.\n\nUnternehmt ihr privat etwas? Wenn nicht, liegt es eher am Zwang und dass man sich halbwegs versteht.",
            "ich sag nur :\nWenn du was von ihr willst und checken möchtest ob es bei ihr ähnlich ist wie bei dir, dann lad sie zum Essen ein. \nAnsonsten sitz es aus und lande in der Friendzone 😁",
            "Ist sie nicht viel zu alt? /s",
            "Einfach direkt auspacken. \"Sind das nicht prachtvolle 22cm? \"",
            "Wenn sie beide Füße neben ihren Ohren hat ist das meistens ein gutes Zeichen!",
            "Werdet erstmal Freunde außerhalb der Arbeit, du dürftest es besser einschätzen können, wenn du sie auch besser kennst.  \nUnd wenn nicht, dann seid ihr Freunde, ist auch cool.",
            "ask her the f* out",
            "Ich hab sie damals gefragt, ob wir einen Film zusammen schauen wollen. Nach dieser Frage ging es dann recht schnell.",
            "An der Art wie sie dich anblickt, dabei strahlend fröhliche Augen hat. Wenn man das einmal richtig beobachten konnte, fällt einem schwer das zu übersehen. Dann braucht es nur noch einen Rahmen in dem dort mehr draus werden kann, etwa ein Treffen zu zweit..",
            "Vieles wurde schon genannt. Ganz ohne Risiko wird es nicht gehen. Blickkontakte 10-20% länger und intensiver halten als gewöhnlich, finde ich noch eine gute Methode um non-verbal das Interesse des Gegenüber auszutesten. Natürlich nicht weiter versuchen, wenn es nicht erwidert wird.",
            "Hmmm, ich würde sie erst mal besser kennenlernen und vielleicht erst mal privat eine Freundschaft aufbauen. Wenn man alles auf die Schnelle macht und am Ende klappt es nicht, wird es komisch bei der Arbeit......",
            "Never fuck that Company. Ich spreche da echt aus Erfahrung. Wenn aus Euch ein Paar wird und es dann nach einiger Zeit aus ist und Ihr Euch in der Arbeit weiterhin sehen müsst...Ich habe da lange zu kauen gehabt. Lass es lieber.",
            "Sie Bändelt an",
            "Nett zu einem Arbeitskollegen sein ist kein Flirten!\n\nTeste erstmal an ob sie überhaupt Kontakt außerhalb der Arbeit mit dir haben will. Benutz dazu zB ein gemeinsames Hobby.",
            "Bei mir war es ein total schleichender Prozess.\nVon nem Feierabend Bierchen, zu Textnachrichten über belanglosen scheiß.\nIrgendwann haben wir angefangen zu telefonieren wenn der eine mal nicht in der Arbeit war. \nBis wir dann doch mal ausgegangen sind.\nJoa der Prozess hat bei uns fast ein Jahr gedauert. Sind aber jetzt seit 5 Jahren in einer glücklichen Beziehung.\nBei mir hat es irgendwie gereicht langsam einen Schritt nach den nächsten zu machen. Nicht in eile, oder mit Zwang und joa. Hat wunderbar geklappt.\nMuss aber nicht heißen das es bei jedem so funktioniert.",
            "Lass es einfach gut sein, mit Arbeitskollegen was anfangen ist immer schwierig oder du fragst sie einfach Mal ob sie dich Daten will. Du bist 31, da kann man sowas einfach fragen.",
            "Ich weiß nicht, ist das heute schon eine Grenzüberschreitung wenn du in irgendeiner Form fragst ob sie gerne Zeit mit dir verbringen würde? Meine Erfahrung ist, wenn man zu lang wartet kommt immer wer, der schneller, bedenkenloser oder routinierter in solchen Sachen ist. Besser sei du der. Also hoppauf. Mehr als eine Abfuhr kann's nicht werden. Aber vielleicht ist sie noch gar nicht auf den Gedanken gekommen aber er gefällt ihr..",
            "Sag ihr das du sie gerne privat kennen lernen möchtest und ob man mal nach der Arbeit einen Kaffee trinken geht.\n\nDas ist relativ unverbindlich aber gleichzeitig deutet das ausreichend an das du sie näher kennen lernen möchtest. Wenn sie nein sagt, dann hast du die die Arbeitsatmosphäre nicht ruiniert. Wenn sie ja sagt, dann kannst du es etwas direkter ansprechen beim Kaffee ansprechen.\n\nWarte halt nicht zu lange.",
            "Dont fuck with the Company!",
            "Nach einem date fragen ohne nach einem date zu fragen!",
            "Da gibt es viele subtile Zeichen:\n\nLacht sie viel mehr mit dir oder über deine Witze als über die anderer?\n\n\nHat sie häufig dieselbe Sitz/Steh- Position wie du im Gespräch, spiegelt dich?\n\n\nSitzt sie zufällig (beim Kaffee/ Kantine usw.) irgendwie häufiger näher/öfter bei dir als bei anderen, wenn man darauf achtet?\n\n\nGibt es vielleicht häufiger ganz leichte \"zufällige\" körperliche Kontakte, die irgendwie eine Millisekunde länger dauern als normalerweise (z.B. wenn man sich etwas in die Hand gibt)?\n\n\nOder berührt sie dich kurz mal am Arm/ Hand, wenn du oder sie was sagt (touchy, aber dir mehr gegenüber als allgemein)?\n\n\nNeckt ihr euch häufig im Gespräch? Und sie antwortet lachend mit etwas kindlichem wie \"du bist ja sooo doof!\"\n\nSo Geschichten. Firmenevents/ Feiern sind eine gute Gelegenheit sich näher ranzutasten, weil extern initiert.\nAber so lange will/ kann man nicht immer warten.\n\nDer Tipp hier mal unverbindlich im Nebensatz zu fragen ob man nach Feierabend noch dirket was essen mag ist gut. Oder zur Mittagspause mal nicht in die Kantine, sondern in einen \"coolen Laden\" um die Ecke fahren, also aus der Arbeitsumgebung raus.\n\nOder wenn ihr euch mit weiteren Kollegen gut versteht, mal in kleiner Gruppe Abends was unternehmen. Ist dann kein Date ;)\n\nBleib dran und offen. Vielleicht ergibt sich was. \nHab auch einen Partner so gefunden.",
            "Würde straight nach nem Date fragen. Ansonsten wuselt ihr nur umeinander rum. Ich habe auch noch keine Frau erlebt, die das negativ aufgenommen hat, ganz im Gegenteil. Die Fronten sind dann geklärt und keiner hat Stress. Freunde sein geht danach immer noch.",
            "kauf dir ein buch mit dem titel \"flirts verstehen für männer\" und ein buch mit dem titel \"flirts verstehen für DUMME männer\"\n\nlass die einfach aufm tisch liegen",
            "Frag mich wo da bei einigen das Problem liegt ? Sowas kriegt man doch spielerisch raus bzw. über Umwege, beim Mittagessen wird über ein Restaurant erzählt das außer Reichweite der Arbeit ist und beiläufig erwähnt das man da auch mal essen gehen müsste , wenn sie will sagt sie ja , wenn nicht dann nicht. Stellt euch doch mal nicht so an",
            "Erst einmal gemeinsame Aktivitäten außerhalb der Arbeit anstreben, die nicht als Date interpretiert werden können. Und dort dann halt weiter schauen. Mein erster Ex war auch mein Kollege. Wir sind als Kollegengruppe dann mal auf ein Konzert und daraus ergab sich dann mehr. Was aber auch klar ist, zumindest einer wird die Firma wechseln müssen. Wir haben beide gekündigt und jeweils woanders einen Job gefunden.",
            "Never fuck the company.",
            "Never fuck the company.",
            "Don't shit where you eat.",
            "Don’t shit where you eat",
            "Dont fuck the company.",
            "Wenn sie mit dir flirtet, durch zweideutige Anspielungen bspw, dann ran da. So habe ich es zumindest gemacht bei meiner Freundin/Kollegin und wir sind jetzt seit einem Jahr zusammen. Arbeitstechnisch gibts keine Probleme. Sind aber auch in 2 verschiedenen Abteilungen in einem eher kleinen Unternehmen.",
            "Frau: Einen wunderschönen Morgen mein Lieblingskollege! ;) \n\nMann: I'm in love.\n\nAber im Ernst, hier sind schon einige gute Tipps, einfach dezent antasten bzgl. ob man sich mal privat treffen möchte nach Feierabend oder WE.",
            "Never fuck the company",
            "Wenn eine Frau an einem Mann Interesse hat, lässt sie es merken. Genau das selbe hatte ich auch, mit einer Frau. Das Ende von Lied war, dass sie mir auf Freundschaft aus war. Na ja dir viel Erfolg dabei.",
            "Man scheißt nicht da wo man isst.",
            "dont shit where you sleep",
            "Zeig deine  Spatz nicht am Arbeitsplatz",
            "Wichtiger Rat: Lass es bleiben!!!!",
            "Sie bekommt einen steifen wenn ihr beisammen seid",
            "lasst einfach mal 20€ fallen und dann sag \"oh, da liegt jez ein zwanziger. Muss man den jetzt zurück geben?\"",
            "Fummelt sie an ihren Haaren rum, wenn ihr miteinander redet ?",
            "Busen ist eindeutig.   \nJa, wenn du sie siehst,    \nNein wenn du sie nicht siehst.",
            "Mach einen schlechten Witz der nicht lustig ist und wenn sie drüber lacht ist das ein gutes Anzeichen. \nSo hab ichs früher immer gemacht",
            "Der Unterschied zwischen einem charmanten Flirt und sexueller Belästigung am Arbeitsplatz ist vor allem deinem Aussehen abhängig.",
            "Die steht auf dich Junge",
            "Sie steht nicht auf dich und was da gerade sich anbahnt ist brandgefährlich.\n\n  \nWas du da beschreibst ist eine ganz normale female-to-female-friendship und keine female-to-male-relationship/friendship. Es ließt sich ja wie ein Disney Film und nicht wie es im echten Leben ist. Es besteht keine Spannung zwischen dir und ihr. Also, ihr 2 kennt euch bereits und es ist alles \"rosig\". Ne, so ist das nicht zwischen Mann und Frau. Ohne kleine Stichelein etc, also dass die auch mal von ihr kommen ist das alles außer eine romantische Beziehung.\n\n  \nDu musst auch verstehen, wenn Frauen sexuelles interesse an dir signalisieren ist dass immer über Berührungen. Wenn Sie dich nicht völlig unnötigerweiße anfässt dann steht sie auch nicht auf dich. Dass kann so ein Blödsinn sein wie dass wenn du durch eine Tür gehst sie hinter dir \"ausversehen\" stolpert und in dich rein fällt aber auch ein \"Hey Massiere mich mal\". Aber solange das vollständig abwesend ist brauchste dir überhaupt keine Hoffnungen machen.\n\n  \nAuch überschreitest du eine der goldenen Regeln. Nie im direkten Freundeskreis oder auf der Arbeit daten. Das geht bis zum ersten Streit gut und oh boy fliegt dir dann das Leben um die Ohren.",
            "Never fuck the company.",
            "Wenn sie nett ist, heißt das sie steht aif dich",
            "Danke dass du die Initiative ergriffen hast! <3",
            "Aber bedenke das es nicht zwangsläufig etwas zu bedeuten hat nur weil sie ja zum Essen sagt, dafür ist es noch zu wage formuliert.",
            "Das klingt nach einem sehr vernünftigen Tipp, danke dir!",
            "Geil, Döner",
            "Kannibalen lieben diesen Trick.",
            "Das ist immer gut. Niemals aufdringlich.",
            "Das freut mich sehr :)",
            "Ich hoffe es war die Kollegin W27\n\n🤣",
            "Das freut mich für dich, bedeutet aber nicht zwangsläufig was. Ich bin schon so oft mit Kolleg*innen was Essen/Trinken/Feiern gegangen, ganz ohne Hintergedanken, einfach weil es lustige Menschen sind.",
            "Mist da war jemand schneller. Ist aber das einzig wirklich hilfreiche Video in so einer Situation.",
            "Der einzige zuverlässige Guide",
            "Stark!",
            "😂😂😂",
            "Bei uns sagt man \"Scheiss da nix, dann fehlt da nix\"\\^\\^",
            "Das werde ich tun, danke dir!",
            "Oder die Leichenstarre hat eingesetzt",
            "EnvironmentMany2765 beim sex: \"Eigentlich magst du mich?\"",
            "Gut so. Dominanz zeigen!",
            "Never fuck the same kostenstelle",
            "Tatsächlich lernt ein erheblicher Anteil an Erwachsenen den Partner auf Arbeit kennen. Muss aber natürlich nicht heißen, dass man dann ewig Kollegen bleibt.",
            "Golden Rule: never listen to people on Reddit when it comes to dating.",
            "Regeln sind was für Loser",
            "Nie intim im Team",
            "never put you pen into companys ink",
            "This! Vorallem erst recht wenn man direkt zusammen arbeitet",
            "Woher kommt der Spruch eigentlich? Kenne den nur aus dem deutsch sprachigen Raum, auf Englisch macht das ja auch nicht so richtig Sinn.",
            "Solange es nicht im selben Team ist finde ich das okay.",
            "Würde ich so unterschreiben.",
            "und machte das Gegenteil😂",
            "Schön zu hören, dass es auch mal gut ausgehen kann :)",
            "Ja, unter anderem deswegen, dass sexuelle Belästigung im Prinzip konsequenzlos blieb. Da musste man sich als Mann halt keine Sorgen machen, ob man eine Grenze überschreitet, weil man eh keine Strafe bekommen würde und der Frau nur gesagt wird, sie solle sich mal nicht so anstellen.",
            "Ach, selbst diese \"Zeichen\" bedeuten erst mal nichts. Selbt wenn sie das augenscheinlich nur bei dir macht, das hat nicht zu bedeuten, dass ds tieferes Interesse besteht.",
            "Ja ein paar dieser Kleinigkeiten sind da, aber das ist halt sehr subtil.",
            "Puh, jetzt verstehe ich endlich was es zu bedeuten hatte, als sie mein Knie gestreichelt hat..",
            "Was ist an flapsigen Schubsern oder Zwicken mit den Fingern subtil, wenn es unter Kolleg*innen ist? :D",
            "Wow vielen Dank für deine ausführliche Antwort, danke!",
            "Über deine Witze lachen, mit den Haaren spielen … das sind KEINE Anzeichen dafür, dass sie auf „Dich steht“.\n\nLass es einfach. Komm mit deinen Gefühlen klar, aber hake es ab. Mach das gute kollegiale Verhältnis nicht kaputt, freue dich, dass du am Arbeitsplatz jemanden hast, mit dem du dich so gut verstehst. Das ist unbezahlbar.",
            "Wohl wahr",
            "Dies. Sucht euch eure Bums-/Lebensbekanntschaften woanders. Ich seh es so oft auf Arbeit. Da wird sich gedated, dann gehts schief, alle zerreißen sich das Maul danach etc. Man isst nicht da wo man scheißt. Und wenn sie will kann sie Dir jederzeit nen Strick daraus drehen und deine Karriere beenden.",
            "Fröhlicher Kuchentag!",
            "Frohe kuchentagle",
            "Schlechter Ratschlag. Meine Frau und ich dippen gerade unsere Zehen in die Swingerwelt, wodurch wir ein sehr erfahrenes und offenes Pärchen kennengelernt haben, mit denen gerade eine Freundschaft entsteht und bei dem es absolut kein Geheimnis ist, dass die Frau ziemlich auf mich steht. Sie hat schon mehrfach versucht mich das spüren zu lassen. Für meine Frau war das jedes Mal extrem offensichtlich und ich habe es wirklich NULL gerafft, obwohl ich sogar weiß, dass sie auf mich steht. Sehr augenöffnende Situation, das Ganze...",
            "Eigentlich ja, 26 wäre schon die Obergrenze wenn er 31 ist, evtl. sogar 25.",
            "\"..nie im Leben kleiner Peter!\"",
            "Ja das ist natürlich das Risiko. Aber wenn man das nicht eingeht, dann ist auch immer das „was wäre wenn“ und das finde ich auch nicht so gut…",
            "Oder vielleicht erstmal nach der Nummer fragen und außerhalb der Arbeit in Kontakt stehen. Dann ist es auch nicht mehr weit bis man mal gemeinsam etwas macht. Oder vielleicht sogar auf ein Date geht.",
            "Ich denke das ist der sinnvollste Weg. Nichts überstürzen und gucken obs passt und wenn nicht, dann ist das ja auch ok",
            "Weil alle Frauen gleich sind und aus der selben Fabrik kommen ja? Haha.",
            "Der Meinung kann ich mich nur anschließen.",
            "Ich denke es ist vor allem von dem abhängig wie man sich verhält",
            "Wie fühlt sich das an, wenn man sein Leben nach Memes lebt?",
            "Danke für deinen Input, aber da sind schon seeehr viele Generalisierungen dabei und viel Meinung ohne den Kontext zu kennen. Aber danke für deine offenen Worte :)",
            "Ähm. Nö. Geht nicht immer über Berührungen. Quelle: ich bin eine Frau.",
            ">Du musst auch verstehen, wenn Frauen sexuelles interesse an dir signalisieren ist dass immer über Berührungen. Wenn Sie dich nicht völlig unnötigerweiße anfässt dann steht sie auch nicht auf dich.\n\nWas ist das denn für ein Bullshit? Hast du das von irgendwelchen \"Beziehungscoaches\" oder so?",
            "Du bist also nur nett zu Leuten, auf die Du stehst?",
            "Also bedeutet nett sein jetzt das es immer romantische Gefühle dabei gibt?",
            "Genau, ab da kann er weiter fragen, mal was nach der Arbeit zu unternehmen. Das dann ein paar Mal machen, dabei flirten und dann sieht man es über die Zeit",
            "Dies. Aber rasier die die Klöten vorher. Jusi in case.",
            "Ich kann das nicht genug unterstreichen.",
            "Mit scharf Kollegin",
            "Der erste Kuss mit dönermundgeruch🤤",
            "Von Absalan, Kebab von gegenüber. Trinkjoghurt zum Runterspülen",
            "Feinnern",
            "Damn that escalated quickly 😂",
            "Gebe ich dir Recht. Ich hatte auch mal mit einer etwas aus meiner Etage. Nach drei Monaten war Schluss ihrerseits. Wir  waren halt noch freundschaftlich zueinander, aber ich fand's ziemlich ungeil. Es ist halt schwer jemand zu vergessen, den man ständig sieht.\n\nIch will nicht wissen wie es ist, wenn man sich unfriedlich trennt...",
            "\"Auf der Arbeit\" kann vieles bedeuten. Jemanden in einer anderen Abteilung daten ist was ganz anderes, als wenn man mit der Position in irgendeiner Art beruflicher Abhängigkeit steht. Ganz schlimm wird es innerhalb einer Hierarchie. Da wird es dann fast unmöglich, privates und berufliches zu trennen, v.a. wenn die Beziehung dann mal nicht mehr so gut läuft. Oder die KollegInnen plötzlich den Eindruck bekommen, dass man seine bessere Hälfte bevorzugt. Da kann man eigentlich nur verlieren.",
            "Golden Rule: you can't have both: reddit account and a date.",
            "Don't fuck the company.",
            "Auch mal? Ich bin mit meinem Ex-Kollegen mittlerweile seit 20 Jahren verheiratet.",
            "Ja genau das ist der Grund warum ich erstmal hier nachfrage. Vor allem weil ich niemanden verletzen oder die Situation unangenehm machen will für sie",
            "Interessante Ansicht, wurde bisher nur von Frauen sexuelle auf der Arbeit belästigt.",
            "Kommt auch auf den kulturellen Hintergrund an. Kenne das z.B. von Frauen aus Südamerika oder Südeuropa, dass die einen oft anfassen (also nicht an den Hintern oder so, sondern überhaupt) oder körperlich näher als eine Handbreit kommen, ohne dass da irgendeine Art von Interesse hinter steht.\n\nWenn man allerdings hier aufgewachsen ist, dann macht man sowas nicht einfach so, ist meine Erfahrung. Die meisten Deutschen haben einen deutlich weiteren Safe Space.",
            "HALLO jemand der auf Reddit ist hat die Chance Liebe zu finden. Die Chance haben wir hier nicht oft, Arbeitskollegen findet man genug.\nEr soll einfach immer freundlich und respektvoll bleiben dann wird auch keine kollegiale/freundschaftliche Beziehung kaputt gehen nur weil man mal sagt ey ich find dich echt nett und attraktiv möchtest du mal mit mir essen/spazieren gehen damit wir mal mehr Zeit zum was unternehmen haben als nur die Pause. \nLiebe ist toll, es kann eigentlich Nix schlimmes passieren solange man respektvoll ehrlich und freundlich bleibt",
            "100% richtig! Selbst erlebt im Team bei einem großen Automobilhersteller. Da hat sie einfach die sexuelle belästigungs Keule ausgepackt und er hatte keine Chance das Gegenteil zu beweisen. Btw hatte er schluss gemacht  lol",
            "Da hast du auch recht. Männer haben da einfach die falschen Antennen. Aber auch wenn ein Mann da ein bisschen naiv ist schafft es die Frau dann doch irgendwie. So wirklich schwer ist es ja nicht, einen Mann rumzukriegen.",
            "Lass es lieber. Hab auch im Bekanntenkreis genug Geschichten gehört …. Es gibt genug andere Mädels da draußen",
            "Du fragst hier nach Rat und nicht nach bestätigung. Viele andere Kommentare lesen sich sehr inhaltsgleich wie meiner.\n\n  \nEs ist offensichtlich dass du keine Erfahrung mit Frauen hast und deswegen hier dich bestätigen lassen willst. Kann ich ja verstehen. Aber das geht schief und es ist dein Arbeitsplatz.",
            "Frage nicht die Fische, sondern den Fischer wie man Fische fängt.",
            "Wa",
            "Schon, aber irgendwo muss OP ansetzen.",
            "Mit alles Kollega",
            "\"Scharf steht schon genug neben mir, danke\"",
            "Ohne bleibt er nicht so in Erinnerung…",
            "Mit di Swibel",
            "Das ist keine „Ansicht“, das sind überprüfbare Fakten. \n\nEs tut mir sehr leid, dass du diese Erfahrungen machen musstest. Ich hoffe, du arbeitest sie entsprechend auf.",
            "Kenne das auch von genug Frauen aus dem hiesigen \"Kulturkreis\". Kommt vielleicht auch eher aufs Alter an? Ich weiß es nicht und wollte ja eigentlich nur sagen, dass das alles keine gut zu deutenden zeichen sind.",
            "Ja, richtig mies, wie kann sie nur! Unmöglich, dass Frauen sich über sexuelle Belästigung am Arbeitsplatz beschweren, die haben das einfach zu ertragen. (/s, falls du es nicht merkst)",
            "Trotzdem nicht. Ist zwar dann ein sicheres Zeichen, aber weniger \"touchy\" Frauen gehen dir halt dann durch die Lappen.\nQuelle: ich bin eine lesbische Frau. \n\nGibt genug Frauen, die einfach keinen Körperkontakt mögen, Körperkontakt nur ertragen oder sogar durch frühere schlechte Erfahrungen Körperkontakt erstmal meiden. Vor allem wenn es fremde* Männer sind.\n\n*Von der Frau selbst zu definieren",
            "😂😂",
            "Das irre ist nur. Kannste eine haben, kannste alle haben. Sobald der Punkt erreicht ist wo sie auf dich eindeutig zugeht, machen dass ja alle Frauen. Was interssiert mich dann die eine die das nicht macht.\n\n  \nGanz davon abgesehen dass eine Frau sowieso nur ein Anhängsel in meinen Leben ist aber bestimmt nicht mein Fokus.",
            "Naja, vielleicht wäre auch genau die eine die, die deine Sicht ändern würde und nicht nur \"ein Anhängsel\" ist.\nAber vibe deines eingangskommentars bestätigt.",
            "Das witzige ist. Dass hat eine von dieser Sorte. Seitdem mein Verhalten genau 180 gedreht und kann mich vor Frauen nicht mehr retten.",
            "Du Hengst :)"
        ]
    },
    "Wie mit Absurdität des Lebens umgehen? ": {
        "title": "Wie mit Absurdität des Lebens umgehen? ",
        "score": 12,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dlqi80/wie_mit_absurdität_des_lebens_umgehen/",
        "content": "Hallo Community, \n\nmich beschäftigt in letzter Zeit immer wieder der Gedanke wie absurd das Leben doch ist. Fühle mich halb so als wäre ich in einer dämlichen Quarter Life Crisis. \nJedenfalls habe ich das Problem, dass mir nichts Spaß macht oder Bedeutung schenkt.. kontraproduktiv, wenn man diese Gedanken los werden will. Keine Ahnung, irgendwie bin ich einfach nicht erfüllt. Oder glücklich, zufrieden, wie auch immer man das nennen möchte.\n\nMein jüngster Gedanke war, dass mein Ex-Freund damals zwar schon etwas wohlhabender war, jetzt aber Multimillionär sein müsste (großer Influencer, sehr gut in Bitcoin investiert). Wenn ich mich damals nicht getrennt hätte, könnte ich jetzt in einer Villa sitzen? Wie absurd. Ich trauere dem nicht mal hinterher, weil ich weiß, dass ich da genauso unzufrieden wäre und andere Sachen zum cherry picken finden würde..\n\nAlso wenn egal was einen nicht zufrieden machen kann, was gibts dann noch zu tun? Ich habe keine Depressionen (mehr), aber das bedrückt mich trotzdem irgendwie. Weil es auch keinen Ausweg daraus gibt. Oder doch? \n\nRandinfo: gut bezahlter Beruf, verheiratet mit einem tollen Mann und insgesamt stabiles Leben. Eigentlich gibt es nichts an dem mir fehlt.",
        "num_comments": 26,
        "comments": [
            "Albert Camus' *Mythos des Sisyphos* lesen, da geht es genau darum: die Absurdität des Lebens, und wie man damit klarkommt",
            "> Jedenfalls habe ich das Problem, dass mir nichts Spaß macht \n\n\n\n\nSpeziell auf diesen Satz bezogen: Ich habe irgendwann gemerkt, dass Dopamin Content dazu geführt hat, dass mir nichts mehr Spaß macht oder mich unterhält, egal ob Bücher, Filme, Serien, Unterhaltungen, Spaziergänge.\n\n\n\n\nSeitdem das alles weg ist, ist auch dieses Gefühl der ewigen Langeweile wieder weg.\n\n\n\n\nWas die Banalität des Lebens angeht: Die Wahrheit ist, es gibt keinen großen ganzen Sinn, keinen Punkt an dem man etwas erreicht hat und sich zurücklehnen kann... wenn man danach sucht wird man unglücklich, den das Leben ist absurd und banal.\n\n\nEs gibt die kleinen und großen Freuden im Leben, die Blumen im Garten, die Geburt der Kinder, der Spaziergang um 7 Uhr morgens, das gemeinsame Frühstück. \n\n\nWir sind als Gesellschaft heutzutage so sehr darauf gepolt Spaß zu haben, zu konsumieren, positiv und glücklich zu sein, obwohl jegliche Auseinandersetzung mit dieser Thematik zeigt, dass Hedonismus unglücklich macht.\nUnd weil wir trotz dieses falschen Versprechens, trotz der Villa, dem Thermomix, der S Klasse, dem Haul, dem Urlaub und und und unglücklich sind, denken wir, wir müssten bloß noch mehr Spaß machen um das Glück zu finden. ",
            "im Englischen sagt man so schön \"what, ifs and whens\"",
            "Amerikanische Professorin Lyubomirsky \"Glücklich sein\" lesen. Sie stellt 12 Möglichkeiten vor, die mit hunderten von Studien belegt sind.\n\nDeutscher Professor Hartmut Rosa \"Resonanz\" lesen. Er stellt theoretisch das Modell der Resonanz vor. Wie entsteht es, kann man es erzwingen, welche Möglichkeiten gibt es? Wie führt man ein resonanteres Leben?\n\nDeutscher Professor Friedemann Schulz von Thun (kennst du bestimmt vom vier seitenmodell) hat das Buch \"Erfülltes Leben\" geschrieben. Er stellt fünf Möglichkeiten vor, wie das Leben besser werden könnte.\n\nDeutsch amerikanischer Professor Erich Fromm \"Furcht vor der Freiheit\", \"Haben oder Sein\", \"Den Menschen kennen\". Er zeigt Wege zur positiven Freiheit auf. Zudem setzt er sich kritisch mit der Gesellschaft auseinander, die für viele Probleme verantwortlich ist.\n\nRosenberg \"gewaltfreie Kommunikation\". Es kann die eigene Kommunikation verbessern, sodass wir öfter über unseren Gefühle/ Bedürfnisse sprechen und diese bei der anderen Person auch besser wahrnehmen. Zudem Vermeidung lebensenfremdeter Kommunikation und Unterschied Bitte/ Forderung.\n\nMc Clelland: Zugehörigkeit, Mitbestimmung und Anerkennung. In wie weit werden die Punkte erfüllt? Wie kann man das verbessern?\n\nAmerikanischer Professor Gottman \"7 Geheimnisse einer guten Ehe\". Anhand einer großen Beobachtungsstudie stellt er 7 Möglichkeiten vor, wie man die eigene Beziehung bzw Partnerschaft verbessern kann.\n\nProfessor Waldinger \"Good Life\" (gibt es auch in Deutsch\") er stellt die Bedeutung von Beziehungen in den Vordergrund.\n\nVllt interessierst du dich für die Probleme in der Gesellschaft? Weibliche Stereotype Simone de Beauvoir, männliche Stereotype Reawyn Connel, ungerechte Bildung Aladin El Mafaalani, Patriarchat Unlearn Patriarchy 1+2, Rassismus Aladin El Mafaalani, Populismus Jan Werner Müller oder Armin Schäfer, Lookismus Elisabeth Lechner, Identität Appiah, identitätsfallen Amartya Sen, Ethik Heidenreich Theorien der Gerechtigkeit, Kapitalismus Piketty und Colin Crouch, Kolonialismus Said, Spivak, Bhabha, Wahrheit Foucault, Kulturindustrie Adorno,...)\n\nWie du siehst lese ich gerne. Vllt findest du ja was passendes für dich :)\n\nAber mit dem Wort Absurdität hast du bei mir auch direkt Albert Camus Mythos des Sisyphos getriggert, aber das wurde dir ja schon längst mehrmals geschrieben. Kann ich auch so empfehlen. Dazu findest du im Internet auch zahlreiche Zusammenfassungen. Ich finde Faust könnte auch passen. Auch dazu findest du Zusammenfassungen. Ebenso literarisch: der Alchemist von Paolo Coehlo, Veronika beschließt zu sterben von Paolo Coehlo, von Grimmelshausen der abenteuerliche Simplicissimus, Herman Hesse Siddhartha, Lessing Nathan der Weise insbesondere die Ringparabel. Alle Bücher befassen sich mmn irgendwie mit dem Sinn des Lebens.",
            "@",
            "Nach dem was du beschreibst, hast du die Akzentuierungsillusion verstanden. Das Gras ist immer grüner auf der anderen Seite. Viele kommen hier mit Selbsthilfebüchern und schlauen Werken von Psychologieprofessoren/innen aber auch das reine Lesen dieser Bücher hilft dir nicht unbedingt weiter. \n\nKurz gesagt musst du einfach einen tieferen Sinn für dich finden, weil deine Umwelt ihn dir nicht geben wird. Zumindest nicht ohne dein Zutun. Ich verstehe echt sehr gut, was du fühlst und denkst und habe für mich auch noch kein perfektes Gegenmittel gefunden aber pauschal bei allem was man tut den Gedanken im Hinterkopf zu haben, dass ja eh alles egal sei und wenn mal was nicht egal ist dann wird es das halt mal sein, hilft einem nicht weiter. Das führt dann im Endeffekt nur dazu, dass man auch in Situationen unglücklich ist, die einen früher glücklich gemacht haben.\n\nWenn du dich dagegen vielleicht doch noch mit professionellem wischi-waschi therapieren willst, ohne jetzt tatsächlich in Therapie zu gehen (was dir bestimmt auch helfen würde), dann lohnt es sich vielleicht mal, sich Seligman's \"positive Psychotherapie\" anzusehen. Kann man meiner Meinung nach auch gut ohne jemand professionellen für sich umsetzen und hilft u.U. einen neuen Blickwinkel auf Glück, das eigene Leben und Dankbarkeit zu erlangen. Zumal die Schritte auch deutlich expliziter sind. Es sei aber dazu noch gesagt, dass positive Psychologie alleine nicht des Rätsels Lösung darstellt. Wie gesagt: man ließt nicht einfach einen Ratgeber und wird dadurch glücklich.",
            "Erkenne mich da gut wieder. Für mich persönlich hat es allerdings etwas Befreiendes, dass das Leben an sich sinnlos ist. Und etwas Unterhaltsames, wie absurd und ironisch manche Dinge sind.\n\nWenn dir dein Leben allerdings bedeutungsleer vorkommt, kannst du zumindest dagegen etwas tun. Der Rest ist Weltschmerz, der vergeht mit einer stabilen Psyche bis zu einem gewissen Grad.",
            "Sich selbst Ziele stecken, die Arbeit erfordern aber nicht unerreichbar sind.\n\nTheoretisch hat jeder die Möglichkeit in irgend einem Job rumzusitzen und sein Leben der Gewinnmaximierung des Arbeitgebers zu widmen und damit hat es sich, dass stellt nur nicht jeden zufrieden, dich wohl eingeschlossen.\n\nHöheren/anderen Abschluss machen. Eine schöne Reise, mit diesen teuren Hotels von denen man immer träumt. Ein aufwendiges Hobby. Ein eigener Garten..... Solange es dich beschäftigt und dir ein Gefühl der Befriedung gibt, ist es okay.",
            "Es gibt noch was zu tun:\nWer ist es, der nicht zufrieden ist und das Leben (zurecht) absurd findet?\nWer bist du wirklich ( nicht dein Name, Beruf usw.)\nHinterfrage die Realität, dich,deinen Mann, einfach alles und versuche herauszufinden, was \"hier und jetzt\" abgeht.",
            "Weltschmerz?",
            "Hm, laut deiner Beschreibung fehlt in deinem Leben nur eine Sache, die für viele, insbesondere Frauen, eine große Erfüllung bringt und ich meine damit keine Katze.",
            "Wollte ich auch gerade vorschlagen.",
            "Ich werfe noch „Der Fremde“ ein.",
            "Staubsaugerroboter nicht zu vergessen.",
            "Mit 10 Millionen kann man sich zurück lehnen und das Leben genießen.",
            "Da liest aber jrmand viel 🙃",
            "Der Wert einer Katze wird extremst unterschätzt.",
            "Kinder sind für uns keine Erfüllung, zumal mein Mann unfruchtbar ist 😅",
            "Kinder sind keine Erfüllung sondern in erster Linie Arbeit und Verantwortung. Nicht jeden erfüllt das und das ist auch in Ordnung so. Deine Aussage ist dagegen gelinde gesagt fragwürdig und trieft nur vor Sexismus.",
            "Verständlich. \"Insbesondere für Frauen\" was für eine Klischeekacke.\n\n\"Katzen\" ist die Antwort.",
            "Schade, Adoption kann eine Lösung sein.\n\nDass sie eine Erfüllung sind, merkt man ohnehin erst, wenn sie da sind.",
            "Wieso jeder? Es gilt eben für fast jeden.",
            "Dass jeden Kinder glücklich machen? Nein, das gilt mit Sicherheit nicht für fast jeden. Viele junge Paare klagen über das Elterndasein und zerbrechen daran. Die wenigsten Menschen werden glücklich und zufrieden durch mehr Arbeit. Ist man schon unglücklich, trägt ein Kind nur zu weiterer überforderung bei und macht noch unglücklicher. Paare die mit ihrem Kind und ihrem Leben sowie ihrer Partnerschaft glücklich und zufrieden sind, waren das bereits vorher. Ein Kind ist definitiv kein magischer \"Glücklich-Knopf\", den man betätigen muss, um Sinn im Leben zu finden.",
            "Sagt doch keiner, dass man dadurch glücklich wird, wenn die Beziehung kaputt ist.\n\nDann wäre nicht das Kind das Problem, sondern das Kind in der falschen Beziehung. Scheint hier ja nicht der Fall zu sein. Bei dir?",
            "Ich habe kein Kind und beabsichtige das auch nicht, danke der Nachfrage."
        ]
    },
    "Meine Mutter hat Krebs, die Chemo beginnt heute. Montag kommt sie nach Hause, wie kann ich ihr eine Freude machen?": {
        "title": "Meine Mutter hat Krebs, die Chemo beginnt heute. Montag kommt sie nach Hause, wie kann ich ihr eine Freude machen?",
        "score": 7,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dlsx9e/meine_mutter_hat_krebs_die_chemo_beginnt_heute/",
        "content": "Ja, was der Titel sagt. \n\nBei meiner Mutter (61) wurde diese Woche ein aggressiver Lungenkrebs diagnostiziert, welcher ab heute mit einer Chemo behandelt wird. \n\nIch (28) bin vorerst zurück zu meinen Eltern gezogen um Ihnen zu helfen. Kann jemand aus eigener Erfahrung sagen wie ich es meiner Muddi am angenehmsten machen kann, sobald sie nach Hause kommt? Wir haben bereits verschiedene Säfte und alle Sorten Dextro Energy gekauft, mit dem Gedanken das sie das zu sich nehmen kann wenn sie keinen Hunger hat aber irgendwie Energie braucht. \n\nWir (Papa und Ich) haben keine Ahnung worauf man da achten soll, bekommt sie sofort Sodbrennen durch die Säure in den Säften? Schmecken die Säfte vlt gar nicht weil die Geschmacksknospen die als zu sauer empfinden nach der Chemo? Bekommt sie ein Pappmaul durch die Chemo und Traubenzucker würde den Mund nur noch mehr austrocknen? \n\nWir wollten ihr Schlafzimmer noch schick machen und frische Blumen auf den Nachttisch stellen, ist das eine gute Idee? \n\nAgain, wir beide sind ziemliche Fachidioten und Muddi hat sich immer um die Familie gekümmert und wusste alles. Jeder Ratschlag wird gerne angenommen. ",
        "num_comments": 12,
        "comments": [
            "In diesem Thread geht es um das Thema Gesundheit.\n\n**Bei akuten, potenziell lebensgefährlichen Problemen bitte SOFORT den Notruf (Europaweit: 112) wählen, anstatt auf Antworten zu warten. Lieber einmal zu viel anrufen, als einmal zu wenig!**\n\nDu hast dich sicherlich an diese Community gewandt, weil du dir Hilfe erhoffst, denke aber bitte daran, dass die Kommentare der User:innen\n\n* eine professionelle (ärztliche, psychologische o. ä) Beratung und Unterstützung nicht ersetzen können,\n\n* alle Kommentare und private Nachrichten mit Vorsicht zu genießen sind, egal ob es sich dabei um Vorschläge, Diagnosen oder persönliche Erfahrungen handelt. Nur weil sich ein Kommentar richtig anhört (und vielleicht sogar durch Internetquellen belegt ist), heißt das nicht, dass er für deinen individuellen Fall zutrifft.\n\n**Wir bitten dich deshalb darum, persönlichen, professionellen Rat bzw. eine professionelle Zweit- oder Drittmeinung einzuholen und keine Entscheidungen auf alleiniger Basis von Userkommentaren zu treffen.**\n\nFür alle anderen gilt:\n\n* Bitte keine Angebote für einen persönlichen Austausch per PM, auch wenn sie gut gemeint sind.\n\n* Keine dummen Sprüche, Witze und Beleidigungen\n\n* Falls ihr tatsächlich professionelle Erfahrung im entsprechenden Bereich habt, denkt bitte daran, euren Kommentar mit einem entsprechenden Hinweis auf die Schwierigkeit von Ferndiagnosen zu versehen.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Ratschlag) if you have any questions or concerns.*",
            "Das wichtigste ist: Fragen, Fragen, Fragen. \n\n\nDas mit den Blumen finde ich gut. \nEimer neben das Bett kann nicht schaden. \nGut bekömmliche Nahrungsmittel wie Gemüsesuppen. \nWenn deine Mama um 4 Uhr morgens Bock auf Fast-Food hat, mit ihr sofort zu Mcces fahren, Appetit geht schnell wieder. \n\n\nLungenkrebs ist sehr oft tödlich, vielleicht mal einen Palliativmediziner kontaktieren - das musst du deiner Mutter nicht unbedingt erzählen, erst wenns soweit ist. Aber du kannst mit ihr natürlich sprechen, wie sie es sich wünscht zu sterben, Zuhause, Krankenhaus, etc. Vorsorgevollmacht und Patientenverfügung erstellen, so schnell wie möglich. Das vergessen Menschen oft. \n\n\nPappmaul kann sein, Zitronenwasser kann da hilfreich sein. Ein Spray zum Mund befeuchten. \n\n\nFür euch alle steht eine unglaublich miese Zeit bevor. Zeig deiner Mutter ruhig dass du traurig bist, aber lass ihr Raum. \nFalls sie raucht, lasst ihr das. Nicht verurteilen, nicht kommentieren. Es geht jetzt primär nur um die Gefühle deiner Mutter. Vorwürfe bringen da eh nichts. Holt euch Hilfe - Hospizdienst?\n\n\nUnd macht euch bitte keine falschen Hoffnungen, Lungenkrebs ist mega scheiße, sehr tödlich und eine Chemo wird das wahrscheinlich alles nur hinauszögern. \nIch hasse dass meine Worte so hart klingen und ich wünschte wirklich, ich könnte was hoffnungsfroheres schreiben, aber meine Mutter starb auch an Lungenkrebs und ich weiß dass das nicht toll wird. \n\n\nSie wird vielleicht keine Energie haben, zwingt sie nicht zu Unternehmungen um Erinnerungen zu schaffen. Seid da. Redet. Respektiert ihren Wunsch auch mal allein zu sein, nicht viel Besuch zu bekommen. Genauso andersherum, viel Besuch, viel Action. Respektiert einfach alle ihre Wünsche. \n\n\nAlles Gute für euch!",
            "Bitte nicht viel Zucker (Dextro Energy), das ist die beste Nahrung für den Krebs.\n\nAnsonsten kommt es sehr auf die Zusammensetzung der Medikamente der Chemo an. Weißt du, welche Art von Medikamenten sie bekommt? \nEs gibt einige, die verursachen Übelkeit (5-Fluoruracil), andere Schläfrigkeit (die Antihistamine zur Verträglichkeit der Antikörper) usw… \n\nAnsonsten wird deine Mutter wissen, was sie möchte. \n\nWährend der Chemo hatte ich gar keine Lust auf normales Brot, aber Knäckebrot ging. Kaffee war ekelig, schwarzer Tee in Ordnung usw.",
            "Schnappt euch den behandelnden Arzt und quetscht die Informationen was geht und was nicht geht aus ihm heraus. Oft genug sind Ärzte da etwas betriebsblind. Da solltet ihr verlässliche Informationen bekommen. Bei allem anderen, zeigt einfach eure Zuneigung und gebt euer Bestes.\n\nSonst wünsche ich euch viel Kraft. Sitze gerade vor der Uniklinik und warte auf meine Verlobte die mit ihrer Mutter Schwiegervater besucht der mit austherapierter Leukämie und einem fiebrigen Infekt auf der Intensivstation liegt. Daher kommt mein erster Absatz.",
            "Sprich mit dem medizinischem Personal, was sie braucht, was \"gut\" für sie ist, was sie unbedingt und was sie auf gar keinen Fall tun soll und kümmer Dich darum. Bring die Bude in Schuss (Blumen gießen, Müll rausbringen, Altglas entsorgen, Staubsaugen etc.) sorg dafür, dass eingekauft wurde. Überlaste sie nicht mit alle 5 Minuten zu fragen \"brauchst Du was?\" sondern signalisier ihr, dass Du für sie da bist, wenn sie will. Sei hilfreich, aber nicht nervig. \"Was würdest Du Dir in der Situation von anderen wünschen?\" ist oft ein guter Ansatz.",
            "zum thema zucker wurde hier schon einiges gesagt, möchte ich auch nochmal betonen: bitte die Zuckerbomben weglassen. Ansonsten denke ich, ist das auch eine persönliche Sache - wie ist deine Mama so drauf, was mag sie? Also liest sie gerne, oder ist sie eher alleine? ich glaub am Anfang ist es wichtig, alles ruhig anzugehen und sie nicht zu über-bemuttern, redet mit ihr, auf was sie lust hat oder ob sie einfach erstmal Ruhe braucht. ich wünsche euch viel kraft.",
            "Ich würde auch erstmal abwarten, wie sie die Chemo verträgt. Was ich bisher mitbekommen habe, verträgt jeder die Chemo anders. Mein Opa hat zB auch Lungenkrebs und hatte am Ende eig keine von den bekannten Nebenwirkungen, die du aufgezählt hast. Aber für sie da sein und fragen, was sie dann am Ende wirklich braucht, ist bestimmt eine gute Idee. Nett von dir, dass du sie da so unterstützen möchtest. Ich wünsche euch viel Kraft!",
            "Mit den Blumen wäre ich erstmal vorsichtig. Ich habe selbst vor ein paar Jahren Chemo bekommen und musste feststellen, dass ich viele Gerüche oft als sehr belastend empfunden habe. Selbst Gerüche, die man normalerweise als angenehm empfindet (frische Wäsche, zum Beispiel. Oder eben Blumen). \n\nAlles Gute für deine Mutter!",
            "Erstmal wünsche ich euch viel Kraft für die nächste Zeit.\n\nDann unbedingt mit dem Arzt oder den Pflegern sprechen. Mein Kind hatte während der Chemo und den Pausen dazwischen strenge Regeln bezüglich Lebensmittel und Tiere, Pflanzen usw. Lebensmittel die abgepackt waren, wie z. B. Wurst durfte maximal 24 Stunden offen sein danach sollte er es nicht mehr essen. Das Essen am besten getrennt von den anderen aufbewahren. Im Endeffekt hat er einen eigenen Kühlschrank gehabt wo die Sachen solange drin standen wie „essbar“ für ihn, danach sind die in unseren gewandert. \n\nBeantragt Pflegestufe und Schwerbehindertenausweis.\n\nDas sind erstmal ein paar grundlegende Tipps.",
            "Bitte nicht so zuckerhaltig essen und trinken, sie müsste ihre Ernährung jetzt so gut es geht umstellen, Zucker füttert die Krebszellen. Ich wünsche deiner Familie und vorallem ihr alles Gute",
            "Alles klar. Danke für den Hinweis mit dem Zucker, da sieht man wie wenig Ahnung wir haben...\n\nNoch weiss ich nicht welche genauen Medikamente Mama bekommt. Es sei ein kleinzelliges Lungenkarzinom sein welches schon in die Niere gestreut hat. Gestern kamen die Biopsie Ergebnisse und die Chemo läuft seit heute morgen. Ich frage aber Montag im Krankenhaus wenn wir sie abholen.",
            "Sowas hatte ich schon befürchtet... Dann machen wir einfach so alles blitzblank sauber, beziehen das Bett neu, etc"
        ]
    }
}