{
    "/r/RedDeadRedemption Weekly Question & Answer Thread - Week 24, 2024": {
        "title": "/r/RedDeadRedemption Weekly Question & Answer Thread - Week 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/reddeadredemption/comments/1dhxh6k/rreddeadredemption_weekly_question_answer_thread/",
        "content": "#All common questions about the game should be directed here. This includes both single-player and online questions. When asking a question, it is often beneficial to share which mode you are referring to in order to get an accurate response. Also consider sharing any relevant information that may help someone answer your question.\n\n* [See our FAQ here for some common questions](/r/reddeadredemption/wiki/faq)\n\n* [Our spoiler policy](/r/reddeadredemption/wiki/spoilerpolicy)\n\nAll story spoilers must be displayed with the proper format:\n\n`>!RDR is a great game!<`\n\ngives you:\n\n>!RDR is a great game!<\n\nIf you're not sure if you should use a spoiler tag or not, err on the side of caution and use one. Also, it's a nice gesture to visibly indicate the general nature of your spoiler before the tag, so people know what you're spoiling.\n\n---\n\n#[Submit Red Dead Online feedback here](https://www.rockstargames.com/reddeadredemption2/online/feedback)",
        "num_comments": 21,
        "comments": [
            "Why is my dead eye different? It doesnt do the original deadeye effect where you can shoot different people at the same time.",
            "Hey guys, I'm on my first playthrough of RDR2 and I'm near the end of the chapter 2 mission where you take out the O'Driscoll camp and have to search Colm's cabin for money in the chimney. The game prompted me to pick up a shotgun on the mantle, open the weapons menu, maintain the shotgun, and clean the shotgun. I can't clean the shotgun. I don't have any materials to do that, and the gun also says it's already clean. Now I'm physically locked in place (cannot walk anywhere or interact with anything) until I complete this seemingly impossible task? Am I missing something obvious here? 😅",
            "Hey I am playing after American venom and there’s a drought of missions and bounties is there a way to get more missions as John after American venom besides the farm chores ",
            "I bought the game back in 2020, played it once and didn't go back. Picked it up again a couple of days ago, really enjoying it then something happened that made me recall why I hadn't played it. The save game mechanics suck, unless I'm doing something wrong? What is the best approach to saving the game to minimise disappointment and frustration. Appreciate any pointers.",
            "I started playing the online version with a couple of friends. Any suggestions on activities that we can all do to make $$$? we already finished the main missions.",
            "is there a main story? Im not far into it-maybe 2 or 3 chapters-but a lot of the missions seem to be bullshit fetch quests or just an excuse to roam around. Some of them seem like main story type of missions. And if you just want to do the main story without bullshit side missions, can you? is there a way to tell them apart? One mission was dumb as fuck, i just had to take a bag back from a coyote. It took 2 seconds.",
            "You're only in chapter 1 or 2 probably. Keep going.",
            "There are 5 levels of deadeye, each has different or additional game mechanics.  They are unlocked during certain story missions.   There's also a one-shot free-aim quickdraw dead eye mode, different than normal deadeye.  The game mechanics in this game can get a little complicated.",
            "reload the game go to gun smith buy gun oli loot chminey trust",
            "This is wild. Never considered this as a possibility. Either try and reload an old save to do it again after buying some gun oil, or (and you should do this anyway) loot all the O'Driscols after the first assault, but BEFORE going to the cabin door. Either someone will give you gun oil or it can be found somewhere near that camp fire",
            "That sounds like a nasty bug.  You can probably pick up gun oil by looting O'Driscolls, it's a fairly common item.   BTW, if you want to loot all the bodies before the law showing up, save the shotgun step for last, as the lawmen show up after a short time delay after completing the mission.",
            "Unfortunately, no. There's a couple bounties that will have popped up, but you've probably seen them all. There's one stranger mission that appears that only John can do, and a couple of them can only be finished by him.\n\nIf you did as much as you could with Arthur, there's not much left for John, other than the new side mission chain and bounties, and non-mission stuff like challenges, hunts, collections, and other stuff. There are quite a few easter eggs you can discover wandering around that won't show up as missions, but tie up some loose story points about other characters.",
            "What exactly is disappointing? I'm disappointed by the way they don't save your exact place (usually, unless you make a camp), and when you reload, you're \"hanging out\" near where you were with the world basically refreshed. No way around that. That's how Rockstar does its engine. Its one of the biggest weak points.\n\nI turn off autosave. Manual saves only.\\* Got into the habit real fast of making saves before starting any mission, and most of the time -- except when I forget -- after a good collection. This way I can go on a tear or make a mistake and won't have an autosave with stuff I don't want.\n\n^(\\*Actually I turned it back on during the final two missions of Chapter 6, so I could have an extra save between the back to back missions. But immediately turned it off again.)",
            "I think it's just an auto-save thing and if you fail a mission, it lets you go to checkpoints. I put in like 2 or 3 hours into it this week myself and it's one of the least fun games I've ever played. ",
            "Probably rage bait but do you have color blindness? Main missions are yellow and side missions are white or a question mark.",
            "Like all Rockstar games, there are main missions and side missions. Most side missions you can do whenever, although a few will expire.\n\nMain story quests are yellow.\n\nIf you want a list of main story missions (potential spoilers): [https://www.ign.com/wikis/red-dead-redemption-2/Walkthrough\\_and\\_Mission\\_List](https://www.ign.com/wikis/red-dead-redemption-2/Walkthrough_and_Mission_List) \n\nThe guy taking photos had a white icon, it's a Stranger mission, not the main story. If you avoid them all, though, you'll miss out on some good stuff.\n\nIf you want to know what you can miss out on if you ignore it (potential spoilers): [https://reddead.fandom.com/wiki/Missable\\_Content\\_in\\_Redemption\\_2](https://reddead.fandom.com/wiki/Missable_Content_in_Redemption_2) \n\nIf you just want the story and don't care, just do the yellow missions. If you hit a point where there are none, you may need to let some time pass.",
            "nah im in chapter 5",
            "Thanks for this, appreciate you taking the time to respond. \n\nWell I think you've summed it up. The refreshed game environment on re-loading leaves me disoriented and feeling like I've missed something. Although a little better for knowing that's just how it is.  I'm going to start a new game again over the weekend, autosave off and disciplined saving, What's going on when you die, that feels kind of awkward too, I see money disappearing when I respawn? Also, if you don't mind, what are the implications of replaying a quest in the Chapter menu? Cheers.",
            "Weird. If you're not doing something wrong, it must be a bad glitch. By Ch 3, you can mark as many as you can in the time, which should be 2-4 easy. By Ch 5 you can also pull the trigger and fire without marking and keep shooting like that in dead eye for as long as the meter lasts.\n\nWhat's it doing instead? Still auto marking?\n\nYou can't shoot two people literally at the same time, but if you have both pistols out, you can hit two pretty fast in dead eye.",
            "I'm not 100% clear on the death mechanics, it's one of the things I reload for. I know it usually takes some money if you die outside a mission. It takes some percentage, and if you die more in a short time period, that percentage gets higher. But I've had times where it looked like no money was taken. Not sure if I got lucky with a glitch sometimes, or if there's certain conditions, like you only lose money when killed by people.\n\nYou respawn similar to a game load, near where you died.\n\nDeath in a mission you just lose mission progress and either start over or restart at a checkpoint (which can count against you in some missions depending on Gold requirements). There's never a penalty beyond that.\n\nReplaying a mission usually acts like loading a save. After the mission is over, you'll be near where you were with the world reset. Stuff you collect and do won't carry over on a redo, so if there's money or items to collect, it's best to spend the time to collect them on the first playthrough, and worry about being quick later."
        ]
    },
    "Where would you want to live?": {
        "title": "Where would you want to live?",
        "score": 2832,
        "url": "https://i.redd.it/eb05aythly7d1.jpeg",
        "content": "If you were transported into the game, what state/city would you want to live in, and would you rather live in 1899, 1907, or 1911. You can also live in any states/cities mentioned in game, or Mexico like in RDR1. Let me know what you choose!",
        "num_comments": 1056,
        "comments": [
            "New Hanover. I am so tired of this heat. lol.  Probably on a small ranch just outside of Valentine. 1899. Going to be one helluva New Years eve party at Smithfield's Saloon.",
            "Everyone here is forgetting that Strawberry HAS NO BOOZE",
            "I wanna say the Valentine New Hanover area in 1911 would be the safest choice. Assuming everything possible is Canon there is no serial killer loose anymore, the o'driscolls were pretty much wiped out, and it's pretty peaceful",
            "Big Valley, or around Strawberry",
            "Probably somewhere in the grizzlies, nice and quiet",
            "Tahiti. I just need some time",
            "Rhodes is somehow my favourite town",
            "Wherever Dutchs plan takes us , lol",
            "Blackwater. Since It's starting to get modern like saint denis it aint extremely hot or cold too",
            "West Elizabeth. Love the redwoods.",
            "A ranch in the Heartlands. I already live in an area that's basically Roanoke Ridge, I want a nice, flat piece of land.",
            "Strawberry, 1911. The electricity is hooked up (I think?), Micah is dead so no more massacres, and the temperature would suit me perfectly. Main downside is that it’s a bit of a way to Riggs Station for a day out to Saint Denis, but oh well - could always get a carriage to Valentine and a train from there.",
            "I love how nobody in this comment section prefers Saint Denis or Annesburg.",
            "Ambarino. Just a cabin. Leave me be",
            "Strawberry. No real gang problems. Beautiful lake on your doorstep. Nice climate. Just got to dodge the occasional bear or cougar.",
            "Aberdeen Pig Farm",
            "Big Valley, near Little Creek River. Actually I’d happily live like John in the epilogue, at Pronghorn Ranch just doing ranch stuff all day",
            "I loved where Charlotte was living. Remote, water source, cool weather.",
            "Definitely Big Valley, and specifically Pronghorn Ranch in 1907! Such a beautiful area.",
            "Saint Denis. I’m a city person",
            "Black water",
            "I feel like I’m in Bayou NWA in real life, so I’d want to head over to Big Valley",
            "Emerald Ranch... Loved it on the albert mason mission... Horses running on shallow water... Everytime i visit ER, i always imagine myself living there... Peaceful",
            "Grizzlies west, i like the snow and just being surrounded by it sounds great, plus i could always ice fish or hunt for food",
            "Both Strawberry and Blackwater are super nice, but till the Van Der Linde Gang shows up there and shoots everyone in sight.\n\n\nIn that case, maybe Armadillo.",
            "Well since you asked.. \n- Hanging Dog Ranch \n- Wapiti Reservation \n- The Loft \nor a cute studio near the gallery in Saint Denis",
            "Jeremy Gills little cottage. It’s in a beautiful location, Rhodes or Valentine are near enough and it’s geographically far from any psychotic gangs. Plentiful animals. Just about perfect. ",
            "New Hanover. Great land, plus I could find a house with a beautiful view of the mountains which is what ive always wanted in real life lol.",
            "Saint denis.",
            "Valentines.",
            "Great Plains or Big Valley. I would occasionally travel to Tumbleweed for business.",
            "I'd like a farm near O'Creagh's Run where I could also go hunting. Not too hot and plenty of wild country around me. A fews ride to town but plenty of natural herbs for medicine as needed. Plenty of fish too. Just gotta watch out for bears. Could even trade with the Wapiti if they are willing.",
            "West Elizabeth",
            "We can all agree no one will choose to live in the tall trees with those Skinner people running around.",
            "Rhodes.",
            "Tahiti",
            "Tall trees is so beautiful",
            "> You can also live in any states/cities mentioned in game\n\nOff to Tahiti I go",
            "I’d probably make a home out of the Loft in the grizzlies. I love it up there and I love the cold weather.",
            "Blackwater, any time after the massacre",
            "Roanoke Ridge chillin' with the murfrees",
            "Anywhere except Guarma.",
            "Tumbleweed",
            "Emerald ranch",
            "A want a small flat on the main street in Annesburg. (I have a black lung fetish.)",
            "Nuevo Paraiso",
            "strawberry i think",
            "TUH HEET EEH",
            "Call me basic but I like Valentine, folk make a good honest life and an honest days work. Will also take building a ranch house without the help of my uncle as option 2",
            "Great Plains of West Elizabeth, it's basically the fictional version of where I live, except in the States where as I'm across the border to the north.",
            "I really like the area in Hennigans Stead that overlooks the desert.   If you go toward the long tunnel from the McFarlan Ranch end and go just to the left there is a whole other area of grass and trees.  Very nice area.    I also like the area around Hammish’s cabin",
            "Northern part of West Elizabeth. I enjoy being randomly attacked by cougars.",
            "Tahiti.",
            "like a Grizzlies East I spend hours there is so wonderful",
            "Lemoyne, reminds me of home… the south",
            "New Austin, and start over as a Marshalls perhaps sheriff, hell maybe be a Bounty Hunter!",
            "I'm in southern, rural, AZ so I already live in RDR2 lol",
            "Either Valentine or Emerald Ranch.",
            "The Loft.",
            "The Loft",
            "Green area",
            "Valentine. As much as I love my irl state of Virginia seeking that out would put me smack dab in the middle of Mufree Territory, Which I'd rather not. In Valentine as long as you don't fuck around you aren't likely to be Shot dead.",
            "Valentine easily",
            "Scarlett Meadows and the Heartlands are so pretty.",
            "Tall Trees because I love Michigan.",
            "100% would take over The Veteran’s home.",
            "The Loft up in Ambarino has always been so cool and majestic imo",
            "Hanging Dog Ranch.  If I was living in it, it would stop being a site of mass murder like it does every time I'm within a mile of it.   Neighbours at Pronghorn are good people, and I love the location.",
            "I'd find the most Scandinavian wife I could, become the Sherrif of Strawberry, have that wench relocated away from the bars of the jail, and gun down anyone who impeded on my paradise. Micah would've never made it to trial.",
            "Given my record I need to accept Sisika as my permanent residence...",
            "Strawberry",
            "Have to say near strawberry or tall trees",
            "Blackwater",
            "North Western Ambriano, where the Colter is. I like cold and snow.",
            "Near Valentine",
            "Cumberland",
            "Probably around New Hanover, particularly near the Heartland Overflow, it's relatively nice around there, and while Valentine or Rhodes is a good ways away I think that areas pretty nice",
            "Big Valley would be hella peaceful except for O’Driscolls so I would choose big valley 1911",
            "Tahiti.",
            "Hanging Dog Ranch in Big Valley",
            "Tahiti!",
            "New hanover,love the scenery",
            "Black water",
            "Big Valley no doubt",
            "The heartlands",
            "Big Valley or Grizzlies East",
            "Hanging dog ranch. Some of the nicest scenery in the whole game around there.",
            "I feel like NORTHERN west elizabeth is a nice choice. Won't get scalped in that area",
            "**West Elizabeth near Strawberry**. It's my favorite place to travel to, just imagining having a cabin near the mountains as well as other scenic areas, and it's such a comfy location being in those woods. It's not near the swamps of LeMoyne and it's not a dry land like New Hanover or Blackwater. I would like to live in Blackwater as my second option because of the comfy tree areas of Tall Trees.",
            "Strawberry all day.",
            "I’d love to take over Mr Geddes’ ranch!",
            "Big valley is dreamy, so maybe Strawberry",
            "Uncle",
            "Technically I live in tall trees , as beautiful as it is here I would probably go with around valentine or emerald ranch area.",
            "Purple",
            "Painted Sky hood views from there",
            "Big Valley, West Elizabeth",
            "East Ambarino",
            "Somewhere in West Elizabeth, or the heartlands in New Hanover. Close to the lake",
            "the heartlands. i would love to live in a house right next to twin stack pass.",
            "Valentines but please please not online",
            "I love Rhodes and Blackwater. Saint Denis too.",
            "probably near O'Creags Run, it will be very quiet and without too much danger other than wolves or bears",
            "I’d actually love to live in that little house right on lake don julio.",
            "Specifically, probably near Flatneck Station/Horseshoe Overlook in The Heartlands of New Hanover. A moderate I can see the snow-capped mountains of Ambarino, the lush green hills of West Elizabeth, the glow of Blackwater off in the distance, and still be only a short treck from the hot Lemoyne swamps and Plantations. \n\nIf not there specifically, either put me in Strawberry/West Elizabeth, or Cumberland Forest/Grizzlies East area.",
            "Sisika. I be a bad boy",
            "Saint Denis",
            "By Rhodes or Strawberry. Probably Rhodes, it's closer to the city yet not in the city - seems like a good location. Strawberry is more of a resort you could do tourist things there but ehh.",
            "Grizzlies west by colter.",
            "Grizzlies west just bc of how pretty it is",
            "I’ll take the time travellers place or Charlotte Balfour’s place",
            "Prob somewhere in west Elizabeth, near blackwater or ne-ar the McFarlane ranch idk",
            "I'd love to live in New Hanover, because of its view of the mountains, and it's green naturey (is that a word?) area.",
            "Big Valley, Scarlet Meadows, or Saint Denis.",
            "Rebuild the cabin north of aurora basin in tall trees",
            "I’m chillin in colter",
            "Big Valley. I hate heat and it’s really cool all the time, surrounded by forests, fields, and rivers. There is plenty of wildlife around and not too many people. I’d love to live there, every time I pass through it’s just gorgeous.",
            "West Elizabeth, Blackwater! I just really like this town",
            "Butcher Creek. I’m at least a 7 there.",
            "Tall trees or strawberry. I like the mountains and forests",
            "New Austin 1899 or 1907, specifically, tumbleweed because of the sherif there, I'll just never leave tumbleweed and I'm safe",
            "blackwater easily",
            "Strawberry. It’s beautiful and peaceful. Valentine would be good too though!",
            "Lemoyne should be split in half: Bayou Nwa and Scarlet Meadows.",
            "1911 big valley ",
            "I've always loved Charlotte's cabin spot by Brandywine Drop. If the Murfree Brood wasn't present, that would be the best spot.\n\nUp near the waterfall with a secluded section of land.",
            "West of strawberry, on lake Owanjila",
            "Strawberry would be very nice, so probably west Elizabeth.",
            "Strawberry no doubt. Nice and quiet. Not too crowded and definitely doesn’t seem like a place that gets very hot.",
            "Cumberland Forest or big Valley",
            "black water or saint denis. i love big towns and warmer weather",
            "Top right, near Charlotte's house\n\nOr with her",
            "Strawberry would be good after the massacre, dirt cheap houses.\nOr Grizzlies east would be cool too but no settlement.",
            "strawberry and big valley",
            "Heartlands ez",
            "tahiti",
            "In the purple area. I want to live near Strawberry.",
            "Big valley, west Elizabeth. Gorgeous. Just not in strawberry.",
            "Roanoke ridge",
            "I'm a city boy, gimme the grime of St Denis",
            "Ambarino. Checks off everything I love. Nature. No people. The cold. Winter and snow. No people. Higher in the mountains, so low humidity. No people. Yes sir, I love that.",
            "Honest Beechers hope is great. Secluded, lots of land. John made a good choice",
            "Definitely not Guarma that’s for damn sure",
            "in one of those nice houses on the outskirts of Blackwater",
            "Waterfall by the train tracks above Annesburg",
            "Strawberry.",
            "Considering the brutal heatwave we're having in India, I'd take The Heartlands. Neither too cold nor too hot. Perfect.",
            "Tall trees all day baby",
            "Strawberry its calm...if micah isnt in prison",
            "Rhodes or valentine",
            "Everywhere is great, but personally Beecher’s Hope truly does feel like home.",
            "LeMoyne, on a spread with 100 acres of woods growing tobacco near Rhodes. Reminds me a lot of home(from the South).",
            "Caltor. I'm Polish. I like the cold and snow",
            "One of those houses on the cliff outside of Valentine. \n\nA cabin near strawberry would be cozy too",
            "Prolly Blackwater its a town id open up a gunshop that would be turned into some other shop by the grandchildren since gunshops wont be that important",
            "Big valley by Stawberry or the Grizzlies",
            "Strawberry honestly. I love the mountains and forest vibes there",
            "Where’s Tahiti?",
            "S T R A W B E R R Y",
            "I’ve always loved Tall Trees but I live in Washington State so I pretty much already live there lol.",
            "Either Blackwater or New Hanover",
            "Valentine or strawberry I like a chill area",
            "def down near tumbleweed or maybe new hanover",
            "Strawberry",
            "Big Valley",
            "Guarma",
            "1. Strawberry 2. Hennigan’s Stead",
            "Really anywhere besides New Austin, Tall trees, Saint Denis, and Roanoke Ridge would be nice.",
            "where i live doesnt matter only thing that matter is that he should live",
            "the heartlands. No predators other than people.",
            "I’ve always been a city guy so despite the bad name the game gives it I’d have to go with Saint Denis. I wouldn’t mind Rhodes either if it were a little more progressive.",
            "Grizzlies East. O’Creighs Run is paradise.",
            "That Indian reservation area. The surrounding area near the lake is absolutely beautiful. Either here or big valley.",
            "Big Valley is stunning.",
            "The Great Plains in West Elizabeth.",
            "On wapiti reservation",
            "Cumberland forest",
            "Strawberry is my jam since it's close to hanover",
            "In between strawberry and big valley probably. Close enough to civilization to be relatively safe from outlaws but also close enough to enjoy some sweet beautiful nature.",
            "Light green, 1911.",
            "Id love to own pronghorn ranch. \n\nOr Hamish's cabin.",
            "I’d say lemonye, I could kill some lemoyne raiders and loot them",
            "Valentine, will occasionally visit Blackwater and Strawberry.",
            "I'd say anywhere in the West Elizabeth area. I'll go with the Great Plains here.",
            "Valentine or saibt Denis both have tons of amenities and you can use the train.",
            "Right outside strawberry",
            "Top of Roanoke Ridge above Brandywine Drop out in the rural sticks",
            "Strawberry. They got their shit together there...",
            "Tall trees",
            "I like the forestry of Annesburg/Roanoke Ridge, but without the pollution and murdery locals. So maybe Big Valley",
            "Mansion in Saint Denis",
            "Anywhere you can wake up and shoot a homocidal inbred lunatic is perfectly fine",
            "Anywhere in West Elizabeth.That whole place is gorgeous. Okay, the entire map is gorgeous, but I find West Elizabeth to be the most",
            "I’m from Oklahoma, so probably New Hanover",
            "Traducir texto con tu cámara\n\n1907 on the ranch in the epilogue, it still has the charm of the wild west with wonderful meadows to hunt whenever you want",
            "Big Valley.",
            "Tahiti",
            "Blackwater.",
            "One of the Saint Denis mansions. or if I'm poor then in Valentine",
            "The Big Valley, Tall Trees, or Emerald Ranch.",
            "Probably west elizabeth, either big valley or tall trees, ignoring all the gang stuff like the skinners and odriscolls. Cumberland forest would be pretty nice too. \n\nAlso it's really bothering me that every state is divided into their sub sections except Lamoyne.",
            "For me it’s The Heartlands or Bayou NWA",
            "Bright green - New Hanover, near Emerald Ranch",
            "Definetly between strawberry and blackwater.",
            "I would love to live in West Elizabeth. Somewhere over by Big Valley and Owanjila. Nice and relaxing with lots of beautiful flora and fauna. I would spend most of my days fishing on the lake or collecting pretty flowers.",
            "Big Valley. I’d love to own Hanging dog ranch",
            "Strawberry.  Small mountain town is perfect.",
            "New Handover 1899",
            "O'creagh's run. A beautiful pond and away from the Skinners and Murphys.",
            "Either near Valentine or at Hamish cabin",
            "Give me a little ranch along the sea of Coronado.",
            "Definitely just anywhere in The Heartlands. So much land, horseshoe overlook, Valentine, and it experiences all types of weather",
            "Probably Valentine. I don't like the mud but the climate is nice and it's fairly quiet in 1911 after the gangs are gone. I wouldn't mind having a cabin in the  Cumberland Forest.\n\nAlso, I like your South Carolina pfp OP! You must live there too.",
            "Blackwater. It's more affluent than Valentine, and it has a good chunk the amenities of Saint Denis without the humidity",
            " Grizzlies East.  Always.",
            "I actually love Bayou Nwa because it reminds me of New Orleans, so for me it’d be most interesting living there circa 1898/99.",
            "Butcher creek",
            "Strawberry. A little dream of mine.",
            "Strawberry or Blackwater. One is a mountain resort town and the other is closest to civilization. \n\nThe State of Hanover is essentially modern day Oklahoma, Kansas, Nebraska and the Ozark region of Missouri and Arkansas. The only exception is Cumberland Falls basically Black Hill National Forest of South Dakota. It looks cool and nice in the game but that’s because the writers didn’t put a lot of effort in showing the deeply unsettling racial history and high religiosity of the areas. Seriously, I wouldn’t want to live in any of the modern day Great Plains states even if you pay me. \n\nLemoyne is Louisiana and some other swampy parts of the Deep South. Regardless of how I like New Orleans and Cajun food, I would not live in a state that just passed laws to force everyone to learn and follow the Ten Commandments. Fuck the entire Deep South.",
            "Screw you im going to Tahiti",
            "Valentine",
            "West Elizabeth or New Hanover (minus the Roanoke Ridge area cause screw that)",
            "GIVE ME VALENTINE\n\nOR GIVE ME DEATH",
            "Around Strawberry.",
            "Annesburg or upper West Elizabeth",
            "As someone from Miami, literally any point northwest from Lemoyne. I hate Strawberry as an in-game city but I would love to be stationed there.\n\nThat being said, I wonder how many people who live in really cold areas would pick Lemoyne.",
            "Blackwater",
            "lemoyne, looks like the easiest place to start a career and live an actual life",
            "West Elizabeth, in Dutch’s secret cabin. Preferably with him there.",
            "You’re telling me the outline of the RDR2 map isn’t dick and balls?",
            "I wanna say Annesberg but it's too close to them backwoods ass Murfrees",
            "Tbh anywhere from strawberry to Rhodes  anywhere past those are some of my most hated places \n\nForgot abt blackwater. Blackwater is also a decent place",
            "Probably up near Brandywine Drop or somewhere in the Grizzlies East, those are my picks",
            "A cabin outside of Valentine and Strawberry in 1907. I would've said Blackwater, but New Hanover and Northern West Elizabeth seems like it would have the perfect temperature for me.",
            "Definitely strawberry or Grizzlies East",
            "Both purple colors.",
            "Saint deniiiis is coooool",
            "Around Donner falls, year doesn't matter or in Hamish crib",
            "Grizzlies East or Cumland Forest",
            "I would love to retire in Great Plains with my ranch and cows to milk.",
            "Annsburg. I reckon the coal fumes would give you a wicked buzz",
            "Probably up in Colter it maybe shitty but it's isolated not many dangerous species of animal and free food blankets clothing etc",
            "I’m a Louisianan so Saint Denis",
            "Blackwater for the climate, in 1911, as that’s about as modern as medicine can get",
            "Saint Denis.. I just know the food is good.",
            "West Elizabeth. It’s just nice.",
            "Yes definitely New Hanover, tired of humans",
            "Above the N in Ambarino.",
            "Strawberry or big valley. Temperature is coldish but can get fairly nice. Views are amazing. Near Blackwater and Valentine. Seems tranquil. \n\nThat said, Saint Denis would be my choice (I'm ultimately a city person) if it weren't constantly super hot and surrounded by gators.",
            "Scarlett Meadows, right on the edge of New Hannover.",
            "In the Grizzlies or near Isabella Lake.",
            "I hate the west/east/south\n\nSo probably cumberland forest or heartlands",
            "Grizzlies or New Hanover",
            "Strawberry. It’s such a beautiful town despite the dumbass mayor. Beautiful scenery and higher up in the mountains… oof.",
            "St denis",
            "Somewhere in big valley easily. Hanging dog ranch honestly is perfect for me. I love that it’s in the middle of the vale and I can go on a hike up a mountain whenever i want. There’s a nice stream that runs through it. Hanging dog is perfect for me",
            "by modern standards the life everywhere is miserable, except for corrupted Saint Denis elites. I'd like to befriend Cornwall, Fussar, and Lemieux and occupy former Bronte's mansion",
            "anywhere in Ambarino or New Hanover",
            "On a mango farm in Tahiti",
            "I’d either own a ranch in big valley or a small cabin in tall trees (minus the skinner brothers)",
            "West Elizabeth, specifically in the Big Valley region seems just about perfect to me. \n\nIn the RDR world every single one of these is pretty fucked lol.",
            "🍓",
            "Big Valley, WE. But it also looks a hell of a lot like British Columbia, which is where I’m from.",
            "CumPie village",
            "At the reservation with my people!",
            "A nice small house in Scarlett Meadow north of Rhodes would sound pretty tranquil",
            "I prefer mild to cooler weather. So I'd want to be up in New Hanover. But I also see the merit of being close to a more advanced settlement like Saint Denis. So being on the eastern side would be best. \n\nOf course how far/long of a travel is relative. After all, the distance from Valentine to Rhodes is considered a rather long trip. So, being in the East near Emerald Ranch seems wise.",
            "Armadillo.",
            "I’d live just outside of Valentine. Has to be one of the best towns in the game",
            "I already live in what would be Lemoyne but if it was up to me-Hanging Dog Ranch for the Fields of Flowers and views.",
            "Tbh, either Strawberry or Valentine",
            "Saint Denis the night life is far better there",
            "Sisika Penitentiary",
            "I’d say Strawberry because it’s the most aesthetically pleasing town, and it’s in the most beautiful region of the game, but the truth is that I’ve never lived in a rural area before and I’d probably hate it if I had to stay there long term. I want to be able to walk to restaurants and business, and have multiple options for entertainment. \n\nSo, Saint Denis it is.",
            "West Elizabeth I think, in the woods. Scenery is so nice. But, not always too safe",
            "Thieves Landing",
            "I think tall trees would be the best overall, nice location, close to the dense forests of West Elizabeth and the deserts of New Austin",
            "Somewhere between blackwater and strawberry",
            "Forever in love with Strawberry 🍓",
            "1911 Northern West Elizabeth",
            "New Hanover",
            "I'd live west of Lake Owanjila. It's a pretty nice area with some appropriate strangeness like the faces in the trees.",
            "Tall trees, on the lake. Have a stand up on the hill in case I see mf’s lurking I can retreat and have the high ground (RIP ANAKIN)",
            "New Hanover Heartlands and Valentine area seems like the most livable not too hot not too cold. I’d also say Blackwater too but I would want a summer house in Big Valley West Elizabeth.",
            "Somewhere around St. Denis. I like humid weather. The bugs would be tough but I would thrive in that environment. \n\nMaybe a little house west of St. Denis, east of Rhodes, good location if you want to take in a show but still isolated enough to raise horsies and maybe some pigs and goats.",
            "Guarma",
            "Valentine region seems the safest environment and has the least crime and psycho gangs.",
            "Up in Annesburg with the Murphy Brood. Seem like some decent folk.",
            "New Hanover, West of the Emerald Ranch, not too near to hear the oil mines, but close enough to Valentine, Emerald, stables and even Rhodes. Its a safe country with nice people.",
            "Colter",
            "Anywhere except for New Austin. Preferably New Hanover.",
            "Outside of  Strawberry/ East Tall Trees",
            "Big valley or grizzlies",
            "something tells me my only hope of survival would be in saint denis",
            "Lemoyne for sure. Not Saint Denis, but the swamps right outside of it. If not that, then O’Creagh’s.",
            "Big Valley or Grizzlies East. Just so supremely gorgeous. The northern part of Roanoke Ridge is pretty great too.",
            "Strawberry hands down. Fell in love with the place as soon as I arrived. And so did John.",
            "Annesburg or Grizzlies. It’s the places I visit the most to explore.\n\nThis makes me want to replay the game and start all over again. [+]",
            "México with Luisa. Viva la revolución!",
            "Never realized how similar the rdr2 map looks to Austria lol🇦🇹",
            "Big valley, somewhere in strawberry or in Blackwater aewa",
            "In online for rdr2 I tend to stay down in lemoyne just cause I like the swampy area but tbh I've been playing my completed story lately for shits and giggles and like...there's so many spots in this world that at that time I wouldn't mind having a house there, and if you removed the train tracks those spots almost triple for me",
            "Gotta be West Elizabeth for me. Seems like a phenomenal place",
            "O'Creagh's Run. Or, my own cabin on Cattail Pond. Also like a place pretty much anywhere in the clearing along Little Creek River. I love Clemens Point. If I could build there, I'd never leave it. There are many areas.",
            "definitely tall trees in 1907, very peaceful area.",
            "1911 MacFarlane’s ranch, got everything you need. Sheriff, train, store, little home, a job, not too hot, not too cold. Seems like a good choice. And… I mean the beautiful Ms MacFarlane",
            "Australia or Tahiti",
            "Big Valley",
            "Saint Denis. I need *sOCieTy.*",
            "Rhodes. I can be a tabaco farmer. If the times get really tough, I can grab my guns and go bounty hunting.",
            "Strawberry. For sure",
            "Tall Trees",
            "Ima city boi. Saint Denis easy",
            "Valentine or strawberry",
            "Starwberry or valentine most likely, in 1899",
            "Definetly near mcfarlanes ranch i just like the look of the place",
            "Blackwater in 1911",
            "West Elizabeth",
            "West Elizabeth and or ambarino. The area around strawberry would be heavenly.",
            "West Elisabeth. Strawberry",
            "Strawberry, or the surrounding area.",
            "Odd choice but somewhere around Hennigan’s stead I just feel like around where the legendary tatanka bison is pretty peaceful and nice to live at",
            "Personally I like the big valley area.  Out near pronghorn ranch.  You get to get the wilderness lifestyle wit a beautiful landscape.  Lake Owanjila nearby.  All the deer, pronghorn, elk, moose, white cougars.  Epilogue part 1 is memorable for me bc of that region.  However I do like the great plains but that might just be Marston nostalgia.",
            "Armadillo. The property values have got to be rock bottom, and the only thing you really need to do differently is make sure you boil your water for 15 minutes. Practically free real estate.",
            "I've always thought I'd like to live in that house on the lake in Aurora Basin. It's the kind of terrain I love, and if I need a change of pace it's not too far from either Blackwater or Strawberry.",
            "Big Valley or Tall Trees",
            "Gimme that cabin at O’Creaghs Run. Absolutely Beautiful spot.",
            "Strawberry.  So lovely",
            "Somewhere in West Elizabeth. Trees, water, animals",
            "I'll take an out-of-the-way cabin in Tall Trees. Maybe a little vegetable patch and some chickens and a sheep or two.",
            "Grizzlies east - the quiet life",
            "Either big valley or tall trees",
            "Either Big Valley or The Heartlands",
            "A house in northern West Elizabeth, North if big valley",
            "Big valley..  literally nothing to worry about except walking into your house and a bear being in you living room lmfao",
            "Strawberry no question",
            "Blackwater!!!!",
            "The spacing is kinda interesting in red dead like is rhodes just a little ride over to st denis Like it is ingame or is it a huge distance but if i could live near rhodes and ride to st denis or get the train And go do some Shopping and pass by My 1899 Factory and shipyard i own",
            "Strawberry",
            "the beautiful ranch in cumberland forest outside of Valentine, 1899.",
            "I would go to tall trees if not for the skinner brothers so probably A little North East of Strawberry in West Elizabeth.",
            "Purple, has good food, nice climate, overall good choice.",
            "Strawberry ftw!",
            "This small shack at Stillwater creek... Hannigan's stead",
            "Definitely big valley! Tucked between those mountains, nearest town is peaceful Strawberry (after Micah...). There's so many pretty little cabins there.",
            "In the Veteran's Homestead where Hamish lives on the shore of O'Creagh's Run. That looks like a dream to me, just have to look out for bears 😄",
            "In one of those big house in Saint Denis",
            "Big Valley is big vibes \n\nBut Roanoke is basically where I grew up and do miss it.",
            "Big Valley",
            "North of East grizzlies seems peaceful, up by the loft area",
            "Tall trees",
            "West Ambarino in the mountains. I'll fist fight bears every day.",
            "Blackwater probably has amazing views of the sunset.",
            "Blackwater is becoming pretty modern by 1911 and it isn't too city like but also isn't too town like it's just perfect and major towns/cities aren't far. So probably there",
            "Love this. I want a nice cabin right outside of everyone between Wallace station and valentine",
            "I’m already worried for Lenny at that party",
            "I love valentine. You got everything there, a barbershop in the saloon, a gunstore, a drugstore and the general store. Only thing discouraging me from wanting to live there is the whole curse the town has.\n\nStrawberry on the other hand, is missing the gunstore and the barbershop, so i would have to travel to either blackwater or valentine for that",
            ">Probably on a small ranch just outside of Valentine.\n\nJust.. don’t take out any loans from any Austrian guys, alright?",
            "Your ranch will probably be raided by O'Driscolls",
            "No kidding, my A/C hasn't kept my house under 80. I would do Strawberry or Big Valley. Already live in St Denis and knew the owners of the real Braithwaite",
            "I'll be at Keane's Saloon",
            "New Hanover is a depiction of New Hampshire -  Nashua, NH with heat index was 103 F a couple days ago, it was the hottest town in the USA by 11 AM. No escaping the heat!",
            "This town ain’t big enough",
            "Yeah, this is my answer as well.",
            "Ok Reverend, lol.",
            "Unless you know where to look.",
            "This. Any town I live in would have to have a saloon.",
            "It does have booze, just not a saloon. In the general store there is whiskey and such that you can buy, but it's more expensive than most places because it's a generally dry town. And possibly because the shop owner has an underground moonshine operation, so he's making alcohol more expensive, meaning less likely for people to vuy it, so then he can use it to make Moonshine. Although I'm not too sure if that's how moonshine works lmao.",
            "This is a bonus, there’s enough drunken fools in the street in modern England, I don’t need them in my idealised place to live too",
            "I’m not a big drinker so I’m not too fussed!",
            "The people who drank back then would scare the fuck out of me. \n\nI'm taking my chances in a dry town. I don't want some guy who's dying get drunk and decide to go out with a bang.",
            "that don’t bother me none",
            "Pave that main street and you basically have a modern small Midwest town anyway. Could easily be livable.",
            "That sounds pretty nice, you could spend a day riding through Cumberland Gap.",
            "Just watch out for the killer prostitutes.",
            "Valentine canonically reeks of sheep shit",
            "I just wiped out the O'Driscolls from there. I spent a few days just chilling in their hideout, enjoying the scenery, hunting perfect pelts, taming horses....it was great. Could definitely live there",
            "This is the only most logical answer.\n\nEdit: This answer logical.",
            "I’d definitely live in Lone Mule Stead (just south east of Strawberry)",
            "Strawberry as my main place with a vacation home in big valley. #goals",
            "That sounds great, a nice little cabin, miles away from any town. Spend the whole day fishing or hunting. That really does sound peaceful!",
            "And money",
            "JUST ONE MORE BIG SCORE",
            "If that’s your PLAN…",
            "We just need a little distraction",
            "Look… I’ve GOTT a Plaaan",
            "It’s a magical place",
            "WHAT GODDAMN PLAN DUTCH?!?\n\n  \nTAHITI??\n\nTIMBUKTU?",
            "If it had a barbershop it would be perfect",
            "The all round colour palette of Rhodes and most of Scarlett Meadows is just 🤌🏼🤌🏼",
            "Yeah I love Rhodes too",
            "To the grave it is then",
            "Tahiti 🤑🤩😍🤩🤑",
            "I was actually going to say Saint Denis for mine but now that you say that, Blackwater was becoming very modern and they were expanding it, by the 1930’s it would probably be massive and super modern. So I think I too will go with Blackwater.",
            "Gotta love Blackwater 1907, aside from the Skinners, lack of gunsmiths and doctors… it’s pretty much all you need.",
            "What about the Skiners?",
            "Strawberry does seem like such a nice town to live in!",
            "Lots of work to be had after Micah slaughtered the townspeople",
            "You could peep through that woman's window too",
            "Just a shame it's a dry town",
            "I would happily live in a mansion in Saint Denis",
            "I love New Orleans both IRL and in RDR2, but I’m sick of the heat in the south. Give me crisp, mountain/valley air. And fewer reptiles and bugs.",
            "I haven't seen any Van Horns either. Although, I don't blame them.",
            "saint denis seems like the only realistic option to me. walkable town with plenty of amenities and business opportunity. probably is the safest place for a solo traveler. just about everywhere else comes with an increased risk of getting mutilated or hanged or robbed+killed. sure, you get more freedom in other places but you might just end up on the gallows anyway for defending yourself or die in a freak hunting or ranching accident.\n\nthe question is: \"where do you want to live?\" if i was stuck in this world, then any career or residence i took up in that world would be to build up enough wealth so that i could move to and make it in saint denis. i want to die old; not live young.",
            "Well if you like breathing in coal dust, Annesburg might just be the place for you!",
            "I mean given the choice most people wouldn’t live in the crowded, polluted and dirty city when there’s quite a bit of open range everywhere else",
            "I refuse to live anywhere near the Murfree Brood or the Night Folk",
            "Nobody is saying Lagras either. Or Lakay for that matter.",
            "Annesburg is practically hell",
            "I love St Denis, that’s what I’d choose",
            "Lmao",
            "I’ve lived in the real life versions of lemoyne and the blackwater area, and I live in real life version cholla springs now\n\nLouisiana wasn’t bad and I love the desert, but I think a lot of people are sleeping on how nice it would be to live in guarma or some of the Mexican settlements if crime/violence wasn’t a factor. But I hate the cold so I have a bias",
            "Its my favorite town, i wish there would be more things to do.",
            "You and me both. I would love to have the cottage on Cairn lake. Just needs a little TLC.",
            "I never thought about wapiti, seems like a cool place to live, before it gets abandoned anyway.",
            "The odriscolls roam the area though. I had an encounter with them near that cabin once. They are generally active in the new hanover area.",
            "2nd this",
            "The Adlers looked like they had a good thing going.",
            "You mean east Elizabeth?",
            "LEENNNNYYYYY",
            "Id rather him be at the party than , ya know...",
            "Curse? I must've missed that",
            "😂",
            "Yeah, no doubt. Won't do that, for sure. 👍🤣",
            "moonshine is usually made with corn, fermented and distilled pretty much like other alcohol, with some additional process to make it stronger. I don’t think they used pre-distilled whiskey to make it",
            "👻 BOO",
            "Pretty sobering thought about urban sprawl",
            "To Johnson City, Tennessee?",
            "Nah we good I snitched",
            "This is just pure happiness to my ears! Where did you sleep tho can you access the house on the right of the ranch? I never could get in except during the mission",
            "I did this one time as well. I had a pretty big bounty so every morning I'd be hunted, but I had the Gatling gun in the barn so it wasn't an issue.",
            "Honestly the Hanging Dog ranch would be fire to live in once cleared from the O’Driscolls",
            "Well I mean, until you run into a bear, cougar or a pack of wolves…",
            "And some GAWD DAMN FAITH",
            "And a train there's always a train",
            "I mean, you can always take a wagon ride to the closest barber, it's not that expensive",
            "To shreds you say",
            "Lmao",
            "I’m sure every area will have its dangers.",
            "Just choose 1911. They are gone by then.",
            "Hence the consideration for getting into Saint Denis!",
            "The mayor's mansion seems nice enough.",
            "Spent some time in the mountains recently. Forgot what crisp air feels like vs pretty much drinking the air like soup",
            "Also if mosquitos werent an issue, they suck, literally",
            "Perfect location, tho i would be nearer the top of the mountain overlooking it and the valley nearby, the dawn and sunset would look beautiful",
            "Love the communal feel (despite the constant threat of settler violence). The landscape isn’t bad either + close to water. \n\nAlso, I can’t believe I forgot this one and it’s easily in my top 3 - O’Creagh’s Run.",
            "Ynnel?",
            "There is supposed to be a curse in valentine related to the native americans that were killed by the settlers",
            "A couple of townspeople including the gunsmith mention it, but I don’t recall anything in game ever actually expanding on it.",
            "?? \n\nMaking whiskey and moonshine are the same exact process except shine literally isn't watered down (hence moonshiners going blind because they didn't cut the methanol \"heads\" of the run from the ethanol \"hearts\". All of that comes out of the still at like 160-180 proof (shine).\n\nYou add water to dilute the alcohol content (technically vodka at this point), and then age it in barrels for a specific period of time (or cut it with caramel and flavorants) and you have whiskey. \n\nHe probably makes bank by selling his shine cheaper than the brand name stuff, and everyone goes for it because it's more effective anyway.",
            "The process is \"less water\".",
            "Omg don't scare me like that",
            "Ugh Johnson City.... No good memories there",
            "Excellent Old Crow reference",
            "Don’t worry bro I got the reference",
            "The Cumberland Gap is west of Johnson City. So I never understood how you could head west from there to Johnson City.",
            "Oh I just shot her",
            "Nah you can't get in the house itself, but there's plenty of bedrolls next to the fire. What I also really like is when it's raining hard you can bring your horse into the barn and keep him dry.\n\nEdit : can't from the door but apparently windows and roof get you in",
            "Too many bears and cougars, not enough people really. You'd get mauled one day, and you'd be far from any doctor or stores",
            "True. That’s why you need to be packing some heat!",
            "Or Arthur benign controlled by a psychopath like me",
            "There's always a goddamn train!",
            "How is his wife holding up?",
            "Yeah, but the Skinner Brothers and Murfree Brood are especially bad.",
            "haha I played this mission today",
            "Fuck Johnson City, sincerely, a kid from Boone.",
            "That band is INCREDIBLE live. I saw them perform at the Ryman in 2015 for the Grand Ole Opry, it was sure something",
            "I helped her then shot and looted her",
            "You can break the window next to the door and get in that way, though the door will be locked of course, I just cleared the place a couple of days ago",
            ">Nah you can't get in the house itself,\n\nYou can't get in through the doors, but you can smash through the windows! Just try jumping through any of the front windows.\n\nI think one of the beds can be slept in.\n\nYou can also loot the cash box over and over if >!Sadie !<hasn't gotten to them.",
            "This is great roleplay I’ll definitely go do that tomorrow when I hop on the game thanks!",
            "I think we all forget that in this scenario, we're *absolutely* the NPCs of the game haha. Working 12+ hours a week, living hand to mouth essentially.",
            "To shreds you say!",
            "Not bad, but inherently Evil!",
            "Just kill them all!",
            "Did you see \"the room\"?",
            "I'm from Johnson City and I agree. I left that town as soon as I could.",
            "Wait Boone NC?",
            "Living off 12+ hours a WEEK??? That’s living the dream I worked 24hrs in the past 4 days alone.",
            "Was his apartment rent controlled?",
            "True.",
            "Can you actually wipe them out entirely in the game?",
            "Room?",
            "yes! I was like wow! That's so neat!",
            "I once worked 56 hours straight in 2 days.",
            "I don't think so, but I can take 30 out every time I'm by the camp.",
            "[deleted]",
            "💀",
            "Did u watch",
            "yes but i did not know that was there"
        ]
    },
    "What’s your favorite gun?": {
        "title": "What’s your favorite gun?",
        "score": 424,
        "url": "https://www.reddit.com/gallery/1dlls4g",
        "content": "I love the Lancaster Repeater but I’m looking for new guns to try so I’d love some suggestions :D",
        "num_comments": 195,
        "comments": [
            "Pump action cause it cool to throw ppl to the ground and blow em up 😂",
            "The bolt-action rifle has been my go to for a little while now",
            "Lancaster Repeater and Volcanic Pistol.",
            "Semi auto shotgun I call the warcrime stick.",
            "I'd say Lancaster Repeater and the Repeating Shotgun! I've been giving the Evans repeater a go, and I have been liking it!",
            "The bolt action rifle is by far my favorite gun in the game",
            "Cattleman's are always my sidearms, but bolt action rifle and pump action shotgun are always on my back when I'm not on my horse. The bolt action on mine has the scope and the pump action actually has a faster fire rate than the repeating shotgun.",
            "I love how the Evans repeater sounds.",
            "Volcano Pistol, I just love the sound of the gun firing, it has a very \"Super Shotgun\" feel to it. Each shot is reminiscent of two trains crashing into each other.",
            "The Lemat that thing is so neat looking and the switch to shotgun thing is fun",
            "Schofield Revolver bae. So well balanced!",
            "varmint rifle, high rof, long range, a lot of bullets, but small damage and slowish reload. it's a beast if you can hit headshots",
            "Something I've noticed while playing red dead, arthur seems to like most guns. He knows how to use all of them, but revolvers seem to be his favorite",
            "Lancaster repeater forever🤗🤞",
            "LeMat ! underrated tbh",
            "Double action revolver or Navy Revolver. A bit special cause it was link to GTA V ❤️",
            "Bolt Action rifle and Pump action shotgun are my go tos",
            "Calllways revolver\n\nAlso is the coat on slide 4 modded?",
            "Sawed off shotgun, cattleman revolver, Springfield rifle and the bow",
            "The Cattleman fully upgraded with a long barrel",
            "I'm loyal to my Evans repeater",
            "Evans repeater",
            "Carbine, can't beat a solid sniper in my opinion",
            "Carbine Repeater",
            "I like Scotchfield revolver, Pump shotgun and Bow and arrow.",
            "Semi auto shotgun",
            "Lemat and pump action shotgun\n\nAnd if that don't work...\n\nUse the volcanic pistol",
            "Probably the double action I could go the whole game with it",
            "Bolt action, can’t go wrong with it",
            "I LOVE the bolt action. It may be because I love krag rifles. And 30-40s. Idk but it’s my all time favourite. I usually like to play ads and that gun has amazing irons",
            "Bolt action rifle",
            "Semi auto shotgun has been my best friend ever since I stole it from some random old lady",
            "M1899, Navy, Lancaster, Carcano, Sawn Off, Lemat, BA Rifle",
            "Bolt action sniper rifle. Only sniper you can toggle scope",
            "Volcanic pistol/Lemat revolver",
            "bolt action rifle and m1911",
            "varmint rifle is fun to troll ur enemies",
            "Gold mausers",
            "Arthur's got Hosea vibes in the first pic",
            "The bolt action is a really good rifle",
            "Cattleman's, a lancaster and a double barrel shotgun is my loadout. Pretty basic but the others don't feel as western.",
            "rolling block without the scope is so pretty I love it",
            "Nothing better than revolvers, duals and blasting away feels bad ass",
            "My go-to load out is a fully customized cattleman, with any other type of handgun (I mostly use Schofield for efficiency.) Then the Lancaster, with either the bolt action, double barrel, or carcano rifle. I’d recommend putting a scope on you’re non-snipers tho, cause you can toggle the scope and I find it useful if I’m out hunting or in a firefight.",
            "Man I honestly can't quite pic a favorite, but my go to loadout was always thr Schofield, Sawed Off, Lancaster, and Bolt. It was honestly such a perfect combo for my playstyle :) unless of course I was out hunting, man I love that game",
            "Dual Schofield really does it for me, especially after I realized the beautiful combo of blackened steel and gold inlay engravings, and its accurate enough for headshots in medium range even when dual wielding.",
            "The Mauser is definitely my favourite sidearm. 10 rounds, zeroes by the time most revolvers have pulled their hammer back, and is blistering fast for Deadeye multikills. Billy Midnight is a blessing for allowing me to use it in chapter 2. \n\nFor long guns, I'm quite torn. I've got four favourites: Evans Repeater, Litchfield Repeater, Double Barrel Shotgun and Repeating Shotgun. I think the latter for both types would win if they weren't unlocked in Chapter 6, mainly because >!I want to stay as Arthur but his sickness and the gang falling apart is painful to stick with.!< I can definitely say I dislike the rifles and long scope rifles though (save for the Rolling Block with the scope removal glitch)",
            "Lancaster",
            "The 12 gauge double barrel Remington.\n\nShop smart, S-Mart",
            "m1899 basically a glock i love it",
            "Double schofields. Can’t go wrong with that.",
            "If you aren’t rocking the pump action shotgun, bolt action, and dully double action revolvers do you even cowboy?",
            "Calloway's revolver. The style!",
            "Antagonise button🤝",
            "Whatever you choose, dont sleep on the varmit rifle.",
            "yall all talking about longarms, I'm more than content with a trusty schofield with express loaded :)",
            "M1911, Semi Auto Shotgun (with slugs) and Carcano. I could care less about a repeater. Those three guns and I can do anything I need to do.",
            "Springfield Rifle",
            "Pump action cause you can make people learn how to do a backflip only with the pull of the trigger or Mauser pistol because dual wielding them is basically an smg",
            "I can't really say I'm fairly new to the game this might seem a bit silly but I like the crossbow nice and quiet kills unless I'm surrounded the volcanic revolver does me well.",
            "Springfield, pump and duel wielding schofield revolvers.",
            "High Power Pistol",
            "Love how the Schofield sounds",
            "In the base game, the Schofield.  \nOnline, the Navy revolver.",
            "The rare double barrel because it has the coolest method of acquiring it by killing the funny hermit guy. That guy shocked me my first playthrough barging through the door and filling my chest with lead lol.",
            "Been maining Flaco's in my right, Granger's off hand for some dual custom Cattlemen.\n\nAlthough there's something about the sharp crack of two Dual Actions popping off. So I'll use the High Roller and another.",
            "Volcanic Pistol makes me feel powerful",
            "Winchester",
            "Pump & Bolt Action",
            "Litchfield repeater , volcanic pistol , Springfield rifle ,bolt action rifle all I need",
            "Double barel shotgun. It looks cool.",
            "Does the maxim gun count? /j",
            "Lanchaster repeater on top",
            "Bolt action rifle and Litchfield,Mauser Pistol are nice ",
            "Pump action carcano and midnight pistol",
            "Lancaster repeater. I feel like it’s good at whatever you need it to do",
            "Springfiled rifle or lancaster repeater- MY BROS 🔥🔥",
            "LANCASTER absolutely fucks every single time !",
            "My favourite gun in the entire Red Dead series is the Scorpion Revolver",
            "It would be the Cattleman if it didn’t have that horrible projectile deviation when hip firing, so Schofield.",
            "Sawed off. Just for shits and giggles I’ve started running dual sawed offs with slugs and it’s been a lot of fun. Not real practical for missions, but great for dominating Murfree’s when they try to ambush you. Running behind trees like Mel Gibson in The Patriot",
            "Bolt action",
            "Revolvers: Double Action, Pistols: M1899 ,Repeaters: Lancaster, Rifles: Bolt Action, Shotguns: Pump Action. You see, i am a man of actions 😂",
            "Bolt action and rare rolling block rifle for me",
            "semi auto shotgun becuase that gun is just op or dual cattleman revolvers cuz i like the way people customize the set",
            "Double action revolvers",
            "Going by the compendium, it's my fists, then the cattleman, then the varmint rifle\n\nLately I've been in chapter 4 and doing a lot of flower finding for a certain discerning collector. Needless to say, the pump shotgun has been a permanent fixture for dealing with gators, and I've kind of fallen in love with it. Slugs are a must",
            "The Mauser C96 ... there's something unique about it",
            "Dual wield double action revs, pump shotgun , bolt action rifle and carbine repeater.",
            "Bolt action rifle or pump shotgun. Or Schofield revolver",
            "LemaT cus boom",
            "Duel wield Schofield revolver just seems badass",
            "Schofield is my “civil weapon” that I use mainly for execution but for actual combat I’m going with a pump action shotgun or Springfield rifle",
            "high honor cattlemen revolvers. one is silver with gold engravings. the other one is gold with silver engravings.",
            "always liked the semi auto and repeating shotguns",
            "Lancaster and Schofield",
            "This game is the coolest out there",
            "The double barrel, true cowboy fun",
            "Lemat revolver.",
            "Hatchet",
            "I think the least fun guns are repeaters, even though they're the most practical.\n\nThe pistols are fun because 3/4 are pieces of modern weaponry in the 'wild west'.\n\nRifles are fun when you headshot someone from miles away with no scope.\n\nShotguns are fun because, well, they're shotguns.\n\nAnd revolvers are fun because you *are* a cowboy when using them, you can't beat a no-dead-eye headshot quickdraw 🥶",
            "Semi auto shotgun with slugs. Unstoppable combination",
            "Lancaster repeater.",
            "My main 3 guns I cycle through are revolver/volcanic revolver, long range is carbine repeater, and pump shotgun. No matter of better guns come I’ll still pick these 3",
            "Shell from a sawn off shot gun  when used duel wielding is beautiful. Removing heads left right and centre",
            "Cattleman revolvers, Evans Repeater, bolt action rifle. This is generally my go to for any play through.",
            "Lancaster is the best",
            "Either double sawed off shotguns, double volcanic pistols or double Schofields, when playing as Arthur I had it all plated in gold and silver, while playing John I made them blued steel with iron. Depends on how I’m feeling",
            "Well, offline? Gotta be Bolt Action Rifle. It's effective for hunting and fighting. However, in online, gotta be the Navy Revolver.",
            "Mauser Pistol. Finding out it was in the game was kinda the main reason I bought it",
            "Springfield Rifle",
            "Rolling block 😭 I just love sniping, and I use it as binoculars lmao",
            "Sidearm: lemat revolver.\n\nRifle: bolt action Rifle.\n\nShotgun: repeating shotgun.",
            "Pump bc it’s it’s the ol reliable",
            "I love the double barrel, just very satisfying.",
            "Springfield rifle",
            "Pump action. It IS the pinnacle of engineering in this game. It is almost ALWAYS a one shot kill, and I love it SO MUCH",
            "Volcanic pistol for a side arm, and Springfield Rifle for long range",
            "Sawed off shotgun 🤠",
            "Litchfield and Cattleman",
            "Springfield Rifle.",
            "Elephant rifle 🗿",
            "Navy revolver in online then the Lancaster then the cattleman looks wise.",
            "Springfield, volcanic pistols, bow.",
            "Schofield Revolver is definitely, love the way it handle and looks\n\nHonorable mention to Bolt Action Rifle",
            "Bolt Action\n\nThat gun ROCKS",
            "You ever tried wielding dual Mausers loaded with explosive rounds?",
            "2 m1899 fully gold engraved fully upgraded absolutely beautiful they can shoot so quickly and it’s a mag so reload don’t take long",
            "Colt SAA, Winchester 1873, Winchester M1893 and Krag-Jørgensen.",
            "Double barrel shotgun, springfield rifle  or lematt revolver is a great choice (my opinion)",
            "Glock",
            "Cattleman Revolver, it's best if you're hunting rabbits.",
            "The Lichfield repeater",
            "Online the navy revolver, story mode the Lancaster repeater",
            "Evans repeater is hard to beat for looks, historical accuracy and capacity. If you’re accurate you shouldn’t have to reload more than once in most combat missions. Springfield also goated",
            "Lemat revolver and Lancaster repeater",
            "Evans repeater in steel/ silver. That bad boy sounds like a canon.",
            "evans repeater and rolling block rifle are my favorites",
            "Lancaster repeater and bolt action",
            "Mauser eats through ammo like its a homeless man at an all you can eat buffet",
            "No guns, the bow is the way to go",
            "Double barrel shotgun, just love cracking it open to reload",
            "Gatekeeper",
            "double action revolver\n\non paper it's accuracy is bad \n\nbut on action i swear to god it has infinite accuracy\n\nwith catleman it was hard to aim but with double action i get a lot of headtshots \n\nuse it with dual wield trust me",
            "Schofield revolver, I don't use big guns unless I'm hunting",
            "I think I use Lancaster repeater the most",
            "Gold revolver",
            "dual wield revolvers with the most ammo. its so fucking funny going into deadeye and spamming like 20 bullets and watching their slow motion body get riddled",
            "Bolt action rifle",
            "Colt single action army. 2nd is definitely the Winchester rifle",
            "It will always be the semi auto shotgun for rifle and the mauser for pistol",
            "I love the sound of racking the slide or the pump . Tsh tshk sound is satisfying",
            "oo yes that one is good!",
            "Same here!! The noise it makes in dead eye is haunting but so damn cool",
            "since day 1",
            "If you can handle no lock on you should try to use the no scope carcano. Its basically a bolt action but better in every single way",
            "I feel I’m in FaZe dropping 360 no scopes bro",
            ">Volcanic Pistol\n\nI think you misspelt sawed off repeater",
            "Now load fire buckshot",
            "evans is very good! i don’t really use the shotguns in red dead so i’ll definitely check that one out :)",
            "Evans is my favourite, it's fast and effective",
            "I feckin love a cattleman, sure Schofields are the undoubted most powerful, but cattleman's with a long barrel are baddass 🥸",
            "The 26 round hand cannon",
            "I'm shocked I had to scroll so far down to find anyone mentioning the LeMat. If you made me guess what the most popular gun is, I would have guessed LeMat, but I'm completely wrong lol.",
            "Good for hunting small game too. I dont like to carry a bunch of guns so I like the varmit rifles adaptability.",
            "notice how rdr1 cover image is john with a sawed off double barrel and rdr2 cover image is arthur with a revolver.",
            "Where is any indication that arthurs favourite guns are revolvers? That's just random shit you made up.",
            "Can you getting navy revolver in story mode?",
            " Nope",
            "I use it with a short scope",
            "Same for the Springfield.",
            "🤝 antagonise",
            "Came here to say this, that's exactly why i use pump shotgun whenever an enemy gets too close.\n\nI mostly use one of the gunslinger's revolvers because i like how killcams look when you use a revolver, especially dual revolvers.\n\nOther times i take the evans repeater or the varmint rifle, they're pretty nice too.",
            "manually racking the pump during a kill cam is the greatest thing i’ve ever witnessed in a video game.",
            "Do mean just pull the trigger instead of aiming? Or is there a way to remove the scope on it",
            "Eheheheh",
            "lol. I guess that’s why I like it so much. It’s a Lancaster that you can duel wield and also do cool tricks with.",
            "I like the way you think",
            "Might be since it's only in Online. I'm only able to play Story because of mods, for instance.",
            "Nope",
            "i prefer single revolver dual cams, cause if you press trigger while it’s playing out arthur will cock any gun he’s holding. you can’t can’t do that while dual wielding though",
            "It's a glitch, you have to look it up on YT. Idk if it's available in RDO but it's shreds in singleplayer",
            "Not quite. There’s a glitch to remove the scope. I don’t remember how to do it but maybe someone on here does.",
            "The LeMat is available in story mode as well.",
            "Well that's bullshit",
            "Oh yeah i like that too, the single revolver aiming stance is the pose Arthur does on the cover. Looks badass in killcams too.",
            "Where is it available?",
            "If you play on pc you can mod it in. Still a load of shit that it’s not in there already.",
            "You can buy it in the San Denis gun store but it's locked behind a story mission in chapter 4.",
            "Hmm, alright. Thanks."
        ]
    },
    "Arthur enjoys a refreshing bath": {
        "title": "Arthur enjoys a refreshing bath",
        "score": 242,
        "url": "https://v.redd.it/mwy6jqfcb28d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "WHY IS IT SKINNED",
            "Okay ... please tell me it was a nightmare",
            "Resident Evil vibes",
            "I have only 3 words to describe this\n\nWhat. The. Fuck?",
            "Undead nightmare 2 leaked",
            "I bet that bears last words where \"You'll Regret this! Ill be back!\"",
            "Jesus, this is almost as bad as the bear scene in *Annihilation*.",
            "That is one... skimpy bath maid",
            "Wtf xD",
            "I just realized I have hundreds of hours in that game and never took a shower",
            "Can't wear clothes in the bath of course :D",
            "FURS ARE JUST ANIMAL SKINS!",
            "If it can be cut off it’s clothes dk why Arthur still has his skin on tho"
        ]
    },
    "I have a theory that John's mother is Mexican ": {
        "title": "I have a theory that John's mother is Mexican ",
        "score": 722,
        "url": "https://i.redd.it/p1eud3sljz7d1.jpeg",
        "content": "Even before the events of RDR1 John has always seemed to have a fascination with Mexico. My headcanon for that is that John's mother who died giving birth to him might've been a mexican prostitute.\n\nFor one,  John is very unique looking, ignoring the scars he's has very bold facial features with jet black hair. He mentions his father being Scottish which I would have never imagined John being based just off looks.\n\nThere's not a lot to prove this theory but I'm Brazilian and we are very mixed. And even as a kid I always thought John looked like a few of my uncles.\n",
        "num_comments": 189,
        "comments": [
            "Scottish people can have black hair lol",
            "Black hair and dark brown hair is not uncommon in all of europe, including the UK and Ireland.",
            "My uncle (unrelated) is from Scotland and he has black hair.",
            "I have black hair. \n\nI guess I'm Mexican too despite no part of my family tree ever having stepped foot in Mexico lmao",
            "I have a theory that John's father was an elk",
            "John made it clear that his origins are Scottish. He has no resemblance of Hispanic ethnicity at all.",
            "We are so used to conventionally attractive protagonists that when one looks a little crusty and weathered with question his ethnicity. John is just a average looking guy from the 1800s",
            "This is a shit theory",
            "My grandfather was 100% Scottish, and had blue eyes black hair, my dad and uncle also have black hair",
            "He doesn’t have black hair in RDR1 he has brown hair but they fucked up his appearance in RDR2 for whatever reason.",
            "The man goes to Mexico because he has a Mexican friend he needs to kill and somehow you use that to create a Mexican prostitute mom connection? That’s certainly one of the takes of all time",
            "So then my whiter than snow, almost translucently so, dad, who had never set foot in Mexico, is Mexican too because he had jet-black hair and almost black eyes?\n\n\nGood to know.",
            "What’s the theory?",
            "Ngl, back when the game was new and i wasn’t deep into the lore, i did think he was partly mexican. Part of why he doesn’t really belong anywhere bc he isn’t “fully” american nor mexican. Also his raggedy mustache is very mexican lookin.\n\nOr maybe he was just so cool that i tried to project part o myself onto him to pretend we have something in common",
            "He is just tan. That applies to brazilians as well, i am a brazilian. White guys with jet black hair and with a more tan type of skin are not rare to see. Also the hair of john is dark brown, but i can see why it is painted to be black sometimes.\n\nNot every white has a white pink-ish tone of skin.",
            "John doesn’t even have jet black hair, his hair is brown. His epilogue hair was made to be black for whatever reason, but his hair is brown.\n\nEven if it was black, that wouldn’t prove that he’s Mexican lmao",
            "I mean. It’s definitely possible? I can definitely see the scot in him with his cheekbones and nose, but I could also see him being Mexican or native mixed. Chances are he’s not, but I doubt he knew anything about his mother so he probably doesn’t know himself.",
            "To be honest I always just kinda assumed he was part Hispanic from the first time I played rdr1 as a kid, just from looks alone. I'm surprised that's not true for one, and that everyone is so offended at the idea for two lmao",
            "Herbert Moon when he sees John",
            "An interesting theory, but a weak one.",
            "I feel like it would be a cool plotline but there's no actual evidence at all.\n\nAnd look wise he doesn't look it at all.\n\nSo it is completely speculative but I'm not sure why people are getting so worked up about it.",
            "I had heard he may be Native???",
            "I got black hair and my mom is a Mexican prostitute, you might have a point here",
            "I support this message",
            "I have a theory that John’s penis is black",
            "It's thought that dark coloring, eyes and hair in Irish, Welsh and other celts is the result of distant middle eastern and African ancestry. There are blue-eyed blonde and red-haired people from the Mediterranean.\n\nCatharines Zeta-Jones is Irish Welsh and yet in Zorro they had her play a Spanish (part Mexican?) character.",
            "Honestly with the way Jack looks in the epilogue of rdr1 I would believe it",
            "Hey op I like your theory I can definitely see it",
            "Jack has a more tan skin tone, but John has a more scottish complexion. And jet-black hair isn’t an uncommon thing in Scotland too.",
            "I considered this too. As his facial features resemble mine a bit and I’m a ScottsIrish Mexican. I know damn well it ain’t the case.",
            "I actually totally agree with this theory… only because there was little to no mention of his mother (which may mean her reputation was something John wasn’t necessarily proud of). \n\nBut also in the RDR disc case - it came with a poster of woman with dark hair (possibly latino features) and a scar, dressed in provocative clothing (possibly a prostitute) \n\nAnd she never really appeared in either of the games. So I always imagined it may have been John’s mother..",
            "He was born on a boat full of Scottish immigrants coming over FROM Scotland",
            "I like it!",
            "Why is everybody against the theory, being mexican makes him cooler",
            "Interesting 🤔",
            "He's Scottish.  It makes sense.",
            "If this were the case you’d think it’d come up somehow in the entire second act of RDR1 where he spends the entire time in Mexico…",
            "We know John's mother was a sex worker",
            "Que pasa ese...",
            "If his mother died in child birth, how would he have time to get fascinated with Mexico?",
            "He's an American whom the first thing he did when he entered Mexico was kill a few Mexicans",
            "RDR1 John is one sexy mf",
            "Well there’s no such thing as a Mexican race. It’s a nationality. Mexicans can be Spanish, Native American, black, Asian, or any other mix of ethnicities. His mom could be Native American as there were hundreds of Native American groups in Mexico at the time. Some now extinct in the real world.",
            "my mom is scottish and looks similar to john",
            "John doesn’t have black hair, RDR2’s shaders are just broken. It’s the brownest hair ever in RDR1.",
            "His hair is not jet black",
            "I believe he has a mother",
            "Outlunged again...",
            "why the hell would a mexican go all the way up to new york?",
            "E nombreee John Marston.",
            "I always assumed his mother was Native American. As that too would fit for his look and be similar to Red Harlow who is actually half Native American.",
            "He looks a tiny bit like Sean Connery now that you mention him being scottish. Connery was scottish. Dont think your theory holds.",
            "John looks quite Scottish, I’m Scottish I can confirm.",
            "Would explain why jack grows up to look like Javier.",
            "If you play the Veteran stranger missions as John, he’ll say that he was born in the Northern parts of the US. It’s possible that his mom might’ve been Mexican or Hispanic, but pretty unlikely and his dark complexion is probably due to genetics. The real world reason as to why John looks a bit mixed race is because he was intended to be the son of Red Harlow, who was half Native American.",
            "John Marston? Nah bro, more like Juan Martha 🤠",
            "I think i am the lost son of a german prostitute because i am a pale brazilian that never stepped foot in North America or europe and has natural blue eyes and blonde hair.",
            "It’s getting hilarious seeing people called or implied to be racist for pointing out that the OPs theory is wrong when the reason it’s wrong is it’s based entirely on an inaccurate racial stereotype.  \n\nLots of Scottish and Irish people have black hair (I’m Irish and most of my family do) and a white guy who lived out in the open all his life isn’t going to be pasty white.  As ever the simplest answers is the correct one.",
            "RDR2 Jack looks white but RDR Jack looks more Mexican than John imo",
            "I always used to confuse John with Javier so who knows",
            "my father is scottish, jet black hair. well, silver now but you get the point. scottish people dont only have red hair and pale skin. he works in a desert ranch for chrissakes",
            "White guy with black hair is definitely a combination that exists in Scotland what the fuck are you smoking because I need it",
            "I dyed my hair and became Mexican ",
            "🫡🫡",
            "he does mention his mother was a prostitute, that’s literally the only thing your theory can hinge upon, everything else is just kinda.. okay? there’s no evidence at all that he has any mexican heritage in him at all, and nothing about his looks really suggests that. he’s kinda just a generic looking white dude with black hair",
            "I have a theory that John's",
            "Why does the Mexican have to be a prostitute lmao",
            "John doesn't have black hair in Redemption 1, including in the image you posted. He only has black hair in the epilogue of Redemption 2",
            "He’s Scottish…",
            "He only has jet black hair in the epilogue because rockstar fucked him up",
            "“jet black hair”\nshows pic of john w brown hair",
            "John doesn't even have black hair, what on earth is this theory",
            "It’s just modeled after a dudes face it aint that deep bro, you just prefer him being part Hispanic bc u like him and are Hispanic as well",
            "Good for you.",
            "nahhhhh everyone in scotland, the irish’s nations and wales all have ginger hair, everybody knows that",
            "I have a theory that he’s actually an Inuit hear me out: \n\nthe voices told me",
            "I'm fascinated in Japan and I have black hair like most Japanese people does that mean I'm half Japanese?",
            "I don't think John has Mexican descent, there are many Scots with black hair, not all of them are blonde or redheaded lol",
            "I have black hair. I am scottish. My family go back centuries over here. Clan MacRae... we have no one from Mexico in our blood. I also... tan... um...",
            "John is part Mexican, and the proof is he likes Mexico, and has black hair. Got it.",
            "i dig it! also, i like his appearance in rdr1 much more than two. has more of a charlie bronson aesthetic.",
            "First of all, his hair is brown. It's always been brown. They just messed it up in the Epilogue because Rockstar decided to slap John's skin over Arthur's model, didn't bother using the right hair assets, and has refused to fix it even after all these years for god knows what reason. \n\nSecond of all, why would there a Mexican prostitute in Scottland in the 1800s? I'm not saying they're couldn't have been. I'm just saying it'd be much more plausible for his mom to just be a dark-haired Scottish woman because shocker, those do exist.",
            "This. Similar to Black Irish (which didn’t mean Irish of African American heritage/African descent, but just white Irish with black/dark hair lol)",
            "OP fighting demons rn. Bro’s never seen Sean Connery",
            "My DNA results came back about 1 third Scotts-Irish 1 third English and 1 third Scandanavian. Yet myself and most of my family have dark brown to black curly hair and darker complexion.",
            "Black is the color of my true love’s hair",
            "For one, John doesn’t even have black hair. It’s the brownest hair I’ve ever seen in RDR1",
            "maybe mexico stepped on your family",
            "Not just that but his skin seems slightly tanner, although he is a rancher.\n\nBut look at his appearance, he has the Keanu Reaves thing going on where you can tell he's not 100% white",
            "Nah man, he was a wolf. Why do you think they're so drawn to him?",
            "He's handsome as fuck imo",
            "I didn't mean to imply John was ugly in anyway, he's definitely a handsome man. I just meant he has a very unique look.\n\nI've seen a lot of these \"RDR movie cast\" posts, and there's probably noone that looks exactly like John. He's the male zendaya in a way.",
            "Well, come up with a better one then you bastard.\n\nAlso I agree",
            "then dont comment and waste peoples time",
            "why? you hate mexicans, we get it",
            "you can’t tell john’s NPC model is brown like it is in one because it’s so greasy",
            "Hair can lighten in shade with age",
            "Idk man, RDR1's colours are pretty muddy but it looks pretty black to me. It's also black on all the promotional art",
            "That John has some salsa running through his veins",
            "I might be Dr McDougall",
            "I remember seeing a few camp interactions where John asks Javier about Mexico, or saying that he wants to visit Mexico.\n\nYou could just write it off as fan service though",
            "I always figured she was like the GTA cover girls. Not really characters, just attractive women meant to portray the aesthetic of the game.",
            "Bad theory: I’ve seen it before. Mahogany kinda color more or less",
            "I think your confusing that with John's father, he was born on a boat, John was born somewhere in the north of the US",
            "Stories passed from father",
            "Doesn't Arthur say the exact same thing? About being born up north.",
            "Jack is white he’s just kind of busted looking.",
            "No he doesn’t lol.  Just because he has a goatee?",
            "The highest concentration of prostitution shown in the rdr series is in Mexico I think he was using it as a basis",
            "I’m Irish and have a very sallow/brown complexion. Maw maw reckons it’s cos the Spanish Armada came and fucked a bunch of us on the west back 4 centuries ago. \nWhy not eh? 😂 ",
            ">Irish of African American heritage \n\nLol",
            "I’m Irish and due to belief I am not a ginger I am quite tall aswell \n\nAnd I have seen a few black Irish people in my lifetime",
            "This. I tell people my family is black Irish and they just stare at me like I'm the idiot lol",
            "African-AMERICAN?\n\nI mean, its a thing, but like....c'mon...",
            "African-American?",
            "for some reasons i thought of irish from rdr1 but that doesent make sense XD",
            "So what do you call Half Nigerian half Irish people? One of my ancestors was one, but I can only find these census with their name from 183* something when the oldest was in her 30s.",
            "Her lips are like some roses fair",
            "We white people do tan …",
            "Bro u good? Whats that phrenology book doing out on your bed",
            "Is this a joke? Scottish people don't have a set 'look,' you'll find that most of us do infact have brown hair, like John. \n\n\nJohn was also in the blazing sun most of the time, so of course he's going to be tan.",
            "I know plenty of white people who work in the sun so much they get tan enough to almost look brown including my dad and my gfs dad",
            "White people tan too",
            "White people tan you know. He’s a gunfighter, outlaw and a rancher. He gets sun. It’d be weird if he wasn’t tanned.",
            "Being a cowboy will make you tan you fucking idiot, white people tan like crazy",
            "he’s tanner because in rdr1 he is going to hotter places with more sun. in rdr2 he’s pretty damn pale",
            "I can see it",
            "everyone tans bro",
            "And his mother was an elk!",
            "I always feel like I'm the only one who thinks he actually looks cool as fuck 😂",
            "User flair checks out.",
            "No man. He's white. Go meet more ppl jfc",
            "Norman Reedus looks like him.",
            "Not every caucasian guy is lighter than paper, see Cristiano Ronaldo: he has the same skin tone as John's, but do you question his ethnicity? Also, when you are under the sun all day long for years, it's expected you get a tan or get awfully red if you're white. And I'm brazilian too, i have a lot of relatives that have the same skin tone because of their mostly caucasian background.",
            "Dawg did you just compare a completely Caucasian John to a person of mixed ethnicity?!\n\nPlease go outside and meet actual human beings, please little buddy 🤣😂",
            "Bro wtf are you talking about. Go outside and talk to real humans",
            "John is a white guy with black hair.\n\nJust like millions of other white guys with black hair lmao\n\nBoom. Counter Theory.",
            "Your name seems pretty fitting, amigo.",
            "Re insufrible sos",
            "trying to insinuate a racist narrative to make someone look bad just makes you look bad. something tells me you hate mexicans…",
            "**This** is also a shit theory",
            "Yeah",
            "No. There's just zero evidence to point to it you sensitive boy.",
            "Even his NPC hair in 1899 is brown. His hair is only black in the epilogue because Rockstar fucked up his model",
            "It’s clearly brown just look at the pic you posted. Having muddy colors wouldn’t change anything because Abigail has clearly black hair in RDR1",
            "Ah cool 🆒",
            "\"Mexico mentioned... he must be PART MEXICAN\"\n\nreally man?",
            "Bro I want to live in Antarctica, doesn’t mean my dad was a penguin escort",
            "So wants to visit Mexico = being Mexican?",
            "Wanting to visit Mexico doesn't at all mean he's part Mexican.",
            "Fan service is John being Scottish. Anything beyond that is just whatever OP's weird fantasy fulfilment is.",
            "You're grabbing at air",
            "His father was an illiterate immigrant who died when he was 8 or something.",
            "He does",
            "Rdr2 fans when goatee (he fucking has to be Javier’s son or else I’ll kill you”",
            "He actually kinda looks like rdr2 Javier",
            "Oh I didn’t play 1",
            "I mean, the Irish were originally Celt-Iberian.",
            "Seeing someone say maw maw warms my little southern American heart",
            "lmao you’d be surprised how many people would think Black Irish means a black person who happens to be Irish. I’m like “mmmm no, no, that’s uh…that’s not what it is” 😂",
            "are you talking about Black Irish (white folk) or Irish who are Black lol (because yes, they exist, but they are not what’s typically referenced when one says Black Irish)\n\nTBH, most Irish I met were NOT Ginger. I find that funny now that I think about it",
            "🤷‍♀️ Hell if I know, but someone who is actually **from Ireland** can correct me. Black Irish Person? Afro-Irish (similar to Afro-German/Afro-French)? Hell it could be Black Irish today, but that’s not the origin of the term",
            "I’ve known someone that worked in agriculture in Swiss. In the winter: regular white man. In the summer, after working so much outside in the burning sun: incredibly dark, nearly offensive 😭",
            "Step-eugenicist what are you doing?",
            "Yes, that's what I implied with him being a rancher.\n\nHonestly most people were tan in the 1800's assuming you weren't a big city snob",
            "[deleted]",
            "You sure about that?",
            "Actually that doesn't change anything, I think he tell Bonnie the same thing in the first game 😂",
            "I believe John is canonically from Illinois.",
            "Yea that's exactly what I thought haha",
            "🤔🤔🤔",
            "New studies indicate a Pontic Caspian Steppe origin. So it would be more accurate to call the Irish \"ancient Russians\" than \"ancient Spaniards.\"\n\nhttps://greekreporter.com/2016/01/02/new-paper-examines-pontic-roots-of-ireland/\n\nJust don't tell Putin. He might get some \"funny ideas.\"",
            "Thats not what I was referring to",
            "I might piss you off but if you mean black Irish as in a prodasant (or how you spell it) I don’t know his religion but I guess it’s catholic because I live in a mostly catholic town \n\nBut in short yes he is black as in brown skin",
            "You would call them Irish, what's the colour of their skin have to do with anything, only Americans get hung up on something as stupid as skin tone.",
            "Eh, my dad is scotch Irish and has a very similar skin tone. He just tans really well. My mom is also scotch Irish and has a very fair completion, so she doesn’t tan well.",
            "isn´t this just the case for all europe though , originally proto indo europeans all coming from the pontic steppe region.",
            "Ireland now called Littler Russia by the Kremlin",
            "I wasn’t replying to that comment, I replied to the one where you LOL’d about African American Irish",
            "Prodasant! ='D \nWhat does religion have to do with skin color? Do you mean that only white people can be protestant? Like they'd be at the church door like \"sorry you are not allowed inside because you are black. Try next door at the catholic church.\"",
            "I can tell you at wiring by the way you spelled Protestant haha. I love it though makes sense in that accent",
            "That's to do with the black men. The royal black preceptory no doubt.",
            "Protestant :)\n\nNot pissed off, I can’t be mad about my own black folks! 😂 But yes, there needs to be a better way to distinguish between the two. Like Black Irish having the original significance (white folk with black/dark hair) and (B)lack (I)rish being black people who are of African descent…or SOMETHING lol\n\nETA: It’s funny because the (B)lack (I)rish 🤭 I’ve met are usually born of either American parents who for whatever reason reside in Ireland now or ONE parent is American and by default, so are they. I always wondered why that is",
            "He thinks it's funny because instead of saying just \"African Descent,\" you said \"African-American\"",
            "No that's just mormonism",
            "I mean black can be referred to black people and prodasant",
            "I think he is saying that calling someone Black (Irish) is conflated with being English/Protestant in Ireland itself."
        ]
    }
}