{
    "BIOHAZARD 2 Manhua (Hong Kong) has been translated into English by Lunar Indie Studios": {
        "title": "BIOHAZARD 2 Manhua (Hong Kong) has been translated into English by Lunar Indie Studios",
        "score": 18,
        "url": "https://www.projectumbrella.net/biohazard-2-manhua-hong-kong.html",
        "content": "It’s the one where Leon is a vampire BOW thing that fights a talking dragon with ki blasts.\n\nHosted on Project Umbrella",
        "num_comments": 1,
        "comments": [
            "Nice"
        ]
    },
    "With the closure of the Xbox 360 Marketplace on July 29, several legacy Capcom titles on the platform will no longer be available for purchase. Now is your last chance to buy RE0, RE4, RE5, RE6, REHD And\nRERev at up to 90% off before they're gone!": {
        "title": "With the closure of the Xbox 360 Marketplace on July 29, several legacy Capcom titles on the platform will no longer be available for purchase. Now is your last chance to buy RE0, RE4, RE5, RE6, REHD And\nRERev at up to 90% off before they're gone!",
        "score": 85,
        "url": "https://i.redd.it/2wm2ulww9t7d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "I thought the 360 games would still be buyable through the Xbox one store due to the retrocompatibility and fuly playable on the OG 360, just not available for purchase on the 360 store itself?",
            "Does anyone remember Remember Me?",
            "[Capcom USA Tweet](https://Twitter.com/CapcomUSA_/status/1803929596364247156)\n\nIt sure these titles will be missed ;)\n\nIf you're planning to add some to your collection at cheap price, Then this is the time!",
            "So many great games for sooo cheap.\n\nAnd then there is Street Fighter X Tekken. Dying the way it lived. An abhorrent money grab. 🫡",
            "Aren't like all the titles you just named backward compatible and NOT going away after the 360 store shuts down?",
            "Mmm but if i am not wrong most of these games still have a lot of loose content in DLCs that are not on sale. I think their modern versions have better prices for the full game when they are on sale.",
            "Remember Me is one hell of a game. It's got a magnificent mood and atmosphere. Killer soundtrack, too. Grab it. It's an unpolished gem. I like games like this. For example, back in day, I really fell in love with Hydrophobia from the XBLA due to similar reasons.",
            "Does anyone have a good list of everything that can be sorted by price? Navigating the website is a pain in the ass and I feel like I have to search specific titles to find anything  I can't just find a list of \"360 games on heavy sale\"",
            "What about Operation Raccoon City?",
            "You can still buy these games on PC, the only platform that doesn't expire.",
            "The delisting of RE6 is an event that should be celebrated, hopefully the other storefronts do the same.",
            "Some are available to buy on console but most of the titles on sale you have to buy on Xbox.com",
            "I do. Got it for free on PS Plus back in the day when the PS3 was still getting new games. The combat was so boring, and the whole “create your own combo” gimmick was such a nothingburger. You could tell that the story was what really interested the guys at Dontnod because the game that made them relatively well known, Life is Strange, eschewed traditional gameplay for Telltale style adventure game stuff to great success. Would be cool to see them revisit the world now, in the LiS/Tell Me Why format.",
            "Not in the least",
            "It must have not been a great game if I don't remember it",
            "The 360 versions of the RE games are being delisted since they have Xbox One versions. They're not backwards compatible. The only 360 RE games that will stay are CVX and ORC. Not sure about the other games on the list.",
            "I think you still will be able to buy everything if you have a xbox one or xbox series. This only affects people that have the 360 only",
            "Lmao, bro forgot there's Xbox One and PS4 versions that can be used on new gen.",
            "I didn’t forget. One less place to buy that abomination is a good thing"
        ]
    },
    "\nResident Evil 2 Remake reached over 13.9M units sold and is currently the highest selling game of the franchise": {
        "title": "\nResident Evil 2 Remake reached over 13.9M units sold and is currently the highest selling game of the franchise",
        "score": 1181,
        "url": "https://x.com/dev1_official/status/1804092647746798079",
        "content": "",
        "num_comments": 139,
        "comments": [
            "Deserved",
            "According to the tweet, they only had the time now to celebrate and threw a party.",
            "It was an instant classic. Completely changed the fate of the studio. Not saying they'd go bankrupt, but there are games that clearly shift the destiny of a company.\n\nRE7 did too but remaking the older games was a pretty good choice that allowed new people to get into the franchise.",
            "I'm glad Ada got a cake along with Leon and Claire from their shot on the cover.",
            "Definitely deserved imo. No over exaggeration, I've been gaming since I was 4 years old. The first game I ever played was Sonic 2. the second was the first Resident Evil. It's my favorite video game series, no contest. I say all that to say that after I beat RE2R when it came out, I remember constantly thinking to myself, \" Is this my favorite game of all time?\". Sat on it for years waiting for the excitement of this game to wear off....it hasn't. This is, without a doubt, the best game ever made to me. It's exactly how I always pictured a modern RE game to play. It had everything I ever wanted from a Resident Evil game. Yeah, it sucks that they didn't adapt the zapping system from the original, but I just can't overlook how they perfected the formula imo.\n\nTLDR: This is my best game ever made, so I'm happy to hear.",
            "RE5 is still the highest selling, it’s sold about 14.5 million actually, if you include the re-releases, which many publications don’t. It’s confusing for many people with conflicting numbers here and there, but currently Resident Evil 5 is still number 1.\n\n\nCongratulations to RE2R for being as new as it is and being such a success!",
            "As a new fan of the RE game franchise I’m glad that it sold so much and is doing well. It was really addicting once I got to it and I replayed it 4 times back to back. I’m now on RE5 and loving the franchise so much. Blasphemous but I did not enjoy RE1 at all.",
            "It's not the best selling game of the franchise tho...  \nRE4 original has still sold more copies with 14million. RE5 is even higher with 15.6 million. Even RE6 is higher than RE2R with 14.4 million.",
            "The game that got me into the series very well deserved",
            "Game is very good, also helps that it's almost always on sale for like $10 lol",
            "Pretty cool achievement.",
            "This game is terrifying. It's so deserved.",
            "Well deserved",
            "Good it was a great game and personally should’ve got DLC",
            "It's just that good.",
            "It’s the GOAT",
            "Well deserved.",
            "Honestly deserved. They went over the top with this remake, it’s legitimately amazing. The GameCube remake of the first game will always be my favorite though",
            "Wow even including re4 ports? That's crazy",
            "It was great.  Should be the blueprint for all remakes going forward",
            "OG RE2 Is a top 3 game of all time for me. And while I don't think the remake is QUITE as good all things considered, it definitely set the standard fort how remakes should be done.",
            "Imo RE2R has the best zombies in media history",
            "How will they divide those two cakes",
            "I have over 150 hours in this game. I absolutely adore it. Its become somewhat of a comfort game for me.  I can just play and immerse myself in it.",
            "Way better than re4. Felt re4 was overrated",
            "It’s the ultimate Resident Evil Experience.  It combines the action of the later entries with the methodical key/lock gameplay of the earlier ones.  The vibe is amazing.  The graphics beautiful.  Good storytelling.  Good everything.  Is one of the best games ever made.",
            "RE2R is what got me into Resident Evil, again after like 12 years 😅 recently replayed every main title because the RE2R got me hooked",
            "🥇",
            "I just replayed it for the first time since 2019. Just a perfect gaming experience (EXCEPT FOR THAT SHIPPING CONTAINER FIGHT). Zero fat on it.",
            "I might still play the OG RE2 a bit more because it's just easier to spin up and play, but I have nothing but respect for the remake. I actually enjoyed the hell out of it. Sure, I was disappointed by the way they handled the A/B scenarios, but the game is still amazing in everything else it does. I think these sales are entirely deserved.",
            "i’m glad! it is deserved. this game is rlly good. it will always have a special place in my heart as the first RE game i ever played/finished :)",
            "Re5r when?",
            "Is that parsley on the cake?",
            "It is deserved as that was the only remake re2 had to my knowledge and the others were just ports of it released for PlayStation years ago, so for many, myself included this was the only way we could play it.",
            "The re2r was great. I spent a lot more time on it than re3, but only bc the game was longer and took more time to 100%. After like 2 1/2 play through in RE3R  I had the rocket launcher and it was like 1.30 to clear on the hardest difficulty. Easiest 100% is re3 by far. Big problem I had with RE3 was how scripted nemesis was, thought it was going to be a bit more like mr x in 2, but like 80% of the encounters with it are cutscenes. Didn’t feel the tension or fear factor from nemesis at all.",
            "So sad that RE3 never got that same love and attention 😣",
            "As hard as RE2make was, I always came back to it...was more grounded and those fucking lickers  and mr.x always legitimately scared me",
            "And also the best, imo",
            "Only game I’ve ever gotten every achievement for.",
            "Honestly surprised it isnt re4r",
            "Bet that last 5 mill was sold at 11 usd on sale all the time.\n\nI wish they would say actual dollars made rather than units sold.. because that game is always right cheap",
            "Not quite. RE5 is still the best selling at 14.6M+ sales. \n\nhttps://www.capcom.co.jp/ir/english/business/million.html\n\nAcross all separate editions of RE5, it finds its spots in 7th, 35th, and 49th place, for a combined total of 14.6M+ sales. These types of articles seem to pop up at least once a year and I don’t know why.",
            "Rightfully so! Masterpiece!",
            "Very cool\n\nI also find it interesting that every cake I ever see in photos coming from Japan always has fruit all over it.",
            "Is it based on system?  I thought RE 5 was around 15 million? [https://www.reddit.com/r/residentevil/comments/1ah82kk/2024\\_resident\\_evil\\_games\\_sales\\_figure\\_updated/](https://www.reddit.com/r/residentevil/comments/1ah82kk/2024_resident_evil_games_sales_figure_updated/)",
            "Damn. I wonder what the average units sold per year has been since release. A lot of people I know, who previously didn’t play RE, got into it because of RE2 Remake.",
            "RE2R is a goddamn masterpiece and I can always replay it when I’m in the mood to re-experience it.",
            "To think survival horror was absolutely dead 10 years ago. Just your Amnesia and clones walking simulators. And where are we now, RE2, RE4, SH2 Remake, Dead Space Remake.. and a nice array of indies like Signalis, Crow Country, Darkwood.\nHell, even Amnesia devs themselves redeemed with the amazing Amnesia: The Bunker.\n\nWe are well fed.",
            "My favorite in the series",
            "I thought resident evil 5 was best selling",
            "It's well-deserved, this game is a masterpiece and a lesson in how to bring a classic to recent times. It incorporates everything Capcom has learned over the years developing Resident Evil.\n\nIt truly feels like the developers loved the original and gave everything they had to this remake. An amazing job by Capcom.",
            "It's really odd since RE5 is at 14.6 million and this is without it's Switch sales.",
            "I don't know if it's even a thing you can possibly repeat. 20 years of buildup to a remake that not only stood on its own as an amazing game, but was built on the legacy and nostalgia of one of the best games of its original generation. It's just so good.",
            "Incorrect. RE5 is at 14.6M, and that is without including 15 years of PC sales and 5 years of Switch sales.\n\nThese gaming journalists need to do better research before writing articles.",
            "So code Veronica remake?",
            "Nice. It was the game that really got me into REa",
            "Was able to get this game along with Resident Evil 3 remake as part of the Raccoon City edition that was on sale during a PS Store sale.\n\nAwesome game, even if I nearly shit myself a couple times",
            "How far is RE4 Remake? I know it’s only been a year but what are the units",
            "That's my most favourite of the RE Engine Era. It's nearly perfect for me.",
            "🫡\n\nLoved it. Glad it's done well.",
            "That's good, I hope they'll make mire Resident Evil games in the style of Resident Evil 2 remake (low ammo, backtracking, item box, really tough reviving zombies and a complex interconnected environment layout (not just linear).",
            "Goddamned masterpiece. Played the original all the way through twice, and played the remake through twice. And somehow I get the urge to play it again. \n\nNot so much RE 3...",
            "Yooo that’s awesome! I was just talking about in a ramble video I did about how RE2R was close to outselling RE5 but that’s so awesome it’s official now!!!",
            "Re 2 remake is one of my fav ones re 4 remake is good too but i feel kind of invincible parrying and melee everyone.",
            "Good game but dissapointing remake so im torn on this news.",
            "Well deserved. Arguably the best game in the series",
            "Good. Keep the format the same, follow the story that's already established...maybe a few tweaks here and there. Refine the gameplay here and there. Keep using handguns as main weapons \n\nAND NO LIVE SERVICE YOU CUNTS",
            "That's awesome!  Warn people if you're linking to Twitter though yuck.  I feel dirty.",
            "And it is for sure the best of them all!! It has everything RE has to have! Deserved!",
            "Its definitely the best of the remake line up. Its amazing.",
            "Speaking of RE 2 remake. Im stuck at the 3rd boss fight (hardcore, Claire) thing is I finished it but then the 4th boss fight I have no chance in. HELP! I’m out of saves as well (max 5 for S rank) so whenever I die I have to redo the 3rd boss fight every time :(",
            "Agreed, i played the Remake like 13 times, it was addicting.",
            "I'm gonna repeat myself for the umpteenth time on this sub, but I'll say it again: \n\nRE2R made me get feelings I haven't had since I played og RE2 back in middle school. the horror, the tension, the dread, and the sense of wonderment were all captured and presented for a new generation. This is my current fav from the franchise now.",
            "Resident Evil 7 and Monster Hunter World saved and changed Capcom, 2 Remake was very good for them but I don't think they would have been down that bad when they can rely on Resi 8 and a new MH for sales.",
            "I’d say that without the massive success of 7, we wouldn’t have gotten the remakes of 2-4.",
            "Yes. I joined with RE4, but didn't have a console that would let me play 2 or 3. Getting those remade was awesome, but I still hate what they did to 3.",
            "RE2R police station; the exploration, the gore system, the combat, the atmosphere…is *chef’s kiss*",
            "True, but its only a matter of time until 2make passes it.",
            "It is at 14.6M and they didn't include PC + Swtich.",
            ">RE5 is still the highest selling\n\nI wonder how a RE5 remake would do, though. It's the highest selling but, in my experience, one of the least known. Or least memorable. Certainly one of the least liked. I personally hated having Sheeva around the whole time. It made the game a lot less scary, in my opinion\n\nIf they do remake it I'd love to see a complete do-over.",
            "RE5 mercenaries is still the best, total classic.",
            "My blasphemous take is the original 2 is superior to the remake in almost all aspects. Still my 4th favorite game though",
            "RE5 is 14.6M, without PC + Switch included. So its true sales would be at least 16M.",
            "Where is that number for RE6 coming from? I have it at 13.1 mil according to the sales data on Capcoms platnium titles page. 9.1 mil (original release) + 3 mil (PS4/X1) + 1 (NSW)= 13.1 mil. I also have og RE4 at 13.2 mil, less than RE2 Remake. Unless my math is wrong 😵‍💫",
            "Sales =/= quality, and that goes for this remake too.",
            "Me too. The camera and tank controls were too much for me",
            "When RE5 Remake gets announced, we will see more articles about the sales of RE5. \n\nIt's just a marketing ploy.",
            " RE2R has the most sales with no re releases.\n\nRE5 is the best sold RE game to date still, it's past 15 million.",
            "It WAS",
            "Switch and PC.",
            "Cheers to whoever downvoted me, after writing this I legit went back to it and tried my ass off… ended up getting it W",
            "Seriously.  I keep trying to play the re3 remake but the 2 remake is oh so good I can’t stop lol",
            "Watching distortion2 speedrun it was exhilarating; was so fun to mimic his strats in my own attempts.",
            "Never understood re games. What makes them so good? Aren't they just extremely stressful? What are the good parts in the games?",
            "We never really got a proper over the shoulder horror game from RE before this game. Most of OTS games were action and the ones that you could debate are horror are side games (revelations). 7 returned the series to horror and 2 brought it to over the shoulder. I think people were waiting for a game like 2 since the action games at the very least. I know there were people waiting for re2 remake before og 4 even released but that’s not quite the same as what I’m talking about. I guess in a way 2 remake fulfilled two wishes from fans in one game. People that wanted horror in OTS and people that wanted a remake of re2. ",
            "Mine is RE4R, but 2R is a extremely close 2nd. Both of those games make me feel like a kid again. But both for extremely different reasons.",
            "Monster Hunter Rise has done really well too, over 10 million units sold (as opposed to shipped)",
            "Monster hunter World at the time was a breath of fresh air for me. \n\nMultiple times I said there’s still more content!?",
            "Actually, 2 was already announced before 7 was even revealed. ",
            "How will you know it passed it? RE5's sales are incomplete, but RE2R's is.\n\nThe 14.6M of RE5 doesn't include 15 years of PC sales and 5 years of Switch. \n\nIts true sales may be well over 16M.",
            "I also enjoyed the campaign DLCs.",
            "Not that blasphemous, I totally agree. RE2R is a great game, but okay remake",
            "The original and the remake both do well what they are trying to do well. That’s why they’re my franchise Top 2… with the OG at the top",
            "What about the gore system/combat?",
            "The 1.3 mil Steam sales are missing",
            "No one's disputing the quality of it, they're disputing the title of the post.",
            "What are you even on about? I only said that the post is incorrect as other games in the franchise sold more units. How did you turn that into an argument about quality?",
            "Me too!! I've tried so hard to play the older games but I can't get much enjoyment out of them I had to play RE1 remastered to finish the numbered titles bc they offer modern control scheme",
            "It still is. It's still around 15 million.",
            "3s great for a quick morning or late night sort of run. You can get through it in a few hours easy so it’s almost like playing out a fun zombie movie.",
            "Idk why the 3 one that doesn’t hit as hard. I never played the originals but I played 2s remake like 8 times. 3 only 1 and a half",
            "I just started the remake for the first time. It’s so fun! I want to play it with the fixed camera mod and then the first-person mod after.",
            "RE4 is basically an action puzzler. you are being put into rooms with a large number of enemies and obstacles and you have to figure out how to survive. it is stressfull yes, but also lots of fun.",
            "RE4R is the best in the series. I’m on my 10th play through and it’s still amazing. RE1R and RE2R police station are peak survival horror though.",
            "Entirely subjective. There is no better option and anyone who says otherwise is bias.\n\nAlso that fact I don’t remember any gore system shows my feelings on it",
            "That number came from a steam data leak right, not from Capcom themselves? I wonder why Capcom hasn't listed the RE5 PC release in its platnium titles page if that data is accurate.",
            "Explained to dumb asses, I'm commenting on the implications of commercial success inside of a \"free market\" structure under capitalism (and under crushing neo liberal indoctrination) you can read (or can you?) yourself the comments above about how \"deserved\" it is basically equating sales to quality, specially when convenient.\n\nAny doubt?",
            "Yeah insane even pointing out that amirite",
            "That’s what I thought but people keep telling my different. Seen different figures on a few sites too.",
            "its way too short. not enough time with nemesis!",
            "One thing is definitely RE3make being more rigidly structured. RE2make has more room for optimizing your route, which makes new playthroughs feel rewarding. While RE3make has some segments that open up a bit, it's rarely open enough that you can really start experimenting with your routes.",
            "They were developed almost on top of each other and when Mr. X got lambasted (wrongfully so) during the initial launch period of RE2 they changed up Nemesis to be more scripted.",
            "Wildly bad take but right on brother",
            "I know the implications, my guy, and under a circumstance where the other person was not directly contradicting a claim made by the post, I'd agree that mentioning \"sales =/=quantity\" is relevant. But, imagine if you saw a post that had factually incorrect information, and offered nothing but a correction, and someone harped on you about a non-existent implication you're drawing.\n\nRead between the lines.",
            "What did Mr X get lambasted for? That part was one of the best lol",
            "No seriously, I don’t get the downvotes",
            "Which is the bad take? Gameplay is subjective? Or the gore system I didn’t notice?",
            "It was more like agreeing with him like speaking the silent part out loud, not really trying to \"actually\" him. Statements aren't done in a void and bringing numbers of 4, 5, and 6 paints the general narrative of the post in a very bad light, you either have to accept 5 and 6 as BETTER games than 2make or disregard success as an argument entirely.",
            "Many reviews and new comers to RE didn't like the fact he chased you everywhere through the station.",
            "Or..., and I want you to think about this for a second, could it be that they saw an incorrect numerical claim and corrected it?",
            "Game would not be half as memorable if he didn't",
            "Exactly, I think that person is being weird. Like wtf even is this?",
            "Nah",
            "With every new generation, there's always something to complain about. For me, I absolutely love Re2R, it ticks almost every great video game boxes. Re3R, it feels like I'm playing an action movie and when I start viewing it from that angle I was able to enjoy the game more.",
            "Yeah. Funny that the originals and remakes had the same story with their releases in how they were received. \n\nMy biggest disappointment in REmake 3 was just the amount if time you spent in the city.  I wanted more."
        ]
    },
    "Carlos glitch?": {
        "title": "Carlos glitch?",
        "score": 221,
        "url": "https://v.redd.it/diy1oalp428d1",
        "content": "Not sure what caused this to happen",
        "num_comments": 22,
        "comments": [
            "That Hunter messes up his sick hair, of course, he dies on the inside.",
            "You've created a Time Paradox!",
            "Nah, Carlos' are just immortal. I should know.",
            "The message was to the hunter. It touched Carlos' gorgeous mane, which, as we know, is an instant game over...",
            "Reminds me of 'fission mailed'",
            "Bro forgot he's dead",
            "All jokes aside, looks like the hunter hit the instant execution which always kills you, but one of your shots caused it to stagger out of the animation somehow.",
            "He wouldn’t let the hunter ruin his chance with Jill",
            "Carlos! Turn the console off now!",
            "Even the game wouldn't leave you in a cruel Carlos-less world 🤣",
            "\"YOU ARE DEAD\"\n\nCarlos: \"I didn't hear no bell!\"",
            "Nah, Carlos can refuse to die. He won't leave Jill in a Carlosless world.",
            "You are dead but you're really not",
            "in the first 4 seconds i thought he was doing a finish move ☠️",
            "Would be interesting if somehow you didn’t choose any option and went for any loading screen to see if the game will let you",
            "That attack is supposed to one shot you, so the fact you got out of it was the glitch itself. The screen is probably part of a string of code that starts exactly when the cutscene starts, and triggers within X amount of time. The game doesn’t account for you glitching out of the cutscene, and triggers the line of code to function as normal, regardless of whether or not you maintain being within the cutscene. \n\nSource: I code games for a living",
            "Carlos had Last Stand",
            "Why didn’t Carlos die? Is he stupid?",
            "It's because of their *crazy accents*, isn't it?",
            "I need scissors! 61!",
            "Not sure if I would want to be with someone who is always around monsters and mutant freak zombies all the time! 🤔🤷‍♂️",
            "I hear it's amazing when the famous purple stuffed worm in flap-jaw space with the tuning fork does a raw blink on Hari-Kiri Rock."
        ]
    },
    "Leon can trigger traps mid-kick?": {
        "title": "Leon can trigger traps mid-kick?",
        "score": 1073,
        "url": "https://v.redd.it/p8ebgtbc1z7d1",
        "content": "Might be already be pretty known, but I had no idea even after a couple of play throughs. \nThought it was pretty cool. Thoughts?",
        "num_comments": 59,
        "comments": [
            "LMFAOOOO, misses the kick, lands in the trap. damn the hit boxes in this game are crazy",
            "He's just got a really strong magnet in the bottom of his boot",
            "The fact that neither combat animations nor cutscenes provide invincibility frames for either the player or the enemies is one of the best things about this game.",
            "Logically yes",
            "Sorry! Must have slipped!",
            "Well yeah bear traps don't care what you're doing when you step into them",
            "GOTY",
            "if you pay attention to the video you uploaded, you'll find your answer.",
            "Makes sense. Nice attention to detail",
            "Word to the wise, just forcing enemies to walk on bear traps is ammoless and free",
            "Lol this game is so real.",
            "New RE player. Just about to finish 2 remake. Which game is this?",
            "Lmfao",
            "My poor clumsy baby.",
            "Such a Frank Dreblin-like screwup lol",
            "\"Mama says I've got magic feet\" - Leon",
            "What RE is this? Please and thank you very much.",
            "Holy shit this took me out lmao",
            "This immidiately reminds me of Eric Bana in the castle doing a roundhouse kick on the boxing bag",
            "Damn, that was painful to watch. \n\nLet's see that in an instant replay!",
            "And of course it was the mid air leg that stepped on the trap ..",
            "After watching this video, I would say yes.",
            "Hahaha that's actually hilarious 😂",
            "ARE YOU ABLE TO SAVE? I CAMT FUCKING SAVE ON MY GAME",
            "Traps have a weird kind of priority in this game. They'll trigger and ensnare you even if you use an invincibility mod.",
            "I've just realized one thing about RE4 remake. The character in gameplay reflect your skill in a subtle way. \n\nWhen you're new to the game, Leon fumbling all over the place, stepping on trap, tripping over body, tripping over windows, fall from ladder, bumping into crowd. But when you gradually getting good, understand more about the game logic, animations and mechanic, Leon in-game also reflect that. You less likely to trip and fumble, better at dodging, near misses, not tripping over everything, less likely to step in traps, bob and weave through the enemies more fluent. \n\nYou can feel Leon getting better because you the player are getting better.",
            "get got",
            "taekwondOUCH!!",
            "the game is buggy as fuck, and the developers did a shit job polishing the combat system.. last 2 RE games have been pretty shit",
            "This game is really bad",
            "That makes no sense how he just whiffs it, imagine during any kicking animation if you could flat put whiff it",
            "The fact that it's the same foot he used for the kick is a nice oopsie.",
            "I love being hit by an enemy when I’m on a ladder a metre above where their weapon struck 😃",
            "And this is from the same company who made the famous Street Fighter.",
            "Actually game provided invincibility frames here to enemy.",
            "Disagree, I feel it takes a lot of the enjoyment out of the game and punishes a certain playstyle that wasn’t punished in the original. The playstyle was punished originally by you having to use a weaker weapon to kick start the melee and the timing could be missed leaving you in a horde of enemies for the crime with the weaker weapon still equipped. In remake it punishes you for a not so great reward as I feel melee was heavily nerfed",
            "Sloppy!",
            "Lmaooo word",
            "Wow 100% totally answers the question comment\n\n\nTotally doesn't need a rewrite",
            "RE4 Remake.",
            "Re4 remake, my personal favorite RE next to the OG",
            "RE4 Remake!",
            "I realized after posting I made the wrong title lol not my first language lol",
            "Hot take",
            "Good attention to detail makes a game bad... \n\nWeird take but okay",
            "Yeah, lovely feature. First found out about it in my S+ pro run, trying to survive the village opening. I was 30s away, thought I'm safe on that ladder. Got killed of course.",
            "Melee was kinda op in the OG Re4 though",
            "Same. Got the Re4 remake platinum about a month ago, then finished up Re3 remake for the platinum, and I'm now on Re7. I had been saying Re7 was my least favorite of the new games just because it's so scary, but honestly I'm loving it. Might still be my least favorite, but it's still a 8.5–9/10 IMO. Pretty great consistency to me if the \"worst\" of the recent ones is scoring that high in my personal ratings.",
            "Thanks again",
            "There is literally no use arguing with re4r fanboys, but I'll just say. I frames are an atrocity in this game and this clip is perfect evidence of it. The developers did not know how to balance this game at all.",
            "True and it could’ve been retweak a bit to make it not so, lower damage and stun durations of enemy, decrease time until the prompt goes away. These are good ideas but re4Remake went the complete opposite way to make melee not as rewarding and very much punishing for a player who wants to do a quick built towards melee, these builds sacrifice power weapons for weapons to stun enemies then going for quick combos to deal damage, but RE4 remake punishes melee builds, I died so many times during the intro sequence and had to break myself out of the old RE4 mindset just to make it through ignored all melee prompts because I knew I would be punished, a game shouldn’t have a player have to ignore an aspect of combat to survive.",
            "Kinda, but also kind of necessary. Between the tank controls, stopping to aim, slow aiming speeds, broadly slow movement speeds, the kick and occasional suplexes are the only attack that don’t require you to be still and they can only be triggered by setting them up. It kinda had to be that way for the old game balance. Recently completed a run on pro, it’s definitely not too powerful.",
            "I'm more of a OG RE4 and classic trilogy fanboy, bought OG RE4 4 times and completed it more than 60 times. And I'm one of the very rare people, even in this sub, that still play the OG trilogy since 2000s 'till now. Heck, I'm playing OG RE2 right now.\n\nBut whatever make you happy ig.",
            "You’ll get downvoted but everything you said is true and I like the game.\n\nOn the one hand, the limited i-frames make for really frenetic seat-of-your-pants gameplay and forces you to respect every enemy. But on the other hand, it disincentivises one of the most fun parts of the game: nailing those perfect parries then kicking their lights out. \n\nAnd if you, as a dev, choose to make your i-frames so sparse you better make sure your hitboxes are on point. But RE4R’s aren’t even close to perfect. Just as an example, plaga spiders can hit you on a ladder when you’re far above them.",
            "That's because this isn't the original game. RE4R's gameplay is designed to punish people that cheese the OG RE4 with over reliance on that melee move.\n\nAnd it's still possible to gear your game towards melee. You just have to be smarter in your approach.",
            "While I disagree with you, I understand where people are coming from, there should be WAY more i frames for melee prompts but I disagree with your perfect parry analysis because a perfect parry into a melee is almost always a kill and you’ll know because it makes the crunchy sound. I like the less i frames in a way because you have to respect every enemy or they will destroy you very quickly. In the OG, if you know that guns one hit stagger, you can shoot once kick all the enemies down then immediately knife them making the combat essentially trivial. OG combat was very predictable which for some people is preferable.",
            "But what if I don’t want to use it to cheese? I shouldn’t have suffered such heavy punishment to make me swear off it and avoid it so early in the game. Hell you can even be interrupted by winking hit boxes due to the traps which makes for very unfun gameplay. Nerf melee in the hame to make it so you can’t cheese with it sure, but don’t make it so undesirable that you avoid it",
            "The crunch sound is a melee crit being triggered, that does 4x damage on a normal melee so in most cases it will kill but not always. \n\nAlso, the perfect parry does not increase the chance of the melee crit as far as we know.",
            "Then uhh... don't avoid it? Meleeing is perfectly viable in this game. Pretty much anyone that I've watched playing this game relies heavily on it as intended, getting off just fine. It has enough hitbox to stave away people around you, and the enemies gives you enough leeway afterwards for you to assess your situation.\n\nI dunno what you're doing but you're definitely doing something wrong if you have to completely swear off from it just to survive the village section."
        ]
    }
}