{
    "Typical Tuesday Tutorial Thread -- June 18, 2024": {
        "title": "Typical Tuesday Tutorial Thread -- June 18, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/RimWorld/comments/1dikgs8/typical_tuesday_tutorial_thread_june_18_2024/",
        "content": "Please use this thread as a week-to-week space to ask your fellow /r/RimWorld colonists for assistance. Whether it be colony planning, help with mods, or general guidance, post any questions you may have here! If you have an effort post about a game mechanic then this is also fine space for that but please consider making a separate subreddit post for maximum visibility.\n\nI am a bot, so I can't make jokes. If you'd like a Typical Tuesday joke, or if there are any problems with this post, please [message the moderators of the subreddit](https://www.reddit.com/message/compose?to=%2Fr%2FRimWorld).",
        "num_comments": 65,
        "comments": [
            "Why can't we queue psycast anymore? Maybe it's just me and mod conflicts but can anyone else queue psycast in 1.5? Or am I missing something?",
            "Rimworld of Magic question:   \n  \nSo I got a chronomancer because their reverse time spell seemed OP as heck.  But I casted reverse time four times on someone with a demolished shoulder and it didn't clear up the problem.  The shoulder had just be screwed up in a skirmish where I captured them.  Does it only work on colonists?  Did I wait too late to cast it on them?  Does it just not work like it is supposed to?\n\nTheir age went down by a year or so but their screwed up shoulder never got healed.",
            "so I'm a bit new, and is it supposed to take 6+ days of time just to do fabricator research? I even have two research benches and they're both in a clean room, it's just all these researches that take 4000+ points take ages no matter what. even got that thing you attach to the tables for faster speed.",
            "I've played off and on for years now, but since Anomaly have been playing nonstop with my first two ever successful colonies. I'm playing without mods and have all of the DLCs installed.   \nEarly on in my second colony tribal raiders kidnapped a child. When this happened I got a popup that said that there /will/ be chances to retrieve this child.   \nYears have passed and her parents and sister still have her on their social tabs. They all have feelings about her (she's apparently disfigured now, which I have no clue how any of them know that), but she has a +0 to feelings about all of them. When I hover over her name, it doesn't say she's dead- only that she belongs to the tribe type that stole her.   \nI have never gotten any opportunity that I have noticed to save her.  I've been raiding and destroying their nearby colonies nonstop in an effort to find her.  \nIs there something I'm missing here? Should I be trying to befriend this group of heathens instead of grinding them into the ground? Have I somehow just not hit the colony she's currently staying in?  \nAny help on how to find her would be appreciated. I've been putting off trying to get an endgame sequence until she is retrieved, as a bit of RP. But if there's no way to get her back, I'll just have to move on.",
            "I might be going crazy but I seem to remember that way back in the day, areas were different for humans and animals. Is there a mod that brings that back? Or introduces it if it was never like that and I'm just making it up. \n\nI've got about 6 areas for humans, 6 different areas for mechs and 4 different areas for animals and having all of them at the same time is a bit much, especially since I never want to put humans in animal areas and so forth.",
            "First time playing with Anomaly what tips would you give me with out to much spoiler?",
            "Are there any known mod conflicts that cause animal training to fail to complete? The pawn starts training, works for the usual amount of time, then instead of it saying it succeeded or failed... nothing happens. They just walk away and the animal is still free to be trained again.\n\n\nThere's nothing in the logs indicating an error. It's like it just skips the last step.",
            "Is anyone else unable to jump multiple pawns with jump packs?",
            "Is it just me, or can repeatedly reloading saves impact performance? After a few loads, my system freezes and I have to restart. I’m not sure if this is a mod issue, a Steam Deck issue, or just a Rimworld issue.",
            "Hi!\n\nI've all the things except for Biotech and Anomaly. I know a lot about Biotech from watching YT playthroughs, and I've been meaning to buy it for at least a year.\n\nDoes Anomaly require Biotech?\n\nI should probably just buy Biotech before I jump into Anomaly, right?\n\nIs it reasonable to expect a DLC bundle on steam? I don't remember, but I think I bought Ideology+Royalty as a bundle. I could wait months for a Biotech+Anomaly combo.",
            "Is there a mod or some other way to find out what \"age\" each technology is attributed to? I am playing with a bunch of mods already and making this more transparent would be quite helpful.",
            "Im using Vanilla nutrient paste expanded mod,do you know what may cause the feeder to overflow?i frequently saw it go up to 100(which is the maximum stack i have currently) and spread out in adjacent tiles as well",
            "Hi There, I just started playing. I am wanting to know if anyone could suggest any youtube videos to watch to help learn. At this stage, my colony is going well but I need steel and I don't know how to make steel.",
            "Anyone know of a mod that allows smoke to either slow or put out fires?",
            "Is there a mod that lets you \"copy\" all the bionics you've put into colonist A to also put them in colonist B? Like, let's say I've given A 2 bionic arms, 2 bionic legs, etc ,etc I would like to just press one button and go \"okay, now put all of these in B, too\"",
            "It is possible to play the base game/DLC in a medieval way? In the sense that my colony is entirely tribal and can defend itself against all raids?\n\nIf not, what are the recommended mods? I dont want 300 mods installed if possible haha",
            "Is there a mod that makes creating xenogerms for non-baseliners less annoying? It seems like not only do I have to remember who comes with what genes, I also have to anticipate which genes overwrite which other gene. \n\nMost of the time I'm pretty close, but sometimes I'm off by 1-3 points which is mildly annoying until you start creating something with arcite genes.",
            "trying project rimfactory and my biggest gripe is that for some reason I cannot deconstruct the storage crates. Idk if infinite storage might be messing with them (pawns can't access infinite storage or the items don't \"count\" as being there if in any of the storage)",
            "Is cumulative overdoes counted per drug category or across all drugs? For example, if a pawn has all the drug dependency genes and happens to take one of each category of drugs for dependency at the same day, will he get cumulative overdoes?",
            "Is there a way to adjust the frequency with which certain (vanilla) races appear? I understand that you see more Impids/Wasters/Ytakkin because they can be raiders, but I play this game all the time and I honestly can't remember the last time I saw a genie or a highmate as anything other than a purchasable slave from a trader. Of the many, many random visitors or colony joiners over the last few real life weeks I cannot think of a single example of a highmate. It just kind of feels like they're not there",
            "Is there a mod that makes battle mechs behave more like battle animals? Meaning I don't have to micro all of them by individually drafting them, I just want one button I can hit to \"send it\" and then let them do their thing. With regular \"escord\" mode they stay too close to my mechboy but I'm too lazy to tell my 15 scythers what to do. I just want to control my 4 guys with flame throwers, set everyone on fire and have my scythers scythe through the medium rare raiders.",
            "No it's not just you. I notice that too.",
            "I'm not sure I've tried that on missing limbs.\n\nBut the wiki says \"This can remove many ailments that were caused recently as the tissue is restored to a state prior to the ailment; this includes wounds, diseases, and age related ailments that occurred within the window of time reversal.\"\n\nMaybe lost limbs are not included?\n\nAlthough it also says\" Upgrades affect the power of Reverse Time - increasing the effect on equipment, corpses, and pawns - decrease mana cost, and allow to raise the dead, though it will put both pawns into a coma.\"\n\nSo maybe a higher level would work?\n\nI would have to try on dev mode to see what happens.",
            "Yea. research takes time. How fast you are depends on your pawns as much as the room. One thing that can happen is that you give pawns too many jobs and since research is way on the right of the task list, your guys never get to it.\n\nPersonally, I never really worry about research. I start as a tribal so I just deal with it. My technology is a stick that is pointy on one end (that end goes into the bad guys). The only new things we learn in the first year is \"pants\" and if we're feelings spicy, we also discover \"beds\".\n\nThe more you play the more you'll see that you don't really need a lot of research, though, and that will make it go faster in a sense because you're not researching things you don't really need. You also need to keep in mind that research in itself is pointless. If you can't afford to build the thing you researched or if you don't have enough people to use it, you don't really have the thing.",
            "If you're like me and playing anomaly start, you get a reduction in research speed. I kinda like it, as most playthroughs I can't keep up with building the new stuff before  an even newer thing gets researched.",
            "The only way to get back kidnapped pawns is to wait for an extremely-rare quest to rescue them. No guarantee that such a quest will ever appear. They don't appear in enemy colonies or anything. It's very unkind to players. There's probably a mod that makes it easier.\n\nedit: actually I'm not sure if that's true: someone else did say that they pop up as part of the enemy faction as well, which would mean tearing through enemy colonies would have a chance of finding them as a raider.\n\n>Have I somehow just not hit the colony she's currently staying in?\n\nthis isn't something rimworld does; it generates the list of pawns you're fighting on-the-spot, location doesn't matter.",
            "I banished a pawn recently. Using skip abduction ritual, they sometimes get abducted. Perhaps you could try the same.",
            "You may find [this](https://steamcommunity.com/sharedfiles/filedetails/?id=2316018203) helpful, but alas it may not work in 1.5.\n\nI still play on 1.4 myself, so I can use all of these cool older mods.",
            "Don't google things. :D Honestly I don't think there is a lot you need to know. Anomaly is definitely one that you should go in blind and just roll with it. If something seems weird don't just run the other way, poke it with a stick.",
            "Wall your base (:",
            "Read a lot of the pop ups and hover over various numbers to see details. Some things may not work exactly as you expect. Figuring out how some things work can be very advantageous.",
            "Halvars is right, Wall your base. Even more important than the base game.\n\nOther tips:\n* If you typically go with small colonies (like 6 or less), you might want to expand more than you usually do.\n* Don't neglect studying the entities\n* Incinerators are fun, effective (not on mechs) and can be used with shield belts.\n* Ghouls.",
            "I've never encountered this one, but it sounds like a weird mod conflict that would have to be carefully debugged by removing mods in batches. If there's a tame animal utility in debug mode or God mode I would use that to test it.",
            "I haven't had that happen, but repeatedly loading saves is one way memory leaks show up.  It could be mods or the Steam Deck, but mods are probably more likely, so you could try disabling mods to see if it goes away, and narrow down which one is causing it.",
            "All I know is deleting 100 saves down to 5 or so greatly speeds up load time.\n\nAlso, the saves themselves are pretty big, circa 40mb each.",
            "I wouldn't hold my breath for steam sales. Tynan has always said he priced the game fairly and doesn't think it needs deep discounts and I would definintely agree with that. You'd be hard pressed to find better value for money than rimworld.\n\nPersonally, I would 100% recommend biotech. It adds a lot of cool things. \n\nWhile I like anomaly, there \"problem\" with that one is that a lot of the appeal is in the mystery and once you've seen what it adds once that obviously isn't there any more. I still like it and it certainly also adds things I will use every playthrough but it's definitely behind biotech.",
            "Just in case your original question wasn't fully answered: none of the DLCs require another DLC to function. Some of them have small amounts of interoperability content that is only enabled if two DLCs are active (such as the Bloodfeeder meme for Ideology which is only enabled if Biotech is installed), but all of them are capable of functioning independently.",
            "Anomaly and biotech are basically totally separate. Neither one would require the other, and what they add doesn't interact that much in my opinion. Biotech in a nutshell is mechs, kids, and gene stuff. Anomaly in a nutshell is for a horror themed run where you totally change the feel of the game towards that content. \n\n\nBoth are good and which one you get totally depends on what you're interested in. I feel comfortable saying most people would recommend biotech. It adds a lot of content that fits in neatly with the base game. I personally would probably do Anomaly first instead, but very much a personal preference",
            "Anomaly and biotech are basically totally separate. Neither one would require the other, and what they add doesn't interact that much in my opinion. Biotech in a nutshell is mechs, kids, and gene stuff. Anomaly in a nutshell is for a horror themed run where you totally change the feel of the game towards that content. \n\n\nBoth are good and which one you get totally depends on what you're interested in. I feel comfortable saying most people would recommend biotech. It adds a lot of content that fits in neatly with the base game. I personally would probably do Anomaly first instead, but very much a personal preference",
            "Anomaly and biotech are basically totally separate. Neither one would require the other, and what they add doesn't interact that much in my opinion. Biotech in a nutshell is mechs, kids, and gene stuff. Anomaly in a nutshell is for a horror themed run where you totally change the feel of the game towards that content. \n\n\nBoth are good and which one you get totally depends on what you're interested in. I feel comfortable saying most people would recommend biotech. It adds a lot of content that fits in neatly with the base game. I personally would probably do Anomaly first instead, but very much a personal preference",
            "Selecting a research project should tell you what tech tier it is, but if you would like a mod that makes it more immediately obvious what research items are at a glance, [I made this one a while back](https://steamcommunity.com/sharedfiles/filedetails/?id=3108740804).",
            "Steel is a rock/ore you mine from rock formations on your map. You click on it, then select the option to mark it for mining, and then a pawn with a work priority for mining will do it.\n\n\nIn terms of videos I would suggest just searching like \"beginners guide to rimworld\" and watch a couple hours of the most popular ones in the meantime.",
            "It's not impossible to fight mechanoid clusters using medieval tech, but it is *extremely difficult* to the extent that most folk wouldn't really enjoy the process. You'd have to deliberately choose not to use more advanced tech, or at the very least never build or research advanced tech, but weapons rapidly advance just from dropped items.\n\n* My Preference: Vanilla Factions Expanded - Medieval, hasn't been updated to 1.5\n\n* The lowest overhead overhaul is probably to install \"Medieval Vanilla\" which just cuts out everything of advanced tech, adding nothing. This makes it inherently incompatible with most Royalty and Biotech content, but at least keeps the storyteller from dropping pods in your castle.\n\n* The *highest* overhead overhaul is \"Medieval Overhaul\", which radically alters the game, but is extremely popular and far more content rich/heavy than the others. The version on Steam hasn't been updated to 1.5 yet, but my understanding is that there is a stable test version in available in their Discord. This one in particular changes the game a bit too much for me personally, but may be exactly what you're looking for if you want like a new game experience more centered around a specific period, it really does a lot of work to flesh it out.\n\n\nThere are also some cosmetic mods (like Dark Ages: Crypts and Tombs) that can really help sell the medieval experience.",
            "[More Gene Information](https://steamcommunity.com/sharedfiles/filedetails/?id=2942759212)\n\nFrom the mod’s description:\n> When designing xenogerms, select the pawn to apply it to, and see the pawn's endogenes, the resulting metabolic efficiency, and what endogenes will be overwritten.",
            "Drugs of a specific type (Beer+Other Alcohol, or various psychite derivatives) will stack with each other, but you can mix booze, psychite, ambrosia, etc without problem.",
            "It might be more accurate to say that Yttakin/Neanderthals are more common because they have dedicated fractions that can raid you, while Highmates and Genies do not \n\nIf you wanna fish for pawns that  can be incapable of violence (Like highmates or Kickstarter pawns with forced incapability for violence), your best bet is often to farm ancient dangers.\n\nOtherwise yes, the only time you're going to get one is if a slaver passes through or if a joint event rolls the vanishingly unlikely shot at it being a specific xenotype.",
            "Genies you can get from raids, just make sure you have a psychic shock lance ready to go. If you get the \"numbers\" mod you can quickly look up xenotype what the raiders are and with \"mark that pawn\" you can put a little icon over him so you don't lose him in the herd.\n\nHighmates are difficult because they are non violent. Look for them in events. I also got one from skip abduction. Look up what the population limits are for the storyteller you are using and stay under that until you have your highmate.",
            ">The more you play the more you'll see that you don't really need a lot of research, though, and that will make it go faster in a sense because you're not researching things you don't really need.\n\nthat's good to know, because I was really getting intimidated by the fact there was like 100 other things that would take just as long as fabrication research, meaning 6 x 100 = 600 days of nonstop research lol.",
            "Thank you for the help!",
            "Yea, I've seen that. Doesn't really do what I need, I think and I've already upgraded to 1.5 after sticking to 1.2 forever :D",
            "I like the idea of poking it with a stick 😂",
            "I agree that the game is priced fairly. There's a stupid amount of content and mechanics in just the base game alone, and then you have the DLCs that are basically base games in themselves.\n\nThat said, I've all the DLCs for Vampire Survivors for a fraction of the cost of my RW purchases. But VS is a game I have 3000+ hours in, so it's not a good comparison. If I had similar hours in RW, not buying all the things would just be stupid.\n\nI think my plan will be to buy Biotech now, play around with it for a few months, and then pick up Anomaly.",
            "Royalty and ideology sounded kinda stupid, even as a veteran player. And a bit pricey.  \nLooking back, it was money well spent.",
            "Thank you, I was still kind of left hanging on that one.",
            "Agreed. Biotech adds a lot of fun stuff. Anomaly is fun after a couple of playthroughs.\n\nThere's a nice synergy between biotech \"requires age reversal\" which is a time consuming pain in the butt, and chronophagy , which obviates the need for the former.",
            "Apparently, I am dumb. Thank you, that is awesome.",
            "I will check Medieval Overhaul but the other suggestion seems okaysh also.\n\nThank you!",
            "Nice :)",
            "No, even if you wanted to research everything it is not that bad. If it helps, I'm tribals (we research super slow) and I never actively pushed my research and we still fully researched everything by 5505.",
            "Just as an addendum, it *is* possible for them to die off map but you *will* be notified by it.",
            "Good plan. I've been starting a new playthrough for every DLC, trying to maximise new content and win conditions.\n\nArchonexus was less tedious than I thought. Though it was hard to choose between first gen colonists and their well educated, colony raised kids. I chose the kids, who inherited their parents archotech arms and legs and eyes."
        ]
    },
    "PSA regarding Name-In-Game rewards / purchases": {
        "title": "PSA regarding Name-In-Game rewards / purchases",
        "score": 127,
        "url": "https://www.reddit.com/r/RimWorld/comments/1cbsm8a/psa_regarding_nameingame_rewards_purchases/",
        "content": "It seems like a few people have noticed their Name-In-Game is no longer coming up, and seem to be missing from the game. We're working on figuring out what happened, and fixing it as soon as possible.\n\nIf you're not sure if your name is there or not, go into:\n\n**Options > Gameplay > Add name...**\n\n[Type your name into this box, like so.](https://steamcommunity.com/sharedfiles/filedetails/?id=3260759814)\n\nIf you've noticed your Name-In-Game has vanished, please contact me in some way with the *full* name, **First 'Nickname' Last**.\n\nOptions for contact are:\n\n* Leave a comment here on this post\n\n* Send it to me in PM if you want it to be private\n\n* Message me on Discord as Sneaks, I'm in both [the official development server](https://discord.gg/yA3QGzHMK6) and [the the community server](https://discord.com/invite/UTaMDWc)\n\n* Comment on the [announcement post](https://ludeon.com/forums/index.php?topic=58547.msg500302) on Ludeon's forum, or message me there\n\n* Comment on the [Steam discussion board announcement](https://steamcommunity.com/app/294100/discussions/0/4336483106373353692/)\n\nSorry to all those whose names have been lost in the release, we'll get you re-added as soon as we can!",
        "num_comments": 52,
        "comments": [
            "I was thinking about purchasing this to support the game - if I do how soon realistically could I expect to see my name added (given the only very recent patch)?",
            "This whole thread is a goldmine for social engineering. Bookmarked for sure.",
            "Doze \"Twelve\" Macacos",
            "I bought the pack years ago and honestly never knew how to even go about putting a name in the game",
            "I have a different problem: I gifted a Name-In-Game version of RimWorld to a friend and neither her nor me can add her name to the list. Whenever we log into the Creative Rewards site (with either the gifter's email or the gift-receiver's email) we are told that neither of us is entitled to any rewards. I thought we just had to wait a bit but it's been a while now. Could you please tell me what I can do to solve this?\n\nORDER RECEIPT\n\nDate:                   2024-04-01\n\nOrder ID:               0140138035\n\nGateway Transaction ID: 41E13606PT3361639\n\nCustomer Name:          Paolo C\\*\\*\\*\\*\\*\\*\\*\\*\n\nCustomer Email:         paolo@c\\*\\*\\*\\*\\*\\*\\*\\*.com\n\nProducts:               RimWorld Name in Game Pack x 1 @ $50.00\n\nSub-Total:              $50.00\n\nTotal:                  $50.00",
            "I haven't been able to see mine - Terrence \"Stash\" Braddock",
            "I bought the name change a while ago, is there anyway i can change my nickname on it? I can't seem to do so via the website.",
            "Mine is no longer available: Sinsade “Sins” Valone",
            "Katrina \"Trina\" Neal",
            "I actually paid for it a while back and never figured out how to add it to the list lol",
            "Amber 'Omni' Rusted.\n\nIt still shows up when I search for it, but for some reason there is a \\[N\\] next to it?",
            "Hey, I purchased the pack and it looks like my name vanished? Mine was:\n\nRiminax 'Rogdod' McTism",
            "Mine works, or I think it does and can force a pawn with my name to spawn.\n\nBut for the life of me I don't think Iv EVER seen my name spawn naturally! Seen my first name a couple of times and the last name a few times as well. But I legit can't think of a single time I seen a pawn spawn with both names before without forcing it.",
            "You know, Jul 7, 2018 I got the name in game version and don't know if I actually ever submitted a name? Or maybe the page timed out? I completely forgot until I read this pinned message years later, lol.\n\n\nNot even sure what I'd add.",
            "X ,😭😭😭",
            "How can you check if your name is still there?",
            "How can you see whether your name has vanished? Is it just noticing in game, or should the DLC dissapear from your account, something else?",
            "😚",
            "David Kramer",
            "I'm not entirely certain what the wait time is on it. They don't add them one at a time, but they're inserted in groups as the game updates, along with the regular changes.\n\nI'm guessing somehow an older name list got inserted, which excluded the newer names.",
            "Wait what",
            "Sorry about that, you've been added to the list!",
            "i need your name in the game",
            "Honestly same, someone please tell us",
            "Sorry for the delay! I was sick for a while, and kinda slacked off on things.\n\nIf you haven't already, please email `support@ludeon.com` with the title 'Name-In-Game Help' to ensure it goes to the right place.",
            "Thank you, I'll add yours to the list!",
            "To ask for a name change, please send an email to support@ludeon.com with the subject 'Name In Game change request'. Do keep in mind that requested changes still have to follow the guidelines.",
            "I played Sins once, can confirm",
            "Marked you down, sorry you're missing!",
            "No way, my custom made pawn is in love with you!  \n\nEdit: for context, I play on 1.4 because of mods stability",
            "you are supposed to add it through the creative rewards section on Ludeon's RimWorld website\n\n  \n[https://rimworldgame.com/creative/index.php/auth/login](https://rimworldgame.com/creative/index.php/auth/login)",
            "If it shows up, that means it's in game! As for the [N], that just means it's name only, as opposed to [B] which would denote included custom backgrounds.",
            "Got it marked down, thank you!",
            "Go into Options, then Gameplay, and here's a button to add specific names to priority generation. Try typing yours in there, and if it's in-game, you'll see it!",
            "Your name is still there!\n\nGo into Options> Gameplay > Add name\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3260759814",
            "Name-in-game is entirely separate from DLC - it's a bonus add-on, your name added into vanilla core.\n\nGo into Options > Gameplay > use the name search feature to check for the one you want. If it doesn't show up on the search, it's gone missing.",
            "What is the nick / middle name?",
            "If so, I believe I can help a little : I saw my name come up, and I purchased (and redeemed) the Name In Game Pack on Nov 2, 2022, so if an older list got inserted instead, it's gotta be more recent than that.",
            "...You're manually trying to fix this? Just query DB to create a whole new list and fix it. There's no way yall aren't storing any of this lol",
            "No worries, I've been sick for a while myself (sucks to be).\n\nI e-mailed right away. Thank you and take care!",
            "Thanks, not the OP but I think something got crossed around so my first name isn't being shown as the nickname/used name",
            "Noice!",
            "No worries! Tyvm for your help.",
            "Thank you!",
            "wait, backgrounds are a thing?!",
            "Thanks!!",
            "I got it via steam, which categorises it as a DLC.\n\nAnyway, Yula D'Rath Seems to be missing.",
            "I got it before you and my name is not there.",
            "We don't know exactly what happened or how far back missing names go, so I'm at least trying to note down the ones that aren't there so we can try to narrow it down.",
            "They used to be. It was removed as an option quite a while ago, since it added a *lot* of work to the devs and was taking up time they could've been using to work on the game.",
            "Odd cause I bought my name thing back when it was first an option and I don’t remember seeing backgrounds.   Oh well. :)"
        ]
    },
    "If genetic engineering is wrong, I don't want to be right": {
        "title": "If genetic engineering is wrong, I don't want to be right",
        "score": 514,
        "url": "https://i.redd.it/1amdptb4x28d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Sabertooth catgirls.",
            "You have heard of the Neanderthal, but were you aware of the Nyanderthal? She's actually the randomly generated wife of our dirtmole colonist. She was with a raid (already as his wife) and I had him literally bonk her on the head with a club and drag her back to his cave. She was so into it, she joined us and now we did this to her D: ... Knowing her, she's probably also into it.",
            "I love it!",
            "Your scientists were so preoccupied with whether they could, they didn't stop to think if they should.",
            "*Nyan*  \n*Ichi - Ni - San*  \n*Nyan*  \n*Arigato*\\~",
            "Idk if I should praise you for your creativity or admonish you for your creativity!",
            "This is gold",
            "unironically this is what I've been doing to colonists I recruit like hussars who are xenogenes with drug dependencies because they won't take drugs while outposted\n\nso they get turned into catboys and catgirls with a couple of the upsides still intact like the shooting and melee ranks and such lmao",
            "Pawnmorpher is a gift that keeps on giving",
            "How the fuck has this never been drawn",
            "My god you’re a genius.",
            "Wait one of the raiders was randomly the wife of a colonist? That is hilarious and I'm glad things worked out for the two of them.",
            "Always go forward ... ask forgiveness later",
            "Tokyo by Leat'eq if anyone ask",
            "Well I don't know if I should be proud or ashamed either. >.>",
            "This is strictly vanilla",
            "There is no way this doesn't already exist.  \nEdit: after a brief research, there are, but they largely miss on the \"wild\" feeling.",
            "Salvation and Damnation are sides of the the same coin and by Randy you earned that one",
            "Fair enough I usually play so nodded so I've loss track of which stuff sre vanilla and which are modded",
            "It already is...",
            "I hear there are 621 drawings of them",
            "Death by catgirl snu snu",
            "Yeah, I checked too, but idk, maybe i expected something different."
        ]
    },
    "wait what doe- OH MY GOD thats a lot of thrumbos": {
        "title": "wait what doe- OH MY GOD thats a lot of thrumbos",
        "score": 606,
        "url": "https://www.reddit.com/gallery/1dlcknw",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Yeah, it's *you* that's being hunted.",
            "Wait, what's tha... OH MY STEVE JOBS that's a lot of drugs in your coffers, are you running an innovative tech corporation?",
            "Vanilla psycasts expanded bend probability is so silly",
            "I was beginning to worry that I was alone in my colonies high wealth, looks like I'm not!",
            "You should cut down some trees if you ever want to see wood again",
            "I have two things to say,\nWhy is there ash all over the ground? Have you considered “Thrumbo Revenge”: nearby thrumbos have also become enraged.",
            "Hey, at least you have 47 tries (likely more) of rolling the 1% tame chance before they leave",
            "Just *imagine* the *Maddened Manhunter* notifications with a single mortar hit.",
            "Remember Alphabeavers? Big RIP to your woods here.",
            "1 well placed antigrain… Mby 2 who knows",
            "The group in question:",
            "RIP your forests",
            "That's a wonderful occasion for group melee hunting",
            "idk how many I was expecting but this is more than that.",
            "Antigrain warhead!",
            "Bruh. \n\nThat’s the level of thrumbos you stop hunting and just open fire with the mortar.",
            "That's a bloody thrumbo apocalypse",
            "If I were you I'd call apocrypton asap",
            "Hopefully you have gauss weaponry or lots of explosives.",
            "Damn, Manhunter Pulse would have a field day with this",
            "\"it's hunting time\"\n\nNot it fucking isn't. I value the lives of my colonists. At least the able bodied ones.",
            "It's ANTIGRAIN TIME.",
            "I don't think it's hunting time",
            "Goodbye to every single one of your trees lmfao",
            "If you kill them the value of your colony will double overnight",
            "imagine if it's a group of \"mad\" Thrumbos",
            "Hans, get ze Flammenwerfer!",
            "WHAT. THE. FUCK. IS. YOUR. WEALTH?!?!\n\nFr tho, what is it?!",
            "Today we hunt with mortars and miniguns and tomorrow we wear clothes like gods!",
            "I saw in another comment that you were using rimatomic nukes. Yeah now would be a great time to launch another",
            "Shut up colonist! 核爆弾 (Nuclear bomb)!",
            "The almagamation of thrumbos is getting so much human leather",
            "> Yeah, it's you that's being hunted.\n\nnaw. hit the crowd with a berserk pulse and let them hunt each other!",
            "nah im selling/gifting them to everyone to make friends",
            "What’s that do again? I always rush warlord with static lord thunderbolt and protector",
            "currently at 10251440 wealth",
            "there is ash because i used a nuclear bomb from rimatomics there",
            "Looks like he hunts boomrats and don’t put the fire down",
            "Nah. Trigger a raid and hit the manhunter pulse artifact as soon as the raiders arrive.",
            "Nah. Trigger a raid and hit the manhunter pulse artifact as soon as the raiders arrive.",
            "It is for the thrumbos",
            "10251440",
            "Can I be your friend? I installed the Greyscythe genetics/bionics mods during this playthrough and took in some of their cyborgs. Turns out they need go juice like Hussars and I can't get the neutroamine to make my own :(",
            "It rolls events. If you ever get bored it is a good way to make sure you have things happening in the colony.",
            "Woah Nelly. That's a lot. I'm not sure what I'm at , but it's somewhat higher than 1.5m",
            "What’s your colony look like? Just out of curiosity of course of course",
            "DAMN!!! HOW?!",
            "If you feel like fixing the problem with another mod, rimefeller has a neutroamine refiner that chews up a bunch of chemfuel and power but makes it infinitely",
            "Oh interesting, finally something to do on my end-game colony I for some reason refuses to end.",
            "Anomaly's Provoke also does that, just on the Anomaly table only.\nAnd there's a few more specific ones.",
            "Yeah I'm curious too. My current colony is just about to start building the space ship and it's pretty well equipped in terms of buildings, furniture, art, endgame armour and weapons, etc. and I'm only at 450k total wealth. I am playing vanilla w/ no DLC currently though.",
            "https://photos.app.goo.gl/W2qSrxRwWvXpFMkm8 \n\nThere you see, hopefully that has everything you want to see in it",
            "or regrowth: core, it has neutrolopes, another species that you can milk for neutroamine. i have 2 males (sadly) and I have a lot of neutro rn sitting around\n\n  \nedit: they give 150 neutroamine per year, 15 every 6 days",
            "I’m at that point too, I don’t know if it’s that I’m too attached to let them go or that I want to see them all dead. Except for you Hatman, I never want to see you die.",
            "https://photos.app.goo.gl/W2qSrxRwWvXpFMkm8\n\nHere you go!",
            "Thanks v much."
        ]
    },
    "Anyone else overly paranoid with power conduit redundancy? How does this affect Zzzt?": {
        "title": "Anyone else overly paranoid with power conduit redundancy? How does this affect Zzzt?",
        "score": 973,
        "url": "https://i.redd.it/v4aa6zbpcy7d1.png",
        "content": "",
        "num_comments": 117,
        "comments": [
            "Hidden conduits never go zzt and I don't think anything can break them except your deconstruct tool, so redundancy isn't necessary.",
            "If you have any standard conduits (not hidden ones), then you can have a Zzzt event. I don't believe the chance to have a Zzzt scales with more conduit.\n\nI also like to have some redundancy with power conduits. However, it's not as necessary with the addition of hidden conduits since they are near indestructible. Also, if you only use hidden conduits you don't have to worry about Zzzt events anymore.",
            "I haven't got a single zzt event since I started using hidden conduits.",
            "Redundancy is a good thing. Battle damage can destroy power conduits so I always find it worthwhile to have backup paths.",
            "I do that all the time as well, I like redundancy, after a few mishaps where half my base  was left powerless haha; and yeah, underground cables are a blessing. Am not sure if it was made mainstream or it's still a mod(probably the former), I hated those random inevitable zzt events. I still have a billion of fuse switches(mod) that will trigger instead of having the wire event. [https://i.imgur.com/YYBD4AY.png](https://i.imgur.com/YYBD4AY.png)",
            "Not paranoid because I use hidden ones, but it just drives me nuts",
            "ever sense my defensive grid for the east side of my colony got taken down by a inopportune zap, which was (of course) followed by a raid, all of my critical infrastructure has at least two routs back to whatever I have generating my energy.",
            "I don’t do this. I just use hidden conduits.",
            "I use the RT(?) Fuse mod. As basic as a mod can be.",
            "just disable zzzt its a dumb mechanic that never made sense.",
            "I do to but I don’t give a crap about zzzt, I have foam poppers where needed and the rest is almost only stone\n\nMy rooms have conduits in all walls too",
            "I always think about it statistically\n\nEvery conduit can be Zzzt'ed, if you have one - it will be the only one exploding\n\nIf you have them all over the place, then it could explode anywhere\n\nSo I build all my conduits in walls and preferably away from wood/chemfuel, after that - double line to generators and to batteries\n\nSometimes Zzzt knocks out one conduit that was in the wall and half the base goes dark, but I don't have any critical equipment that is not double-lined, so it generally isn't an issue",
            "I'm all about redundancy when it comes to stray mortar shells but I always use the power fuses mod to absorb Zzzzt events.  I put them in line with my power source to make it realistic.",
            "If you can mod.\n\nRT Fuse is great for this, fuse boxes are for this scenario and I love them blowing up over all my batteries discharging in someone’s bedroom",
            "excess power stored in batteries is the only thing that will make zzz worse AFAIK",
            "Just means there's more spots a zzzt can happen. When one is rolled it discharges at a random spot on the grid",
            "Makes zzzt like nothing. Itll blow up some random wall and start a few fires which youll put out instantly",
            "With the new underground ones I finally stopped making a litterall grid across my map every 3 tiles",
            "Fuse mod or circuit breaker mod 🤷‍♂️",
            "Every time I think, \"Oh, I won't need any more conduits!\" I end up with a raid or a mortar or something cutting the ONE wire I need to stay connected. Every. Single. Time.",
            "Yes",
            "Nope, at least once every playthrough it fucks me over and I refuse to learn from my mistakes",
            "https://www.reddit.com/r/RimWorld/comments/xplqtt/my_powerhungry_zzzt_worshiper_colony/\n\nPraise be to Zzzt! Take me to a better place ",
            "In all the years I've been playing, zzzt events never did anything colony-threatening, even as I was pushing the envelope with batteries (in Rimatomic)",
            "Use normal conduits inside/over your walls.\nUse hidden conduits when they aren't in your walls.\n\nAll your zzt events will happen in the walls, and if they're made of stone, there's only a small explosion in the area and no fires.",
            "Building conduits far from each other will mean that you only need one redundancy, because one zzzt won't be near enough to multiple circuits to ruin all of them. Six circuits to your generator is a little silly (also you don't need all that space around your generator, put the walls against it and add an unroofed door).\n\nThe most important thing is to keep walled conduits away from anything important, such as beds or shelves. I've had multiple pawns set on fire while sleeping, and I've also once had a conduit blow up on my shelf of artifacts (like psychic pulsers, etc).\n\nOr just use hidden conduits.",
            "I've never had a zzt happen in my entire time playing because I only use hidden conduits. I do also have multiple wires connected to each part of my base normally",
            "I wouldn't call it redundancy when one of your main lines is just running between two walls with only a huge gap between stone doors as an access. You fork this line back in itself like 7 times. That's really not providing any additional redundancy vs just having the stand alone line.",
            "I did this before the hidden conduits. I considered it to be required. Had too many colonies fail after raiders or fires hit my one power route from my geothermal to the turrets during a raid.",
            "Yeah, me. I do redundant everything, wires, pipes (from Vanilla Expanded), power generators, batteries, paste storage, etc.\n\nJust in case something happens and all my colonists are lying bleeding on the ground, so one wayward grenade won't instantly cripple the base.",
            "I personally try to have at least two conduits to a spot in case one gets rendered non-operable",
            "I always figured zzzt events are bullshit if I cannot research and implement fuses. I'm not going to mod those in so I just disable the event.",
            "yep, i make sure every room connects to every other room so that raiders cant break one conduit and kill my power",
            "You should see mine, which is way worse.",
            "Zzzzt!",
            "Or just install RT fuses like a sane person and research and build fuses...",
            "I have thousands of hours and have never had a Zzzt event cause anything other than a minor annoyance. \n\nEither I'm very lucky or misssing something",
            "pretty sure zzzt only happens when you have electric stuff unoofed during rain, so if all of those are hidden conduits then it should be fine",
            "I'm not a thousand percent sure how it works but I believe it's just a random chance that greatly increases when you have electronics outside. I've never had any indication that conduit alone affects it.",
            "Wait really? At the cost of couple of hundreds steel at max can I finally get rid of zzzt events?",
            "Almost nothing can break them.  Only things I know of are the sink holes, pit gates, meteors, etc.",
            "I believe explosives can destroy them. I keep having to replace them after my mechs wreak havoc on raiders",
            "Unfortunately, they do blow up and burn down your base. It has happened a few too many times",
            "Great someone is gonna make a mod now to make it happen lol",
            "U mean hidden in walls? If so, yes they happen, I already had great portions of my base destroyed because of zzzts in walla",
            "you've never been in the army",
            ">I don't believe the chance to have a Zzzt scales with more conduit.\n\nIt doesn't. I've had multiple Zzzts a year from a building with THREE conduit wires.",
            "There is an exception, actually! If you have standard conduits, but they are not connected to power at all, they can't zzzt. For most purposes this is fairly useless, but they can be used to turn the 'reconnect' button into an on/off switch, or to insure something remains unpowered. Good for quickly turning off sunlamps in an eclipse, smelters and crematoriums when unneeded, or for silly things like using unpowered electric crafting tables to get more crafting XP per item or unpowered turrets to force collision on enemies.",
            "For a Zzzt to have any impact, you also need batteries, so if you only use steady power sources (i.e. no wind or solar/solar only for sunlamps) you do not need to fear the Zzzt",
            "Or you can deconstruct a wall while forgetting you ran a line through it. I definitely haven’t done that, nuh uh.",
            "This is beautiful. I always thought I was going overboard with cables and this made me feel a lot better about it",
            "Yeah, seriously. Just double line important stuff and you'll never be hurt by a short circuit.",
            "I had a zzzt event next to my chemfuel storage. The whole base just went boom. Was hilarious.\nNow I only store chemfuel in places without power lines.",
            "I typically always build with hidden lines, which don’t zzzt, perhaps you do also?",
            "i think you might be thinking of electronics unroofed in the rain, which explode. but do not discharge batteries",
            "One is an incident that can happen if you have any regular conduits, the other is a thing that happens when certain powered buildings get rained on.",
            "If you design your electrical grid anything like OP, you'd actually be saving steel. Some electrical appliances will still go zzt if left out in the rain though.",
            "I've never had a zzzt. Didn't even know it exists other than leaving batteries or coms out in the rain. No zzzzt with hidden conduits",
            "Isn’t there a setting to turn that off, or is that a mod.",
            "I know! It's crazy! I've been avoiding to build a proper grid and only building my power appliances withing connection of their generator for 2 years so I wouldn't have to build any powered wire and suddenly it's no longer necessary. I don't know how to handle all that new found freedom. I'm still using my old builds out of habit lol. XD\n\nI think I'm gonna build a base powered by toxifier generators. I couldn't really do this in the past because having toxifier generators in the middle of my base means cocoons could spawn where it's really not convenient, but if I'm allowed to build a grid then I can put my generators at the entrance of my killbox's maze and let insects fight in my stead. At least that's the theory.",
            "You can also disable it in the scenario editor, or get a mod for fuses",
            "Not completely.  Power sources also have conduits that are not hidden conduits.",
            "If you play Vanilla Extended Mechanoids, they have bots (I think Carpenter was the name of the type) that can show up in raids/clusters that literally disassemble your structures as they move towards your base, including digging up hidden conduits which I learned with great displeasure.",
            "I wasn't sure about sink holes, and hadn't even thought of meteors.",
            "If the wires go through a bridge, anything that destroys a bridge will also break the wire. Something to keep in mind when setting up your electrical grid.",
            "I've had underground wires that were outside of my base for deep drilling get destroyed by melee enemies when my base was still closed up.",
            "No, they don't. Hidden conduits never cause that kind of problem.",
            "Why do you say that like it's a bad thing? Don't download it if you don't want to.",
            "Hidden conduits are a new addition to the game that cost more to build, but aren't visible and don't go zzzzt",
            "I'm talking about one specific situation in one specific video game.",
            "Does it scale with excess power in your grid?",
            ">\"Why is all of my food spoiling in the freezer\n\n-Me on more than one occasion",
            "Yeah, that.",
            "My modular base design actually works? Crazy",
            "You can disable zzt events in the world creation settings.",
            "Good to know about the scenario editor thing, I may just switch (heh) to that. Along with a child learning one, a fuse mod is basically the only thing I use that has any major game impact. I really hate the randomness of zzts and that I either have to plop walls everywhere or disconnect grids with switches.",
            "All bets are off if you bring mods into it.",
            "My great displeasure was finding them in an ancient danger at the beginning of my colony, playing with combat extended. We left the map 😂.",
            "I would need proof of this or for you to explain how it can be reproduced on my end, since hidden wires can not be targeted in melee.\n\nWe are talking about \"hidden wires\" not waterproof or modded underground wires.",
            "To answer your question\n\nFrom my perspective you sound bothered so ill reply accordingly to how i perceive your comment\n\n\n1st\nWhy does my comment bother you so much that you have the need to comment on it 🤣\nmost would ignore it and move on and yes i know i am replying to you but still\n\nSo why did you?\n\n2nd and most important \n(hopefully we learned something here)\n\nTo see who it would take the bait 🤣\n(honestly didn’t think it would be you)\n\nThank you for being number 1 much love 🫶❤️",
            "Nice, been a while I dont play, looks like the mod is no longer needed",
            "alright, i finally got around to double checking how these things work\n\nhidden wires do seem to be indestructible\n\nyou've convinced me, you are right",
            "Nope, it's random. The explosion does scale off based on your stored power though. Makes using a lot of batteries back in 1.4 very scary.",
            "The size of the zzzt scales depending on connected stored energy, but the frequency doesn't. \n\nSo if you have a zzzt prone grid, it is good to make modular storage. I normally have sets of 2 batteries that can each be isolated with a switch, so I can store 6 batteries of energy while only having 2 connected at a time.",
            "Honestly sometimes zzt events make sense, steel isn't the best material for wiring and these people who made these batteries were tribals 2 weeks ago. Something gotta go wrong.",
            "Same for bullshit solar EMPs by the way!",
            "There's a lot of little qol mods that really help. Common Sense (i think that's what it's called) makes it so pawns will clean an area before cooking or doing surgery, reducing the chance of disease as a result. Run n gun is exactly what it says on the tin. Idr the name, but there's an expanded work tab mod that i refuse to play without.",
            ">We are talking about \"hidden wires\" not waterproof or modded underground wires.\n\nYes.\n\n>I would need proof of this\n\nI don't casually record gameplay.\n\n> or for you to explain how it can be reproduced on my end\n\nNo clue. Mechanoids attacked it while destroying a little building I made to house some deep drills.",
            "I'm not bothered, just straightforward. The reason I replied was because your comment was a reply to my comment.",
            "They also got wall lights",
            "Hoo-Rah!",
            "Anecdotal evidence, but I did have a Diabolus' charge attack destroy a piece of hidden conduit. I think hidden conduit is immune to most forms of damage. I think explosions might be the exception. I never actually tested further though.",
            "single wire fault discharging your entire battery bank is... fucking silly.",
            "I wouldn't have any problem with EMPs if there was an actual vanilla workaround. I am aware of the mod, but I'd want something more like having to individually insulate each device somehow. The mod is OP for not too much cost, I think.",
            "Fair enough",
            "possibly just vaporize if thats the case\n\ni just ran a series of tests by detonating things on top of the cables",
            "Nah.\n\nThere's probably no fuse in that system so the short just goes straight into the ground. The batteries completely discharging is the good outcome.\n\nThe bad one is them catching fire or exploding cause they overheated.",
            "Electric systems are silly...",
            "That's why you build a backup battery bank and use a switch to disconnect it from your main power grid",
            "I mean that’s kinda..how..it..works.. in real life",
            "Almost like the game was designed without electricity realism in mind.\n\nNote that there's no maintenance or anything you can do to prevent it. Your wiring exploding and filling a room with fire is inevitable, and can happen multiple times a year.",
            "yeah I remember as a kid shorting an outlet and it totally shut down power to the entire block and discharged everything we owned connected to the grid.... oh wait.... that's not how it works in real life.",
            "[deleted]",
            "It's an abstraction like all things in games lol. If you want a more in-depth power management experience that you can crisis-proof there's games like Oxygen not Included, you just have to deal with dupes instead of pawns, and having played both games pawns are (generally) less likely to die to their own stupidity. Almost everything in Rimworld is RNG, by choice because it's a random story generator.",
            "To be fair real life wiring had a habit of causing horrible electrical fires for quite some time after its invention",
            "What maintenance are you supposed to do on power conduit. In real life you pull wire through conduit and if there's a nicked wire you won't know until it pops. Not a whole lot of maintenance you could do other than replace stuff every few years but not really necessary. Just for conduit at least",
            "A discharge will completely drain batteries not a powered grid. Not sure why you commented one thing then replied with OE from something COMPLETELY different",
            "I work in the production of data centers and the 6v batteries we use are extremely dangerous because they discharge at 13.2kv in one big boom",
            "I do be having dupes going to have their lunch break in my carbon dioxide room tho, kinda wild sometimes",
            "That is why you use a circuit breaker. Should the conduit short circuit because of damage, it will be disconnected before it can cause further damage, like fires.",
            ">What maintenance are you supposed to do on power conduit.\n\nI don't know specifically, why don't you ask the guys in the cherry pickers doing maintenance on electric poles around town?",
            "Most batteries will either:\n\n\\* Have high internal resistance (e.g. alkaline) that prevent them from discharging quickly into a short. The outcome is a dead battery rather than an explosion.\n\n\\* Have active battery protection electronics (most lithium ion or other low internal resistance batteries) that detect and shut off if they detect a short or overcurrent condition. Output electronics will usually also have fuses in case that fails, too.\n\nFor a high capacity gridlike application like batteries in Rimworld I would expect them to fall into the latter category. This is particularly true since batteries don't have a constant voltage as they're discharged and even for DC loads will usually require buck or boost converters to supply a constant output voltage. I would expect such converters to have both short circuit and overcurrent protection, and would also expect an undetected short condition to damage the converter along with the wiring.",
            "I ended up deleting the comment shortly after posting when I started thinking about what kinds of batteries a rimworld would likely build, but apparently not quick enough.\n\nAfter more consideration, they'd probably be building something like lead-acid batteries because of how little manufacturing base is needed to produce them, and there are few battery types better at rapidly discharging themselves than lead-acid batteries."
        ]
    }
}