{
    "Rocket League's Festival of Football Celebrates Football + RL's Ninth Birthday!": {
        "title": "Rocket League's Festival of Football Celebrates Football + RL's Ninth Birthday!",
        "score": 7,
        "url": "https://www.reddit.com/r/RocketLeague/comments/1di4a3k/rocket_leagues_festival_of_football_celebrates/",
        "content": "https://preview.redd.it/g6pauw6b267d1.jpg?width=1920&format=pjpg&auto=webp&s=36df420cab870f221a796efb4250de43133515df\n\nWith int'l football championships around the corner, celebrate the beautiful game in Rocket League’s Festival of Football. Unlock in-game adidas items & more!\n\nWith ***Rocket League’s*** ninth birthday almost here and international football championships approaching, there’s never been a better time to celebrate the beautiful game that inspired Soccar. Join us in a football frenzy as Rocket League teams up with adidas for a three-week **Festival of Football**!  \n⁠  \n⁠Get your ride ready for the big leagues by completing Challenges to unlock Decals and Player Banners based on teams from around the globe. Plus, hit the back of the net in style with one of the classic boot-themed Decals coming to the Item Shop! Rocket League’s Festival of Football kicks off **June 19 at 9 AM PT** and ends **July 10, 2024, at 6 PM PT**.\n\n# ⁠A HAT TRICK OF CHALLENGE REWARDS\n\nEach week of Festival of Football comes with a new set of Challenges that’ll turn your Soccar spirit into footy fever! All the Challenges stack, so you’ll be able to complete all of them until the festival ends.\n\n**⁠WEEK 1 (STARTS JUNE 19 AT 9 AM PT)**\n\nhttps://preview.redd.it/i6ga5muq367d1.jpg?width=1920&format=pjpg&auto=webp&s=2bc6a42f816ffe07f51e14d19950b67c85f6969d\n\n⁠This summer, national teams from around Europe are set to battle it out for a chance to take home all the glory. Our football fiesta starts with an assortment of Challenge rewards themed around some of the competitors!  \n⁠  \n⁠**Challenge Rewards:**\n\n* Northern Europe Bundle\n   * Wales (adidas) Decal and Player Banner\n   * Scotland (adidas) Decal and Player Banner\n* Eastern Europe Bundle\n   * Hungary (adidas) Decal and Player Banner\n* Southern Europe Bundle\n   * Italy (adidas) Decal and Player Banner\n   * Spain (adidas) Decal and Player Banner ⁠\n\n**Additional Challenge Rewards:**\n\n* Golden Egg 2024\n   * *Get this reward up to five times from a Challenge you can complete up to five times (“Play 20 Online Matches”).*\n   * Crack open the Golden Egg in your inventory to unlock items from the **Triumph**, **Accelerator**, or **Impact Series**. ⁠\n* 20,000 XP\n   * *Get this reward again and again from a Challenge you can complete as many times as you can (“Win 10 Online Matches”).* *⁠*\n\n**⁠WEEK 2 (STARTS JUNE 26 AT 9 AM PT)**\n\nhttps://preview.redd.it/1zwopt4t367d1.jpg?width=1920&format=pjpg&auto=webp&s=acfdd8ddd186f34a946c6da38cf9277f59778d43\n\n⁠⁠National teams from the Americas will be showing off their skills in the US this summer! Check out the Challenge rewards you can unlock in Week 2 based on some of the competing teams.  \n⁠  \n⁠**Challenge Rewards:**\n\n* Caribbean Bundle\n   * Jamaica (adidas) Decal and Player Banner\n   * Costa Rica (adidas) Decal and Player Banner\n* South America Bundle 1\n   * Argentina (adidas) Decal and Player Banner\n   * Chile (adidas) Decal and Player Banner\n* South America Bundle 2\n   * Colombia (adidas) Decal and Planner Banner\n   * Peru (adidas) Decal and Player Banner\n   * Venezuela (adidas) Decal and Player Banner ⁠\n\n**⁠WEEK 3 (STARTS JULY 3 AT 9 AM PT): ROCKET LEAGUE’S BIRTHDAY WEEK!**\n\nhttps://preview.redd.it/mik57afu367d1.jpg?width=1920&format=pjpg&auto=webp&s=aa04c9854680bd42d5ad131e97a8032af2ad40ab\n\n⁠⁠Football is a key part of Rocket League’s foundation, so a celebration of football is also a celebration of Rocket League. This July marks nine years since Rocket League first boosted onto screens… Finish out the Festival of Football with these birthday rewards from Week 3!  \n⁠  \n⁠**Challenge Rewards:**\n\n* Ball’d Paint Finish\n* Chromophore Trail\n* Chromophore Boost\n* 3x3 Wheels ⁠\n\n# ⁠DRIVE LIKE A PRO WITH A BRAND NEW KIT\n\nThe fancy footwork of legendary football players is deserving of equally fancy footwear. (Or rather, auto bodywear…) Gear up for the arena just like the pros prepare for the football pitch with these adidas-themed additions in the Shop! \n\n# ⁠F50 ON THE FIELD\n\nThe legendary adidas F50 boot returns after a nine-year hiatus to help the world’s best make the net rustle, and now a Decal inspired by it has come to Rocket League! The **adidas - F50 Jäger Decal** is available in the Jäger Car Bundle:  \n⁠  \n⁠**Jäger Car Bundle (1500 Credits)**\n\n* **Jäger 619 Car Body** (has 13 paint colors)\n* **adidas - F50 Jäger Decal**\n* **Circuit Pro Jäger 619 Decal**\n* **Euphoria Jäger 619 Decal**\n* **Kraken Jäger 619 Decal**\n* **Storm Warning Jäger 619 Decal**\n* **Stripes Jäger 619 Decal**\n* **The Summit Jäger 619 Decal** **⁠**\n\nMatch the adidas - F50 Jäger Decal with the **adidas - Striker Wheels** *(available for 400 Credits)* and go for the goal!\n\nhttps://preview.redd.it/tw805niw367d1.jpg?width=1920&format=pjpg&auto=webp&s=cd2590d76ff5fb164554bab697737ed23d9846a3\n\n# ⁠COUNTER-ATTACK WITH COPA\n\nThe adidas Copa football boot is almost as legendary as some of the famous players who’ve worn it over its 40-plus-year history. That same level of unbeatable craftsmanship comes to the arena with the **adidas - Copa Cyclone Decal**! Get this Decal in the Cyclone Car Bundle:   \n⁠  \n⁠**Cyclone Car Bundle (1500 Credits)**\n\n* **Cyclone Car Body** (has 13 paint colors)\n* **adidas - Copa Cyclone Decal**\n* **Bat Boy Cyclone Decal**\n* **Flames Cyclone Decal**\n* **L-ITA 99 Cyclone Decal**\n* **Sliver Cyclone Decal**\n* **Stripes Cyclone Decal**\n* **Whiteout Cyclone Decal** **⁠**\n\nPair the adidas - Copa Decal with the **adidas - Defender Wheels** *(available for 400 Credits)* and play the position of goalie.\n\nhttps://preview.redd.it/78qrza9y367d1.jpg?width=1920&format=pjpg&auto=webp&s=63e4cd80342b562befd9e56dd7a66f9b4c558f70\n\nIf you're an absolute beast on the field, there’s also the **adidas - Predator Octane Decal** in the Featured Shop tab.  \n⁠  \n⁠Going *beyond* the field? The adidas - Predator Octane Decal, plus all the items in the Cyclone Car Bundle and Jäger Car Bundle, are eligible for cross-game ownership with Fortnite!   \n⁠--⁠  \n**⁠The Festival of Football begins June 19. Celebrate before the final birthday candle is blown out July 10!**  \n**---**  \n**Blog Link:** [rocketleague.com/news/rocket-leagues-festival-of-football-celebrates-football-and-rls-ninth-birthday](http://rocketleague.com/news/rocket-leagues-festival-of-football-celebrates-football-and-rls-ninth-birthday) ",
        "num_comments": 53,
        "comments": [
            "Three weeks of challenges is pretty cool, but was really hoping for birthday challenges that gave credits like the last two years 😭",
            "Devin's like that friend who got too into MLM's and only wants to sell us stuff now :(",
            "Ugh, back to 20 games per 'drop'. Please make it 15 each like the last event that had drops!",
            "Do you want to give a reason you removed the Germany and Mexico decals from the deleted post's thumbnail?",
            "No Germany decal :(  \nNo Poland decal :(\n\nBut at least i have a good Poland Nike decal from last time.",
            "event is bugged",
            "How does the decal drop works? Just got belgium but the other ones don't look like they are attainable?",
            "no germany decal :(",
            "Pretty cool to see that they are doing all paints for the cars sold in bundles",
            "Do the Adidas decals need to be purchased? I remember they did something similar with Nike during the World Cup but those were all freely unlocked from challenges.",
            "So, it appears that forfeit victories do not count towards matches won for this event? Why?",
            "\"Play 20 Online Matches\" challenge is bugged - only registering wins.\nThere's already a separate \"Win 10 Online Matches\" refreshing challenge.",
            "Where is the Germany decal??? I could have sworn I saw it",
            "This actually makes me mad... WHERE IZ ZE GERMAN DECAL?????? \n\nAt least have the courtesy and tell why some of the adidas kits didn't make the cut.",
            "Octane only decals, as usual 🤮🤮🤮",
            "I like this. Can we have MLS items too eventually? Since you guys partnered with the NFL and NBA already I'm sure they'd be more than willing ",
            "This sucks. So for the last world cup we had all participating countries (plus China) with at least banners, and for the euros with way less participants we get selected countries (including Wales who isnt even part of this years tournament). Just because its limited to Adidas.\n\nHoped to see stuff for Albania, Slovenia, Georgia, Turkey, etc.",
            "is there going to be a style for germany?",
            "The Nike decals from a prior event are still some of my favorite decals. ",
            "Is there any possibility that the Nike decals will be available? In shop?",
            "Why not count wins?",
            "I already own the Jager. Why do I have to buy a bundle just to get the skin??? Wish the item shop team would actually think about things like that when they make bundles the only options for these events...",
            "No Brazil decals :/ :c",
            "The Win 10 Online Matches appears to be bugged.  I completed the Win Three weekly challenge and it only shows two wins in the festival challenge.",
            "So is Mexico not getting a decal? Someone please give me an answer",
            "Want the Germany Decal!!!",
            "9th anniversary and it's all cosmetics?",
            "No portugal? Sadge",
            "No more free credits it seems",
            "I am gonna guess they're saving that as a special thing for the 10 year anniversary... exec to they already did it at 8. Who knows how they're thinking.",
            "I live the implication that Psyonix hasn’t always been this. Remember when events used to be free items + literal slot machines that you had to pay to open? Now it’s free items and posted item shop items. Oh, the horror. \n\nPeople have such odd nostalgia for past RL events. They’ve always been this way but worse lol. Free items (used to be you earned currency to ‘buy’ them, now you earn them through challenges), paid items (used to be crates, now it’s item shop), and sometimes rotating LTMs. Even the one that the community claims to love (that several weeks long “throwback” event with ghostbusters theme and whatnot) was the same thing… just had a cool theme song instead.",
            "I know Germany's contract with Adidas ends this year as they agreed a deal with Nike, not sure if that has relevance or not.",
            "I guess they got scrapped at some point. Was looking forward to that Germany decal :(",
            "You at least got a nike decal.\n I got like a decal made in ms paint with my country's flag slammed on top, very terrible looking.\n\nCan't blame em much I guess it's hard to get one for every country.",
            "The game win rewards are not counting for the event to get a level up after 10 wins",
            "They are Challenge rewards, so should be free.",
            "Germany's contract with adidas ends soon and Germany already signed with Nike, so I guess that's why.",
            "It would legitimately make me spend money on this game again. That and a \"No Scrubs\" by TLC player anthem.",
            "While the Fortnite Battle Pass gives 550 more V-Bucks than it costs, and the free version gives 300 (https://fortnite.fandom.com/wiki/Battle_Pass#Description) 😔",
            "Remember when events were literal new maps and game modes\n\nthose days were fun",
            "Remember the days when you could clear three levels in a couple hours of game play without the weekly challenges? Remember when they used to give us a random item every level on top of the Rocket Pass items?\n\nPepperidge Farms remembers.",
            "Same 😭😭",
            "xDDDDDDDDDD\n\n  \n=sorry :D What country is that?",
            "Wow. Never touched Fortnite so I am completely unaware. But that shows how Rocket League will forever be a 2nd class citizen under Epic Games.",
            "Nobody ever played those LTMs lmao. And people complained about most the maps (remember how ‘unbalanced’ that stranger things map was where one half is blinded?). This is exactly what I mean, pure nostalgia vision. The rare successful one is still a rotating LTM anyways (heatseaker, gridiron, etc).",
            "[Tunisia](https://itempreviews.rocket-league.com/aa395e7e22c00b8264c2ffaf1a0d00f9bb66682f4cc401178678309d844d5b2c.jpg)",
            "The successful ones were new at one point.  You don't want more of those?",
            "Lmao 😭 oh my god bro, that looks awful, tf they do to Tunis???",
            "I’m just saying they’re few and far between so clamoring for them is weird. I thought you were more just idolizing crates of the past given your comment about devin trying to sell us stuff though, even though they were much worse about it in the past.",
            "Honestly I am just glad they didn't didn't mistakenly put Turkey's flag instead of ours (yea it happens lol)",
            "Nah I don't do skins whether they're from crates or stores or whatever\n\nI just want new content :(",
            "Definitely won’t disagree with wanting new stuff that isn’t just decorations for your car, free or paid!"
        ]
    },
    "RLCS 2024: Major 2 | Day 2 of 4 | Event Thread": {
        "title": "RLCS 2024: Major 2 | Day 2 of 4 | Event Thread",
        "score": 0,
        "url": "/r/RocketLeagueEsports/comments/1dl1a2v/rlcs_2024_major_2_day_2_of_4_event_thread/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Peak Champ play": {
        "title": "Peak Champ play",
        "score": 450,
        "url": "https://v.redd.it/n8j4emhv708d1",
        "content": "",
        "num_comments": 181,
        "comments": [
            "This has got to be one of those rage bait videos istg",
            "Lolol OP plays like dog shit the whole clip then slaps his teammate with an \"okay\" and immediately votes to FF after. Typical RL player",
            "I think you blocked your teammate from scoring 3 times",
            "I found the random teammate that messes up in every possible way, then rage quit. Nice to meet you OP",
            "This is insane lmao",
            "Sorry you got paired with a player like your teammate. You’re very good at cutting your teammates off, and your teammate was ass at reading you interrupting his shots",
            "there is no way u are champ",
            "No way after all your terrible gold level plays (generous), you hit tm8 with an Okay.",
            "You robbed your teammate",
            "Good grief, leave the ball alone!",
            "This post has to be satire, there is no way, you can mess up that many time then \"okay\" your teammate and ff the moment they make one mistake. Like this op probably stopped his teammate from scoring like 3 times.",
            "man, yall really didn’t want it huh",
            "Zero rotations in a full 60 second clip is wild bossman",
            "You would frustrate the fuck out of me OP",
            "Okay.",
            "1st one OP thought his team mate wasn't coming even though he flipped forwards but whatever. That's understandable.\n\n2nd one was a plat jump at everything move.\n\n3rd one what the actual fuck.\n\n4th one was just a shocking \"I have to score\" \n\nYou have a team mate for a reason. Go play ones. Players like this are infuriating to play with",
            "bro around the 10 second mark, when you grab the mid boost, and use 60 of it in 1 second..........",
            "What a ride lmao",
            "Holy fuck boys take a chill pill",
            "The tale of 2 ball chasers: either could be GC if they played like teammates instead of glory seekers.  ",
            "I got as far as the musty preset lol",
            "You totally could've still saved that if you focused on playing the game instead of raging",
            "Bro you just gave me hope that i can hit champ one day",
            "You honestly look gold 2 not trying to slight you just the truth",
            "Aint no way this is champ lmao. This is G3 or P1",
            "Your first problem is being a Musty fanboy",
            "Meanwhile in my C1 division 4 lobby a guy hit a ceiling shot with a double reset into the top of the net.",
            "*Double commit! Triple commit! Quadruple commit! Commitacular!*",
            "This has to be satire right?",
            "you could tell me this was gold 2 and I wouldn't second guess lol",
            "Now This is Rocket League!",
            "Many of those empty nets going slightly high off the post seems to be a common c1-c3 error.",
            "Diamond 2 is looking as it should I see.",
            "There's still time to delete this clip",
            "This is what it feels like having sex on SSRIs.",
            "OP has such good car control when he's nowhere near the ball, then as soon as the ball comes near it's like the controller was handed to a toddler.",
            "If this is champ then how the hell am I still G3/p1? Lol. I know I belong where I am but damn videos like these make me feel better about myself.",
            "If this is champ there's no reason I should be stuck on the cusp of plat rn",
            "How do you get this good?",
            "OMG!",
            "Bro is reverse smurfing.",
            "Ain’t no way your champ. You play like a plat 2 at best",
            "Lol instant fft 🤣",
            "OP stopped a goal from his own teammate at least three times lmao",
            "Looks like platinum to me",
            "Why is it so tough for people to just rotate and pass? I feel like 80% of people actually wanna play ones but prefer to have a teammate behind them to mop up after them when they mess up. I can play 30 seperate games and typically I’ll get 1 maybe 2 teammates who actively look to pass the ball and rotate. Solo 2’s has just become a painful experience lately",
            "So you're the kind of champ player who - as everyone else pointed out already - cuts your mate, chases behind a ball, fails every opportunity to let your mate score, \"Okay\"s your mate if he maksa one mistake, while you have done much more and then rage ff.\n\nHow in the name of holy octane and dennwx did you reach Champ with the way you play ranked?! Did someone give you a favor? Luck?\n\nThat's mostly the way I've a duo mate on a Discord Server which whom I play, then I don't have to be paired to players like you.\n\nYou should really try focusing on what you doing wrong...",
            "looks like a p3 lobby to me",
            "This is Plat 1 at most. Come on.",
            "you HAVE to be like low gold or something",
            "If OP thinks this is peak champ gameplay, then this must be his first game in champ after not having his GC friend there to boost him.",
            "[deleted]",
            "More like plat gameplay",
            "This hurt my soul…",
            "Nice cx",
            "💀",
            "Dang he didn’t forfeit in time",
            "Crossbar Heros",
            "r/maybemaybemaybe",
            "Just like me fr 😢",
            "In a 1v1, I hate it when people quit when you're about to score, I find it childish, no respect for this player",
            "op, is this satirical?",
            "Good laugh :D",
            "brother leave the ball for a second or two",
            "Can confirm",
            "This is the reason why communication is the key in this and 100% of all team sports. At least with a couple of \"I got it\" & \"All yours\" could've prevent so much pain.",
            "my eyes",
            "bruh learn to rotate holy shit",
            "imma champ player and iok even play like this, you still have a plat ass mindset",
            "Let someone else take a shot. And, go watch some football, you have 0 sense.",
            "You took the open net away from your teammate and centered it so they can have an open net only for the enemy's teammate to take it away from him LMAOOO.",
            "OP, you are a ball chaser.\n\nI don't know how you got to Champ, but I sincerely hope you don't remain there long.\n\nAll the best.",
            "Genuine question, if there's a replay system in the game, why does everyone assume we're even watching op's perspective here?",
            "The ranking in this game is insane. I play low diamond and maybe 1/10 games are my opponents this bad.",
            "Loved how the crowd started chanting defence when you blocked your mate for a 2nd time. \n\n\nBut I genuinely have no idea why you're going for that shot on 1:23. You knew your mate was behind you with a full tank. Either get out of there or do what I would've done and bump the keeper(s). ",
            "Missed your teammate up 4 times and missed 3 open net opportunities the throws an “okay” in chat and votes to ff. Why would you want to post this clip? Smh shameful.",
            "My eyes are upset",
            "I didn't know you were screen rec me",
            "This is champ? My buddy and I have been playing like this for years and are stuck in plat lol",
            "I'm surprised OP still has this post up. He's getting destroyed in these comments",
            "omg so YOU'RE the random i meet in 2v2s!!",
            "That game sense 💯",
            "Lol",
            "Honestly deserved imo. That horrible play. If there is one thing I hate is when my teammate does me a \"favour\" and I imagine in their head they think they're a Brazilian footballer or something is don't lay it off. People really put power into their shots and to get power you need momentum. If you move the ball they're gonna miss the shot that could've resulted in a goal. Don't do this in fact just don't even look at the ball and move out of the way. It's not needed. Reverse. Also keep it simple. Felt like you guys were clearly the more talented players but you were over complicating very simple shots.",
            "oh my GOD stop being scared of the ball being untouched",
            "I'm copper II and you stole this clip from my game play.",
            "Love to see my swiss boys shining! On a more serious note: most of the people who comment „you play like a low plat“ have most likely never saw a replay of their own lol",
            "Silver ll*",
            "I do be like that",
            "As a lowly Diamond the bitter rage from all the solo queuing C1s taking out their hate for their teammates on OP is hysterical lmao. Down here someone would’ve scurried off to midfield about halfway in to grab boost before one of these taps rolled into the net after orange double whiffed a save",
            "it also has a reddit flag in their car, it has to be ......",
            "I think he slapped himself with an okay. But I’m not sure with both players fucking up so bad.",
            "Fr wtf",
            ">  and immediately votes to FF after. \n\nI mean, 4 to 1 with 45 seconds left isn't an unreasonable forfeit. Especially after missing so many goal opportunities, I think it was pretty clear to OP they probably won't have a comeback.\n\nBut yeah OP and his teammate are not really doing so well...",
            "Had an absolute howler of an open net miss too.",
            "OP must have multiple accounts because this happens far too often.",
            "This is basically the average champ gameplay and I'm not exaggerating at all.  \nThen they'll get hyper-inflated egos as if they're infallible gods, after they just made more mistakes than you can count. I'm far from perfect, but people in champ+ still lack so much awareness it's absolutely maddening.",
            "Maddening, even",
            "This is what I be sayin in most champ lobbies that I play in, alas there are hella boosted players there like those two 😂😂",
            "Pretty sure it was sarcastic",
            "What rank are you?",
            "why are you acting like champ is good",
            "he \"okay\"ed himself and obviously the title is sarcasm. he's posting his own mistakes and is being flamed for it, I don't get it. I'd offer my teammate a way out of that game too after messing up so bad.",
            "Don't forget picking up a boost and then proceeding to use more than half of it to go in a circle and continue to ballchase",
            "All the champs at each other's throats like \"nah that ain't me\"",
            "This needs to be top comment. So many lower ranked players missing the real problem as the unawareness of each other on this team.",
            "I'm sure he/she/they doesn't belong to this rank...",
            "Lmao sadly I’ve seen lobbies this bad..it’s wild who ends up in champ sometimes",
            "Its like there are only 3 champs in this lobby. OP is reverse smurfing lmao.",
            "I bet it's legit champ. The speed of play/reaction time is there, and that's enough to beat lower ranks. He's just a total ball-chaser.",
            "There's constantly situations like this in Champ, only they usually don't draw out to this extent. It's very unlikely, which is why it's gotten so much traction, doesn't mean the players suck. Watch any pro 'Road to SSL' type video and you'll see high GCs flop around like that. Almost any player can be made to look foolish by getting them into the right (wrong) situations.\n\nNow that doesn't excuse the blatant mistakes present in this clip, I'm just saying just because someone looks terrible in a select clip doesn't mean they're terrible altogether. Everyone has their weaknesses and when they're exploited they look like shit. And when they get to play to their strengths they can rip through other teams, that's just how this game goes.",
            "im an actual p1 and lobbies are miles beyond whatever this is",
            "Unfortunately, the main gate separating the ranks is simply speed of play/reaction time. This guy reacts quickly enough that he can probably brute force his way through lower ranks.",
            "Imagine I am C3 and there are Player like OP over there in my rank games... :')\n\nSometimes I feel man Champs don't belong to champ, but more to Plat.",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^Gubrach:\n\n*OP stopped a goal*\n\n*From his own teammate at least*\n\n*Three times lmao*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "Ever heard of sarcasm?",
            "Well I mean it’s a clip, everybody has off days.",
            "The teammate didn’t fuck up too bad, or at least nothing glaringly obvious, until the very end when they actually did. Op on the other hand cut his teammate off at three separate shot opportunities, and also completely missed an open net chance",
            "Unfortunately I've had that happen a time or two so I can't really talk",
            "I have always played 2's with the same guy, managed to hit champ a few times before the last rank-shift.\n\nThis could have been us.\n\nEvery 8-10 games we have a game, where it's like our brains short circuit.\nWe'll stop every good routine we've had for the last 5 years of RL and constantly get in each other's way.\n\nThen, the next game or the next again, we'll be back to normal with good rotations and playing well again.",
            "I feel like it has gotten so much worse in the last 2ish years. I would play regularly and was at c2/c3 a few years back. The gamesense back then was a million times better, rotations and positioning actually made some level of sense, the main killer was just inconsistency. I recently played a few games again and good lord, the average champ player has gotten so much worse. Even their mechanics aren't any better.",
            "To be fair (and I'm not taking myself out of that even though I'm not technically a champ since I'm unranked and the following part doesn't apply to me in regards to the positive side) it's also quite normal to see effortless flip resets and double taps etc. in Champ. It's just often that they either only ever free play free style and therefore absolutely suck at defending or just generally lack awareness of positioning getting into uncomfortable positions where most anybody below SSR tends to look goofy, and panic (as here 2 goals down basically 1 minute left) causing brain to go brrrr. \n\nThat's why within two matches you can lose 0-6 with the other team prejumping full field passing plays by the end and then the next win 4-0 because their shots didn't hit, they got in their heads, you held them in defense where they're not nearly as confident etc. \n\nBut yes, high Diamond and Champ is full of people that are absolutely toxic yet think they're infallible. God forbid they ever see a replay from their teammate's perspective, their brain would explode from either the realization they make exactly the same dumb mistakes, which is why they're champs, or from failure to achieve the insane amount of cope and double standards required to come out of that still feeling they're better than everyone else.",
            "Bro you're this guy too. Take it from someone with 6k hours, y'all look like this.\n\nShit, *WE* look like this.",
            "Who says champ is not good?",
            "the vast overwhelming majority of all people who will ever play rocket league will never make it to champ",
            "the thing is, it's not really obvious  because personally i run into teammates like OP often, and they legitimately flame me",
            "I thought everyone was INCONSISTENT as I am.\n\nI'll have games where I play great and get accused of smurfing. Then I'll have games like this, where I know I'm fucking up, but I don't know how to unfuck it wont making a bigger mess.\n\nAs long as you have more good games than choking ones you'll climb.\n\nI even play with the same teammate all the time, but we'll still manage to get completely out of sync with each other occasionally.",
            "this is why ur plat buddy",
            "Obviously untrue. They're fucking up, but they're fucking up way faster than you could ever dream of fucking up.",
            "What was the point in uploading this?",
            "Tm8 tried to shoot with op directly under the ball lining up a shot. This is two monkeys fucking a football",
            "It's okay. I was still being generous because he had 3 good chances to score. He could've scored just one of them and it would've saved him some blushes.",
            "It’s not normal at all to see flip resets and doubles in champ, trust me I know… \n\nI’ve played 8000, yes 8000, ranked 2s and 3s games in the past 7 months, half of those in champ. Great solo plays like flip resets and doubles basically never happen in champ, and when they do they’re slow, readable, and easy to save. You’re just repeating a common cliche shared by hard stuck low ranked players coping about their rank not really being that bad. \n\n Champ players and god awful. Terrible. Basically golds who move faster around the field just for the sake of being fast and not based on the unfolding play. inefficient movement wasting good positions and boost just to be fast. Giving the ball away at every opportunity. Diving in as last man for no reason. Braindead decision after braindead decision. It’s amazing how easy it is to win in champ if you just follow a few basic game principles. It takes very little skill to be in champ\n\nAnd yes I’m talking anywhere in champ. Champ 1 div 1 to champ 3 div 4.",
            "This was a especially bad match though, sure champs ain't no consistency machines but this was just them being plats for a match.",
            "Nah, I wouldn’t be up there challenging like that. Not my play style: I’d let my teammate flail around with the opponent until there was a clear opening and then go for the shot…granted I may miss the first attempt, but I ain’t missin 3 or 4 opportunities like that in a row. I’m def more consistent than what was presented in this clip. And I’ve had my bad days",
            "I have 4K hours and am a GC 2, I still play like this, and I actually think the mechanics of OP outweigh me. \n\nThe part that doesn’t is his positioning and game sense 😔",
            "The best is these comments 30 seconds into a match after a mistake from you when literally 10 seconds earlier the person saying that made exactly the same mistake. I get that people play differently and some may be much more consistent but therefore with garbage rotations or a much lower skill ceiling etc. but the audacity of saying \"everybody else at my rank should be much lower\" and not realizing what you're saying is incredible.",
            "Champ is the top 10% of the playerbase.",
            "![gif](giphy|VStxBrCyssRPO|downsized)",
            "and I always run into situations where i am just being nice by saying \"Close one\" because it was fucking close. Teammate immediatly triggered. This also happens to me with other quickchats too.\nSure some teammates do flame but I feel like many people are not considering that people are actually being nice, everyone always just assumes negativity.",
            "It is hard to draw conclusions for exactly that reason but seeing how they uploaded the clip themselves and it shows them clearly missing an open net and taking it away from their teammate while trying to pass TWICE, I do think they were shitting on everyone involved, since it doesn't paint a good picture of anyone there. (Which is not a diss on anyone, situations like this happen all the time, this is just one of the few were it went on for a very long time).  \n\nAs for the 'okay,' that one's on the fence, it may be simple frustration about the 2 minute power play that resulted in 7 shots on goal for them but a goal for the other team, or it may be OP being a toxic shit putting the teammate down after their first decent touch of the entire clip when they didn't score a ball they couldn't possibly have reached without massively overcommitting beforehand. The FF seems quite logical 3 goals down less than 50 seconds to play after this sequence of events. It's extremely unlikely they come back after this and it would likely only serve to frustrate them both more, carrying over to their next games. I'm not a fan of early FFs but this seemed very appropriate to me. The 99 matches you go out feeling worse at 0:00 than right there at 0:46 definitely outweigh the 1 where you somehow turn it around and get a major boost from the achievement.",
            "Self awareness is unfortunately very rare in this game (though arguably it is anywhere on- and offline). I've also played in GC lobbies not sticking out some days while missing simple aerials on other days. Some people are definitely more consistent with a lower ceiling (which doesn't mean they can't raise/aren't raising that ceiling obviously) but whenever I see toxic fucks this is exactly what I think. You must be either a garbage human being or incredibly unaware to think a player as bad as you apparently perceive them to be being the same rank as you is some kind of affront to God.",
            "Yep that's exactly right. If you're pushing the limit of what you're capable of, eventually you're guaranteed to be the worst player in the lobby. It's totally normal.",
            "OP literally backflipped while going for an open net aerial. I haven't seen that kind of fuck-up since I was playing silvers.",
            "I thought it was hilarious",
            "You talking about the one at 19 seconds? That is 100% the other guy's ball, especially once you hear him jump.",
            "I can tell from personal experience that pretty much every single lobby in Champ has at least one player that reliably hits flip resets. Now that doesn't mean they're inherently productive, but most players, myself included, are not prepared to defend that very well at that level and so it is a powerful weapon. \n\nLike I said, there's no cope, I know GC is technically not that hard to reach, but my ability and time available to invest in it limit me to where it would be a great feat if I ever get there. Players in Champ are incredibly reliable when they're playing to their strengths, they're just usually pretty bad at defending, absolutely horrible at playing with a teammate, and panic very easily which brings them back to Plat level 'chase ball at all costs and smack as hard as I can.' It's also the fringe where players start taking it slower and not throwing the ball away at every touch but are very inconsistent with their soft touches while defenders still struggle with balls that are just yeeted at their net. Which in itself paints a clear picture of the skill level.\n\nWhat it isn't, though, is a constant slugfest of whiffing balls and empty net counters as in this video. This is an extreme example which is why it's gained so much traction. \n\nOversimplifying it one way helps just as much as the other way, which is none. Any rank up to lower end SSL can be exploited very easily if you have the means to. The problem is most people and players don't, hence the rank distribution as it currently is and has always been. Just because you can, doesn't mean everybody can.",
            "You mean golds, I am gold in 3s and 1s and this seems like it's a mid/low level gold gameplay",
            "Send me a couple of game replays, let's test that theory.",
            "Champ is god awful man. Get a grip. Just being in the 10% doesn’t mean you’re good. 80% of people play RL on an old 50 inch TV lounging 8 feet away with their console controller in one hand dick in another. All that with severe input lag and 30-60 fps. And then add all of the Nintendo Switch infants who play…\n\nYou telling me champ is a good rank because it’s in the top 10% is equivalent to me saying I’m good at Soccer because I’m one of the better players in a league where the vast majority of players move with crutches and an orthopedic cast on each foot.\n\nWe all know champ players don’t even have a basic understanding of positioning, not giving the ball away, how to 50, how to solo play, I can go on. Bad mechanics and bad strategy does not equal a good player",
            "I'm with you.  i give nice shots to the enemy,  what a save on good saves for either team, and close ones when it was actually a close call.  i try my damn best to stay positive. \n\ni do get mad and frustrated from time to time but i never type it in game, or ff early or afk or any of that.  i see it a lot though.",
            "Whenever someone beats me like 6-1 and goes \"omg, how are you the same rank?\" I want to say, watch an RLCS team lose 1-5 and the next match win 4-0.\n\nIt's SO common.",
            "Aerial* \n\nThat's one of the most common fuck ups all the way to the top of champ. It's called a plat flip, usually happens when someone is going for fast aerial",
            "Idk I should strive to almost get goals peak gameplay not even close you probably play like this so it's funny to you tho🤡",
            ">especially once you hear him jump.\n\nI never paid attention about this. Thanks, you may have changed my gameplay forever (I will forget this in 10 minutes)",
            "Man maybe I should turn up my volume lmao. Always play RL damn near mute while I have a YouTube video going",
            "In C2 and C3 I’d say yeah sure, C3 it’s the norm, C2 there’s probably one person in the lobby who can semi reliably, C1 no, it’s a Smurf or someone playing with a friend (or that’s all they go for and they have horrendous game sense).",
            "I'm like middle of diamond and I'm this guy in like half my games\n\nI really just float by on good vibes that keep teammates wanting to play. Typing \"mb\" on your first mistake immediately makes 90% of the player base chill, I swear to God. It's like a cheat code",
            "“Let’s test that theory” is a statement I live by. Sure, I can send you some replays the next time I play. My old replays are actually better than I currently am so I’ll get you some current gameplay to look at. You got discord?",
            "Triggered af",
            "same same",
            "100% same",
            "OP didn't even properly go for a true fast aerial. They didn't boost before pressing their double jump. And yes, I am aware of what they were trying to do, but I got rid of that habit as soon as I learned fast aerials - if you don't before you're out of plat, you're doing something wrong.\n\nA fast aerial wasn't even needed there. You could easily cover that without a double jump. If you aren't consistent with it, why even go for it when there are other options?",
            "Lmao the joke was that it's \"peak champ,\" because the game play was so bad. Relax my friend.",
            "Geez so hostile over the op clearly self deprecating himself.",
            "easy there",
            "I do! I'll PM you the details",
            "It made sense to go for a fast aerial there as in champ you want to get on the ball fast or else the defense will beat you there. It's not like plat where you would just wait for the ball to come to you.\n\nAnyway, it's always easy to criticize every mistake in someone else's gameplay. Weird to do it on something like this where OP is self deprecating. You're not as good as you think you are if you're legitimately as low as plat 1. Also, GCs still plat flip once in a while. Ya it's not common, but it happens.",
            "I'm not pressed my dude just I thought I was finna see something🔥🔥 gameplay not this bs🤷",
            "Sorry my comment didn't appease you it was just my opinion zip bro pants up after you done 🍆🚴 tho",
            "Gonna need an update on how he does.",
            "Turn on your audio. Nobody else jumped, and nobody had any clear saves. Op should've gone for the safe option of a simple aerial, but instead went for a mech that they're inconsistent with.\n\nThat's like if you were to go for a flip reset when a simple air dribble would've worked, except a fast aerial isn't even flashy.\n\n>Anyway, it's always easy to criticize every mistake in someone else's gameplay. Weird to do it on something like this where OP is self deprecating. You're not as good as you think you are if you're legitimately as low as plat 1. Also, GCs still plat flip once in a while. Ya it's not common, but it happens\n\nYou're the one saying that plats couldn't dream of fucking up in the ways shown during this clip, even though this literally looks like a plat lobby. These are mistakes that even I, a plat 1-2 player, can recognize. I don't think I'm good, I just think that this lobby is something I'd expect to see in Plat or Diamond, not Champ.",
            "The subversion of your expectations is where the humour is.",
            "Have you been introduced to sarcasm? It's pretty clear on the title if you have used the internet for more than a week",
            "Lmao crash out and double down. 😂. Keep going kid.",
            "Ya boy did send me some replays, I'll look at them when I get home and let you all know.\n\nI don't mind the downvotes, but make sure you guys upvote the original commenter, he stuck to his word o7",
            "It's kinda funny reading your comments thing to educate people on a higher rank than you. Kinda like a toddler trying to prove their parents wrong with the cutest baby voice. People fuck up badly sometimes in every rank, bro and if you were good enough to get out of plat you'd see that too.",
            "That's not sarcasm that's click bait but whatever bro",
            "And the fact your tryna son me bro I'm older than you sorry I don't internet troll you have fun tho bud✌️"
        ]
    },
    "This here, is my lowest point in RL.": {
        "title": "This here, is my lowest point in RL.",
        "score": 343,
        "url": "https://v.redd.it/2rmf60std08d1",
        "content": "",
        "num_comments": 64,
        "comments": [
            "The shame waiting for the ball to land so Vote to Forfeit switches to Leave Match",
            "Your lowest point so far.",
            "The delayed “Nice shot!” 😭😭😭😭",
            "Ooof! It happens",
            "For what it’s worth this encourages me to play some more rocket league today",
            "Head up big guy, you’ll get em next time",
            "Yeah that’s rough",
            "This is the content I'm here for",
            "That’s my lowest point too, every night",
            "I know your heart sunk, mouth dropped wide open. and hands were instantly placed on your head as masses amounts of guilt filled your body. (i know this from experience)",
            "“Bruh, why you trollin like that”??? Would’ve been my chat lol",
            "Don't worry about score and games so much. It's just one game. Rank is just a number",
            "I've had worse LOL",
            "😂😂😂",
            "Close one!",
            "This is the content I'm here for",
            "I'd FF just based on the player \"anthem\"",
            "Faking",
            "Yikes",
            "That hurt to watch",
            "Should've just played it cool  \n\"Well since you tried to forfeit while 1point down I assumed that meant you wanted the loss\"",
            "I was like \"oh looks like they're going to OT, I wonder what OP does there to embarrass himself\". That OT never came. RIP",
            "How",
            "Happens to me all the time. Somehow I still manage to finish the match.",
            "This exact shit happened to me like a minute ago but I’m way too embarrassed to post it here. Also, I have now uninstalled it.",
            "Completely normal phenomenon",
            "Wow",
            "Happens to best of us",
            "You are so brave.",
            "Noooo!",
            "Been there, done that",
            "I felt that, my guy 😓",
            "Faker_rll eh. I've played you a couple times. Never seen someone I know on a subreddit, pretty cool",
            "Ah yes the classic Wow! Spam when a teammate makes a mistake. RL at its finest",
            "The amount of rage quitting in this game is insane.",
            "My friend had one of these happen in ranked the other day, had to pull him aside to ask if he was all there. Massive Aura loss",
            "Holy fuck. I know that pain. I have been there and that feeling that stings through out your body lingers for a time.",
            "was this guy (Nixus freestyler) toxic? If yes then its the same guy ive played against lol",
            "Nah. How in the hell did you manage that 😭😭",
            "Jesus, I thought I saw it all in this game. But after 8 .5 years you take the cake sir\n\nNot going for the easy demo/bump after the fake kickoff was almost as bad as the open net miss. What is the point of flipping in a random direction after a fake kickoff… with 10 seconds left… just simply turn slightly to the side of the ball. Same result and you stay in the play.\n\nAt least get the full boost in mid and get ready for a pass if you’re not going to demo. You put yourself in no mans land with no boost smh. 🤦‍♂️ \n\nif your teammate called for the fake kickoff this is all excusable, but you were the shot caller and didn’t even follow your own play",
            "People that are this bad...why are you recording yourselves?",
            "then the selection automatically goes back to 'resume game' once the game finishes so you have to scroll down again to leave game",
            "I sat there for a good 10mins asking myself HOW that happened😭😭",
            "*buddy",
            "It’s not that serious",
            "idk man, I'm sorry😭😭😭",
            "You should 1v1 them",
            "https://preview.redd.it/l7goifaju08d1.jpeg?width=720&format=pjpg&auto=webp&s=a664e2eddb1dbae05ef8b15855b04555468214fb",
            "happens to everyone",
            "Not everyone playing this game for fun thinks he’s in RLCS. Some of us actually have fun and don’t pretend is life or death.",
            "pls post tracker.",
            "But when it automatically goes back to 'resume game' you press 'x' thinking youre hovering over 'leave match' , but it resumes the game, then you spam the down button late thinking it'll scroll down to 'leave match' but its too late, youre in the game spamming \"Sorry!\" so now your teammate thinks your taking the blame for the loss",
            "https://i.redd.it/qklqczey438d1.gif",
            "Slow balls can throw most people off.",
            "Champs takw the game a little more serious LOL. Trust me i can tell you from experience they are toxic asf",
            "something a diamond 1 would say 🙄😒",
            "But 1v1 on the alt account with a new controller and camera settings",
            "https://preview.redd.it/qqpbadh3118d1.jpeg?width=320&format=pjpg&auto=webp&s=6617fcec3310714d96afa36266fa893cb21f3205",
            "Are you me? Am i you?",
            "lmao this is 100% my experience down to the \"Sorry!\" they definetely didn't deserve :')",
            "I’d rather be D1 and not need therapy when I miss a shot",
            "Try holding yourself to a standard , you might rank up.",
            "LOL"
        ]
    },
    "I have a few sets of these in all four colors. Any idea what it’s worth? ": {
        "title": "I have a few sets of these in all four colors. Any idea what it’s worth? ",
        "score": 336,
        "url": "https://i.redd.it/inprezjsc08d1.jpeg",
        "content": "",
        "num_comments": 74,
        "comments": [
            "Can’t do anything with em since they took out trading with other players😔",
            "Bout 100 credits",
            "Most physical RL memorabilia isn't worth much money. No market for it.",
            "4(octane)=4(8ane)=32ane",
            "I'd buy a set off you",
            "As a toy collector these things are worth what someone is willing to pay for them. You don’t have a highly sought after set nor is the market high on something like this. To me the value is what you think their worth to yourself and I think holding onto the for a while might be the best option. The game is still being played and I think if it shuts down or if you wait for some of the kids who are playing it now to grow up and might value these more later than say what the current market thinks about them. That being said I would only post them for about 20% more than what you paid for them. Only cuz you do have to pay a sort of premium for getting them all at once. \n\nBut honestly put them in a box and put that box in your basement. Forget about them for about 5 years then pull them out. Collectors by that point might be more interested in them as stock will have most likely ceased to exist in stores and you might set off some nostalgia buyers when they see them then.",
            "Just ebay to see. Single brand new hot wheels sell at around $15-20 a piece. Open, or \"used\" might go half of that, but there is certainly a market for these. I still would like an in-box blue and orange.",
            "Tree fiddy",
            "I'll buy a set",
            "As someone who collects and frequents r/hotwheels. 5$.",
            "I'd offer like $25?",
            "Hot Wheels collectors do not value fantasy cars typically unless it's a popular movie cast that was plastered with \"LIMITED EDITION\" all over it.\n\nI used to collect Hot Wheels, and FOMO'd on limited edition things because of past limited things sitting on the second market for high prices.",
            "Yo probably actually worth something cause you can indeed trade those\n\nUnlike...well...you know",
            "Looked on Amazon, saw a couple for 30-80 dollars each for the middle 2, couldn’t find any for the 2 on the outside though (middle 2 are hot wheels)",
            "Just from a collector stand point. You should've never opened them. If you have unopened sets, leave them be and sell them later as a set. Rocket League and hot wheels are both very popular to a select few people.",
            "What did you pay for them? Cause the answer is that much.",
            "![gif](giphy|NmiVAPnPAHbonwjzpV|downsized)",
            "In their boxes they're worth about $8-10 (with free shipping) to people",
            "$4",
            "I never got an orange one 😔",
            "Those look cool",
            "If they're officially licensed by hot wheels about 50 bucks each",
            "About 5 keys",
            "Oooo I didn’t know there was green. I have blue, red, and orange",
            "About 25-30$ each.",
            "If I can still buy some of these anywhere it's awesome :o",
            "Thanks bro. This post made me remeber that this things exist and you wont believe it. Someone in my country is selling a full set ( idk 14 cars or so ) with the 4 special edition ones and i just bought it for 50 bucks. Thanks a lot for sharing this or i wouldve probably never found one xD",
            "I was literally looking on ebay for one of these yesterday. Specifically a blue and orange one. They go for £10-£30 a piece if they were in the package. Loose they're like £8-15\n\nI'd love the whole set, but I'm not paying £20 a car.",
            "about 240 upvotes so far",
            "I think like $80-100 usd if still in the package",
            "Too bad not in original packages. $70 for the set new.",
            "I’ll give u 500 creds and 1 anodized pearl",
            "I've let my 5yo play with my blue one, because I think it's gonna be worth fuck all :p",
            "How much for the blue one????",
            "Dm me!!!! I want it soooooo bad",
            "I'm missing the green one.  Mine are still on their cases.",
            "I have the whole set too. But mine are opened and displayed like the picture. \n\nI doubt these get super valuable. Rocket league just isn’t a huge game and even in 10-20 years they might peak in value long before that. You’ll have to find a completionist hot wheels collector or rocket league super fan.\n\nMost regular hot wheels collectors don’t really care about the “fake” cars",
            "If you bought them at a reasonable price, probably about 50% of that.",
            "I bought a full set recently that I used as cake topper for a rocket league themed cake and I paid about $12 for the set. That was fairly recently as well.",
            "I've never been this hurt...\n\n\nExcept when they took out trading.",
            "Came here to say this",
            "They took out trading?!",
            "All I have is crates",
            "I heard epic games dumped the market for it",
            "£10-30 on ebay, per car.",
            "Let me check with Terrance Howard for this math",
            "Got dam loch ness monstah!",
            "you rang?",
            "I gave em a dolla!",
            "Tree fiddy",
            "It’s all about the $oup and 0/6 cars. Not much else really matters. That said, I love to collect the fantasy castings. More Hyper Mites please!",
            "this is more in line with what I'd expect than the rest of the thread tbh. it'd be sweet if they were just $10 or so though",
            "This is likely less for the car and more for the chance at one of the item codes that come with it.",
            "Oh hey, that’s me! But I already have all of these plus the multipack. I imagine these will slowly increase in value as long as RL is a thing because they aren’t producing any more as far as I can tell.",
            "idk, i bought one at a dollarama for like $4 but i would def buy one off someone for more than that since you cant just get them anymore",
            "shit, really? I got the green one a few years ago, I'd throw $20 at getting a couple more for my desk",
            "They are\n\nhttps://preview.redd.it/dqs3k014j28d1.jpeg?width=1107&format=pjpg&auto=webp&s=b739808866feafaa0f99cf0f69fed3bf272aec33",
            "yeah they came out a few years ago, I've had the green one sitting on my desk for ages",
            "Ebay probably your best bet. Or other online auction sites. Amazon sells a couple of them but really expensive for what they are.",
            "Same lmaooooo",
            "You’ve obviously been affected.",
            "Throw in some painted toppers, and we got a deal.",
            "[deleted]",
            "Is that listings that have actually sold though? That's the key. Filter out all the ones currently listed and look at what's sold.",
            "https://preview.redd.it/w020nmdty18d1.png?width=632&format=png&auto=webp&s=a32e9f83ca5993b07d9a7aaeca6410ce7426dc33",
            "By the laws of common sense, I dare say the commenter's conclusions are questionable at most. Let us engage in a deep and very insecure philosophical conversation about history.",
            "There are more than a handful of fantasy castings I've kept. Nitro Doorslammer, Fast Fish, Fish'd n Chip'd, Twinduction, Yur so Fast, Velocita, Prototype H-24, 24/Ours, 24/Seven, Bread Box, Circle Trucker, Cool One (2004), 4x4 Scrambulance, Sahara Survivor... \n\nIt's not about whether it's a real car, it's that fact someone came up with a design that looks good in general.",
            "I will check thanks a lot !",
            "3 with me",
            "which is it? is it we or is it you?! the world may never know",
            "I'll have to check. I don't often use Ebay.",
            "Fr",
            "Mans forgor to delete😂"
        ]
    }
}