{
    "Official Q&A for Saturday, June 22, 2024": {
        "title": "Official Q&A for Saturday, June 22, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/running/comments/1dlmxrl/official_qa_for_saturday_june_22_2024/",
        "content": "With over 3,200,000 subscribers, there are a lot of posts that come in everyday that are often repeats of questions previously asked or covered in the FAQ.\n\nWith that in mind, this post can be a place for any questions (especially those that may not deserve their own thread). Hopefully this is successful and helps to lower clutter and repeating posts here.\n\nIf you are new to the sub or to running, [this Intro post](https://www.reddit.com/r/running/comments/wi4exx/new_to_running_or_the_sub_click) is a good resource.\n\n##As always don't forget to check the [FAQ](http://www.reddit.com/r/running/wiki/faq).  \n\n####And please take advantage of the search bar or Google's [subreddit limited search](https://www.google.com/search?q=url%3Areddit.com%2Fr%2Frunning+SEARCH+TERMS+HERE).\n\n_____\n\nWe're trying to take advantage of one of New Reddit's features, collections. It lets the mods group posts into Collections. We're giving it a try on posts that get good feedback that would be useful for future users. We've setup some common topic Collections and will add new posts to these as they arise as well as start new Collections as needed. Here's the link to the wiki with a list of the current Collections.\n\nhttps://www.reddit.com/r/running/wiki/faq/collections/\n\nPlease note, Collections only works for New Reddit and the Reddit mobile app for iOS.",
        "num_comments": 22,
        "comments": [
            "I just ran a 48:55 10k today after 12 weeks back properly training again. Was not terribly unfit beforehand and have previous running experience but had taken a few months off, so I was pretty rusty for my (22M) age.\n\nI am running the Melbourne half marathon in October which is exactly 16 weeks away. According to VDOT calc, the 10k time puts me at ~1:49 for a half. What's a reasonable goal to set for the half marathon if I start a 16 week plan now? \n\nBackground - I peaked at 75-80km a week in the past month but would probably start the half plan at 55-60 and slowly build up to 80 or 90km. I run 6 days a week, long run Sunday ~20k, 1 tempo/threshold, 1 intervals a week, all other days easy with Monday off. \n\nIs sub 1:40 in 16 weeks a realistic goal? Could I even do better, or is this too fast? Not too sure what I should be aiming for",
            "training for my third half marathon in the fall, in drastically different life circumstances than when i ran two in my twenties with a pb of 1:37. \n\n1. i’m now a mailman, and putting in around 100km of walking per week for work. it is mostly low exertion, zone one hr type baseline. is it worth logging any of this mileage in detail (beyond a daily step count)? i’m trying to go a little more structured and data driven this time around to train. \n2. given the daily mileage, which run of the week would you say is least important, as i want to aim for no more than 4 runs per week: tempo/near race pace runs, speed work and interval runs, easy plain runs, or day after long run recovery jogs?",
            "How is Huawei Health calculating the numbers, specifically VO2 max? The numbers seem to be way off on today's run, considering how out of shape I am (42m, 75 kg, 183 cm). It has been 9 months today since my last run. Does 75 meters of elevation difference really bring the VO2 max number up for that much?\n\nLast year's run data: distance: 5,17 km, pace: 5'42\", kcal: 377, average bpm: 176, 20 m elevation gain, VO2 max 36.  \nToday's run: distance: 5,48 km, pace: 6'14\", kcal 450, average bpm: 167, 75 m elevation gain, VO2 max 47.",
            "I find that on my tempo runs I have to work hard but I feel good, but that as soon as I move into the cooldown my body just wants to stop. I still do a km or two to wind down, but is this normal? Am I overdoing my tempo runs?",
            "Hi  \nI've been running properly for about 6 months, mostly targeting 5km.  My PB is 18:45 and I'm looking to get down to sub 18.  When I'm at the track doing intervals, I can fairly comfortably handle intervals at a pace of 3:10 or even 3:00 per km for up to 800m (sets are usually something like 500, 400, 300 x 4 or 800 x 6 or similar).  However, when I'm doing 5km, this pace totally eludes me - I'm starting at around 3:40 per km and then absolutely dying in the 5th km, going down to 4 min pace with HR closing in on 200.  What training should I be doing to improve this longer distance speed?  I'm finding my current position very frustrating!  \nThanks very much everyone!",
            "How far should my long run tomorrow be?\n\n  \nSo 4 weeks ago I did a Half Marathon (uphill in the heat) in a great time (1:40).\n\nI had quite a few niggles after so took 2 weeks off.\n\n2 weeks ago I did 3 x 10k races in a 2 day weekend - no problem and had fun.\n\nLast weekend I had Covid so couldnt do much.\n\nFor 2 weeks now I've been doing a 3 mile and a 5 mile run mid-week. Did a parkrun today too.\n\nI just realized my marathon training plan kicks off this weekend and demands 13 miles tomorrow. Am I going to injure myself doing that or should I still be ok from what I have been doing if I take it slow? I've thought about doing 10 mile instead of 13 but will be a bit behind the pace...",
            "I just went back to the gym, and would like to train 2-3 times a week a strength routine that is geared a bit towards runners, especially for injury prevention. Anyone knows a good programm or can point me towards an online coach who could help?",
            "I'm training for my second marathon in October and I've set my goal pace to 10min/mile. I ran 6 miles at that pace today and I would describe is as comfortably uncomfortable, mainly because of the heat and humidity. Accounting for the lower temps in fall, do I have room to make my goal pace slightly quicker? \n\nI feel like if I were to run this pace at 50F instead of 80 it would be very close to feeling easy. For reference my usual pace on easy runs falls somewhere around 10:50-11min/mile.",
            "Hi!\nI’ve spent entirely too much time reading about and researching shoes and would love some advice from your experience because there are so many options out there.\n\nI’m currently wearing Brooks Glycerin 21 as my daily trainer and want to incorporate an additional (perhaps lighter) trainer to my rotation so I’m not just running on the same shoes everyday. For some reference, Im female, run between 3-6 miles on most runs, run almost daily, and am currently in 8-10mi long run territory, training for a half marathon. \nI’m wondering for those of you who may also be running in Brooks Glycerin 21s, what other shoes you have in your rotation?! I have been to a few stores and that’s what initially led to my discovery of the Glycerin 21!\n\nI’m currently looking at other styles of Brooks (Ghosts) as well as Saucony (Triumphs) and would really love to hear what you’re running in (and why). \n\nI am looking at Saucony Endorphin Speed as a potential third shoe for speed work and races - not sure if these can stand up as a regular daily? \nThank you so so much!!",
            "What’s the consensus on wearing a brand new pair of shoes for a 10k? Yay or nay?",
            "Mile 1-2 sucks. Next run, I might try a more intense cardio warmup to see if it helps. Has anyone tried this, or is it just inevitable?",
            "Hi,   \nI,ve been training on road for a couple month's now. I am planning to do a marathon at the end of August. Everything has been going really wel up until now as I slowly up my km's every week. \n\nThe marathon I am planning to run is a trail run. So this week I made the transition to trail and boy what a different experience it was. \n\nI absolutely love it, but it wasn't going as good as I wanted to. I was planning to do a half marathon (thats about the distance where I am with my long runs) but I only got to 16km with about a minute slower per/km than my last run half marathon. I had 168m elevation and a lot of sand bits, so I guess it's normal, but still I was a bit disappointed and worried about my not so good performance. \n\nIt all just feels like a setback and now I fear I might not have enough time to be ready for the marathon. (in 12 weeks)\n\nAny tips? Should I only run trail from now to be best prepared? \n\nThanks!",
            "Every 3 weeks or so, you should up a VDOT. So if you have proper training for 16 weeks, you might catch up to a 1:40 half.",
            "Have you ever actually run a half before? If you haven't, 1:49 is a good goal to aim for.",
            "1. Yes, it's worth logging this mileage. Walking that much, on top of race training, is still time on feet. And time on feet is going to build fatigue even if it's not stimulating growth. The body has a limit, and knowing where that limit is is helpful to know so you can nudge it.\n2. You don't need to get rid of any of them, just don't do every one every week. One hard run, whether that be a tempo run OR an interval session, one easy run, one long run, one recovery run.",
            "Gotta build up the endurance to hold that speed for full distance. More volume, including longer long runs, is what you're looking for. I was doing 60-65mpw when I ran in the low 17s. Might also consider some bigger interval workouts that'll push you beyond 5k distance at 5k pace, like 6x1k or 1200.",
            "If you're going to have a 2 shoe rotation, I think it would be good to have one daily trainer type of you (your Brooks Glycerin 21) and one speed shoe. And I think Saucony Endorphin Speed would be a good choice for that.",
            "Unless you're running a time trial, why aren't you using miles 1-2 as your warmup? It takes at least 7 minutes for your body to wake up to the sudden demands you're putting on it, so run miles 1-2 really easy, zones 1 and 2 (in the 5 zone model).",
            "Yes, I did one 12 months ago (by myself not in a race) in 1:58, I have also ran 20-25km as my long run regularly in the last 12 weeks though this obviously at an easier pace. Would 1:49 not be too modest considering I theoretically should be able to run that at my current fitness?",
            "Interesting. What data do you think is most important to try track from the daily walking? My guess would be that i might identify through HR data if i’m overtrained. Speed and distance stuff is too variable and route dependent to draw many meaningful insights from, i would also think. My thinking was i would save watch battery by not running a 4-5h tracking session each day but i think you’re right, im treating the walking as a silent partner in my training as it is, it might be worth actually logging the detailed data from.",
            "Thank you, this is what I thought!",
            "Theoretically, yes. Under ideally perfect conditions and everything going right, you theoretically might be able to do it. Things like the VDOT calculator are guides, not gospel. It's telling you what you have the potential to do. Taking 10 minutes off your PB in a year and a half is quite a bit more than a modest PB."
        ]
    },
    "Denying it won't make it any cooler, it's time for the Summer, Heat, and Humidity Megathread": {
        "title": "Denying it won't make it any cooler, it's time for the Summer, Heat, and Humidity Megathread",
        "score": 393,
        "url": "https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/",
        "content": "As we are starting to see more posts about dealing with heat/summer, it's time to have our megathread on summer running.   Here are the links to past posts:\n\n* [It's Getting Hot In Here -- 2019 Heat Thread](https://www.reddit.com/r/running/comments/bwb72s/its_getting_hot_in_here_2019_heat_thread/?utm_source=reddit&utm_medium=usertext&utm_name=running&utm_content=t3_ddnm3v)\n\n* [It's that \"Awesome\" Time of Year for the Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/h9kyhs/its_that_awesome_time_of_year_for_the_summer_heat/)\n\n* [Unfortunately, \"That\" Time of Year has Rolled Around Again: Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/mmwpip/unfortunately_that_time_of_year_has_rolled_around/)\n\n* [You guessed it! Time for the Annual Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/uhlseh/you_guessed_it_time_for_the_annual_summer_heat/?sort=top)\n\n* [As much as I don't want to admit it, it's time for the Summer, Heat, and Humidity Megathread](https://www.reddit.com/r/running/comments/13k9fwh/as_much_as_i_dont_want_to_admit_it_its_time_for/)\n\n**[NOTE: If you happen to be in the Southern Hemisphere and entering the season of the cold, snow, and/or ice, [here's the link](https://www.reddit.com/r/running/wiki/weather#wiki_winter.2Fcold) to the \"Running in the Cold\" section of the wiki which links to the Cold megathread with tips and tricks.]**\n\nIt's a good time to get reacquainted with heat training, tips, tricks and adjustments you use to get through next couple months of misery, whether it's just for the next 2 months or 5 months.  However, the most important think is to recognize the signs of [heat exhaustion](https://www.cdc.gov/niosh/topics/heatstress/heatrelillness.html#exhaustion) and [heat stroke](https://www.cdc.gov/niosh/topics/heatstress/heatrelillness.html#stroke) and not to try to be tough.  If you're running alone and you push into heat exhaustion, you have to stop immediately before you hit heat stroke.\n\nSigns of heat exhaustion:\n\n* Confusion\n* Dizziness (good indictor no matter what, but more so when it's summer)\n* Fatigue (more so than usual)\n* Headache\n* Muscle/abdominal cramps\n* Nausea/vomiting\n* Pale skin\n* Profuse sweating\n* Rapid heartbeat\n\nHeat stroke is what heat exhaustion will turn into if you don't recognize it and stop immediately.  Signs of heat stroke are fairly similar but one notable difference is **that you have stopped sweating**.  Heat stroke is a serious medical condition and requires emergency treatment.  Call 911!\n\nSymptoms of heat stroke include:\n\n* Confusion, altered mental status, slurred speech\n* Loss of consciousness (coma)\n* Hot, dry skin or profuse sweating\n* Seizures\n* Very high body temperature\n* Fatal if treatment delayed\n\nRemember that SLOW DOWN is never the wrong answer in the heat.  You're going to go slower - it's just a fact.  Embrace it and the fitness will still be there when the weather cools off.\n\nSome quick high level tips:\n\n* Run slower (duh)\n* Don't run during the heat of the day\n* Run in shaded areas.   Running in direct sunlight in the summer can add 20+ degrees to your skin temp, and that's what counts, not the air temp.\n* Avoid highly urbanized areas if at all possible during hot days.  The concrete jungle retains and radiates heat back at you, it is almost essentially an oven effect.\n* Focus on humidity as much as the temperature.  Understand how the mechanism of sweat works.  If the humidity is extremely high, sweat will just drip off you and not evaporate.  Evaporation of sweat is the mechanism of how the body cools itself - the phase change from liquid to vapor extracts heat from your skin.\n\nAnother good tip from a helpful Runnitor:\n\n>Dew point is actually a better measure of humidity than humidity percentage points are. That's because air at 100% humidity and 50F holds less water than air at 50% humidity and 90F.\n\n> You can use a dew point calculator to figure out the dew point. Over 65F dew point is sticky, but over 70F is very humid. Make sure to hydrate often and to pay attention to your body to see if it's overheating.\n\n> Here's a good dew point calculator:\n\n> http://dpcalc.org/\n\nFinally, one good table for pace adjustment is here:  http://maximumperformancerunning.blogspot.com/2013/07/temperature-dew-point.html?m=1\n\n**As a way to keep things a bit more organized and easier to find info later, I'm going to make several top level comments.  Please respond to those instead of the main post.  All other top level comments will be removed without notice.  I'll include a stickied comment with direct links to each of the topic headings.**",
        "num_comments": 404,
        "comments": [
            "* [**GENERAL SUMMER COMPLAINTS**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95fx52/)\n\n* [**GENERAL QUESTIONS/COMMENTS**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95fyim/)\n\n* [**HOW HOT IS TOO HOT TO RUN**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95fziz/)\n\n* [**TIPS/TRICKS FOR RUNNING IN THE HEAT**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g0fe/)\n\n* [**HEAT ACCLIMATIZATION TIPS**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g1a6/)\n\n* [**RECOVERY FROM A HOT RUN**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g2g8/)\n\n* [**HYDRATION ADVICE, TIPS, TRICKS**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g4ha/)\n\n* [**MODIFYING TRAINING FOR THE HEAT**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g55h/)\n\n* [**GEAR FOR RUNNING IN THE HEAT/HUMIDITY**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g5y4/)\n\n* [**FAVORITE HANDHELD BOTTLE**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g6n1/)\n\n* [**FAVORITE HYDRATION PACK**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g7d6/)\n\n* [**FAVORITE ELECTROLYTE SUPPLEMENT**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g7xt/)\n\n* [**FAVORITE SUNSCREEN**](https://www.reddit.com/r/running/comments/1diqkc5/denying_it_wont_make_it_any_cooler_its_time_for/l95g8we/)",
            "**GENERAL SUMMER COMPLAINTS**",
            "**HYDRATION ADVICE, TIPS, TRICKS**",
            "**FAVORITE ELECTROLYTE SUPPLEMENT**",
            "**MODIFYING TRAINING FOR THE HEAT**",
            "**HOW HOT IS TOO HOT TO RUN**",
            "**FAVORITE SUNSCREEN**",
            "**TIPS/TRICKS FOR RUNNING IN THE HEAT**",
            "**RECOVERY FROM A HOT RUN**",
            "**FAVORITE HYDRATION PACK**",
            "**GENERAL QUESTIONS/COMMENTS**",
            "**HEAT ACCLIMATIZATION TIPS**",
            "**FAVORITE HANDHELD BOTTLE**",
            "**GEAR FOR RUNNING IN THE HEAT/HUMIDITY**",
            "[removed]",
            "[removed]",
            "Heat and humidity is the goddamn worst 🤬",
            "I wanna die",
            "Am I actually walking?",
            "I AM NOT HAVING A GOOD TIME",
            "Everybody gets so excited and romantic about the summer and I just get visions of suffering",
            "God I miss winter",
            "White clothing is a vicious cycle. Wear white because it’s hot then sweat so much all the white is stained with sweat",
            "It’s like trying to breathe through a wet sock.",
            "Why tf do I get headaches the second I step outside and it's 80+ F.",
            "My shoes become waterlogged with sweat and splash with every step.",
            "Can the sun not hate my skin so much?",
            "I am moving to the Southern Hemisphere to escape the heat like a migrating bird.",
            "Hooray, I'm in the top 1%.... for sweat rate. I hate it here. Please be October again.",
            "It has finally dawned on me why I’ve been so dang cranky and irritable and anxiety-ridden the last two or so weeks. Hello Summer Seasonal Affective Disorder my old friend.",
            "Here, we only have two seasons; Summer and Not Summer. I miss Not Summer.",
            "I’ve never once felt the heat of the sun on my body and thought ah yes, amazing. When will it be winter again.",
            "Is it fall yet? I’m already sick of this",
            "Why am I oiled up with Vaseline and still chafing in all my ladybits....oh....because its fucking florida and it's hot and I'm becoming a salt mine thats why.",
            "Kids are everywhere",
            "I hate waking up at 6 am just to run, it makes me wanna vomit 😭😭",
            "This is hell. I went out a little too late at 8 for a tempo run, I was STRUGGLING to hit my goal pace.",
            "I almost died doing a half marathon long run this last week. 95 degrees and no shade😃",
            "On the bright side, I got a new watch about a month ago, so I’ve hit back-to-back “New maximum heart rate!” achievements on my last two runs (running a very uninspiring pace, I might add)",
            "It’s only June and all of my summer running gear smells terrible already",
            "Going through a heat wave this week in southern Ontario…no central AC in my apartment. Everytime someone says “I bet it’s always cold in Canada” I  combust and cry in global warming.\n\nIt was already +35 today at 8am and why does it thunderstorm every hour? But it just gets hotter and muggier? Why do I suddenly live in Florida?",
            "Heat is one thing but heat & humidity..? I miss winter.",
            "It snowed last night. Yes, I'm in the northern hemisphere.",
            "On a beach vacation — and live in the high-desert at home — mother of god is humidity awful.",
            "My body is sticky, I don't like that.",
            "I hate hate hate running in this weather but having recently moved to Chicago it’s soooo nice just jumping in the lake when i’m done",
            "It's June and in Belgium it still feels like October, it's been raining non stop for 6 months, we only had like 5 days of sun in 2024... I wanna die too",
            "As a trail runner, most of my favorite trails are overgrown now and running on them just isn't possible.\n\nAnd yes, I do volunteer trail work with local groups a couple of times a month. But my favorite trails are the more remote ones without a lot of traffic and the maintenance crews just don't have time to deal with them. And I just don't have enough time to weed whack 5 miles of trail myself, especially considering it's a 5 mile hike to get to that 5 mile section of trail.\n\nSo I will wait until early winter to hit these trails again.",
            "It’s annoying how much water my body decides it needs to drink during my runs now 😭 I’m a big sweater so it’s necessary",
            "I live in Tokyo. Running at any time other than close to midnight is impossible for anyone who isn’t Japanese.",
            "Gentle reminder that it is not even summer, yet. Kill me.",
            "I hurt. Just pain. The sun rises at 0500 here in Taiwan. I am right on the Pacific. It hurts. I hate running, but I hate not running more. I'm consuming a lot more Pocari this summer. Also recently injured, so I think it might be time for morning cycling now.",
            "In such a slump bc I hate heat running. Haven’t run in a full week.",
            "I feel like I’m running in place for an hour 😭",
            "I hate summer so much..! SUPER hard to breathe when running",
            "It is 34°C without the humidex right now. \n\nAnd also raining incredibly hard. \n\nI have to run soon.",
            "I look like I’ve been swimming after I go run. My arms are literally just drenched.",
            "I can't wait for fall",
            "No complaints here. Am I the only one that loves the heat?",
            "cries in hyperhidrosis 😢",
            "Why am I out here?",
            "I’m built for cold weather and mountains but I live in  Central Texas",
            "I fucking hate running in summer. I’d rather have frosted over hands running in peak winter than feel the fatigue of a summer run. \n\nWhich is a shame because it’s the nicest time of the year to get out and about.",
            "Why the hell do I live in Florida? It's already 80 with humidity making it feel like 95 and I can't breathe and my sweat won't dry... ooh, look, a lizard",
            "I hate, truly hate waking up at 5 am, so I can get out the door for a run before it gets too hot. I'm retired, I'm supposed to sleep until I decide to get up!",
            "The weather is so changeable this year, you can walk out under heavy cloud having not seen the sun and end up with its full force on you. And hour later it's grey and overcast. \n\nHumidity is very high, so you basically feel too hot and too cold at the same time. \n\nBut I had a decent run today, I am building back up fairly well. Just wish my back was doing better.",
            "running on the treadmill is just not enjoyable at all but I’m zero motivated to run outside so I just can’t enjoy running anymore in this heat ",
            "Hydration is a before activity as much as during and after. I force myself to drink half a litre of water when I wake up to set myself up for the rest of the day.",
            "Currenly drinking 6-7L of water a day with electrolytes. Did a 7 mile long run at 113F and I held well.",
            "Not sure how many folks have this convenience - but in Asia where I’m running I typically carry a few coins with me to hit up vending machines during and after my runs to stay hydrated",
            "Hydration before and during an activity. This morning I forced myself to stop and take a few sips of water at every mile and it helped significantly.",
            "Lemon lime Salt Stick tabs are my favorite. Does that count?",
            "Nuun has been excellent for me, and it's cheap",
            "Liquid iv since it’s cheaper at Costco and doesn’t taste terrible",
            "Gatorade Endurance powder passes my nutrition label scan and is cheaper than other supplements on Amazon",
            "lmnt is the winner for me when it’s hot",
            "I've always been on Tailwind.  Reasonably cheap ($0.75/8-12oz mixed volume at full price), mixes well in my bottles, tastes good to me, pretty heavy on carbs with a decent amount of salt per scoop.",
            "I like Nuun. It's also what they will use in the Toronto Waterfront Marathon his fall which is good for me!",
            "Skratch, no gross sweeteners (just sugar), real fruit.",
            "Peach Salt Stick for sure",
            "I’ve been enjoying the packets of Pedialyte. Somewhat fewer artificial ingredients",
            "I use LMNT, as well as Precision Hydration PH1500 tabs. Both seem to work really well. Did a fast 13 miler on Saturday in the heat (90F/32.2C) and didn't have any issues. Plenty of gas left in the tank at the end of the run.",
            "1/4 teaspoon salt and a healthy dose of lime juice into a 1L Nalgene. I’ll throw in some coconut water if I got it.",
            "Beer",
            "Lime juice, pinch of salt for sodium, pinch of Nu-Salt for potassium, and a couple tablespoons of sugar in a liter of water.",
            "I have the best luck with something that contains some sugar, so something liquid iv (or the Walmart/Target generic version for cheap) or Drip Drop have worked well for me. ",
            "Drip drop!",
            "Kinderlyte Advanced from Amazon. Also like LMNT, which is a little pricy but you can always find influencer codes. Just tried Mortal Hydration and really liked it as well. You can only get it from thefeed.com but if you use Strava you can do their challenge to get a $15 store credit every 3 months.",
            "Electrolyte replacement drinks and powders all make me want to hurl to varying degrees but I found that Gu roctane ultra endurance electrolyte capsules are maybe helpful. No taste! I take one with water before and or after running depending on effort, predicted sweatiness level, and if I remember or not. Barring that, I just eat salt.",
            "Switchback electrolytes",
            "SIS Hydro tablets. I take one in a pint of water after every run regardless. It's a great way of replenishing electrolytes.",
            "BPN electrolytes. Better tasting, mix well, less sodium.",
            "I like the Nuun ones",
            "I like pickle juice during a run but I’ve just recently tried lmnt after a run-pretty good!",
            "Upika. The best tasting endurance fuel/electrolyte I've tasted. Better than Nuun, Tailwind, etc",
            "Blue Powerade",
            "As a HS XC coach here is my speech:\n\n\n>Everything we do this week is zone 5 because your body hates the heat. Show up hydrated and no one is allowed to walk home afterwards, so get a ride. If you aren’t here, I will never ever hold it against you because I promise you that I don’t want to be running with you but I will anyway.  ",
            "I am able to change my schedule a bit so I will be doing morning runs before work, it's annoying but doable.\n\nRegardless, I have decided to invest more time indoors doing strength training instead so hopefully I will come out in October in my best shape ever!",
            "Yesterday I went out for a warmup run in the morning, and it was cloudy, warm, and a bit humid when I left. Everything was fine until the clouds parted and the temperature jumped by around 5-6 degrees (at least). Things went pretty quickly from fine to hard, and it didn't help that this coincided with a long climb portion of the loop. It was a good reminder from my desert days that the sun makes a big difference.\n\nSlowed things right down at that point and was able to keep things manageable for the rest of the warmup at least. I've learned over the years (the hard way) to modify my workouts based on various changing conditions and how I'm feeling at that moment.\n\nAs the heat/humidity increases, I'll be increasing the ratio of walking sessions (ideally in shaded areas) over running. Trying to keep the time-on-feet consistent especially if cardio is a bit tougher right now.",
            "I don't know if this is considered \"modified training\" but Florida summers are brutal. My goal is to simply *stay at level* during the summer. I'm not trying to get faster at all, I just want to stay consistent (i.e. don't slow down). Because you're having to work harder to stay consistent, you actually are making gains, though it doesn't seem like it until the weather cools and you start getting faster. \n\nWinter gains are made in the summer.",
            "I had a bad time with heat stroke after one run a few years ago which led me to completely change my strategy for running in summer time. I don't run during the day during summer, even if it's just a quick 5km to get the muscles loose.\n\nNot worth the risk. I'm a morning person anyway, and I'll run in the mornings in winter too if I plan to do something long enough that it won't comfortably fit into my lunch break. But summer daytime running is a no-no from me.\n\nAdvice on hydration, electrolytes and all that still apply, it's not a replacement for drinking enough.",
            "Florida",
            "Summer of 2017 in Phoenix it hit 121. I did a short 2 mile run for the novelty. That was too hot for running.",
            "A dew point of 70+",
            "I don't even know anymore. I'm in Bangkok and since Feb, I have been running in 30°C+ (86°F+)  temps, 65%-85% humidity and dew points ranging between 24°C and 26°C (75°F and 79°F).\n\nLast night was one of the better nights weather-wise: 29°C/84°F, 83% humidity and 26°C/79°F dew point. My shoes were still extremely damp.\n\nI was in Vienna in early May and my pace was automatically 10% faster and even managed to run 20% farther than usual.\n\nHere's hoping I can run significantly faster again when I run my HM in France in Oct!",
            "Atlanta. Hot, hills and humidity",
            "There isn't as long as you run when the sun isn't pounding on the pavement.  It's frequently 70 80 degree dew points in South China, and I used to run every night.  You come back looking like you took a dip in the pond, but it's easily doable with proper hydration",
            " No such thing as too hot to run, as long as you’re preparing and adjusting pace and length. \n\nAs a midwesterner, when we get heat domes and the humidity is boiling you alive I’ll spend all day pre-hydrating for a 30-40m easy run that leaves me soaked.",
            "I know someone who uses an exercise bike in a sauna",
            "With the dew point hovering between 75-80 for the next 3 months, 90 is just about my limit",
            "If the real feel is 110 or over 😂.  (Yes, I am a reptile.)",
            "Did my run in yesterday’s 95 degree heat after work.  Hydrated really well all day.  It went fine.  I would definitely stop if I started to show signs of heat exhaustion…happened to me last year when I didn’t hydrate enough.",
            "Obvious choice, Neutrogena. That said, I will slop budget sunscreen all over me when the UV is high. Melanoma is a killer.\n\nEdit: Lip balm deserves a mention too. The orange Nivea with the SPF 30 rating has a permanent home in my Salomon.",
            "Anthelios by La Roche Posay. I've used it for the past several years and it works great. SPF 60 face is my favorite. \n\nI also use Blue Lizard Sport SPF 30 on my arms and legs.",
            "Coppertone Water Babies. Highly rated by consumer reports, stays on well through exercise/wet conditions, and doesn't sting the eyes when you sweat.",
            "Echoing some other commenters re: Korean brands for sunscreen, especially for the face. I always begrudgingly wore sunscreen because I hated the texture, even highly recommended brands like La Roche Posay and Supergoop etc., but having a formula that I really like makes it so I never skip it. \n\nMy favorite is Isntree Watery Sun Gel 50++, but Beauty of Joseon and Cosrx Aloe are great too.",
            "Supergoop Play for any outdoor activites! I have sensitive skin and it hasn't broken me out.",
            "For your face: Supergoop unseen (or the matte mineral one). It’s the lightest, least greasy, least runny liquid eyeball burning sunscreen I’ve ever used. I’ve never had anything else with a similar texture. Second place: Elta MD. So far these two are the lowest acne breakout inducing options I’ve tried and yall, I have a whole closet shelf solely for sunscreens.",
            "Got a lot that I like, these are what I use for running because they don't really run or burn my eyes. \n\n1. The cheapest store-brand waterproof SPF50+ sunscreen at the store for body. \n\n2. Banana Boat Light as Air - good for body too, less greasy than the cheaper banana boat variants. \n\n3. Biore UV Athlizm Skin Protect Milk - light white cast, but doesn't budge.\n\n4. Trader Joe's Knock off of Supergoop unseen - don't love the texture, but stays put while I'm sweating. \n\n5. Not sure how waterproof it really is, but Biore UV aqua rich watery essence is my fave everyday sunscreen.",
            "I recently started using Banana Boat Daily Protect Factor 50 and I really like it. Doesn't leave a greasy feeling on my skin. \n\nNow I just need to find a face sunscreen that doesn't make me break out in horrendous spots",
            "Blue lizard sport SPF 30 as my daily driver.",
            "Sunscreen sticks have been a lifesaver this year. Easy to apply and small enough to throw in a pocket or running vest. I’m a Korean sunscreen kind of girl and have tried the “beauty of joseon” and “elizavecca milky piggy great block”. The joseon one feels less greasy than the piggy one, but the piggy one feels like a better value for the amount of sunblock you get. For non-stick-form sunscreen I regularly use the “derma b everyday sun block” and don’t get burned.",
            "Beauty of Joseon for the face and supergoop play for the body",
            "I brought home the Biore UV aqua rich sunscreen from a trip to Japan a few months ago and it’s become my favorite running sunscreen since. I’ve been enjoying a nature republic sunscreen stick too",
            "Looking for a good recommendation here, and ideally one that is a mineral sunscreen and isn't an aerosol. So far haven't found one that isn't heavy and unpleasant.",
            "Aveeno protect & hydrate 60 SPF. Convenient pump bottle, can buy a good size off Amazon. Smells better than other sunscreen too.",
            "Don't forget about your lips! Sun bum MINERAL lip balm is the only acceptable answer",
            "Whichever one has a spf of 50 and isn’t so expensive I don’t mind reapplying every 90 min",
            "No sunscreen.  I often run early morning or in the evening.  Don’t need the chemicals.",
            "It’s ok to carry a water bottle or hydration pack, don’t let anyone tell you otherwise",
            "Find the lawn sprinklers in your area and learn the times they go off. Time your runs to be able to run through them.\n\nGetting hair wet before a hot day has been a lifesaver for me, too. I'll dunk my head into water then put up into a braid.",
            "Less water, more hydration drinks.\n\nAs a South African we have the heat for almost 90 months of the year and I started running in an area which would hit 30 celsius with 20% humidity in the winter. Having run during the heat many a time, here are some key things.\n\nLight clothing, no bare chest : clothing soaks up sweat and keeps you cool. It also provides UV protection. Alot of people want the sunshine in the summer but you increase your heat absorption alot when your skin is exposed.\n\nShades: yes, you need to look cool but also protect your eyes from the glare and reflections.\n\nHydration: see opening statement. Water loss is a problem but you will going into the danger zone much quicker losing Sodium and potassium. Having good, proper sportsdrinks is essential to keep electrolytes in balance. \n\nAlso, beware of over hydrating. The key is simple. Are you thirsty? Sip some water. Are you still thirsty? Yes = Take a break, no= still good\n\nWe just had the comrades marathon and one big problem they see every year is runners fallimg out due to OVERhydrating. You know what you need, don't increase the volume of each sip, increase the frequency with which you sip.\n\nAlso, if you are at altitude, you will feel it alot worse. On the hottest days, you will feel like there is no air. If that is the case, wait for it to cooldown. I live pretty high and on the 35+ days you can feel it is just not going to be a good one.\n\nLastly, make sure you wear seamless or soft seam clothes, as the seams get soaked and they ride your skin which is not nice.",
            "Early morning runs or late evening runs. \n\nWhere it's safe to do so, 2-3 a.m. runs can be fantastic.",
            "I take the dollar store sponges (not the one with the hard green side) and slice them lengthwise super thin. I soak them in ice water and put them under my hat. If you run in loops you can swap them out as you loop. \n\nI do this for the run portion of my triathlons too and it works miracles! At every aid station I dump water on my head to keep the sponge wet.",
            "5:00am runs. The only way from July to Sept.",
            "If you use a hydration vest with a bladder, put ice cubes in the bladder. Cold water feels more refreshing. Also you can put one of those flat reusable freezer packs in the vest to help keep your back from feeling like it’s slow roasting.",
            "Modify routes to maximize shade",
            "Small loop with water at your car if you don't have access to a water fountain.",
            "Running at dawn or just before, it's cool from the night but light enough to be seen.",
            "[\"Get inside and onto a treadmill, ya dingus!\"](https://m.media-amazon.com/images/S/pv-target-images/7d4b5c2b90b079e6aca584e6313f92125cf69fd0b48add7be6dcb91475c85a6b.jpg)",
            "I've been using a frog tog cooling towel on all my runs and it has been helping immensely to keep me cool and keep the heart rate down. I soak it with cold water and wear it like a scarf.",
            "I tried for a few days to run with a light shirt on or singlets, but they get drenched in sweat, so I've given up on that and have been going shirtless.\n\nHave read some things that say going shirtless might be worse. Any insight on that?",
            "Vaseline in the eyebrows to prevent sweat in your eyes- won’t last forever put staves off the inevitable for a few miles ",
            "Stuck my water bottle in the freezer 45 mins before my run today. It cooled my back nicely through my hydration vest. Felt nice!",
            "I like to map out where water sources are along my run (water fountains, libraries, etc) so I don't have to carry much at all. I've got nothing against those who choose to carry water, it just my preference is to not. \n\nThe occasional splash pad is a nice break as well. \n\nI also always wear a light colored hat and sunscreen.",
            "I don’t usually carry water.  I do know where the water is, whether a fountain at a park, or back at my car.  I might cache water.\n\nFor longer runs, I often have one bottle 50/50 ice and water and one all ice in the car. If weather is as expected the 50/50 one is cool and has a little ice left.  If not, the pure ice one will be cool.",
            "Fill up your water/electrolyte bottles halfway and freeze overnight.  Top them off right before your run, and it is still cold around mile 9.  Plus the frozen liquid feels good against your back.",
            "http://maximumperformancerunning.blogspot.com/2013/07/temperature-dew-point.html?m=1",
            "I bought a head mounted libat miners light so that I can run either right at sundown or after the sun goes down. I am lucky to run on a private road or dedicated pedestrian walkway. Makes summer/heat running so much better.",
            "Thread that I started last year with a lot of helpful responses and interesting discussion: https://www.reddit.com/r/AdvancedRunning/comments/14ki6ev/humidity_and_warm_temps_are_crushing_me_any_advice/",
            "Just don't. Run at 4AM or inside on treadmill with AC, Vornado blasting and a spray bottle with ice water.",
            "Lay on the cold garage floor and drink cold electrolytes until I feel able to deal with life again.  Eat something easy on the stomach like bananas or applesauce, then a small peanut butter sandwich.\n\nIf no garage floor, a shaded lawn (freshly sprinklered if possible) is also a delight.",
            "Not sure if this is scientifically proven, but after doing my cooldown stretches and before I shower I like to have fruit ice pops. Very refreshing and something to motivate you through the last few KMs",
            "Cold drinks and cold shower",
            "My local ice cream shop starts making my small vanilla milkshake as soon as I pull into the parking lot. ",
            "Cold showers until you shiver or ice packs on your neck after you run. It helps bring your temp down and avoid heat stroke after hard hot efforts. It will also assist with sleep if you run later in the day. Frozen damp towels also work on the neck or face if a icepack is too intense or you don't have any handy.",
            "Cold water baths. Just turn on the tub full cold and get in. No ice needed.",
            "Cold beer?",
            "Pedialyte freezies are amazing after a hot run!",
            "Vodka Gatorlyte",
            "Am I the only one who absolutely loves to rinse off with a piping hot shower after an extremely hot sweaty run? After I get out and towel off then I guzzle a liter+ of an iced sports drink or soda, but rinsing off with hot water when I'm already roasting leaves me feeling so so so nice. Don't understand how people think a cold shower is better.",
            "I will still sing my praises for my saloman adv skin. The fit is incredible and works with just the front or back baldder.",
            "Osprey Duro 1.5L",
            "Nathan quickstart 2.0 4L hydration pack! Fits perfectly and no chafing even with just a crop sports bra underneath",
            "Nathan VaporAir has my top vote, but my CamelBak octane dart is a great option for fewer pockets and smaller volume.",
            "Black Diamond Distance has been A+ by my standards. Very comfy.",
            "I’m looking to get my first pack, it’s summer  90% of the year here in Northern Australia. So looking for recommendations on breathable packs. Specifically looking at the Nathan Vapor Airess lite or Salomon pulse as they look to be very breathable, but open to any suggestions. I think I prefer the bladder on the back to bottles in the front.",
            "I started running last fall and run 10 min miles. In the the fall and spring, my heart rate was ~140. Now it is 160 even when I run a minute or two slower. What do I do? Run even slower? (I’m 6’6/220lb)",
            "EMBRACE THE HEAT!\n\nThis is not \"get good mile times\" season, this is \"sweat a ton / keep that water weight low / if sweating actually gets bad stuff out, we're getting bad stuff out\" season. Embrace it. Learn to love it. Make your body long for winter to come once more so you'll appreciate it all the more.",
            "Previous years I have resorted to run/walk during the summer and just gave up any hope of any real running.  I can't say that I made any progress at all training wise or fitness wise.  This year I am trying 3 runs a week + 2 lifting sessions at the gym.  One of the runs is a speed session at the gym.  Another is a regular easy run at the gym (4.5 miles yesterday) and the third we are going to try to do a long run starting super early in the morning when the humidity is a billion percent but the heat isn't there.  We will see if this yields better results.",
            "This seems early for an uncomplaint (I'll probably re-use it on Thursday), but I like that I run in a lesser-used park. Nobody yelling \"PUT A SHIRT ON!\" at me. Because when it's 74 in the morning, I'm running without my shirt!",
            "I’m considering a 40k for my 40th birthday in 2025. Unfortunately my birthday is in October, the hottest time of the year where I live. Even if I do a marathon in a cooler area I still have to train from July to September, which is really making me not want to do it. I’ve done a bunch of half marathons and the ones in August were miserable. I don’t want to hate running. Is this a terrible idea? Should I forget it and do something else to commemorate aging?",
            "Come to the UK, no high temperatures here this year. All times of day are enjoyable with the caveat of it fucking raining so much this year.",
            "I love San Diego….",
            "I'm celebrating the arrival of what's expected to be one of the worst summers on record where I live with a return to running after almost 12 weeks off with a stress fracture. I dread the summer slowdown enough as it is. This one's probably gonna be a shot straight to the ego.",
            "Thanks for this post and all the dew point/pace adjustment information. I knew the summers where I live were uncomfortable but I didn’t realize how extreme it was or how it’s typical to impact running efforts. It’s nice to know my usual slow-downs are normal!",
            "Does running in the heat help you when running in normal temperatures (ie 60-70 degrees)?",
            "Where my freezing Southern Hemisphere homies at",
            "Try not to think too much about it — at least in my experience, the hot runs NEVER get easier.. but the fitness (“heat doping”) is sooooo real and it’ll all be worth it!",
            "Consider moving somewhere else.",
            "Drink a lot of water and run in areas where if you begin to get heat stroke you can go in and relax and ask for water (ie, mcdonalds).\n\nCities usually have maps of all their water fountains throughout the city as well\n\nRun in the mornings\n\nI don't acclimatize to heat the same way I do to the winter and am sure this is the same for a lot of other runners. The best solution is to be prepared and that's it",
            "After a run outside, instead of running inside to the A/C I will try to spend 5-10 minutes in my garage or a shaded part of my lawn while I drink some water. I find it helps my body get used to the heat.",
            "Take a walk in the sun during the hottest time of the day and stand in the sun for a few minutes. Do this a couple of days and suddenly you will start feeling it less and less.",
            "Nathan QuickSqueeze. \n\nAnd someone needs to hear this- meticulously clean the inside of the bottle. Then take a light, shine it in there, and take a good, long look around to verify it is indeed clean. \n\nI thought I was cleaning mine well. Oh…the horror… ",
            "nathan soft flask (14oz)",
            "Nathan speeddraw",
            "I’m a big fan of Orange Mud’s soft flask. The covering is a bit thick but I got used to it quick. Feels great in my hand and no sloshing with the soft flask.\n\nhttps://www.orangemud.com/products/soft-flask-handheld",
            "White or other light colored running hats. You can dampen them and freeze them for some early run assistance to keep you cool.",
            "Don't know if this applies, but Body Glide is a lifesaver for those of who chafe. \n\nAlso if you're a guy, may need the band aids for nips. YMMV.",
            "I live in Georgia and it’s hot! I need a new hydration belt, but I’m struggling to find one with a good fit. I’m a petite women. 5’1 and about 130lbs. I’ve gone to my local REÍ store, but they didn’t have any in my size. I’ve tried the Salmon brand, but I’m hesitant to spend the money. Any brand recommendations? I don’t want anything that bounces when I run.",
            "I find that a loose fitting light coloured shirt helps more with keeping me cool than going shirtless when the sun is beating down on me. If running shirts are hard to find, I've found that fishing shirts do a pretty good job with this as well.",
            "When I lost 42 lbs, I found that I had much more tolerance for running in the heat.",
            "I'm already fully embracing running shirtless. In some ways I hate to be \"that guy\" wearing 2\" running shorts and shirtless in my neighborhood, but I do it at sunrise so not too many people are out and about. When it's 70 degrees with high humidity it's the best I can do.",
            "The Patagonia Capilene Cool Lightweight shirts have been solid. As the name suggests, they are super lightweight. \n\nBit pricey but they’re worth it.",
            "adizero 5\" split shorts have been great, super light and breathable.  Of course no shirt to go with it.",
            "Janji 3” afo middle shorts!! Lightweight and a nice back phone pocket with no bounce",
            "As a heavy sweater I do this regardless of season but Transpore tape for the nips eliminates chafing and is cheaper than dedicated nip products.  I bought a multipack years ago and it'll likely last me a decade.",
            "Fellas, what temperature is warm enough for you to run shirtless in summer? Was chatting about this with some buds recently and there was a bit of disagreement. (Personally, 65 and sunny is enough for me to lose the top)",
            "Anyone have recommendations for Phase Change Material and evaportative cooling products?",
            "Just started wearing rei cool max liner socks for my running socks this week and they keep my feet feeling good.",
            "Nike aeroswift 2” shorts have been amazing",
            "[removed]",
            "I like to think this is the official Blackhawks Reddit account",
            "\"Man, I really feel like I'm working hard!\" \n\n\"Your pace is 9:00/km, and your HR is 190\" - my watch",
            "So true!!!",
            "I finished my run this morning and I was exhausted and I said to myself, “this is so unpleasant” as I’m drenched in sweat.",
            "Fortunately I live in the UK which so far this summer has simply meant warmer rain.",
            "Im conflicted. On one hand I hate having to plan my runs around snow and ice (Colorado). On the other hand the running itself is so much easier than long sessions in summer heat.",
            "Strong disagree. Winter in the northeast often means 0F temperatures and snow and ice, which can lead to injury. It's also a chore just bundling up and speedwork is impossible when it's too cold.\n\nAt least in the summer you can run in the early morning and avoid the hottest parts of the day. Your pace will be slower, but your heart will be getting more of a workout with less muscle strain.",
            "I undress in the shower when I run or play soccer in the summer. That initial rinse goes a long way. Also great for hats if you're a serial sweat stain hat ruiner like myself.",
            "Oxiclean FTW",
            "POTS?\nMaybe not enough hydration",
            "you need sweatbands on your ankles.",
            "As someone in the Southern Hemisphere who is currently running at lunch time because that's when it's warm enough, this thread is a welcome chuckle.",
            "I yearn for the freezing temperatures to crystallize the sweat to my body. I'm a regular Jack Frost type.\n\nBut also, it's nice not having to thaw myself out for a change.",
            "It could be worse. \n\nI have 1) Summer and 2) a slightly less hot summer. #MiddleEast #Running",
            "I was running at 6 today and it was already 80 degrees, fml",
            "Yep it felt like 43 today and I worked outside all day. Definitely no running this week lol",
            "I’m both looking forward to a beach trip, but also dreading running during it. Home is already hot/humid but the beach is somehow even worse.",
            "ATL is nowhere near the ocean, and it’s 85% humidity. Not sure how Houston or New Orleans runners do it.",
            "This is me right now too. “It’ll be great running at sea level instead of a mile up!” they said. “So much more oxygen!” they said. 🥵🥵🥵",
            "You'll want to die more when you'll be in your long run and the summer heat kicks in. Trust me.",
            "Agree on the 500ml of water when you get up. I thought my wife was crazy when she told me to do this, but it stopped me getting a headache after early morning exercise.",
            "More of a before activity than anything in my opinion. If you're not well hydrated when you start there is no way to recover that on the run.",
            "Yes! If I know I have a hard run, long run, or race coming up, I make sure to work on my hydration a day or so BEFORE the day of the run (the bigger & hotter the race, the earlier I start). If you're already at a deficit, it's much harder to 'catch up' the day of (at least for me). And being mega-hydrated helps stave off the inevitable heat headache afterward. \n\n(I live in FL)",
            "How do you do this and not have the urge to pee during a long run?",
            "these are great, lemon lime are the only flavor that doesn’t taste like sunscreen. that tropical or whatever i can smell when other people are using them",
            "My Costco only carries the sugar free one now and I can't stand the taste.",
            "What’s with the white clumpy stuff at the bottom or Gatorade endurance? It’s difficult to get it to dissolve",
            "Just looked it up, 1000mg sodium?? I'm a heavy sweater, may have to try that.  I normally use nuun or gatorlyte which is 500mg",
            "I tried their watermelon salt flavor and loved it!!",
            "I love their new sparkling waters. Even more than the powder.",
            "My last race had Nuun too. I found that at the end of the race I had a weird pressure in my chest. Pretty painful and definitely worrying. No other issues; I attribute it to the fizziness of the nuun after drinking it for hours straight. YMMV but heads up!\n\nAlso tragically nuun is owned by Nestle.",
            "Same. All those sugar substitutes make me sick.",
            "Amen.  So tasty. I chew one and suck on the second one, as a treat 😂",
            "Why am I training for a marathon rn please help",
            "Seriously! Especially after the past few weeks without any rain until recently. I think that was the driest heat I’ve felt here in a while.",
            "Yup.. I just got back into running... 98f 90% humidity has me drenched in 4 minutes",
            "Sounds dangerous. How did you feel after two miles?",
            "I can do a dew point of 70+ as long as it's early morning.",
            "Lol the dew point here in south florida is over 70 all day every day",
            "I'm in Canada over here, and we're seeing temps of 30-32C with 56% humidity. \"Feels like 42C\" and I feel like I'm suffocating just walking around. I couldn't imagine running in this weather, I'd collapse and die.\n\nNow, get me in the cold, I'll run until my breath freezes in my nose. But heat is no bueno, dunno how you guy do it.",
            "The woes of living in SEA. Have been training in the PH with crazy temps and humidity. Will be running a half also in October in Europe, and I do hope I'll perform better with the more pleasant weather.",
            "Similar to the temps where I’m from (nearby in Asia) in the summer. I think your body does get used to it; or maybe I’m naturally more heat resistant? It’s not always pleasant but not impossible.",
            "A little bit away from you over in Taiwan... Travelled for work to Scotland last August and it was absolutely refreshing to experience running in what felt like winter temperatures to me. Confused my brain into thinking Lunar New Year was coming, but hit a single kilometre PR running around Glasgow one morning. I may consider transporting myself there permanently....",
            "Me IRL 😢",
            "Sun bum had an SPF 30 lip balm that also has a more mild coconut-like flavor than some other SPF balms I've tried. There's also Jack black SPF 25 lip balm that has additional flavors that aren't bad but they come in squeeze tubes but the formula is thick so it doesn't seem to run out of the tube. It's funny to think about scents and tastes for sun protection but SPF does have a bitter aftertaste that I hate and our lips definitely do need the sun protection too.",
            "Neutrogena hydroboost is the best feeling sunscreen I have ever used and my skin loved it, but if any amount gets into my eyes it's like hell on earth (all Neutrogena chemical sunscreens do this to me). It makes me so sad, but I absolutely cannot use Neutrogena if I'm going to sweat =( \n\nBut yeah, skin cancer sucks, slop on all the sunscreen.",
            "The La Roche Posay face sunscreen is my HG. It's soooo good. I also like Blue Lizard for my body.\n\n  \nI've recently started to like the Neutrogena Beach Defense lotion because it's in a pump bottle",
            "Laroche posay is the absolute best",
            "I use the LRP SPF 50 ultra fluid. The reviews on their website complain that the SPF 60 lotion pills like crazy. Have you experienced this?",
            "Also if you're in America import the good Anthelios. I like using Cocooncenter",
            "I am pale as a ghost and I barely even have tan lines by the end of summer because of Supergoop.  Cannot recommend it enough.",
            "Supergoop play is my go to. I buy the 18 oz. bottles, which makes it reasonably priced.",
            "Supergoop makes me break out so bad 😢 ",
            "Blue Lizard. It’s a mineral sunscreen so thicker than other sunscreens but it doesn’t feel heavy to me",
            "Sun Bum sunscreen oil. Comes in SPF 30 and 50, lightweight, forget I’m wearing it, and delightful scent. I’m a fair skinned sunscreen enthusiast and sun bum is the winner for pretty much any type",
            "You do",
            "This, 100%. I BQ'd carrying a water bottle belt with 4 10 ouncers. Do what you need to.",
            "Who is telling people otherwise?!",
            "Yep, trail running vest always comes on when it gets too hot for runs at home\n\nI could trail run more in the cooler mountains but you know, effort",
            "I've started 5k training recently and I bought a water bottle specifically for it. I moved to a state with high humidity and hot summers, no way I'm not running without one (I've gotten heat exhaustion before, too, not really keen on a repeat)",
            "Ever since I saw my neighbor install some herbicide feeding system to his sprinklers, I'm very hesitant to run through sprinklers.",
            "I like to dip my bandana in ice cold water and wring it out about halfway right before I set off for my run. Keep my head cool for a good portion of the run!",
            "I saw a little kid watering her front lawn yesterday and she waved at me as I was approaching. I yelled “Spray me!” And she did and it was the best thing ever. She got a kick out of it too.",
            "I’m going to try that tomorrow.",
            "What are some sports drinks to look for?",
            "> you increase your heat absorption alot when your skin is exposed\n\nMy skin is so pasty white it reflects all known radiation.",
            ">Early morning runs or late evening runs. \n\nCool cool. \n\n>2-3 a.m. \n\n\n😳",
            "I start marathon training in August, and always run before work. Let’s hope the 2-3am runs are as nice as you say 😂",
            "When training for a long mountain run back in 2021, I found that I was absolutely exhausted after coming home from work and thus my runs were total slogs that weren’t improving my fitness much. By accident at first (I’d crash on the couch after getting home and wake up with my run still to do), I started segmented sleeping with training between my sleeps.\n\nI would come home from work, have a snack/light meal, then nap for anywhere from 2-4 hours. I’d wake up refreshed, go for a run anywhere from 10 PM to as late as 2 AM, and eat another small meal before going back to sleep for another few hours before work.\n\nI was living in DC at the time, and running late at night on the National Mall, through the monuments and memorials, and along the Potomac was so peaceful. I’m a young, white male, so safety was not as much of a concern as it might’ve been for some others.\n\nI don’t know if it would be sustainable over a longer term, but it made my training so much more manageable. Some of my best running memories come from those long runs through DC in the middle of the night.",
            "Gotta be careful about early morning runs when it's humid. Your body can overheat if the relative humidity gets much above 80-85% even if it's 75 degrees.",
            "I ran a route this morning trying to hug tree cover. I may have looked like a crazy person but it was hot out!",
            "My mom sets up little caches of frozen bottles along her route via car or bike so she can switch out empties and have ice cold water.",
            "I'm lucky to have access to a great local park with a 1-mile loop that passes a parking lot. I have a cooler full of water bottles that are icy cold. The last .2 miles of the loop are unshaded on bright concrete that reflect heat back up on me, so I am so ready for water by the time I get back to the car!",
            "Frog togs are a lifesaver. The flopping around is a bit annoying, but the relief they provide is worth it. Bonus points for being able to use it as a sweat towel instead of my shirt.",
            "As long as you're not running at peak UV times, I find shirtless heaps better. Cooling effect with sweat on your body being exposed to the breeze (if there is one).",
            "I am trying this tomorrow!  Sweat rolls off my head and into my eyes makes them burn and blur.  You may have just changed me life.",
            "Cold basement",
            "There's nothing I crave more when I'm hot and sweaty after summer exercise than cold fruity stuff. Juice, watermelon, freeze, it's all great.",
            "Yup! I buy big bags of the real-fruit ice pops. The goat post run snack.",
            "sbiver",
            "I've taken to just putting an ice pack in my shorts band at my lower back immediately after a run – I find that helps me cool off in about half the time. It may not be hi-tech, my wife may be grossed out by it, but by god does it work!",
            "I'm with you.   Most of the way.  I get in a hot shower then do a cool, not cold, water rinse.  Then, I have cold water and a hot cup of coffee.  Oh yes!  Feels amazing!!  Then on to breakfast \\~  \n\nIt's hot, here too.  Today the dew point was 75.  Temp 77 RH was 94.  It was a scorcher at 8 am.",
            "I mostly ignore HR June-August and try to look at how I'm recovering instead.\n\nIf my \"easy\" days have me feeling good for my \"hard\" days then I'm not so worried if I was in Z3 for most of the run - that had more to do with the heat and my hydration than my effort on the run.  If I feel too worn down to execute workouts then I know I need to back off the effort/duration to give myself more recovery.",
            "If you are running by HR, then you need to expect it to be a bit higher and give yourself some latitude.  Probably worth slowing down a little, but I would just allow for your summer runs to have a slightly higher HR.",
            "[deleted]",
            "It is normal to run slower as weather gets warmer. I go by how I feel vs HR.",
            "Run to effort. Your hr is just going to be higher in the heat",
            "Heat can be awful if you're not prepared but i actually love running in the Heat and sweating profusely. It makes me feel badass and human",
            "Is this actually true?? I have been hoping this bc some of these runs are SO discouraging and I just feel like I'm losing fitness because of how much I slow down (or if I don't slow down, how hard it feels).",
            "My favorite thing is when you run all summer and it's hot as hell, then you run a race in October and it's cool and you're suddenly so much more efficient.",
            "At the beginning of the season I'll go for short runs at the hottest hours of the day. Always with plenty of water, a cap, and some sunscreen. Worked wonder to make it more bearable.",
            "oh no!  i’m scared now. 😬",
            "Extra points if the hat shades your ears and neck.",
            "I don't change much, but I do go from a black hat in the winter to a white hat in the summer.  It makes a noticeable difference!",
            "body glide on them works as well",
            "I bought the REI-branded women's running vest (I think it's the swiftland?) during the big sale, and the XS/S size fits well! I'm 5'3\" and 135 lbs, so we're pretty close in size.",
            "Also in Georgia - I've used the nathan trail speed and it's pretty nice, but I hate things bouncing on my already large hips lol. I've found better success with packs - nathan vaporair (there's one supposedly for women that's the vaporairess but I've preferred the unisex/men's one).",
            "I wish I could rock a 2\" short. When I see people out there with that \"runners body\" I'm always jealous. I'm not big by any stretch, but years of weight lifting have given me some thick thighs. \n\nRock that shit.",
            "[removed]",
            "😂😂",
            "Omfg. I feel so seen. Hahaha",
            "Cold shower feels great after tho, that is my motivation as I lose half my body weight in water while running.",
            "It’s probably because I’m not working towards any big goals other than keeping myself moving, so if I put in a shit performance, no big deal. But. \n\nI went out this morning and the misery the weather induced was the best high I’ve had in a long time. ",
            "I live in a desert, and every time June hits, I start trying to rope people into bad land purchases in Alaska",
            "I find the hardest part of winter running is just convincing myself to step out the door.  When I am inside and warm I am convinced that I will be cold and miserable during my run.  Once I get out and start moving I am never as cold as I thought I would be.  After that I usually start to enjoy my run.",
            "I live in the northeast and love the winters here!",
            "Yeah dehydration is the one that shows up all over Google results but there's no way I'm just dehydrated 100% of the time. Idk",
            "I feel like it helps me poop too, gets the body going and hydrated so I can drop some weight before I head out",
            "Never really had an issue with it, guess it just all comes out of my pores instead",
            "I sweat out 5 pounds of water on a run today. No chance I was going to pee haha",
            "It may take some figuring out, but I have never had a problem.\n\nMy strategy is to drink small amounts often - like 250-500ml 20mins before the run and 250 right when I start. If I drink large amounts at once, it just goes right through. This also avoids lots of liquid sloshing around in your stomach",
            "omg the watermelon one is so gross",
            "I go hard on the peach!",
            "if you want to taste all 1000mg get the “raw” flavor and you get to taste ocean all long run.",
            "Watermelon flavor is great! You can get a sampler of 6 or 8 flavors for only the price of shipping. Well worth it to try ‘em.",
            "Lots of research coming out showing they are pretty bad for you too.",
            "Same. Every time the alarm goes off at 0500 (start running by 0530) I die inside a little more but goddamn do I want to run this fucker (marathon) in October.",
            "Embrace the heat and think about how it is making you stronger. Once autumn starts and the temperatures drop, you will be flying.",
            "We just got 3 days of rain in Louisiana and 84 feels like prime running weather compared to the high 90s we had last week",
            "I'm not sure about driest, Im here on a work trip and I tried to run at 8am a couple of mornings to beat the heat and it was 85% humidity. I've never sweat more in my life! Take me back to the desert, at least in the morning it's somewhat cool and 7% humidity.",
            "It’s been brutal lately 🔥",
            "Not at all. I also make sure that I have about 10-15 min of not sweating after application. I usually put on my sunscreen first and then do everything else to get ready for my run. I found this allows the sunscreen to set and it doesn't pill.",
            "Blue Lizard all the way.",
            "Thanks for that! I'll keep an eye out for them the next time I'm out in the shops.",
            "Yeah same. I had a marathon earlier this month and carried a bottle in my hand the whole time due to the heat and finished in 3:11",
            "There’s just a lot of chatter on various social media  that I’ve seen where people shame runners for carrying water for shorter distances and I think that kinda stuff is echoed by people who don’t get why some people need to carry hydration.",
            "Just try it first to see if it tastes [like Ocean Breeze shampoo mixed with tree sap](https://hyperboleandahalf.blogspot.com/2009/07/i-finally-got-to-call-poison-control.html)!",
            "I usually drink powerade or switch but honestly, the best ones are made by supplement companies like usn, biogen as a powder added to water.\n\nIdeally you want something with a little bit of carbs and all the needed electrolytes like Sodium, magnesium, phosphate, calcium etc.\n\nI would use USN's winners fuel as a benchmark",
            "You used pale skin\n\nNot effective\n\nSun used nuclear fusion powered uv radiation\n\nSuper effective",
            "Solo night runs are great- along the river, through the woods. \n\nIt seems an unbelievable injustice that the majority of humanity can't imagine doing such a thing without having serious, credible, concerns for their safety.\n\n***\n\n\"Hey, you ever go outside and wander around looking up at the night sky?\n\n\"No, I'm not a big fan of being assaulted, thanks.\"",
            "Yea that is a blessing.  Where I do any hot runs it is a 2.5m loop around a college campus so has 3 or so water fountains along the sidewalk spread out which is nice if I ever feel I need it.  Makes running in the heat a bit less intimidating knowing it's right there even though 99% of the time I don't need it.",
            "Yeah I run from 7:30am to around 9:00am so it isn't super hot, but running with a soaked shirt is just miserable.\n\nI sometimes feel like a douchebag running shirtless, but who cares lol",
            "I'm using a unique phonetic spelling my phone keyboard loves.",
            "Yeah I think this is beyond Reddit's pay grade. Ultimately, your exercise heart rate is being used as a proxy for several different aspects of your metabolism. Those are what actually matter, not the heart rate. Heat makes your heart rate higher for unrelated reasons, so the value becomes less useful as a proxy.",
            "Appreciate! I generally don’t look at it too closely but it was so stark a difference it was starting to worry me a bit.",
            "I don't think allowing summer runs to have high HR is the right move.\n\nThere are actual tables and online calculators to calculate correction for expected race results based on the temperature. **If the temperature lowers your predicted race result, logically the same should be applied to the training intensity.**\n\nHigher HR is reflection on the fact that your body is doing overtime. Some of this is to distribute the heat to your skin and some of this is additional energy needed for this process.\n\nI always suggest people to reduce the intensity to match the HR. And also watch the HR for abnormalities which may signal dehydration, overheating or even impending heat stroke.",
            "I've actually used some of these, and I feel like they almost always underestimate how much harder the run will be for me - in some cases they were recommending a 10:30 pace instead of a 10:00 pace, when in reality the same heartrate as a 10:00 pace in cooler weather is like 12:30 or something even more extreme.",
            "100% true!!! my fastest races have always been in the fall after a horrific summer training block lmao.. think about it this way -- even though your paces are slower, your HR aka effort is about the same (or higher) as to what it usually is. sure your legs might lack a bit in the speed/turnover department, but they have a long memory and frequent strides/tempo/vo2 max workouts help significantly here.. once the cooler temps hit, you'll suddenly be able to FLY as if a 30lb weight is off your back!!\n\nas annoying as it is, I've found it best to just accept the fact that the summer training sucks and the runs still contribute significantly to your fitness even if you slow down 1min/mi+. keep at it!!",
            "I tried the Nathan on in the store. It wasn’t bad, but the pack felt long. The length and fabric doesn’t make you hot during your run?",
            "Yeah I'm definitely slim so not too much problem there!",
            "at least you didn't have your cornerstone d-man who was the first to lift the cup for your organization walk because the GM doesn't believe in NMCs and caused the window to slam shut. and you have bedard.",
            "It was me, tonight. Like an hour ago. Just awful haha",
            "I think about the cold shower almost the whole run when it’s hot.",
            "POTS can cause headaches in heat. Look up the symptoms and seem if they resonate.",
            "Do you drink coffee? Maybe that's what I should be blaming but idk if I can give it up",
            "Keep in mind that the sun bum oil is not mineral, FYI.",
            "Depending on the distance and the heat, having water back at the car might be just fine. Caching water might be what you need.  Or there might be water fountains.  \n\nMany people who carry water should be sure where they can refill, so they don’t need to carry huge amounts.",
            "I’m certain that 100% of these people are men",
            "I thought about power/gaterade, but I found the sugar concerning. I will take a look at some of the other supplements instead.",
            "My fishbelly white skin, bestowed on my line by ice giants, is impervious to earthly factors like sunlight. To damage me it's dwarf magic or nothing.",
            "I mean it's a matter of comfort so who cares, agreed. Plus if you've got it, might as well show it off hey",
            "Omg, this really helped my mindset so much haha, I have just been assuming no one is struggling but me 😂 such great perspective, thank you a million!! Fingers crossed!",
            "This was really encouraging! Been kinda beating myself up over how hard running has been for me in this heat (it's my first runner summer), but this is a promising thought! I'd like to think the effort will be worth it come this time fall! 😺😺 Good luck on your runs, friend and all who are reading this! 😸😸",
            "Not at all, but I also need a lot of fluid due to being chronically dehydrated (med side effect) so the need to hydrate supersedes any other feeling, lol. Semi-hack: put a cooling towel that's been in the freezer between yourself and the pack. I've been told ice cubes down the sports bra is fantastic, but haven't tried - but I'm sure it would distract me from any other discomfort!",
            "Doesn't look like it, it's really just the headache for me and it doesn't seem to coincide with standing or sitting just heat.",
            "A significant amount, and often a shot of espresso right before long runs",
            "From what I've seen, the majority of people getting mocked for running vests are influencers with hundreds of dollars of top of the line gear and multiple affiliate marketing links making videos of their short runs, that said gear doesn't even make sense to take on. It's not actually the vest being mocked. It's influencers trying to buy their way into a sport that's fundamentally more about time on feet than expensive accessories.",
            "REAL men embrace the heat stroke and its medical and financial consequences! MEN MEN MEN MEN MEN!!!!!!!",
            "You’re so welcome! Just know it’s a matter of when it pays off, not if, as long as you put in the miles. We’re all in this together, it’s not just you!! Best of luck :D",
            "Thank you. I’ll give it a try."
        ]
    },
    "Starting a running club in Costa Rica: Tips and Advice Needed!": {
        "title": "Starting a running club in Costa Rica: Tips and Advice Needed!",
        "score": 18,
        "url": "https://www.reddit.com/r/running/comments/1dl7rfv/starting_a_running_club_in_costa_rica_tips_and/",
        "content": "Hey there!\n\nInspired by this community and some posters talking about how great it is to belong to a running club, I'm starting one in my city! There aren't many here, normally just formal paid training groups (San José, Costa Rica), so I think it would be great for many reasons, like creating a running community, getting to know other runners, and providing a safe space for runners as the city isn't as runner-friendly as others. We are starting as a small group of friends who like to run and hopefully others will join in the next few months.\n\nI would like to know what I should take into consideration while doing this, as many of you have already experienced what it's like to belong to one. Could you perhaps share some pointers on what to do or not to do, tips, etc.?\n\nWhat are some characteristics of the best running groups you've belonged to?",
        "num_comments": 13,
        "comments": [
            "The main thing for me is making sure you’re clear about what paces are accommodated and making sure everyone has someone to run with. Don’t say “all paces welcome” if everyone runs a 7-8 min/mile and someone who runs slower will be dropped.",
            "When I travel, I go to different run clubs and review my experiences here on Reddit, so I consider myself somewhat of a run club expert.\n\nPersonally, I like to see a variety of routes, a strong and vocal club organizer/leader, and a consistent gathering/hangout spot for before and after the run. Having a strong club organizer that can clearly and loudly communicate to everyone is critical so people know what's going on.  It's common for no one to take charge and direct the group. Lastly, the most enjoyable clubs I've attended either meet at a coffee shop (morning runs) or a restaurant/bar (evening runs) so that people can socialize before and after the activity. Bonus points if the venue offers a free drink.",
            "My time to shine! I started a run club that been going strong for over 12 years, here are my takeaways:\n\nBe consistent. Choose a day of the week and time and always run that day and time, no matter what. It’s winter and snowing, you’ll be there. It’s rainy season and a cyclone in the forecast, you’ll be there. No exceptions.\n\nMake the route intuitive. This can be tricky, especially in urban areas. The route needs to be easy enough your run leader can communicate it to any newcomers and that it’s actually fun to run. This can honestly make or break the first point about being consistent.\n\nThe run leader needs to be vocal about when the run starts and the expectations of how the run ends. Be careful about pre-run group pictures, they can create FOMO which can be a short term gain, but could be a turn off to most. In either case, the run leader can shape this experience.\n\nBe open to the experiences of everyone. Some will run fast, some will enjoy the social hour. Everyone is running and make that the highlight. The best day a runner can have is being there when someone new experiences that joy for the first time.\n\nGood luck and I hope you all can enjoy the gift of wearing the bottom of your shoes off, one mile at a time!",
            "Have someone be First Aid person.",
            "If you're intending to do speed work, rep sessions and the like, measure them by time not distance i.e. 8 x 3 mins rather than 8 x 800m. If you do them on distance then the session is very different for a fast runner vs a slower runner; the faster runners will be standing around waiting for the slower runners to finish, whilst the slower runners feel under pressure to finish the rep and start the next, so that they don't inconvenience the faster runners. The end result is that the slower runners will stop coming to the sessions. By measuring the reps by time and doing them on a closed loop or a short out & back then everyone gets the same session, and perhaps more importantly, everyone is seen to get the same session and everyone can run at their own pace.\n\nWhen I joined my club they used distance, and the slower runners basically didn't attend the speed sessions. When I became chairman I switched it to time not distance, and now have people running together from 3 minutes per km right through to 8 minutes per km, and it works well. It also helps to stop the 'them & us' situation that can occur between fast & slow runners, because they're always together and the faster runners don't simply run away from the slower never to be seen again.",
            "And have a co-leader to act as a sweeper to always keep with the slowest person.",
            "Bonus if it’s an easy-to-follow out and back and there’s a turnaround time. \n\nThe group at the creek trail by us started with a group that runs 11 miles in 1:30:00. That’s impossible for me, but plenty of people join and run 45 mins then turn around and run 45 mins back.",
            "Depends what you do. If it's a loop then all paces can be welcome - like Pace Yourself Run Club. Also, most run clubs have multiple different paces, rare to find them just being one pace.",
            "How do you find out about local run clubs? E.g. any apps you use? And any tips for someone who might be nervous to put themselves out there? Appreciate any advice, thank you!",
            "Could you explain your point about the group pics? I thought FOMO would make people want to join. Or is it about comparing yourself to the people in the pic and feeling out of place?",
            "I mostly rely on Strava group search. If that doesn't work, I will search Instagram. Last resort, I'll Google, and some clubs have Facebook groups only that will show up on there"
        ]
    },
    "Achievements for Saturday, June 22, 2024": {
        "title": "Achievements for Saturday, June 22, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/running/comments/1dlmxrx/achievements_for_saturday_june_22_2024/",
        "content": "Hey runners, it's another day and it is time to post your accomplishments you'd like to share - big or small.\n\nNote: No need to preface YOUR accomplishments with something like, \"this may not be an accomplishment to most of you...\". Be proud of your achievement.",
        "num_comments": 21,
        "comments": [
            "My first ever 5k run. 40mins. \n\nHoping to get this to sub 30 by July end. Is that doable?",
            "Did my first half marathon this morning. It was amazing. Been building up the distance of my long runs for the last month or so. \n\nRan my usual route but extended it a bit and effectively ran it twice to get the 21.1.",
            "Took a 6am train that dropped me off _exactly_ 42km from home, ran back along the sea and the bike path. My first marathon distance since NYC 2018. I started getting back into some distance running earlier this year, and it just felt nice to reach this milestone with zero pressure from friends or crowd. Just me chillin, listening to my podcasts watching the sunrise.\n\n4h20, still far from my goal of 4h someday but better than what I did last time, and I've already recovered. Fun morning :)",
            "I started running on early may with an avg pace of 8’00” km for around 3.5 km. And today I finished 4.5 km with an avg pace of 6’54 km!\n\nI am very happy with my progress since i have never in my life been consistent with anything workout related :) any advice on how i can increase  the distance of my run would be much appreciated!",
            "Wanted to run 10km today but the heat was crazy. Managed to run 7km this morning. All is good.",
            "Weight 100kg\n\n2.53 Km\n\n7:54/ km\n\n20m 1s",
            "Ran ten miles for the first time in two years.",
            "Local 10k race today! Gonna be a hot one.",
            "31:15 at parkrun today but on 2 hours of sleep and a cold. I very nearly tapped out because I just wasn’t feeling it, but I’m glad I went along and got to chat with 2 friends. My immediate goal is working down to that 30 min 5K I hit in May, then to set a new goal…",
            "Really good run out today with my Alsatian, was hoping for 15k but called it at 10 thought it was starting to get too hot for her. She’s genuinely the best running partner ever!",
            "HM 1:59:32.  Already 83F and humid by the time I finished at 8am.  My long runs have been slow for the last few weeks and I want to blame the heat.",
            "I was supposed to run my first 10k today. Instead I’m on the couch with the stomach bug that my 4 year old had a few days ago. The 2 year old has it now, too. Oh well. I’ll try again next weekend!",
            "Just finished my morning training rum and the first 5k of it was, at 15:37...ran for 40 minutes on country gravel roads.",
            "Woke up later than I was planning but still got in 4 miles. Brutal splits though with the temperature being 82 with a heat index of 92.\n\nTough run but some mileage added to my goal of 20 this week.\n\nStay hydrated and safe out there everyone, don't try and be a super hero.\n\nAnd as always Happy Running everyone!",
            "Just a quick 20 min run today as v busy but ran a bit of an accidental 1 mile pb. Pretty pleased with it tbh. Been focusing on strength & conditioning and unless it's all in my head I'm starting to feel those improvements.",
            "Went on a impromptu run after work around my beautiful (& hilly) neighborhood park, my first non-treadmill run since injuring my hip flexor last year.\n\n I thought my running mojo had died for good. Turns out summer arriving may have revived it. \n\nAnd, my hip felt great.",
            "Took my dog out hoping to do 4 miles, but it was super hot/humid, and he only lasted 2 miles. Instead of calling it a day, though, I took him home and went back out to finish my 4. That 2nd 2 was slow going,  but I did it! Now I'm having a big ole brunch 😁",
            "Are we talking this coming July end, as in 5 weeks from now? If so it is ambitious and you risk injury, however, it depends on your fitness background etc. I would just focus on running more consistently, running slower and building up distance. All these things combined will eventually get you to a sub-30. This is what has worked for me, but like I said, it really depends on a lot of factors.",
            "Seems like a tight schedule to me, but I cannot tell you how your body will respond to training.\n\nRest days are important to avoid injuries.  Injuries suck, not because they hurt, but because they stop you from running while you recover :)",
            "totally... just don't rush it... best advice I got so far as a novice runner (after a triathlete/physical therapist saw my heart rate numbers) was \"you've got to run slower to run faster\". He went on to explain that I had to train my heart to stay relatively calm over the long haul (+-150) and I would build stamina and the time/pace will work itself out. He gave me this little button monitor to put on my arm and it's great... every time I got up above 150 I'd focus on evening out my pace and trying to stay calm and focussed. Very soon I was shocked at my results. I've just done my 3rd 10K and I've been running for about 9 months.",
            "That's such a convenient train, I wonder if any trains near me meet a marathon distance."
        ]
    },
    "Social Saturday": {
        "title": "Social Saturday",
        "score": 1,
        "url": "https://www.reddit.com/r/running/comments/1dlmxr4/social_saturday/",
        "content": "*Enforcing Rule 3 (no self-promotion, social media links) is a must with a large sub such as this, but we do realize that it filters out some truly useful content that is relative to the sub. In an effort to allow that content in, we thought we'd have a weekly post to give a spot for the useful content. So...*\n\nHere's you chance!\n\nGot a project you've been working on (video, programming, etc.), share it here!\n\nWant to promote a business or service, share it here!\n\nTrying to get more Instagram followers, share it here!\n\nFound any great running content online, share it here!\n\nThe one caveat I have is that whatever is shared should be fitness related, please.",
        "num_comments": 1,
        "comments": [
            "Hey all\n\nI write a newsletter that covers the follow topics\n\n* Shopfront - Shoe, apparel and tech brands showcases, reviews and collection drops\n* Cafe - Features Content creators making original and unique content\n* Gym - Showcases different training protocols, nutrition and strength material\n\nThis week we featured the following\n\n* Adidas Adizero SL2\n* Hermanos Koumori\n* Crest Apparel\n* Mack Dewar Youtube Channel\n* Straight At It Track and Field Coverage\n* Supplementation for Running\n\nLink to the article is here [https://zatoac.beehiiv.com/p/run-culture-s24-vol-4](https://zatoac.beehiiv.com/p/run-culture-s24-vol-4)\n\nLet me know what you think and if there is anything that you would be interested in reading or learning about let me know."
        ]
    }
}