{
    "Optimization Coming in 1.0!": {
        "title": "Optimization Coming in 1.0!",
        "score": 389,
        "url": "https://www.reddit.com/r/SatisfactoryGame/comments/1cjatd5/optimization_coming_in_10/",
        "content": " [https://youtu.be/yIKjR5jVv9Y](https://youtu.be/yIKjR5jVv9Y) ",
        "num_comments": 115,
        "comments": [
            "Having the belts not as separate things will be a HUGE improvement. And handing over stuff to the GPU is good news as well. I would love to have my GPU do more of the work.\n\nSo the CPU will be less of the bottleneck. Not having issues with speed yet, but I imagine that will happen.\n\nThe cutting of grass not happening is a good thing.\n\nTo be honest, I do not care about the load times. This is not a game that I play for 10 minutes. So it bothers me less. It is nice if it is faster, but if not, meh. Same for save times. I had 2.5 minutes in my previous save. Not an issue, as I set mine to 1 hour.\n\nI believe that 5 minutes autosave with only 3 autosaves is not a good thing as solving an issue takes easy longer than 15 minutes and then all your autosaves are overwritten. So either go for longer times by default or more autosaves, or both.\n\nBut optimisation id often not a bad thing.\n\nThanks Snutt. Helps a lot.",
            "**Fantastic Game News**\n\nI love to hear information about game getting improvements and this video will make Pioneers very happy.\n\nWHAT IS IN VIDEO\n\n* [Intro](https://www.youtube.com/watch?v=yIKjR5jVv9Y) - Opening comments by Snutt.\n* [Embracer Announcement](https://youtu.be/yIKjR5jVv9Y?t=40) - Snutt talks about [this press release](https://embracer.com/releases/open-letter-by-embracer-group-ceo-about-the-transformation-into-three-standalone-publicly-listed-entities/) which describes the reorganization of Embracer Group, which owns Coffee Stain Holding, which owns Coffee Stain Studios (CSS).\n   * Embracer Group is splitting up into 3 separate companies.\n   * **The reorganization is not expected to affect CSS, nor the Satisfactory Game Development or Version 1.0 Release.**\n* [State of Development](https://youtu.be/yIKjR5jVv9Y?t=106) - Snutt talked about the Closed Beta, currently ongoing. They have had about 1000 Closed Beta Participants playing and overall the feedback has been positive.\n   * Any issues or bugs are being noted and will be addressed during Gold Stage (Game Polishing) prior to release of Version 1.0.\n\n---\n\n**Game Optimizations in Version 1.0**\n\n* [Intro / Key Note](https://youtu.be/yIKjR5jVv9Y?t=157) - Performance is directly tied to your Game PC stats and so while some might see performance improvements, others perhaps not so much.\n* [Foliage](https://youtu.be/yIKjR5jVv9Y?t=191) - The \"colliders\" for various types of Foliage will be removed from Vehicles, which means you can't destroy *most smaller foliage* by driving a Vehicle over them.\n   * This change will improve performance on Dedicated Servers by reducing the amount of RAM used.\n   * This change will also improve level streaming and reduce stuttering.\n   * Foliage that requires at least a Chainsaw to remove will be still be able to be destroyed by running over with a Vehicle.\n   * Determining what Foliage is destroyed, and what is not destroyed, by a Vehicle is still being tweaked.\n* [Belts and Pipelines](https://youtu.be/yIKjR5jVv9Y?t=289) - In Version 1.0 all Belt (and Pipeline) individual segments will be \"pooled\" into one [instance group](https://en.wikipedia.org/wiki/Instance_(computer_science)) or \"pool\" thereby reducing the CPU computational load.\n   * This means that both Belts and Pipelines will part of bigger \"instance pools\", reducing the number of instances to be checked, and will be more reliant on the GPU to do most of the computational heavy lifting.\n   * [Shadow Rendering](https://youtu.be/yIKjR5jVv9Y?t=328) will improve because like Belts and Pipelines, shadows will also use bigger instance pools allowing for faster computation.\n   * Manifolds, which are often made up of multiple belt segments, will benefit from this change of using bigger \"instance pools\" by reducing the computational load needed.\n   * The use of Nanite on Belts was tested, but the final decision was to use the bigger instance pool method. **Nanite for Belts and Pipelines will not be used.**\n* [Lightweight Actors](https://youtu.be/yIKjR5jVv9Y?t=373) - Certain Buildable's that don't produce items, nor are interacted with by the Player, are being converted into \"Data Only Objects\".\n   * Common examples of \"Data Only Objects\" are Foundations, Walls, Railings, Stairs, etc.\n   * In Version 1.0 (and after) they will only store crucial information, like location, graphic mesh, customization data (colors, materials, etc.), and the recipe used to build them.\n   * Since all this \"Data Only Objects Data\" will be stored in a single location in memory, writing it to your Game Save will be faster which means Autosave \"delays\" and Manual Save times will be shorter.\n   * Additionally Load Times will be faster, and Save Files will be smaller.\n   * Also this will improve Multiplayer as it decreases the amount of data that needs to be shared resulting in Clients being able to join quicker.\n* [Memory Optimization](https://youtu.be/yIKjR5jVv9Y?t=521) - By removing unneeded data, or old test data, and other stuff, will lower the VRAM requirements for everyone.\n* [Scalability](https://youtu.be/yIKjR5jVv9Y?t=542) - Making changes from a lower setting to a higher setting, or vice-versa, were improved.\n* [Unreal Engine 5.3](https://youtu.be/yIKjR5jVv9Y?t=556) - Version 1.0 will be using Unreal Engine 5.3. This will result in some performance improvements due to Epic fixing some issues in UE 5.2, and also had the benefit of fixing some game crashes that Players were experiencing.\n   * [**Unreal Engine 5.4**](https://www.unrealengine.com/en-US/blog/unreal-engine-5-4-is-now-available) **will not be used in Version 1.0** but *may be considered in a future Update.*\n* [Upgraded Upscaler's](https://youtu.be/yIKjR5jVv9Y?t=589) - Both Nvidia Deep Learning Super Sampling (DLSS), and AMD FidelityFX™ Super Resolution (FSR) have been upgraded to their respective latest versions.\n* [Dedicated Servers](https://youtu.be/yIKjR5jVv9Y?t=602) - In a [previous video](https://www.reddit.com/r/SatisfactoryGame/comments/1bqp8mj/comment/kx4migg/?utm_source=reddit&utm_medium=web2x&context=3) *(Video Bookmarks)* the  improvements to Dedicated Servers in Version 1.0 were discussed, but when it comes to optimizations, in addition to the changes to Foliage, Belts and Pipelines mentioned earlier, Dedicated Servers will also now have the ability to do level streaming\n   * This means you don't need everything on the Map loaded all the time which means if you have a group of Co-Op friends all grouped in one area only, then only *that part of the Map* is loaded.\n* [More Optimizations Planned](https://youtu.be/yIKjR5jVv9Y?t=651) - In addition to those optimizations mentioned in this video, more are planned between before Version 1.0 is released.\n* [Q&A: How About More Videos?](https://youtu.be/yIKjR5jVv9Y?t=660) - Due to Closed Beta and lots of other behind-the-scene efforts videos have been slow to release, but that is expect to change in the near future.\n* [SHOCKING: No Beany Cap / Outro](https://youtu.be/yIKjR5jVv9Y?t=689) - Snutt realized he did not wear his normal Beany Cap.\n   * *That explains why I was confused whom was talking.* 🤣\n\nThanks Snutt, this helped a lot. 😁",
            "Oh man, if this improves save times, that's huge. I had to turn autosave way down because it just took so much time.",
            "Great to hear about all of the optimizations. The impact the foliage collision change has on vram is impressive should make anyone with 8GB cards very happy.\n\nThe cpu performance and save file improvements will be nice hopefully this means that save game stutter/lag will be much less noticeable until hopefully late game. \n\nMy only wish is that they would give us a hint on release date.  I have been holding off on starting a new save but if I know 1.0 will not be out until Q4 I would probably start a new game vs. if 1.0 is going to come out in late Q2 or early Q3.",
            "Who’s this guy? I want beanie snutt",
            "The changes to belts and pipes are interesting.  I do wonder if that has the potential to introduce new and subtle maths problems though?  I know other developers who've looked at moving some calculations from the CPU to the GPU, but decided against it due to accuracy problems. I think that might have been a lack of support for double (rather than single) precision data types though, which I'd doubt that games use anyway for performance reasons.\n\nHopefully this is thoroughly tested and any new glitches are caught.  On the other hand perhaps the focus on those calculations will have helped sort out some of the previous problems, so I guess it could also be a benefit.  I also wonder if calculating the belts as a single entity might help avoid the slight glitch in item movement that can occur at joins?",
            "\"If you've ever used belts...\"\n\nWait...this game has conveyor belts? Damn I guess I've been playing wrong.",
            "They can improve the save time all they want - I’ll just build more factory until it sucks again!",
            "*looks at comments*. Who would have thought a bunch of satisfactory players would be so excited about optimization? :D",
            "Glad to hear about the load/save times, one of my biggest complaints! Can't wait :)",
            "Sounds very good, he says that people have been playing the beta \"a couple of weeks\", maybe it is over-reaching a bit but does that indicate the closed beta being over? It is over 3 weeks since it started now. At 2.35 he also says \"hopefully it won't be long before we can announce a release date\". \n\nMaybe a release before summer vacation? Speculation welcome.",
            "Thanks for making the game gooder Snutt.\n\nHelps a lot!",
            "Tell Snutt I'll give him a French Exit if he tells me the release date.",
            "Nice us with bigger factories can hopefully have shorter than \"go grab some coffee\" load times. No complaining mind its our fault for building mega factories, but showing love to us with 1k+ hours is the game is always appreciated.",
            "That belt optimization he mentioned, that handling multiple linear segments of belts together instead indiividually, i've done that in sfticks, when I was bored enough to write a simulator for the mechanics. He also mentions handling manifolds this way, so probably they are reducing bigger DACs into multiple smaller ones, and running the computation in parallel. This was also something I've been doing in the above simulation, just on on the GPU. Good to see similar ideas implemented :)",
            "Step 1: Optimize\n\nStep 2: Blow it all on lasers",
            "I love to hear confirmation that they will indeed continue working on Satisfactory after 1.0! (that reveal was folded in the discussion of company structure change)\n\n\nI'm pretty sure so far they had left that open.",
            "I still don’t understand why foliage doesn’t get removed when placing foundations. I feel like grass and foliage should be removed when placing a foundation, is it not a performance issue with all the grass clusters still being rendered through foundations?",
            "so by the sounds of things, there won't be any more releases until 1.0 eh?",
            "The change of vehicles not crushing foliage will be a welcome one to me. However I really would like a precision chainsaw (AOE chainsawing as an option) to go along with that.",
            "Wonder what the transfer of CPU workloads to GPU will do to the Video Card requirements. Might have to pony up and get one from this decade.",
            "Wait!\n\n\nPipeline GROUPING?\n\n\nThat by itself might open the path to true stable 600 m3. The less sections that can rebound / individually decelerate, the better.",
            "I've been out of the loop on this game for several months but looking to get back into it and set up some basic framework in anticipation for 1.0.\n\nHas anything been publicly disclosed about how 1.0 is going to handle an overclocked Mk.III miner on a pure node producing resources faster than any conveyor belt can carry them?\n\nI know a while back in various dev streams or Q&A's it was always a \"we're working on it\" but it was never answered whether the belt throughput would increase, the production (and requirements) would decrease, or if the miner would get a second output, or anything else. It's hard to pre-plan for 1.0 if I don't know how many resources a node is going to spit out, or in what form.",
            "edge screw noxious library future vase consist important soft point\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I’ve been out of the loop for a while, but had a question.\n\nWhen I played this with my friend years ago, there was some pretty wicked lag and a bit of desync for whoever wasn’t hosting the game. Is this fixed now? Or planned to be fixed for 1.0?",
            "Do I still need to upgrade my 2060 or not?🤔",
            "yes pls",
            "Factory will grow faster is that you're sayin ?",
            "I really hope this means smooth items on belts in multiplayer.  Faster saves also sounds great though.",
            "So does this mean i need to put a gpu in my server?",
            "I'm new to the game, so sorry if this has already been answered. Are saves usually compatible? My first game is a complete mess, it wouldn't be much of a problem, to be honest.",
            "Snutt is such a great asset to css and to us. ",
            "Have they address an increase to render distance? I believe it was update 8 it seems they lowered the render distance or something like 25 ft for belts and machines, looks like a slideshow.",
            "Awesome stuff.\n\nFingers crossed that the indestructible red shrubs in the red/pink jungle/forest become destructible.",
            "I'm mostly excited that there's a chance that SMART development might be continued! :-)",
            "I hope in the future they make it a bit more steam deck friendly with controller support",
            "There being optimisations for a full release of a game should be a no brainer.\n\nImagine going to a restaurant, waiting for the food and hearing someone say: \"The food is going to taste good when it's going to be served\".  \nWell, I fucking hope so.",
            "But… when 1.0? It sounds all very well planned out so why not set a date?",
            "My save takes idk, 4-5 mins? Setting it to 60 minute saves, that means something like 6-8% of *total* game time is spent waiting for autosave hangs. It sucks and I'm incredibly happy they're improving this.",
            "I hope CPU only dedicated servers don’t take a performance hit from GPU optimization. But for single player with strong GPUs this will be great. DSP is also doing this I believe.",
            "> I believe that 5 minutes autosave with only 3 autosaves is not a good thing as solving an issue takes easy longer than 15 minutes and then all your autosaves are overwritten. So either go for longer times by default or more autosaves, or both.\n\nThat's a setting you can change. I have mine set to autosave every half hour.",
            ">And handing over stuff to the GPU is good news as well.\n\nIt will increase minimum requirements for the GPU though. Anyone with a high-end GPU will likely love this change, but anyone still using older hardware will definitely see a performance hit. It's definitely a great change for the game, but a small % of people playing it may not be able to play anymore until they upgrade their system. I hope Coffee Stain releases new min. specs. well ahead of 1.0 release to give those players a chance to adjust.",
            "[deleted]",
            "Dude how many hours a day are you awake? 26?",
            "> Belts and Pipelines\n>  - In Version 1.0 all Belt (and Pipeline) individual segments will be \"pooled\" into one instance group) or \"pool\" thereby reducing the CPU computational load.\n> This means that both Belts and Pipelines will part of bigger \"instance pools\", reducing the number of instances to be checked, and will be more reliant on the GPU to do most of the computational heavy lifting.\n> \n\nI assume this is just for rendering, and the actual logical layer stays the same? I guess it doesn't matter since rendering will always be slower unless you're building on an unoccupied part of a map where you have an active megabase or something.\n\n>Lightweight Actors - Certain Buildable's that don't produce items, nor are interacted with by the Player, are being converted into \"Data Only Objects\".\n\nHuh, I didn't realize UE handled saving worldstate so devs don't have to. Man, I should give it a try sometime.\n\n>Due to Closed Beta and lots of other behind-the-scene efforts videos have been slow to release, but that is expect to change in the near future.\n\nGood, I know I've been a little frustrated about 1.0 being \"close\" but not knowing a whole lot of anything about it. I've been wanting to start up a new save but not if it's *that* big of a change to the game systems and its coming soon",
            "Question as I am probably running on eof the olds systems here with them putting more load on the GPU I wonder how this will affect my setup \n\nBought brand new top of the Acer game of Republic laptop in November of 2016 I believe",
            "Thanks a ton, at work and can’t really watch the whole video. Will give it a watch when I get home.",
            "I just hope they fix the mk2 pipe flow issues.",
            "I wonder if this is what was needed to support 1200 belts?!",
            "Autosaves are silly short. You have 3 and a solution will often take more than 15 minutes to try and by then the old situation is already overwritten. And you do not really need them that often.\n\nSetting it to 15 or 20 minutes would be a way more sensible time.\n\nI have mine set to an hour. That means average time lost is 30 minutes. I believe I have used it perhaps 5-8 times in my 4 500 hours of playtime (and that is on the high side of guessing), So say every 500 hours I loose 30 minutes or 1 hour every 1 000. And again: that is on the high side.\n\nAnd it is a great time to strtch and hydrate.",
            "Haha, have the exact same issue with Factorio and it's upcoming Expansion. I tend to become really obsessed with these games, burn out and not touch the game for a year or more. So I want to \"save\" myself for when the update/expansion comes.",
            "Release dates always puts stress on the team especially if there’s a lot of work to be done and it’s basically impossible to estimate a realistic time window. Just wait and be patient.",
            "**Doofenshmirtz:** A Scandinavian?\n\n(dons beanie)\n\n**Doofenshmirtz:** *Snutt* the Scandinavian?!",
            "There's been a lot of development on GPUs for running things like Fluid Dynamics simulations, which includes support for doubles. So that may not be as big of a problem anymore. The belt and pipe updates should also look a lot like a big ODE solution matrix and could use the same optimized fast solvers for updating cell states. These sound like great changes.",
            "The way I read it was that things would be grouped together for rendering, not item math.",
            "You don't force everything through pipes like I do?",
            "Only a few meters from mine to smelter. Then you can run the molten iron through pipes .",
            ">maybe it is over-reaching a bit\n\nMy guess for release is September or later.",
            "That would be nice",
            "Why wouldnt they? or by \"working on\" do you mean adding new features instead of bug fixing?",
            "That's what they've said yes.",
            "I've found multiplayer has its moments. Last night I was hosting my world and my friend had some lag spikes. For the most part it's pretty smooth.",
            "Depends what sort of graphics satisfy you :) Actual issue in the late game is cpu anyways (which cannot be resolved by lowering graphic settings)",
            "No.",
            "That would be a valid point of the video was \"there will be optimizations\", there is quite a lot of more detail.",
            "Because software development never goes to plan.  A specific date means either having to change it or releasing with more bugs than they'd like.\n\nThe current commitment of sometime in 2024 is as definite a deadline as I'd want them to have.  However I'd guess they're hoping to release before December, having the release during the Ficsmas seasonal event could confuse new players into thinking it's a Christmas game.",
            "My god, how many hours in that world?  How big is that save file!??!?\n\nI'm assuming you're not saving to a 5400RPM spinner or something.",
            "> I hope CPU only dedicated servers don’t take a performance hit from GPU optimization.\n\nIt would be ridiculously retarded if the instruction repartitions would be the same. This is extremely clearly a dedicated server-centric game.",
            "I am well aware. I have set mine to 1 hour. I was talking about the default setting.",
            "Reading is hard",
            "Yup plus as you build more and more the auto save makes the game hang more and more so the default time gets tedious",
            "Any change will always be bad for some percentage of people.\n\nAs  most peoples GPU is now underused, there will be more people for whom it will be an advantage, so it is good, even if it is bad for some. They said they are not yet sure if there will be changes in the minimal requirements and they will give that info if there are changes.\n\nMy interpretation of how that was said, made me think that it is, for now, unlikely that there are any changes. And because the majority of people will buy a CPU and GPU of around the same quality, Not many people will buy a high end CPU, but the buy a very low end second hand GPU. For the requirements, what I see is if you have a system with an adequate CPU, the GPU will be good enough,\n\nAnd yes,there will be people where that is not the case. Obviously. They have sold several million copies, so it would be weird if nobody would be negatively affected. If it is good news for the majority of people. It is good news, even if there are some it will be bad news.l I have 10 year old systems that will be affected  negatively and I still see it as good news.",
            "On lower end systems, the CPU is a far worse bottleneck right now, once you get far enough into the game. Plus, you can always reduce graphics settings, you can't make the logic routines do less.",
            "It's a meme.",
            "he consumed 5 5-hour energies and entered the forbidden hour of the day",
            "He eats powerslugs. Actually he posted about eating powerslugs.",
            "**ANSWER**\n\n1. If you are running Update 8 with little or no issue right now, then Version 1.0 will run the same or even perhaps better.\n2. That said, with the upgrade to Unreal Engine to 5.3 it might be time to look at getting an upgrade to your current Gaming PC or perhaps a new one.\n3. View [New Minimum System Requirements](https://www.reddit.com/r/SatisfactoryGame/comments/122nkpy/comment/jdr01sv/?utm_source=reddit&utm_medium=web2x&context=3) for Satisfactory as of Update 8 and beyond.\n   * NOTE: These are the *recommended \"minimum\"* and I for one would consider something \"better\" than the \"minimum\" that has more VRAM and more RAM, and even perhaps a better CPU.\n\nI hope this answers your question. 😁",
            "Man, idk in what world this game's autosaves are \"short\". Mine take 5 MINUTES. That is an incredibly long time. At an hour autosave interval that means 6-8% of total game time is spent in autosave hangs. That is the opposite of \"short\".",
            "a year of fff spoilers is just cruel tbh, gimme 2.0 already",
            "> Haha, have the exact same issue with Factorio and it's upcoming Expansion.\n\nWasn't that slated for october/november-ish?",
            "I would agree, but they could just say \"So, this estimate release date is 100% a lie and won't be accurate, but its the closest we can give you right now\"  \nIts better to have some date to go on rather than just a huge ???  \n  \nI'm guessing one of the problems of even doing this is that some \"game news\" sites will put out a \"SATISFACTORY 1.0 RELEASE ON THIS DATE CONFIRMED!!!!!\" which may reach more people than the direct stuff coming from the team.",
            "lol, for some reason the idea of using the blender building to discombobulate any item, sending the resultant slurry through a pipeline, and then have some kind of 3D printer object reassemble the object made me laugh.",
            "The game has been in development for over five years and understandably there has been some desire in the team to move on—though of course we only have some skewed impressions of how far that is the case.",
            "Awesome! Looking forward to it",
            "~750 hours or so, 32MB save file - but this isn't my first save. It was built from the start with an endgame plan in mind - endgame space elevator parts goal is in my flair. 84-85M sink points per minute, pretty happy to have completed it before 1.0 brings a bunch of balance changes.\n\nAnd yeah, it's saving to an M.2 SSD, but the actual hard drive writes are a tiny portion of the overall save time if you run a profiler so that isn't a big part of it.\n\n[Here](https://imgur.com/a/OtUDtHH) is the world map for the save from SCIM.",
            "For me it would be negative, my GPU already is the bottleneck now while my ram and cpu are having an easy time",
            "Good points! I hadn't considered those, but it brings to mind the quote:\n\n\" \"better\" doesn't always mean \"better for everyone\" \"",
            "They're secretly living in a bathroom stall at coffee stain, overhearing all the secrets to the universe through the thin walls and sharing it with us.",
            "We love therussianbadger",
            "Didn’t the Beatles have a song about him?",
            "Powerslug in a 5 hour energy",
            "So. A french bot...",
            "Way better than 5hour energy",
            "M.2 here as well and my save time is about three seconds. It's now I actually stop motion while it saves.",
            "Are you using an SSD? How big is your save file?",
            "If that’s enough for you just make a date up and convince yourself that it’s official. Personally I heard it’s the 21st of October 👀",
            "So here is my modular frame paste pipe, and here are my pipes for supercomputer sludge...",
            "That is gigantic.  And yeah, I saw in other places that the save time is determined more by the \"prep\" to save the file than the actual disk write.\n\nHow long does it take to load up the game?",
            "Holy cow. That is some factory, friend! Impressive!",
            "Biggest build I've seen so far. Seems legit that it takes a while to save.",
            "O.o -- I... I had no idea. (New player)",
            "Then you are the outlier at this moment.",
            "No, he's clearly a time lord. As if the name didn't give it away.",
            "Yeah, m.2 SSD. Save file is huge, 30+ MB, that's the issue. The actual hard drive writes aren't a big part of the save time, mostly it's spent doing whatever calculations and compression are necessary prior to the actual file write.",
            "SSD is irrelevant.  The delay isn't due to actually writing to the disk.  Copying one of my saves to my nearly 15 year old spinning rust drive is basically instantaneous.  I first started finding the autosave interruptions noticeable when they were still small enough to fit on a floppy disk.",
            "Load time is pretty similar to save time, I imagine because a similar process is necessary to uncompress the save file data as is required to compress it.",
            "You are correct, disk I/O will not be the bottleneck for this. Even if the programmers saved the file the slowest way possible, the OS does write caching so that the output goes to ram, and is then written to disk as efficiently as possible.\n\n(There are edge cases, of course, but there always are.)",
            "Mine was 26MB and took around 2.5 minutes last time I checked it.\n\nThat also means you most likely are already in need of the change of the UnrealItem. You are also an outlier, just like me, with the size of the save, I would not mind if the save happens faster, but for me it is not a priority.",
            "I'm just starting to mess around with trains between my first few bases. Auto saves are 3 seconds. You people all sound insane or like you must be playing on Ataris. I have no idea what I've gotten myself into.",
            "Man you are hardcore players.\n\nI thought I had a lot going on in my map but auto saves never took more than a second or two. Not on a top spec machine either. \n\nFor a save to take minutes, bloody hell that must be a mega-map.",
            "Yeah no question I'm an outlier. I don't expect my autosave times on a save like that to be *short* per se, but right now they're too long imo. While 4-5 minutes is obviously extreme, my autosaves were into the 30-60+ second range long ago in my save, which is already quite a long hang time.\n\nI think the reason mine are longer than yours is that you do a lot better decoration than me. I think my raw production numbers in terms of items/minute are a lot higher, and it's saving the item state (every belt segment needs to be properly saved with its item positions) that really blows up save times, I think.",
            "The most I heard was 30+ minutes to load the game (or  an hour or more. I forgot). No auto save and he found out that there was a limit on the file size for the save file of 4GB, I think.",
            "This was exactly my thoughts. I got some factories going but nothing major and my autosave is whatever the default is and takes a second or two to actually save. I barely notice and probably wouldn’t notice if the tooltip didn’t pop. Granted I’m only about 50 hours in and just passed Tier 6 (I think; the ones with trains/gas masks).I literally just unlocked Fuel Generators which are SO much better than coal and I need to make a whole bunch of these so I can upgrade all my lower tier items and scale up.",
            "Yeah, the save in question is using the entire map, doing 60/40/60/10 of the final space elevator parts. [This](https://imgur.com/a/OtUDtHH) is the world map."
        ]
    },
    "World and Recipe changes happening in 1.0!": {
        "title": "World and Recipe changes happening in 1.0!",
        "score": 414,
        "url": "https://www.reddit.com/r/SatisfactoryGame/comments/1dfuf66/world_and_recipe_changes_happening_in_10/",
        "content": "[https://youtu.be/fkzumQ1A9Ms](https://youtu.be/fkzumQ1A9Ms)",
        "num_comments": 295,
        "comments": [
            "so, a new save it is...",
            "![img](emote|t5_gs464|9160)\"Let's find out how screwed your current factories are.\" \n\n😆",
            "[If anyone wants all the node changes on 1 image](https://i.imgur.com/owHvjHn.jpg)",
            "Well, this surely is a heavy argument for starting over, that is a lot changes that effects the factory. Guess it makes the rocky desert a more tempting starting point.",
            "Pretty happy with all of this, especially the recipe rebalances and getting the jetpack earlier.",
            "**Great Info**\n\n✓ We have all been waiting for more news about Version 1.0 and here it is.\n\n---\n\nWHAT IS IN VIDEO (Bookmarks)\n\n* [Intro](https://www.youtube.com/watch?v=fkzumQ1A9Ms) - Opening comments by Snutt about changes in Version 1.0 that will affect ***existing factories***. Snutt mentioned there were changes to Resource Nodes, rebalancing existing recipes, and has information about progression and existing Game Saves.\n\n* [Version 1.0 Release Date?](https://youtu.be/fkzumQ1A9Ms?t=40) - We will find out soon. They do plan on announcing it well in advance, so stay tuned.\n\n* [Changes To Resource Nodes](https://youtu.be/fkzumQ1A9Ms?t=70) - There will be **a lot of NEW Resource Nodes** and there has been *alterations to existing Resource Nodes* which have been either moved, changed purity level, and **some current Resource Nodes will be GONE in Version 1.0.**\n\n   * They have been wanting to make these changes for quite some time, but waited for Gold Stage (game polish) to implement them so as to not mess up existing factories.\n\n* [Specific Node Changes / Northern Forest Biome Warning](https://youtu.be/fkzumQ1A9Ms?t=108) - Snutt talks about specific Resource Node changes, and mentions **a lot happen in the *Northern Forest Biome***.\n\n   * [Northern Forest Pure Node Bonanza No More](https://youtu.be/fkzumQ1A9Ms?t=132) - The \"Pure Node Bonanza\" that *was* on the Northwest edge of the *Northern Forest Biome* **is being dismantled** with some moved, some given Purity Level changes, and some just plain gone.\n\n* [Sulfur Node Changes](https://youtu.be/fkzumQ1A9Ms?t=157) (See Map) - The three Sulfur Nodes have changed with one removed and the two remaining changed to Impure Nodes. Additionally two other Normal Sulfur Nodes from *Snake Tree Forest Biome* and *Swamp Biome* have been removed, but **MORE New Sulfur Nodes** have been added.\n\n* [Caterium Node Changes](https://youtu.be/fkzumQ1A9Ms?t=195) (See Map) - Mostly the same as now. The *Northern Forest Biome* Caterium Node has been removed, and another Caterium Node close by has been moved slightly. Additional Caterium Nodes have been removed from Western **Jungle Spires Biome**, *Desert Canyons Biome* and the *Swamp Biome*. \n\n   * The *Swamp Biome* will now get a new cluster of 3 Sulfur Nodes (1 Pure, 2 Normal).\n\n   * Additionally **MORE New Caterium Nodes** have been added.\n\n* [Quartz Node Changes](https://youtu.be/fkzumQ1A9Ms?t=228) (See Map) - A lot of the Quartz Nodes in the *Titan Forest Biome* have been removed and replaced by 1 Pure Node and 2 Normal Nodes also in the *Titan Forest Biome*.\n\n   * The 2 Pure Quartz Nodes on the Western edge of the *Northern Forest Biome* have also been removed and replaced by 2 impure nodes more centrally located within the Northern Forest Biome*.\n\n   * Additionally **MORE New Quartz Nodes** (1 Pure, 1 Normal, 1 Impure) have been added to the *Southern Forest Biome.*  \n\n* [Changes to Purity Levels of Other Resource Nodes](https://youtu.be/fkzumQ1A9Ms?t=262) - In addition to the changes to Sulfur, Caterium, and Quartz, there have been changes to *other Resource Nodes* with most of the changes being moving Nodes from Normal to Impure Purity.\n\n* [Changes to Coal](https://youtu.be/fkzumQ1A9Ms?t=275) (See Map) - Snutt talks about changes made to Coal Nodes, with removal of Pure Coal Node in Northwest edge of the *Northern Forest Biome* and two Normal Coal Nodes in the *Eastern Dune Forest Biome*.\n\n   * Additionally **MORE New Coal Nodes** have been added to extreme Northwest *Rocky Desert Biome*, along with *Jungle Spires Biome*, and a **extreme amount of Coal Nodes** added to the *Dune Forest Biome*.\n\n* [Iron, Copper, and Limestone Nodes](https://youtu.be/fkzumQ1A9Ms?t=309) (See Map) - Snutt mentions large sections of the Map have been sprinkled with **MORE New Nodes** *(which was not discussed).*\n\n   * Three Normal Iron Nodes in the *Titan Forest Biome* have been removed and replaced by a cluster of 3 Normal Iron Nodes.\n\n* 🚩 [Geyser Changes Made](https://youtu.be/fkzumQ1A9Ms?t=338) (See Map) - Snutt talks about changes to Geysers *(used for* [*Geothermal Power Generators*](https://satisfactory.wiki.gg/wiki/Geothermal_Generator#Usage)*)*. Nothing was removed, however **MORE Geysers have been added all over the Map** meaning *Geothermal Power can be a viable consideration for Power Generation.*\n\n   * They increased total number of Geysers from 18 to **30**\n\n* [Uranium Node Changes](https://youtu.be/fkzumQ1A9Ms?t=352) - Mikael steps in to discuss Uranium Nodes. The Normal Uranium Node in the *Swamp Biome Cave* is being nerfed down to a Impure Node.\n\n   * Additionally **a NEW Impure Uranium Node** has been added to the *Dune Desert Plateau Sub-Biome*.\n\n* [Bottom Line - You have MORE Resource Nodes](https://youtu.be/fkzumQ1A9Ms?t=382) - Snutt emphasizes that overall there will now be MORE Resource Nodes *of every type* despite all the changes.\n\n   * ★ [View All Resource Node Change Maps](https://drive.google.com/drive/folders/1S2oJxzkoVoFhBPzqgZc9ted9GoeUDK0R) (Google Drive).\n\n* [Recipe Changes - Super Computers](https://youtu.be/fkzumQ1A9Ms?t=405) - Super Computers will no longer be part of the MAM Caterium Research Tree, and no longer needed to make Programmable Splitters or Geothermal Power Generators which will instead need AI Limiters and High-Speed Connectors respectfully to enable use of Geothermal Power Generators on all those new Geysers added. *Mikael jumped in to correct Snutt*.\n\n* [Reasons Why Recipe Changes Were Made](https://youtu.be/fkzumQ1A9Ms?t=459) - Snutt mentions that the made changes to allow those in Early Game to Mid Game have access to some of the \"fun\" stuff, and to make their use more of a consideration for Factories.\n\n* [QoL Changes Made](https://youtu.be/fkzumQ1A9Ms?t=487) - Snutt talks about several QoL changes made:\n   * The Gas Mask will now will be unlocked in the MAM Mycelia Research Tree instead of Tier 5.\n   * The Jetpack will be available in Tier 5, Milestone 1 and will not required Oil Production.\n   * Tier 6, Milestone 1 will now include the Truck instead of the Fuel Generator which was moved to a **new Milestone** *(unnamed)*.\n   * 🚩 BIG CHANGE is that Trains and and Fuel Generators will no longer require Computers or Heavy Modular Frames making them accessible without using a Manufacturer.\n   * ★ Heavy Modular Frames are no longer used for Buildings in Tier 5 and early Tier 6, and Computers are not used in early Tier 6, both of which will be used to unlock items in Tier 7.\n   * Also Circuit Boards and Electromagnetic Control Rods are NOT used to **unlock** Buildings, or anything for that matter, *but will still be used in Recipes.*\n\n---\n\n**Continued on additional Reply Comment below** ⬇",
            "Here's to all the future posts asking if a new save should be done for 1.0 thay will still not stop",
            "I've been wanting to jump back into Satisfactory for a while, but have been trying to hold off until 1.0. I almost broke the other day and seeing this makes me glad I didn't. Looks like enough is changing that I really should just wait.",
            "Welp my world is screwed...royally screwed. im centrally located on every single node that he mentioned in Northern Forest",
            "Heavy frames will now only take screws.",
            "In terms of biomes, Spire coast and the swamp got some upgrades as they now have a much better balance of high tier resources. Rocky desert now has a better spot for coal power on the north west coast. \n\nHMF and computers got a bit easier and also not as much needed for buildings anymore. That means you need way fewer in phase 3. But you need a lot more in the late game because radio control units require twice as many now. \n\nFuel generators got a 40% buff and I don't understand why. \n\nI quite like the changes in general, I wonder what the story elements will be like.",
            "Sounds like some good polishing. Nothing too distracting and not overly dumbed down. I would have suspected some more nodes in the Spire Coast, towards the ocean, but perhaps that comes with the SAM Ore and the like.\n\nSo I am now leaning more towards playing U8 until [some mods](https://houghi.org/standard-general-idea-and-mods/) I really would like to have, are updated.",
            "I was hoping we would see another teaser at the end.",
            "I for one am happy with big changes.\n\nIve got over 800hours so anything to make the game feel new is fine.\n\nKeep it up CS.",
            "Love all of these changes, but especially that trains will come *much* earlier, which was sorely needed.  It also finally looks a lot less terrible to start in the Grass Fields.\n\nMy only remaining gripe about the game is the alternate recipe grind, RNG, and perhaps most importantly, the time it takes to unlock them in the MAM.  It's literally the only building that I know of where you can't simply build more of them to speed things up, as building more just added another linked instance of the same building.",
            "Looks like the Southeast lake might be the new megabase haven with all the new coal and other materials nearby.",
            "I'm kind of confused about the bit on fuel generators - generators make more power for the same fuel, but then he suggests deleting or underclocking the excess generators in existing setups, but like, wouldn't it just be \"free\" power? Why would you adjust a setup in that circumstance? I first interpreted it as \"fuel generators generate more power, but take proportionally more fuel\" since that would lead needing less fuel generators for the same amount of fuel. (So building less overall)\n\nExcess power generated by a fuel generator shouldn't be a problem (fuel gets burned at a consistent rate, regardless if power is used)  - but I suppose this does make fuel generators a better choice for dealing with the mid/late game power reqs and I might feel a little less inclined to obsessively expand my coal setups every time I have an opportunity to increase mining speed/belt capacity.",
            "Great balance changes, especially surrounding HMF's.",
            "Somebody give me the bullet points I’m in a place I can’t watch the video.",
            "Coffee Stain removed the nodes that are mission critical to my power grid's survival, \n\nI hope i will get fuel power ready by then",
            "Wow, making it easier to go completely screwless! May have to change my normal strat from Silicon computers to regular computers now...",
            "Oddly enough, I don't think I'm actually using any of the removed or debuffed nodes in my current save, although the loss of the Caterium node next to the Gold Coast oil nodes is a bit of a pain since I used that quite a bit in my first save.  It's nice to see more resources in the northwestern part of the map though; the resource nodes in the Northern Forest tend to be very concentrated near the spawn area and left most of the northern part of the map empty.\n\nIf there's one thing I'd say about this is that fuel generators might be a bit too OP with these changes, but I guess more power is always a good thing?",
            "I've been waiting for 1.0 and I'm super excited to see my choice to wait was a good one. Looking forward to when this releases so I can dive into the game. My free time will disappear! :D",
            "Those node changes are going to be interesting. Some of them are going to break things I already have, but others look like improvements.\n\nMy plan has always been to continue my existing save since I've put *sooo* much work into it. But this isn't really enough to actually prepare for that. We're still missing two massive questions.\n\n1) What exactly is the Mk3 miner \"\"fix\"\"? Are we getting 1200/min and a massive change to the resource availability? Or something more balanced like 900/min? Or the best option, the troll job with a pinned slider?\n\n2) What changes are being made to the rest of the recipes? Any recipe change propagates through the entire production chain and recipe tree.\n\nIt'd be really great to get answers to these in advance of the release date, even if it's only a week or two out.",
            "Really happy with the changes, Northern Forest always seemed a little too obvious for being a prime late-mid game area, in addition to being such a strong starting location.\n\nMy favorite area, Rocky Desert, is benefitting a lot from these changes. The extra coal makes the midgame require a lot less travel and the addition of Caterium/Quartz/Sulfur makes the M.A.M. a lot more accessible early on.",
            "Welp that's the end of my save without cheats.\n\n\nZero means for my power facilities to function. Would be genuinely faster to restart than try to fix it.",
            "Hype; gonna break a few of my factories a little bit, including my nuclear power, but I've got a few days of battery supply and half a click of belt with rods backed up rtg. I'll have gotten the full EA experience despite starting in U7!\n\nDoes mean I'm going to limit any further progress in my new save tho, I'm 50h in and not redoing it, but I'm only in P2",
            "it would be fun to see a quasi-random option for nodes in the future so it brings more replayability.",
            "I wonder if we'll get a bigger blueprint editor.",
            "This kills the factory.",
            "1.0 when, can't wait..",
            "I don't understand the point of deleting the a sulfur node while there is no other sulfur node around... what is the initiative? For example the sulfur beside the big hole in the middle and the one west to swamp, I use direct belt to setup small factory nearby, that removal ruins everything, it does not worth it to setup a rail for it and that is not my propos... I'm upset now... my save is about 800hous and I'm still in lv6 because I build factories according to landscape and resource around and fine tune the architecture esthetics... not easy to restart",
            "Oof, that's going to hit a few of my factories: \n\n\n * My first computer factory (and first factory nice enough to post here) is going to lose it's caterium node (it uses both caterium alts and is built right on the removed node on the west coast). \n\n\n * My Aluminium/Fused Frame/Cooling System/TPR factories (adjacent to each other) are going to lose their coal nodes and be lacking RCUs. \n\n\n * My nuclear plant is going to lose it's sulphur, quartz and caterium nodes and get it's uranium node downgraded (it's small, so I could just overclock the uranium node). Probably I can just shut it down with the increased power my fuel generators will produce though (I'll gain over 30 GW of oil power and don't use most of my nuke plants 50GW output). \n\n\nEdit: the loss of nodes to the aluminium factory is going to take the waste reprocessing offline too.",
            "This is very disappointing. I was really looking forward to more information about the cooking system and especially the roller coasters.",
            "kind of on topic but how the heck do people deal with 3 input manufacturers, having only 3 of the inputs connected always looked SUPer wierd to me so I've just kinds avoided recipes that do that, but now with the change it's gonna be different",
            "Removing locations as obvious seems like a pretty good idea.",
            "And to think I almost jumped back in yesterday, thanks snutt!\n\nI’m out of the loop, is 1.0 testable? Also I’m fine starting a new save, is there any reason to keep my old file? I have no attachment to my, uh, idk what to call it lol",
            "Oh ffs just bring it at this point. I want it now!!! \nAs long as I can still get the boom box and get lost whole building I'm in.",
            "Yay! No restart for me! I’ll just shoot my self in the foot for rerouting some of my recipes to other places but other than the heavy frames I’m largely unaffected.",
            "Northern forest change isn’t that bad. It’s still a hot starting location, you never use all those resources until late anyway",
            "I think literally every source of quartz my current factory uses is going away 😭 rip me. Time to build a quartz train.",
            "These changes look amazing!  Very exciting!\n\nOne question.  Won't the Uranium node changes ultimately limit the number of places we will see nuclear builds?  Most players are choosing to build near the normal nodes.  Now that's cut from 3 to 2.",
            "Haven’t played for a long long time (maybe update 3) and I was wanting to jump in and setup a small starter base before 1.0 dropped. I just 100% factorio before the expansion and am looking to cleanse my automation palette! \n\nI’m so out of the loop I can’t even tell if the changes impact the starting area, or if it’s even a good idea still go progress to say tier 3 and unlock a bunch of starter area research and a few alternate recipes.\n\nBah I wish there was a release date… :/",
            "Want extra resources when you start a new game in V1.0 in a few months? Go and place overclocked MK3 miners on all the nodes that are going to vanish, then make a savegame. From what I've seen, nodes only enable you to place a miner, once the thing is placed it will mine whether or not a node is there. So there's a good chance if you plop down miners on those tasty sulphur-, quartz and caterium nodes that are going to vanish, the miners will continue to mine even after the nodes have been removed.",
            "Damn, I just started over after I stopped playing in 2021. Looks like I've got to think again.",
            "I kind of wish they'd set up \"versions\" for recipe (and maybe tier) values, and let us pick, per-world save. So we can have backward compatibility.\n\nMaybe that's hard to do with the way they've structured the game data; or maybe they don't want to have to support multiple versions moving forward. (It's probably the latter more than anything.)\n\nBut it sure would be cool!",
            ">The Gas Mask will now will be unlocked in the MAM Mycelia Research Tree instead of Tier 5.\n\nSo I guess CS agreed with me when I said the gas mask should come earlier in the game",
            "Man... my old world had like 200 hours on it, idk if its worth to restart or just try to fix now... both will take immense work, i even had hypertube networks going around the world so i could get from one end to the other in less than 20 seconds.",
            "It is things like this that make me love Coffee Stain.  I agree with every single change.  In particular, though I had previously never focused on it as a thing that needed attention, pushing trains down the tech tree to make them accessible earlier is a \\*great\\* change.  Up to U8, I never used them at all until end game.  You get the \\*tech\\* tolerably early, but because of the high requirements in terms of computers and heavy modular frames, it never made sense to use them until you already had pretty beefy, well developed production lines (i.e., in or approaching end game).  But trains are a logistics backbone, so that's a bit silly.  A developer that didn't play or care about their own game wouldn't have recognized this as a problem.  But CSS did.  Three cheers.\n\nBut on another note, what the hell kind of name is \"Notsnutt?\"",
            "I just want a stupid \"yeah, Q4 2025 most likely\" or whatever...\nI don't care for the actual date, just for whether playing satisfactory until my interest drops again can be done",
            "Was already planning a new save anyways. I was debating starting at the northern forest god spot but with that getting nerfed I'll start in dune desert, always enjoy playing there.",
            "I'm really curious how the story will work with multiplayer. I want to have a dedicated server with a few friends, but don't want to miss any story if they play without me.",
            "A lot of great changes! I think in particular the Tier 5 adjustments should improve the burnout that many players tend to have around phase 3.",
            "I’ve put like 1K hours into my existing factory… you expect me to start over?!\n\nBecause you’d be right if so. Can’t fucking wait!",
            "Does anyone smarter than i have the difference in total yields available pre and post update for nodes? (I.e 2000m3/min compared to 2100m3/min etc)",
            "I don't like a lot of the removal and downgrades, mostly because those nodes tended to be a large part of why I built there in the first place. The sulfur nodes near the swamp are especially frustrating because their presence and the uranium (which also got nerfed) were why the Swamp was worth the hassle of it being awful to explore, awful to build in without just making your factory a bunch of floating platforms, and just plain unpleasant to be in with the weird desaturation thing. if it was just the one removal that'd be one thing but with the downgrading by two whole tiers of the other you need to haul in sulfur from another node. If there was one relatively close it'd be tolerable maybe but the nearest one is up in the dune desert's coastline, which is a long way to belt, on awful terrain for trucks, and while you could do it with trains that's a fair bit of work for a fairly small amount of what you'd actually need. \n\nIt all feels really comical in an exceedingly frustrating way when they've talked about not wanting to mess up preexisting factories and the environment by moving the nodes onto the world grid when this change is going to be probably a similar amount of work on the map and is going to be far more harmful to people's factories. It feels like they want people to start a new save by making it so tons of their infrastructure breaks rather than by pitching a compelling enough story to be worth starting over from scratch at this point.",
            "Not me having to deconstruct and rebuild a whole 12 hours of building in form of HMF factory due to minor recipe changes:",
            "Time to restart my save for 1.0. Debating whether to unlock a bunch of Awesome shop stuff right at the start",
            "Feels like they specifically nerfed the easiest spot of your first nuclear power by moving that sulfur next to the waterfall and making the caterium need to go down a cliff now. You need an extra bit of long range logistics now, maybe for the best.",
            "Welp.  That pretty much blows up my factories.  \n\nWhile this makes me a little sad, the truth is that I have been looking for a reason to redo my train stations.  They were pretty cool already, but I found that the tracks were just a little too close to each other, so my gates were opening on the wrong track.\n\nI wish you could set the gates to only react to players rather than to vehicles as well (and possibly only to vehicles to block players from going where they really shouldn't)",
            "Basocally best to restart. Existing factories will crash and burn due to node/recipe changes but progression is a bit easier overall.",
            "Remindme! 8 hours",
            "I doubt 1.0 will come out any time soon, by the sounds of it, will be later in the year or even early next year so play till your hearts content until then :))",
            "Do you think there will be mods to keep the performance optimizations but keep the update8 resource nodes and recipe, so that we don't need to change too much?",
            "Why they can't make it retrofittable? Added or moving resource nodes are ok, don't delete it! Especially when there is no alternative around. Balancing recipe is ok, but keep the original one and add new one as alternative recipe! Nonono new save is an absolute nightmare I don't want it...",
            "I’ll check all my factories before choosing if i start a new or change what i have. \nI dont care about the story.",
            "none of this matters till a release date is given.",
            "will we be able to play early acces version?",
            "The fuel gen change is questionable. We're already making 10k mw with turbo, and 5k more with coal and geothermal. We have a massive factory but unless you are recycling all the overflow, most of the factory is dormant and thus not drawing electricity. Where is the need for nuclear? Not to mention the hassle with recycling the waste. It's a full weekend to lay train and build the shebang for electricity you probably won't need. With 250mw per fuel gen, you definitely don't need nuclear. Also, there's no point in rushing the jetpack as solid bio is not a good fuel anyway. Rush the hover pack, because building without it is insufferable. \n\nOh, and vehicles and hypertubes are completely broken in multiplayer. Cheerio!",
            "Welp, the node removals and changes have pretty much rendered most of my major factories resourcesless.  Either that or I now have a lot more train stations and conveyor belts to make.\n\nOn the other hand, I have a lot of new places to build geothermal that does nothing other than charge power storage.  Between geothermal and the fuel generators making more 2/3 more power, I'll have the juice to make it all.\n\nOn the third hand, more things needing high speed connectors.  :| \n\n![gif](giphy|em91409tVRqxi|downsized)\n\n  \nSeems like I'll want to experience the story as CSS intended, so might as well start over.",
            "New recipes means a new save for me",
            "Interesting. Biggest problem i see for my save so far is the coal node of the northern forest moving. That i can deal with...",
            "I am suprised that my current playiing save (450hrs) which I spread my factories to half of map just affected by the removal of sulfur from north of grass field and the most west caterium spot. ![gif](emote|free_emotes_pack|sunglasses)\n\nWell, the sulfur spot is my nuclear waste processing factory and now I need to transport some to it. =/",
            "Most of this: great.\n\nBut I saved that northern forest spot for my 1.0 playthrough, wanted to build a mega factory there.\n\nOh well. With the trains being available earlier I guess it's fine. Just need to build up until steel in one spot and then start spreading",
            "I've been working on my magnum opus since Update 5, and it's completely f*ked by these changes. Good thing I've stashed a copy of Update 8.",
            "I have 4 nuclear power plants all 4 need to be redone. I was hopping at least one would make it thru 1.0 unscathed.",
            "Well. This hits my save hard I think. I don't think I'll finish my 700 hour save and just wait for 1.0 and start over again.",
            "RL shirt ❤️",
            "I have mixed feelings on the changes. Big yay for the recipe and train changes. I really don't understand most nodes changes. I get the nerf for the northen forest, but it seems a bit too excessive to me, but most nodes were just moved with no real reason. What I don't really understand is the fuel generator change. Like it's very powerful now, there's no need to buff it by 66%. And while I like moving geothermal earlier, with the changes to the fuel generator, the geothermal is still completely pointless. I was hoping geothermal would be moved much earlier, like next after biomass burners or alternative to coal generators.",
            "\"should you wait to play until 1.0 comes out?\"  Uhh, guess so as I haven't played in months since the closed beta ate up all dev resources and no more changes were going to be public until full release.  Given how much was suspected to be changed, a world restart would be desired, so I didn't see the point of playing a dead end world anymore.  So, I'm waiting.",
            "![gif](giphy|G4Ihli2UThrBS)",
            "So will moving trains forward in the tech tree make tractors and trucks even MORE useless/tedious than they already are?  I'm really hoping for some better tools for setting up vehicle routes to make them more viable, but I suspect people will just rush trains and be done with it.",
            "I'm glad they nerfed the Northern Forest resources. You could basically build everything in one little spot",
            "[deleted]",
            "glad they finally made it clear at least",
            "Less screwed with the computer recipe change",
            "Completely, I'm running on uranium node that got nerfed to impure (swamp side). ![gif](emote|free_emotes_pack|grimacing)![gif](emote|free_emotes_pack|give_upvote)",
            "[A bigger resolution with direct link](https://i.imgur.com/owHvjHn.jpeg)",
            "thank you\n\nWow, lots more changes than I was expecting.\n\nI wonder if the existing node spots will continue to produce stuff, like other times that they've moved nodes around. (still have more video to watch)",
            "I wonder if these changes make the northern forest even better, when it felt too good to me already.",
            "Dang. Doesn't look like the nodes are grid aligned. It seems like if they were going to this is where they would have announced it. I thought I'd heard their reasoning in the past was that they didn't want to break factories so I was hoping it would be part of this video since they're already breaking so many :(",
            "But it doesn't show which nodes were just moved to somewhere else",
            "I think I preferred when the oreswere scattered around the world, rather than many of them being in one place. I guess it's easy to organize it now, it will completely change how the game is played",
            "And rocky desert hasn't been an amazing starting point so far?",
            "If i wasnt already planning on a restart this would have sealed the deal for me\n\nThe sulfur changes alone brick one of my \nTurbofuel plants.",
            "Personally I think it would be crazy not to start fresh, even before knowing about these changes.",
            "Those node movements break like 70% of my factories lol. Most (all?) would be pretty easy to fix but I'll still start over",
            "I am personally looking forward to restarting to try the new progression. Sounds like earlier trains are on the menu and I think I’ll have fun with that.",
            "They also make it a lot harder to get quartz for factories in the middle east part of the map.",
            "I know people get attached but 1.0 seems like people would want to start over anyways to have a fresh experience with the full story content.",
            "Actually having the option to use Geothermal in between Biofuel and Coal is going to be extremely nice",
            "**Continued from Reply Comment above** ⬆\n\n---\n\n* [Computer Changes](https://youtu.be/fkzumQ1A9Ms?t=554) - In addition to what was previously mentioned, Snutt delivered some sad news. **In Version 1.0 Computers will NO LONGER require Screws to be built** and has had a full Recipe Change (see link for more info) to require only 3 Parts instead of 4.\n\n   * They did increase the use of Computers in other Recipes *(like Radio Control Unit)* to balance everything out.\n\n* [Heavy Modular Frame (HMF) Changes](https://youtu.be/fkzumQ1A9Ms?t=591) - The now will take nice even numbers making their production easier to understand and use.\n\n   * They increased the number of Steel Pipes and Screws but relaxed the requirements for Encased Industrial Beams which will require more Concrete than Steel Beams.\n\n* 🚩 [Fuel Generators](https://youtu.be/fkzumQ1A9Ms?t=624) - Snutt announced a POWER INCREASE for Fuel Generators where in Version 1.0 they will produce **250 MW** *(instead of 150 MW currently)* but there has been **no changes in any Fuel Recipes.**\n\n* [More Recipe Changes in Version 1.0](https://youtu.be/fkzumQ1A9Ms?t=657) - There are more Recipe changes made to include *Alternate Recipes* that you will find out in Version 1.0.\n\n* [Game Progression and Story Info](https://youtu.be/fkzumQ1A9Ms?t=681) - Snutt mentions that those continuing to use an Update 8 Game Save in Version 1.0 will need to redo some of the unlocks in Milestones, and MAM Research Trees in order to see the \"Story\".\n\n   * For those using an Update 8 Game Save there will be **Story Triggers that won't appear properly**, but that will not affect your ability to finish the game.\n\n   * For those using an Update 8 Game Save who don't care about the \"Story\" they will be fine just fixing up what needs to be fixed in current Factories.\n\n   * Those whom want to see the Story \"elements\" properly, then starting over, beginning with Tier 0, is recommended.\n\n\n* [Outro](https://youtu.be/fkzumQ1A9Ms?t=734) - Final comments by Snutt.\n\n\n---\n\nThanks Mikael (and Snutt) this helps a lot. 😁",
            "The answer remains the same: It depends on the person, the save file and the situation.",
            "Same here. Will jump in to try to get better at building and making things look good, but not going to do any serious factory building.",
            "just restarted recently and pushed a save to 30 hours, im still early enough that most stuff needs to be teared  down (just got mk3 miners), but now i think i can't play until it drops",
            "The bunch of sulfur and coal that was removed feed my main powerplant so my grid is gonna die",
            "This is going to be a very unpopular opinion but they nerfed the northern forest so hard I have lost most of my interest in 1.0. It feels like they just sort of decided that they didn't like how much people liked that area so they decided to completely and totally decimate it. You can't even get coal over there anymore.",
            "My nuclear power plants will have to be re-examined. They currently produce 75 GW of power in 15 plants by the middle of the map. If the cave node is reduced in purity, I'll have to cut those or pull in uranium from elsewhere.",
            "They will be made in the manufacturer and require you to provide 4 full t5 belts of screws to make one per min.",
            "Fuel generator spam sucks, glad they changed it.",
            "I like that they uncluttered phase 3 progression. I don't have a ton of sympathy for HMFs because, annoying as they are, you can get started on them in phase 2, but computers always felt backwards. Oil placement generally forces you to travel decently far from your early factories, and getting computer production online is a big jump in power utilization. However, you need the computers for fuel gens and trains so you need to essentially get your computer plant online before you can comfortably connect it to your base, and power in that chunk of time always feels pretty sketchy.\n\nI'm assuming trains and fuel gens will have prerequisites on early phase 3 (probably circuit boards?) so you still need to go on your big adventure to Oil the same as you do now but can then use the fun toys you get in phase 3 to actually complete the phase rather than treating them as a side project that helps prepare for phase 4.\n\nBasically, right now it's Oil -> Phase 3 Progression -> Power / Train Infra -> Phase 4. Instead, it should be Oil -> Early Phase 3 -> Power / Train Infra -> Late Phase 3 -> Phase 4. Not only should this smooth over phase 3 progression, but it should give people more incentive to build out transportation infrastructure earlier in the game. Having clear and focused goals to accomplish with trains in phase 3 should help encourage players to put them to use. Leaving them to post-phase 3 makes it pretty easy for players to tunnel vision past them in favor of the phase 4 goodies which leaves them very unprepared for the game opening up like it does in phase 4. (I know I did that the first time I played.)",
            "I appreciate the smaller footprint/MW, especially when burning turbofuel.",
            "Fuel Gen buff should reduce oil dedicated to power.",
            "On my most recent save, I have 104 coal generators, 252 nuclear generators and *400* fuel generators. Knocking that down to 240 would belp a lot.",
            "second the fuel generator part lol, I'm actually super glad for the change but the justification they gave was really wierd lol",
            "> Fuel generators got a 40% buff and I don't understand why.\n\n\nBecause making a Turbo Fuel setup big enough to be a Nuclear alternative takes real life months of work. This makes Fuel a much better option for those wanting to use uranium for progression instead of power.",
            "Once I started making plastic the byproduct ended giving me so much fuel I was swimming in spare power so this will just make it more extreme.",
            "I imagine the sprinkling will at least hit that area",
            "I have a bit more hours and I myself make the game feel new. ;-)",
            "> trains will come much earlier, which was sorely needed.\n\nI've mixed thoughts on that.  I unlocked trains a long time before I felt the need to build any (I literally had one parked on a short section of rail in sight of my hub to remind me to build some track when I needed it).\n\nThe first time I felt I actually needed it was when bringing together the outputs of my first aluminium and computer factories and some quartz to make crystal oscillators and RCUs.  \n\nThat single train line took me a *long* time to build and is rather ugly.\n\nAs a result I spent some time procrastinating building a better HMF factory (for a break from rail building) and moving/upgrading my motor factory (to free up space that might be a good rail route).\n\nAfter that I realised I was actually only a battery factory away from drones and that they'd serve my logistics needs just fine moving mostly processed, lower volume items (the first thing I used them for was changing how I brought in computers and aluminium casings to my RCU factory, leaving the train just bringing in quartz).\n\nSo while I can see why some people might like trains earlier I found I didn't need them as early as I had them and by the time I did need long-distance logistics drones weren't very far away.  Obviously this will depend on people's playstyles, scales and preferences.   More of a gap between trains and drones might encourage their use for some.  For others having them even earlier might result in even more people on first playthroughs asking why they need them when a belt will do the job, because they're still at a scale where the stations are as big as their factories and a single belt will do the job.",
            "> My only remaining gripe about the game is the alternate recipe grind\n\nThere are two ways around it. Place a MAM when you find a hard drive and run it. Remove the MAM. Go look for the next one. Best to get ALL the alts. That way you get extra inventory as well.\n\nSecond option is to go into AGS and set things to unlock. Ideal if you have found all hard drives before already a few times.",
            "Just between the extra sulphur and increased fuel generator output it'd be an easy place to build turbo-fuel on a scale that made nuclear unnecessary for many players.",
            "For people who run more than one power grid, they might not need the extra power and would appreciate the extra resources.",
            "The way I understood it, fuel doesn't change its energy value, so if the generator provides more power, it burns more fuel. The same amount of fuel needs fewer generators.\n\nIn this case, underclocking is basically setting the generators to the old version values... the alternative would be bringing in more fuel, which requires more piping. It might not be possible.",
            "> 'm kind of confused about the bit on fuel generators - generators make more power for the same fuel, but then he suggests deleting or underclocking the excess generators in existing setups, but like, wouldn't it just be \"free\" power? Why would you adjust a setup in that circumstance? I first interpreted it as \"fuel generators generate more power, but take proportionally more fuel\" since that would lead needing less fuel generators for the same amount of fuel. (So building less overall)\n\nQuite a lot of extra power too. Just taking my two biggest oil power plants built once I had right recipes available (I have smaller less efficient ones too), would mean my overclocked pure node of diluted fuel (133 generators) and pure node of turbo blend fuel (175 generators) produce over 30GW of extra power.\n\nThose setups weren't sized to produce a certain amount of power, they were sized to fully use a pure node of oil.\n\nMy nuclear setup is only 50GW and I only use a fraction of it's output, with the extra power from oil I wouldn't need it at all.",
            "I thought it interesting that it was such a huge step in your process. Sort of coming of age ritual. But then a lot will depend on what the alts will look like.",
            "It'd be nice to know if the alts changed. I don't want the recipes using screws to end up cheaper than the ones without",
            "Why do people always say \"balance\" as an excuse for literal nerfs?",
            "Quite a few nodes have moved, northern forest is less node-dense, and there are several recepie-changes.",
            "Check out u/Temporal_Illusion 's comment on this thread.  It's one of the top-rated comments, should be easy to find.  However, in my own words:\n\n**Node changes**\n\nBig picture: more resources, more evenly scattered throughout the map.\n\n* Many nodes have been added, removed, moved, upgraded, or downgraded.  Some of this is to rebalance certain areas that were either dense or bare.\n* Even if some nodes have been removed or downgraded in purity, there are more overall resources of every type available.  Biggest changes seem to be for sulfur, quartz, caterium, coal, and uranium.  Although they have done the \"sprinkle treatment\" for pretty much everything, which I take to mean they've sprinkled in more nodes.\n* Lots more geysers.\n* Changes will be factory-breaking.  Probably best to start a new save.\n\n**Progression Changes**\n\nBig picture: Progression has been smoothed out, especially in Phase 3.  Fun stuff available sooner.  Manufacturers less daunting when introduced.  QOL changes regarding fuel generators and item requirements.\n\n* Supercomputers are no longer part of the Caterium tree.  Programmable splitters and geothermal generators no longer require supercomputers to unlock, which makes them useful earlier in progression.\n* Lots of the fun stuff was locked at end-game, which means by the time you could use it and play with it, you're already done.  Gas mask is unlocked in Mycelia tree so it's available before Tier 5.  Jetpack available before oil processing.  Logistics Mk 4 includes the truck, fuel generator moved to its own tier.  Trains no longer require computers or heavy modular frames, so can be used to start your computer or HMF production.  \n* HMF aren't used until late tier 6, computers not used until tier 7.  Makes it easier to build into those.\n* Easier manufacturer use when first introduced.  Computers no longer require screws, HMF numbers rebalanced to be more \"even\".  Computer usage in other recipes has increased to counterbalance.  Encased industrial beams require less steel, more concrete.\n* Fuel generators are clocked 67% faster.  Requires less space, same fuel.  *This is ambiguous in the video whether they're clocked faster or whether the fuel produces more.  Answers in the Q&A site suggest that it's clocked faster, and the MW/fuel is the same.*\n* Some items will no longer be required for unlocks or buildings, including circuit boards and electromagnetic control rods.\n* Other changes coming, mostly minor tweaks and alternate recipes, but these are the heavy hitters.\n* Changes will have significant effects on production lines.  Probably best to start a new save.\n\n**Story**\n\n* Because of the changes to some of the unlocks, you may need to go back to the MAM and HUB and unlock milestones or other progression items.\n* If you have already progressed through the tiers, you will miss some story triggers.  If you want the full story, probably best to start a new save.  *Which you will probably be doing anyway because of all of the changes.*",
            "Caterium Circuit Board and Caterium Computer are still my preferred method, can build computers with nothing but oil and Caterium.",
            "Yeah.  I've been itching to get back into the game.  But even the changes to early tiers (biofuel generators can accept fuel on a conveyor) that make me want to wait.",
            "My bet is 2 outputs on the Mk 3 miner. 600/min out of each port wouldn't be horrible.",
            "Add priority power switches and batteries and you can have some time to fix things ",
            "Me too.\n\nI'm losing sulfur for my turbofuel plant (the new node on the desert plateau will have to replace it).\n\nMy Nuclear is losing sulfur with the purity changes, and one of it's caterium nodes is being moved. Right now I'm only running off the Normal Uranium on the swamp, there are non-functional drone ports for the other nodes that I haven't activated yet while building out my batteries production. That'll be easy to fix swapping some belts around but halves my power before the drones are set up.\n\nThis breaks my crystal oscillator plant between the rocky desert and northern forest without that quartz, and the moving caterium.\n\nLooks like there's a caterium node purity swap in the dune desert that means I need to flip two train routes. \n\nIt also changes my plan for a future circuit-board and HSC factor near those titan forest quartz nodes.\n\n\nI think this might *help* my aluminum plant depending on the purity of some of the added copper nodes. It also changes my plans for my big motor factory in the Blue Crater but that may actually be simpler with the extra iron added.\n\nOverall I like these changes to the node distribution and it doesn't look *terrible* to fix at this point. The real question will be how all the recipes change my demand for resources and the overall plan.",
            "You can feed one resource into two different inputs, like:  A B A C",
            "I just leave the empty input.  But a couple of options:\n\nI can't remember if its the beam support or one of the pillar supports, but one of them is sized exactly right to use as a blanking-plate for the unused input.\n\nIf you're using a logistics floor to hide your belts then place the floor hole and the top half of the conveyor lift as if it had four inputs and leave the unused input out of sight under the floor.",
            "You leave one empty. But what you can do now is 2 in a subfloor and 1 on the ground floor.\n\nIf I have an empty entrance, I often connect a lift to it anyway.",
            "No 1.0 wont be on experimental thus isnt testable. If you are starting over then you dont need your old save unless you want to import later.",
            "I still thing GRassy Fields is ideal. In Tiers 1-2 all you need is iron (get the Iron Wire recipe. No Copper needed for wire and cable) and there is SOOOOOO MUCH of it.",
            "It's not like there's lots of place people build those anyway.\n\nAnd to be fair: my biggest powerplant is in the rocky dessert near the impure node. Overclocked mk3 miner - 300 Uranium per Minute, all processed into as many fuel rods as possible. Full recycling, no burning Plutonium. It's more than enough to power me through phase 4.",
            "I don't think it will work.  In the past it's been nodes that have moved, not deleted and a different node created  (I'm presuming they have some sort of internal ID).  I think miners might have some sort of real-time check on what they're connected to, that might be the explanation of some nodes producing the wrong resources from existing miners in early U8 releases.",
            "I suggest you spend your time developing a few neat and practical build styles. At least that's what I would focus on if I were to play again before 1.0. It's a pretty deep topic in the context of progression.",
            "They have sort of done it before.  Keeping beacons just for non-selectable recipes might be too much, but I believe that the package/unpackge recipes were orignaly refinery recipes (before the packager existed) and still works in old saves that already had packaging/unpackaging done that way.",
            "> So we can have backward compatibility.\n\nI general, stuff like that is so, so, so, so much work, for literally pretty much nothing. It's pretty much insane to build systems for all that abstraction if you're not even planning on breaking things all the time.",
            "There is a sulfur node being added and an impure uranium close enough both to drone. Add in the caternium as well in my case but completely doable and I almost have it setup  to dual source these materials.",
            "Interesting to note that he didn't mention any changes to the Train recipes, so it will be interesting to see how getting trains earlier will be a benefit.",
            "I didn’t use crystal beacons at all and I’m pretty happy right now as my impacts are pretty small even in the swamp.",
            "> but most nodes were just moved with no real reason.\n\nI doubt that. Most likely it was for looks and with how the game looks, that is a great reason in a game that looks as great as this one.\n\nThe fuel change is done so that you can easily use only one node instead of 2 nodes and still have enough power. And for those who want to use all the nodes, that is possible as well.\n\nI  hope that Geothermal is not just free power. That is my main issue with it. You connect it and done. Pretty boring, I think. That is the main reason I hardly ever use it.",
            "I am playing right now. Having a ton of fun. Not sure why I would not play and then not have fun.",
            "You dont need to finish it you can import your save into 1.0. I dont think they moving resources completely out of the area. If you are worried about failure you can isolate your power production and stockpile fuel.",
            "150 hours? That's like early tier 5 for me",
            "Why discouraged? I can say how I feel and what I do. I am way more than 150 hours in. If I would finished my game today, I would restart tomorrow. I have no idea if the game drops next week or end of December and I do not care.\n\nI like building, so I build. Just like I did with Lego as a kid where my mom told me to tear it all down before going to sleep. And the great thing was that I could start all over again the next day with new ideas.\n\nSo I will keep playing till the release. And perhaps even after the release on U8 and not yet start 1.0 yet. No idea yet.",
            "While i guess I see your point, what is the solution here? Not updating the game?",
            "I don't think it ever wasn't.  The idea was that your saves will function (as files that can be opened) but there was going to be enough changing that it's not a good idea.  Unless you really want to make your old save work.",
            "Oof. \n\nI've begun stockpiling various things now, though I can't imagine it'll take too, too long to reroute things, at least spaghetti-style, to at least keep stuff running. And I've doubled my Power Storages. Charging.....\n\nGiven how much they amped-up Fuel Generators, I don't know when I'll ever bring my nuclear power systems online. I've got up to 2400m³/min turbofuel capacity.",
            "Idk about everyone else but, I only have about 30,000 uranium rods stockpiled specifically for this. I can't just throw my 2000+ hour save down the drain. I will just use 4 to eight reactors in my reactor field to keep my power up around 25 to 50 GW. I have so much to reroute, but for the most part I should be fine. Depends if they are changing anything else. I will work with what I have. The save is from 2020 when I originally started it.",
            "Buddy of mine utilized the entire node and used the UFR alt that uses Beacons, so his setup is almost entirely dead. He'd have to cut production in half and thus he's getting half the power from all those nuclear power plants he spent time putting down. Real bummer.",
            "What's the one new node that's mostly hidden under the removed Titan Forest quartz nodes? Is that iron?",
            "I doubt it tbh. That was them moving nodes. This looks more like deleting old nodes and putting in new ones.",
            "If I were to restart it would be the desert. With nuclear up there now you can pretty much get everything between it and the swamp.",
            "The changes to Northern Forest pretty much kill my entire starter strategy/base building.   \n\nThat coal and quarts being removed will have a huge impact on my start game.",
            "They dont want significantly break big factories. I think they are still leaving nodes in a general area. So unless you are 100% using all of the nodes it will just be a matter of rebuilding your miners and conveyors. If you have a master bus then it doesnt matter where the nodes are tbh.",
            "The world grid didn't exist when the nodes were figured out, and what they've said in some videos indicates that there's some technical reason that makes it difficult to align the two sets of things.",
            "I feel like Rocky Desert was only really \"good\" due its to proximity to the western Northern Forest. It had plenty phase 1 stuff lying around (don't all the starting areas?), and then you head over to the Northern Forest area for all the rare resources clumped up in one spot.\n\nAlso, while it has good access to Caterium, it has limited access to Quartz. This historically hasn't mattered much as Caterium unlocked all your early game QoL stuff and Quartz wasn't very useful until later. However, one of the recent patches moved Blade Runners into the Quartz tree which was a big nerf to Rocky Desert as its local Quartz nodes are covered in giant spiders. Right now you can get around this by heading over to the Northern Forest Quartz nodes, but with those moved more east imo Rocky Desert is going to be pretty rough.\n\nI like the Coal nodes getting moved to the west coast, and I feel like that overall makes Rocky Desert more self-reliant rather than just being Northern Forest with extra steps. However, the barrier to Blade Runners is going to suck. If you're comfortable playing without Blade Runners (or fighting giant spiders very early on in the game) then the progression out of Rocky Desert works well. You can either go to the new west coast nodes or Crater Lakes for Coal and then either Islands or Spire Coast for Oil which gives nice options overall for expansion. Moving the gas mask to Mycelia will also help as there's some pretty big (albeit dangerous) areas covered in gas in Rocky Desert.\n\nWeirdly, Rocky Desert also has really easy access to SAM Ore which may or may not change in 1.0 and may or may not be relevant early in the game.\n\nAll that said, Grassy Plains actually got buffed a fair bit in all this. It's the only starting area with reasonable access to the Southern Forest which was now has actual nodes in it - rare ones at that. Easier access to Quartz and more overall Caterium and Sulfur. Going all the way to Blue Crater for Oil should be less of an irritation given there's more stuff along the way.",
            "It was very mid compared to either of the northern forest starting points, but it was still better than the other two.",
            "Northern forest was thrice as good.",
            "same. first new save in 4 years incoming. man... my boy has been through some updates and survived fine, only to get killed at the end.",
            "Achievements only works on fresh save. So 😅",
            "From the last time things got moved around, miners still mined even if the node wasn't there anymore. But who knows how things might work this time",
            "All hail the illusion of god",
            "Thank you <3",
            "So fuel generators will take 20 fuel or 7.5 turbofuel per minute, up from 12 and 4.5 respectively. Note to self: design modular generator setups for new values:\n\n1) Diluted Packaged Fuel: 3 generators per unpackager\n\n2) Diluted Fuel: 5 (or 2x250%) generators per blender\n\n3) Turbofuel: 1x250% generator per refinery\n\n4) Turbo Blend Fuel: 6 (or 3x200%) generators per blender",
            "same it sucks ass\n\nedit: it will still be my home i think but it's still a bummer",
            "I have similar feels but Uranium reduction and sulfur/caternium\n node removal means I will have to bring in resources for my Swamp based nuclear factory and energy hub.  \n\nAlready setup one delivery drone and think one of the new sulfur nodes can be double droned to get to 600ppm if I am lucky.",
            "I've honestly been expecting that spot to get nerfed heavily at some point. It's kind of *too* good - you have nearly everything right there at your fingertips, and in good quantities. You don't have to leave the area until, what, aluminum? Which kind of kills the exploration aspect of the game.\n\nIt being as good as it currently is also means it is objectively the best choice for starting location. Instead of each location having their own tradeoffs, you're left with the situation where if you don't pick Northern Forest, you're just slower and worse off.\n\nEven with the nerfs, it's still a good spot - it's the only one with oil right there, you just need to go a bit further away for some of the other resources. Like all the other starts do.",
            "I am glad you need fewer, unsure about more power for same amount of fuel, but we will see how it works out.",
            "Well, isn't that what Nuclear energy is for? \n\nAlso they could have increased fuel usage along with power generation, that way you still get the smaller footprint but it's not a huge buff.",
            "My oil power uses 2 pure nodes, 2 normal nodes (one of which actually produces some useful rubber and plastic with some fuel used for recycling) and one impure node.\n\nThat's such a tiny fraction of the available oil already.",
            "what do you mean \"progression instead of power\"? There's nothing uranium is used for outside of nuclear power.",
            "By the time I unlocked them in my game, I already had belts running to resources all over the map (as I made the mistake of starting my first game in the Grass Fields), so I sat there thinking, \"What's the point?\"  I'd have to clean up my existing belts and build trains, rail, and stations to do the same thing, or I could just leave things as they were.  I chose the latter, and then never bothered with trains for the entire game other than a single test track to see how they functioned.\n\nThis is in stark contrast this with other factory games I play, like Factorio, where I consider trains an absolutely essential part of that game.  From the moment I unlock them I start using them, and I feel the game would be severely limited without them.\n\nIn fairness to Satisfatory though, I haven't played it as much, as I've been waiting for 1.0.  I'm just glad to see when it does, they'll come along much earlier; hopefully before I cross half the map with a belt just to get quartz (though with the changes to resource nodes, it looks like I won't have to any more).",
            "> Place a MAM when you find a hard drive and run it. Remove the MAM. Go look for the next one.\n\nThis is what I was already doing, and it doesn't increase the throughput, which is one of the major problems.  You're still limited to one recipe unlock at a time, and it takes a long time to unlock each one.\n\nAnd going into AGS completely removes the mechanic.  I'd like there to still be unlocks, I just wish the current implementation was different.\n\nOr, even easier from a development perspective, keep the current mechanics and just tweak the numbers.  Drastically shorten the research time, and give us many more options to pick from when we do unlock a recipe.  While it wouldn't eliminate the RNG, it would make it far less likely for you to get screwed out getting one in particular you're looking for until very late game.",
            "I suppose? I just usually treat my fuel power in one of two ways: Something to do with the residual I can't otherwise use from plastic & rubber, or a dedicated setup for making power, in which case I'll take all I can get. \n\nIf you're making a very particularly balanced setup where you only need X power, and send the rest to make plastic/rubber/etc. I guess it's more resources, but I've never built a setup like that personally so it seemed weird.",
            "I guess it could mean that.  Snutt talking about removing/underclocking existing fuel generators would make more sense in that case.  I (and I think many people) interpreted it as the same amount of fuel per generator, in which case it'd just be a pure power boost and changing existing power plants would make no sense.\n\nI've posted [a question on the Q&A site](https://questions.satisfactorygame.com/post/666c99fc29261758fe96a80a) asking for clarification on this.",
            "Isn't that what balancing is? Nerfing and buffing stuff?",
            "It's not an excuse, it's literally what happened. Some things will be easier and some will be harder. Are you one of the types who think single player games should never be adjusted?",
            "The uranium node that I built my 1st nuclear plant on is getting downgraded. Time to get back to work.",
            "Also no release date, but we will be notified of the release well in advance. Which sounds like August at the earliest, probably even later",
            "> Changes will be factory-breaking. Probably best to start a new save.\n\n>f you want the full story, probably best to start a new save. Which you will probably be doing anyway because of all of the changes.\n\n\n\nI really wish people would stop repeating this. These changes aren't that big a deal for breaking things. It's just an echo chamber of \"restart restart restart we all like to restart all the time\".",
            "Mine too.  I built my first computer factory using both caterium alts right on top of the removed node on the west coast.",
            "That’s a huge balance change.",
            "Thank you!",
            "Depending on your play style, but yes, grassy field is a good place to start for a lot of people. If trains aren’t locked behind plastic anymore, it could be a much bigger deal. Because it used to be I always felt that start in the west north forest was so good because you could get up to oil right there without going anywhere",
            "It's missing quartz though. Don't need much of the stuff, but I'm absolutely unable to keep track of a factory without signs to label belts. Need to find a location with quartz and everything up until trains for my 1.0 start. Oh well, I'll just wait for a good updated map and all the recipe changes and then plan it out accordingly.",
            "If the game only had one recipe per item I'd be inclined to agree.  But the game already has multiple recipes per item because of the alternate recipe system.\n\nThere's also mechanisms in place for deciding that recipes can or can't be selected (whether or not an alt is unlocked, whether or not it's Ficsmas).\n\nIf the code architecture behind that is at all sensible then having the old recipes become a non-selectable alt that is only accessible when already set in a machine from an old save shouldn't be a that much trouble (apart from beacons, which make sense to clear out of the code completely).  I'm pretty sure they basically already have the needed systems (though I'd need to see the code to be sure, which is highly unlikely they'd let me do).  I wouldn't even be surprised if the old and new versions existed alongside each other in internal builds while testing the balancing of the changes.\n\nI'd agree that adding UI and settings to let us choose per save would require more work and new systems and therefore not be a good idea.\n\nRemoving the old recipes feels like more of a design/gameplay choice than a technical implementation one.  They've even kept an original recipe as a (selectable) alt in the past (\"classic battery\" was the original standard battery recipe).\n\nI'll actually be really surprised if we don't see a mod very soon after the 1.0 that replicates most of the existing versions of changed recipes (though unlike how CSS could probably implement it'd be more likely to need reselection of the recipes in existing machines).",
            "I would have guessed they changed them as well, as unlocking things always requires the resources to build them. But we don't know for sure yet, you're right.\n\nBut I'm willing to handcraft a dozen items to build a train. It's not like it's a huge amount of stuff for one train. Or set up one manufacturer hooked up to a couple containers temporarily",
            "He did mention trains and fuel gens no longer require heavy modular frames / computers... that by itself makes trains a lot easier to set up.",
            "Nether did I. But dropping the uranium node to impure and removing the one sulfur node and dropping the other sulfur node to impure does change the setup a lot in the swamp.\n\nI setup each power plant to be isolated and self \nReliant, so all local resources.  \nI will be able to fix it, it’s just going to be a grind.",
            "150 hours? I just put the HUB down.",
            "Of course not. It’s on me, I adapt. Just wanted to say my piece. Knowing how long till the release would be nice though.",
            "Yea. Every iteration has always had the 'best to start again' caveat. \n\nMoving to 1.0 doubly so.",
            "Oooh I see. I'm pretty new to the game and this was my first nuclear power plant, 30 reactors. \n\nI'm planning to wait until 1.0 releases to start a new save. I'm pretty accustomed to the mechanics now. 🤞",
            "My turbo blend plants each have that much and they are going to be toast. The sulfur is the main problem. I will get my nuclear grid back up a lot faster than the turbo fuel grid. I think it will have to carry for a while till I figure out what nodes I want to grab for the 2400 sulfur I need for them. The rest of the sulfur will be going to my future planned bauxite refining for batteries and instant scrap. So much sulfur movement :(",
            "I've already started doing the same, will be dismantling everything and creating a big network of train tracks across the map to a central location. \n\nGonna ready up for 1.0 release. Taking inspiration from everyone's suggestions and comments here. Thanks ![gif](emote|free_emotes_pack|grin)",
            "Oh my goodness ![gif](emote|free_emotes_pack|dizzy_face)",
            "Pretty sure that's a Caterium node since he said there were 3 of them there, but it could also be iron since i see two hidden nodes",
            "Yup. Nodes that just move position, are still the same ones and \"connected\" to your miner. However if a node is actually deleted, it won't give you any resources anymore, even if another node is added on that position.",
            "True, it is a bit of a different situation. \n\nI or someone might have to ask that question at the next Q&A. I could see them going either way. \n\n🤔\n\nOk thinking it over more, now I'm leaning toward them disabling the old nodes completely. Otherwise existing players could just leave their existing Miners active **and** get the resources from the new nodes. Guess I'll start stockpiling some things.\n\nFicsit *does* want you to be productive though, and the factory must grow. Ficsit surely doesn't care if you cheat a bit...",
            "Late game stuff doesn't really impact where I start.  It's too easy to get around once you have late game mobility and trains/drones.\n\nNorthern forest just has a ton of everything you need super close until late game.",
            "It was definitely too strong if you ask me.  I hadn't played in a bit and when my friend found the spot I thought he had mods or something I was thinking it was way too abundant with everything you need early and mid game but nope that spot is just crazy.  I still I think it will be a good starting location but just not op.",
            "Indeed. Restarting will feel like a new map as even my memory has a lot of the nodes “dialled in”.  Should make it more fun!",
            "Yeah, maybe the nodes they added are far enough away to be annoying.  They do appear to be down in the valley and that is a tall cliff.",
            "Pretty much everything removed was what ran all that I have built. Especially my power.\n\n\nSure, I can rebuild, but I have zero power to do so with. My save is probably doomed.",
            "The quartz node in the cave near the NW coast only has little spiders. It's blocked with boulders at one end but open at the eastern end. Running a rail down the narrow cave is a pain but it's doable.",
            "Just go south from rocky desert to get quartz in the cave. Spiders are not an issue in the open spaces of the cave. Are there any big spiders anyway? Or you can just build over the connecting cave. So you have to build a few stairs. Meh. You have to get up high eventually anyway.",
            "You can collect enough quartz from random crap on the ground between the normal iron trio and the pure Caterium to build blade runners. You can also chainsaw coral which is ten steps from the iron trio. No need to even touch the cave for blade runners. ",
            "Dunes north west oasis also looks buffed a bit to me. Which is odd because it was already one of the best starts (imo). Almost everything is nearby except oil and bauxite.",
            "I've tried all four starting options and always liked rocky desert the best. The combination of four pure Iron nodes plus the flat terrain at those makes it perfect for a starter factory, more copper isn't too far. Coal and oil (northern coast as well as gold coast) Arend that far off either, caterium is pretty close too. On top of that it is pretty peaceful, no too big beasts to fend off, so imo very nice for any starter game",
            "The issue was the northern forest was too good. Creatures are pretty mild, ore is amazing, and the building space restriction does little to offset the upsides. And with everything you need up through oil so close you can basically completely skip trucks with no difficulty.\n\nTrucks and coal in both the rocky desert and grasslands are now easier to setup. While northern forest is nerfed so you have a reason outside of aesthetics to use trucks.\n\nHonestly, good riddence. As quickly as I could progress in northern forest, it always felt hollow to me considering how I could just bootstrap through oil with no effort, even when I was a newer player. Having a computer factory be your first actual logistics challenge always felt like a huge difficulty wall. Good to pose some transportation challenges much earlier.",
            "I always started in northern forest, but have since been rocky desert and saving northern forest for a late game larger factory. I have quite enjoyed that approach actually.",
            "They have been warning for that for 4+ years, so there is that. ;-)",
            ">*So fuel generators will take 20 fuel or 7.5 turbofuel per minute, up from 12 and 4.5 respectively.*\n\n**CLARIFICATION**\n\n1. There have been NO CHANGES to Fuel Recipes (see link in comment above). The only change was to Power Output.\n2. NOW at 100% (not overclocked), instead of 12 m^(3)/min of Fuel for 150 MW of Power you used the SAME 12 m^(3)/min of Fuel for **250 MW of Power.**\n\nWith Clarity Comes Understanding. 😁",
            "Fundamentally it shouldn't be that big of a change, it just requires less resources to get the same amount of power. At that level, the only resource that isn't abundant to you is time, so it didn't make sense to require hundreds or thousands of them. This is a huge QOL change more than anything.",
            "I think tweaking the fuel recipes so you need less fuel generators per crude oil node would have been better.  I suspect many people don't set out to build xxMW of power, but rather to build as much power as they can from one or more oil nodes.\n\nThe change they've made might end up having zero impact on the amount of fuel generators in many oil power setups, but instead just make them produce more power making it less likely that people bother building nuclear because they already have sufficient power from oil.  (Edit: I'd easily have had a 20GW surplus instead of a slight deficient when I build my last phase 4 factory).\n\nEdit: I think burning turbo fuel at the same rate as normal fuel for higher power output would have been a better way of actually reducing the amount of fuel gens people build.",
            "Is it more power for the same amount of fuel? He specifically aid that you can delete some of your fuel gens, so that implies that the fuel:power ratio isn't changing and you'll just need fewer buildings.\n\nIf it's just reducing the number of buildings you need then it's a welcome change. Building massive fuel gen plots is really tedious and pretty necessary in every playthrough due to the long stretch between that and viable nuclear.",
            "Yeah, I was hoping for proportional fuel costs since usually you want to use all the fuel that comes with a full oil pipe, and if the costs don't increase, this doesn't change the amount of generators required.",
            "You’d think they would have nerfed fuel gens to make nuclear more appealing",
            "I needed 400 fuel generators to get *to* nuclear. If I wanted to use fuel gens for everything, I'd've needed like 2000",
            "Due to its waste mechanic, no. Not at all.\n\n\nMany players use uranium for progression instead of power. \n\n\nNuclear energy is not the sole expected next step in power progression, as alt recipe Turbo Fuel shows.\n\n\nBut the size of this dev intended alternative was too huge. So they shrank it.\n\n\nAlso helps players doing day 0 liquids learn a LOT easier without breaking their power budget.",
            "In both Factorio and Satisfactory I build belts only. Huge long belts all over the map.\n\nNot sure why but belts are so simple, don't require power, and go over infinite distance. The trains somehow requires thinking about figuring out stations and resource types",
            "What I do is get as many as possible, as soon as possible. That way I have more hard drives than recipes that are available. Say that there are 20 recipes in Tier s 1/2 (not sure the actual numbers) and I get 30 hard drives, I have still 10 left and no alts to select.",
            "There is a new node along the northern edge of the swamp. Insignificant distance at the point in the game where you are building nuclear.",
            "You can overclock the miner, unless you already did, lol",
            "Yeah, not sure what well in advance means, snutts time frames have been pretty vague in the dev stream, maybe intentionally, with 'a couple of weeks' doing some heavy lifting. But at the very least 2 or 3 weeks ahead I would say. I have some hope due to what he says at 1.06 about holding out 'a little bit more' about a release date. I agree August the earliest is reasonable. If a little bit more is a few weeks, a release date could be announced pre summer vacation, and the actual release would be in August, and I would still say that is well in advance.",
            "Possibly why some of the node changes are replacing pure nodes with more lower quality nodes.  Allowing 1200 out of pure nodes, but making pure nodes rarer would be one way to balance \"fixing\" the MK3 miner \"problem\".",
            "I did the Northern Forrest start once and I almost quit playing,  because I thought that needing to go somewhere and not getting a pure node was some sort of punishment. :-D Hated it.\n\nI like using the whole map. I like building.",
            "Tiers 1-2 I have not used signs at that moment.\n\nAnd in any case, there is no best. There is only a personal option. This play through I started in the Blue Crater District. Also great and a LOT of Mycelia and Silica for windows. Mycelia is great for automated Solid Biofuel.",
            "This game hasn’t had any major changes to recipes or node removal for over 3 years. I know you just got started, I hear ya. ",
            "Wow, good setup there. I'm about 1200hrs in, and I only ever built a 10-generator fully-overclocked nuclear setup, but I've only ever powered it up as a test. I like doing Turbo Blend Fuel better. :) Especially with the Diluted Fuel recipe, it's impressive how much power you can get out of even a single Mk2 pipe of oil.",
            "I recently finished getting my dual train tracks the rest of the way around the world. Took forever but I like to mold my tracks around the environment.",
            "That's not the way it worked before. The \"new\" nodes were really just the old nodes moved to a new location. You couldn't put a second miner on them because they were still tagged with being occupied.\n\n\nHere they're saying \"we're deleting nodes\" but there's still going to be a \"Node_Sulfur_003\" or whatever in the back end. So I'd expect *some* of them to really be moves and some to be new table entries.",
            "True but that first nuclear plant is BIG jump in power production. After I build my first one I didnt have to even think about power for a long time.",
            "I mean this hasnt happened yet. You can always move stuff before 1.0 comes out, but yeah might be worth starting over for 1.0.",
            "Build a couple of batteries now, fix things later.",
            "There are two Quartz nodes in the Rocky Desert. Both are in the same large room of a sprawling cave along with a SAM node and at least one giant spider. I don't remember exactly how many or what type (isn't there an elite gas stinger on the SAM node?) but there are definitely giant spiders in that room.\n\nMaybe you can ninja your way in through the northern passage and drop a miner without aggroing one? I wouldn't exactly call it a safe maneuver, and it definitely isn't something the average player will be able to replicate unless they've either been there before or are relying very heavily on meta-knowledge. Even if someone did organically find the northern tunnel from the outside, there's no way a player that curious is going to *not* walk into the giant spiders in the same room as the Quartz nodes.\n\nMaybe I'm misremembering - it has been a while since I've been there.",
            "It's also blocked with a wall of Reinforced Windows. ;)",
            "I agree that will probably be the easiest way to get Quartz from Rocky Desert. Iirc the connecting cave only has small spiders in it, but I think it was blocked off by rocks which does push that expedition back by a bit. Going over the top is possible but also not something I'd really recommend early on as that route is very distinctly unsafe. Lack of Jetpack aside, that particular stretch of verticality takes you past some unfriendly critters (including at least one giant spider).\n\nThat said, you can simply loop around through the Islands to get to that Quartz with basically zero hassle or risk. It's just a rather long walk which is acutely painful given long walks are precisely what Blade Runners are good for.",
            "Ive been in denial lol",
            "I was assuming that fuel and turbofuel have the same energy values (750 and 2000 MJ/m^3 respectively), so the increased output would require increased consumption.",
            "Do you have a source for this? The phrasing in the video is ambiguous because he then goes on to talk about how you can delete or underclock some of your fuel generators which makes no sense if they're using the same amount of fuel *per generator* rather than the same amount of fuel *per power unit*.\n\nI'm not saying you're right or wrong, I'm just curious if there's a source clarifying what he meant.",
            "Yes and no. I suspect that a lot of people will max out a single node first, or calculate how much that gets them, then after they run out of power with that build another. This probably doesn't change the size of that first 'big' plant. But it will/should reduce the need to build a second larger one.",
            "I max out each node, but choose how many nodes to tap based on my power needs.\n\nTbh, my “power towers” of generators were pretty tedious to build and I’m glad I won’t have to do that again.",
            "I got that impression, at 1030 he says it will produce 250 instead of 150. \"While requiring the same amount of fuel \". This can be both same per minute as before or same per power, but I think the first is a better fit to what was said.",
            "I guess it could mean that.  Snutt talking about removing/underclocking existing fuel generators would make more sense in that case.  I (and I think many people) interpreted it as the same amount of fuel per generator, in which case it'd just be a pure power boost and changing existing power plants would make no sense.\n\nI've posted [a question on the Q&A site](https://questions.satisfactorygame.com/post/666c99fc29261758fe96a80a) asking for clarification on this.",
            "I believe he said that the fuel requirement doesn't change, just the output. His comment about deleting some fuel gens was strictly regarding power needs, which doesn't sound like something I would do...",
            "Instead of two fuel nodes, you only need one. Or a normal node instead of a pure one and get the dame amount of power with way less machines.",
            "400 fuel generators??? Wtf? Last factory I built nuclear I had like 16 fuel generators. Plus some coal and geothermal.",
            "That's because you build massive factories for everything. That's a choice, not a game dictated requirement. \n\nIf you combine 40 fuel generators, a bunch of geothermal stations and around 40 coal plants, you can definitely reach nuclear. But it's not a playstyle people prefer.",
            "You're honestly a major outlier and probably not the best to judge balance changes",
            "No, you do not need that amount. What you could do is build in stages. And let each stage fill while you build it and then turn on the generators one by one.\n\nThat said, I have way more than that, but not because I NEED it, but because I WANT it.",
            "To each his own I guess. You can also make a nuclear setup that processes the waste and sinks it. It's complicated but that's the point of the game.",
            "I only have two nuclear generators, one one running at the moment. I am still very much a novice.",
            "In the past the release dates where often very vague and they often said In month X 1 month in advance. But even then the date was not set. They have said they had release dates announced on a stream that was decided that day or the day before.\n\nAs they are gone in August, I will believe info in September and release in October.",
            "Maybe. Either way it makes it hard to plan without the answer.",
            "I feel like if that's the idea it's not a great one because most people probably don't reach the Mk3 Miner point of the game. It's making the mid game harder for a late game balance choice that doesn't really need to happen.",
            "Hehe to each their own, I liked the compactness",
            "Tier 2 does, the awesome shop is in tier 2. And getting there is fairly trivial. Of course you need to somehow generate the coupons, but that's not really an issue - a few DNA capsules and you're basically there.",
            "True that ! I’m still phase four away from completing the game. I'm gonna keep that for 1.0 so that my passion lives on, hehe. ![gif](emote|free_emotes_pack|grin)",
            "About oil, I've around 30 of them too! My hub and central position is in the Rocky desert biome and there's like two normal and one pure oil nodes right by the beach area where the cliffs start. I loved the initial power boost they provided, but I'm a lil lazy to get them alt recipes, so yeah, I'll need to explore them a lot! ![gif](emote|free_emotes_pack|give_upvote)![gif](emote|free_emotes_pack|grin)",
            "Ok, good to know. 👍 Thank you.",
            "Yeah I made an oversize one for shits'n'gigawatts but it's a comical amount of overkill. I went from 26GW to like 675 lmao",
            "There's a single medium-sized spider in that room, and I think a second one by the purple slug in the gas pillars (which new players would have no business being in unless they already understand just how much they can do before succumbing to the poison).\n\nThere are two northern tunnels and an eastern tunnel, all of which have power slugs in their entrances. If a player does find the big spider, that should tell them to come back with better weapons (see: rebar gun, xeno-basher). And that's fine, because quartz isn't really that useful in phase 1 anyway (except the Blade Runners research, which is totally doable from just scattered quartz rocks).",
            "The cave going from the Rocky Desert to the Western Dune Forest doesn't have any rocks that need destroying.",
            "That was my assumption. Snutt mentioned that anyone needing to adjust an existing factory for this could do so by underclocking.\n\nThat makes perfect sense if both the power output *and* consumption have changed; turn the machines down from 250 to 150 and your fuel plant works the same as always.\n\nBut if the consumption stayed the same but the output was better, why would you bother? It'd just be free power.",
            "**MORE INFO**\n\n1. Snutt stated [here](https://youtu.be/fkzumQ1A9Ms?t=629) *(Video Bookmark)* the Power Output change from 150 MW to 250 MW, **while still requiring the SAME AMOUNTS of all types of Fuel.**\n2. Snutt goes on to say the purpose is that *this change will save space as you need LESS Fuel Generators to produces the SAME amount of Power.*\n   * This is the same as if right now you used Power Shards, only in Version 1.0, the Power Shards won't be needed.\n3. Snutt goes on to say [here](https://youtu.be/fkzumQ1A9Ms?t=645) *(Video Bookmark)* that if using an Update 8 Game Save in Version 1.0 you can, if desired, remove un-wanted / un-needed Fuel Generators OR underclock them to return your Power Generation back to what it was prior to Version 1.0.\n4. This change was to made so the use of Fuel Generators wasn't completly overshadowed by the use of Nuclear Power later on.\n\nWith More Clarity Comes Better Understanding. 😁",
            "With the use of Diluted Packaged Fuel and Heavy Oil Residue alt recipes it is currently possible to get 10GW out of a single normal node at 250% (300 crude oil per minute, making 800 fuel per minute, which can power 64 generators.)  With the buff to generators that's now 16.666GW from that same node with the same amount of generators.  I've never done the calculations on Turbofuel with that, but that alone is enough to power a decent sized factory.",
            "It might mean I'd go for a small turbo-fuel setup next time (just to complete the MAM), rather than an overclocked pure node like I did this time.  Just between my diluted fuel setup and my turbo fuel setup I'd be gaining over 30GW (more counting my smaller, less efficient oil setups).\n\nOther than my smallish nuclear setup I always took the approach of building the best I could at the time from either a node (oil) or group of nodes (the coal hole).  My only repeat design was of the 8/3 coal setup, every single oil power plant was always about producing the fuel a better way or doing turbo-fuel, not just more power.",
            "I only ever maxed one mode at a time.  Between ever improving ways of making fuel and then turbofuel I didn't build the same oil.power plant twice before finally doing nuclear just before my  ast phase 4 factory.",
            "It's not about the power, it's about what you can do with a 600 oil pipe. Sure you're getting more power but the number of generators doesn't change, and that's the problem.",
            "You got to nuclear with 16 fuel generators?!\n\nHow much coal and geothermal were you using?",
            "I only needed 100 coal gens to reach fuel so I'd still say the fuel gens were too weak. Though what I'd've done is double both the power production and fuel consumption. Honestly do not mind the amount of energy fuel currently contains\n\nEdit: also, the geometric mean of 75 and 2500 is 433. If fuel gena generated 433 MW, they'd be 5.8x more powerful than coal gen, and nuclear gens would be 5.8x more powerful on top of that\n\nBut if you do the same thing but with power generation per 1 m^(2) taken up by the generator, it comes out to 273 MW being halfway between coal and nuclear. This is almost exactly halfway between where I'd've put them and where the devs decided to put it.",
            "??? I built 3 separate fuel plants, 100, 100 and 200 generators each. I built one whenever I didn't have enough power to turn on the next factory. When I turned on my nuclear plant, my 1200 power storages drained to 70% before the plant could support itself. If I didn't use storage, I'd've needed 700 fuel gens.\n\nBut you're right, I didn't *need* them. All of my factories are constantly running, because I'm always sinking all overflow. I could've run it all off less than 50 fuel generators and used 4000 power storage to turn on the nuclear plang. But is that the point?",
            "Sweden usually have their main vacation period in July.",
            "There are some really nice alternates. A few alts are virtually useless, like Charcoal and Biocoal. And then there's ones like Diluted Fuel and Iron Wire: Turn oil+water into fuel, and turn cheap iron into wire.",
            "I agree with your interpretation, but still, \"the same amount of fuel\" can mean \"same amount per MW produced\" or \"same amount per time\" and both would need less generators for the same amount of power. As said, I also think he means same amount of per time. but there is some ambiguity.",
            "So... no, you don't have another source. I also watched the video.\n\nI believe the video is unclear because almost nobody who plays this game would go out of their way to delete or underclock fuel generators that are still in use. People would only do that if they're no longer needed, i.e., the generators require the same amount of fuel *per power generated* and thereby consume more fuel in proportion to their increased power output. This would make the extra generators genuinely useless as they wouldn't be running any more.\n\nI really appreciate what you do for the community, but I disagree that the video clarifies this point.",
            "Depends on your definition of \"decent\".\n\nMy Turbofuel plant uses two pure nodes for 1200 Crude and 2666.66 turbofuel. 592 generators for 88,800 MW. On top of the 10,000 MW in my separate 'starter' coal grid, and my WIP max Nuclear plant.",
            "I do not see that as a problem. You can now way easier use a normal node instead of a pure one. Or only 1 node instead of 2. And for those who want, there is still the option of build a lot.",
            "> I only needed 100 coal gens to reach fuel\n\nThat's \"only\" to you?  For me it was 40 and I think the last 8 might just have been because I forgot to take a power line with me when looking for oil.  If I'd done that I might have reach fuel power from the 32 generators using the 4 nodes in the \"coal hole\".",
            "In a way for me starting my nuclear setup from power storage (built explicitly for that purpose and charged using nearby geothermal while I built the nuclear parts) was exactly the point.   If I'd built more non-nuclear power production to start up my nuclear I'd have met my remaining power needs (which were fairly low) without needing the nuclear plant.",
            "Why did you turn it on all at once? Do it in stages. What I did was build everything (except the nuclear stuff). Each time I turned something and I got the backlog. So now I have a complete nuclear production with everything, except uranium. And all the machines are running idle, because everything is filled 100%.\n\nThe nuclear inputs was used with a manifold, but with smart splitter at the manufacturer. Say I have 100 manufacturers, I would set the output of the Uranium to e.g. 5% of what I actually will run at the end.  5 manufacturers will start producing, because there is no overflow from the manifold. And all the rest will do nothing. The reactors also are set up with smart splitters. No power fluctuations because they suddenly have nothing and suddenly all get one. So only 5% will be running, but that adds already a LOT  more power.\n\nNext I can do e.g 25% and then 100%. Or I start with 1% and build up from there. You can set it up that you start with enough for only 1. Then 4, 16, 64, 256, ....\n\nNo power storage needed. No extreme extra power needed. Just a bit of planning and I think that is part of the game.",
            "Ah, I though it was august.",
            "The changes are great either way, I'm just pointing out that it's frustrating to build hundreds of generators.",
            "Well, 100 is \"only\" when compared 400",
            "And the fun part is now you can build less for the same power."
        ]
    },
    "there are plastics in my balls": {
        "title": "there are plastics in my balls",
        "score": 880,
        "url": "https://i.redd.it/usgqfem5oz7d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Alternate version: We're in a Recycled Rubber.",
            "Lmao that's a solid meme",
            "[https://www.popsci.com/science/microplastics-testicles/](https://www.popsci.com/science/microplastics-testicles/)",
            "I thought I was in r/programmingmemes for second there. That looked a lot like a NAS lol",
            "Breaking news there is now microplastics in your benis",
            "Steel coated plates are unironically really good",
            "lmao",
            "Wait, what is this recipe used for ?",
            "Awesome sink",
            "<claps for the double entendre>",
            "Ah yes, a possibly permenant and extremely detrimental problem being (mostly) covered up by large companies just because they could lose profits over it. Who could have seen that coming.",
            "Industrial storage container / my inventory",
            "No this is ludicrous, everything Ficsit does is for the benefit of humankind. Now get back to work, pioneer.",
            "They should make a game about this"
        ]
    },
    "A workspace with a view.": {
        "title": "A workspace with a view.",
        "score": 285,
        "url": "https://www.reddit.com/gallery/1dleq1t",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Thats really cool and a unique way to change up the building",
            "No mods. Just a bit of nudging. And on top just some flat walkways and then the catwalk railing. And yes, you can paint the storage boxes.\n\nYou can also set it 40cm or 50cm into the floor to get a better entrance.",
            "People don’t really talk about it- but I always try to setup my home base/ mall in a spot with a view. I don’t just want to be in the middle of a field or desert, I want to be in front of a waterfall or on a hill.",
            "I LOVE IT!",
            "I love that. Super creative",
            "I've been thinking about making something similar that includes a craft bench and a MAM for my remote locations.",
            "I was amazed it fit so well. It just needs the nudging. Now I know this. I am going to do it a lot more. What I like most is that what I normally use as the from (The open space) is really the back now.",
            "Wait, you can use nudging when placing the workshop? _mind blown_",
            "My HIB is in a cave, but my storage is somewhere completely different.",
            "Thanks.",
            "Thanks,",
            "Yes, I sometimes do that as well, and also the Awesome Shop. Just a bit of everything.",
            "You can nudge almost anything. Don't forget the CTRL for 50CM nudges.",
            ">Don't forget the CTRL for 50CM nudges.\n\nWHAT",
            " Don't forget the CTRL for 50CM nudges."
        ]
    },
    "Just started, what do you think": {
        "title": "Just started, what do you think",
        "score": 45,
        "url": "https://www.reddit.com/gallery/1dlogeo",
        "content": "Just started a few hours ago and these are my very first limestone and iron automations, i don’t  know how to automate reinforced steel plates or how to beat the game but is there anything i should improve on?",
        "num_comments": 29,
        "comments": [
            "Looks neat gl to ur adventure",
            "I think you should take pictures with pressing P:\n\nThere is an in-game photo mode (Press P) which places screenshots in the following folder by default: “Documents\\My Games\\FactoryGame\\Screenshots”. If unable to use Photo Mode you can also take a screenshot, use the Windows or Mac snipping tool or other programs to take screenshots.",
            "I think you need to learn how to take a screenshot.",
            "The factory must grow, COMPLY.",
            "It's awesome ! \n\nMost important = have fun building your factory ![gif](emote|free_emotes_pack|flip_out)![gif](emote|free_emotes_pack|give_upvote)",
            "I think you just started.",
            "Just build however you like to achieve the next tier objectives, there's so much to unlock that you'll feel like you'll have to redo your factory over and over so don't spend hours with the fine details. Just start a new factory for every material while leaving the others to stock up materials",
            "How does the ramps hold? Fix pls",
            "It's a start 🙂\n\nYour use of foundations is great, start using walls (minimum of two high) so you can build vertically \n\nThe sky is the limit, literally",
            "Build on foundation, no belt clipping/spaghetti, very good.\n\nReinforced iron plate requires Asembler to be built for automation.",
            "I think I need a holiday.  \nI thought the belt with the screws on was a waterslide.",
            "I remember my first factory I didn’t even bother with foundations… I had no clue what I was doing",
            "It looks far too organised.",
            "Be ready for more throughput for your screws. You'll need it. More than you can imagine",
            "you are using foundations, which is already better than 70% of beginners",
            "Thx but also what is the end of satisfactory",
            "Space elevator pt 4",
            "Don't forget to have Excel open on your second monitor 🙃",
            "Does that take a while to achieve or?",
            "Sooo a couple hundred hours ![gif](emote|free_emotes_pack|grin)",
            "It's embarrassing I never thought of this. I've been drawing flow charts with pretty coloured pens. 😹",
            "![gif](emote|free_emotes_pack|trollface)",
            "Dunno, never got that far. 🤣\n\nConstantly restarting. \n\nAlso, if you don't know 1.0 is about to come out so you should just get good with everything now and probably restart when it launches.",
            "For most folks on this subreddit the goal of satisfactory is having fun and enjoying the building, the math, the architecture design. \n\nThink more like Minecraft. Can you beat Minecraft? Yeah, there's a boss. You can see end game credits. But it's about more than that. Exploring, building, crafting. \n\nEnjoy the game. Take your time. One hub phase at a time.",
            "Nobody wants to scare you away from the game but I'm going to be honest with you, the production and logistics requirements will increase exponentially with every phase of \"Project Assembly\" \n\n\n\nPhase 1 is a nothingburger.\n\nPhase 2 introduces assembly, and you'll need to consider getting coal power to automate and increase your power generating capacity.\n\nPhase 3 introduces refining and manufacturing; you'll need to consider expanding your logistics to more corners of the map and linking it up. You'll also need to consider \"future proofing\" your power grid by tapping into oil for the use of fuel generators. \n\n\n\nPhase 4 is currently the \"end game\". That is where I am now after well North of 100hrs play time. It does feel overwhelming so best just take things slowly and set your own limits. I am considering just making smaller, modular design factories wherever the nodes are all across the map, and just connecting it with a rail network. At some point, I will also get into nuclear power, which presumably creates a biblical gigaton of nuclear waste management that I'm looking forward to solving once I get there.",
            "Most people don't get to tier 8, it's a grind. The game is fun at all stages of progression. Most casual tier 8 playthroughs are over 100 hours.",
            "The first 3 levels simple HA HA I'm working on stage 4 and all I can say is start MASS PRODUCING even the most basic of items like MASS PRODUCE BIG TIME!\n\nOne item you will want to upgrade first is your belts try and get those to level 5 as fast as possible as the speed increase drastically as they get higher!",
            "A long while yes",
            "Oh man, I go ham in excel for satisfactory."
        ]
    }
}