{
    "Non-PL Daily Discussion": {
        "title": "Non-PL Daily Discussion",
        "score": 11,
        "url": "https://www.reddit.com/r/soccer/comments/1dlqmb1/nonpl_daily_discussion/",
        "content": "A place to discuss everything except the English Premier League.",
        "num_comments": 11,
        "comments": [
            "We've stolen another player off Kings Lynn, prompting a further twitter meltdown from their chairman. \n\nStarting to have slight concerns about the profile of our squad, our transfer strategy has pretty much entirely been taking a punt on players who've played well in lower leagues and/or played for our gaffer at Kings Lynn. I can see what the thinking is, especially given the success we had with Stokes, but my worry would be if you sign all your players from leagues below then you end up with a squad that's lower league quality across the board if none of them step up.\n\nRowe, Harries and O'Keefe have all left and while none of them were particularly good they made up like 90% of the experience in our squad between them so we could do with getting someone with some nous in. Given the money we made on Stokes and the cup last year we should have the cash to bring in one older player on a higher wage but our board have been notoriously stingy recently.\n\nCurrently also waiting on whether Glover and Tetek sign new deals. Both would be big losses if they don't because Glover was at times our best player last season and Tetek for the handful of games he was fit for was by far our best midfielder.",
            "Could anyone from Norway tell me what's wrong with Aalesund?\n\nThey've been doing just fine in the top tier for as long as I can remember... After the relegation they are doing terrible in second tier now as well. I see they just fired the manager. Their squad doesn't look that bad either for this level. Is it just an unlucky start and managerial issues? Or do they have financial problems?",
            "I don’t get the Olise transfer. Bayern and have 3 players now that want the ball at their feet. They need outlets. Should have signed someone like Neto instead.",
            "How do you get a flair?",
            "PT Liga Indonesia is a joke",
            "France - NL really made it clear to me that something needs to change. It's a travesty that games of this caliber can be this atrociously boring and bad just because they both are fine with 0-0.",
            "I think it’s in the sidebar, or you can mail the moderator",
            "really an exaggeration. The Netherlands could've won with the offside goal, France could've won with Griezmann's chances - and they're missing Mbappé, and they've only scored 1 (OG) in two games anyways. I've seen worse games too.",
            "You will always have these type of games with a group stage. If it was the last game and they were tied then they would probably go for it but as the 2nd game both tied with 3pts and Austria winning, not losing is more important than winning for both teams.",
            "16 shots, two gigantic occasions that should have never been missed...\n\nDo not mistake our abysmal finishing for a lack of drive to win the game. We absolutely played for the 3 pts but didn't rise up to the occasion.",
            "Holland scored a legit goal that was taken away from them and it killed their momentum so they decided to take their point and move along. Perfectly valid"
        ]
    },
    "Daily Discussion": {
        "title": "Daily Discussion",
        "score": 23,
        "url": "https://www.reddit.com/r/soccer/comments/1dlaasj/daily_discussion/",
        "content": "##Welcome to the r/soccer Daily Discussion! \n  \n###✔️ This is a thread for:  \n  \n* Discussion points that aren't worthy of their own thread.   \n* Asking small questions about football to the community.\n* if you're new to the subreddit, remember to get your **team crest** [here](https://www.reddit.com/r/soccer/wiki/set_flair) and to [read our rules and submission guidelines](/r/soccer/wiki/rules#wiki_community_rules)! \n \n---- \n    \n###❌ This is **not** a thread for:  \n  \n* Comments that aren't related to football.  \n* Trolling or baiting other users or fanbases.  \n* Comments about an ongoing game better suited for the Match Thread.   \n* Shitposting, brigading or excessive meta discussion.      \n* Any other kind of toxic or unreasonable behaviour.     \n   \nThe moderation team will **remove** comments that violate those rules and **ban** persistent offenders.   \n  \nPlease report comments you think that break such rules, but more than anything else, **remember the human**. The Internet is full of places to discuss football in bad faith. This community tries to be an exception.  \n  \n----  \n  \n###⚽ Can't find a Match Thread?  \n  \n* If you are using Old Reddit [click this link](https://old.reddit.com/r/soccer/search?q=flair%3Amatch%2Bthread+AND+NOT+flair%3Apost+AND+NOT+flair%3Apre&restrict_sr=on&sort=new&t=day#res-hide-options).  \n* If you are using New Reddit you need to try [this other one.](https://new.reddit.com/r/soccer/search/?q=match%20thread&restrict_sr=1&sr_nsfw=&sort=new)  \n* If you are using the official app [press here](https://new.reddit.com/r/soccer/search/?q=match%20thread&restrict_sr=1&sr_nsfw=&sort=new) and sort by \"new\".  \n* If you' areusing a third-party app... ¯\\\\_(ツ)_/¯\n  \nIf there's no Match Thread for the match you're watching you can:    \n\n* [Create one](https://www.reddit.com/r/soccer/wiki/matchthreads) yourself.    \n* Ask /u/MatchThreadder for one. You just need to send a PM to him with the subject \"Match Thread\" and the body \"Team A vs Team B\" (for example, \"Inter Milan vs. Udinese\") to get one from this great bot 🤖   \n\n----  \n\n###🔗 Other useful quick links:  \n  \n⭐ [**Star Posts**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3A%E2%AD%90%2BStar%2BPost): the original content by those users that give their best to our community.   \n\n📺 [**What to Watch**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3A%F0%9F%93%BAWhat%2Bto%2BWatch): quick but extremely-useful guides of next matches.     \n\n🌍 [**Non-PL Daily Discussion**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3A%F0%9F%8C%8D%F0%9F%8C%8E%2BWorld%2BFootball%2B): for small discussions and questions about everything but the English Premier League.     \n\n📜 [**Serious Discussion**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3ASerious): for high-quality discussion threads about certain topics.   \n\n👩 [**Women's Football**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3AWomens%2BFootball): for women's football content.    \n  \n\n📧 [**Ping Groups**](https://www.reddit.com/r/soccer/wiki/userpinger/documentation): Join a ping group, our new system to find the content you want to see!  ([Explanation here](https://www.reddit.com/r/soccer/comments/u8qwe8/user_ping_groups_introducing_a_new_system_to_find/))\n\n\n----\n\n*This thread is posted every 23 hours to give it a different start time each day.*",
        "num_comments": 1222,
        "comments": [
            "just found out that Spain has a kid who is just 16\n\nCan anybody confirm this?",
            "The top comment in the Austria Poland post match thread is about England and Southgate 💀",
            "So jealous of multiple teams at the tournament with actual good coaching.",
            "Poland probably go under the radar as a massively underachieving football nation. Big population, crazy about football, have had some decent players, but they are just consistently shit.",
            "Best thing about the euros? The countries flairs. Now everytime i see an England flag i can scroll down, happy i spared my mind from another Southgate rant",
            "It's one thing England stinking up the place, it's another going into every post-match thread (even the Argentina v Canada one) and seeing comments to the effect of \"somebody should tell Gareth this is how you play football!\" all over the shop. Main character syndrome.",
            "France rlly have 4 points without scoring a single goal",
            "Was trying to get my dad into football for the first time after the 2010 world Cup and this is the match I chose. Wallahi he's never watching football again😭😭",
            "It’s really heartwarming to see N’Golo Kante waltz back into this French midfield ahead of younger players at Champions League clubs and boss it like he never left. This is what makes international football so captivating to me; the dynamics are so different that players who don’t play at a high level for their club can still be deemed so important to their countries, and deservingly so when you watch them live up to that on the pitch.",
            "Do people really feel bad for footballers tied into £100k a week contracts who want moves elsewhere",
            "I’ve been in a mental health / addiction group program for a year now and have seen people come and go. New guy showed up this week and near the end of today he said hi asked if I like soccer since I had USMNT jersey. I said yes and he then said do you know DC United, I said yes and then he said he was Freddy Adu’s high school gym teacher. He talked about how one day he suddenly left because he was gonna be selected in the MLS draft lol\n\nVery sweet guy as well it was great talking to him about Adu and DC United",
            "I just know Griezmann & Depay are gonna go stroke for stroke tonight",
            "Rumor has it on twitter that Conmebol massively overpriced tickets for the US Bolivia game and are now giving away a bunch of free tickets to FC Dallas season ticket holders and other groups around Dallas so that the stadium isn't mostly empty. Just rumors but it seems plausible to me that Conmebol would overestimate how much people are willing to pay.",
            "Southgates basically looked at this group of players and decided, lets play to all of their weaknesses and negate their strengths.\n\nKane, we are going to give you 0 runners behind and instead have 2 players including the lw to roam into the exact spaces you like receiving the ball and turning in. \n\nBellingham/foden we are going to make you both crowd each other out on the ball along with kane so no one can recieve with space and players ahead of them and their isnt a consistent overlap on the left. \n\nSaka we are just going to keep giving you the ball facing your own goal because sadly we have 4 right footers on the back line and no one holding width on the left, so the balls going to flow directly to your feet over and over again with no room to turn. \n\nTrent, your biggest weakness is receiving the ball facing your own goal, so instead of either pushing you higher to reduce those moments and bringing bellingham deep in buildup, we are just going to keep giving you the ball facing your own goal, oh and you dont get a lw to hit your patent cross field switch too either. Oh and dont bother asking to play in the position you do at your club…\n\nRice, your biggest weakness is hitting line breakers in buildup, so we are just going to have 3 attacking players on the left all crowd each other out with no runners in behind to atleast stretch the pitch so its even harder for you to hit line breakers. Oh and good luck defending midfield on your own buddy, we saw you carrying jorghino so lets keep that going. \n\nMy heads gone man 😂",
            "Feeling like the restaurant inspector guy from Ratatouille watching Piatek score today, I have remembered memories I didn’t know I even had\n\nNever leave us again pistolero ",
            "Kinda feel for Kalvan Phillips.  I'm sure his heart was initially warmed after Southgates comments, then he must be feeling sick with the massive backlash the comments are getting.",
            "Fucking hate Jenas, such a wank commentator",
            "Tomorrow is the last day we'll have a 15:00 Euro game",
            "Lautaro is six goals off surpassing Higuain's tally for the national team.",
            "this Perú chile snooze fest is making me wish conmebol actually rigged the draws and moved this to the last match day so I didn’t have to watch it ",
            "Not starting Conceição and benching Bernardo is just delaying the inevitable. This change alone would make Portugal 2x more threatening. Bring on Bernardo when it’s necessary to hold on to a lead and conserve possession, otherwise it’s a waste of time.\n\nLeão is frustrating and his form is binary and random, but he’s bound to have his moments. It’s worth being patient with him.",
            "Goodbye 2pm kick offs :( we will miss you",
            "LinkedIn has sent me another recommendation to follow Adam Lallana. Why? Why does LinkedIn think I want to follow Lallana of all players. Why is Lallana even on LinkedIn?",
            "People keep calling some of these Euro matches boring but I've found all of them pretty entertaining. Anyone else enjoy all of the matches so far or am I blinded by my love for competitive international tournaments?",
            "Simmons look like he’s always ready to cry, but his face look like the predator from those movies. Very odd.",
            "Depay and his headband getting absolutely slaughtered on the timeline",
            "Just saw someone say England's £500m midfield got outclassed by a guy who died last tournament💀💀",
            "Rabiot Thuram Dembele front 3 ……\n\nIf Holland are serious they don’t concede",
            "Another day, another chance for r/soccer to prove they dont know the offside rule.",
            "It was an offside according to the rules. Stop crying. He could have hit the top corner it would still be offside.",
            "so surprised by all the comments complaining about the penalty. You could argue it was soft, but it was a textbook penalty. Doesn't matter if the GK hits the attacker with his face, arm or leg.",
            "I was so wrong about Dembele. I thought he’d easily be a top 5 player in the world in his prime back in 2016. Lightning fast, great dribbler, amazing close control, decent eye for a pass, and as two footed as they come. Even if he wasn’t too clinical with his striking, he could still generate power will both feet easily.\n\nThought he’d add more end product later into his career like most young wide forwards but he’s actually regressed in that regard.",
            "Hansa Rostock who are notoriously right wing and have a large violent contingent of ultras sheltered by the club are [playing Lazio to celebrate the 70th anniversary of the Ostseestadion. ](https://www.fc-hansa.de/assets/images/0/20240620_Lazio-Testspiel_Ank%C3%BCndigung_HP_quer-7daf6b8c.jpg)\n\nI know not all Lazio or Rostock fans are right wing, but both clubs know exactly what they're doing here.",
            "When did people start calling Xavi Simons “Xavi”? Have people forgotten one of the best midfielders of all time already? Needs to do wayyyy more to earn that abbreviation",
            "Theother14 is such a funny subreddit. 14 of the richest clubs on the planet (2 of them with the 1st and 4th richest owners in the PL) crying about how they're actually very hard done by. \n\nSaid it before and I'l say it again. They don't hate the concept of the Big 6, they just hate that they're not part of it. If any of those clubs got a revenue boost started getting regular CL football, 98% of their fans would stop giving a shit about the others.",
            "2 games in and we have yet to see a French player score a goal\n\nBoth teams played to avoid a loss gosh that was dreadful they're both fraudulent countries",
            "Anyone else with a perfect viewing record for the Euros? Not a single match missed here 💪",
            "I hope Southgate is pulling some big brain 36d chess and is lulling Europe into a false sense of security before we unleash true vindaloo-ball in our first knockout game (if we don’t bottle it against Slovenia)",
            "Ousmane Dembele is genuinely the most useless player I’ve seen regularly feature on top class teams. Hes just runs fast and provides basically nothing else. \n\nCan someone tell me what I’m not getting here",
            "I’m envious of Europeans who don’t have to be around for DD After Dark. Some of the dumbest shit there.",
            "It already showed against Austria, it showed again today. For a team as stacked as France, they're criminally harmless in front of the goal. If they fix that, they're instant favourites to win the tournament, but if not, they'll have trouble passing the RO16. Given the quality they have at hand, it's crazy how dependent they're on Mbappe scoring.",
            "Do fellow members of relatively smaller European footballing nations like me (Ireland), like the 24 team Euro format? People say that there is less at stake in these group stages, but most of the smaller teams need to go hard in every game in order not to come last. Plus the mere fact of us getting to the competition is enough. So what if it's a bit easier to qualify, I don't care, I just want to be partying on the streets of a foreign city like the Scots. I think the Euros should be looked at an inclusive tournament that brings the continent together for football, with smaller nations getting their chance in the sun alongside the usual favourites. And best of all is when an upset occurs and a big boy gets sent packing.",
            "Did Brereton Diaz finally learn Spanish?",
            "The 2024 OFC Men’s National Cup is being shown for free on the FIFA+ website.\n\nThis is the continental tournament for the OFC (Oceania).\n\nUpcoming matches:\n\n- Samoa vs Papua New Guinea (12AM Eastern Standard Time)\n\n- Fiji vs Tahiti (3AM Eastern Standard Time)",
            "What does Lewandowski’s legacy with the Poland national team look like? It’s fair to say that on quality he’s their best ever player and has scored tons of goals, but I’ve never really seen him have a large influence on a major tournament the way guys like Bale and Shaqiri had despite playing for underdog nations. Of course, he could have done close to nothing about how this Euros campaign has gone for Poland as he wasn’t fit, but taking other tournaments into consideration, it feels like he has very few moments of lifting his country. I don’t know, maybe I’m misinformed or am overrating the quality of the rest of the Polish teams to have such expectations, and therefore entirely wrong about my opinion. I’m open to being corrected if so.",
            "I am at an age where I relate wiith managers more than the players, and that I cannot track new players coming any more. Until a few years ago, when the team would be linked to a new players, I would eiehter know about them, or would read scout reports. Now it's all foreign to me\n\nSad times",
            "Germany and Spain’s midfields have been great to watch this tournament, fast, incisive passing, plus electric wingers who take on full-backs and still manage to look up and play decent crosses, beautiful game.",
            "I think the England players and staff are taking the piss. Kane saying they're struggling with and without the ball etc. I think they're winding everyone up for the laugh. International camps are known for this. Wasn't it euro 96 or whatever when they tried sneaking song lyrics into their interview?",
            "I know people really don't like the term \"system player\" but I feel that it really does apply to Trent. That isn't even meant as an insult; he's just a pretty atypical player with a very unique skillset for his position. \n\nI don't believe there's another player in the world with a better crossfield pass than Trent, and as Klopp's Liverpool have shown when you have a wide forward on the left who will attack the box and an aggressive left back to receive the pass in case it misses that forward it's absolutely devastating. With that said, England have neither of these things at the moment, and when you take them out you're left with a full-back/midfielder in Trent who is probably not as well-rounded as many of his peers. \n\nIt's why I'd always defended Southgate for not picking him in the past, and why I'm so annoyed that he's decided to do it now even though the current side is probably even less suited to Trent's skillset than the prior England teams.",
            "Why is Sabitzer wearing the no. 9 shirt for Austria... ?\n\nIt's a crime against shirt numbers. Austria should be disqualified",
            "she daily on my discussion till i thread",
            "These two international tournaments are likely our last times seeing Messi and Ronaldo play in a high level competition.",
            "What are the odds on Sturridge putting Lalas’ head through the desk by the end of the tournament",
            "No Lewandowski. No Mbappe. This is Van Gaal levels of luck for Koeman.",
            "I like to watch coverage from many different broadcasters during international tournaments. As much moaning about the BBC I see from Brits in recent times (more general, not football), if the alternative is ITV with their constant gambling ads and shit coverage I'd happily pay my *TV license...\n\nBig international sporting events should really go to public broadcasters, generally speaking.",
            "Netherlands starting lineup for their 5-1 win vs Spain in the 2014 world cup \n\nJasper Cillessen; \n\nBruno Martins Indi, Ron Vlaar, Stefan de Vrij; \n\nDaley Blind, Daryl Janmaat, Nigel de Jong, Jonathan de Guzmán, Wesley Sneijder; \n\nArjen Robben, Robin Van Persie.\n\nThis lineup was a penalty kick away from another world cup final...",
            "watching Netherlands - France and Peru - Chile back to back would be effective as a torture technique",
            "an underrated conmebol stat is 5/10 countries in it have seen an Argentine captain their national team within the last decade\n\nArgentina (all of them)\n\nUruguay (Muslera)\n\nEcuador (Galindez) \n\nChile (Matías Fernández)\n\nParaguay (Ortigoza)\n\nall of them born and raised in here too other than muslera who I think moved pretty young, no pesky technicalities. ",
            "Think the media is being unnecessarily harsh on France. The attack left a lot to be desired (can't think of a single thing Dembele has ever done and I'm unconvinced by Thuram) but the defending was on point and if it weren't for our finishing we should have won handily. Griezmann far more involved than against Austria thank god. Even without Mbappe I think we looked far the better team overall (apart from a spell in the 2nd half) and got a good result against an underrated Dutch team.",
            "Xavi Simons goal was correctly ruled out. Thank you for coming to my TED Talk",
            "Petition to ban anyone who uses the words “spirit of the game” when criticising a refereeing decision",
            "Austria plays some football with spark. ManU should consider their manager for coach.",
            "There's nothing quite like the feeling of settling down to watch some lovely EUROs football after a long and difficult week only to be met with Jermaine Jenas gargling nonsense bile over the top of it. I cannot understand why he keeps getting commentary work, he is dreadful.",
            "France and to a lesser extent The Netherlands had no incentive to take any risk towards the end there. Don't blame them. Blame the tournament design. In their group it doesn't even matter whether you finish first or second. So of course they play it safe.",
            "okay so since its saturday already here in spain...\n\ntoday we play for the second time in 3 years in a playoff final... last time we lost cause of two Nicolas Jackson goals, tbis time against Málaga their killer is Roberto who is off to Atleti, we are cursed\n\nEveryone is against us because we arent as big as some of the other fallen giants that we have played against this season \n\nbut i can assure everyone here we deserve it the most just alone based on the fact of the family that this lockeroom has become, and how we have attracted so many people from the city to cheer for us instead of the two spanish giants, im afraid if we dont promote we will lose a lot of players going off elsewhere (a wife of one of our players already told me where he is going unless automatic renewal for promotion)\n\nso i just hope for a win and getting back to the place where we should be\n\nas i said, always against the injustices that happen to us, we havent been given a penalty in a year and a half, against all the people online who want to see us lose and want us nothing good, all the people who say shit to us just because we are Catalans, and for the people online in reddit who always are going to cheer for the \"bigger\" club, for those who say we are a dirty team full of cunts\n\nBecause we are the oldest sports club in the country\n\ni hope we can achieve this, already know tomorrow is going to be a party, as well as a roman battle in which i hope and i truly believe Tarraco will win.\n\n100% trust in our players and 100% commitment of following the club from my town no matter where we are\n\nNow its our time",
            "As a Dembele hater i am very happy seeing him getting exposed",
            "England 🤝 France\n\nBeing the enemies of fun despite having insane squads",
            "I'm predicting a close game in this one. France to win it by a nose.",
            "[Kiss cam at the Frankfurt fan zone](https://www.reddit.com/r/soccer/s/zcCbpMY3Al)",
            "[Ah yes, Real Madrid, the best team in Italy](https://i.imgur.com/k4uB03a.jpeg)",
            "red bulls stadium is like a shrunken wembley",
            "Me and a couple of friends found a Georgian restaurant/ bar before their game vs turkey. The guys aren't really into football but by god the atmosphere was great and the food, wine and beer was just as good. So now they are avid fans of Georgia, but one of the guys lives in a different country and I promised I'd visit him if they progress to the round of 16. What are the odds I might have to pay him a visit later?",
            "90 mins of Hernandez with winger responsibilities, my eyes are bleeding.",
            "Our decision making in the final third and our finishing were dreadful in those two games, almost 30 shots, 3.5 xG and our only goal in an OG lol",
            "how to fix England in one day:\n\n\nRice - Belli - Foden midfield\n\nGomez LB\n\ndone\n\nedit: forgot to add Gordon LW",
            "In random transfer news from Argentina:\n\n* Schalke 04 is preparing an offer for 20yo cb from Gimnasia y Esgrima de La Plata defender, Felipe Sanchez.\n* Chelsea is in advance negotiation for Boca's wonderkid cb Aaron Anselmino.\n* Real Zaragoza is interested in River Plate's GK Ezequiel Centurión and Napoli is in talks with Pablo Solari's agent for a possible transfer.\n* Godoy Cruz sold Tomás Conechny to Deportivo Alaves",
            "What's the record for most stoppage time ever added in one half?",
            "who’s the best footballer the anglosphere, excluding the british isles, has ever produced?",
            "Ecuador vs Venezuela should be a fun game. But Mexico vs Jamaica is just another boring CONCACAF game that we see every year. Mexico should win like always but I cant trust them",
            "What's happened with Youssoufa Moukoko? Seems like he's stalled a little, has he been bad?",
            "One thing that the two best national teams (in my opinion) have in common is that they always start tournaments slow (France and Argentina that is).\n\nMakes me wonder if Spain and Germany are exerting themselves too early.",
            "It's funny to me that according to many, 'don't stand in an offside position' isn't the common sense view re. players in an offside position interfering with play. People talk about the spirit of the game, but doesn't this just exercise that by punishing goal hanging?",
            "Apparently Neves rejected Benfica’s offer for a contract extension. What doesn’t make sense to me is the reports which claim that he is going to leave the club this summer because Benfica are “hearing offers.”\n\nHe’s contracted until 2028 with a RC of €120m, Benfica has all of the power in this scenario, they can choose to keep him for the next two years and then hit the RC when he’s fully developed.",
            "Very happy with our lineup to face Georgia. Kovář and Vitík would make it perfect but let’s see how we play.",
            "My favourite part of discourse on this sub is that you can be complementary of your rival and it will be guaranteed that at least one of their fans will take it as an insult because of the badge next to your name.",
            "We are on fire currently.\n\nSo proud of our team.\nNow of it wasn't for that own goal against france....",
            "Deschamps really put tchouameni in as mbappe sub 😭\n\nthese NT managers man, all cowards",
            "Lord save me from the match thread, the takes are too brain rotting.",
            "Is there a worse feeling than when your favorite player has a bad game?",
            "Wouldn’t prime Henderson be perfect for this England side?",
            "Now my rage has subsided and my bias is put to one side. That offside call while unlucky is correct unfortunately. I say unfortunate as it means attwell and Taylor will be subjected on others.\n\nEdit: not harsh but unlucky.",
            "I kinda have a bit of bad feeling for yamal’s carrer. Noting about his skills or anything. Making a 16 year old body play this many matches that too against people who are lot stronger would definitely take a toll on his body. Hope they manage his playtime better",
            "It low-key feels like none of Lewandowski's teams fans including the national team actually like him. At least none seem to have rhe amount of affection towards him you'd expect for a player of his caliber",
            "Chelsea use of the media is such a joke. Two years in a row they've continously briefed the press about Olise to be rejected both times, it would infuriate me if I was a fan. No doubt they'll use Romano and co to try and spin the story from him rejecting them (again). It's funny though, as a Palace fan who was very confident that he'd never end up there.\n\nAssume we'll try and sign Soule now to replace Olise, never watched him though.",
            "Trying to bore the opposition to death\n\nFrance 🤝 England",
            "Head to head trumps goal diff at equal points right? \n\nSo theoretically, what would happen in group D if France loses today but win against Poland and the Netherlands loses against Austria. \n\nAll 3 teams would have 6 points so the head to head would look like this: Austria > Netherlands > France > Austria \n\nWhat would the final table look like?",
            "So if France win the euros, kante will officially complete football, I guess the only thing you would say is he has not won the balón dor, but he won the PFA though, winning the highest individual award of a top 5 league is pretty special",
            "Our team currently has 4 players that are captains for their NT team.\n\nMorata for Spain.\nOblak for Slovenia.\nGriezmann for France (tonight's game lol).\nGimenez for Uruguay.",
            "As a cope I'm starting a conspiracy that the England camp has some sort of communicable illness that John Stones brought in before the Serbia game.",
            "Football commentary can be a mixed bag and is often terrible. But I love watching (or listening) to footballers gushing over each other, especially when they actually properly know the player they're talking to beyond a surface level. It's just nice to get them being human and fans sometimes",
            "So many clubs were hesitant to pull the trigger on Trubin because of that 40% sell-on clause.\n\nHe definitely faltered a bit at the end of the season (for his standards) but he’s never really had an objectively *bad* game for Benfica.\n\n\nThey bagged him for less than €14m, which is an absolute bargain given that he’s only 22.",
            "Well, the top 2 defences of the competition came out of that, both with clean sheets.... who could have guessed..",
            "Alan Shearer, Cesc Fabregas and Wayne Rooney are currently blaming Harry Kane for everything lol",
            "who do you think have been the most enjoyable teams to watch so far in the Euros? \\*not necessarily the best",
            "Football isn’t the same with Thorgan Hazard the goat being injured",
            "Felt wrong saying it on the tragedy post itself but that 94 clip reminded me of when we used to have creative national team kits, I feel like we have more to work with national colors/design-wise than our recent kits have shown",
            "What happened to the United 35m bid for Branthwaite? Went all quiet. Isn't this the best time to complete the transfer quietly? It's been over a week.",
            "Could Paul Pogba still play charity games and stuff like that?",
            "Re England: Correct me if my eyes are wrong but Netherlands looked content to sit back and let France play out of the back a lot of the time. England were not given that luxury and pressing their back 4 hard appears to force them into desperate longball mode.\n\nMy question is would a team like Netherlands adjust their strat against England and exploit that weakness? If they were ever to play England? Are most teams going to press England's back 4 knowing they aren't too nifty in distribution under pressure? Or will England get a game where they can play out the back under low stress?\nKind of a weirdly stated question.",
            "People shouldn't be surprised that Koeman plays Memphis every chance he gets. This is the same manager who brought him to Barcelona with the intention of starting him there every game at striker. He was going to bring Wijnaldum too until PSG swooped in, Barça really dodged a bullet there",
            "Mods, it's another day, next match is in 3 hours and 20 minutes, and I can still see red on my flair.",
            "Which move, action, or playstyle do you strongly associate with a player?\n\nDembele - doing everything right, cutting in, and then skying the ball.",
            "I know that it's obviously impossible to form a proper opinion on a player without seeing them play regularly. That said, you can usually form a very vague opinion on their general skill and trajectory from discussions on this sub.\n\nKobbie Mainoo though, who knows, not seen this subreddit so split on a player in time. A third don't have an opinion on him, a third think he could walk into Englands midfield no issues and the last third are of the opinion that he's total, total shite.",
            "Olise wanting 350k is such bs lol, Chelsea chased this guy for 2 years knowing he wanted to be the highest earner till now? lol he just choose Bayern over them",
            "Just gonna point out that VVD has still never won a game against Saliba.",
            "Eliminate France and Netherlands, that was a crime against football",
            "Once again asking the mods why they have not put in the Copa America flag flairs?",
            "Where is the Netherlands - France match thread? Am I blind?",
            "Simons Kane Olise Musiala attack we will be tuned in  no matter what",
            "Finally we got the flags, thank you, thank you!",
            "Hope the Olise chase falling through means we'll retain Hutchinson this season, probably my fave Chelsea academy player currently (yes, I know we bought him from Arsenal, but he also started his career at Chelsea and overall spent 5 years in Chelsea's academy, feel it's pretty accurate to call him both a Chelsea and Arsenal Academy player,) ideally him or Noni kicks on and becomes good enough for the starting berth with Palmer at 10 and Nkunku LW, but if they don't we can just move Palmer back to RW and move Nkunku to the 10 spot or something. \n\n\nOmari's just a fun player to watch, his balance and low centre of gravity make him such a strong dribbler, he isn't as fast as say Mudryk or even Noni at top speed but he has such a quick burst of pace to get past players or run behind, like Hazard and Pedro, just very quick with his feet, ge's so tricky with a very nice and cute touch, and he makes really good runs and finishes well. \n\nA player I very much could see kicking on like Mase did in 19/20 coming from Derby, his loan at Ispwich feels fairly comparable to Mase's first loan at Vitesse, though perhaps with it being in the Championship Omari can make the jump right away instead of needing to prove himself in England first (like Mase's first loan in Vitesse went even better than his second in Derby.) \n\n\nReports say Omari will only leave if sold, that could be taken as Omari will be sold, or it could mean we will at least give Omari a chance in pre-season and let Marresca have the final word, hoping it's the latter, particularly now that the Olise pursuit is in the bin.",
            "Gareth's biggest mistake was not bringing Conor Coady along this time \n \nI mean ffs the man was *Cheerleader of the Tournament™* twice in a row  \n \nLeave him at home and now the vibes are gone – what did you expect Gaz?",
            "can't believe Verbruggen is first choice for the Netherlands, goalkeepers with short arms should be abolished",
            "Wtf is this france line up?! Griezmann as CF?",
            "I'm always overly optimistic during tournament football, so I still think England are going to win it. \n\nRemindme! 3 weeks \n\nI'm a glutton for punishment",
            "Deschamps playing Thruam and Dembélé again Jesus Christ fucking Kolo Muani mogs them in a NT shirt",
            "Any thoughts on where Kelleher will end up, if he moved at all?",
            "This Netherlands-France game…\n\nIm sorry Southgate, I wasn’t familiar with your game",
            "Shoutout to all my fellow lazy bums who’re going to take a 3 hour break after a tough day of watching 3 Euros game to then watch Copa America",
            "Poland eliminated after two games, you need to be unlucky for that to happen. Hungary with same record as them, yet still have chance to go as one of four 3rd best teams.",
            "Any thoughts on Michael Olise to Bayern?",
            "can someone explain why poland is eliminated? if they win like 6-0 vs france and the dutch win vs Austria, won't they be in 3rd with a chance to go through?",
            "I wish Palace got the chance to run it back with everyone fit and firing, they’d have had (and still largely have) a really strong team with Mateta, Eze, Olise, Wharton, Doucoure, Munoz, Guehi, Anderson etc and probably a few more signings",
            "> France conceded 2 goals in the last 810 minutes with Dayot Upamecano on the pitch.\n\nboss :-)\n\nE: wait this was before the Netherlands match",
            "Has Ornstein moved to the nytimes now? I havent been keeping up with journalist transfers",
            "I know a lot of football accounts on social media can be rage baity or cringe are there some that you guys genuinely like? I like the give and go podcast and pedtalksports are nice",
            "Steve Cooper seems to have had plastic surgery and/or botox and it makes me feel uncomfortable. - https://twitter.com/LCFC/status/1804216463277916624",
            " Who has bigger chances to finish 1st \n\nFrance of Netherlands?",
            "**Trivia Euro - Day 9**\n\n**QP.** Who will win (or draw) these games?\n\nScotland 🏴󠁧󠁢󠁳󠁣󠁴󠁿 vs 🇭🇺 Hungary\n\nSwitzerland 🇨🇭 vs 🇩🇪 Germany\n\nThere will be no trivia questions today, sorry. We're back tomorrow!\n\n!PING TRIVIA",
            "I recently heard something on a podcast that describes our (Austria) national team pretty well.\n\nThey said that we are like a club that was built for a manager and as a national team that's quite hard to find and that's spot on.\n\nIt's like Rangnick has built this team with transfers because it's perfectly built for his style of football.\n\nIts a shame we are missing Alaba and especially Schlager (he's the definition of a Ralf Rangnick Player!) it would be more evident then.\n\nI'm so excited to see what kind of powers such a first win can unleash",
            "Belgium and Portugal losing today would be the funniest shit",
            "Wake up boys, time to watch bass fishing!!",
            "Kante wins MOTM and people start teddybearing him again like they've been itching to do so since he left Chelsea.",
            "I was a bit surprised to see so many people here saying we got robbed and that the Xavi goal shouldn’t have been disallowed. Personally I understood the decision and I think it was the right call if I attempt to be unbiased.\n\nAs for the rest of the game, it was clear that both teams weren’t pushing for the 3 points which is understandable. Frimpong will probably lose his spot again against Austria because he wasn’t good, or at least it clearly doesn’t work together with Dumfries which was predictable. Veerman might also return because Reijnders was disappointing as an 8 instead of a 10.",
            "God I hate the word robbed. You can be mad all you want at the rule being silly but Netherlands did not get \"robbed,\" according to the rules that is always offsides.",
            "As funny as it is Chelsea clearly got rejected by olise and then did a PR spin it never made sense anyway. They have palmer, Estavao and even Midueke who can play on the right to a decent level. They need a left winger and striker more, and I mean a replacement for Jackson not a back up. As well as the defence being a mess that is.",
            "Spain and Germany are only two great teams in the tournament and they will face off in quarterfinals.",
            "It’s a good thing Kante left us tbh, I can’t imagine he would be in a position to be fit during the euros if he had to play in the prem week in and week out (and especially at us where we are shit at dealing with injuries). Amazing to see him still dominating midfields",
            "It's now just 23 sleeps until the real star of the Red Bull sporting empire, Lewis Morgan, wins the Euros. How many MLS player of the week awards does \"Max Verstappen\" have?",
            "Every time big European teams play each other, there is this sterile, risk aversion, highly calculated brand of football and it makes the match a borefest.  \nLook at France-Holland now, how can a neutral sit through this?",
            "International football is pretty much the opposite to club football. The bigger the teams the worse the match",
            "**IT WAS 50 YEARS AGO TODAY** - June 21st\n\n*World Cup - Day 9*\n\nIt's win or bust for [Scotland](https://i.imgur.com/aFIQWZG.png). A do-or-die match for the Scots to qualify or not to the Second Round of the tournament. The schedule has been tricky, and the favourites Yugoslavia are the rivals in Frankfurt. Only a win will automatically give the team by Willie Ormond the pass, while a draw can presumably send the side home if Brazil (as is expected) trounces Zaire by 2 or more goals. Scotland will field the same side as when they were close to beat the Brazilians. It won't be an easy task for the side to beat a really talented Eastern European side, in which a draw will suffice them to be in the next round, after they trounced the Zaireans. [Here](https://i.imgur.com/7j2Biz7.png) are the latest odds before the match.\n\nAside from Group 2, Group 1 is yet to decided. And, in another twist, fate has decided that the crunch match is between the two neighbours (and political rivals): it's East Germany v West Germany in Hamburg in a match where the team led by Franz Beckenbauer need a point to end up in first position, although this can leave with the [Germans playing against Holland](https://i.imgur.com/aZWtc9H.png) in the second round. In front, East Germany, who need to win to qualify in their first appearance in the World Stage. A heavily charged atmosphere with more security than ever is expected tonight. In the other match, Chile will be waiting for an East German defeat to jump to the chance if they beat an already eliminated Australia, who want to score their first ever goal in the World Cup.\n\n*LIVE football on* [UK TV](https://i.imgur.com/SeJqLL3.png) *tomorrow: BBC1 and ITV will show Scotland v Yugoslavia LIVE from 4pm, while BBC1 will show West Germany v East Germany LIVE at 7.30pm.*\n\nA couple of shows from yesterday and today on ITV: [yesterday](https://we.tl/t-mnGIBF1BnN)'s review of the second round of matches, and [today's](https://we.tl/t-FeLB4Sw9Ht) (with Willie Ormond, Billy Bremner, Joe Jordan and David Hay)",
            "people are laughing at some of the quotes coming out of the England camp, and rightly so, but Southgate saying the players aren't fit enough is believable. in the Denmark game the players looked shattered and were making extremely poor decisions which could be down to tiredness. will have to wait to see how we fare against Slovenia before making final judgements, we obviously have the capability to play at a higher level and it does no good to sit here and moan about it 24/7. Spain and Germany looking like the best two teams so far, with the home advantage and having the best manager at the tournament I can see Kroos retiring a happy man",
            "she daily on my discussion till i thread (in a sickly, weak voice)",
            "Really glad this was the game I went to a watch party for :I\n\nAtleast the alcohol helps.",
            "I’ll start worrying about England when France stop copying us.",
            "!flair :Australia:",
            "By drawing against France and most likely finishing 2nd in the group, Netherlands are guaranteed to be on the easier side of the bracket.\n\nThe only \"tough\" teams in that side are Portugal (quarter final) and Spain (Semi final). And maybe Belgium if they finish 2nd in the group (round of 16).\n\nSo if they manage to tighten up their defence just a notch, they'll have a somewhat tolerable road to the final.",
            "On 5th july kier starmer should put forth a parliamentary order to remove Gareth Southgate. He should then install jack greilish as interim, give him 8 grams of aderol and instruct him to do his best impression of Pep guardiola for the remaining tournament ",
            "Take me back to the pandemic so I can watch every game of Copa America and the Euros. I don't want to adult anymore",
            "This Chelsea / Newcastle / Villa / Everton pass the player stuff absolutely honks.",
            "I will shamelessly chose to remember Memphis Depay as one of the 5 best Dutch player's I have ever seen.",
            "[removed]",
            "I much prefer the national team emblems to the flags as flairs tbh",
            "I wonder how visceral the reaction would have been to the Netherlands offside decision if it hadn’t been an English ref to make it",
            "Sporting fans/fans of Portuguese football, can anyone vouch for the reliability of Leonino? Their handle on Twitter/X is @leoninopt. \n\nThey have pretty boldly claimed Arsenal are close to striking a deal over Gyökeres. Sounds like nothingness, but always good to check.",
            "is it a 4-3-3 by france, or is deschamps putting in 3+1 midfielders vs netherlands' 3. surely wont leave griezmann up in the defensive shape",
            "Georgia vs Czechia tomorrow is going to be the last 3pm game this tournament 😔 beyond devastated",
            "How would you fix the season ticket problem at big clubs in England?",
            "I miss major tournaments when I was in school and college. Shag all else to do and could watch every match and go pub with ease for the evening matches if there was a good one on.",
            "!flair :Real\\_Betis:",
            "So, I don’t watch football outside the Euros and World Cup, can someone explain why the Netherlands goal just now was considered offside, or direct me to a resource to better understand how offside works, thanks",
            "Who is better at their best - Antione Griezmann or Wesley Sneijder?",
            "Who do you have more faith in as of today.\n\nEngland - France - Portugal?",
            "Koeman and deschamps making southgate look like a genius",
            "hope everyone tunes in tomorrow 8pm gmt to watch some much needed stanciu and man magic",
            "France and Netherlands game almost knocks out Croatia and Scotland unless they can win big in their final match",
            "Looks like players and fans of both teams are happy with a draw. Neutral fans are the biggest losers",
            "what are the best results/stats widgets around?",
            "!flair :USA:",
            "Belgium vs Romania tomorrow thoughts?",
            "Did Southgate really say his players have physical limitations that's why they can't press?",
            "How do refs communicate to multiple nationalities who speak different languages? Do you have to be multilingual to qualify?",
            "You'd have to have a heart of stone not to feel sorry for Mateusz Gotówka",
            "\"I'm so ready for today, we're winning the euros\" part 2",
            "Is there any way to watch matches online with bambino pons as commentator?",
            "\"Foden can't play on the left\" agenda is so funny. England's attack was playing very well in the world cup with the same players but no RBs playing at LB and at CM.",
            "2 games from France, 0 goals and 4 points. Zidane will make you all see the light",
            "Just realized France haven't scored a goal in the Euros yet they'll probably finish in first place. Yikes",
            "Two days of horrid football",
            "Poland barely playing Szymanski who had nearly 30 goal contributions from CM last season and putting old mates like Lewandowski and Grosicki on is hilarious. Can't wait for this generation of players to finally fuck off",
            "After watching both team play. I think there no way in hell Holland wins this. Draw or a win for France",
            "it’s so funny how commentators seem to love a ref giving advantage they always praise it",
            "The Euros are going as expected I feel. The nations who had tactical certainties and knew what they would do coming into the tournament like Spain and Germany are the best. Germany had no doubts what their 11 would be. France and England who are meant to be the most talented but who have real tactical questions, look shaky.",
            "Also, France will not win the Euros with Thuram upfront. Giroud is still their best striker even though he's leaving to MLS in a month.",
            "why is Poland officially eliminated? Can't they mathematically win 5-0 against France and qualify as one of the best 3rd place teams?",
            "Rumors Luke Shaw has flown home from the tournament. Say it ain't so.",
            "I was that convinced of Endrick because I thought he was slow. I take that back. \n\nDude actually looks fast ..",
            "Saka has been massively oversold as a creator by Arsenal fans.\n\nHis underlying creative numbers per 90 have never been overly impressive, they're not bad but when you consider how much Arsenal attack down the right and how many corners he takes I’d honestly expect them to be higher.",
            "So the VAR **disallowed** Simons' goal because his teammate was in an offside position and obstructed the goalkeeper's view, and it reminded me of when the ref **allowed** [Bruno Fernandes' goal against Man City](https://www.youtube.com/watch?v=GTIw4n0f2MM&t=88s) after Rashford had been in an offside position and clearly impacted play even more egregiously.\n\nThe referee involved in both decisions was... Stuart Attwell.",
            "How does Marcus Thuram always start? Insane to me, bang average every time I see him",
            "Spain has a lot of kids aged 16. Who are you talking about?",
            "No way?! Next you'll be telling me Mbappe is wearing a mask!",
            "Sounds crazy, someone should ask about how that works with school",
            "Getting masses of people to google 16 year olds, nice try FBI",
            "At least not Bellingham this time",
            "Same fam",
            "Me too",
            "Albania has a good coaching hehe. But you Croats need a foreigner on the style of Rangnick imo. Your young players are not on the level of your prime old guard but they still have good potential to succeed. Shouldnt be wasted.",
            "It is such a great tournament too and we are completely shitting the bad because of Daliban. This fraud is doing everything possible to minimize our chances to pass the group…",
            "Sign Terzic",
            "we’re a nation of plastics. no one attends their local clubs or even watches Ekstraklasa. without the money that would provide it’s hard to compete. that’s why i don’t like blaming the players, they simply aren’t going through the same level of training since a young age as kids in the UK or Spain do",
            "Think they're like right on that line of 'small-ish footballing nation with great players never able to put it together' and 'big-ish footballing nation with decent squads who fall short'. Anyone smaller than them is basically a fun underdog, anyone bigger than them is basically a good side potentially disappointing.",
            "I'm so used to it at this point that underachivement is an expectation.\n\nThere's got to be a reason they gave the world /r/EkstraklasaBoners",
            "Yeah, I've been thinking this too. Their population is, what, 40 million or so? They were decent in the 70s (I think they finished third at a World Cup, '78 maybe?) but they should really be better than they are. If the likes of Croatia and Belgium can produce the generations they have recently, there's no reason at all why Poland can't.",
            "Our league is complete dogshit and until that gets at least partially fixed then we won't get anywhere\n\nSince Kuba and Piszcek retired it's just been getting worse and worse, key players rarely performing (don't get me started on Zielinski), awful tactics, etc etc",
            "I'm from Austria and like to rant about Southgate too. Ranting about Southgate can bring people together ",
            "Why didn’t Southgate call up Messi and Mac Allister for England?",
            "Could have been worse, you could have let him watch either England game.",
            "Calls him to watch the Copa America’s final next",
            "same thing with griezmann’s renaissance in qatar. had a difficult time with us despite trying his best, out of favor his first year back at atleti, and a poor euro 2021, and it seemed like his best days were past him. then he ends up being arguably a top 3 player at the tournament, despite a poor final.",
            "I don't feel bad for them per se, but I think it's silly to expect players to not use the leverage available to them to try and force a move elsewhere when clubs will use the leverage available to them to try and force players out that they don't want anymore.",
            "I can never understand people who think that way lol",
            "no lol",
            "Huh",
            "Based on Ticketmaster USA v Panama will be empty, shocker that people don’t want to pay $100+ for nosebleeds on a weeknight for the match against Panama. CONMEBOL screwed up, only the knockouts + Argentina and Brazil games have high demand",
            "Shouldn't the US be to South Americans what Germany is to the Balkans? A large hotpot of diasporas that watch football and chant war crimes towards one another?\n\nSurely shouldn't be that hard to sell the Copa out there, no?",
            "You missed subbing on his runners in Watkins and Bowen while subbing off his passers in Kane, Saka and Trent.",
            "Scouts: England will play this way\n\nEngland: ha, fooled you\n\nIt’s *almost* genius",
            "Phillips always getting unnecessarily dragged for managers comments. I really feel for the guy.",
            "He’s probably gonna be the face of bbc coverage once Lineker is done ffs",
            "Have you heard Landon Donovan?",
            "As miserable as Dixon",
            "Hate that tbh, best time for us in Asia",
            "He’s still only 26 too - damn. I don’t think we’ve seen the best of Martinez yet either",
            "brest legend higuain",
            "Should have rigged a couple of red cards to spice things up. I'm watching for the fights and red cards, not for the goals.",
            "I think Bernardo should be shifted into midfield, his spot at RW being taken over by Pedro Neto for the Turkey game.\n\nConceição should get some minutes against Turkey, but I’d prefer his first start be against Georgia.",
            "Big Tom going to show us something special to sign the fixtures off 💪🇨🇿",
            "We had something special",
            "My disappointment is immeasurable and my day is ruined",
            "I love Lallana but he has big motivational thread on LinkedIn energy",
            "No you're right, besides a few of the favourites acting lackluster, the so-called \"lesser big games\"  have been immensely fun.\n\nCroatia-Albania and Georgia-Turkey were just box-to-box madness.",
            "Did you watch england v denmark?",
            "im like the complete opposite. All ive been seeing is people says its the best tournament in recent years and no games been dull. For me most of the games i expected to be entertaining have been a bit dull, but pretty much all the 2pm or 5pm games have been great.",
            "Any tenseness or good football on display will make any game enjoyable to me. Even more entertaining at the international level",
            "I’m with you for the most part, as long there’s something at stake I don’t need dynamic or high scoring games for it to be entertaining.",
            "I think they're boring because almost every team will go to the knock-outs. There's nothing at stake.",
            "On a tangent to a point for discussion it's interesting a lot of the best performances this tournament have come from players who have not played that many minutes for their clubs.",
            "John Terry would have done 2 press conferences by now.",
            "transfermarkt merchants",
            "Hojberg didn’t die",
            "what is Gare du Sud cooking",
            "Won’t be like that in game",
            "Griezmann not Rabiot",
            "It’s the Carabao Cup final all over again.",
            "So a quick question. Suppose the GK is standing on the left post, actually fuck it, 1m outside the left post. An attacking player is standing on the right post on the goal line. The ball goes in the top right corner. Goalkeeper has to make up the full width of the goal. The player on the line is between the GK and the ball. Is that offside? If it is, a follow up question, how far does the goalkeeper have to be away from the player for it not to be offside?",
            "Haven’t actually seen this one but assuming the player was blocking the keepers line of sight when the ball was shot? Really annoying how they can’t make their mind up on when that gets given and not",
            "To be honest he has the characteristics you name, it's not like physically Dembele is dead.\n\nDembele's problem is in the head, I don't want to say it in a way that sounds bad but sometimes he makes decisions that defy basic human coefficient.",
            "I am 100% with you haha people getting say \"Xavi is heart broken!!\" and I was sitting here like, What does a legendary Spanish player have to do with this?\n\nUnless Xavi Simons is to Xavi what CR7 was to Ronaldo (Brazil) he's getting called Simons lmao",
            "Yeah but that's his first name though, it's not like a nickname he chose on reddit or something \n\nXavi being a good footballer doesn't mean he gets to patent a name away wtf",
            "I realise some people aren't the brightest bulbs but if I say \"Xavi scored a great goal today\", I expect them to know which Xavi I'm talking about.",
            "Very hard to sympathise with their complaints when my team is in a league that has 'North' in the name.\n\nThat being said, there's no shortage of Arsenal/Liverpool fans complaining about the wealth of Man City.",
            "They’d burn down the entire EFL if it meant they couldn’t get relegated into it, but they want solidarity and altruism from the clubs above them.",
            "The complete change of atmosphere around Newcastle United fans over the past 2 years is evidence of that, lmao.",
            "Will probably go through even if we lose to Slovenia tbf",
            "When he's on song, he can create a lot of chances with his top-tier speed/dribbling and can look like the best RW in the world. But, that happens very rarely. His finishing is terrible -- I am sure French/PSG CBs and wingbacks can finish better than him. His football IQ is one of the worst. I see him as a teenager who never developed as a player after bursting on the scene.",
            "When we played PSG and he didn't really trouble Dan Burn, that's when I couldn't take him seriously.",
            "As a Barca fan, he was always the most annoying to watch to me.  Because we all knew he had great skills but always knew he couldn't really be counted on when the decisive moments came.  Plus he was injured so much that sometimes forgot he was even in the team.",
            "I have chronic insomnia so sometimes I peek in here during the yank hours and it is unacceptable",
            "Sometimes I have a browse when I wake up in the night for my absolutions and it really motivates me to get back to sleep",
            "The Netherlands have the strongest defence in the euro's though if you go by names.",
            "I feel like that's been France under Deschamps for much of the time, really. \n\nDoesn't take all that many goals to win it all either, just need to score one more than the opposition - and they're very much a team ready to exploit anyone trying to push up against them.",
            "Most criticism towards the 24 team format mostly comes from the awkardness it creates. As far as i have seen people would rather have 32 teams.",
            "Not a European, but I really like it. The games between the \"smaller\" nations have been some of the best games so far. When the small nations play each other both teams feel like a result is there for the taking, so they take more risks. I'd much rather that then the cagey matches where teams know one loss ends their tournament. Plus, a bigger tournament means more games to watch.",
            "i think the group stages get a little bit clunky(and even so, not significantly. euro 2020 had a great group stage, and so far, so has euro 2024)but the knockouts are really a burst of life with some underdogs sneaking in",
            "I like to have more countries and fans involved.\n\nBut I don't like the format. Playing 36 matches to select 16 teams from 24 is kinda pointless.",
            "The Chileans have to learn it first tbf.",
            "Commentator said he’s still learning lessons",
            "Strikers are way too dependent on their teammates to be the national hero of a smallish footballing nation",
            "It's not uncommon to recognise that Lewy hasn't performed to his highest level for the NT a lot of the time, but to be honest there's so many other things to complain about when it comes to us that it's rarely a huge talking point\n\nLewy is beloved in Poland, an absolute icon, and although he hasn't been 10/10 for Poland, he hasn't been atrocious either, pair that with how negative the football has been for years now and how inconsistent some of the other supposed best players have been plus awful coaching and in a way Lewy gets a bit of a pass at times",
            "Thank you for your services and good luck in retirement, old man",
            "Imagine if Southgate was just trolling everyone with that Kalvin Phillips comment 💀💀💀",
            "the starting lineups and selections for england have been so badly misprofiled by southgate it's egregious.   \n\n* Southgate should of taken rashford as he is an amazing outlet/runner in behind, if not play gordon more\n* Play wharton with rice\n* Trent isn't a midfielder, play in the defensive line with the ability to move centrally shouldn't receive the ball with his back to goal\n* trent should always be outside the defensive block or at the side of it\n\nuse TAA like how Nagelsmann is using Kimmich",
            "Imo he's a Beckham regen and that RM position doesn't really exist anymore. Makes it trickier to work him into modern tactics. But I'm not particularly clued up on football tactics so I could be full of shit",
            "My local club has a CB on the women’s team who wears number 10. It’s horrendous stuff",
            "Our shirt numbers really are criminal. The worst one is Grillitsch wearing the 10, while playing as a double pivot 6",
            "I’m torn on traditional numbers. If you go very non-traditional it works, but if you’re only slightly off traditional it doesn’t. \n\nDefender wearing 9 or 10 or a forward wearing 2, 3, or 4 = fun and different \n\nMidfielder wearing 9 = abomination. I don’t even like midfielders to wear 10 unless they’re clearly an attacking mid. And no fullbacks wearing 7.",
            "Hundred times better than Boulahrouz wearing no.9 circa 2006",
            "My greatest achievement in life is spending most of my teenage years as #9 playing CB.\n\nSo many people hated it and it was a joy",
            "hard",
            "Think both Ronaldo and Messi are looking to the 2026 World Cup as their retirement tournament. Can see them making that.",
            "No Frenkie, no Koopmeiners, no de Roon, no Wieffer. I don't think he is very lucky.",
            "How many argentine managers this tournament?",
            "Griezman missed a bunch of easy chances yesterday",
            "Thought so too moment the first replay was shown, don't understand people saying it's a robbery, clearly the maignan wasn't saving it either way but he was clearly still being obstructed",
            "I think overall the refereeing has been good and rules have mostly been applied consistently. I think people misdirect their annoyance to refs and VAR when they’re just doing their job. If they don’t like the laws then their annoyance should be directed towards IFAB.",
            "What if I’m awarding MOTM in a game of ghost football?",
            "BBC iPlayer's got 5 live commentary over the match. Not saying Dion Dublin's miles ahead of Jenas but it's akin to choosing a paper-cut over my leg getting sawn off.",
            "Agreed. Instead of advancing the best 3rd teams, they could advance the best 1st ones directly to a quarterfinal round. All games would be insane.",
            "There’s an interesting case that I only realized today (about 8 years late). We already know that 4 points more-or-less guarantees qualification, but further, only teams in the same group play their last match at the same time. Groups C-F play at least a full day after Groups A-B. Depending on their third place finishes of those groups (which can actually quite plausibly turn out quite low), this can possibly incentivize teams to slow down the match at something like 3 points. As an arbitrary example, if say Hungary wins by 3 or less and Croatia beats Italy by 1, Austria will know well in advance that they can afford to lose by 1 and may stop playing *down* 1-0\n\nThis format gives teams more to play for in a sense but I’m really not a fan overall\n\nEdit: I realize now you’re talking about a completely different problem. But whatever, also a problem with the format",
            "The Entente Cordiale rises again",
            "Biased but France are way more entertaining than England. At least we try (and fail), England doesn’t even try",
            "Netherlands win 2-1",
            "[deleted]",
            "how to fix Brazil in one day:\n\ncall up Murillo\n\nplay Murillo\n\ndone",
            "The fuck is Gomez LB fixing",
            "Still gonna run into the same issues of nobody offering runs in behind and nobody creating space for each other, I reckon. \n\nLike at this point I don't think it's a personnel issue as much as it is a systemic issue.",
            "I'm going to be mad seeing Anselmino leave no matter what but to Chelsea of all teams where they’ve already got like 5 different centre backs they paid too much for not to use is gonna make it three times worse ",
            "Probably weah if Liberia counts",
            "It's an unfortunate position that players who have the media set insane expectations at 16 years old find themselves in. People feel he \"stalled\" because by age 19 they're not Haaland yet. But who says that's what we should be judging him by? \n\nHe did play less this year with Füllkrug being the main starter and I wouldn't say he's flourishing either, but he's still 19. Another way to see his trajectory is to remind yourself that he's younger than Adam Wharton and two years younger than Cole Palmer. \n\nI think if you look at him as a 19 year old who already has 21 goals and 9 assists in exactly 34 full games of minutes for Dortmund in his life so far. What an amazing platform from which to develop as a 19 year old. He's by no means a \"bust\" or anything like that.",
            "Early physical development made people think he’ll be world class when in reality he wasn’t the most promising 15 year old, he was just fully developed. This is often the case with wonderkids who grow quickly\n\nNot saying he’s a bad player, he’ll just be a fine Bundesliga striker when people thought he was the next Mbappe",
            "score prediction?",
            "Good not to start Mbappé. Winning tonight isn't mandatory and he can still come during the second half.",
            "The vile English are ruining everything by applying the laws of the game correctly",
            "When your team has a bad game😂",
            "Your favorite player having a bad game for the NT. Like when he has a bad game for the team I support it only affects people that love him and all will be forgiven. If he has a bad game for the NT he will catch a load of shit and his reputation will be worse off.",
            "when your favourite player shows signs that he is washed. It breaks your soul",
            "Prime Carrick is the exact profile needed IMO (when he was actually playing as well)",
            "Kinda crazy, cause Netherlands has de Jong, Koopmeiners en de Roon injured and their midfield is still looking fine. Bit of a weakness for England.",
            "Nothing harsh about it. Only issue is it somehow took 5 minutes when it was blatantly obvious that it should’ve been disallowed",
            "Don't you worry. \n\nBarca know how to handle youngsters, like Pedri for example",
            "Barca really do not seem to learn. They overplay all their youngster but then put all the blame on De La Fuente because he plays them for 60 minutes in 5 games",
            "The worst part is that the fans are largely idiots who eat it up\n\nThey think we made the smart decision LOL",
            "Atleast Gareth managed to muster up a goal",
            "[Wikipedia always covers this really concisely](https://en.wikipedia.org/wiki/UEFA_Euro_2024#Tiebreakers).",
            "honestly sounds like something john stones would do",
            "Spain and Germany clear, but I've appreciated the Austrian and Romanian efforts too.",
            "Georgia and Turkey, but I'm basing that only on one match. Austria have been good too. I've also enjoyed Slovakia, despite their defeat today.",
            "Croatia most entertaining in a good and bad way.",
            "United keep telling us they'll walk away if we don't lower the price, and theyre banking on us needing a sale to avoid another deduction, everton are saying we don't need to sell him to meet PSR we are fine anyway since we are selling Dobbin to villa who is an academy player, while we also help villa by buying their academy player",
            "£35m was a complete piss take of a bid. Even if they went back in for him I imagine it'd take time for them to get even close to something we'd consider if that was their starting off point",
            "Of course",
            "England will certainly be pressed more because they also don’t have the necessary transition threat to exploit larger spaces if they do bait the press and go long. This is the problem with playing ball-to-feet players like Kane and Foden and not surrounding them with enough runners.",
            "The Netherlands were playing knowing a draw didn't hurt them practically at all whereas a loss would completely kill their chances at 1st - and France was in the same boat\n\n\nHard to extrapolate from such a game",
            "If Serbia and Denmark can press and trouble us in the defensive third, then yes I think everyone is going to try it and probably have a fair degree of success.",
            "What is dead can never die",
            "Jamie Vardy violating corner flags",
            "Easy enough, cutting inside- Robben  \nDiving headers- Chicharito",
            "He's very, very good. It's just not clear if he's what England needs at this moment in tournament football where the back four need to be protected. I personally think it would be a very big risk, with lots of upside, a risk that Southgate likely won't take.",
            "I’m severely anti-Mainoo but I don’t think he’s shit, just not ready. I don’t know how anyone can watch him and think he’s going to solve anything, he’s only 18 and has played a handful of games - most of which he’s been completely invisible\n\n\nYou have to give him the benefit of doubt because he’s young and plays in a shit midfield, but that doesn’t mean he should be starting for his country. Wharton and Gallagher are both better",
            ">  a third think he could walk into Englands midfield no issues and the last third are of the opinion that he's total, total shite.\n\nWith the current state of England's midfield those aren't mutually exclusive opinions!",
            "the sub is split on every young talent coming out of the top 6, TAA, Saka, Greenwood, they all had this debate",
            "Someone at Chelsea is leaking pork pies",
            "Sorry, been a bit busy!",
            "Pickford just dropped to his knees in the middle of Aldi",
            "nice",
            "nice",
            "First tiebreaker is head to head, so on 3 points they're guaranteed to be behind Austria",
            "H2H breaks the tie between clubs at equal points, not GD",
            "The athletic is now owned by the nytimes so now athletic reporting will be tweeted/posted by the nytimes as well.",
            "i know he divides people, but i like fiago. shines a light on football from around the world.",
            "I like James Lawrence Alcott. Very sensible but also pretty chill and light hearted.",
            "I really like the Football Clichés podcast.",
            "Caught Offside. It’s with an American and Irish who both live in the U.S. It’s obviously biased towards the U.S. but they are fair and also pretty entertaining. \n\nJJ (Irish guy) asking Andrew (American) what would happen to the show if they had an affair (with each other) on a recent episode was pretty funny lol",
            "For La Liga, I like LaLigaMichael and NealGardner_ . They don't have podcasts, but their content is usually unbiased, especially Michael.",
            "I haven't gone on twitter in ages so I dunno if they're still this good but I liked footy scran when it was new.",
            "I mean, let's be fair here, he made you uncomfortable prior too.",
            "France is playing against a dead Poland but they have not scored a goal yet. Netherlands is playing against Austria so this could be competitive without many goals. \n\nIdk who they'd play afterwards though.",
            "France",
            "France, they are playing Poland. Austria are tricky, theyve been playing well and might get a draw with the Netherlands, or even win, if the dutch attackers are as bad as they were last night",
            "Hungary, Germany\n\nWhat was Q5?",
            "OH BOY, BASS FISHING",
            "Same shit clearly happened with McKenna too. They mysteriously decided to rule him out when United started sniffing around",
            "You dont crown champions in the group stages. ",
            "Kante is an incredible player and, strangely for a mostly defensive player, a lot of fun to watch. ",
            "Yeah Kante looks like he has benefited from not playing football at high intensity every week anymore as opposed to other players (for example Wijnaldum) who look out of their depth and not up to the tempo after moving to the Saudi league.",
            "Netherlands don't have much of a midfield that can compete",
            "An actual Inter Miami legend, unlike that Argentinian fraud.",
            "You don't have to watch it",
            "Germany and Spain have been very entertaining",
            "Pretty much.\n\nThe knockouts will get tastier but all the good matches in the groups have been from the less favourites",
            "Club football is very much like that as well, I remember being more hyped about the likes of Málaga-Espanyol, Valladolid-Betis, Zaragoza-Racing, Recre-Sporting games than the Clásicos (even in the so-called 'peak' Messi vs Ronaldo era) because they were often the better games.",
            "Your flair led me to learn about a new football club. Unfortunately that's the only positive thing about your comment",
            "Cold af G🥶",
            "you are allowed to wish me well and tell me to get better",
            "The easier side of the bracket for the Netherlands is the one without Portugal.",
            "Portugal is their kryptonite if I was a Netherlands fan id want to play anyone over them besides maybe Germany and Spain",
            "Grealish losing his hair? Labor would lose the female vote forever.",
            "genuinely nothing could make me wish the pandemic back, shit was awful",
            "What did Newcastle do? If you're talking about the DCL links, we've been linked to him for years. Howe's appetite for tall Englishmen is insatiable.",
            "How old are u?\n\nRvP/RvN/Robben/Van Dijk/De Jong/De Ligt/Seedorf/Bergkamp",
            "Congratulations on being young",
            "He might become our all time top scorer. That and the idea of Wijnaldum reaching 100 caps are permanent stains on our country's footballing history.",
            "[removed]",
            "[removed]",
            "I get that because the crests each have their own unique character, but also it’s nice for people to immediately recognize what country you’re representing as the flag is usually more known than the crest. I’ve had many people ask what flair I have since the Philippines is not a big football nation. One thought I supported Ajax for the longest time lol. \n\nWould love it if we ever make it back into an Asian Cup and it turns into the flag (already a pipe dream as we’ve qualified for exactly 1 of them in our entire history, so a World Cup is out of the question)",
            "All the press have gone for it. The numbers are staggering, though. £85mm to €120mm depending on the publication. \n\nI await Ornstein’s tweet.",
            "              Thuram\n    \n      Theo - Griezmann - Dembélé\n    \n    Rabiot - Tchouaméni - Kanté\n    \n    Saliba - Upamecano - Koundé\n    \n              Maignan\n\nBielsaball.",
            "you mean the price or availability?",
            "you can interfere with play from an offside position. maignan can’t dive to try and stop the shot because of dumfries’ position meaning he’s interfering.",
            "The Dutch player was in an offside position and although he didn't touch the ball the VAR team decided he was interfering with play (where he was stood was close enough to the goalkeeper to impact the play / prevent the goalkeeper from diving).\n\nShould make sense if you understand what the offside rule is",
            "Griezmann",
            "Griezmann. Snjieder’s prominence in these discussions comes from 1 season where he was a great player (not the best) in a treble winning side and the best player in the Netherlands team that came second in 2010. Griezmann has been one of the world’s best forwards for almost a decade now.",
            "Watched both very closely, Sneijder was insanely good but Griezmann played well for Country & Club for many years",
            "Griezmann 2016 or 2018 and it's clear.\n\nSneijder's rep benefits a lot from Ronaldo fans saying he deserved the 2010 Ballon D'or over Messi when he in fact was nowhere near that level.",
            "Sneijder.",
            "France because Mbappe and they still look really tough to beat compared to other two who’ve looked quite shaky. All 3 were my top 3 favorites going into the tournament though and they all are playing dreadful lol",
            "France because they still have Mbappe. Without him they look pretty shite though",
            "De Bruyne comes off injured, Lukaku scores but misses two golden chance, Romania lead but Belgium get a draw",
            "Romania to win.",
            "He basically means that they're at the point of the year where they usually take like a month off after a grueling season. So they're tired and can't really do the high energy football people want them to play.\n\nOr at least that's what I think he means.",
            "They’ll use the lingua franca, English.",
            "If they can't speak basic English they have no chance at being international referees.",
            "From what I understand the referees get a list of all the players and the languages they speak before a match. So you'll know if they don't speak English.\n\nI listened to a lecture from former professional referee Jonas Eriksson, he said that you just have to communicate as best you can using body language. He would speak English and just be very assertive. He learned some basic spanish because of how many Spanish-speaking players there are, but he said that it could be a bit difficult to communicate in Spanish during the heat of a match. He gave Messi as an example. He refereed an Argentina match when he was still learning basic Spanish. He could communicate one-way pretty easily with \"NO MÁS!\" and \"La próxima vez, amarillo!\"\n\nHowever when Messi came up to him to ask him something, it was hopeless. He just couldn't keep up. After several \"Qué?\" and \"Repetirlo?\" he just said \"Si si\" and waved him along which Messi just accepted lol.\n\nThe other example was with Akinfeev. Akinfeev speaks absolutely no English. Only Russian. So when he was wasting time Jonas ran up to him and shouted at him to stop doing that in English as assertively as he could. Even though Akinfeev didn't speak English, he knew what he had done so he could presumably guess why he was being yelled at.",
            "My heart is 100% pure granite confirmed",
            "He can’t play on the left right now and that’s all that matters",
            "Game’s gone",
            "Were the first two games of the Euros today also boring?",
            "I mean it’s not like France was impressive and their best player isn’t playing. I think it’ll be close",
            "The Dutch are gonna thrash them. (this is the first game of the Euros, that I'm gonna watch)",
            "at the end of the day those group stage performances dont matter much, if say Germany and England meet in the knockout stage it's going to be a 50/50 match",
            "Are France with \"tactical uncertainties\"? They have been playing boring and getting results for ages. And while others may not agree with him, Deschamps is definitely not uncertain.",
            "first tiebreaker is head-to-head (not GD) and they've lost that to Austria, whatever happens Poland is confirmed to finish 4th",
            "First tie breaker is head to head and they've lost against Austria",
            "He’s been training alone the whole time so far, this wouldn’t shock me.",
            "He was second in expected assists last season and third in xa per 90 he was 0.01 off being first in XA per 90. \n\nIn conclusion you’re wrong",
            "Wonder why we attack down the right?\n\nProbably to boost Saka's numbers, not because he's good at attacking.",
            "That Rashford offside was so egregious, to this day I don't know how it was allowed. One of the more baffling VAR decisions imo",
            "I really don’t get why you guys complain about refs making mistakes but expect them to continue making the same mistakes for the sake of “consistency”",
            "Loved it at the time because it took points off of City but honestly one of the worst decisions I've ever seen",
            "Seems like he learned from his mistake",
            "Piksi may be the worst one honestly. Vlahović doing RW shifts and perhaps the worst out of possesion structure in the tournament.",
            "Doesn't need to be foreigner, Tudor or Jurić would do a good job switching to formation to back 3.",
            "Yeah i just saw a german flair talking about Southgate, this brain rot is spreading everywhere",
            "England should learn a thing or two from Ireland - you should be testing the the potential genetics of all talented players. You should be grandparent maxing.",
            "Sorry he's an anglophobe ( his grandfather was killed by the Brits)",
            "inch for inch",
            "There's going to be a stroke-off in Leipzig tonight, and everyone will be watching.",
            "Stadiums would never allow such chants. And the football culture is nowhere near as loose as it is over in the Europe. If I tried to start a chant that was remotely similar to half of the shit that Europeans chant, I’d get dirty looks.",
            "I mean there are only around 100k Bolivian Americans in the entire United States. And keep in mind the prices, they were apparently selling field/mid level seats for $400.  Even now if you go on ticketmaster they're like $200-$300 bucks and that's before BS ticketmaster fees. Seats in the very upper decks are still $100 before fees.",
            "Oh man ill end up writing a whole article if we talk about that, pressing denmarks back line with a man short out of possession letting them easily play around, seemingly a lack of clear pressing trigger, not using gordon at all/not bringing rashford. \n\nBut you can withstand these mistakes aslong as you put your best players in atleast decent scenerios to actually play their normal games.",
            "Has an excellent record with injuries and isn't really dependent on speed and the like so he has a good while left. He's got margin for improvement in his composure most of all I think, he'll miss sitters then score very hard goals when he has no time to think.\n\nCould maybe see him surpassing Agüero for us, Batistuta seems unlikely and Messi is straight up impossible.",
            "yea I've seen every match so far. I am a complete neutral however",
            "Tbf I didn't find it particularly boring, in much the same way that I wouldn't find a slow-motion car crash boring.",
            "Only his Spurs career.",
            "I hope so",
            "If some mid-tier player called Samuel Zidane rocked up to Valencia you wouldn’t start calling him Zidane would you?",
            "His ball-striking is way too inconsistent. He’s great at carrying the ball up to the final third which eases a lot of pressure for the teams he plays for but he can’t make that count by his own merit.",
            "Just two more  sleeps until Captainpatters gets permabanned from /r/soccer for refusing to get a Murillo face tattoo.",
            "Imagine what it’s like to actually engage with it.",
            "Tienes razón jaja",
            "TBH from all the tournaments he attended with Poland I'd expect him to do what Schick has done for us 4 years ago at least once.",
            "I wouldn't be surprised if the fitness comment was trolling",
            "William Gallas?",
            "Horrendous",
            "Yeah but he was getting the chances... Other than the finishing I don't think we did much wrong",
            "Respect the Homes Under the Hammer legend",
            "having a better LB",
            ">where they’ve already got like 5 different centre backs they paid too much for \n\nTo be fair, we've got six CBs and three of them cost us nothing (Colwill, Chalobah and Adarabioyo).",
            " Davies is on his way there too I think.",
            "Great shout",
            "i suppose they would by definition. i guess i was thinking mostly of the five eyes countries and britain’s former colonial holdings.",
            "3-1 win hopefully",
            "sure, but putting a DM.....",
            "2006-07, 2012-13. For United. All other seasons he was inconsistent or with no legs.\n\n2005-06 for Spurs too",
            "why is this even discussed, there is no way taylor can ever give this if maignan can’t jump",
            "Tbh he’s not that bad at least he comes off as a bit more genuine then thogden",
            "2nd most titles. But I fucked up by including Rangers, only realized that today",
            "Definitely we ain't winning lol",
            "Best player with the initials 'LM' to wear the number 10 shirt for Inter Miami.",
            "i take what i can get",
            "You need to get better",
            "Which is funny that he says that if the Netherlands finish second they will be on the easier side of the bracket because Germany, Spain, and Portugal will be on that side if they all top their groups",
            "Surely super young to have that opinion. Sneijder, Robben, VVD, Van Der Sar and RVP off the top of my head were all way better and played in the last 10 years (did VdS?)",
            "I'm not serious, and lord I wish I was that young",
            "I will support every attacker on their mission to overtake him, even if they play for ajax",
            "didier would have an aneurysm at such an attacking line up",
            "If that was the case then he could easily rotate. Toney's hardly played, Gordon looks fit as a fiddle, Wharton and Mainoo haven't played an insane amount of games...\n\nIt just seems like that back of the pocket excuse England managers trot out, but ultimately they are completely in control of the squad. If you're playing exhausted people that's your fault. \n\nAnyway sorry, I know you're not claiming that personally lol",
            "didn’t watch poland-austria, but slovakia-ukraine was enjoyable",
            "If we both win our groups I'm pretty sure we can't meet until the final. But if Germany win their group and we somehow contrive to finish runners up in ours, we play them in the round of 16.",
            "ah I see, thanks.",
            "The refs simply bottled it with Fernandes sprinting to scream at the linesman and it being played at Old Trafford.",
            "Yea. And we are stuck with him until 2026, I doubt we'll qualify for next World Cup with him. I hope at least that means FSS won't extend him.",
            "With a love of football comes a hatred of Southgate",
            "He either blames the Nazis for that or is a Nazi sympathiser.",
            "They use centimeters",
            "thats mad, they try to superbowl this shit.",
            "It's not inconsistent. It's just downright bad. Even when he plays well, he doesn't score. Having such terrible finishing for a forward is embarrassing.",
            "Considering my insomnia it will probably be 10 short sleeps for me.",
            "Didn’t know she transitioned, congratulations to her 🥰",
            "There's nothing I respect more than stairs going up to the bedroom.",
            "easily already canada’s greatest. unless we’re counting hargreaves as canadian.",
            "Abedi Pele then",
            ">britain’s former colonial holdings.\n\n  \nThe Indian dude then. Sunil C.",
            "And Feyenoord",
            "Just like Vitesse haha",
            "horrible to punch a man while he’s down",
            "They won't have to face neither Spain nor Germany until the semi finals. And if Portugal keep looking like they looked against The Czech Republic, then yeah... It's the easier side of the bracket for me.",
            "van der Sar retired in 2011",
            "Yeah fair enough I was just trying to make the point that when big nations meet in the knockout stages it doesn't really matter how well or badly they performed in the group stages",
            "Plenty civilian casualties tbf.",
            "I say inconsistent because when he does get it right it looks brilliant. Both his finishing and final ball. But yeah, I do acknowledge your point.",
            "Portugal looked very good against Czechia, they just didn’t demolish them 5-0",
            "Okay I'm old then."
        ]
    },
    "[optus] Virgil van Dijk: \"We scored a goal that was a fair goal (..) But yeah, the English referee decided to disallow it\"": {
        "title": "[optus] Virgil van Dijk: \"We scored a goal that was a fair goal (..) But yeah, the English referee decided to disallow it\"",
        "score": 2155,
        "url": "https://x.com/optussport/status/1804284996884271329?s=46&t=-kGI0xDKSORxdpFIU29wCQ",
        "content": "",
        "num_comments": 639,
        "comments": [
            "Someone is hating on Anthony Taylor? I’ve been summoned.",
            "I didn't even know we had beef with the Dutch!",
            "It was harsh because the keeper is “probably” not saving it, but we can’t say that for sure and the player was factually in an offside position right beside the keeper where he would have dived.",
            "It was offside, it's harsh on Netherlands because the keeper wouldn't have saved it anyway, but you've got to give him the chance to try and the offside player blocked that.\n\nThat said, criticisms of the English referees is still valid as it took a ridiculous amount of time to confirm that decision. There's been two problematic VAR incidents this tournament and both have involved our officials.",
            "Goal keeper is never saving that but the fact he can't even attempt to dive with the guy in the way means it's offside interference.",
            "As much as an Englishman (and Liverpool fan bc that’s relevant in this case) I love to shit on English referees.  I can understand the frustration, and I do think it’s harsh, but if this is the most controversial decision of the tournament so far, we see one every week worse than this in the PL",
            "He must be fucking relieved to be finally able to shit on an English ref without risking sanctions.\n\nHe's wrong though, Dumfries was in the way.",
            "English favouring Fr*nch? Come on mate",
            "It was offside.. the goalkeeper would've never saved it. So it sucks, but it was atill offside.",
            "I get he is sour, but blaming his nationality is hilarious",
            "Keeper was never getting to it. Feels harsh in the spirit of things but by law he’s interfered",
            "Nah man. The refs were completely justified in dissalowing that goal.\n\nThe fact he's bringing up the refs nationality just makes him look worse because it shows an underlying bias behind his claim.",
            "Disappointed he didn't mention how long it took for him to disallow it",
            " #NoToAnglophobia",
            "Look I wanted the Dutch to win but it was a right decision. He was offside. \n\nI am a chelsea fan I absolutely cannot stand Taylor but this was the right decision. \n\nI do strongly believe Taylor shouldn’t be a ref at the top flight tho. \n\nI’m a massive footie fan and most refs I cannot name but Taylor I can. A referee should not be known by name. They should just do there job. If every fan knows who they are it just means they’re terrible at there job\n\nTldr Taylor is still shit shouldn’t be a ref but he made the correct call for once",
            "I just kept watching that game thinking Jurgen was somewhere in Ibiza watching Virg yell at Anthony Taylor and laughing",
            "So in this thread I see people putting in reasonable arguments for both sides of whether or not it's an offside and I see people saying that you need to look in slow motion at the keepers footing as the shot is taken. Yet I then also see people saying the decision took too long.\n\nI think Anthony Taylor is a poor referee but this is one of the only non-trivial decisions of the tournament so far so they should be allowed some time. I would just like to see the referee go to the monitor for these 50/50 decisions, although that's not currently 'the process'.",
            "This sort of decision is why you should have the Comms between the officials broadcast, completely understandable that it was disallowed especially when the on field was to do that, but without the context people are free to make up their own narratives.\n\nGoal disallowed: Offside, ain't cutting it",
            "Dumfries was nearly inside the net. Usually its vision blocking offside calls in situations like this but Dumfries was literally in the only spot keeper could move to whether he could save it or not. \n\nIf they let this be a goal, me as a player or coach would cheese the game by letting someone stand beside the keeper the whole game and trying to get a similar result. Absolutely the right call as loathsome as Taylor is and its silly of Van Dijk to not recognize that.",
            "Not all English Referees, but always an English Referee.",
            "Whichever way the officials called it, the decision was going to be controversial. I feel like disallowing the goal was the least worst call here. But the amount of time it took to review was ridiculous.",
            "Why’s he always so passive aggressive",
            "Yea after saying that I'm glad it was disallowed.",
            "I mean, he didn't even look at the screen, right? It's the VAR that had most to do with that decision",
            "Premier League Referee Appointments: Matchday 1\n\n\nIpswich Town - Liverpool: Referee: Anthony Taylor\n\nVAR: Stuart Attwell",
            "He saw Van Dijk and Gakpo in the team and thought he was reffing Liverpool.",
            "The decision was correct.\n\nBut the English referees took way too long to call it. Unless there was another aspect of the play they were checking, which they need to communicate. \n\nThe English referees need to admit that they are not good enough at using VAR rather than passing the blame onto everyone else, which is what they usually do whenever there's a problem.",
            ">We scored a goal that was a fair goal  \n \n[Did ya though mate?](https://static.tvtropes.org/pmwiki/pub/images/ishethough.png)",
            "It was the right call but unlucky tor Holand.\n\nHe ends up beside the keeper due to natural momentum but he was totally blocking an attempt of a save, regardless of whether it could be saved",
            "Boom roasted",
            "If there's anything we know about the English, it's their extreme pro French bias.",
            "Bahaha even the players blame everything on the English",
            "I think it was the right decision, and I say that as someone who hates Anthony Taylor and also wishes nothing but misery on the entire nation of France.",
            "Looking at the view from behind the goal, the player in the offside position had zero impact on the ball entering the net.",
            "This man has spent too much time around Klopp. Public whinges after every decision that goes against them.",
            "People here disagree with someone that just came out of a 90 minute match, filled with emotions afterwards. This is why we get 99% PR and media answers, we just collectively shit on sportsmen that say stuff on the height of emotions. Obviously it's offside, but any player for any country would have said the same thing, be real.",
            "Good to see Klopp's blame game lives on on VVD",
            "He's full of shit tbf. Mentioned how the fighting spirit of the team was good today eventho they stopped playing football in the second half and were just playing for that draw.\n\nDude's completed a degree in media training.",
            "People will hate me for saying this but Virgil whines just as much Bruno both off and on the field but it is hidden because he plays in one of the most dominant team under a pretty likeable manager for Neutrals.",
            "If you're offside, get out of the way. It's as simple as that. Imo it should be disallowed even if it went in the top corner at 100kph, if an offside player is in between the ball and the keeper it shouldn't count.",
            "What do you expect? VVD has always been a giant turd",
            "Everyone who says that \"he couldn't jump\" is so silly. He didn't even try to jump at all.",
            "Idk if it was my camera angle or what but that looked super saveable to me but the player was clearly obstructing him. Correct call, stop being a sore drawer Virgil",
            "It should have stood.",
            "Disagree. But why would the Dutch captain say anything else? I would say the same in his Position",
            "I like to shit on English refs as much as the next guy but I don't think it was the wrong decision in this cass",
            "Ah yes, English, the most famously pro-French nationality. ",
            "What's his nationality got to do with anything? Weird to mention it. Also it was the correct decision.",
            "By the book the referees got that one right. The Netherlands should be more annoyed by that shocking run from Dumfries than anything, absolutely no sense behind his movement there and ended up costing them the goal",
            "The English ref made a good decision, you can't try and use xenophobia to make excuses for yourself.",
            "lol",
            "'**'We are not English, We Are Scouse''**",
            "Stood directly next to the keeper in an offside position. \n\nDon't understand the controversy at all. I don't even know why it took so long to rule out.",
            ". ..m",
            "Anthony Taylor: \"There are only two things I can't stand in this world. People who are intolerant of other people's cultures. And the Dutch.\"",
            "Speculating if the keeper could save it would add way too much nuance to an already subjective rule. \n\nIt’s harsh but it’s the correct decision",
            "Clear offside.  Sucks, but clear.",
            "I think the ref would be right to launch a complaint againt van Dijk here. You can't highlight a referee's nationality/ethnicity when criticizing them, believe it or not.",
            "I can’t seem to find the euros or copa America any chance someone on this thread could point me in the right direction of a site or different sub if not.",
            "Only the best of the best.",
            "My initial reaction as it flew in was offside. Keeper appealed for it immediately which was also smart.",
            "As much as I dislike Anthony Taylor... Well vvd is absolutely wrong here and the goal should never stand.",
            "deserved after that boring match",
            "The ENGLISH referee.\n\nYou can't say that.. that's RACIST!!!!!!",
            "oh, shut up. imagine France converting such a chance, there would have been a waterfall of complaints not even a thousand of Dutch dams and canals could contain",
            "It's not the like the Dutch to blame the referee. /s\n\nWhether or not Maignan would have got there is irelevent... His potential to make a save was blocked by a player ahead of the last defender... Therefore that player was active.\n\nSo it was a clear offside.",
            "We really think that was a harsh call? Sure maignan maybe doesn't stop it but we won't know because he had a player blocking him from diving...",
            "I just love that the EPL refs and VAR controversy continues with minimal effort.",
            "It was the correct call though.",
            "Goaltender interference is a mystery in many sports.",
            "VVD has plenty of experience with these clowns in the PL. Regardless of whether it should have been disallowed it still took them 5 fucking minutes to come to a decision when every other so far has been near instant. Of course it's the refs from this league that are involved in the first major controversy. Complete embarrassment to the nation.",
            "Dumfries did not interfere simply because the goalkeeper would not ever get that ball.",
            "My understanding of the rule is if the offside player interfered with the play, which is clearly did.  That's it.  It's not subjective in that sense and you don't even have to ask the question \"would he have saved it?\".  You can think the rule sucks or whatever, but seems the right call was made.\n\nI was watching the Fox broadcast and having to listen to Landon Donovan and Mark Clattenburg drone on and on about \"subjectivity\" was painful.  I am again asking for a broadcast that can mute all announcers and just hear the crowd/game noises.",
            "lets just put 1 player on the keeper the whole game then",
            "Mourinho laughing his ass of somewhere while scratching his giant balls.",
            "Real surprise that he would disagree, but no. It was not a fair goal, the Dutch player decided to be offside and interfere with play.",
            "It’s all right when he’s helping liVARpool out though isn’t it",
            "Most people here don't seem to understand the difference between standing close to the keeper and being a hindrance.\n\nYes he was standing behind the defensive line, yes he was standing close to the keeper (1.5 - 2meters) but he was standing to the left and to the front of the goalie. He was in no way obstructing his view nor his movement.\n\nIt was a clear goal and the ref should have at least went ant watched the footage himself",
            "Never like this guy",
            "\"Come on, I'm not playing for Liverpool atm you aren't being payed to screw my team over for this match\"",
            "That was an easy offsides call.",
            "Rules are rules kid.",
            "It was a clear offside, but it’s understandabla that they are furious. The keeper had no space to dive for the ball because if a player standing there clearly in offside position. \n\nYou can’t say for sure that he would have saved it (he would probably not), but it was still offside.",
            "I'm all for hating on our referees but that was offside all day long",
            "Yea, I don't think he's going to say the same thing if Drumfries was standing next to Allison",
            "I for one am happy to see our shit referees exposed, we have the only ones that take forever on VAR and aren't willing to take responsibility. I guess they know the difference between a corner and a goal kick though",
            "VVD sounds like a Liverpool's captain, a victim of gross injustice, forever.",
            "Classic Dutch. Can dish it out but can’t take it",
            "I thought it should’ve stood but is taylor expected to overule VAR there when he doest’t have the best angle to determine if it should’ve stood or not",
            "Whether it was wrong or right about the decision itself,  I'm glad he had a pop at the ref cos they are absolutely wank. Payback.",
            "I would say it’s not offside, but I can’t really say I’m unbiased",
            "As soon as the check was taking longer than 5 seconds I knew it was Prem VAR. thought it was only our on pitch refs for the games. Once you figured that out, 100% disallowed goal. Guys are shit",
            "YERS VIRG SET ABOUT HIM",
            "Clear offside.",
            "He's such a baby lmao. He kicked a player in the first half, without gettinf anything on the ball and was arguing with the Ref about the decision. That's the defender equivalent of diving.",
            "It \"unfortunately\" was the right call and the fact that he's calling it out as a bad call give Eng refs the ability to say \"people complained either way so we don't care\" and that's annoying.",
            "You can take the player out of Liverpool…",
            "Did Dumfries interfere with the line of sight of the goalkeeper? No\n\nDid Dumfries make an attempt at playing the ball? No\n\nDid Dumfries physically block the goalkeeper from attempting to save the ball? No\n\nThe goalkeeper just mentally *thinking* \"I cant save it cos this guy is in the way\" does not count as blocking the goalkeeper.\n \nIf he had attempted to dive or move towards making a save, and had been physically blocked by Dumfries standing there, then yes, it is a offside. But thats not what happened. Dumfries is like 1 metre away and the goalkeeper made no attempt at going for the ball.\n\nThe referee isn't there to rule based on the \"psychology\" of the goalkeeper. He's there to referee based on actions taken by the players.\n\nIts a clear goal, and yet another shocking display of refereeing by the English.",
            "I thought it should’ve stood but is taylor expected to overule VAR there when he doest’t have the best angle to determine if it should’ve stood or not",
            "The two games refed by PL refs has been both controverial its kind of proving something here.",
            "the english did this",
            "Haha.",
            "Haha.",
            "Rules as written the refs took the right decision and that is that. However, everyone who has ever kicked a ball around knows the goalkeeper could've never saved this and Dumfries was not actually in the way. I kinda get both sentiments.",
            "This guy is a douchebag. His team was second best for 95% of the match and by some way and he’s here complaining because a dirty English didn’t give his team an offside goal - how about you focus on trying to play better?",
            "Klopp left and Anthony Taylor decided to transfer it to Netherlands because of VvD, Gakpo and Gravenberch 🤣🤣🤣",
            "Mourinho has entered the chat",
            "La Liga refs really have to step up their game now. I thought they were the worst, but Van Dijk is making is making me doubt it.",
            "It's offside. Shut up VVD",
            "Crying With Klopp: The Liverpool Years",
            "Anthony taylor was horrible all game long, but that was the right call imo.\n\n\nWhat the fuck is wrong with english refs though?? In the prem i chalked it up to rigid HR-like process they have to follow, but theyre just as shit in this competition as well",
            "if Anthony Taylor has no haters I'm dead.",
            "Was the call right? I guess.\n\nFck Anthony Taylor? HELL YES!",
            "It's a call to action for all of us. Like someone pressing a Dark Mark and summoning Chelsea fans.",
            "I caught one of my students sending hate mail to Anthony Taylor.\n\nWe're in South Korea. I was so proud",
            "I think about that free kick he gave against Alonso several times a year",
            "You mean Canthony Taylor. Can’t make the right decision.",
            "The one time he actually made the right decision lol",
            "He's best mates with my neighbour and sometimes visits. I'll let him know that you care.",
            "He's best mates with my neighbour and sometimes visits. I'll let him know that you care.",
            "Fuck Anthony Taylor indeed.",
            "I think this is more about him being Liverpool captain rather than Dutch.",
            "Mate it’s England, everybody dislikes us",
            "Been going on since 1665. Virgil still not over the Battle of Lowestoft. \n\nhttps://en.m.wikipedia.org/wiki/Second_Anglo-Dutch_War",
            "Rival East India Companies innit",
            "We don’t… but your refs are the worst. Not even talking about the offside. He completely took all the tempo out of the game.",
            "too many Liverpool players in that team for Taylor to not have beef with them",
            "The Dutch did keep stealing your ships from the Thames estuary in the 1600s, van Dijk is simply bringing back the beef.",
            "You must not have been following Liverpool that closely over the last couple of seasons.",
            "You certainly have beef with Liverpool, including the refs",
            "Didn’t they burn your fleet down in your own home that one time?",
            "It all started with Austin powers.",
            "It's Taylor, VVD probably already hates any game involving him as something like this always seems to happen",
            "Oh, we've had rivalries and battles with each other going back centuries!",
            "We love the English in Amsterdam, wreaking havoc with their stag do parties",
            "You don't, but I thought the English people on this subreddit also had beef with English refs.",
            "you don't Both english and dutch fans have beef with English refs. Join us brother",
            "I'd say the English and the Dutch are quite friendly tbh. Certainly you wouldn't find many English picking France to win over Netherlands. So this is more about English refereeing specifically.",
            "Everyone has beef with the worst referees of UEFA.",
            "Pretty sure its beef with english refs",
            "[deleted]",
            "English refs have screwed us over in the 1974, 2010 finals. Now this, so yes.",
            "You have beef with the whole world. 😆",
            "kankerop",
            "There was no way of saving it but if by some miracle he could have made a magnificent save he would have been blocked by a player in an offside position.\n\nSo it's offside.\n\nSucks for them but it wasn't unfair in my opinion.\n\nWhat is unfair is that every game I skip is great and every game I watch sucks.",
            "100%\n\nThat is a correct call that resulted in an unfair decision.",
            "It's pretty much the same as the goal Leipzig scored vs Madrid. The goalie had pretty much no intention or very little chance to go for the ball, but he theoretically could have pulled a miracle save if not for the offside player\n\nAnd since the player completely eradicated this possibility, it's a correct offside call",
            "It was harsh because he has for sure not saved it. The ball is in the goal before he reacts to the player. It'd be a different thing if he had dove and hit the player.",
            "Whether the keeper was going to save it is completely irrelevant. It's about the player interfering with play which he was. Shouldn't even be a debate.",
            "That was similar to a marginally offside being ruled out - in the sense that the offside didnt really affect the goal. Rules are what they are.",
            "This line of argument is basically justifying implementation of the rule on a pure hypothetical. \n\nRule in such instances (esp involving Goals that is since different situations have their own context, like a 2 footed lunge is different context even though it' still attempted action) should be applied on what actually happened.\n\nDid the GK even make an Attempt?\n\nNo he did not. So he should not get the benefit of that Advantage or Active-Passive rule. He simply decided (in objective reality of how things happened) to forgo on even playing. That is what happened.\n\nOne can not concoct some hypothetical of *OH But IF IF IF XYZ*.",
            "I just feel like the keeper should have just dived...like lean over and bump the player if that's the case. He didn't even get his knees down like he was starting a dive. If he makes an effort to dive at it, clear cut offsides call. He just points at the guy and doesn't even try so it all becomes speculative. There's enough room there for the keep to at least lay down and prove a point.",
            "Yes its the equivalent to the japan goal against spain in the world cup. We all know about the curvature of the ball and still we all knew that that ball was still outside the lines, but we couldn't say for sure so the ball was allowed.",
            "We can say that for sure. The view of the keeper wasnt blocked. At all. So the keeper knew he could not save the shot, otherwise he would have dived. If he had dived, he would have been blocked by the player who was offside. THEN it would have been a correct decision to disallow the goal. English referees have been terrible for 30± years mate",
            "Yeah I’m not sure what took so long, especially as it was given offside on the field",
            "Completely agree on time taken, Stuart Atwell took far far too long and that was an embarrassment to football. It was also the right decision.",
            "I’m wondering, would it have counted if dumfries ran completely into the goal because maignan could dive?",
            "> There's been two problematic VAR incidents this tournament\n\nWhat was the other?",
            "Totally get it's the letter of the law but I'm pretty sure the ball was already in the net before he even realised Dumfries was there tbh. There was absolutely no chance they could say he had a realistic chance of saving that",
            "> There's been two problematic VAR incidents this tournament\n\nWhich in ~20 games is a pretty good record actually",
            "That's my take, watched it and can see why it was ruled out \n\nThe moment the commentator said its going to var and it was you know who in control \n\nYou knew this was not only getting cut off but that they would take a fucking ice age to get there \n\nJust shows the problem with var over here is the people on the field and in front of the screen, not the tech \n\nIn IT terms, a pebkac error \n\nWas looking forward to next year after seeing how var has been done in this tournament, especially offside \n\nNow I know next year nothing is fucking changing at all in the prem",
            "I kinda remember there are questionable refereeing yesterday. There was a tackle by netherlands from behind, the ball goes out, and it was a throw in. Not long after that, dembele dive in front of VVD amd france got free kick in favorable spot. Many small things like that.\n\n\n\nBut to disallow that goal is a correct decision imo. Dumfries is unlucky to be there",
            ">but you've got to give him the chance to try and the offside player blocked that.\n\nMaignan didn't have time to dive. That part is irrelevant. Dumfries was offside and the ball went close to him, therefore he's interfering with the play.\n\nI don't like this \"interfering with the keeper\" bullshit. Make it objective: an attacking player close to the ball in offside position is offside and the play is voided. I'd rather have things be objective than subjective (if it wasn't subjective, VAR wouldn't have taken the age of te universe to confirm the field decision).",
            "Koeman said if you take that long you have to allow it. It's either more obvious or a goal..",
            "The player, in offside position, was in the way of the ball. Just by standing there, he created an impact because the opposition doesnt know if he will hit the ball or it will go though. While unlucky for Netherlands, because it is arguably a mistake by Dumfries for stickign in offside position while attack was ongoing (and it wouldn't probably change the outcome had he been onside), this decision is easily defendable by the ref imo.",
            "I don't think it was an impossible save.  Unlikely, but not impossible",
            "The fact that it's the *only* controversial decision and the *only* time VAR took an absolute age goes to show the problem isn't the technology but the poorly trained, undeservedly arrogant and indecisive English Premier League referee's.",
            "Of course we see worse every week, because ref got it absolutely right this time.\n\nTaylor's only mistake was taking too long for a pretty obvious offside call.",
            "Why do Liverpool fans think they’re the only ones who have decisions go against them lmao",
            "Dumfries was completely irrelevant, keeper would NEVER have made the save.",
            "Everyone knows the brits secretly love the french",
            "Rules say if player in offside distracts or blocks the GK it will be called. \n\nThe he wouldn't save it either way is true and sucks but we also don't take that measurement when calling a penalty where the ball would have gone out of bounds either way or a player plays hand while the ball would have clearly missed the goal.",
            "Did the goalkeeper even notice him before the ball went past ? Didn't look like it too me, and then he wouldn't have interfered",
            "If he would've never saved it then it shouldn't be offside since there is no interference with the play.",
            "\"The goal, which was mistakenly disallowed by a, I'm not going to say what nationality, referee. We know I can't say that.\n\nIt was an English referee.\"",
            "He’s talking about the amount of decisions that unfairly went against Liverpool last season.",
            "Yeah imagine he said that about a more controversial nation like Israel or an Arab country, the outrage would be massive",
            "Completly irrelevant, we don't take this measurement for penalty, so why would it count here? ",
            "Keepers starting position could have been a step to the left if no one was there.",
            "Also since when did the english favour the french",
            "I mean yeah, he plays Premier League..\nEnglish refs and Anthony Taylor in particular fuck him over all the time. ",
            "There is no way the goalkeeper would have saved it, if Dumfries wasn't standing there. Dumfries wasn't actively standing in the way. You have to actually participate in the attack, to be offside.\n\nIn a case like this, where it's a matter of interpretation, I don't understand why the ref has to talk with the VAR for 4 min., without checking the screen himself.",
            "Nah feel free, we can actually take it",
            "As loathsome as Taylor is? Come on dude. He's just a ref.",
            ">If they let this be a goal, me as a player or coach would cheese the game by letting someone stand beside the keeper the whole game and trying to get a similar result.\n\nIf the goalkeeper was standing in his normal position during Xavi's attempt, no one is complaining about this offside call. The element of controversy is the keeper already being taken out of position by his previous save, to such an extent that another save would have been all but impossible. This comparison therefore is not a very fair one imo.",
            "> But the amount of time it took to review was ridiculous.\n\nYeah it just brings up more VAR issues. What was taking so long? Is it a competence issue or does it raise questions on time limits needing to be put in place? \n\nOf fucking course in a tournament that's on the whole been run really well the only controversial VAR decision comes with the English referees. It's not a coincidence.",
            "He just felt like being a dijk",
            "It’s the aura",
            "Tell me you’re Roma’s fan without telling you are a Roma’s fan",
            "I assume he's lying, he's captain and Simons was upset at it being ruled out, from his POV he didn't really seem to understand it either. Making your star attacker team mate feel unfairly robbed of this goal could motivate him.",
            "No chance. In our last game against United Bruno was on the floor crying his eyes out and screaming about 5 separate times in the first 20 minutes. Virgil doesn't come close to that.",
            "That is arbitrary. We cannot determine if he didn’t try to jump. Maybe he didn’t because he saw somebody in the line. Maybe he had no intention to jump at all. Impossible to determine. What is factual is that there was somebody in his jumping line. Therefore it was offside. And I am Dutch btw.",
            "Because he looks like an idiot who don't know the rules.",
            "??What does this have to do with the Euros",
            "He's only offside if he's interfering with play. Hes not interfering with play as the keeper is flat footed from the previous save which rebounded from the box and never getting to it",
            "how can you interfere with a play that you have no ability to change the outcome of? by definition, you cannot. so the fact keeper had 0 chance to save it actually *is* relevant to the semantics of “interfere”",
            "I mean, if the keeper is going to dive and get a hand on that ball, then Dumfries location is exactly where he would end up so he is \"in the way\" in that sense",
            "The French were favorites going into this match. Had higher xg, but registered less shots on target. Not to mention that absolute wild miss from Greaseman.\n\n\n'Play better' works both ways ",
            "If Anthony taylor has one hater, it's me",
            "If Anthony Taylor has a million haters, I am one of them. If Anthony Taylor has ten haters, I am one of them. If Anthony Taylor has only one hater, that is me. If Anthony Taylor has no haters, I no longer exist.",
            "Call's right by the rules but there's no way the keeper saves that. He's already late in seeing the ball after its shot",
            "If I knew how to work that announcement feature Reddit has, I’d absolutely be firing the Fuck Taylor klaxon to get all the Chelsea fans in.",
            "Clearly it's Alonsos fault Gazzaniga fly kicked him into the chest, completely missing the ball smh",
            "Yeah this is it. Feel like everyone's just forgot he puts up with Anthony Taylor and Stuart Atwell's bollocks on a weekly basis.",
            "England 🤝🏻 France 🤝🏻America\n\nThe unholy trio of universally loathed nations",
            "Oh I know that. But he's saying it like we have beef with *them*, which I'm not aware of",
            "Given that we are completely stinking out the tournament with our dour football and dreadful referee's, this time the hate seems proportionate.",
            "We're the Millwall of Europe aren't we? 😭",
            "It's mostly Taylor to be honest",
            "No shit, I wonder why everyone hates you 🤣",
            "Premier League refs when they retire and speak to up-and-coming referees about their profession:\n\n\"The Leviathan of the Seas, is it? The terrible shadow? The PGMOL with a million eyes and a million ears? Bad decisions? cluelessness? no accountability? I studied your methods in your school, and I do know the evil that you do because I was once part of it\"",
            "Rivals in being cunts, that’s what. Fuck ‘em both.",
            "The most annoying thing was the constant attacker fouls he gave against Dumfries and Depay. The Dumfries one was so stupid because Hernandez‘ position was so bad and he just got bailed out by the call.",
            "\"Managing the game\"\n\nRefs should probably be drilled that they don't need to manage the game, they need to ref it.",
            "Now think of what it's like for us having to put up with them all season and not just in internationals.",
            "I don't think Taylor was great but he's not the worst. He was a million times better than the ref in the Italy vs Spain game the night before, who put in maybe the worst performance I've seen. And last I checked, he was not English and the Champions League final ref.",
            "I watched the game in France, French commentators were also angry... because the refereeing \"à l'anglaise\" was letting the Dutch play violently and get away with it, as they saw it 🙃",
            "Tbf I didn't see most of the match but it does sound annoying",
            "I mean objectively wrong in this case though. He was better than the portuguese ref against Poland",
            "*medway estuary thank you very much!",
            "Check the glorious revolution where Dutch stadholder William 3rd was 'invited' to become the king of England. A complete English affair which was totally won by the English and there was no such thing as foreign royalty landing in England with an invasion force.",
            "Personally the moment COVID was over for me was when I finally saw English lads dressed as a vaginas again in Amsterdam.",
            "Amsterdam - “come here to take drugs, get drunk and fuck prostitutes”.\n\nAmsterdam when it attracts the lowest of the low - shocked pikachu",
            "Eyyyy Hillsborough jokes 🤙🤙",
            "You should have had a player sent off after 60 seconds in 2010",
            "r/footballhighlights often has games in full FYI if you don't have access to them elsewhere.",
            "For the love of god please stop watching England games then 😂😂",
            "I think the problem is also that apparently there was some discussion about whether to call it offside or not in the VAR room.\n\nSo then have Taylor take a fucking gander at it. Amateurs.",
            ">What is unfair is that every game I skip is great and every game I watch sucks.\n\nAre you me? Actually went to a cinema viewing for this one, never again lmao.",
            "lol stop watching England then",
            "It’s offside. The keeper when positioning himself has to account for his defenders and where the opponents are in order to assess danger. A player standing so close to him affects his judgement.",
            "While this situation has often been called offside, that’s not the rule as written. The actual rule for determining if a player is interfering with play is:\n\npreventing an opponent from playing or being able to play the ball by clearly obstructing the opponent’s line of vision or\n\nchallenging an opponent for the ball or\n\nclearly attempting to play a ball which is close when this action impacts on an opponent or\n\nmaking an obvious action which clearly impacts on the ability of an opponent to play the ball\n\nI don’t believe the attacker does any of the above, and thus it shouldn’t be called offside, which I think would match most people’s common sense of how this situation should be ruled.",
            "Which is funny since the Tottenham's second goal (in the famous hairpull game) stood despite the exact same reason ffs",
            "Correct call that resulted in an unfair decision is a perfect description for it, and sums up my thoughts on it all. I'm absolutely gutted for Simons as well, getting subbed straight after that call would sting.",
            "Yep. In UEFA even English referees have to follow rules, not just vibes",
            "It's not that clear cut. The rule isn't whether or not the keeper can save it. Interference is defined in the IFAB rules as:\n\n\n\n\nA) preventing an opponent from playing or being able to play the ball by clearly obstructing the opponent’s line of vision or\n\n\nB) challenging an opponent for the ball or\nclearly attempting to play a ball which is close when this action impacts on an opponent or\n\n\nC) making an obvious action which clearly impacts on the ability of an opponent to play the ball\n\n\nNothing was clearly or obviously interfering the keepers' ability to play the ball and he wasn't blocking the keepers' vision from where I saw it.. ",
            "Right. It’s the call with the least amount of subjectivity applied",
            "Thats not the rule though. And honestly nobody can tell me they would rather the ref be able to make judgement call if a keeper is able or not able to safe a shot.",
            "Agree that it's almost certainly going in regardless, but don't agree that it's not obstruction because he didn't dive. A keeper can be subconsciously affected by someone standing next to them in a position that blocks a dive, it's natural for a person to consciously/subconsciously not want to dive straight into another person. And we do actually see Maignan make a small motion that looks like he was going to dive, but then stops (maybe because the player is there, or maybe because he has no hope of saving it, we can't really know). That's why it's viewed as interferring with the keeper/obstruction.\n\nOf course he's not saving it even if he does dive for it, so really sympathise with Netherlands. But from my neutral perspective it's technically it's consistent with how refs apply the rules in general. They view the foul seperate to the \"what was going to happen if there was no foul\" consideration. As an analogy to explain this, we do have a common scenario where two players are going for the ball and one gets to it before the other but draws a foul as a result, but their touch is super heavy and they're 100% losing possession with or without any foul. The foul is still given regardless of whether they would've retained possession or not. Like, this happens often when a keeper rushes out and the attacker knocks the ball past them but with such a heavy touch that the ball is 100% going out for a goal kick and if there's no contact the attacker is never getting it (in fact some players look for the penalty rather than trying to score, they know they can't get to the ball first and also control it perfectly whilst maintaining balance to score, so they get any touch they can to get the ball past the keeper first and then ensure there's contact). Refs always give the foul/penalty because the keeper has missed the ball and made contact with the attacker, they ignore the fact that the attacker lost all control of the ball and wouldn't score if the keeper avoided contact. They seperate the foul from the rest of the scenario and focus solely on the fact that a foul of some sort occurred. And I think this is what happened here, it didn't matter if the shot was unsaveable or not, they were only focusing on was the offside player interferring with the keeper in any way, and I think that's a definite yes (he's standing where the keeper would dive). Very harsh and unfair, but consistent.",
            "Goalkeeping is so instinctive - you're not going to see them make an attempt to save the ball if in the split second they have to react they're being impeded.\n\nTo me it's impossible to argue that having a forward standing next to the goalkeeper didn't impede their ability to *attempt* to make a save",
            "With your idea we will get keepers having to lunge into offside attackers to \"attempt\" to defend the ball so they can get the decision in their favour. This will lead to a lot of injured keepers and attackers.",
            "That's not the rule though. There is no stipulation that the keeper needs to dive, he moves in the direction of the ball and a player is there, that is what matters. It was the correct decision according to the rules",
            "No, the decision was 100% correct. Even if it's indeed very unlikely the shot would be saved, it's not up to the referee to make this kind of call that \"he's not saving that anyway\". That just opens up a new huge can of worms. What if there was an offside player but the shot was top bins anyway? Should that also be allowed because \"he ain't saving that\"? What if Xavi's finish was more to the middle of the goal, would that suddenly be offside because the shot is saveable?\n\nOffside is purely about positions and not about the quality of the finish.",
            "The player was standing inside the line of the ball literally next to the keeper. It's the epitome of interfering, even if it was still almost certain to be a goal. It's not complicated and these decisions are good for football, even if they seem a bit tough on the attacking team. If he was outside the line of the ball then it should have stood. \n\nDon't forget that VAR confirmed it, although no fucking clue why it took so long.",
            "That isn't the way the rule works though. You're just making up an entirely new requirement not present anywhere and believe me mate, I'd have much preferred a Dutch win here as well.\n\nThe decision was correct, now whether the rule itself is a good one in its current form? That's a whole other discussion.",
            "[deleted]",
            "And if it was up to interpretation, why wasn't Taylor called in to check it on the screen himself?",
            "I would think that would count",
            "Yes",
            "Yes. The problem was not that he was in an offside position, the problem was that he was standing in the direction the goalkeeper would have had to dive. I think if Xavi Simmons had shot in the opposite corner, he would have been fine too ",
            "That's what he should've done, tbh. It's happened so often that players that go for the short rebound on the first shot become offside and interfere with keeper vision or movement let alone the times they simply block their teammate's shot that they should be training to circle outwide or out of bounds as fast as possible instead of looking back to see the play. You made the run and the ball didn't bounce to you? GTFO.",
            "If Dumfries was behind the goalie then it wouldn't be offside because he could not interfere with him.",
            "The penalty in the Spain-Croatia game. It's really questionable if there was actually a foul but even if you give the benefit and say yes it was a foul, it should have been a red card due to not attempt to play the ball",
            "Doesn’t matter if he had a realistic chance to save it or not, that’s not how the offside rule works in this scenario. \nBy being stood where he was, he denied the keeper the opportunity to try to save it, and is therefore interfering with play. Whether he would have saved it or not is irrelevant.",
            "If a player covers the view of the keeper to the ball, it can also end up in the net before the keeper sees it.\n\nI can see the decision going either way (depending on the ref's interpretation of that situation). There's also the possibility that the keeper might have been be positioned a bit differently if the player hadn't made the run that landed him in an offside position.\n\nThere's all kinds of little influences. To me it's one of those decisions that you don't like getting for your team but don't mind as much if the other team gets the goal taken away.\n\nI think this is the subsection of the rule that would apply:\n\nhttps://www.thefa.com/football-rules-governance/lawsandrules/laws/football-11-11/law-11---offside\n\n> a player moving from, or standing in, an offside position is in the way of an opponent and interferes with the movement of the opponent towards the ball this is an offside offence if it impacts on the ability of the opponent to play or challenge for the ball; if the player moves into the way of an opponent and impedes the opponent's progress (e.g blocks the opponent) the offence should be penalised under Law 12\n\nIt probably depends on how you interpret \"**if it impacts on the ability of the opponent to play or challenge for the ball**\". Like here, it did impact the ability (so offside!) even if the success rate with (or without) the offside player would still be about 0% (so no offside!) from how it looks to us. \n\nBeing able to go for the ball is technically \"challenge the ball\" even if you miss it. \n\nThere's also this (maybe as a point of comparison):\n\n> If an attacking player remains stationary between the goalposts and inside the goal as the ball enters the goal, a goal must be awarded unless the player commits an offside offence or Law 12 offence in which case play is restarted with an indirect or direct free kick.\n\nIn the end: I don't know but I'm also sure that it's not a clear offside or no offside situation.",
            "It's not up to referees to judge ability when making decisions. \n\n\"Oh that last man foul isn't a red because the player running through with the ball hasn't scored for 50 games\" would be ridiculous.",
            "That was a foul on Dembele. Van Dijk kicked his foot. People are just looking for reasons to hate on Taylor.",
            "If you take that long you have to stick with the on field decision.",
            "He's right it shouldn't have taken so long, that was clear as day offside that should have been ruled out within 10 seconds.",
            "Obviously he and Virgil are saying these things, their team would've won if it counted lol.",
            "It was given offside on the field, so surely if it takes that long then it can’t be an obvious error",
            "Impossible based on body position and circumstances. If he were ready to move maybe, but he wasn't.",
            "I mean, its the only VAR check that has taken this long because its the only subjective offside decision we have had no? There's no debate as to whether he was past the last defender (the bit that is speeding up the decisions), the debate here is whether it counts as offside, which is fair to take longer no?",
            "Even commentary was commenting on how long it was taking compared to other referees and their decisions to do with VAR and/or offsides.",
            "And it was VAR fault anyway, as they weren't able to make a decision.",
            "Wasn’t the point I was making. It’s because he plays for us you numpty",
            "It doesn't matter if he would have saved it or not the issue is he didn't have a chance to.",
            "Queen Elizabeth I rolls in her grave.",
            "Not true. The rules say in this situation Dumfries actions have to clearly impact on the goalkeeper's ability to play the ball or prevent the goalkeeper from playing or being able to play the ball.",
            "If he hadn’t he would’ve dived into him.",
            "In theory he could. But we all know he wouldn't. You can't really be 100% sure he wasn't in his way. It sucks but yeah.",
            "Not really",
            "Two?",
            "Which has what to do with the Dutch national team? Seems like a pretty irrelevant thing to mention",
            "Cry me a river, all teams get unfair decisions against them. I dont see yamal talking about refs in the spain game bcz his goal got disallowed in el clasico",
            "Because that would be a more controversial nation, not a nation that he plays in and that is universally recognized to have shit refs? What's your point",
            "What? I don’t get what you’re saying sorry",
            "Well the ball doesn't really matter for a penalty - a foul is a foul whether its \"off\" the ball or not. That's why you sometimes (rarely) see them given for tussling at corners even if the ball is going absolutely nowhere near the area of the foul - it's still a foul on the player.",
            "So you agree with exactly what he is saying. Why arugue then",
            "because he's only offside if he interferred with play. If it's impossible for the keeper to get to it how could he have possibly interrefed with play? If the keeper was still flat on his back would you be ok with it being called offside?",
            "Not true, he was still standing up",
            "Mate check the vid again, Maignan noticed the player after the ball was in the net",
            "Lmao imagine being as dense as a Dutch and thinking an English man would favor the French",
            "Didn’t complain when the refs fucked us over in the finals when playing them though",
            ">\"There is no way the goalkeeper would have saved it, if Dumfries wasn't standing there.\"\n\nMost likely. But we don't actually know this for certain.\n\n>\"Dumfries wasn't actively standing in the way. You have to actually participate in the attack, to be offside.\"\n\nThis however is just flat out wrong. He is actively standing in offside in the GK's diving path. By nature he is involved and a distraction whether he wants to be or not. If Maignan dives he literaly collides with Dumfries.",
            ">You have to actually participate in the attack, to be offside\n\nDo you even know the rules of the game you're talking about?",
            "Yeah I like it. It's fun winding people up and being hated.",
            "All but impossible, still sounds subjective to me. And seeing the refs make mistakes week in and out with standard fouls, handballs and offsides, I am not in favor of letting them make subjective calls that will take a long time to check and still end up being wrong to half the fans.",
            "I’m English but I see where you’re coming from.",
            "You don't count, You are biased.",
            "> We cannot determine if he didn’t try to jump.\n\nSpeak for yourself, please. I can easily tell if he tried to jump or not. \n\n\n> Maybe he had no intention to jump at all\n\nYou are not planted on both your feet like a rock in the surf if you are trying to jump.\n\nReally, everyone who has played goalie before can tell that there was no chance to jump. \n\n> And I am Dutch btw.\n\nHappy Birthday.",
            "I really really really hate to be that guy, but: *doesn't",
            "You can't use that argument. \n\nOtherwise you're going into \"well he probably wouldn't have scored from there so that obvious foul isn't a penalty\" territory.\n\nYou cannot say that a player stood immediately next to the keeper is not interfering with play.",
            "But that's my point he really wasn't. If you watch the footage from more than 1 side you can see that dumfries would never have been in the way of the goalie",
            "This isn’t a thread about Griezmann complaining like a twat though, is it?",
            "If Anthony Taylor has millions of haters, 3 of us will be among the crowd",
            "We should his lauders, he’s good for us but shit for Chelsea",
            "Well if what you say is true then Anthony Taylor can't have just one hater because I will be better right beside you in this cause",
            "Beautiful champ",
            ">but there's no way the keeper saves that. He's already late in seeing the ball after its shot\n\nSo what, though? That's not the decision that needs to be made. You don't not call fouls on players in the box because they wouldn't have been able to finish their chance anyway.",
            "People don't actually make the connection he's saying this because he's used to the \"English referees\" in the PL?",
            "America has done **nothing** to deserve any loathing. We eat our freedom fries and give freedom to other countries. Have you ever heard of 9/11? Checkmate, ladies and gentlemen, we got him.",
            "The rest of the the UK’s PR is undefeated",
            "We're back to back World War Champs you'll never sing that",
            "How did Germany not make this list?",
            "Laughs in Russian and Chinese",
            "It's not England mate. It's English refs specifically.",
            "I think he’s just sick of dealing with English refs. That, or he doesn’t enjoy that you can’t put an offside player blocking if the keeper can attempt a save",
            "I think he’s just highlighting how shit English referees are",
            "I really want to say \"It's coming home\", but I'm growing tired :(",
            "We're pretty shit but I never want to be compared to Millwall for as long as I live, that's too far",
            "Nah we're Leeds",
            "We still remember Howard Webb's magic.",
            "Where has the city of Amsterdam or the country of the Netherlands ever said this? We never invited you, you just decided to abuse our culture and then go home and tell your shit mates about it",
            "Are you trolling? Ain’t no way you are being serious 😂",
            "He played the ball",
            "Cheers buddy.",
            "Thanks!",
            "As a general rule, not having Taylor have a look reduces the risk of error.",
            "Stuart Atwell on VAR. A box of cereal would be more competent than that useless bastard.",
            "> making an obvious action which clearly impacts on the ability of an opponent to play the ball\n\nHe was standing between the keeper and where the ball was going.",
            "I'd assume \"making an obvious action\" must include moving and standing in the way of the keeper, else it would be fine to just put someone on the line blocking the keepers movement",
            "He was standing where the keeper would have dived to wasn't he? So that is covered by the first part of A.",
            "It's covered by C, I think, though interesting that it says \"obvious action\" which suggests if he stood totally still he couldn't be offside?",
            "It's subjective, but because the players actions could fall under A and C AND the call on the field was offside, the call on the field cannot be overturned (the goal cannot be disallowed because it was never allowed...)\n\nIt's unfortunate, a bit unfair for both the player and the spectators, but the right call.",
            "You don’t want to be in a situation where it would be legitimate for a referee to think “the keeper might have got fingertips to it but couldn’t have stopped to going in, therefore it’s a goal”",
            "It’s a judgement call either way.  Interference is subjective.  The linesman obviously can’t tell.  It’s up to the center ref and VAR to decide.",
            "Yes it is. Standing next to the keeper does not in fact mean you are influencing the play.",
            "But this is the kind of shit that happens in the PL with these fuckers all the time and it overshadows the game, they always seem to be on the wrong side of it. When it’s subjective they seem to get it wrong and it leaves everyone baffled. Congratulations, they’ve done it again and the whole of Europe can see. That was a legit goal the keeper couldn’t save that for shit lol. And they take forever to make their minds up it’s painful to watch.",
            "The rule is about a situation where a player in off side actually prohibits the keeper from engaging in a situation.  \nFor that to be ruled, surely the keeper has to try to engage in a situation. He didn't.  \nSo really, calling this goal offside is making a case for a hypothetical situation where the keeper could have tried to save the ball and would maybe have been hindered, but certainly not dor the actual situation.",
            "It is 100% up to the referee to decide whether or not the offside player is preventing the keeper from making that safe. Otherwise you might as well scrap the passive offside rule and just call offside every time.",
            "It's not about quality of the shot but the distance of the ball from the goalkeeper. Just to take this to an extreme, if Dumfries and the goalkeeper were stood at the corner flag it's unlikely this would be offside. So there has to be a point in between where the goalkeeper's ability to play the ball is considered to be affected.",
            "I guess giving the benefit with the attacker is now not factored into decisions now?",
            "VAR didn't confirm it, they just didn't disagree strongly enough with the interpretation to overrule it, as nearly always is the case.",
            "It's a good rule, because without it you'd have the ref having to judge whether each shot was \"saveable\" which is a can of worms you don't want to open.\n\nBy that logic, interference offside shouldn't be called on top bins finish if the keeper can't save it anyway. Which is ridicolous.",
            "Hilarious to be so confidently wrong",
            "They only go to the screen if it’s recommended to be overturned, which the VAR obviously didn’t recommend",
            "English Officials: “We don’t do that here.”",
            "Because the on field decision was offside. He’d only be asked to got to the screen if VAR thought it should be a goal",
            "Yea but it is Rodri so offences get downgraded one step",
            "> It's really questionable if there was actually a foul\n\nIs it? I don't understand how anyone can say that it wasn't a foul.",
            "Cheers had forgotten about that one",
            "How far away from the keeper would he need to stand for you to deem it not offside though?",
            "He said he understood that they see it as disallowance, the only thing he didn't was that.",
            "I dunno.  It's close enough where you have to call the offside though",
            "I think it took as long as it did because the VAR team were bickering amongst themselves about whether or not to overturn a refereeing decision.\n\nI'm of the belief that if the Linesman decided to keep his flag down, it would have been a goal for the Netherlands. If he put his flag up (which he did) then it would have been called off.",
            "Yes and that’s what happened. He prevented him from being able to play the ball.",
            "Standing where he would dive is preventing the keeper from playing.",
            "At the time the ball was played, it could've gone anywhere. And based on that, Dumfries in Maignan's peripheral vision must've impacted his assessment. \n\nOnly because we know post factum that the shot went far away from Maignan's reach, we can assume he wouldn't save it anyway. But at the time of the shot, an opponent clearly going for a rebound is impacting keeper's decisions.",
            "But he didn’t dive because he couldn’t save it. And because he didn’t dive, he didn’t get interfered with imo",
            "Nah Taylor was going to give the goal but then he saw big Virg run over to celebrate with Simons and he thought fuck I can't have a scouser happy so he called offside.\n\nIt's actually a genius level play by Deschamps to start Saliba over Konate cause if Konate was on the field then he would have cancelled out Van Dijk and the goal would have stood.",
            "That brining up someones nationality is weird lol. If an English player said it but the ref is french it would be talked about as if he's xenophobic lol.",
            "I think he's saying that if the player was never getting the ball and is fouled it's still a pen. Or similar. \n\nBasically ifs and buts don't matter",
            "The \"keeper is never getting to it, therefore it's a legal goal\" standard is the same as \"that player would never score from there, therefore it's not a penalty anyways\"  \nI presume that's what he meant",
            "In fairness, from top angles, by the time Maignan dove, Dumfries was actually behind the keeper, which a lot of people are ignoring, and makes this much trickier.\n\nUltimately, while I do disagree with the final decision, my actual gripe is how long it took for Stuart Atwell to decide.",
            "Same as you then.\n\n>Active in reddevils\n\nLol",
            "I can because I did. If the keeper had attempted a save then yes he was interfering but the ball is past him before he even reacted.",
            "No it's a thread about hate towards the Dutch apparently...",
            "One more right here.",
            "anthony taylor eats corn the long way",
            "Let me say I’m the biggest hater",
            "There are dozens of us. Dozens!",
            "Taylor should never ever be allowed to ref us again. Like he’s shit for everyone but he is downright criminal against us",
            "He was good for Chelsea when he didn't send Azpi off in the FA cup final for the penalty on Auba but an insane narrative was created after the match",
            "« America !! We’re number one !!! - Maybe if we stopped saying that people would stop trying to cut our heads off. We should say „we’re top 10!!!“ then the terrorists’dd go „that’s fair!!“  »\n\n- Daniel Tosh",
            "You had me in the first half not gonna lie lmao",
            "Fact checked by real McCarthyist patriots 🇱🇷🦅🇱🇷🦅🇱🇷🦅",
            "Congrats with the one-two 🤝",
            "I mean the US did save Europe’s ass twice, europoors have no right to hate on the land of the free 🇺🇸🦅",
            "They’ve been chill for a long time, since, you know they weren’t chill",
            "Er because Germans are the most self-conscious People on earth?; guilt is weaved into their psyche from such an early age that collectively they are making a cultural artform out of being inoffensive.",
            "They’ve been all right for the past 60 years or so",
            "There was an incident about 60 years ago. Where it made it a bit awkward to put the Germans on any tongue in cheek lists of most awful nations.",
            "Howard Webb public enemy number one in Poland",
            "Yeah, the refs are disappointing expecially Oliver and taylor",
            "I don't know what you're talking about. Graham Poll is loved in Croatia.",
            "oh its both",
            "Correct, I like my English homies but Taylor can choke on pudding",
            "This is so much like 2004-16 \"Golden Generation\" crap that we all know how this is going to go.\n\nGet through group, probably beat someone in the second round by virtue of having a couple of individuals that can do something, go out in the QF (meekly, probably on penalties) to the first actual contender for the title we play.",
            "Sing it with me!\n\n*~~30~~ ~~40~~ ~~50~~ 58 years of hurt! Jules Rimet still gleaming!*",
            "Lol, there are a lot of deluded Dutch who think people go to Amsterdam so they can look at the  canals. Hate to tell you, but this is pretty much all that Amsterdam has to offer, ask anyone around the world about what Amsterdam is famous for, what are the two things they are going to say?\n\n>you just decided to abuse our culture\n\nYour culture of smoking weed and having sex with trafficked prostitutes? Truly a rich legacy.",
            "Don't worry, he or you (whoever it was) bravely deleted it 😂",
            "and did de Jong play the ball or did he play Alonso's chest with a Sparta kick?",
            "Yes I agree I  think for the sake of the game passive standing is still counted as an obvious action. My issue more with the second part of the rule. From what I saw on replays it didn't look like he was actually in the same line as a dive, and the goal action happened after the keeper recovered from a previous action..\n\nIn case of doubt the wording of the rule seems me to imply that in case of reasonable doubt, the ruling should be in favour of the player instead of the keeper",
            "Nope part A is only about vision and the keeper had a clear line of sight to the shot",
            "That only matters *if the keeper could see him*. If he didn't see him there can't be interference. It would then only be interference if the keeper did dive for the ball and hit the player.",
            "No that would only pertain to vision e.g. a playing blocking a keeper's ability to actually see a shot. Reasoning C is the most likely candidate but keep in my that it says 'clearly impacts'. Imho it's not that clear that him standing there blocked the keeper's ability to a ball. Because they weren't parallel and the goal seems to already go in by the time he recuperated from his previous dive. \n\nThe rule states 'obvious action' that 'clearly impacts' the ability of the keeper. Because of the wording of the rules, in case of doubt, the goal should have been awarded.",
            "I wasn't sure about that either. When I have time I'm going to look for some precedents. But it could very well be that it counts as an action for the sake of the game.\n\nBut tbh the player moved in to help a shot and stopped going for the ball once he was out of the play. It's really a difficult on-the-edge case.",
            "*Ref has to go to the keeper and check their finger strength.*",
            "But we're already in that situation with the refs deciding \"the keeper might have got to that but the defender might have been in the way, therefore it's not a goal\". It's a judgement call either way",
            "No it isnt subjective ??? If a player stands between the other player and the ball, its interference. Thats an objective truth.",
            "They “always seem to be on the wrong side of it” because of people like you who want to be mad at refs for any reason whatsoever, even when they follow the laws of the game to a T.",
            "The rules are quite clear. It's not a legit goal.\n\nNow are the rules properly adapted to this type of situations? Probably not, and if you assume that Maignan couldn't make the save (which is extremely likely) then yeah the goal could have stood.\n\nCalling it legit is just wrong though. It's not particularly poor refereeing either.",
            "What no? It was done word by word in the rules??? This wasnt a judgement call.",
            "It says: „a player moving from, or standing in, an offside position is in the way of an opponent and interferes with the movement of the opponent towards the ball this is an offside offence if it impacts on the ability of the opponent to play or challenge for the ball; if the player moves into the way of an opponent and impedes the opponent's progress (e.g blocks the opponent) the offence should be penalised under Law 12“ \n\nHe blocks and interferce with the ability to engage, by standing next to him. It doesn’t say he has to literally engage. It also doesnt say the ball has to be „saveable“.",
            "Do you actually think that Maignan should just dive at Dumfries in this situation? That would be absolute nonsense and completely counter-intuitive for Maignan, and also potentially dangerous for the both of them.",
            "The ball is really not that far from the keeper. If Dumfries isn't there and it's an expected shot by the keeper, a top keeper saves that 75% of the time imo. \n\nIn this scenario he probably doesn't save it, but Dumfries takes away his opportunity.",
            "This is the obvious issue with the rule. There is clearly subjective interpretation of whether the keeper can play the ball or not. From the multiple angles I saw Dumfries was at least 2m away from the GK when the ball was struck, and the GK had enough room to dive in front of Dumfries to attempt to play the ball. Even so the GK didn't even attempt to play the ball, I don't see how Dumfries can be interfering with play on the notion that in another timeline the GK might have dived for the ball.",
            "[deleted]",
            "well that's weird. If it's so dubious that it takes several minutes to judge then I'd rather the main ref take the decision.",
            "But it took several minutes so clearly they weren't sure. In the end somebody there had to take the final decision and I'd rather it be the main ref.",
            "Because he kicks the floor and falls over. I wanted it to be given but I don’t think it should have been.",
            "Not standing between the keeper and the trajectory of the ball would be a start.\n\nImagine if the keeper tried to dive to save the ball. Was the offside player standing within the space required for him to do that? That's how far.",
            "Either in an onside position or outside the goal post.",
            "That's the part where it's subjective. It's an unfortunate decision overall. Both groups can claim that the decision should go their way and they would both have a strong claim.\n\nThe referee then has to decide whether he thinks the player really interfered with the goalkeeper making the save. If the goalie could dive, the player would be interfering. However, with him getting up after a save and having his view blocked by the defenders in front of him, it's probably almost impossible for him to react in time to actually attempt a save. In that sense, the player isn't interfering with the play.\n\nSo yeah, tough call.",
            "That part is so dumb. VAR shouldn’t take into consideration what the on field refs say. They should try to get the right call. I mean ffs the refs on the pitch also make reffing decisions based on VAR being able to intervene (calling offside early or not(",
            "But dis he? The keeper didn’t even try and attempt to save the ball. If he had tried a save and then got stuck on Dumfries, then he got hindered.\nNow he stood still, so does Dumfries hinder him?",
            "Nope. He didn't prevent him. Look again. https://imgur.com/a/YUqBDCm",
            "Nope. He didn't prevent him. You are just assuming.",
            "He couldn’t dive because Dumphries was in the way. Nothing else matters after that, it’s all hypothetical and irrelevant to the rule.",
            "If it results in less Liverpool players in the Euros, I'm all for it",
            "Ah right, yeah I don’t want it changed like it’s better to have something as close to black and white as you can but you’ll sometimes get these decisions which are correct but feel harsh",
            "Whatabout maybes",
            "I think more like \"the ball would go out of play, the player could never catch up to it. Yet it is still a penalty if they get fouled, regardless of if they could catch up to the ball\"",
            "Keeper cannot attempt a save if someone is stood directly next to him.\n\nEverything else is irrelevant because you're then making the law even more subjective which is going to make offside even more unnecessarily complicated than it already is.\n\nA keeper is unlikely to attempt a dive if there's a body blocking where he would dive to. Anything that relies on a referee having to be a mind reader is not a valid law and never will be.",
            "And my Axe!",
            "Anthony Taylor gives dildos a bad name",
            "How long does a refs list of blunders against one team need to get before you stop giving him their games?",
            "We’re not number one, we’re the only one. One mile is longer than one kilometer, take that communists, can’t hear you over the sound of our FREEDOm",
            "This is gonna get someone for sure lmao",
            "Europe does Pearl Harbor to us, we come and save everyone with freedom, they repay us by keeping the kilometer. Game’s gone",
            "yeah there are a lot of people who would disagree with you here",
            "> about 60 years ago\n\nI wish it were that, it would make me about 20 years younger! (More like 80 years ago)",
            "Fuck Howard Webb",
            "Anthony Taylor public enemy number one in Rome, but maybe not only there anymore",
            "I don't know, pound for pound, I think Oliver has done his job excellently recently, made all the decisions you'd expect him to make since his holiday",
            "Or Gareth shit houses all the way to the final and we get beat 6-0 by Germany",
            "Don’t know why someone downvoted, it’s funny",
            "Clearly played the ball. Alonso should've been booked for diving",
            "Clearly impacting the ability for the keeper to play the ball is a lower standard than clearly impacting the keeper playing the ball. There's no doubt that his ability to play the ball is impacted. Any attempt that he would have made would have been hampered by his positioning, hence he clearly impacted him.",
            "*mediocre*",
            "The objective part of the call is that Dumfries is in an offside position. The 'level' of interference is definitely subjective for me. Hypothetically, if Maignan was further out of position, like at the right post, Dumfries might be *technically* in his path but he is not interfering with the play.\n\nWe saw the controversial call with Bruno Fernandes against City about a year and a half ago. I think most people agreed it should have not stood, and I see people making comparisons with this that it should also not have stood. But with Bruno's goal, Rashford was interfering to the point that Ederson had to factor Rashford's movement in to his decision making process. *For me*, that counts as interference. When the offside position has no bearing on the decisions of the goalkeeper, I personally don't think they are interfering play from an offside position.\n\nIt's definitely a close call, and I understand why this would not get overruled by VAR, but I do want to understand why you think this decision is entirely objective and there is no judgement call involved in your opinion. Agree to disagree is also fine, but I am just curious where you're coming from.",
            "there is always a bit of subjection in decisions. If the keeper and Dumfries stood way more to the right near the other goal post I have a hard time seeing a ref dissallowing that, because youre 100% it didnt matter whether Dumfries was there or not",
            "It’s completely 100% subjective as to whether Dumfries is interfering with play.",
            "If the keeper is standing next to the left post and a player is standing right in front of him offside blocking the view it's not offside anymore since this season of the goal is scored next to the right post where the goalkeeper wouldn't be able to save it anyway\n\n\"Could the keeper have saved it\" is officially part of the rules for passive offside to become active now",
            "> No it isnt subjective ??? If a player stands between the other player and the ball, its interference. Thats an objective truth.\n\nNowhere in the Laws of the Game is this stated.\n\n> or\n\n> gaining an advantage by playing the ball or interfering with an opponent when it has:\n\n> rebounded or been deflected off the goalpost, crossbar, match official or\nan opponent\n\nThis is what it is about.  Further:\n\n> a player moving from, or standing in, an offside position is in the way of an\nopponent and interferes with the movement of the opponent towards the ball,\nthis is an offside offence if it impacts on the ability of the opponent to play or\nchallenge for the ball; if the player moves into the way of an opponent and\nimpedes the opponent’s progress (e.g. blocks the opponent), the offence\nshould be penalised under Law 12\n\nYour comment that you  need to stand between the other and player and the ball being automatically interference is not objective truth if you look the Laws. There is a lot of discretion in play in interpreting this.",
            "Also what is process of determining if a shot is saveable? Are we making it dependent on the skill of the keeper? His size? His average reaction time? His alltime best reaction time? His jumping reach? Compare it to past saves he has made? Past saves other keeper have made? \nThis obivously sounds ridiculous. There is no good due process to judge something like this.",
            "If you do not even try because everything happens too fast, there is no hinderance in actuality.  \nIf he actually stood too close to impact any movement, ok, but he didn't do that.  \nSo a call like this is purely hypothetical, in a different situation a keeper might have been impacted if he was even able to react, already standing and moving when the shot was made, etc.  \nIt's nonsensical",
            "Devil's advocate, it also says \"if it impacts on the ability of the opponent to play or challenge for the ball\".\n\nThat is a subjective assessment - as many have argued, keeper didn't dive because the ball was past him already. Its true that he couldn't have dived because of the opponent, but it's subjective to say that impacts the ability to play or challenge for the ball (I.e was it \"saveable\")\n\nI think the right call was made, but there is still some subjectivity involved and by calling it as offside they are necessarily determining that it was potentially saveable or the offside player had no impact.",
            "There was enough space there to dive or try, yes. He didn't because he simply couldn't react because it happened too fast, not because there was no room to try due to the opponent player.",
            "Possibly, but my point is that there's going to be a subjective cutoff between the two outcomes and that's what people should be debating. But IMO it's not 100% either way and that's likely one of the reasons why the referees spent so long debating it.",
            "How can he take away the opportunity when the keeper wouldn't have saved it, and in fact didn't even react to save it. It makes no sense.",
            "Exactly, calling this active offside is basically a call for an alternate reality where the keeper was actually in a position to even try to save it, but in our universe he didn't even really react. It was impossible for him, no hinderance thus occured.",
            "I’m sure you’ve been reading FIFA rule books lol\n\nIt doesn’t matter if it’s inches away from the keeper or a rocket in the top corner. He’s in the way of the keeper diving — it’s interference by the rules and it’s not controversial. It’s not like the NFL pass interference rule…",
            "I think the original call should just stand in these cases, unless the VAR check is for an incident the ref missed. In this case the assistant referee judged Dumfries to be offside and affecting the play, I don’t think Taylor should be called to the screen if the VAR can’t confidently say the call was wrong in their opinion.",
            "So let’s say the goalie would stand near the opposite goal post you would still deem it offside?",
            "I think you are confusing the theoretical possibility with the factual situation.\nOf course Maignan wouldn‘t have got the ball in the actual situation, but by his positioning, Dumfries acts as an obstacle that deprived the goalkeeper of the theoretical possibility, and that is unfortunately being sanctioned here.",
            "Is there a chance he prevented him? If yes it has to be called",
            "I don’t see it that way though, he didn’t dive because he couldn’t get to the ball. He only saw Dumfries standing when he looked at the ball in the net. If he had dived and Dumfries was in his way, then it’s interference for me. Idk if i’m wording it all right to make sense but. \n\nAnd that’s bias aside because I’m Belgian. I’d like for them both to lose , for me he just didn’t interfere. I mean they looked at it for 3 minutes straight, so it must have been discussed",
            "Me too. They need to have a proper rest in the Summer so they can be fit and ready for CL football next season.",
            "And my bow",
            "That got me thinking… What is a bad name for a dildo? I mean, other than Anthony Taylor. Hole pole?",
            "Made a separate comment along these lines https://www.reddit.com/r/soccer/s/nzn1GDIjAC",
            "1 Kilo is more than 1 pound tho",
            "WW Foreign Diplomacy Sigmamaxxing.",
            "I'd actually say, that ppl globally have a favorable view of germany/germans. I regularly travel for work and when I tell ppl, that I'm from bosnia, but live in berlin, the feedback about germany is overwhelmingly positive, no matter if it is southeast asia, China, Morocco, the US, Mexico or south america.",
            "Thats not the rule and it shouldnt be. How do you determine too fast? Average reaction time? Ball speed? Distance? It would horrendous to make it a subjective call.",
            "Would you think disallowing the goal would have been the correct call if Xavi’s shot was a little bit less powerful?",
            "I agree he isn’t getting there, but don’t agree with this, you can’t dive if someone is stood next to you.\n\nBecause the player is offside and between the keeper and the ball, he must be interfering with play.",
            "[deleted]",
            "Yeah there really needs to be a time limit on certain things. Like if you have all these cameras at your disposal, live and slow motion, and yet an entire team cannot confidently make a decision within 30-40 seconds then what the fuck is the point? What could possibly be taking THAT long? \n\nAfter that it's a case of trying to force reasons to disallow a goal OR incompetence. Neither of which should be happening at this level.",
            "Yes. If a player in an offside position either affects the goalkeepers movement, or vision, i would deem that offside. It does not matter if the goalkeeper «wouldn’t have reached it anyway», as that is purely theorethical as soon as a situation like this occurs",
            "Correct as long as there is a 1% chance that he prevented him driving for it or distracted him by being there it's rightfully called",
            "Good try, but I don’t fall for fake news buddy",
            "It is always a subjective call, that is the whole point of distinguishing between a passive and active offside in the first place.   \nWe determine it by looking at the actual situation, if the keeper even tries to attempt a situation with the ball and actually gets hindered, for starters...\nYou certainly don't make a call based on it hypothetically being a hindrance in another situation, thats absurd and that is what happened here.",
            "It would have been correct if the keeper tried to save it and got hindered in the process by an offside player.  \nHe did not.",
            "He could have tried to save the ball and dive with a slightly different angle in this situation. The opponent didn't actually leave no room to try. The keeper didn't because it was simply impossible for him to react in time. There was no hindrance.",
            "Maignan is on his toes to dive towards the ball, but looks to not finish the dive due to Dumfries. if Maignan was clearly flat footed or still stuck on the ground with near zero movement towards the shot you'd be right, but he did try to make a play for the ball.",
            "Your last bit is wrong. Since when do referees make judgements on what players can physically do? If a ball is overplayed into the box and is heading out of play, but the defender chops down the striker, it’s obviously still a penalty. Dumfries is literally next to the keeper and preventing him from diving — this is obvious. \n\nAgain, this isn’t NFL pass interference rules. He is right next to the keeper and is interfering with the keeper’s ability to “challenge for the ball” — you’ve literally copy and pasted the part of the rule that is relevant and broken lol. Might want to focus more on that reading!",
            "Yeah, ignoring the decision itself the VAR was disgraceful. It can’t take that long. I’m not a fan of a hard time limit for decisions because some cases can have a lot going in them, but something needs to be since at least the PL refs have shown to not be decisive enough in the VAR room.",
            "The sad part is that even though you're clearly joking, there are way too many people who actuay believe and parrot that stuff...",
            "So you’re saying that he would need to either dive at the player next to him, or to dive at an unnatural direction to dodge the player, which A. slows down the reaction time to make the save attempt and B. makes for a far worse save attempt in general. Why should the goalkeeper do that just for the looks? Do we really want theatrics to be even more incentivised in football? I definitely don’t.",
            "”He could have dived with a slightly different angle” ”there was no hindrance” \n\nPick one.",
            "There are only 2 objective facts\n\n1) Dutch player was offside\n2) if the keeper were to save the shot, the Dutch player would have been in the way.\n\nEverything else is subjective\n\n1) we don’t know if the gk would have dived if the offside player was or wasn’t there\n2) we don’t know if the shot was saveable\n3) we don’t know if the gk takes a different position if the offside player isn’t there\n\nIf you don’t want goals to be ruled out, don’t stand offside next to the goal keeper. Quite simple",
            "[deleted]",
            "We dont have parrots here buddy, only EAGLES\n\nRock flag and eagle",
            "It's not theatrics to actually wanna do an action to impact the game in a sportsmanlike manner.  \nYou are making the case that the keeper wouldn't even try to get in any position at all to save a ball because there is an offside player standing 2 meters left to him in the most optimal angle to dive?  \nRidiculous.",
            "I would say that absolutely should be the case....it's not difficult to dive behind the guy or try to push though him to get to the ball .. by the keeper doing nothing there is nothing then for the attacker to interfere with",
            "You dont get it. There was no hinderance because there was no attempt. You are basically saying the keeper could be at the other side of the goal and it would be still a hindrance. It's silly.",
            "And if the keeper is at the other side of the goal these two \"facts would still apply\". And yet we all would hopefully understand that a call against the goal would be silly.  \nSo ofc there has to be some form of subjective interpretation happening here. The call if in the current situation there was an actual hindrance happening, not just a hypothetical one because the offside player stands in the shortest path to the ball saving attempt.",
            "The question is if the offside player is affecting the keeper’s ability to make the save, not can the keeper actually make the save. That’s never been the referee’s role in any facet of the game lol. The answer to the first question is clearly yes. The second question literally does not matter…"
        ]
    },
    "Polish fan threw a bottle at the police in Berlin": {
        "title": "Polish fan threw a bottle at the police in Berlin",
        "score": 1439,
        "url": "https://v.redd.it/8svthudbd28d1",
        "content": "",
        "num_comments": 429,
        "comments": [
            "**Mirrors / Alternative Angles**\n  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soccer) if you have any questions or concerns.*",
            "Don’t throw bottle is a pretty easy rule to follow",
            "Yes, police in riot gear is not going to respond politely to aggression.",
            "My brother in Christ, have you never played video games? You have a one projectile weapon against an enemy that's basically immune to projectiles and probably has higher combat stats than yourself, what are you doing? Use other dialogue options",
            "nice right hook",
            "Berlin Riot Police don't fuck around. They are infamous for it.",
            "Love the impromptu drunken stagger huddle. Everyone Is holding each other up",
            "Should behave yourself *even more* when abroad",
            "Good clasicaal euro is what we needed",
            "No i prawidłowo 😀",
            "What are you expecting? The german police trained the entire season to be violent against football fans, even when there is no reason at all. So if you actually give them a reason they will definitely be as violent as possible.",
            "Just don’t. Act a fool and not comply. Never know right",
            "Anschlussed his face",
            "Bloody English fans again",
            "I mean,if he throws a bottle on him, he should be arrested, but punching a man in the face doesn't seem adequate for the policeman.",
            "Police in Germany can be excessively aggressive and there is no accountability",
            "Somebody correct me but that doesn't seem like the right protocol for this type of action in Germany right? The cop seemed to act more out of anger in that moment. I can imagine his squad pulling him to the side later on.\n\nEdit: I'm from here, I rarely see them get this active immediately. They're usually very turn the other cheek\n\nEdit2: yeah you can see the officer on the right nudging the other one to get him to stop",
            "Stay glassy, Poland",
            "Threat eliminated",
            "Rename the sub r/soccercrowds i guess",
            "I didn’t see anything being thrown?",
            "Frankly, I'm happy to see that and I'm Polish. This is the only language our troglodytes understand. So he got an instant lesson with Polish subtitles embedded.",
            "There's smart ways to antagonize police and then there's throwing bottles at them in broad daylight from a cornered space. Laudable objective but poor execution.",
            "Can't be true. Only England fans cause trouble abroad.",
            " 7 times  before  got schoole, and went to time out.",
            "That officer came at him like a tank, no chance.",
            "People with glass chins shouldn't throw glass bottles",
            "Obviously he lacked knowledge of the German police. They don’t fuck around.",
            "technical response , squared him off. he was being too agress, Maybe its Germany. this country could easy host a world world cup overnight",
            "Not uncommon unfortunately. In Bali, Singapore and Thailand it's usually Poles or English people doing this shit.",
            "what is your cause, most important what is your action!",
            "copa america starts very soon",
            "8p kick off is not to coommcaflivated its 8am",
            "That was for 1939",
            "Play stupid games win stupid prizes?",
            "A loooot of boot licking going on in this thread.",
            "Knocked his fucking hair off of his head",
            "well donce take downs",
            "While I understand the response, it was unprofessionally personal for that one. Should have just arrested him and charge him, that is what the court is for.",
            "Dum dumm",
            "I would say those is Instant Karma 🤷",
            "fuck around...",
            "Twat fucks around and finds out.\n\nWhy should the police \"engage\" politely with a knob who isn't? It's ok until he does it to the next person, who isn't police - then whining about why there are never any police around starts.",
            "Always getting a clip of Euros fans wilding out ever single day now 😂😂",
            "Gleiwitz 2.0",
            "Very satisfying",
            "Throwing bottles at the police is totally unacceptable",
            "It's not the police's job to mete out justice. It's their job to restrain suspects with the *necessary* amount of force and let prosecutors and the court decide how to deal with them.\n\nThe alleged bottle thrower is a cunt for doing it but throwing a right hook doesn't appear to be the professional way to handle this.",
            "Fucking drunks lol a problem anywhere they go",
            "Decent punch",
            "Fuck around & find out ¯\\_(ツ)_/¯",
            "I for one won't throw bottle at people. Especially not at police who can \"legally\" manhandle and even kill me.",
            "Polish culture ahhh...",
            "While the guy deserves this for throwing a bottle. After seeing the way they’ve dealt with anti genocide protestors lately I feel the German police have gone back to their default settings from 80 years ago which seemed to have remained dormant for a while",
            "How much you wanna bet his Club team is Legia Warsaw?",
            "Just another display of how poorly the police are trained at self defense, de-escalation and impulse management.",
            "Kurwa!",
            "Somehow England fans will be blamed for this",
            "What fans are these?",
            "qatar world cup makes more and more sense",
            "Ok, so this is ridiculous. We have a group of Polish fans and no one is shirtless?! Co to za kibice?",
            "Bloody English fans acting like hooligans again",
            "lol",
            "Imagine if he was one of the minorities thats been killing for faith in germany, the cop would ask him politely to behave until he kills atleast 3 people...",
            "That’s how to deal with these fucktards, wish the British police were like this",
            "That wasn't a good idea.",
            "Fuck about and find out. I hope his mates were briefly impressed by his act of derring do before he got taken down.",
            "Fuck the Police on the one side vs. Fuck the Polish on the other",
            "Fucked around, found out.",
            "That punch  was so deserved",
            "Learnings: there’s always a bigger cunt than you",
            "Polizei don’t fuck around.",
            "Kudos to the riot policeman. All options on the table but he just clocks the guy.",
            "Great response. Fuck that idiot.",
            "England be over here like 😬",
            "They hit him like it was 1939",
            "Should police be socking people in the mouth? I think this guy was an idiot asking to get handled, sure, it's just laying out the right hook makes it look a bit personal, y'know? Decent punch though.",
            "Oh no, not the Germans again",
            "I like the gun, no I don’t play call of duty",
            "Germany is ready, pop",
            "Who drank the barrow dry, fuck it man use it",
            "Don’t piss off the German police",
            "The riot police uniform reminds me of \"No Russian.\"",
            "What watching Poland will do to a man (yes he’s wrong just the first angry euro vid I’ve seen)",
            "German police climate activists how cute",
            "Great to see the police not messing about here\nStraight in to stop these hooligans",
            "\"In my book, though, someone comes at you with a bottle, I'm sorry, that is a deadly weapon, he's gotta take the consequences.\"",
            "I think a good punch in the face is a very reasonable outcome? 👍",
            "I guess German Police officers has a MOTO fuck around and find out",
            "British guys asking for trouble everywhere they go. Thought they ll learn from the Thailand fiasco",
            "Polish fans are rowdy after a loss. Someone tried to fight me in Russia ‘18",
            "[deleted]",
            "why are football fans such hooligans?",
            "[deleted]",
            "That pig at the jumping on these three guys going backward was there just for the escalation.",
            "If all he did was throw a bottle, the fan absolutely does not deserve this. That police officer is acting like an absolute thug and could've killed that fan. He literally threw a fucking hook to his head. That's police brutality. People justifying that shot on this thread are absolute rats",
            "ACAB",
            "1939 vibes",
            "Probs to the drunk guy with the scarf. Wanted to have it at first but then ended up viewing with his mates. \n\nUK needs this kind of policing ASAP",
            "[deleted]",
            "Was that an elbow or right hook? Nice",
            "This is why Qatar in WC forbade alcohol in public areas it help  to minimize such conflicts...",
            "Polish are scum Eastern Europeans in general are very dirty people",
            "Would have been shot in the US. \n\nHow stupid can someone be?",
            "It’s funny in countries in USA,  I support the left lift support popl",
            "Fair play, the Germam police don't fuck about.",
            "It’s called disorderly conduct in most states, USA.",
            "Easy to take one , but worst",
            "Fundamental was learnt somehow",
            "Hope he was spitting some nonsense about geo political warfare",
            "As a former Polish minister once said on a plane: Ratuuunkuu, Niemcy mnie bijąąą!",
            "[removed]",
            "As the saying goes, don't throw glass if you live in a stone house",
            "Even if I was an idiot who wanted to throw bottles...\n\nWhy would I throw a bottle at the police in riot gear?",
            "im gonna tell my mate the referee",
            "Poland really bottled the qualifications...",
            "\"But but our sports team performed poorly \"",
            "So that’s what makes life so simple? Don’t throw bottle at the police? I’ll have to remember that one. I’ve been doing it wrong for years",
            "it still doesn't justify what happens later, if it's a fan zone the supposedly lethal projectile is made out of plastic and it's not going to hurt anyone in that type of gear that is quite literally designed to handle bottles since that's what demonstrators tend to have on hand.",
            "Even the normal police should not respond politely to such behaviour \n\nYou can have all the fun and drink as much as you want but the moment you start to trouble others is not expectable",
            "They are legally bound to use the mildest means, not seek revenge.",
            "German police treat peaceful protesters pretty much the same way",
            "Oooo, time to utilise my training!",
            "A friend of mine threw a Champaign bottle at the Spanish anti riot police during a new year Eve in Barcelona in 2008 and they politely asked us not to do it again.",
            "And they love it when it happens 🐖",
            "He has the \"drunk\" modifier, that's a -10 to intelligence but +5 to throwing",
            "MY LIFE IS LIKE A VIDEO GAME",
            "You know when the enemy has a skull icon that you dun goofed.",
            "Hey pickup that trash!\n\n\"No\" \n\nCombine beat down occurs",
            "Sounds like a challenge to me. Brain the high level enemy get op gear at the start of the game when you loot them. Easy mode lets go.",
            "\"oh no, my savegame isn't loading, I'm stuck in this situation now\"",
            "Then the health bar and the music comes out\n\nThe exit disappears \n\nAnd you realize you are fucked",
            "fisticuffs with an armoured opponent isn't the biggest brain move",
            "Mama said knock you out",
            "Not really",
            "Nope, very much a poorly executed punch…",
            "Noticed it during Union - Feyenoord, i was glad there wasn't any huge fan trouble then.",
            "No kidding. I turned up to brandenburg gate in 2014 to watch the world cup final and was greeted by Belin riot police tackling a guy to the floor and restraining his girlfriend from getting involved. Great game, lovely atmosphere",
            "Yeah they’ve gotten a lot of experience beating up pro Palestine protesters and arresting jews for”antisemitism “",
            "Lol. During the G20 summit in Hamburg the support police forces from Berlin were all sent home after one day because they literally **fucked** around openly in the streets (and pissed everywhere while being extremely drunk).",
            "it’s two mates trying to prevent their 3rd even more drunk friend with the scarf from getting into confrontation with police and arrested",
            "And not a mobile phone in sight. Just everyone living in the moment with c.1939 vibes",
            "They are to be fair 😬",
            "Not in Munich. Fans and police get along here.",
            "As they should be.\nBehave and you don’t get beaten up, it’s so simple",
            "And German police is still nice in comparison, Dutch riot police unleashes dogs on hooligans, you can find videos with Dutch police dogs ripping the legs of Hooligans.",
            "Be thankful it isn’t a Qatar prison cell.",
            "Can't believe they'd do this",
            "The absolute arrogance of them. Disgraceful innit",
            "He's probably working in England, so... Bloody English fans! \n\nPS. You can keep him 😉",
            "German cops are notorious for this shit. They will take any chance to beat the shit out of people.",
            "Indeed, it's very off and the officer seems to just take the chance for a free shot.\n\nThrowing a bottle is a dick move but police are the state and need to act correctly too.",
            "Unfortunately these are riot cops and while not adequate they are often allowed to do some really bizarre shit. \n\nThe cop was probably already annoyed and lost it, most people see riot cops and think better things than throwing bottles at them.",
            "welcome to dealing with the riot police and why everyone who's ever been to an away game or demonstration fucking hates them, they're like this all over europe",
            "> doesn't seem adequate for the policeman.\n\nWelcome to Germany.",
            "Nah fuck him. Chuck bottle, get banged. Lessons get learned that way.",
            "Well, he threw a bottle and resisted arrest afterwards. Can't expect to be treated lightly then.",
            "I think they do it to break resistance or some shit. they always do this here",
            "Berlin police are the fucking worst, bunch of (literal) nazis.",
            "Idk man, I don't think that dude will do it again after that, so view it as some sort of educational experience. I personally prefer my cops to respond to agression with way more agression. Especially if the initial agression is towards them.\n\nInstead of having to book the dude for whatever through court and bother alot of people and waste their time, just give him a good amount of punches straight to their mouth and call it a day. It's so much more efficient then having him arrested, doing all sorts of paperwork and appointing judges and all, takes days or more. Punch in the mouth brings home the message very fast and efficiëntly.\n\nPlus it might help getting rid of the laughingstock image most cops hold these days.",
            "Ehhhh, i think it's perfectly adequate. Don't throw bottles at cops if you don't want to get the shit kicked out of you. No need for it. He's lucky he got a fiat across his face and not a smack of baton.",
            "There is loads of accountability. But also loads of training for that accountability.",
            "Isn't that usual for police, like, everywhere? ",
            "Punching a guy in the face who just threw a dangerous weapon is reasonable use of force",
            "In the USA he wouldve been shot.",
            "What the fuck are you talking about? German police is a joke and a half… unless you throw bottles at them…",
            "This is very much par for the course for German riot cops.",
            "People who fall backwards can easily die when they hit their head on the ground. A few years ago a person died that way (also by police) and im sure that this is indeed not the right protocol. This officer seems too dangerous for this job.",
            "Not a SOP for normal cops but this is riot police. They do not „de-escalate”, they’re called when things have escalated already and require force-on-force response. Sometimes shock and awe are the best response. Look at how aggressive the fat guy and his two buddies are before the hook lands and then look how quickly they huddle to the side. Mediation and de-escalation with a drunken mob after a potentially life-threatening projectile has already been launched would lead to more idiots joining in as that would have been viewed as a sign of weakness. Just a drunken mob mentality. Don’t fuck with people equipped and trained exactly for the possibility of your dumb ass trying to fuck with them.",
            "That second edit is a pretty big leap imo. You can’t see it properly and at that point the officer isn’t hitting him. He is trying to turn him on his stomach so he can arrest him. Don’t think the other cop is trying to stop him there. Looks more like he is trying to help the others because the guy is trying to get up. Hard to tell either way. \n\nFor the punch itself I don’t know. Does seem like that approach is kind of uncontrolled and more dangerous than necessary? But also the fan is trying to punch (?) or grab the officer right before and is fighting back on top of already throwing a bottle? \n\nSeems tough to judge based on a video that doesn’t show the whole situation tbh. Probably could have been resolved in a better way though.",
            "I would say this was a preventative move by the policeman. The police are greatly outnumbered, go in hard on the first sign of trouble, makes the other pissed up football fans think twice before they start kicking off too.",
            "Definitely reacted in the moment but when the guy was down the ground he didn't follow up with unnecessary force. Can see him just trying to flip the guy to put the handcuffs on",
            "German cops are fascist enablers with a veneer of code of conduct. Just look for videos of how they dealt with Palestine protests",
            "That‘s the difference between regular police and Hundertschaft. They only deploy the Hundertschaft if they expect riots and violence so the have generally a way shorter fuse and tolerance for violent behaviour than regular police you‘ll see on the street.",
            "England fans not making it about themselves challenge.",
            "Okay. We've heard it now.",
            "How is it that English fans always make any situation about them?",
            "Funny thing, we say the same thing in Poland whenever such an incident happens with foreign fans: „No way, we’re told only Polish fans are violent…/s”",
            "I'm just back from Germany and the police in Cologne/Dusseldorf were all absolutely excellent. Welcoming, friendly, firm when required but never out of line. \n\nI suspect this video doesn't show the whole thing, but we'll never know.",
            "Thats just german police doing german police things",
            "No, normaly the police in germany is very Kind and  concerned about using violence.\nOn the other hand, this is Berlin.... Berlin is different :D",
            "I think protocol dictates he should have smashed him with a police baton or deescalated by shooting him.",
            "They are outnumbered in the middle of a drunk mob. Look at the fat dude to the right. He is about to join in untill he sees the punch and then thinks better of it. That show of force kept it to the one guy being arrested.\n\nThe guy who got punched is also clearly resisting the arrest. It's not like he gave himself up.",
            "Jokes on you we are gonna reverse time and assasinate Verbruggen to Score 7 goles during our match with the dutch and then we are gonna lose to Austria and win 7:1 with France (power of friendship) then we gonna win 9:1 with Ukraine thanks to Probierz's suits, then 7:3 with Portugal, 3:2 with Spain and 10:4 with Albania in the final and boom the Trophy goes to Poland 🇵🇱🇵🇱🇵🇱🇵🇱",
            "What",
            "imagine this in Qatar or Sudia Arabia, lol. cant even have dumb fun.",
            "UK match day policing isn't bad to be fair.",
            "Good words",
            "Hard to speak when it’s unificioncial slavery",
            "No, Qatar forbid alcohol because of Religion. \nThey also banned \"desrespectful behavior at religious places or to the islam\" unmarried Sex,  beeing gay and covering your knees and shoulders.\n\nBut yeah, no Alkohol on such Events prevent voilence. I think its a good Thing.",
            "Where are you from?",
            "Good thing it happened in a first world country then.",
            "Tastical, your cops are scared yet leave kids to die.",
            "He isn't black, wouldn't be shot and killed.",
            "Isn’t it weird how just by reading this comment everyone in the whole world already knows where you’re from?\n\nNot something to be proud of I wouldn’t think.",
            "People in glass houses sink ships. \n\nWords I live by everyday.",
            "Don't throw shade if you live in the sun",
            "When in Rome you’ve taken the wrong road",
            "Also wear clothes",
            "I think the saying is \"don't get stoned living in glass houses\"",
            "I think he'd have been pretty safe throwing glass if he was in a stone house",
            "Bad move bruv . His mates shat themselves big time",
            "Well it is pretty expectable.... but not exactly acceptable.",
            "Throwing a bottle can be downright deadly, would understand if someone got their ass beat because of thar",
            "I did a fair bit of research and couldn't find any provisions in German or EU law that dictated minimum force. Do you have a sources on that? From a human level I agree that they should be required to treat everyone like a human, but I couldn't find anything legally binding.",
            "Assault with a deadly weapon = elbow in face.\n\nElbow in face is pretty mild compared to a deadly weapon.\n\nThe German police carry guns.  FFS, what was the pole thinking.\n\nWhen the drinks in the sense is out.",
            "“I can throw a bottle at you and you are legally bound to not do anything other than gently arrest me” is a great way to incentivize violent protests.",
            "It's was really mild. After he got knocked down, they hardly touched him for the remainder of the clip.\n\nIt served as a perfect \"f**k around and find out\" for the rest of the crowd.",
            "Peaceful protesters will have absolutely zero issues with the german police. It is only those who use coercion as their prefered way of protest who get into trouble with police officers.",
            "[deleted]",
            "🤣🤣🤣I shouldn't be laughing but I am🤣🤣🤣",
            "+ 5 bravery \n+ 5 power\n- 5 stamina\n- 5 speed",
            "Maybe +5 to bad decisions?",
            "Wisdom set to 2 regardless of what it was before.",
            "-20 on accuracy and agility",
            "Press the Reset button!",
            "Life is Roblox",
            "IIRC ex-boxers and other fighters become cops after their careers in Poland. I’m like 80% sure that I read this specifically about Poland, but it might apply to other European countries too. Someone Polish can confirm whether I’m full of shit or not.",
            "You are right because they can’t behave and are calling for genocide against Jews. So if they act like that, beat em up. Always puts a smile on my face.",
            "What are you talking about? They weren’t on the streets. However they did fuck around and partied too much. But that was all in a private environment.",
            "Good mates right there tbh",
            "Armed Germans and Polish civilians. Good ol days",
            "As I said in this situation the violence was somewhat justified but there will be situations during the tournament where the violence will start because of the police.",
            "Why are they like this?",
            "In my experience of travelling with the Effzeh away fans to several games, the worst were the Hamburg cops under Scholz. They were dicks and it didn't get any better under \"Andy, Du bist so 1 Pimmel\". But the cops at the games in germany are usually more there to de-escalate the situation than to start a fight.",
            "They're just Karens with weapons.",
            "Black outfits tradition...",
            "Fully expecting to be downvoted by the usual terminally online downvoting Germans here, but 99% of the country is so incredibly safe that these overfunded and overstaffed twats relish in any chance they can get to act out how they really wish to behave. (I live there)",
            "unless it's Mannheim and they can save someone's life",
            "Yea. Germans may appear all nice and polite... but never forget somewhere in their DNA is the coding for beating up Poland.",
            "what would be in your opinion the correct maner to take him out as fast as possible and to stop him to reload another throwing? (others seens to be protecting him and the police are out numbers)",
            "A punch to the face to take someone down is still better than getting shot or tazed. Throwing bottles can easily be called attempted murder",
            "German police are not \"the state\" they are \"above the state\".",
            "It is absolutely the right move! Shows the consequences of such actions for future violent fans. Dont act dumb, especially towards law enforcement.\n\nHate that talk about not publishing bad behaviour",
            "nah . I agree. it was not the correct move. The correct move would have been a 1-2 combo. he threw a full body hook. It should have been come after the 1-2 jab . Then once he is down he should have thrown few more. Dumb assess don't learn otherwise",
            "I feel horrible defending a cop, but that was rather composed. I'm rather used to them continuing hitting and kicking once the\"target\" is on the ground.",
            "just dont throw bottles at them?",
            "Dumbfuck comment but I don't expect much from Reddit tbf",
            "The cop(s) are in riot gear and the dude is a drunk shit. What could he do? Ofc. the police can react differently and he doesnt have to punch that guy down",
            "If this thing happened in Poland a year ago, all of the media would show this as the example of how the totalitarian regime is in the country.",
            "I say this as a cop hating Hertha away fan, but they can also be the most chill and funniest police in Germany. \n\nI'd rather deal with a Berlin cop than a Bavarian, Hessen, or the Bundespolizei.",
            "Generalizing like that is dumb.",
            "In my opinion, the police shouldn't do something like this. Police's job is to arrest the man, and he should face the trial or something like that. This, however, is not how a police in the democratic country should act.",
            "Yeah, just many of those counties are actually dangerous so police brutality is sadly more likely to occur. But outside of a few pockets in Berlin and Frankfurt, Germany is incredibly safe. So the Police being so aggressive to a very well behaved populace is just bizarre.",
            "riot cops in general tbqh",
            "It's almost like someone throwing a projectile at your head would invoke a fight or flight response.",
            "Go in hard does not equate to outwardly vicious. Drunk people seeing police acting like this is inflammatory and is likely to provoke more people to argue or fight against police. \n\nThis was a police officer acting improperly in the heat of the moment, a group of football fans seeing that happen to a fellow football fan could’ve ended up being a lot worse",
            "Maybe there is a reason for that? Perhaps decades of articles slandering English tourists is slightly frustrating.",
            "Just like people cannot judge the entire police force off this one small video, your little holiday to Cologne/Dus doesnt represent the whole force either. I live in Cologne and I can tell you right now that the police here are utter twats. There is almost no actual crime in the city so any time anything even very minor happens, they turn up with way too many officers and are mostly complete dicks.",
            "Subscribe",
            "mid field90",
            "set pieces from the left",
            "mothe fucker square youre self again a brick all, and tell me how it if feels. if you live.",
            "Depends where you go but I would rather have police like terminators, would have stopped the scum running the euro final",
            "Imagine the orgies in German and Austria",
            "Shut up. For  fuck she let, me enjoy German culture alone, solo.",
            "Hope you okay",
            ">No, Qatar forbid alcohol because of Religion\n\nAlcohol has been legal in Qatar in licensed places for years.",
            "I know it's religion and culture of the country but we didn't see a similar insidents during the WC.",
            "Reddit comment",
            "Sorry",
            "Where is he from?",
            "Now me neither but. Perth Australia.  Not Austria look magic at the final whistle",
            "Let the younger play, look at Jude behind, he won la liga , and the champions league at the age 20 years old",
            "Ask your manger lol",
            "If you want to worth the money, club Vaue guaranteed you steal  potentially millions of dollars,lard",
            "What changes could you make?",
            "Don't throw the baby out with the glass house is worth two in the burnt bridges.",
            "Well that would be really hard rule to follow. What are you gonna do, be massless and shapeless? Turn into gas??",
            "Nahh, it'll break",
            "Just from a legal point of view:\n\nhttps://gesetze.berlin.de/bsbe/document/jlr-UZwGBEpP4\n\n\n§ 4\nGrundsatz der Verhältnismäßigkeit\n\n(1) Bei der Anwendung unmittelbaren Zwanges sind von den möglichen und geeigneten Maßnahmen diejenigen zu treffen, die den Einzelnen und die Allgemeinheit am wenigsten beeinträchtigen. Jede Maßnahme darf nur so lange und so weit durchgeführt werden, wie ihr Zweck es erfordert.\n\n(2) Eine Maßnahme des unmittelbaren Zwanges darf nicht durchgeführt werden, wenn der durch sie zu erwartende Schaden erkennbar außer Verhältnis zu dem beabsichtigten Erfolg steht.",
            "> The German police carry guns. FFS, what was the pole thinking.\n\nRiot police like that dont carry guns by the way. To much danger of guns being taken by somebody in a scuffle.",
            "Lmao in what world would throwing a beer bottle at a police officer in riot gear considered „assault with a deadly weapon“? I mean, the response he got was obviously completely justified, but please…\n\nAnd yes, cops here carry weapons, but would never use them in such a situation. We’re not living in a third world country.",
            "He was certainly drunk or doing it for a tiktok video.",
            "But the police are not in charge of handing out punishement, and corporal violence is not a punishment in any civilised nation.",
            "There are videos of German riot police beating the shit out of peaceful protesters with batons to their faces, freely available on youtube. So no, they are not chill",
            "how's the boot tasting?\n\nfor real though, German *riot* cops are not chill in situations like these. Never have been. Even among cops I personally know they have a bad reputation for shit like this. Riot police are often younger and less experienced and face very little or no consequences for their actions, because other cops lie to protect them and even if they are caught for doing so there is no punishment or consequence. It's been a massive problem for years and if you say otherwise you or the news sources you consume likely have bias.  \nhttps://www.swr.de/swrkultur/doku-und-feature/taeter-in-uniform-swr2-feature-2020-06-03-100.html\n\nIf you wanna hear about what some of your lovely cops get away with. An hour long audio feature by a public German broadcaster about \"perpetrators in uniform\". You can also download the pdf manuscript and put it in a translator if you can't understand German.",
            "A German police officer once broke my thumb when he mistakenly thought I was buying drugs.\n\nThey are literally bastards with huge right wing elements in their ranks. Thankfully German authorities are doing their best to remove the bad ones.",
            "Left wing demonstrations are completely fucked by German police",
            "0 intelligence",
            "This is in Germany.",
            "Professional athletes often go to law enforcement here too. Especially those who don't make a ton of money with their sport and those sports that hardly have a professional division. It's often military service then law enforcement. Sports soldiers are a thing e.g.",
            "Yea you can see that one riot police officer was kind of wishing the very drunk mate would get through his friends 😅😂",
            "To a non football-fan you guys just seem very destructive. Germany has to spend millions even on smaller matches so the fans don’t beat each other up oder destroy the city, the trains etc..\nSometimes police even finds Molotov cocktails, who tf brings Molotovs to a football game.\nLast year someone threw a fire extinguisher at a subway driver in our city.",
            "I mean the Hamburger cops under Scholz literally killed someone by force feeding them a vomit inducing drug. \n\nEdit: misremembered the details very badly\n\nEdit 2: oh wait. I didn’t misremember the details actually. They killed several people this way by forcefully intubating them and administering emetic drugs which caused them to aspirate and drown on their own vomit.",
            "Saying the police is overfunded and overstaffed is just objectively untrue. If you get downvoted chances are it’s for spouting nonsense and not because others are „terminally online“.",
            "The German police once found me by the side of a german highway, hitchhicking. German highways suck for it, there is no good place to stand. And neiter are the entry points. You are force to stand somewhere where there is not enough traffic. Anyways long story short I needed a ride, so I just walked by the side of the highway till I found a place.\n\nThey were fully in their right to ticket me, what I was doing was illegal. Instead, they drove me like 11 km to a good place to catch a ride. \n\nMost police in western-europe is like this. I have had plenty of encounters with Dutch, belgium, french and german police. I know it's anakdotal and does not account for much but I like the german and dutch police most.\n\nI have had encounters with Canadian police as well. Boy do they fucking suck compared to the professionalism you find in Europe. I use to live in Red Deer and made a lot of native friends there and omg these guys get bullied by the police on a daily basis. It made me fucking mad, but when it happens all you can do is just let it happen or you risk fucking up your own life. \n\nIf you live anywhere and the police are half as professional as the dutch and german, count yourself blessed.",
            "Then it turns into \"Stop it! Stop it! I don't care who started! Just stop it and shake your hands! Oh, a knife... Oooops.\"",
            "Tackle him. \n\n\nPunching people is not something the police should do, only as a last resort kinda thing.",
            "Protecting him?\n\nThey seem to part as few officers in riot gear go towards him, he pretty much has him and then punches him and takes him down.\n\nJust the grabbing him was enough and then cuffing him, the guy isn't armed.",
            "Sorry I missed that bit where the police are suppose to punish people, that's not there job.",
            "Because people who are punished with violence never go on to use violence themselves in an attempt to solve problems. /s",
            "Well, that is true. Most operatives i've witnessed included tear gas, blanks and sticks, but I lived in Venezuela. I saw one female officer taking off her helmet and hitting a woman in the face with it after pinning her down.\n\nBut I figure that'd a fringe case. Here in Spain they seem more civilized (apparently in the 90s the Basque ones were super scary though).",
            "Yeah I dont think hitting someone who threw bottles would do that no",
            "Anyone who lives in this city knows this. They're violent thugs and it has proven that there are right wing extremists and nazis among their ranks.\n\nIt's not just conjecture or an anecdote, there are fascists in the police corps.",
            "ah go away out of that. I wonder would you feel the same if someone hit you with a bottle. \n\nThe man is obviously a violent person, throwing bottles. Fuck that he needs to be apprehended, quickly and that's what the cop did. Job well done. It wasn't vengeance it was apprehension in eyes.",
            "Some German states don't fund their police well and don't do the necessary background checks.\n\nThe police in Berlin are lazy as hell, the police in Bavaria are the well-funded overachievers who hate cannabis, the police in NRW are corrupt, the police in East Germany are full of wannabe-Nazis. And so on.\n\nIt always depend on the state.",
            "From what I have seen in the news, yes. \n\nI was specifically answering and refuting the point made above that German cops were usually better than their international counterparts and \"turn the other cheek\"",
            "Not saying you're wrong, but if a policeman can't control those responses, then he simply isn't suited for the job. Keeping your calm even under intense pressure is a job requirement. \n\nI don't know if you're from here, but we have massive accountability issues with our police force and especially the riot units who are mostly made up of younger, less experienced cops. Even among other cops I personally know they have a bad reputation exactly for shit like this.",
            "A right hook to immediately pacify a threat and show others you aren't here to be calm and thoughtful when they throw bottles is effective crowd control.\n\nThe guy that did it was behind the group of officers as well, so  by stopping his violence, the rest of the group can focus on the larger crowd.\n\nIf you see police officers wearing full riot gear, in the middle of a crowd, then dont throw bottles and expect a slap on the wrist is what is being firmly communicated here.",
            "All very possible, but in this particular situation your could’ve scenario didn’t pan out that way, as per the video.",
            "Uno reverse",
            "You deleted your post i am not sure what you said",
            "I think in the UK they prioritise keeping the peace which is the exact opposite of this.",
            "True",
            "They asked for it. Who tf cares about the us in a post about football involving polish and germans?",
            "Alright. \n\nWhy don’t you make like a tree, and get the fuck out of here.",
            "Man that’s deep. That shit has layers.",
            "This sounds like a you problem.",
            "Did I stutter?",
            "Idk if youre joking but it's the other way round lmao",
            "This is for Berlin police. There are respective laws for other federal countries and the federal police.\n\nNot following that might mean being liable under the general criminal code.\n\nThe detailed application of this laws and the criminal code depends on details as always. The problem of excessive use of force by police seems to be an ongoing and unsolved.",
            "Where did you get this from? You can clearly see the Walter on the cops right hip at 00:10. \n\nI think you're confusing it with police or guards inside prisons. Riot police absolutely carry guns.",
            "Thanks for the info👍",
            "> Lmao in what world would throwing a beer bottle at a police officer in riot gear considered „assault with a deadly weapon\n\nin a normal one? its about the item used, not what others wear as protection. just because someone is wearing a bulletproof vest, doesnt mean a shot cant be deadly. could have also hit a civilian wearing only their sunglasses on their head.",
            "It *is* assault with a deadly weapon. The reaction was perfectly justified.",
            "Fair point.  It was the previous comment 'mildest means' that got me.\n\nOn review, I think the police officers was acting on behalf of the other fans not wearing full riot gear.  Imagine if he had missed the officer and hit some unprotected.\n\nThe officer took the 'mildest means' to protect the other supporters ie elbow to face.👍",
            "You have to react to the situation.  All fine and great sitting debating after the event.\n\nA bottle was used therefore the person is willing to use a weapon.  How does the officer know if the person has a hidden knife, he doesn't.\n\nElbow in face to distract the person who had thrown the bottle and stop further violence.\n\nI don't see it as handing out punishment, I see it as 'lets contain this situation, immediately'.",
            ">It's been a massive problem for years and if you say otherwise you likely have an agenda.\n\nI mean I agree with basically everything. It's not Germany specific either. Riot police all over the world have a similar problem.\n\nBut the agenda thing is stupid. You also have an agenda for pointing towards issues you want to have solved, a pro police guy has an agenda, I have an agenda pointing out double standards. I just don't like the trend online of accusing other opinion havers as being somehow dishonest in their opinion. It's basically an ad Hominem argument.\n\nWe should be glad if we don't talk to bots or literal Russian agents for once.",
            "So in other words German police are based",
            "*”There's an old saying in Germany — I know it's in Poland, probably in Germany — that says, fool me once, shame on — shame on you. Fool me — you can't get fooled again.”*",
            "The police presence at most matches is way too big. Except for a few clubs violence from the fans towards other fans or the police is the exception and not the norm. Still you will be treated like a criminal. This year I was at a cup final with my local club. Around 400 police officers for just 2000 away fans. Not a single violent action towards police or the opposing fans. Nothing would have happened with half the police officers. \n\nAlso the Molotov cocktail stuff is just made up.",
            "When there’s a match in our city it’s cancer for everyone who isn’t a hooligan",
            "I think you should probably provide some kind of source for this. You aren't filling me with confidence.",
            "[deleted]",
            "Lol, of course the guy from Bayern doesn’t think the police here is overfunded. It is a well known fact that on any euro centric subreddits that Germans are notorious for mass downvoting anything even remotely negative towards their country from anyone not German.",
            "Yeah this is what they did. You see him trying to grab him but the fan is resisting and trying to grab the neck, this is when he’s overwhelming him by half punching him/taking him down. People sometimes have curious opinions what the police is supposed to do when applying force.",
            "Punching is a justifiable use of force for someone that's just tried to bottle you. People need to stand up and have some self responsibility for their actions, throw a bottle at a riot cop and win a silly prize.",
            "Tackling takes you to the ground with him. Dangerous for you. I can't really see much of how it goes when the rest not the police huddle around him, but the first punch is reasonable for that situation (someone drunk who just threw a bottle) and the way I'm used to how these things go with the German police I'm kinda surprised that there isn't an immediate punching down on him when he hits the floor.",
            "0:03 tackle him over a bierbank? breaking his spinal cord?\nat the same timeframe see where both (the Policeman and the fan) have their hands?",
            "No fuck off. He had a bottle thrown at him. Thats basically an attack. The policeman can do what he wants now. Too many dickheads these days thinking they can do what theyvwant without being harmed. A hefty box in the face will do that man good as he won't do it again.",
            "You don’t know if he didn’t have a weapon and what matters is how this looked in that second: he threw a bottle and tried to grab the police officers neck.",
            "Sorry i missed that bit where it is acceptable to throws projectiles at police....\n\n\nIkke engang i Danmark har du lov til det og den der svag mentalitet kunne jeg brække mig over, man kan jo bare lade være med at være et røvhul. Så nemt.",
            "Country differences. Poland has a history of brutal police work. Also, most of the media was anti-government a year ago.",
            "Yes and generalizing isn’t helpful. There is a big difference between saying „there are fascists in the police corps“ and „Berlin police are the worst, bunch of literal nazis“.",
            "\"I wonder would you feel the same if someone hit you with a bottle.\"\n\nThat's the point, police are not for personal anger, they represent the state. This is not acceptable to me.",
            "from direct experience they're riot cops so it doesn't get much better than a certain degree but they're not as bad as the celerini or the guardia civil",
            "Yeah you’re full of shit pal this isn’t a fist fight between 2 people, it’s a large group of intoxicated football fans that needs to be managed carefully. Police officers in the UK are taught to be wary of this and is why there is stringent training on how to act. Mob mentality is a serious factor in these situations.\n\nGrabbing him and immediately arresting him is how to show there are consequences.\n\n“The rest of the group can focus on the larger crowd” you mean the 4/5 other police officers in camera shot versus the 30/50 football fans? He puts them all at serious risk of harm by acting in such an aggressive manner. Police in these scenarios are vastly outnumbered and need to protect themselves at all times and is the first lesson they are taught. \n\nWhat if his unjustified punch angered those 3 friends being pulled to the side? Now it’s 4 against 5. What if others in the crowd had seen the way he is being treated and also became angry? Now they’re outnumbered and at risk of being seriously injured and causing a riot or serious public disorder.",
            "Absolutely right, could’ve/would’ve/should’ve but you’re trained to think of all outcomes and act in the methodical one that minimises harm to yourself and to others around you. Punching someone in the face is not professional and increases the risk in that situation unnecessarily.\n\nIn this instance he got lucky the other fans were docile/ not interested.",
            "iIn germany is sooo good",
            "techno is germany",
            "dj sash",
            "coo was getle botted heavilby be fore the tackdown",
            "Yeah but you will have peace in 5 minutes after!",
            "So you decided to make a Reddit comment about the us. So Reddit comment you just want them upvotes",
            "Reddit answer.",
            "Like onion...",
            "maybe think again about what the \"it\" here refers to",
            "Yeah looks like it. Might have been misinformed there.\n\nNot sure how you can tell its a Walther though. Berlin police doesnt issue Walthers.\n\nhttps://de.wikipedia.org/wiki/Liste_von_Dienstwaffen_der_deutschen_Sicherheitsbeh%C3%B6rden",
            "Yeah surely that’s true 👍🏻",
            "not about to argue semantics, but I softened it up a little and exchanged it with \"bias\".",
            "So in other words you like fascist",
            "Reddit commies are malding lol. Fuck both wings, stop normalizing left wing. They got a free pass for way too long.",
            "You are wasting your time, there is no way you can convince pro police Germans that we don’t need 500 police officers for every single crime in our very safe country.",
            "https://en.m.wikipedia.org/wiki/Death_of_Laye-Alama_Condé\n\nThis one was in Bremen. I’ll try to find an English language article of the 19 year old they did this to in Hamburg while Scholz was mayor.\n\n\nhttps://en.m.wikipedia.org/wiki/Death_of_Achidi_John\n\n“On the morning of December 8, 2001, the 19-year-old was picked up by civil investigators in the St. Georg district on suspicion of drug trafficking and immediately taken to the forensic medicine department at Eppendorf University Hospital(UKE).[7] He fiercely opposed the insertion of a nasogastric tube to introduce the emetic ipecac, upon which he was restrained. A doctor then forcibly injected John with the emetic through a tube into his nose.[8][9][10] An anesthesiologist was not present to help John in case of an emergency.[7] Then he fell to the ground.[7] The color of his face had changed, breathing and pulse had stopped.[7] After three minutes, two teams of emergency doctors tried unsuccessfully to resuscitate John.[1] John died on December 12, 2001.[11]”",
            "The short version is that there was a conservative party in Hamburg who ran on typical \"tough on crime\" stuff, which included making suspected drug dealers vomit up drugs so they could be charged, who was making huge gains in polls. \n\nScholz, while being mayor of Hamburg and having an election coming up, reacted by implementing that policy (presumably) to gain votes, despite protests from experts about the dangers. [Achidi John](https://en.wikipedia.org/wiki/Death_of_Achidi_John) died. Eventually (elsewhere) more people died, the European Court of Human Rights decided  it's essentially torture and the policy was stopped Germany-wide.\n\nAnyway to the bigger point, yes, Hamburg police is notorious for their \"hard line\" policing during big events.",
            "never forget G20! Where the cops escalated so much resulting in total shitload",
            "I’ve read he was the one who green lighted the practice in the first place (and then defended it after the fact even the EU deemed it to be torture.)",
            "Where I'm from doesn't even matter. You can easily research the issues the police has with bad equipment, training, a lack of officers and more. It's really not hard to look up and not a subjective thing in any way.\n\nGermans could also downvote everything and everyone and it wouldn't change anything here. You are making statements that are objectively wrong and therefore are getting downvoted.\n\nAlso, downvotes don't matter. Who cares about downvotes and what \"any euro centric subreddit\" thinks.",
            "There's like 5 policemen there man, just hold him for half a second until your buddy comes and they wouldn't have to throw him to the ground on pavement",
            "Well people on internet are experts on policing after all.",
            "Oh, you‘re one of those „win stupid prizes“ people. I almost took your comment seriously.",
            "Its not reasonable at all . The dude is like 0 threat and you've got 5 people with full riot gear, the punch wasn't necessary in anyway and didn't help the situation in the slightest.",
            "You‘re right, the punch literally saved his life, there would habe been no possible way to take him out without punching him in the face.\n\n\nI‘m sorry mate, are you the cop in the video or something? Breaking his spinal cord?",
            "No, the policeman can‘t do what he wants now lmao\n\n\nAmazing take, mate.",
            "Spot the American.",
            "Looks like he just trying to grab on to something as the officer charges at him.",
            "this post reeks of thin blue line copaganda, they're in riot cop gear while the polish dude is just drunk, all it takes to handle him is two of them carrying him away",
            "and that's why they are suppose to arrest and charge him.\n\nI'm sure that last line is lovely.",
            "It isn't, that's why the consequences are getting arrested and charged with whatever the court decides. Cops aren't supposed to decide your punishment.",
            "Thats the thing growing up near there i thought police brutality is just normal there and this vid is quite tame",
            "Why are you all over this thread attempting to play pretend?\n\n\nhttps://www.fr.de/rhein-main/strafe-fuer-nazi-chats-moeglich-92395746.html\n\nhttps://www.fr.de/rhein-main/skandal-verfahren-laeuft-polizei-frankfurt-rechte-chats-nazi-freigestellt-volle-bezuege-92261910.html\n\nhttps://www.bild.de/regional/berlin/berlin-aktuell/nazi-skandal-bei-der-berliner-polizei-chats-mit-menschenverachtenden-inhalten-77082736.bild.html\n\nhttps://taz.de/Rechtsextreme-Chatgruppe-in-Berliner-Polizei/!5782550/\n\nhttps://www.mopo.de/hamburg/hitlerbilder-im-kollegen-chat-ermittlungen-gegen-hamburger-vollzugsbeamten/\n\nhttps://taz.de/Hunderte-Polizisten-unter-Nazi-Verdacht/!6002429/\n\nhttps://www.sueddeutsche.de/bayern/bayern-polizei-rechtsextremismus-1.4743989\n\nhttps://www.stern.de/panorama/verbrechen/polizeiskandal-in-bayern--beamte-wegen-moeglicher-nazichats-suspendiert-8623544.html\n\n\nI can go on and on and on but you live in an alternate reality. There is an obvious systematic problem present. What actually isn't helpful is pretending as though this type of shit popping up again and again and all over the country is somehow coincidence.",
            "If you act drunk and stupid, get treated like you're drunk and stupid. \n\nMob mentality refers to the emotions of a group of people. 1 guy fired a bottle at an officer, and the rest scattered when the police arrived. \n\nIf it was an already hostile crowd, then by all means, dont throw a punch.\n\nBut i'm sure the German Riot Police would love to hear your thoughts mate, maybe send an email where you can continue to compare them to the wonderfully stringently trained British Police (who deal with less riots than the germans)",
            "Are you drunk",
            "If life gives you an onion make onionade",
            "This does not look like the Berlin Police. During the euro police from all around Germany supports. They should be from the Bundespolizei Ratzeburg.",
            "Because I don't want the same thing happening in my country that is happening in the USA by the far left clown organizations like BLM and Antifa?",
            "Cheers!",
            "Peaceful protest \"welcome to hell\"",
            "“There’s like 100s fans there” you don’t know how they will react. He wanted to hold him but he went for the neck.",
            "People on the internet are also just people in real life and a lot of us do have years of seeing police misconduct up close and personal and might have thoughts on how to improve it.",
            "Throw a bottle at a cop, pretty obvious you're a violent individual at that point, it'd also be a reasonable assumption he's going to continue to be violent when you then try to arrest him. Its well known large groups of football fans tend to escalate quickly. As a regular person you'd be well within your rights to punch him in the face there to protect your own safety. \n\nTake some self responsibility, don't throw a bottle at people you don't get punched in the face it really is that simple.\n\nOf course all the people complaining here have probably never had to actually put their safety on the line in situations like this though, it's far easier to criticize from an office chair.\n\nWould you prefer the police ask him nicely to please stop trying to bottle people? If so perhaps you should volunteer yourself and start taking action from the inside.",
            "Im used to scumbags getting away with a lot of shit back home and the police are useless so thats why I am kind of backing the policeman here. It is excessive but I feel some people need that.",
            "Irrelevant, the moment he threw that bottle the police officers were obliged to take him down (which we don’t clearly see but they seem very sure on selecting the responsible party, so I’m assuming they saw who threw it). If he resists they are allowed to apply force.",
            "Where did I say there isn’t a systemic problem? Feel free to quote me. That doesn’t mean it’s reasonable to generalize. A systemic problem does not mean every single officer is a fascist. \n\nGeneralizing and putting everything in black and white simply kills nuance and isn’t helpful when tackling an issue.\n\nIt’s funny that you say I’m living in an alternative reality when you are straight up arguing something that was never said in any way,  shape or form.\n\nEdit: No response of course. Kind of crazy that \"it's not black and white\" is a spicy take around here lol",
            "I live in Berlin and have had 0 issues with the police.. which doesn't mean that there aren't idiots among their ranks (even many of them so). There's also a distinction between normal police and Riot police - I had a date with a girl once, who told me during the date that she was a police officer.. so I was curious and we talked more about it and she herself said that \"Riot police in Berlin, but especially Brandenburg are the worst of the worst\", even police officers don't like the Riot police as they are indeed mostly thugs/nazis and similar. But there's distinction between calling \"Berlin police is a bunch of nazis\" and the riot police that we have in the video above. Calling all police in Berlin nazis is wrong, so I agree with u/HyDchen",
            "Crowd emotions are a fluid thing. I’m sure you’re right though in the German public order training, closely coordinated with other western nations, I bet it says the first thing you should do is punch someone in the face. \n\nI don’t really care either way, someone thought this isn’t normal police techniques and I agreed and laid my reasons out above. It’s you that loutishly decided a police officer should just punch someone in the face because you think that’s what should happen.",
            "Crowd emotions are a fluid thing. I’m sure you’re right though in the German public order training, closely coordinated with other western nations, I bet it says the first thing you should do is punch someone in the face. \n\nI don’t really care either way, someone thought this isn’t normal police techniques and I agreed and laid my reasons out above. It’s you that loutishly decided a police officer should just punch someone in the face because you think that’s what should happen.",
            "what do you think? yes I sam in a temporal happy space.",
            "Take my upvote",
            "If life gives you onions, ask for a bird in the bush.",
            "Before or after the horse has bolted?",
            "The Bundespolizei doesnt issue Walthers either.",
            "No, because you condone violence against a group based on their political believe. That is textbook fascism and what we so proudly like to claim we got rid of after ww2. \n\nApart from that antifa isn't an organization. It's the political belief against fascism. Anti fascism = antifa.",
            "Doesn't matter if you had protesters with questionable motives or slogans. There were massive amounts of unjustified police brutality at G20.\n\nMore than one side misbehaving at the same time (or same weekend) can be true.",
            "Yeah they all look super aggressive standing around menacingly and all. Should have brought the tear gas tbh. I honestly don't see him going for the cop's neck. Looks like he's holding his shirt to me",
            "If anything, punching a fan only makes it more likely the other of the hundreds of fans will get involved physically.",
            "Ask him nicely? I‘m sorry but do you seriously lack reading comprehension? Did you even read my first comment?\n\nAnd I think it‘s kinda rich that you‘re making fun of people judging from their office chairs when it‘s 100% obvious that you also never had any police or riot police training in your life. Otherwise you wouldn‘t spout that silly nonsense. Police (at least in Germany) don‘t get taught that they can just knock out any person that threw a bottle. You assuming that everything goes as soon as a citizen seems violent is just a layman‘s view on situations like these.",
            "Do you see any order about complying or just a charge and punch?",
            "https://www.congress.gov/bill/116th-congress/senate-resolution/279\n\nBecause violence against far right groups is not condoned? It doesn't matter which side you are on if you can't peacefully protest then you have to deal with the consequences. BLM and Antifa are both burning cities and vandalizing shops in America, I could care less about if it's a movement or organization, if you don't respect the law and order then you get fucked by the police it's that simple",
            "Yeah that’s why there was a bottle throw but hey you know better ex post right.",
            "That's what the now dead police officer from Mannheim probably thought.",
            "He’s not punching anyone he’s taking the person down after a bottle throw + going for the neck.",
            "Or in this case, makes them stay put.",
            "Tackle someone to the floor there still very open to smash with another bottle or stab you if they have something more sinister. Your also just as likely to crack there head off the floor and cause a serious injury as you are punching them. \n\nHands on riot training? No I don't but I've overseen riot deployments working as dispatcher and we were encouraged to see how things are on the ground as well. I've probably had far more experience with the law and use of force than most people. \n\nBottling someone and getting punched to take control of a situation and detain someone would be reasonable use of force and self defense. Believing you're at risk of immediate risk of violence would justify that. \n\nThis whole situation would have been avoided if he just didn't try to bottle a cop. Personal responsibility.",
            "They don’t need any order, a glass bottle throw is enough(since it’s a danger to the public safety). He’s trying to grab him, the person is resisting and going for his neck then he applies more force and takes him down.",
            "Lmao touch grass dude",
            "Yeah cos a mass stabbing is totally the same situation as a drunk dude throwing a bottle",
            "How can you look at this video and say its not a punch. I dont really care if you think its appropriate or not for a police officer to throw a punch. But straight up denying it happend is delusional\n\nHe even winds up for it ffs\n\nhttps://imgur.com/a/lONabEG",
            "That was a clear punch to the neck/jaw, what are you talking about lmao",
            "You said he wasn't complying, so I meant order as in an order to the offender.\n\nHe just looks like someone trying to stay his feet."
        ]
    },
    "Ukrainian coach didn't believe in Shaparenko's brilliant pass": {
        "title": "Ukrainian coach didn't believe in Shaparenko's brilliant pass",
        "score": 5146,
        "url": "https://v.redd.it/h8sp0d1d608d1",
        "content": "",
        "num_comments": 103,
        "comments": [
            "**Mirrors / Alternative Angles**\n  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soccer) if you have any questions or concerns.*",
            "“It’s so over” -> “We are so fucking back”",
            "The pass was good, but the striker's control and finish is sublime",
            "Rebrov, the player, would have loved that pass though..",
            "You absolute fucking... genius.",
            "Honestly this pass would be wasted 99 out of 100 tries. Brilliant control from the striker there",
            "Thank god he saw the goal.",
            "He didnt know Dubravka doesnt come off his line to claim anything",
            "Rebrov's right not to believe in the pass tho. The keeper should have stepped out and claim the ball. The striker gets it only because he is there, on the edge of the keeper's area first",
            "I mean thats a hail Mary. But what makes tournament football so good",
            "The striker saved Shaparenko there. Brilliantly controled the ball.",
            "God did",
            "no-no-no-yes",
            "Dubravka's hesitation in goal is what made it work. Any other decwnt GK in his position at the time of the pass would've ran forward and smothered it.",
            "Great reaction lol",
            "It looks like he didn’t like that decision- until he did",
            "He probably still doesn't believe Yaremchuk actually scored a goal.",
            " Shaparenko after the goal \" I wanted to do that, that was totally a pass, I am Modric''",
            "That finish though",
            "Must have assumed gk wouldn’t shit his pants.",
            "Call an ambulance… Not for me! 🔪🔪🔪",
            "The agony and the ecstasy wha",
            "great emotions for sure. this is football",
            "reminds me of [this](https://youtu.be/iAF13eyEVqU)",
            ">Ukrainian coach\n\nThat's Serhiy Rebrov you melt.\n\nJFC, am I that old that people don't know who this is...?",
            "Number 9’s first touch was just exquisite though >chef’s kiss",
            "coach wasn't wrong though",
            "Should be keepers ball everyday of the week, he moved to meet then bottled it. Keeper should've took the ball and player",
            "They deserve good shit like this",
            ">Next training you run 30 laps for trying that pass and another 15 for actually pulling it off. And don't forget to take Roman with you for enabling this bullshit.",
            "Most importantly, his striker believed!",
            "Bro thought his player done a Mudykr",
            "LoL he said FUCKKKK",
            "Isn't this the guy who was linked to tonnes of massive clubs a few years back?",
            "Fifa 19 legend!!",
            "I think he, like all of us, were shocked that the keeper didn’t come out. Seemed like an easy, straightforward claim.",
            "Tbf, the absolute window of perfection of weight and distance within inches to successfully complete that was so small I woulda been pissed too as manager. Miraculous pass that",
            "I watxh this live and agree with the coach. With a pass this high, the goal keeper have more than enough time to go out and catch it. But he is so indecisive and scared. Look at his body language when block it.",
            "Slavio Ukrainio",
            "This happens with my sons football. He likes to shoot from distance, and has a pretty mean shot on him, but several times I've been literally shouting \"Oh, don't shoot from ther...\" just to have the ball smash into the top corner making me look like a twat",
            "My man celebrating like he knew all along this would work. Lol",
            "I often stand in awe seeing some of the first touches of forwards and the ball control they have. It's mesmerizing an art form. Now the Greats of the game make it look so easy it makes idiots like me believe I can do the same.",
            "I’m watching it on replay and I still can’t believe it myself",
            "Lmao skriniar good riddance",
            "Зрада -> Перемога ",
            "A great example of them not believing in you until you become successful.",
            "I wasn't familiar with your game.",
            "u/SaveVideo",
            "It's only brilliant if it works.",
            "I read Shaparenko as Shakespeare and was very confused for a moment.",
            "I mean, at this point how many times has he watched Mudryk boot it into the upper levels?",
            "Looks like he doesn't believe in his players.",
            "Very spursy...",
            "Perfectly explained haha",
            "https://www.reddit.com/r/gifs/s/3O4z8vrRTU",
            "Bergkamp shit",
            "The pass was good because of the touch and finish, a decent keeper plucks it from the air and a normal striker doesn't do this.",
            "Agree, in most situations passes like that would not turn into goals. It's tough to control the ball and finish within such a tight space. It's because the control and finish was sublime it turned into a goal.\n\nAn excellent pass is where the defense gets caught on the wrong foot and the attacker were\n\nStill decent pass nonetheless",
            "It’s the inherent opposing nature of player and coach, coaches tend to play it safe, even when they don’t have to, and young players usually take chances older dudes wouldn’t think of",
            "I'm laughing just thinking about how in an alternate universe he was still cursing to himself with his back to the pitch wondering why the fans were cheering.",
            "Should've been keeper's ball, but Shaparenko tried to lob the keeper earlier in the half which may have encouraged him to stay on his line",
            "I agree, keeper could have smothered that or punched it",
            "Exactly, the pass is too long\nThey got lucky because of the keeper's fuck up.",
            "Keeper not only didn't believe in it, he was scared at the final \"shot\" too.",
            "how? he's clearly trying to pick out the strikers run - its an ambitious pass yes, especially because it requires an inch perfect touch, but its not really a \"lump it forward and hope for the best\", there's a clear idea behind the pass.\n\nor maybe i just dont know what a \"hail mary\" is.",
            "It wasn't just a random place to send the ball, it was at pretty much the only spot where the forward could get it and have a chance to score.",
            "uhhh the pass put him 1v1 with the keeper",
            "The pass was perfect. \nThe first touch was perfect.",
            "Now if only our Petkovic can do that on Monday",
            "Gatorade",
            "He actually acknowledged the keeper‘s mistake in his postmatch interview ",
            "I guess? I'm 31 and I didn't know Rebrov. Looking him up, seems like his career was at its peak in the late 90s. I have some memories of football during that time, like I remember the 1998 World Cup decently well, but not enough to remember a Dynamo Kiev striker, even a really good one. \n\nAnd by the time I was old enough to pay attention, he was a sub at Tottenham and eventually I guess an aging striker for Ukraine in 2006? I must've seen him play there, but seems like he didn't leave much of an impression.",
            "I'm 26 I only know him because he was at Fenerbahçe for a cup of coffee around 2003-2004.",
            ">Rebrov\n\nwell duh",
            "What an amazing game that was",
            "Trigger warning pls",
            "Best game of all time (in my totally unbiased opinion)",
            "The argentina goal came to my mind instantly. Tho Bergkamp also send a defender into the bushes after controlling it",
            "There is bearcum",
            "Both parts.",
            "Pain eternal.",
            "So Bergkamp. Must have been one of his idols.",
            "Definitely. It took an extremely well timed sprint, stellar first touch and a volley finish in very tight space to redeem that pass. I completely get the reaction.",
            "Coaches entirely rely on players to execute shit. So they can only make plans which seem to work without miracle performances. While players can control what they do so they go for the miracle, it is them who could try. If a coach has to constantly pray for a miracle shot they are kinda doing something wrong.",
            "This.",
            "4D chess from Shaparenko",
            "Yeah he knows what he's doing. It's kind of amazing in football, you don't think too much about what the attacker will do. You have played a particular pass 1000s of times and at best know what your teammate is capable of so go on and try it.\n\nThere are some players who are good enough to tell the forward exactly what they should fo with the pass too.",
            "The thing is he shouldn't have a chance to score because the keeper should come out and get the ball before thw striker gets to it and it should be fairly easy for the gk to do that. Basically there isn't any spot that he could put the ball in that should give them a chance to score, but the goalkeeper messed up.",
            "Ok, but look at the coaches reaction. If it isn't perfect they give up possession. It's not something you do unless you need to win to save your tournament. Similar to long shots, which are much rarer in league football as opposed to tournament",
            "While making him run into a hard position to shoot from needing basically a perfect touch to score?",
            "The place was slightly overhit. A keeper doing his job would've collected it or blocked the chance.\n\nIt's not a bad pass because the intent was there and it was only a few inches overhit, but I wouldn't say it's amazing.",
            "Let's go golfing!",
            "You’re Swiss, I’d never doubt your neutrality.",
            "That’s why the opposing nature exists, because most players, play all out, and they all think they’re the best, coaches are usually realistic about the rosters they have, that’s why they piss off players they know they need to bench before they overextend",
            "giving possession away to mind game the keeper for the next half, Shaparenko gambit accepted.",
            "Regardless, it's a low percentage play. Hence the term hail Mary. It's nothing against the pass, it's the fact that the striker also has to be at his best.",
            "The passer gave the striker half a chance, the striker made the most of it. Most strikers want balls that they can at least touch, so they can have options to control or one touch finish. This one was definitely on the very high difficulty side, but good strikers will always go for a pass like that.",
            "The most you can ask for as a striker is two touches, really. Defenses aren't letting you eat for free.",
            "The striker made the run in behind and that’s where he got it, he didn’t really break stride and got it right in front of the defender. Good ball.",
            "That is an amazing pass. if Odegaard was making this you'd be raving.",
            ">Making him run\n\nI mean they are called forwards",
            "Seriously lol, it’s insane people are complaining about this pass. Yes the striker needed to control it perfectly, but that’s his god damned job lol",
            "And even if he didn't control it, the striker is supposed to read that play and move into that space. Great vision + Great instinct by the two players."
        ]
    }
}