{
    "[MEGATHREAD] Solo leveling Arise global launch. Cha Hae-In draw event, Patch notes, update size and more": {
        "title": "[MEGATHREAD] Solo leveling Arise global launch. Cha Hae-In draw event, Patch notes, update size and more",
        "score": 21,
        "url": "/r/SoloLevelingArise/comments/1cmq2cb/megathread_solo_leveling_arise_global_launch_cha/",
        "content": "",
        "num_comments": 40,
        "comments": [
            "This loading circle will destroy this game",
            "Everyone please play the PC version!!! The mobile version is too buggy but the PC version is fantastic, no complaints so far the animation, in my opinion, rivals or even supersedes the anime adaptation!",
            "that Circle is a nightmare.",
            "Man Im have bug on mobile Im cant mov pls fix it",
            "https://preview.redd.it/d8qxt67os5zc1.png?width=1908&format=png&auto=webp&s=37e02b130dd2f4bf513fe957ca91335c5fbdac79\n\nim stuck in here nothing is loading wtf?",
            "Can someone please explain what is \"Special Summon\" and how to use it. I have a few SSR+ items in the list and I can not see it iny Weapons section and neither can I see it anywhere except special summon window",
            "Lame game. Can't even play. Always get stuck at black screens after cut scenes finish or skipped. Sometimes stops midway loading. .\nReinstalling never helped. \nSad to say, but I guess I'll have to drop this :( untill they fix it.",
            "https://preview.redd.it/0d22t6wa4vzc1.jpeg?width=2800&format=pjpg&auto=webp&s=130e3553acd7f7a6e6b088b7b4996aea26b58668\n\nOmfg",
            "Has anyone also gotten to the point where your stuck on the tutorial just be cause you claimed before the tutorial even forces you to claim it? because I'm currently stuck on that right now and I can even progress and I can't even claim my daily check in just because I'm stuck on a tutorial",
            "\"Communication with server is lost\" on pc is a repeating problem. I'm on wired 100mbps fiber. The never ending Loading Problem.",
            "Are the gate keys renewable? I had 11/10 and went through a couple gates and now it's at 9/10, and it's not showing a timer, so it's not a stamina thing. So is gate mining loot a premium resource?",
            "PLEASE HELP, MY GAME ON ANDROID KEEPS CRASHING AND NOT OPENING, HELP",
            "Is anyone playing on chromebook, I keep getting security code 4 then game closes ",
            "Hmmm is the only way to level Jin woo via the story? I'm not seeing a level up option anywhere on his character page.",
            "Are they ever gonna fix that damn loading circle LOL",
            "I was rerolling my account, and I am trying to claim my 800 essence stones from the mail but it’s just not showing up. Did I do something wrong? I made sure I didn’t delete it btw.",
            "Both PC and Mobile client are garbage. PC client I am stuck on black screen not even showing the loading screen, while on Mobile I get to see the circle every time. Is money and profits are the only concern of this game/Devs? I thought they have pre-release it on some countries beforehand and it still dog shit like this?",
            "Please help i can't take my prize even though I fulfilled all the conditions in achievements",
            "What are patch notes?",
            "I obtained Cha Hae-In before I unlocked the event and it’s not registering that I have her. What should I do? I tried restarting the app but it still doesn’t show in event missions.",
            "https://preview.redd.it/e9e15i0eg43d1.png?width=998&format=png&auto=webp&s=2698040dce12a501814e2fd682c87e57bd32c80a\n\nanyone else having this problem? it wont let me click confirm",
            "has anyones game recently just stopped playing any sound on the pc client of the game??",
            "https://preview.redd.it/d19skrx0gk5d1.jpeg?width=1792&format=pjpg&auto=webp&s=a9d6c97e9703171913875f199466d6b812d7af36\n\nDoes anyone know what I should do?",
            "Yup, every few seconds...loading circle...bs",
            "Have you sussed never going to the lobby stops the circle x",
            "seconded.",
            "Same bro, it's showing controller settings so I can't move or do anything by touching the screen",
            "If you press the pause button on the top right, then go to the settings on the bottom right and change the controls to touchscreen, it'll work.",
            "Same, I'm playing on pc using the netmarble launcher.... well, would if i wasn't stuck on that screen that is.... i've reinstalled and still the same.",
            "Same, except I was playing then got loading circle and now stuck in loading screen.",
            "You have to finish the summons then you unlock the guaranteed summon but you need a ticket for it.",
            "Its you that had the issues. So no, its not a lame game.",
            "Keys reset every day, so you can do 10 gates per day. If you level up, your maximum keys will grow too.",
            "I can’t even download it on Chromebook. Is there a way you specifically downloaded it?",
            "Story and gates but gates don't give much exp.",
            "Change from the settings from controller to touchscreen, for some reason the controller is the default now",
            "You're lame too. It's a developer issue. I was calling solo leveling lame. \n\nI've played other netmarble games, never experienced this issue. So it's lame on their behalf for this issue. Calm down. 😂😂😂😂",
            "From playstore on. Chromebook don't kno if it change, but I can't play it still keeps crashing after it reaches begin screen... Really sucks",
            "Who says im not calm? You just sound like a butt hurt kiddo. 🤷",
            "I guess my laptop isn’t good enough to run it then lol"
        ]
    },
    "Official New Solo Leveling Board Game": {
        "title": "Official New Solo Leveling Board Game",
        "score": 91,
        "url": "https://v.redd.it/1sc7avdgab7d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "https://x.com/redice_studio/status/1802962882084123126?s=46&t=oBM-l8bc8KIbgtTqxQw64g",
            "interesting and probably wont be released on west lol",
            "Mfs are milking solo Leveling. I ain't complaining tho. Keep on coming 🔥🔥",
            "Shout up and take my money",
            "The start for some reason sounds like the pornhub intro",
            "https://preview.redd.it/i0dt3ipxrb7d1.jpeg?width=357&format=pjpg&auto=webp&s=f76eeb980d96c7da767b6c28f13234a19416b432",
            "This feels like someone’s low effort cash grab.\n\nWe need a game company to make an open world AAA action RPG out of this, if someone does it right that will be the penultimate solo leveling experience. \n\nUNTIL we get something on the level of three body problems level of virtual gaming devices.",
            "Milking at the highest level currently btw solo leveling live action production ongoing ig"
        ]
    },
    "Solo Leveling Cha Hae-In cosplay 나혼자만레벨업 차해인 코스프레 HaneAme": {
        "title": "Solo Leveling Cha Hae-In cosplay 나혼자만레벨업 차해인 코스프레 HaneAme",
        "score": 106,
        "url": "https://www.reddit.com/gallery/1dlrnzs",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Reminder that content from the latest episode must be tagged as spoiler. Light novel and Manhwa spoilers within titles or untagged spoilers in non-spoiler threads are not allowed.\n\nTo format spoilers:  \n`>!your spoiler here!<` (no spaces) will look like >!your spoiler here!<\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sololeveling) if you have any questions or concerns.*",
            "I set up the background and handled the photo effects myself, hope you like it :\">  \n[Source from My twitter](https://x.com/haneame_cos/status/1804435932361445795)",
            "This is AWESOME 🔥🔥",
            "Wow this is really good! Everything about it seems well thought out",
            "Noice"
        ]
    },
    "It is doing well in Japan ": {
        "title": "It is doing well in Japan ",
        "score": 164,
        "url": "https://i.redd.it/3hshrc9mc18d1.png",
        "content": "Manhwa in Japan is expensive  ",
        "num_comments": 15,
        "comments": [
            "Reminder that content from the latest episode must be tagged as spoiler. Light novel and Manhwa spoilers within titles or untagged spoilers in non-spoiler threads are not allowed.\n\nTo format spoilers:  \n`>!your spoiler here!<` (no spaces) will look like >!your spoiler here!<\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sololeveling) if you have any questions or concerns.*",
            "They went to solo Leveling's root for this cover: blue leveling 😭. The original image slaps harder than anything\n\nhttps://preview.redd.it/7n9nt6ezt18d1.png?width=1063&format=pjpg&auto=webp&s=286167b4508494b65651c629e70576af5d83c779",
            "it's expensive maybe because it is full color. like op said, normal manga like naruto is around 500 yen. solo leveling book is around 1000 yen. it is like a 2 manga price. so yeah 2M copy is a lot of money. i think it is popular",
            "short answer no, but globally yes massively",
            "Just a question I know the Japanese version changes the names I’m assuming they change other aspects too making goto korean and not Japanese ?otherwise it wouldn’t be popular",
            "So it IS *♫Big in Japan♪*, now?  \nDamn. Makes me worried about Season 2, now.",
            "Ngl",
            "To buy manhwa in Japan it like buying 2 times of normal Manga",
            "goto and original japanese are from fictional nation called DFN in jp ver",
            "Why worried?",
            "Oh well that’s interesting do you know where I can read the Japanese version ?",
            "Because of what happened to Shield Hero.\nIt started strong and then, suddenly derailed, in Season 1 no less. And, I haven't watched S2 but people say it's bad.\n\nAnd with usual issue of studios exploiting workers...",
            "I'm sorry I don't know about it",
            "People always forget to live in present when that happens we will see it",
            "Shield hero went down not because of any production issues or anything. It went down because that particular part of the story is shit. Even the author himself regretted writing that arc."
        ]
    },
    "Got this tattoo done yesterday and I'm stoked with how it came out.": {
        "title": "Got this tattoo done yesterday and I'm stoked with how it came out.",
        "score": 84,
        "url": "https://v.redd.it/a8elo2dcq08d1",
        "content": "I knew from the moment I saw this creepy smile, I wanted it to be part of my anime panel sleeve.\n\nFinally got around to getting it done!",
        "num_comments": 5,
        "comments": [
            "Reminder that content from the latest episode must be tagged as spoiler. Light novel and Manhwa spoilers within titles or untagged spoilers in non-spoiler threads are not allowed.\n\nTo format spoilers:  \n`>!your spoiler here!<` (no spaces) will look like >!your spoiler here!<\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sololeveling) if you have any questions or concerns.*",
            "Now bro's safe from everybody. That tattoo is gonna scare even the demon under the bed.",
            "wow that's so fucking cool 🤩 I've been thinking of getting his daggers tattooed",
            "are you thinking of doing panels from loads of different manga? Or just solo leveling?",
            "Less thinking more doing 😎\n\nAnd thank you!!"
        ]
    }
}