{
    "FAQ and Beginner Questions Thread [March 14, 2024]": {
        "title": "FAQ and Beginner Questions Thread [March 14, 2024]",
        "score": 129,
        "url": "https://www.reddit.com/r/StardewValley/comments/1bebrg7/faq_and_beginner_questions_thread_march_14_2024/",
        "content": "Welcome to Stardew Valley! Here are some common answers to get you started. Feel free to ask beginner questions here rather than making a full post on the subreddit. \n\n# General questions\n* **[Common gameplay questions](https://www.reddit.com/r/StardewValley/wiki/faq/)**\n* [Tips and guides](https://www.reddit.com/r/StardewValley/search?sort=top&q=flair:Resource&restrict_sr=on)\n* Official [wiki](http://www.stardewvalleywiki.com/), [website](http://stardewvalley.net/), and [forums](https://forums.stardewvalley.net)\n* [Stardew Valley Discord](https://discord.gg/stardewvalley)\n* [Using mods](https://stardewvalleywiki.com/Modding:Player_Guide)\n\n# Previous pinned posts, subreddit announcements, and new rules\n* Want to look through old FAQ threads for an answer to your question? Here is our [old FAQ thread](https://www.reddit.com/r/StardewValley/comments/16jt60y/faq_and_beginner_questions_thread_september_16/)\n* [Animated Custom Flairs and Prestige Flairs](https://reddit.com/r/StardewValley/comments/sju1h5/announcing_custom_user_flairsand_animated/)\n* [Community Updates and Inclusivity Reminders](https://reddit.com/r/StardewValley/comments/w7pzoh/community_reminders_and_updates_inclusivity/)\n* [/r/StardewValley left /r/ popular and /r/ all](https://reddit.com/r/StardewValley/comments/w7ppsm/rstardewvalley_is_leaving_rpopular_and_rall/)\n* [After user voting, AI generated content will be added to the list of removed topics](https://reddit.com/r/StardewValley/comments/x9963t/rule_update_aigenerated_content_will_be_removed/)\n* [Simple questions are welcome](https://www.reddit.com/r/StardewValley/comments/ymdiko/mushrooms_or_fruit_bats_simple_questions_are/)\n* [Content warning rules](https://www.reddit.com/r/StardewValley/comments/1367xy8/spoiler_tags_content_warnings_sensitive_topics/)\n* [New mods announcement](https://www.reddit.com/r/StardewValley/comments/15rfn3q/our_new_mods_have_joined_the_team/)\n* [Metrics for IRL posts and relativity](https://www.reddit.com/r/StardewValley/comments/15ooqfe/is_this_relevant_to_stardew_valley_on_giant_crops/)\n* [Userflairs for bot bouncers](https://www.reddit.com/r/StardewValley/comments/166och5/new_userflairs_for_bot_bouncers/) \n\n# Very common FAQs / removed topics \n* **[insert item here] showed up on my farm, what is it?**\n     It could be a a few different items that are >!relatively rare but have a high enough spawn rate!< that they are included in our removed topics. Check out our [list of removed topics here](https://www.reddit.com/r/StardewValley/wiki/removed_topics)\n\n* **\n\n\n# Game updates\n* **What was in the last update?**  \n  See release notes [for PC](https://stardewvalleywiki.com/Version_History), [for consoles](https://stardewvalleywiki.com/Console_Version_History), and [for mobile](https://stardewvalleywiki.com/Mobile_Version_History).\n\n   See also a table of [which version and features each platform has](https://stardewvalleywiki.com/Stardew_Valley#Current_versions).\n\n* **Are future releases planned?**  \nStardew Valley 1.5 was released on PC in late December 2020 and console in February 2021. Android/iOS received the 1.5 update in early January 2023. Stardew Valley 1.6 released on 19 March 2024 on PC. [Console release to follow ASAP](https://twitter.com/ConcernedApe/status/1762192764899627457).\n\n* **Does every platform get the same content/updates?**  \n  Mostly yes. Updates are developed for Linux/Mac/Windows first, then ported to other platforms. There are customizations for each platform (like tap to move on mobile), but otherwise content is identical across all platforms. See also a table of [which version and features each platform has](https://stardewvalleywiki.com/Stardew_Valley#Current_versions).\n\n  The exceptions are PS Vita (which won't get any further content updates [due to platform limitations](https://twitter.com/ConcernedApe/status/1232797409010278400)), and Android/iOS (which will continue getting all updates, but [don't support multiplayer](https://twitter.com/ConcernedApe/status/1262068497086967808) or Chinese translations).\n\n* **Is Stardew Valley on XBox GamePass?**\n\n     Stardew Valley is on XBox GamePass as of December 2, 2021. See [here](https://news.xbox.com/en-us/2021/12/01/coming-soon-xbox-game-pass-december-2021/) for details.\n\n# Multiplayer\n* **How does multiplayer work?**  \n  See [Multiplayer](https://stardewvalleywiki.com/Multiplayer) on the wiki.\n\n* **Is crossplay supported?**  \n   All PC players can play together, whether they're on Linux/Mac/Windows or GOG/Steam. [Console crossplay isn't supported](https://twitter.com/ConcernedApe/status/1036993838613651459), and mobile versions don't have multiplayer.\n\n* **Is split-screen supported?**  \n  Yep, split-screen was added on PC and console in Stardew Valley 1.5.\n\n* **Will Android/iOS get multiplayer?**  \n  There are [no current plans for multiplayer on mobile](https://twitter.com/ConcernedApe/status/1262068497086967808) (including split-screen multiplayer).\n\n* **Will the 1.6 update apply to my current game?**  \n  Yes! New updates always apply to existing saves.\n\n# Other\n* **Can I transfer saves between devices?**  \n   You can [transfer saves](https://stardewvalleywiki.com/Saves#Transfer_a_save) between Android, iOS, and PC (Linux/Mac/Windows).\n\n   Consoles unfortunately don't let you access the save files. The Switch version also has a different format that's not compatible with other platforms (the format used by other consoles is unknown).\n\n* **How do I take a screenshot of my full farm?**  \n  See [this guide to taking farm screenshots](https://forums.stardewvalley.net/threads/how-to-share-your-farm-and-use-stardew-planner.152/).\n\n* **If I buy the game on one platform, can I get it for free on a different one?**  \n   If you buy it on PC, you get the Linux + macOS + Windows versions; if you buy it on PS4, you get the PS4 + PS Vita versions. Otherwise each platform is a different edition with separate development, so you'll need to buy it again if you want it on a different platform.\n\n* **Where can I report bugs?**  \n  1. If you use mods, see the [troubleshooting guide](https://stardewvalleywiki.com/Modding:Player_Guide/Troubleshooting) first.\n  2. If you use mods and the bug disappears when playing without them (by running `Stardew Valley.exe` directly in [your game folder](https://stardewvalleywiki.com/Modding:Game_folder)), report it to r/SMAPI or see [Modding:Help](https://stardewvalleywiki.com/Modding:Help).\n  2. If it happens without mods, report it in the official [bug report forum](https://forums.stardewvalley.net/forums/help-bug-reports.12/), which the game developers keep an eye on.\n\n* **How do I use or create mods?**  \n   See the pinned thread in r/SMAPI for more info, and feel free to ask questions in r/SMAPI!",
        "num_comments": 2259,
        "comments": [
            "I just laid down to sleep and I can see the layout of my farm burned into the back of my eyelids. It may be time to take a little break from the game. ...But, me won't.",
            "Our save games will be fine once the 1.6 upgrade happens right?! People on the sub are talking like “I finished x before 1.6” and “I’d better hurry up and do abc before 1.6”\n\nBut the save games will be fine right? (Thinking of the devastation of my 7y/o if it didn’t work)",
            "First time gamer, mid-fall on the switch. \n\nAs much as I appreciate many of the beginner guides, I feel like they are really advanced (or maybe not for my platform?).. Does anyone else \"new\" feel completely overwhelmed by completing community centre and getting level 140 at the mines and raising animals and knowing what to buy/cook/sell? \n\nI can't help but feel I'm \"doing it wrong,\" even though I know there's no real time limit and I should enjoy the process. Anyone else?",
            "I started a new save on the new meadow farm, and I keep getting \"You've got some new ideas to sleep on...\" message what does this mean?",
            "Can dogs randomly give you sticks now? I just now went to go pet my dog and I ended up getting a piece of driftwood in my inventory as if my dog had found a stick and had given it to me, much like dogs do Irl.",
            "I don't have much of a comment, but I am getting back at Stardew Valley now, and I just wanted to say that I really appreciate this post! As someone who hasnt played in years, the \"console/PC patches\" link is a god sent!",
            "Silly question but what is that impossible to catch fish in the ocean? I’ve noticed a similar pattern where it leaps to the top of the bar at the start and then crazily goes up and down & I lose the fish every single time. I’m so determined to catch it but what on earth is it?! It’s not a puffer or octopus because I’ve catched those",
            "The post still says there's no release date for 1.6, but it's been announced it's now March 19th, at least for PC.",
            "do we know what blue grass does?  \ni tried to look on the wiki but only get  \"Has a chewy blue grass that animals love\"",
            "I'm struggling to figure out what to even do on a most basic level. I've cleared some ground, planted and harvested turnips, and walked to the town. I don't know what comes next. I talk to people and the general vibe is \"hey you're new, fuck off!\". It also seems that by the time I walk to town, my character needs to sleep, so then it's time to walk home. I see screen shots of elaborate farms and stuff and I don't know how that's possible.",
            "Is it worth getting more than 20 lightning rods? Heard they give diminishing returns",
            "https://preview.redd.it/1undzb1hb4rc1.png?width=404&format=png&auto=webp&s=d3ff7e3b3217742dd2ae76b49eaad17407f5af36\n\nDid the \"Max Luck\" sprite change in the last update? As far as i remember, it did'nt have this stary background",
            "What should i have done by the end of the second year?",
            "How is everyone organizing there mushroom log/tree tapper things I'm just being lazy and putting them between trees right now in straight lines",
            "Just had a cutscene with Shane where he has these blue/purple chickens. Is it possible for me to get ones of that color?! If so, how?? :o",
            "I started a new save and I have the «Getting Started» quest but for another type of farm.. Usually I’d get the one for Harvesting Parsnips, but I have one about chickens..\n\nEdit: I have the normal standard farm. I have updated to 1.6",
            "I am getting to the winter of year 2 and am really enjoying the game while taking my time but I have a question.\n\nI keep getting various rarities of crops, and animal products.\n\nIs it best to keep the gold ones and sell the lower quality ones? Is it best to sell the lower quality ones and keep the higher ones? Should I be saving x of each item for the future? My cash is flowing pretty nicely due to the amount of jams, pickles and wine I am selling but I dont know what the next step is.\n\nI have no idea, is there an optimal route?",
            "Does anyone know of an alternative mod for the misophonia accessibility mod or another mod that also does the same thing? \n\nI had been using it because the sound of the kegs drives me absolutely crazy (as embarrassing as it is to say that) but it hasn’t been updated for 1.6 and I don’t know if it will be.",
            "I just want to say, I play this the first time this week, and when I saw Abigail design, it's instant \"that's the one!\"",
            "my cat stepped on my keyboard while playing stardew valley and now the menu on the bottom of the screen when I walked that has the tools has disappeared, I can't retrace his steps to try and get it back please help",
            "Is there somewhere a table that shows what is better to put in jar and what is better to put in keg?",
            "I’m in mid summer of my first year, and my partner and I have had literally 2-3 total days of rain since we started, and bad luck nearly every day. What is going on?!\n\nI played a year once before (a few years ago) and I remember much more rain and balanced luck. Are we just being… unlucky? Or did chances change?",
            "I'm playing on the medowlands farm and i cannot for the life of me find where the fruit/mushroom cave entrance is, i've googled everywhere and i can't find any answers. i know its next to the greenhouse on normal farms but i guess its different on medowlands? perhaps i'm just very blind.",
            "Hi  \nI would like to start a game with my mom, she's very depressed and I thought to motivate her to play together, she liked Cleopatra a lot.  \nCan I somehow create a stable server where we can play online together but it's permanent?   \nA farm where she doesn't have to wait for me to be online to play and viceversa? like a mmorpg experience basically",
            "I'm an idiot, I was keeping books in my inventory because i thought they were passive, for 3 seasons I lugged them around with me before I read on the wiki that you have to use them.",
            "I’m a new player, a few days in on the switch. Totally not addicted, I can stop anytime I want. Seriously though, this game is a delightful time suck. Also, what are the conditions to best catch pufferfish?",
            "If I plant blue grass on the last day of winter will it spread like crazy on spring one like regular grass does?",
            "What should I focus on in year 2?\n\nIn Summer Year 2. I have a garden growing one batch of every crop with most covered by sprinklers. 8 kegs always brewing, plus 4 chickens, 4 cows, 4 bee hives. I’ve reached the bottom of the mines, started exploring skull cavern, unlocked the Quarry, and gone to the secret part of the forest. have 10 heart relationship with Leah and steadily progressing relationships with most villagers. \n\nI’m able to make about 3k+ a day without much effort, so what should be my next focus now the farm is pretty self sufficient?\n\nRelationships, community centre, new farm buildings, skull cavern? Feels like I need a new focus.",
            "Can you move tea saplings that have been planted already into the ground? I put mine in quite an awkward place and really want to move them but I’m guessing I can’t? ",
            "How do I temporarily remove mods so I can play 1.6 vanilla? (Steam and windows)",
            "What companion app do people use to keep track of items of quests while playing? I remember downloading one when I did my main playthrough a few years ago, but I can't remember which it was.",
            "I have been playing this game for sometime now, well compared to other it's very less. I'm at Winter year 1. After the 1.6 update, should I continue playing this save since I barely started or should I go for new save?",
            "The link concerned ape posted for  the mod compatibility, any mod that says \"use latest version\".. does that mean i have to download them again or are they already automatically compatible with the new update.\n\nLink here : [https://smapi.io/mods](https://smapi.io/mods)",
            "Am I tripping or did CA say something about an iridium Scythe?",
            "My gf only has a phone, and I cant afford to gift her a pc. It woudl be really great to play with her on muliplayer.\n\n  \nWill that ever be possible ?",
            "**What is some general tip you would give a new player during early game?** e.g. Save certain items? Spend stamina/time on Farming/fishing first? Raise friendliness on certain NPC before anyone else? etc\n\nI played this game back ion 2019-ish. I have Forgotten most of the mechanics. I saw the 1.6 update and wanted to come back and give it another go. Thank you veterans :)",
            "Is the update available for me? I'm playing Stardew Valley through Microsoft Store, not Gamepass just to clairfy.",
            "Can anybody give me any basic advice?\n\nI've tried playing a few times and I always feel overwhelmed by not knowing which crops to grow or what I should be doing.\n\nCan I just play and not give much concern or will I miss out on a lot of things?",
            "Hello everyone! first time poster but I used to play Stardew several years ago. The 1.6 got me so excited to get back in since it blew up in my FYP. But I’m kinda wary on starting up since I never played the last big updates. I played at the time there was no volcano, ginger island, and not even the witch’s area. I’m wondering now how best to go about it. I browsed through some of the resources here, are these still valid (read: up to date)? like the permanent missable content i have to watch out for? Is there any youtube channel that post fairly recent beginner guides? I’ve tried googling myself and am just overwhelmed with all the available content, getting a bit old now, and am struggling to comb through all the videos. Happy to receive any leads! thank you!",
            "🐓 I was gifted stardew valley for switch but never played it because the clock gave me anxiety? I’d like to give it a try - do you think that I should wait to start until the update comes out for switch? Or will playing it for a few weeks without the update make the update more exciting when it arrives for switch?",
            "I've been trying not to spoil myself too much so I can be pleasantly surprised while playing when it arrives on switch but can anyone let me know if there are outdoor fairy lights in the new update?",
            "What does it mean when I try to cut down a tree and it says “I shouldn’t cut down trees in town.”  It lets me actually chop once, then shows me the message…?  ",
            "When looking at inspiration for forest farm layouts to plan out my farm, I see a lot of people putting stuff where I normally get hardwood from those stumps. How are people able to get hardwood if they put buildings in those areas?",
            "In previous farms I vaguely recall being able to stop fruit from spawning in the bat cave with a crafted floor but that no longer seems to be the case? Am I just misremembering? (I checked previous saves but it looks like I only kept saves with the mushroom cave.)",
            "I'm looking into planting rows of fruit trees and i got a question about the planting process:\n\nI know that you have to space out the trees that the 8 tiles around it are free and not occupied with other plants. Does it matter if one of those free spaces is occupied with water or will that stop the tree from growing to its full height?",
            "Will traveling cart random stock part change if you reload friday morning save ?",
            "Hi everyone.\n\nI can't tell if my file has more trees spawning than default, I don't remember what the norm is and I have 100+ mods (my game runs fine) and I'm wondering if one of them could be responsible for what feels like an increase in trees.  Anyone have any ideas of what mod it could be?",
            ">Petting a farm animal, milking a cow or goat, shearing a sheep, or picking up an animal product inside a coop gives 5 experience points each.\n\nI'm assuming that you don't get the experience/mastery when using Auto-Grabber?\n>The Auto-Grabber automatically harvests milk from cows and goats, wool from sheep and Ostrich Eggs from Ostriches when placed in a Barn.",
            "I’m on year one winter day 20 and don’t know what to give Lewis for secret gift exchange I look at the gift list on the fan wiki and do think I can get any of his loved gifts in time. What should I get him",
            "Question about this change in the 1.6.3 patch\n\n>! Adult mossy green rain trees boost the moss growth rate of nearby trees !<\n\nDo the >!fiddle head trees!< count as >!adult mossy green rain trees!< or do only the other 2 types count.",
            "Has anyone got a full screenshot of the fully upgraded farmhouse in 1.6 but without any decoration or with the least possible?",
            "I just finished year 1 today. I also just saw a tips and tricks video saying to keep all normal quality fruits and vegetables…and I did the exact opposite this whole time where I sold everything and kept one gold star crop of everything for quests, festivals, or turned them into the community center. I know it’s to turn goods into artisan goods but at this point I’m scared to sell anything and truly don’t know what to keep or sell. Should I now keep all normal crops and sell high quality ones?",
            "Has anyone else had a ton of trouble finding the >!Treasure Appraisal Guide book!<? I've already got perfection on my save and just missing this for the achievement. Slept through multiple years checking the bookseller, broken 100+ Artifact Troves, 200+ Mystery boxes, just is not turning up anywhere and I'm getting so bored of grinding for it",
            "Does anyone tested if the new happinness bonus for closing the coop door before sleeping makes a huge difference?",
            "What's the best way to handle the mines? I absolutely hate mining AND combat in my farming games but I'm halfway through year 2 and still haven't gotten to floor 5 (I saw a rock crab and it freaked me out so I've been avoiding the mine ever since).",
            "Learn from my near mistakes:\nI use the automate mod (which I adore) and I had an idea to set up an elaborate crab pot empire with attached worm bins and fish smokers to keep the rube goldberg money machine printing. \n\nTurns out the Fish Smoker needs coal (which I imagine most other people realize) and even with the artisan/angler perks, the fish should have a base price of 90g to compensate for the 250g a piece of coal costs in Year 2. Crabs and lobsters are the only crab-pot fishables that have a base price greater than 90g, so smoking anything else from those pots will end up losing money. \n\nFYI - Most normal tier fish have a base price less than 90g while most silver+ fish have a price greater than 90. The tier carries over while smoking, so in a reverse of fruits and vegetables, you'll want to process your highest quality fish and just sell most of the low quality stuff.",
            "Can someone tell me why this is happening? \n\nhttps://preview.redd.it/p8l3kg0j0xxc1.png?width=892&format=png&auto=webp&s=122eaf5a86b4b8d6c36771c610d6696c501a28bb",
            "I just joined and all I've done is grow parsnips and cut down trees and bushes. Could someone tell me what I'm supposed to do and what the games really about. Like do I just farm and live peacefully? Or do I go out and hunt or meet people or what I'm just confused. And what all should I do to get started properly?",
            "How are some people able to raise slimes in their house or outside without a slime hutch? I placed a slime egg in the incubator inside my house and it never hatched. After a few days it just disappeared and the slime incubator was empty so I lost my egg. :'(",
            "is the 1.5 min max guide still viable for 1.6?",
            "\n\nEnd game spoiler question perfection\n\n>!For the summit cut scene what happens if you divorce your partner before doing it?!< >!What happens if you have Krobus?!<",
            "Somewhat silly question about pets in 1.6: does the >!yellow turtle !<ever open its eyes? Because in the picture at Marnie's only one of them has their eyes open.\n\nI really want to get one, but I wanna know beforehand whether I'm buying a permanently sleepy lad or if I'll bother to save up for the other one 😅",
            "Still can't find all golden nuts. I used the map and wasn't able to understand a lot of the locations. Especially the bird gifts because I added them all and I still don't get anything. I got the gifts multiple times just to be sure fro. The birds themselves, still no luck. Vanilla, no mods. \n\n\nI hate looking for nuts ",
            "I'm new in stardew valley and I love the game. However, I do want to play on both pc and mobile. Is it possible to switch save data from mobile to pc or vice versa since the pc version is on 1.6 and the mobile is currently on version 1.5.6?",
            "Does pregnancy's 14 days count the night of conception? Like, if concieving on the 1st of the month would the kid be born on the 14th or the 15th?",
            "I cant get Abigail's 10 heart event to trigger, I have been trying for days but it just won't work. What am I doing wrong?",
            "Hi, I’m trying to get the star drop flare but it won’t let me add a comment to that thread. It’s not the 15th yet? Help please?",
            "Is there a printable guide that is up to date? I'd love to have something in paper that is comprehensive",
            "Played on switch for years. Just got a steamdeck and planning to start over with the ridgeside valley and scarp mods since it’ll feel brand new. Is it necessary though? Is the pc or steam version different than what’s currently on the switch?",
            "[deleted]",
            "I haven't been paying super close attention, is there an estimated release date for 1.6 on consoles and mobile?",
            "https://preview.redd.it/te7knqx4s7pc1.jpeg?width=414&format=pjpg&auto=webp&s=8a28e2a68e9c0dcbd18acd9da32555f352e1af6c\n\nWhat are these snow covered things? I can't put any decorations (except flooring) on this spot but one morning these appeared",
            "First time player here, waiting for the update. Do mods work easily on Steam Deck? Or is it a lot of manual file management that I'll need a keyboard and mouse for",
            "If I update SMAPI to 1.6 but then want to downgrade to 1.5 beta branch, will I need to reinstall SMAPI back to 1.5 or is 1.6 backwards compatible with the 1.5 game branch?",
            "Maybe a silly question. \n\nI set up mods on my steam deck a while ago but want to play 1.6 vanilla without uninstalling everything. Is there a way I can toggle between vanilla and modded without uninstalling and reinstalling every time? I think I installed them manually.",
            "1.6 question, as I'm restarting the game for the first time in forever... according to patch notes, >!tea saplings have had their sell price cut in half (500 to 250)!<. How are newbies planning to get rich quick early on in a new farm now?",
            "I know CA said to consider starting a new farm to see the new content but I just started a new one a few months ago and I’m on fall year 1. Wondering if it’s worth restarting yet again for 1.6. How much new stuff could there be for the first 3 seasons?",
            "1.6 Question: Is there a way to get / buy the new \"blue chewy grass\" on the new farm? I know you start with a lot of it but if you want to cut it to make space, is there a way to get it back? Except waiting for an entire year of course",
            "Does the pc game pass version work yet?",
            "Anyone have any real idea of when it'll be coming to game pass? (Xbox for PC) I'm hearing anywhere from later today to two weeks. I may buy the Steam version if it's not coming today or tomorrow.",
            "Does Grandpas Farm still exist? I can’t find it but I found IFR2 and a standard farm expanded mod on nexus.",
            "I already have the Infinity Sword. And chance I can get the achievement without having to go through the hell of re-earning the sword?\n\n**Edit:** will the Dagger & Hammer count?",
            "Haven’t played in ages, want to try again with the update. What farm would you reccomend?",
            "Hi. Does anybody know if there is mod that allows you to click a little further away from your character instead of right next to yourself. it's frustrating how close you need to be to where you want to place things.",
            "https://preview.redd.it/gk6ig4wzlppc1.png?width=385&format=png&auto=webp&s=d90ce1bd273b22a96aa22715e53c26a4399b3826\n\nWhats Slime Slayer and Crusader ??",
            "Is it normal to be fishing iridium quality fish on spring 9 on a new save? (Fishing skill at lvl 4)",
            "Guys, do we know if 1.6's spouse portraits addition also applies for 14 hearts with roommate Krobus?",
            "Is there any mod that brightens hair that works in 1.6? The only one I know of was Kat's Brighter Hair mod, but that one doesn't seem to work in 1.6, and I don't know any other to check in https://smapi.io/mods",
            "hi yall. this is my farm on year three, i finally got the community center fixed and my house is getting the second upgrade :) thank you for the help. where do i go from here? i still have a lot of content to unlock. my current shed has some furnaces, charcoal kilns, the computer, wood chipper, and two crystalariums. i think i need more iridium\n\n* i don't really know how to do farm layouts but i assume having more sheds is good? i plan to keep land open for trees to grow though\n* are these enough spaces for crops? the one in front of the greenhouse is used for fiber (although i am running out of mixed seeds)\n* should i focus on getting to the 100th floor of the skull cavern? i think i can collect jades to exchange for staircases\n* what's the best way to get bombs? crafting them takes too many iron ores for me. is desert trader better than the dwarf's store?\n* what food do you guys use in the caverns? i switch between scrambled eggs, hashbrowns, and salads. i also like cactus fruits because i have the botanist profession\n* fishing is the only thing i dont have maxed levels, what fishing tackle is good? i like the one that makes the bar bigger\n\nhttps://preview.redd.it/uzh94w3b21qc1.png?width=1080&format=pjpg&auto=webp&s=9e0cbe549603fb05f30336d1a12bbcc06bbeca86",
            "Can you smoke legendary fish? I caught the Legend on Spring 16 Year 1, so I'm wondering if it's worth it to buy the smoker recipe just to double its value and sell it.",
            "I got a Dinosaur egg artifact back in spring and donated it to the library. Could I have hatched that egg with a deluxe coop or is that a different kind of dinosaur egg",
            "Quickest way to farm rock? Just realized how useful staircases are in yr 3 :(",
            "Why can't we post photos anymore?",
            "Hi friends! I bought Stardew Valley on console (played but not completed before on PC) and console isn't updated to 1.6 yet. Without spoilers, is there any reason why I should hold off on playing before 1.6 is released there? Like, major missables if I get through spring and/or summer year 1 on 1.5.x?",
            "can anybody help? im using cbj item spawner mod and wanted to see how a fish tank would look in the nursery, without realizing it's the community center fish tank. i accidentally placed two in the attempt to remove one, and neither of them will be removed. i really don't know what to do.\n\nhttps://preview.redd.it/k0n92ue96yqc1.png?width=1507&format=png&auto=webp&s=07f23e2f200a3cd923f52b6c8e3f43181720a97b",
            "So might be a stupid question but I dont seem to get any tickets from doing sidequests in my friends coop world, is it that only the host gets them or am I experiencing a bug?",
            "how do i feed my animals through the winter ?",
            "Why isn't this tree growing? I planted it over two months ago in-game and the other ones I put near it have grown completely already. It has an empty space on all sides (I checked behind it already) and it's fertilized. Am I just unlucky or did I do something wrong?\n\nhttps://preview.redd.it/dmxmc9d7i9rc1.png?width=403&format=png&auto=webp&s=24d86a353d93ac345f97d37d16fb7e84924b59fd",
            "Hi! I hope this is the right place to ask this question. I was curious if anyone has a Steam Deck they use to play Stardew Valley? I use a lower end pc with mods and am thinking about getting a Steam Deck so I can play with my mods (unlike with a Switch). Does anyone have a recommendation for a Steam Deck model I should look at? I'm wanting to get a used one not the newest one for price reasons. I would love to hear anyone's advice or recommendations.",
            "[deleted]",
            "I just got a giant Qi Fruit while doing the one quest. Will it disappear with the rest of them when I complete the quest?",
            "very recently i decided i wanted to start hunting for the living hat, i've been trying to allow weeds to grow for a couple seasons, mainly in cindersnap forest and the ginger island jungle and dig site\n[i've got the golden clock already, i could demolish it but it's a hassle]\ni didn't quite account for green rain though, is it helpful or a hinderance in this?\ndo the mossy weeds also have the drop available? they disappear by the next day don't they? i'm hesitant to continue past it incase it's like a really good opportunity to get it as there're a lot more weeds about, i might do a couple rounds and see what happens but i figured i might try asking and see if anyone knows anything\n[apologies as i'm not a common reddit user, i hope this is a valid question'']",
            "I've recently gotten back into playing again and just started decorating my house. I haven't been able to place wood panels on the most outer bit of wall next to doorways/stairs and can't remember if it's always been like that or if it is a bug or something? Or is it a mod? \\^\\^' I've been looking at images of other peoples houses and many have panels in those spots?",
            "Is there a guide for optimal sprinkler, scarecrow and bee house placement (as in using all of them together)?",
            "Ive always done the regular layout, the green forest-looking areas on the Meadowlands map are not farmable correct?  \n\nSeparate question, can you upgrade the cabins like you can the main house?  If I'm doing multiplayer, can my friends also get a cellar?",
            "I am trying to help the raccoons and they need dried morels. I have a Dehydrator. Over the course of Spring, I collected 9 Morels - 4 normal quality, 3 silver quality and 2 gold quality.\n\nBut I can't make dried morels because it seems to need 5 of the same quality?\n\nIs there a way to use 5 of these morels no matter what the quality is? Am I doing something wrong?",
            "What is the best trinket for exploring mines?",
            "what would be kind of a good early-mid game progression? I#ve last played very early, around 1.0 so A LOT has changed\n\nI'm in the middle of summer 1 building up my farm (crops) bit by bit (so far around 100, half blueberry, half random stuff/melons). \n\nMeanwhile I've started upgrading my tools( copper so far) and am planning on getting a large(36 slot) backpack/steel watering can/pickaxe asap.\n\nI've also just unlocked floor 120 on the mine. \n\nI'm nowwhere near at the point of having enough money to unlock the desert, so right now I'd focus on more crops to unlock quality sprinklers, then extend my crops and start going into animals for cheese (at least when I last played the game 8 years ago(?) cheese was one of the best, and esp. easiest to access, food for sustainment). \n\nAt that point going into desert/other new content?",
            "Is anyone else having lagging issues since the update on PC?",
            "Can you do Sam's concert heart event any day or do you have to do it the day he comes to your house? He came by my house on the day of the Luau....",
            "Has Stardew Predictor been working correctly for anyone else after the 1.6 update? It's been wildly inaccurate for me since the update. I've managed without it, but it would've been nice to be able to use it",
            "Are there any missable achievements and events?",
            "I saw this line in the [Pans](https://stardewvalleywiki.com/Pans#Items_Obtained) wiki article.\n\n>Shimmering lights will appear at least every half hour at the Dig Site river.\n\nIs this still true? Doesn't seem like it when I was trying to farm Lucky Ring.",
            "Does anyone know if \"spawn\" rates (for lack of a better word) for prismatic shards have changed? I started a new save on release of 1.6 and am now in summer year 2. I've got lvl 9 combat, reached the bottom of the mines and got my gold scythe from the dangerous mines. Also reached lvl 28 from the skull caverns. Been in the mines and/or skull caverns at least 3 times a week and still no prismatic shard 😢",
            "hello! this may be a stupid question but does anyone know if the green rain event water your crops?",
            "I've recently gotten 2 Prismatic Shards- one from reaching the volcano in Ginger Island and one from a mystic stone. Should I donate them to the museum, finish the missing bundle (I have another option: 5 gold-star ancient fruits), or get the Galaxy sword? I'd really like to save one for the Jumino Hut haha.",
            "Hello. Do I have to start a new play through to enjoy the new update more and its features? Or I can start a play through now and just wait until it comes out on console in time,",
            "I can’t figure out what this is. I played so much but haven’t played in a few years and can’t remember what this is. I tried reverse search and just sticking stuff into it but it won’t take anything.\n\nhttps://preview.redd.it/hf1w803wvvtc1.jpeg?width=1140&format=pjpg&auto=webp&s=90503b0ea2b24855319c8fd2b72b777352995db7",
            "Any good QOL mods that don't ruin the difficulty too much?",
            "I remember seeing we can craft vinegar in 1.6... does anyone know how to do this? Something involving preserve kegs?",
            "Can't decide between using iridium bars for repairing boat or upgrading pickaxe first?",
            "I just harvested cauliflower only 1 day after being planted. What caused this? Luck or something else?",
            "Can legendary fish be caught in the last day of their respective seasons?",
            "Got a question about Emily's perception in the Stardew fandom - was it a common opinion that her default portrait's stare was oddly intense? I remember that was my first impression of her back in the day and I kind of want to run with it for some doodles I'm doing, heh.",
            "Question, I've been putting the same beginning green slime egg in my starting slime incubator in my slime hutch for half a month and it keeps spitting out the green slime egg and I don't get a slime. I've never used this before but this doesn't seem right. Am I doing something wrong? Is it a known bug with a solution?",
            "Please help!! I play on Steam with mods. I played offline for a few hours today. When I came back online, I synched my cloud to my local file. Now when I attempt to load my farm, my game crashes! Any idea how I can fix this?\nEdit for others: updating SMAPI fixed it :)",
            "Anyone know where I can find characters schedule for winter wiki doesn't seem to get it correctly I'm playing 1.6\n\nEdit: Nvm I didn't look at deviations",
            "I had a message saying a pufferfish frenzy has started. What does it mean? I can't find anything about it on the wiki or anywhere else.",
            "All my wines/juices and pickled/jellies come out with no stars regardless of what quality I put in, is this how things are supposed to work? I see different quality wines on the wiki and so am confused.",
            "[deleted]",
            "I’ve returned to my main save after awhile and I’m going for True Perfection. Right now my biggest obstacle is money; I’ve got 7.5m but still need the golden clock plus island obelisk. \n\nMy farmable land is a mess bc I stopped farming way back when I didn’t need money anymore… but I do have lots of iridium sprinklers, and I do have a greenhouse of ancient fruit (with some casks going for wine). I don’t have any ancient seeds lying around currently. I also have 2 big barns (mostly pigs, mix of the rest) and one big coop. \n\nWhat’s the fastest way to get that last ~3.5m with where I’m at? Start churning ancient seeds from fruit and prep for a massive planting next Spring? Is it worth mass planting something in Fall? Animals? ",
            "27/28, who am I missing?\n\nI’m new to the game. Introductions quest requires me to meet all of the villagers but there’s this one guy at the bottom of the list who I can’t find. He’s bald, looks to be wearing some sort of sunglasses, and fair-skinned. Any help would be much appreciated.",
            "so at level five you can either choose to sell fish for more money or crab pots cost less materials.   \nwhat I was wondering is that if you choose to sell fish for more money, if you smoke the fish in the new fish smoker do you still keep that bonus from the lv 5 perk?",
            "The iridium fishing rod is supposed to be able to have tackle and bait, correct? My rod won't allow for both. I'm not using any mods that alter the fishing rods as far as I'm aware. I have the CJB Cheat to allow for Instant catch because I get frustrated at fishing.",
            "Does Fertilizer on Ginger island last permanently?\n\nI want to replace my speed growth with premium fertilizer but they are still there and I really don't want to remove like 500 tiles and reapply everything... Is there any efficient way to do it?",
            "If I divorce someone can I marry them again later on?",
            "New to the game first time playing it and at day 7, I am really struggling figuring out how to advance my farm because I am terrified of winter!\n\nI played Harvest Moon Another Wonderful Life as a child and barely made it through winter and the knowledge it's coming on Stardew Valley is giving me anxiety and makes me feel like adventuring in the mines or looking for gifts to give the characters I like is wasting time when I should be trying to make my farm better for winter..\n\nI know it's a stupid thing to stress about but I need some general tips without going into spoilers ey.",
            "i have found this [secret area](https://i.imgur.com/NEiOAFy.png), but i don't know what it does. can i get any help?",
            "I have a question related to Perfection runs after 1.6. Previously, >!you couldn't achieve perfection until the end of year 2 due to needing all the Queen of Sauce recipes. But now there's the Queen of Sauce cookbook which I think can cheat around that if you rush through the island. So how fast can you achieve perfection now?!<",
            "Is there any way to switch farm types without messing up my save? I have a co-op with my boyfriend that I have 50 hours on but don't really like the meadows farm and would really like to have the original farm for more tillable soil",
            "I have a question (1.6 Spoiler ahead)\n\n>!Raccoon quest - it told me to make dried apricots and cactus Fruit Jelly for the second quest. I gave it dried cactus (i mixed it up), but it still counted (and changed color to match the request). Is it only important to give it any \"dried X\"?!<",
            "How do you start modding? I wanted to start small and create extra fruit trees (I know there's mods for that already, I just want to make my own).\n\nI wanted to make sprites for the fruit tree, but I'm unsure how to",
            "I have already unlocked Ginger Island. Is Starfruit the most efficient source of money still?",
            "Is it possible to plant fruit trees in Cindersap Forest, or in the spa area? I'm a bit too poor in-game to buy another sapling rn, but I'd love to make the spa area into a little orchard.",
            "(1.6 spoiler) >!Do trinkets expire or get used up (like fishing tackle)!<?",
            "(PC) Can I rotate furniture?",
            "Can someone double check my math. Excluding special crops like ancient fruit, the most crops (not flowers) per season is fall with 12 unique crops",
            "does anyone have any tips for playing on switch? anything that could make life easier because of the lack of mods ;__;",
            "Is it even possible to do romance without guides in this game? Cuz it seems kinda messy ngl, you can gift rarely and it'll take ages to naturally guess their fav. item. Many people mentioned to me they couldn't find anyone for the dance event.",
            "bit of a silly question but I just want to make sure, if there is no grass outside for an animal to eat, will it eat the hay inside? I know they eat the hay if the door is closed + can’t access outside, but I just want to make sure it’d be the same in this case too^",
            "Nintendo Switch user here. I am currently trying to get the Far Away Stone, but I can't seem to be able to throw the >!ancient doll!< in the >!lava on mine level 100!<. There also don't seem to be a lot of threads answering this, so how does the throwing mechanics work on Nintendo switch?",
            "whats the easiest to get money on winter? im in year one, below 10k, married with emily, no mods, well yeah, can someone tell?",
            "I know the game can last to more than 99 years, but what about the story line? how long ist programmed in the game based on years?",
            "Hello, SDV brain trust! I have the Farm Computer, and one of the readings is \"Machines Ready\". What machines does that mean? It's a crazy high number on my farm's report, like 283.",
            "I’m super new,  just five hours (IRL) in, but have literally only caught one fish, and had 2 hits that I messed up. I read a book that somehow gave me 1 level in fishing that fell out of a tree. I check the TV for luck and go out on rainy days, any help w fishing? I tend to go to the beach",
            "Long time player but first time doing co-op, and I have a question. If two player characters get married, can they also gift bouquets/continue romancing NPCs?",
            "Where are you guys finding prismatic slimes? I have 4 different save files with like 9ish years collectively and I have yet to witness 1 prismatic slime. I’m playing on switch btw!\n\nEdit: clarification, I know they spawn in the mines but I have just never seen them.",
            "I just got 1 hardwood since the beginning of my game and I'm almost at the end of year 1, where the hell do I don't them ?? I saw on the wiki it's on a particular tree but I can't find it ? Thanks in advance !",
            "Question about the trinkets (spoiler)>! I just found a fairy box, if I use it, ist permanent? can I unequip the fairy later on? will it disappear?!<",
            "I am about just about to finish Fall of year 1. I have a barn and a coop ( and a shed for some reason) a pretty good garden and am about to finish the mines. I am sitting on about 60k gold with no idea what to spend it on next. Is it better to go for the bigger coop or barn? Or should I wait for something that I haven't seen yet.",
            "I'm actually losing my mind, I've restarted this day twice trying to gift books (Jewels of the Sea and Woody's Secret; I've already read both before) to Willy and Robin and it just consumes them. I've tried right-clicking, left-clicking, C and X, using a weapon's ability before C and X...\n\n  \nEdit: fixed; it was a positioning issue. I just had to walk against them until my character was inside the same tile as them while they were at their respective store counters, then spammed left-click a bunch until they accepted it.",
            "On Multiplayer, I have achieved every perfection goal except Monster Slayer Hero, and another player on the server has achieved Monster Slayer Hero. Based on what the Wiki says, this should count as 100% perfection, but the Qi computer is only registering 90% complete and says I'm missing Monster Slayer Hero. \n\nDoes one person really need to achieve all the goals, or does the other player needs to be logged on for perfection to register?",
            "i have a habit of hoarding resources in every game i play. i’m on year 1 winter 18 right now and i have way too much ore. is it okay if i just process all of the ore into bars? will i end up needing raw ore later for anything?",
            "How do I update my version of Stardew Valley from 1.5 to 1.6 without losing all my progress? I'm using the Mac version. 100% vanilla, no mods. I did not download via Steam.",
            "Do mods exist that incorporate bad decisions or consequences? For example: You failed to deliver the order on time. The Band of the Hawk will burn your crops.",
            "So I just got stardew valley. Is there anything I should keep in mind or just general tips? Also I’ve seen videos where people progress quickly should I be doing that or should I take my time even though I could miss some things?",
            "I've heard that you can buy Pam's old trailer after you upgrade her house, but I can't seem to find where to buy it. It's not listed in Marnie's buildings.",
            "can you still see heart events after you've passed that heart number? for example: i'm at 7 hearts with Leah but never saw her 2 or 4 heart events. can i still get them?",
            "Very subjective question I know, but should I wait for 1.6 on switch before I start a new file? I never played the 1.5 update, and I’ve been getting the itch to play again lately, and the wait for 1.6 is killing me. Does 1.6 add a significant amount of stuff that it’s worth waiting for? Or with no update in sight, and all the 1.5 stuff to experience, is it worth starting my new farm now and not worrying about 1.6?",
            "How to get brown chickens? All the chickens I buy are always white",
            "[deleted]",
            "Do quarry rocks provide experience as if I was breaking rocks on the farm, or in the mines? Both the CC reward quarry and the hilltop/four-corners quarry.",
            "How am I supposed to get Lewis's purple underwear and why is nobody actually returning it to him?",
            "I have unlocked repairing Willlys boat.  I have the 5 iridium bars to fix the anchor, but I don’t know how to use them.  I just keep getting the message that the anchor requires 5.  I’m holding them in my hand and hitting A and it won’t take them!  Help!",
            "I am new to the game and play on iPad - I cannot catch a fish for the life of me!! Any tips on how to reel in a fish? I always tap too much or too little and lose em every time.",
            "i was messing around with the stardew profits calculator and it says wheat is the second best crop in summer since 1.6?? Better than Starfruit even? Is this correct? Maybe I did something wrong, or did it get buffed in the update?",
            "If I download Stardew Extended will I still be able to play with my friend who only has vanilla on our farm?",
            "I almost immediately got the bugs head weapon and it trivialized the mines so far on level 80ish or something.. I don’t even think I killed 100 bugs to get it but even then that’s not a lot",
            "Is it possible to obtain Large Milk without buying any cows?",
            "Returning to the game after 4 years, I heard some people say that it's better to start a new save rather than return to my existing 40 hrs one. Why is that?",
            "Hi! \n\nI just unlocked Willy's Boat and I was wondering if there's a recommended time (or times) to go visit Ginger Island? I'm a bit stingy so I want to calculate my ticket costs to the island (and the desert). Also, aside from fishing gear, what should I be bringing when I first go there?\n\nMany thanks in advance! :)\n\n- Fall, Year 3 Farmer",
            "My girlfriend has been wanting to do a coop farm on our xbox, but I wanted to wait until 1.6 launched for consoles before starting a new farm. Should I just say screw it and start one now, or hold out for the update? Thanks!!",
            "How do relationship hearts work? Is there a chance of the hearts going down if I don’t maintain them? And is this the same for the animals and my dog?",
            "What's the area with the stoney floor in the top right of the farm?",
            "Should i start modding the game or wait until we stop getting hotfixes?",
            "Picked up 1.6 by loading my old perfection save, slowly having fun discovering the new content.\n\nMy infinity blade seems to be missing its damage bonus from rubies though. It's only showing 80-100 and I'm unable to add new rubies to it.\n\nMaking one from scratch lets me pump it up to 104-130 as per normal, but requires me to sink more resources in to redo the blade including the 3x galaxy souls, all the cinder shards, and as many prismatic shards as needed to get my preferred enchantment (crusader)\n\nNot a huge deal, but is there a way to fix the preexisting sword?\n\nEdit: Yeah, it's totally borked. I found the \"unforge\" button, and it makes my infinity blade 56-70 damage. Gotta remake it from scratch I guess. Annoying, but an excuse to go farm some cinder shards.",
            "Looking for personal opinions from Stardew valley vets: 1.6 just came out, my sister told me about it and convinced me to start playing again. I like playing on mobile though. 1.5 update took 2 years to come to mobile. Do you all think 1.6 will take that long too, or sooner? I would love to play the new meadow farm layout.",
            "Is there a way I can find my anniversary without waiting and checking the calendar everyday/season? i dont even know what season its in",
            "Didn’t close my laptop properly and skipped two seasons by sleeping apparently. I’m devastated",
            "silly question - why is the space to the right of the house limited as to the items can be placed? i'm talking about the little cubby with cobblestone behind the donation box. it seems like such a nice place to put things",
            "I know that there are mods to make fishing easier- is there a mod for making journey of the prairie king easier? I'm trying to beat it and am getting very frustrated. Any recs?",
            "I recently purchased this game, maybe the day before the 1.6 announcemen, and with all the posts about achieving perfection before the patch, I'm wondering if I will need to start a new game when the patch comes out or if I'll be fine continuing the game I already started?",
            "I bought this when it was on sale when 1.6 was annunced\n\nShould I install now or do clean install of 1.6?",
            "I've heard that there's a pirate cove on Ginger Island but haven't figured out how to find it yet. Could someone provide me with a non-spoilery hint?",
            "I made like 3 egg machines/mayo machines or whatever they’re called and the game glitched and deleted them all the next day 😭😭😭",
            "If you plant wild seeds, do you have to water them?",
            "If I play on my Mac with mods, can I continue playing the same save file on my Steam Deck without installing the mods? The two mods I will be using are: [NPC Map Locations](https://www.nexusmods.com/stardewvalley/mods/239) & [Lookup Anything](https://www.nexusmods.com/stardewvalley/mods/541)",
            "The quality sprinkler in my greenhouse won't water the pots around it, whether they have plants in them or not. What's the catch? I've tried removing the sprinkler and putting it back on its place to no avail. It's surrounded by eight planting pots.",
            "I have a problem regarding the professions. Basically, by mistake, I chose the rancher skill and got coopmaster and shepherd by level 10. I spent gold on the statue of uncertainty and slept. After that I chose tiller for lvl 5, but what came next was still coopmaster and shepherd. How do i get the other set for artisans?",
            "In order to build my first coop, do I just walk into the barn building with the materials and money and the option will automatically appear? Do I have to do anything before that? I already got the quest to build one. TIA!",
            "Do we know when the update will drop tomorrow? If it drops at midnight I'm calling i in sick. ",
            "Wait does the switch not get this update today ?",
            "just dropped six minutes ago for my steam folks 🎉🎉🎉",
            "[deleted]",
            "what's so good about the meadowlands farm for livestock? i'm not sure i understand how longer lasting grass is a good trade for way less farmable land and a lot of pond chokepoints.",
            "new player here, mods or no mods",
            "I was wondering if I could play the game without updating it. I want to finish my current save then experience a whole new game with all the updates. How do I freeze the version?",
            "will compatibility version on steam be getting 1.6?",
            "This is my fifth farm and I've been playing since 2016. I have not been able to go through Joja route, and I'm planning to for my meadow farm. I can't bring myself to do it,.how do you guys do it?",
            "If I know nothing about modding, and heard modding was easier(?) With this update, is there a guide for dummies to creating simple new dialogues or events?",
            "Ages ago -- I think pre-pandemic? -- a bug cropped up on Switch that crashed your game if you cooked with ingredients from the fridge. Does anyone know if that's been fixed?",
            "I'm new to the game, and i just found an iridium quality herring should i keep it for something or just sell it?",
            "Looking to play the new update vanilla on a brand new farm. Is there any way I can disable/deactivate/toggle mods to achieve this?",
            "I remember I changed my pet appearance at the Wizard’s Shrine of Illusions, but for some reason, that isn’t the case anymore. Can someone please confirm?",
            "Hey all! I have heard that it is possible to get a >!pet bird!< in SDV. Is this true and, if so, how can I go about doing it?? I have one in real life, and would love to get one here, even if it is instead of a dog/cat. (I'm on Switch btw so no mods.) I've looked on the wiki, but no luck! Please help!",
            "Can I move my Android farm to my PC even though they're on different versions or do I have to wait for 1.6 on mobile?",
            "https://preview.redd.it/5xv6p1ilzipc1.png?width=2384&format=png&auto=webp&s=2915c81aee2cf77a18006ab24799a621af518869\n\nCan someone tell me what that skull offering thing is? I’ve tried looking it up but nothing comes up",
            "I was wondering does the blue grass that is already spawned on the new farm spread? Does putting a fence post on top of a tile of it make it so animals cant eat it and it will already spread?",
            "Got a slimey/ green tree all of a sudden anyone knows what that is?\n\nhttps://preview.redd.it/n1j8dewh9jpc1.png?width=1920&format=png&auto=webp&s=8473f4f1a9842e272d442eda9ef5bc1f35a3d4ec",
            "[deleted]",
            "Question for steam deck users. When we start stardew up it never recognizes a controller until we restart the system. Doesn’t matter if the system was fully shutdown before start up the game. A restart is needed. Anyone found a way to fix this?",
            "Is anyone already having problems with the “Feeding the Animals” quest? I made a silo and they still ask me to make it, I don't know what to do lol",
            "How do I activate the mine carts?",
            "I know the answer is most likely \"You are just incredibly unlucky\" but I am on Spring 18th on a new farm and I haven't had a single day better than neutral luck. Anyone else??? \n\nIs this CA punishing me for using the Automate mod? Or like a weird bug. It's literally never even been decent luck.",
            "I have two friends getting into stardew just now; i play with mods, they wanna play fresh, understandably. If one of THEM hosts, will I be able to join a multiplayer world with them without uninstalling my mods? I have mostly aesthetic things but a few bigger ones (like SVE). I dont mind if i cant access SVE and stuff when playing with them, but will it still allow me to play?",
            "I really want to try mods. I was primarily interested in PPJA - Artisan Valley, Chocolatier, and PPJA - Khadija's Recipe Shop. Because I really like the idea of expanding Artisan goods as a whole and playing around with those.  \n\n\nI've installed the mods and their prerequisites, but they don't seem to work. SMAPI is showing that I have 24 mods loaded when I should only really have 20.\n\nI'm extracting them into the Mods folder created by SMAPI. They must be working on some level because I can see Khadija's shop and can interact with some parts of it, but not open the shop itself, etc. I did read and follow the guide to the best of my ability. I manually downloaded all of the mods & their prerequisites and extracted them.\n\nShould I just try downloading them all again? Maybe the update made some of them unusable?",
            "I have only played until winter year 1 and am fairly new to the game.\nIs it still worth starting a new save for the 1.6 update? I don't want to lose my progress",
            "I just found a book that says it gives +1 defence but I can’t figure out how to read it?",
            "Can you upgrade coops?",
            "I've been playing some mulitplayer today on the new update on PC through steam. Been having times where the game pauses for me (not the host), drops stop picking up, and transitions between areas can take anywhere between 10-60 seconds. After that, everything rubberbands back to where it should be, but it's costing me actual in game hours every day just loading.\n\nHas anyone else been having this issue? I'm playing with the same person I used to pre-update and we never had anything like this.",
            "Anyone here playing on steam deck?\nI dunno why but the grass footsteps sound on my Steam Deck really hurts my ears. It‘s really „sizzling“ in a unpleasant way. Even worse now with the new farm type where there are a lot of grass tiles.\n\nIs there any way to muffle or replace the sound? Anyone here with the same problem on the Deck?",
            "Can you cut down the bush by coop on the new farm?",
            "Heya, I've just bought SDV for a friend and we're planning to play co-op soon for me to check out 1.6 and for them to experience the game. I've played the game enough in 1.5 to nearly see the 100% (screw the clock), and they are completely new to the game. Does anyone have any tips for playing co-op to make the experience more enjoyable? Any helpful advice would be appreciated, thanks!",
            "hello, i just wanted someone to verify that my museum collection was completed? i thought i completed it but i didnt get the achievement for it nor the stardrop. am i missing something?\n\n[https://sta.sh/0i07joqwq3e](https://sta.sh/0i07joqwq3e)",
            "Is something wrong with online co-op? Been trying to play online with a friend on PS5 and when you click Co-op from the main menu it just takes us back to the main menu? Never experienced this before.",
            "Can pigs dig up truffles if I planted grass in their pen?",
            "How do you open the dresser on switch? Been trying every button and cannot find it!",
            "Uninstalled SMAPI to play the new update vanilla. I want to go back to using mods, so I reinstalled SMAPI, and made sure I had the correct launch options, but still nothing. Any ideas what I can do?",
            "What's the deal with placing chests in cabins? I got a cabin to possibly make into a workshop (I shoulda just shelled out for the shed, I know) and I tried twice to place a chest in it. When I do, I get an overlay of a flower pot on top of the chest and it sorta vibrates. Can't open it, can't destroy it, move it or anything.",
            "Hi there! I am working on a Perfection in 1 Year (Starting Year 2) challenge for myself, in version 1.5 for PC, but I'd also like to try the new 1.6 update!\n\n**Am I able to easily switch between versions 1.5 and 1.6 somehow?**\n\nI do not have any mods. Should I still back up & refresh the save files each time, somewhere?",
            "I accidentally trapped my chicken, help",
            "Just got this from fishing chest. What are the star icons and their effects?\n\nhttps://preview.redd.it/ucdgzealvvpc1.png?width=453&format=png&auto=webp&s=9e110995a464a0c5b1c8697e07bdce900a840deb",
            "Am I missing something about the 1.6 update?\n\nI know we were supposed to be able to >!eat/drink/slurp mayonnaise and eat pickles!< in 1.6, but it doesn't seem to work for me?\n\nI'm pretty sure I updated since my >!potato pickles now look super appetizing...!< and I had the glitch >!where my tea bushes where invisible!< (until I updated again this morning). Is it because these items where from 1.5, do I need to make more and they would have their new effect?",
            "first playthrough?  that's so fun!  I have small children so my gaming experience is maximizing everything which is not really how sdv is meant to be played.\n\nMaybe when 1.6 comes out on the switch I'll get that and the wife and I can play co-op on the couch.",
            "Your save file will be totally fine! People are just finishing up stuff because they want to start a new save with the 1.6 update :)",
            "You should be fine.  \n\nhttps://old.reddit.com/r/StardewValley/comments/1b0pqwn/16_release_date_o/",
            "There's an awful lot to the game. The journal quests are well designed as a slowly unfolding exposure to everything there. I wouldn't worry beyond following those and chipping away at the CC. It might take 3+ years (heck some folks have never finished it) but so what?\n\nOne consolation I can offer: you don't have to worry about reaching level 140 of the mines ; )",
            "There's not really any \"doing it wrong\" in the game. Apart from the choice between restoring the Community Center or not, almost everything else can be changed at a later point, though some things are quite costly to change. For most things, like crops, community center items and fish, the worst case is that you need to wait until next year before you get another shot. The most intricate parts of the community center bundles involve getting quality (gold star) crops and all the fish, where some fish require certain weather, time and/or season to be caught.\n\nAll the seeds are profitable, so plant what you want, just try to keep a steady cashflow going as lacking money is the one thing that might block you from progressing. Take some notes of things you need to remember, like quests or birthdays you want to gift someone an item for. As you keep doing one activity, you will skill up in it and become more efficient in it, spending less energy and getting higher quality items and more profits.\n\nIf you truly want to min-max everything in the game and quickly get to maximum profits and do everything, it will be overwhelming for sure. If it helps, you can make up some rules on what to do on each day based on your luck and the weather. If it rains, you don't need to water, so you have a lot of time to clear debris on your farm, organize chests, cook, craft and hand out gifts. On lucky days, it's very useful to go to the mines as you will find ladders quicker. If you are able to progress a full 5 floors in the mines, the elevator will let you start from there. And attempting to clear 5-10 levels every lucky day is a nice goal. If you have trouble there, you can craft staircases that turn into ladders when plopped down on the ground. Costs 99 stone and can be crafted after reaching mining level 2.",
            "You play that game the way you like. Some ppl love the mines, some love decorations, some become millionaires and hardly talk to villagers and that’s all perfectly fine. That’s the beauty for me. Wasn’t there a guy who was in year 16 and still has stuff he hasn’t touched?!\nMy son and me are in year 5 and we still saved up some stuff for later. ",
            "New level on foraging, mining, fishing, etc.",
            "yes! pets with maxed out friendship can give you gifts randomly!! it's so cute, I was very happy when my cat brought me a fish",
            "It might be the Crimsonfish, though it can only be caught on beach eastern side (docks on tide pools).",
            "Are you on the right side beach? Might be crimsonfish.\n\n\nIf it's afternoon+raining it might be eel, but they're way easier than octo so I doubt it",
            "Thanks for the heads up! This has been corrected now.",
            "Please know that when you see screenshots of elaborate farms, they are generally from people who have played this game for many hours, on many different playthroughs, and are very aware of what they're doing. Don't compare yourself to that if you're new, it's unfair to you!\n\nThe beginning of the game is very basic and slow. You clear your farm a bit, plant some seeds, level your skills. Explore, talk to villagers (even the mean ones), do quests from the bulletin board, go into the mines, do the community centre when that opens up, etc.\n\nThere is no right or wrong way to play, but it CAN seem overwhelming at first, especially if you don't know the game well enough to have any kind of set plan in mind. You'll get there.",
            "The early game can be pretty slow. Leveling your skills gives you access to new equipment that starts to make everything faster and more convenient. \n\n>It also seems that by the time I walk to town, my character needs to sleep, so then it's time to walk home.\n\nThis might be due to having planted a bit too much for your current set of tools ie. it takes you all day to water everything because you have a basic watering can and no sprinklers. Which is fine - you'll make a lot of money and level farming up quickly that way. But maybe try planting just a bit less next season so you can spend some time in the afternoons going fishing, mining, or foraging.\n\nAlso check out the community centre, it gives you a steady progression of goals + rewards.",
            "I'm new too. It seems like the best way to play at the beginning is not to overload on your farm and try to befriend people.",
            "They do give diminishing returns. It still might be worth it.\n\n[https://www.reddit.com/r/StardewValley/comments/jlbfce/answering\\_the\\_question\\_of\\_how\\_many\\_lightning\\_rods/](https://www.reddit.com/r/StardewValley/comments/jlbfce/answering_the_question_of_how_many_lightning_rods/)",
            "I use them a lot, to act s fences that also anchor as many grass starters as I have animals - to be sure there's enough food for them.  \n\nBy that point the outlay is fairly trivial.",
            "think so actually. The old background is still on the wiki",
            "Well for your grandfather's side of things it's rather simple actually. Have high relationship with many different villagers, at least 8, max out pet, make at least 1m gold, level up your skills to at least 30 in total, complete the community center, get to bottom of the mines, have access to the sewer, then completely ship every crop or artisan good, catch every fish, complete the museum, upgrade the house at least twice and be married. Now not all of this needs to be done. If you have made 1m gold then you are more than half way to the requirement to max out your grandfather. Even if you don't max him you can always just go to his shrine again and he will judge again till he is happy. Best part of the game is you can go at your pace. No rush to do anything, can always try again next year.\n\nBut If your trying to get the most stuff done, I would at least focus on planting 15 of every crop and shipping them and making all the artisan goods you can and ship those also. plus try and catch all the legendary fish, because the fifth one can only be caught in spring but have to get all the others from each season first, and the sewer naturally. Maxing out all your skills will help, fishing gets easier with more skill points and better fishing poles.",
            "Really depends on how you're playing. Optimized playthrough you can have max hearts with everyone (14 on spouse, 8 on other romance options, 10 on everyone else), shipped one of everything, polyculture+monoculture achievements (shipping 15 of every farm crop, shipping 100 of one farm crop), completed CC, reached 100+ in Skull Cavern, crafted one of everything, fished one of everything, fully upgraded house, have a kid or two (optional), completed museum (unless you have one or two artifacts that keep eluding you), and reached Perfection (or nearly there). Plus a bunch of other spoiler-ly stuff that's part of the path of reaching all those goals.\n\nBasically it's possible to nearly 100% the game by end of year two. But odds are if this is your first playthrough, you're likely not close to that, so just set your own goals based on the above stuff.\n\nOne tip though: if you want to go for Perfection, that requires a ton of money. There are a number of ways to go about this, but one common method is to set up an Ancient Fruit farm in the Greenhouse, since it produces high-value fruit year-round in there. Getting that up and running takes a lot of time since you need to start with a single Ancient Fruit plant and turn its recurring production into more seeds through the Seed Maker until you eventually fill the Greenhouse completely with Ancient Fruit plants. So it's best to get started early on that if you want to go that route.",
            "Yes! Just as you would normally get chickens from Marnie, but sometimes they’ll be blue instead of white or brown. (Cancel purchase if it’s a color you don’t want and try again until you do want the color)",
            "you can probably process the regular ones and keep the gold ones for gifts--or sell them directly \n\nif you process it doesn't take into account the quality of the item you put in, so it's best to put lower quality items there\n\nhowever selling higher quality crops directly will yield more gold, and giving higher quality items to villagers gives you a multiplier for friendship points",
            "I feel you! I’m finally just now trying to marry Emily for the first time after years of playing but Abigail is the G.O.A.T. imo, lol.",
            "I figured it out, it's F4 if anyone has the same problem!",
            "https://www.reddit.com/r/StardewValley/s/lZQgMkDFvO\n\nI found this recently and saved it. Hope you find it helpful!",
            "Gotta be luck. I got like 10-12 days of rain in my first spring and summer.",
            "It's down to the lower right in a cubby across from the smaller lake.",
            "The host doesn't have to wait for other people to be online to play, but the other players would. This might be possible with a mod though? I feel like there might be something. Good luck :)",
            "i did the same thing 🤝",
            "You can catch them on non-rainy days in summer from noon to 4 pm in the ocean. Best of luck!",
            "It depends on what you want to do! Personally, I would focus on community center because something big happens after you finish it. That plus akull cavern runs on good luck days, and working on the farm should keep you busy.",
            "My advice would be pigs. Get your barn fully upgraded and get as many pigs as you can. I will say they are an expensive initial investment and make no money during winter so maybe start with just one or two. But they are the big money makers in the game. My current year two farm is making about 26k a day almost exclusively from pigs.",
            "You cannot.  \n\n\nOne of the patch note CA posted for 1.6 will allow you to move fruit trees. Tea Saplings aren't fruit trees, but they act kind of similar, so maybe they'll be included in this update.",
            "You can rename the 'mods' folder if you don't want SMAPI to access them.   Just putting a dot \".\" in front of the word is apparently enough.  \n\nOr you can redirect Steam to play through Stardew rather than through SMAPI - the place where you had to copy and paste a link to get SMAPI to work, I can't remember where it is.",
            "I would uninstall SMAPI. Your mods will stay in place, but the game won't be able to access them so they are essentially off. When you want mods again, reinstall SMAPI. Don't forget to change the steam launch options!",
            "Mine is just called Assistant and the icon is purple with a sunflower. It cost a little bit but it was so worth it. Think I searched Stardew Valley Assistant on Google Play for it.",
            "There are no plans for stardew multiplayer to come to the mobile version. Even if it did, it wouldn’t necessarily have cross platform ability with pc. Split screen should still work on pc, all she needs is a controller. I do not know about the current status of stardew on Linux, which could be installed on a Chromebook (by Steam for Linux, not Android app version) and could be played with others running it on windows or Mac. I mention this because the game doesn’t require particularly heavy hardware, there are relatively inexpensive Chromebooks out there.",
            "Definitely keep at least 1 of every item for the community centre if you aren't sure what is required, also every season plant at least 1 of every crop.\n\nFishing is a great money-maker at the start.",
            "You should play in whatever way gives you joy! :3 I feel the game also guides you a bit so you progress slowly in the \"plot\" if you can call it that.",
            "My advice would just be to go play the game. Look up stuff if you get stuck or want to make it easier on yourself, but don't worry about following a guide to minmax every interaction, especially if you're already feeling overwhelmed by the content.\n\nIt will probably take a while for new beginner guides to get made because the update was just released. I don't think any content like cutscenes was removed so old ones will still be relevant, just maybe missing some new things.",
            "If you don't think you'll want to restart after updating, go ahead.\n\nIf you think you'll want to restart, it depends on how long it will be until the update.",
            "New update makes those trees unchoppable.",
            "there is another area you can find with the regrowing stumps, they also have a chance to drop mahogany seeds, which will grow a tree that gives a bunch of hardwood when chopped",
            "You're saying fruit is spawning on top of flooring? That would be new, yes.",
            "Fruit trees need 2 tiles in each direction but thats for removable objects.",
            "No, it's seeded at the veey beginning of the game.",
            "The fern trees die after the rain, so the buff would only apply to actual *moss* trees that spawn/transform from other trees during the green rain, or the ones you grow from the moss seeds.",
            "Yes, you should sell your high quality crops unless you have a truly ridiculous amount of processing equipment. Bundles (with one or two exceptions ie quality crops) and quests also ignore quality. Gifting, however, is more effective with high quality items.\n\nIn any case, it's not a huge deal. When it comes to crops, you can always grow more, and it's difficult to set up enough artisan equipment to deal with even a modest crop output. And you're making money either way. What you really want to hang on to is crafting materials - I promise you'll eventually come to regret ever having sold off large quantities of wood, stone, fibre, etc.",
            "Yes, it seems to be missing in my game too.  \n\n*eta* = just checked the predictor again, and it's due in an Artefact Trove item number 1,004.  \n\nI searched using the word '*guide*'. It hadn't shown up with 'treasure appraisal' or 'book'.",
            "Just bring along some good food and you'll be absolutely fine, I promise. You're really missing out on some amazing unlocks if you've reached level 10 in farming/foraging/fishing but not mining and combat. Gotta get after it.",
            "if you’re mining lvl 2 then you’ve unlocked the staircase recipe, you can try crafting a few and go slowly through the mines. it saves your progress every five floors via the elevator. if i were you id place a staircase as soon as i reach a level and then mine/fight until you get overwhelmed, that way you have an easy way out if you want to leave. ",
            "Good news, you made a mistake in your mistake that makes your near mistake not be a mistake. (At least if I didn't make a mistake myself)\n\nHow did you arrive at 90g to compensate? The sell price of a smoked fish with Artison & Angler is base\\*2\\*1,4\\*1,5 solving the inequilaty 250<=base\\*2\\*1,4\\*1,5 gives base>=59,524. \n\nUtilizing the 1.6 >!Deluxe Worm Bin!< the only fish with a lesser price are Mussel, Oyster and Shrimp. Taking catching probabilites (from Non-Mariner) into account the gain from the profitable fish outweights the loss from the non-profitable fish The daily profit averages to ocean: 13,8 g and freshwater:29,192. You can also recycle the trash you get as a sideproduct, which gives 8,36 coal per 100 catches (or 10,64 when you process the recycled Wood in a charcoal Kiln) and raises the daily profit of a single crabpot to Ocean: 33,8 (38,8) and Freshwater: 49,192 (54,192)\n\nProbably still worth it to sort the fish yourself and turn anything <75 g into Sashimi instead of smoking it with bought coal.",
            "Unless you have some sort of crop growing there, the dirt/fertilizer will eventually de-spawn. If you have a dead crop there, it will continue to be watered/tilled, but any fertilizer will disappear.",
            "I don't think this is a spoiler: the community center is a good early set of goals.",
            "There is no \"proper.\" You can spend your entire playthrough just chilling on your farm growing whatever. Socialize or not.\n\nThe quests that you get in your journal are designed to slowly show you what the game has to offer. I would take them one at a time and over time you'll discover where you want to take things.",
            "The early game is to get your farm going for money and some basic gear.  Once the invasion starts, it speeds up, for sure.  Just make sure they don't reach your shipping crate and you'll be fine.  Also, if you haven't found the wall blueprint by the end of spring, you may need to get a friend to help you with the early waves.\n\n\n\n\n\nJust messing with you.  The game is a chill experience of farming and meeting villagers.  There is a bit of exploration and combat as you explore the mines, but the main focus is the slow farm life (unless you are one of those folks who tries to do everything in one year, but they are masochists).  Take it easy if you want.  As far as getting started, go see Pierre and get some different seeds, then check out the community center (big building at the top of the town map) to get some goals to work toward.  \n\nIt really is a very open game where you set your own goals.  Want to own a hug orchard?  How about barns full of different animals?  Spend all day fishing by the ocean and selling what you don't eat (I knew a very happy old man IRL who did that his entire life)?  Get married to the cool girl with the purple hair? Challenge yourself to get to the depths of the skull cave?  Everything is up to you.",
            "https://stardewcommunitywiki.com/Golden_Walnut\n\nNeed more info to give you specific information, but the link above will tell you all the locations with screenshots and also how to interpret the hints from the birds.  \n\nIf you think you found them all and aren't getting the reward, you can write \"/recountnuts\" into the chat to see if that fixes it.",
            "Big update coming to pc in a few days, presumably to consoles in a few weeks. ConcernedApe works with the modding community to try to be sure that nothing breaks with updates.",
            "Yes. There is an option to use an invite code rather than invite via friends list.",
            "Not yet. Historically, consoles within weeks. mobile probably won’t be a year+ this time around.",
            "That area is what most people call the \"spouse patio\", those decorations were added by your spouse. I believe that these ones specifically are flower planters, hence why they're covered in snow since it's winter.",
            "right here my friend\n\nhttps://www.nexusmods.com/stardewvalley/mods/6935",
            "Yes.\n\n\nFish quality is determined mostly by the distance your bobber is away from land (docks count as land). Perfect catches will also increase the quality by 1 stage. ",
            "Look at /r/FarmsofStardewValley for planning inspiration. Remember that the farms there have been prettied up for sharing.   \n\nGrow jades in a crystalarium, it's safer than visiting Skull Cavern!  \n\nSpicy Eel *and* Triple Shot Espresso stack, top up with something like salad or cheese - cactus fruit is also fine.  \n\nI like the iridium rod and I think it's the trap thingy, the metal cube.",
            "honestly, I don't have a ton of advice for you, but I do recommend using cows to produce cheese for your foods! they provide a good amount of health and energy, even the worst quality, and when you have a few cows you can get a steady, quick supply of it going! \n\nafter you get your farmhouse basement, you can age it too, and when you have max relationship with cows you're going to get gold cheese from large milk, so it only takes a week to age the cheese to iridium, which gives you 325 energy/146 health!!! I think it's super underrated.",
            "Yes you can. Someone made about post about how they purposely went and caught the legend as a quick as possible in a new save so they could smoke it and sell it for an early profit.",
            "It's the same egg.  \n\nYou'll find another.  :)",
            "Put jade into a crystalarium, convert to stairs with the desert merchant on ... I think Sundays.  \n\nhttps://stardewvalleywiki.com/Desert_Trader  \n\nRock - any of the rocky floors, repeat levels with a 5 because you're straight onto the floor. Leave via the ladder to reset.",
            "charge through levels 5-20 of the mines.  All the rocks will take 1 hit if your pickaxe is upgrades and enemies won't really bother you.\n\nAlso bombs.",
            "It's temporary, for two months.  \n\nhttps://old.reddit.com/r/StardewValley/comments/1birbzi/stardew_valley_16_released_on_pc/",
            "Have you tried blowing them up?",
            "1. Buy hay from Marnie 2. Cut hay in other seasons if you built a silo 3. Or... simply don't and take the friendship damage + no product.",
            "I've got the original steam deck, and it works fine.  I have noticed an occasional stutter while running around at times, where the game with freeze for a split second.  Other than that, I did have the game lock up once, which was annoying since it was 830 pm in game, and I'd already spent the day doing tons of farm work, just to have to do it again.\n\nOne huge benefit of playing it on steamdeck over PC is the fact you can just put your steam deck to sleep mid-game day instead of having to play through the entire day in order to save.  That was previously the factor that caused me to drop SDV, since real life would intrude and being unable to just save and quit while playing on my PC led to shelving the game instead of drawing wife aggro.",
            "I have the OLED and it runs great. I'm not sure how mods would impact performance.",
            "More weeds = more drop chances, so it can only be helpful. Don't get discouraged if you don't see results at first though, I have an ungodly amount of hours in the game and have never gotten it in any of my savefiles... Good luck!",
            "if you have spare moss, I'd recommend making a few mushroom logs, if you place them exclusively near oak trees they have a decent chance of producing morels",
            "Like you mentioned, it needs the morels to be of the same quality.",
            "I like the parrot and the quiver.",
            "You're doing great so far! There is no \"x things complete by y time\" goal unless you set one. Definitely focus on animals if it's something you'd like to do. Pigs for truffles/oil and goats for cheese are great options. \n\nFor me, I like to have a copper axe/pickaxe by the end of spring, steel if I can swing it. I try to get a baic barn and coop by the third week or so and keep about 100 crops in rotation if I can. Also heavily focusing on the mines to reach 120.",
            "Bro, you know you're having a good game progression if u are having fun!",
            "Any day. None of those events are time-specific, even though the conversation indicates they are.",
            "Yeah like...supposedly it was updated to work with 1.6 but it's been *way* off for me.",
            "You can miss two heart cutscenes with Sam and Clint. Sam's happens in year one only, and Clint's won't trigger if you have already seen Emily's six-heart event.\n\nEdit: Clint's won't trigger if you have seen Emily's eight heart event, not six.",
            "I don't know 100% for sure, but it certainly seems like it has changed. It was definitely true in 1.5 I would get a dozen or two pans per day there (also for the lucky ring)\n\nIn 1.6 I got maybe 3 per day then I'd have to wait for another super high luck day just to get another 2/3 attempts.",
            "It actually has. Drop rate of prismatic shards from iridium nodes has been nerfed to a 3.5% chance, from a 4% in pre-1.6 (drop rate from enemies is unchanged). \n\nMy advice though, try to get deeper in Skull Caverns. Lv 28 is not that deep and you get more iridium nodes (ergo more possibilities for a shard) the deeper you go. Also, the droprate from enemies in the regular mines is almost nothing (0.005%) so never try to grind prismatic shards there, SC is your best shot. Good luck!",
            "It does",
            "Galaxy sword is generally the best use for the first shard. If you don't have a better weapon somehow, it will really speed your mines runs and make it easier to get more.\n\n\nMuseum donation really only matters if you have everything else. It's not high priority.\n\n\nLikewise, if you have ancientfruits going already, I wouldn't bother putting it in the bundle.",
            "if you have a playthrough that's late in the game you'll be able to blow through all the new stuff pretty quickly, a lot of it modifies the whole journey of the playthrough so I'd recommend starting a new one when it comes out. though nothing is stopping you from starting a new file now AND another new one when you get the update",
            "looks like a woodchipper that you can buy from robin",
            "There's a new mod called Recycling Crafts that allows you to upgrade items likes sprinkles etc. instead of having to discard them when you get better ones. It's fairly balanced and there are a lot of options...",
            "auto open fences and no crows.  One does not afect dificulty the other one a  little more since you get to save those resources and get the extra free spot",
            "Rice",
            "Pickaxe, if you ask me. Having the iridium pickaxe makes it easier to gather more iridium and it makes breaking rocks on ginger island essier.",
            "Luck, specifically you got a visit from the Crop Fairy, one of the random over-night events. \n\nThis event checks 100 random tiles, if one of them is a non-wild-seed unmature crop the Crop Fairy grows everything in a 5\\*5 area around the selected crop to full maturity.",
            "Yes, as long as that day meets any other prerequisites the fish has for appearing >!namely, that it's raining if you're trying to catch the Legend, or you have Magic Bait to bypass the weather requirement.!<",
            "Yes! People say her old portrait makes her look like she has \"crazy eyes\"",
            "good luck :/",
            "In additions to deviations, keep in mind that if you have the resort unlocked in Ginger Island they can also go there out of schedule.",
            "It's a 1.6.4 addition so only a couple days old, which is why it's not on the wiki yet. I suppose it means you can catch a lot of pufferfish that day! Someone on here said that bubbles specific to that fish will appear in the area mentioned.",
            "That is normal. Wines get stars through aging them in your cellar in casks.",
            "Fill the island with starfruit. Mass make tappers and then kegs so you can keg as many starfruit and ancientfruit as you can.",
            "George probably. He sits in a wheelchair, and spends 99% of his time in his house in front of the TV. His house is to the right of the Saloon.",
            "Yes, smoked fish benefit from the 25% bonus. They can be boosted even further by Angler (fishing level 10) and Artisan (farming level 10).",
            "Are you sure you're using the right things?\n\n\nWhen you check the rod, does it have two \"slots\"?\n\n\nWhen you check the bait and tackle, is one listed as bait and one as tackle? ",
            "Bomb it.",
            "Winter is like any other season - there are crops that grow in winter and there are other ways of making money as well. Fishing, mining, foraging even combat - all still work.\n\nMin/max approach early on is to ignore the town and go hard on fishing for early income and energy food, to then rush mines while manually watering a lot of crops to then end up with zylions of quality sprinklers as summer starts.\n\nBut such approach is not required. You can do mines only on lucky days only while using all other to fish, while growing the crops and start bigger crop fields under quality sprinklers in fall for example. You have unlimited years in this game too.",
            ">!This area is part of a mini-puzzle that you can solve by reading the Museum letter \"Incomprehensible\" Lost Book. The hint is looking for the first letters form each word.!<\n\n>!*This one being the: \"SUPER CUCUMBER TOWN\". By h*olding a Super Cucumber and clicking on the \"Locked Boxes\" at your character side, you will receive the furniture statue: \"??HMTGF??\". There are still two others locations to be found, and they require other items from the text-puzzle !<",
            "I don't think anyone has done it yet, but >!thanks to that book, \"legit\" perfection Y1 should be possible, only needing to use perfection waivers for the Kent friendship %. As to how early into Y1 you can speedrun it, I have no idea!<",
            "In-game, no there isn't. If you are open to modding, you can use Easy Farm Switcher (https://www.nexusmods.com/stardewvalley/mods/16873) to do it. Be sure to follow the instructions and you shouldn't have any problems, but **keep a save backup** just in case there are and you have to roll it back",
            "Yes, he asked me for dried crystal fruit and I gave him dried salmonberry.",
            "It's a bug.  It's been reported, so hopefully fixed in next patch.",
            "Depends on how you define most efficient. Hops give the most money/day if you have enough kegs, but requires the most effort on your part.\n\nAncient fruit are also *generally* more profitable than Starfruit unless you're doing shenanigans with fertilizer/switching professions to get the Starfruit to grow fast enough to be competitive.",
            "> I'm a bit too poor in-game to buy another sapling rn ....\n\nIf you're playing 1.6 you'll be pleased to know that fruit trees can be transplanted. \n\n>>Fruit trees can be chopped down, yielding normal wood and a matching sapling of the same quality as the fruit.  \n>>When chopped at stage 1 of growth, it will instead drop its respective sapling.  \n>>High-quality saplings mature faster than normal: a silver sapling grows 2 times faster, a gold sapling grows 3 times faster, and an iridium sapling grows 5 times faster.  \n\nhttps://stardewvalleywiki.com/Fruit_Trees  \n\nAlso, if you get some treasure/mystery boxes some of them will contain fruit trees.  Click the reveal on this page of the wiki ...  \n\nhttps://stardewvalleywiki.com/Mystery_Box#Contents",
            "No.",
            "Some furniture u can rotate, just pick it up and right click when u want to rotate it. If it doesn’t then it doesn’t work for that furniture piece.",
            "Yes it is, on ur first winter you get a magnifying glass and can start finding these little notes everywhere that tell you what people like and dislike. You gotta realize that the first year is NOTHING compared to the full game",
            "As long as the hay is on the bench itself, yes your animals will eat the hay if there is no grass to be eaten outside.",
            "Im pretty sure you can’t get it on the Switch until 1.6 is released on console.",
            "depends on what you’ve unlocked, what buildings you have, tool upgrades etc\n\nin winter, i rely on animal products to keep my income coming in. i also spend most of my time in the mines or skull caverns and i sell a lot of what i find there ie. extra gems, cloth, etc\n\nwinter is one of those things that you kinda have to prepare for otherwise. once you’re in the thick of it you are better off relying on mediocre income sources like fishing, animal products (although if you have upgraded buildings and turn animal products into artisan goods i’d consider them a good source of income)\n\nmy goal every save is to unlock the greenhouse before winter year 1. that way no matter what i can still have a reliable crop growing area. ",
            "Fishing at the Mountain Lake might be best in your situation\n\nGrowing winter seeds is also good\n\nI'm assuming you haven't repaired the bus or the greenhouse",
            "There really isn't much of a linear storyline.  There are events that happen yearly on the calendar, and those stay generally the same from year to year (a couple change a bit from year 1 to year 2 but nothing after that).  Many events are triggered based on friendship with villagers which happens on your own timeline, depending on how often you give them gifts, do their quests, and talk to them.  You can technically see all of these events by the end of year 2 as well.\n\nI would say if you're trying to complete every event and get the \"Perfection\" status, the average person will do that by Year 5.",
            "The first game “ending” was originally the thing that happens at the end of year 2. However since then tons of new late game content has been added that makes it pretty much impossible you will have experienced everything in the game by that point. However it’s not really on a timeline after 2 years. There is more content that comes up whenever you discover it, whether year 1 or year 100.",
            "Kegs, Crystalariums, Preserve jars, Furnaces, Tappers, Smokers, Dehydrators, ect.",
            "Fishing really depends on the fish you catch. Some are sluggish and easy, others dart like mf's and even veteran players curse their name. If you're looking to practice, I'd recommend go up to the Mountain lake and fish there. The carp are very easy to catch (so you can solidify your foundation) and there are some fish which are a little more active so you can learn the mechanics.\n\n\nWilly does sell a Trainer's Rod which will allow you to catch basic fish, it gives you a very big green bar which makes up for your low-level in fishing. If you're really struggling I'd recommend by that rod until you're a little higher in levels.",
            "Get the training rod",
            "what the other person said, but also if you’re trying to do the quest and struggling, my tip is to visit each elevator level and look it over quickly. if you don’t see one, go back to level 0 and wait for ten in game minutes to pass. that will reset the levels and you can do it over again. rinse and repeat til you find it",
            "They only spawn when that specific quest is active",
            "The mahogany tree drops hardwood, but the stumps on the farm and in the secret woods also do. You need a bronze axe to break the stumps and an iron one to break the one blocking access to the secret woods.",
            "You can take them off, same as with rings, and store them in a chest if you want. You can also sell them to Adventurers Guild for 1,000g. \n\nYou can also upgrade them using the/an anvil - the one you make.   \n\nhttps://stardewvalleywiki.com/Trinkets  \n\nhttps://stardewvalleywiki.com/Anvil",
            "if you havent already:\n- upgrade backpack\n- upgrade a couple tools (axe and pickaxe are the best to upgrade first, id upgrade both to at least steel)\n\ni would consider upgrading both your coop and barn for the additional animals it unlocks. ",
            "Have you unlocked the vault?",
            "Bars take time to craft so if you're planning on mass crafting something it's worth it to keep those cooking passively as you play.  Like the other guy said, bombs and furnaces are the only things of note to worry about crafting with ore.",
            "Bombs take raw ore, but they're pretty much it.",
            "You won't lose progress.",
            "Definitely don't try to play fast on your first play through",
            "Take your time, there are only a few minor things that you can miss permanently:\n\ntime restriction:\n\n*  Sam's 3-heart event can only play on a sunny before Winter Year\n\nchoice restriction\n\n* Community Center or Joja Membership. The CC route focuses on exploring and gives you hints what you can find in the valley, Joja is money focused. (For your first playthrough it's probably better to do the CC)\n* choice between two option for your farm cave >!fruit bats or mushrooms.!< In 1.6 they are relativly equal. Eventually you unlock better alternatives so the choice doesn't really matter in 1.6. >!Mushrooms !<are more money focused and get's outclassed relativly soon, while >!fruit bats!< have niche for a longer time: >!easy iridium quality universally liked gifts (grants \\~80% friendship compared to a normal quality loved gift) !<\n* Penny's 4 heart event can only play before you do a late game thing: >!build her & Pam a house!<\n* Clint's 6 heart event can not play if you either saw Emily's 8 heart event or>!married !<her\n* Depending on your game setting and choosen farm type some decorative items/weapons are unobtainable\n\nUnless I forgot something everything else either repeats eventually or you can unlock something to revise your decision.",
            "Slow down, explore what interests you at your pace, and enjoy. You can only play it for the first time once. Don't worry about guides or what other players do (those folks generally have hundreds of hours in already, their gameplay will be different).\n\nYou can always play again in a fast/minmax way if you want. But I've seen too many people get caught up in looking up answers and regretting it.\n\nOf course, feel free to ask any questions on here. It's a friendly community and helping each other is part of the fun.",
            "there’s a new cabin type that’s a trailer. tbh i don’t know if you can choose it like the others or if you have to do something special for that type of cabin",
            "Yes, you can.",
            "the biggest thing is the new farm map, so if you’re ok without it then i say go for it now. 2.5 added a new farm map also so there’s something new in that department ",
            "it’s random! if it says white at the top when choosing a coop for a new chicken, just exit out and try again ",
            "What you'll have to do is edit the game save file. There's a good tutorial for it [here](https://www.reddit.com/r/StardewValley/comments/ga551l/tutorial_updated_changing_pet_typebreedname/). Disregard step 1, that's for if you're dealing with the PC version, and find the game file on your phone (wiki has instructions [here](https://stardewvalleywiki.com/Saves#Mobile_.28Android.29) for iOS and Android) to edit. I would recommend emailing or sending via discord or some other app the game files to a personal computer, and just using notepad to edit. It's pretty simple if you can do that.",
            "Never mind! I was holding refined quartz, not iridium (face palm). I’ll try again tomorrow with the right stuff…",
            "Fishing is really hard in the early game but it will get easier. In the meantime you can get a training rod from Willy.",
            "Get a zillion crab pots. \n\n5xp per harvest towards fishing xp. Slow but it'll add up.\n\n\nAt level 10 fishing the bar is twice the size then at 0. Cork bobber also increases the size of the bar. Gets stupid easy at that point.",
            "What settings are you using?  The only way I can make that work is with [these settings](https://thorinair.github.io/Stardew-Profits/#produce_2-equipment_0-sellRaw_false-aging_0-planted_500-maxSeedMoney_0-days_56-fertilizer_0-level_0-season_1-buySeed_false-replant_false-nextyear_false-buyFert_false-average_0-fertilizerSource_0-seeds_\\(pierre_true-joja_false-special_false\\)-skills_\\(till_false-agri_false-arti_false-gatherer_false-botanist_false\\)-foodIndex_0-foodLevel_0-extra_true-disableLinks_false-crossSeason_true-foragingLevel_0).  \n\n* Pierre-only seeds (exclude ancient fruit, and starfruit)\n\n* Is cross-season with Summer and Fall only\n\n* Requires everything to go into a keg",
            "no, it’ll cause crashing issues for one of you depending on who’s hosting (generally). your friend would need to also download the mod ",
            "yes! the traveling cart sells large milk randomly",
            "I think it's better just because you'll have no idea what you were doing back then. I looked at a save I did months ago and honestly can't see what I was thinking on a fair amount of the farm design. And there might have even been decent logic to it, but I don't remember. Also you'll get to play new farm layouts. Even if you don't play on a platform that has gotten the 1.6 update, the 1.5 update is available everywhere (I think) and has a beach farm that's a pretty heavy game changer.",
            "i’d definitely go during rainy days, because something appears there which benefits you in the long run when it rains. that is the case for two separate “quests,” and there’s another that requires clear weather. overall it’s kind of preference imo. ",
            "Surprised no one has yet mentioned tent kits. They let you sleep on the island, avoiding the delay and cost of paying willy to take you.",
            "Watering can, if you're going to the volcano\n\nSome bombs to clear out the farm fast, and to free someone in the dig site\n\nSlingshot, for one golden walnut\n\n10 diamonds, volcano stuff, if you're in 1.6\n\nCopper pan/upgrades (1.6), always bring it",
            "1) Until you've collected !>enough golden walnuts to unlock the Ginger Island Farm house !< go as early as you can in the morning. Go on days where you don't have too much going on in the rest of the valley. Personally, I try to prioritize Ginger Island as soon as I get access.\n\n2) Bring all your regular tools, panner, slingshot, 50 wood or a chest. \n\nThere is an area with dangerous monsters and you should bring your regular mine/caverns stuff, but you don't need to go there your first day",
            "Do what makes your GF happy",
            "hearts will slowly decay overtime if you don't interact with them each day, this can be negated by talking to them (or petting for animals). though this decay rate is very little and you really don't need to worry about interacting with everyone every day",
            "When you get married your spouse places something there and they like to hang out there, e.g. Abigail stands there to play her flute",
            "Most of the obvious bugs have been fixed in the first 3 updates. I started playing after 1.6.2 with mods and didn't face any problem.",
            "CA said that gap was horrible and a massive mistake, and wouldn't happen again.\n\n\nI'd expect probably a couple more weeks, maybe a couple months if something goes screwy.",
            "Tbh ever since I learned that I can connect my joycons to my laptop I’ve been playing on my laptop ever since (and having an absolute blast with mods)",
            "Oof. I am sorry that happened. ;/ \n\nNot sure if this is a looking for a solution type of post, but you can download a mod to change the year, season and day back to where you started. The day you change it gets a bit wonky but, once you sleep, all will return to normal. \n\nThe mod is called CJB Cheats Menu if you are interested. :)",
            "There are no silly questions! That spot is reserved for your spouse if you decide to marry.",
            "Either way. Install+update vs. clean install after update get the same result. It may be easier to install now and let it autoupdate on the day.",
            "How many walnuts have you collected so far?  What have you unlocked?",
            "Yes. All seeds must be watered unless you have sprinklers or they can be irrigated like rice and taro root.",
            "As long as you have cloud saves turned on, you can pick up a save on any steam device. Mods don't (typically) alter the save in any way, so if they're present on Mac and not present on Steam Deck, it won't cause any problems.",
            "The sprinklers don't work on pots, unfortunately. Only the tillable soil on the greenhouse floor.",
            "Are you running mods? That sounds like a serious glitch. Could you screenshot your skills menu twice, hovering over the level 5 and 10 professions- tiller and whatever you chose?",
            "you go to Robin's house while she's at her desk and talk to her. You'll see the option to build other buildings as well.",
            "He said it will as soon as he has his coffee and checks there’s not some massive issue",
            "The blue grass probably has more benefits that we havent found yet. Plus the free coop and chickens saves you about 5k and building materials. The short term benefits are obvious, any potential long term ones havent been found",
            "I’d suggest no mods first so that you can experience the base game first. Also if you download a bunch of mods and then jump into the game without having played it before, it can be overwhelming learning how to play the base game on top of learning all the mods.",
            "Quite easily - just remember that Pierre wants a monopoly, and by keeping Joja supermarket he doesn't have one *and* poorer villagers have a choice of where to shop.",
            "I have only played on Switch and I don't ever recall my game crashing (I'm on Year 7 with over 200 hours on my primary save).",
            "Yes. If you go into your files for Stardew, locate the mods folder and either make a copy of it on your desktop and delete it or just rename it, Stardew will load up without mods",
            "It's a reward for one of the community center bundles. \n\nIt's this one:>!The boiler room!<",
            "Some mods have been updated in nexus mods but you have to download them and replace the old ones, not all mods works just the ones that are compatible with Smapi 4 and the new 1.6 update (you need to update smapi too)",
            "It depends, if you wanna play in the new farm yes, it is significantly bigger than the other ones and comes with a coop and two chickens. But if you want to play with the new features an old save will do just fine, you'll still get to collect new items, discover new recipes, new requests and you can add more pets to your farm as well. Basically starting a new save it's just needed if you want to play in the new farm.",
            "Select it in your inventory (so it's in your hands) and then use whatever input you'd use to do something like eating food (at least, I'm *pretty* sure that's how I did it).",
            "There's a picture in the wiki as well as the full list of donations. Hovering a mouse/cursor over an item displays the name if it's been donated. Otherwise Gunther's name will be mentioned.    \n\nhttps://stardewvalleywiki.com/Museum#Notes  \n\n>There is a total of 102 spaces available for donations to be placed but a total of only 95 available items to be donated.  \n\nIf you're using Mac/Windows/Linus/OSX you can run Stardew Checkup to see your progress.  \n\nhttps://mouseypounds.github.io/stardew-checkup/",
            "Only on bare land. So if their pen is 100% grass with no bare tiles, you won’t get truffles.",
            "Isn't it the same button you would use to open any other chest?",
            "Weapons found in the world or through fishing will now randomly have enchantments on them. Something that was only available before from the forge on Ginger Island before.",
            "i read someone say they had to put their mayo in a chest, make a new mayo, then add the old mayo from the chest back to their inventory into the stack with the new mayo.\n\nYMMV, I don't have 1.6, just going by a comment I saw",
            "Someone else commented the same! I’ll catch it soon fingers crossed lol",
            "Probably not, checking on it\n\nThis sprite appeared to me in a certain day, but in another \"stardrop\" day, the old sprite still appeared\n\nIt seems that this was a \"extra super duper luck\" day? Idk, just assumptions",
            ">the fifth one can only be caught in spring but have to get all the others from each season first\n\nYou don't need to catch the other 4 for it to appear, it just requires correct bobber location, spring, rain and fishing level >=10",
            "> completed museum (unless you have one or two artifacts that keep eluding you)\n\nI completed the museum within year 2 this playthrough without any trouble - >!treasure totems!< are neat :)",
            "Ooo I’ll go do this asap 🐔🤩 thank you!! ☺️ army of blue chickens UNITE!",
            "That's worth knowing.  :)",
            "Remember to take into account the longer time for Kegs (4 days versus 2-3) when determining which you think is more worth while. I would say the Starfruit->Rhubarb list is better for Kegs and the Pumpkin->Yam list is better for Preserves Jars.",
            "THANK YOU SO MUCH. i'm nearing end of autumn yr1 and i've been searching for so long.",
            "yeah. I wanted something to be online always so our shared farm would grow together",
            "Thanks 😊 just upgraded the barn for goats so might put that next on my list",
            "hi hi i'm also a Stardew newbie - why do you say to plant at least one of every crop? i'm in y1 summer and have only planted the most profitable crops + what's needed for the community center :p",
            "Thanks!\n\nDo you have a limited number of seasons/years to complete everything or can you basically take as long as you want?",
            "If I’m new to the game should\nI start on the new farm or no?",
            "alright! i’ll give it a try later. i guess the best way is really to try and avoid min maxing! but there arent any permanent missable content at present? aside from choosing center over mart?",
            "Yep, fruit on the flooring. Thanks!",
            "So the one tile of water doesn't matter. Thanks for the info, man.",
            "Ah okay, I actually like having my relationships development slowly so for year two I’ll make that adjustment. I’ll keep some high quality items for the stardew valley fair too. Thank you :)",
            "Thanks for weighing in, I eventually found it with the predictor as well, it appeared in the bookseller finally in Year 9. When I finished sleeping my wife hated me for not speaking to her several hundred days in a row >.<. It seems that there's only a 1 in 11 chance for each bookseller so with only 8 attempted each in-game year it's quite possible to have to wait a very long time for it.",
            "Thanks I just discovered that I can collect stuff and finish those bundle tasks. It's given me some idea about what to do!",
            "OH that makes sense cause I just got married! Thank you!",
            "Thank You So Much",
            "thank you!",
            "Oh thank you!!",
            "thank you!! and yeah i've yet to get it on any of mine too, worst part is as much as i love it i would probably think it looks silly on my farmer-- i've put a couple hours in as is with no signs yet, and it's tough to figure out if i even have hope, cause i think daily luck affects it? but the tv doesn't have signal,, we'll see how it goes though, and good luck if you ever choose to look for it too!",
            "that worked! I got 12 morels doing that. I didn't know you could get morels from them (I had my logs near wild trees and it was only giving the other mushrooms)\n\nthank you so much <3",
            "thats not what I meant :D \n\nI rather meant: where to best go next?",
            "Thank you for your answer! I'll focus on the Skull Caverns more 👍",
            "There's a deconstructor to get (some) raw materials out of crafts in vanilla, but it's super late game.",
            "Instead of no crows I found a mod that makes your pet fight off crows the more friendship points it has, at full friendship you get no crows ever. I think it's more fair because you have to earn it.",
            "Ah to late I already did repairing not realizing that I dont have 5 battery yet,I mean I did had it but I shipped some and give some for the quests :'( so now I pray to get stormy day before winter begin but there only 10 day left",
            "ty!! i fixed it but that was a terrifying 30 minutes XD",
            "Absolutely\n\nWith Artisan and Starfruit, one keg will generate just over 10k profit per month. Ancient Fruit is 19% slower, 8k per month \n\nSo for 3.5M you need 350 keg-months. So if you have 50 kegs, it will take 7 months. If you have 175 kegs it will take 2 months (assuming no other income sources). \n\nSo for OP, they should plant some Starfruit and if they're short on kegs, tap some oaks.",
            "That is amazing, I am happy",
            "Spring 2 day 3.",
            "OMG! This is great news.",
            "i didnt build a coop because my stupid ahh thought it was a waste of money, well, time to save up i guess\n\nill have to build a big coop, tho, i have like, the dinosaur egg",
            "yeah i havent repaired any of them, but i decorated the area where the green house is \\* outside, not inside \\* and aiming to get greenhouse",
            "I see thank you for explaining.",
            "Thank you! I completed the quest for the first time last night :)",
            "I know but I can't find those trees in the farm 😭😭",
            "Thank you for replying!!",
            "Thank you!",
            "Me grinding on Ginger Island for weeks and coming home to a very pissed off wife",
            "Ah thank you!",
            "OHHHH. that makes so much sense, i'm playing multiplayer and married them instead of an npc lol - thank you!!",
            "Omg, the soil is tillable in the greenhouse?! Thank you! ",
            "Tru. >!IIRC he also raises the price for his items at some point!< . Fuck Pierre. Thanks",
            "That's reassuring, thank you!",
            "Have fun! The blue chickens are adorable",
            "A good way of finding your way round is to take a screenshot. It helps a lot when you're in the Volcano. ;)",
            "Go to Robin and choose to paint or move your building. You can scroll around your whole farm live with time frozen.",
            "You can take as long as you want. There is no disadvantage to taking your time. You might come across people posting things like \"I achieved this in only x years\", but that is just people challenging themselves so the game still feels fresh and exciting. \n\nI know the game doesn't do all that much handholding, but there is literally no wrong way to play this and no penalties for doing stuff wrong. Even if you accidentally sell your tools, you can get them back. There are a few beginner mistakes you could consider. A common one is to plant crops to late in the season. The seeds tell you the time they will take. Every month is 28 days. Don't plant a crop if the season ends before the crop is ready, it'll just die.",
            "Hmmm perhaps the best way to go about making this decision is to watch a YouTube video(s) that covers the basics of each farm layout, what the positives and negatives are for each, and pick which one appeals to you the most. The two things that you get with the newest farm type are blue grass and a free chicken coop w/ 2 chickens, however these things can be bought in the game on any of the farm types at one point so it’s not like you’re restricting yourself from any of the content.",
            "Daily luck/luck buffs don't affect it, so don't sweat about that. Unchangeable 0.001% (no, I did not add any zeroes by mistake, it really is 1/1000) chance to get it by cutting weeds",
            "after 50, 20 minute runs of roughly a thousand weeds each cycle, i managed to actually get it, typing this the moment i caught it in my inventory and am now processing it, i still don't fully know if green rain helped as it seems to have popped up on the ginger island dig site [or jungle and i saw it late?] either way, thank you for the reassurance i've finally made it",
            "I think the obvious next step is to unlock the Desert. \n\nFall is usually my most lucrative season with Cranberries. Mid-Fall after the first Cranberry harvest you’ll have enough to repair the Bus Stop. In the meantime, I usually go caving in 110-120 repeatedly until I get a Prismatic Shard.",
            "The big tips with skull caverns are:\n\nYou can get a desert totem by trading 3 omni geodes for it from the desert trader. This will help you start your next skull cavern run earlier in the day. (every hour makes a difference) You can get staircases by trading Jade on Saturdays. You can also get spicy eel (which is a great buff for a deep run) by trading rubies.\n\nYou need a large stack of highly healing food. Most people either use gold star cheese (which you can make in bulk from large milks) or they buy food from Gus. Comparing the cost and healing of various options, salad is the easiest option to just buy in bulk.\n\nYou also need bombs. The key to go quickly is bombs. Buy a bunch from the dwarf - for a full day if you want to make it down to level 100, you probably want 100 or more bombs. If there's more than two or three rocks within bomb distance, throw down a bomb.\n\nIf you totem in at 6-630am, then just bomb your way down with the rare staircases (primarily for infested levels), you can hit level 100+ relatively easily. You don't need to be quite that aggressive to get plenty of iridium and stone, but even 60+ should get you a good amount. Deeper is better though - iridium spawns go up aggressively with depth.\n\nDon't worry about hitting yourself with the bombs by the way. You can just eat a salad later to get up. Oh, and last tip is just keep fighting till 2am - passing out due to time just gets you 1000g penalty (never items lost), and you'll likely get far more than 1000g worth of stuff with an extra couple hours in there.",
            "That's adorable, do you have the name? Also there is pet animation or it is automatic?",
            "Best of luck! You can get battery packs from Pam as a gift or as a drop in skull cavern from iridium bats. They get more common the further down you go.",
            "It's really great. Also try out the bait maker.",
            "it’s a decent source of income, but gets better as you upgrade. the animals make up for the cost of buying  them after a short while. definitely worth the money. this winter might be boring or tough for you but i would focus on saving what little you have (after buying the coop, also in spring build a silo if you haven’t yet) and go fishing or spelunking for extra cash. ",
            "Mahogany doesn't start naturally on the farm\n\nStumps and logs start naturally on the farm. You've seen them every day",
            "NP. Enjoy your game :)",
            "Just to add on to the other comment, relationship decay stops after reaching max hearts with a villager. The exception to this is your spouse - after getting married, your relationship with your spouse will decay if you don’t maintain it. Also, if you’ve reached the max of 8 hearts with a dateable villager and then give them a bouquet, relationship decay will start back up again.",
            "Yes, he makes some fancy claims about the produce and raises the price so high that everybody complains. That's what he'd love to do, but permanently, if he had no competition.  \n\nAnd he never sells autopetters! :D",
            "Yes! I forgot the most important piece- I have only played since the pandemic (2021), so you should for sure be okay.",
            "I went new game type lol",
            "It's called Pet against crows, but it doesn't have animations, it's all automatic.",
            "I finally found some ! Thank you to both of you ! 😄",
            "The new farm? Nothing wrong with that!",
            "Start saving up the Mahogany seeds you get and set up a farm at the desert/spa. \n\nGoes far real quick with like no work."
        ]
    },
    "r/StardewValley is looking for new moderators!": {
        "title": "r/StardewValley is looking for new moderators!",
        "score": 20,
        "url": "https://www.reddit.com/r/StardewValley/comments/1dk8eoh/rstardewvalley_is_looking_for_new_moderators/",
        "content": "Hiya farmers!\n\nWe're looking to add a few new moderators to our team. If you're interested, please apply [in this form](https://forms.gle/S5EdoXcrirEHdx8r6).\n\n---\n\n# FAQs\n\n\n**What if I'm not always online?**\n\nModerators are unpaid volunteers. You won't be expected to moderate full-time or keep a set schedule; the benefit of having multiple moderators is to distribute the work and fill in gaps when someone is offline. \n\n\n**Am I qualified?**\n\nWe're looking for users who fit these requirements:\n\n- active in posting/commenting anywhere on Reddit;\n\n- active on the subreddit (even if just as a reader);\n\n- account age of at least 6 months;\n\n- willing to join our private Discord;\n\n- willing to help with routine work like reviewing user reports at least a few times a week.\n\n\nBonus (not required):\n\n- have previous experience moderating a subreddit.\n\n---\n\n**Applications are open until Thursday, July 11th.** We will contact those selected to join the team by DM. We tend to get a lot of applications each time, so the selection process can take several weeks.\n\nPlease let us know if you have any questions!\n\n---\n\n# Google forms\n\nhttps://forms.gle/S5EdoXcrirEHdx8r6\n",
        "num_comments": 10,
        "comments": [
            "let the hunger games begin 😌",
            "how many applications are there and how many people will be selected?",
            "Woohoo! ![img](emote|t5_2wb7y|51692)",
            "Good luck to those applying!",
            "I’m interested 🥳",
            "Third time's the charm, let's go! 🤓",
            "I was thinking, “I could be a moderator!” Until I saw account of six months…… 😔Can’t wait to see new moderators though!",
            "i applied. Best of luck to everyone else. 🥰🥳",
            "Just submitted an application! I'm hopeful and excited :D",
            "Not a set number! Depends on the applications"
        ]
    },
    "guys be honest does this look like emily": {
        "title": "guys be honest does this look like emily",
        "score": 1212,
        "url": "https://i.redd.it/15ifhm3nv08d1.jpeg",
        "content": "i tried a pattern but i didn’t have all the colors so i picked the closest ones, but does this even look good?? like her?? (also be on the lookout for another post for harvey) (also also peep me playing stardew in the back LOL)",
        "num_comments": 84,
        "comments": [
            "**We are currently looking for new moderators!**\n\nIf you'd like to help us moderate this community, please see [this announcement](https://www.reddit.com/r/StardewValley/comments/1dk8eoh/rstardewvalley_is_looking_for_new_moderators/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) for details and how to apply. We'd love to hear from you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StardewValley) if you have any questions or concerns.*",
            "Yes",
            "I immediately knew who it was without looking at the title or subreddit, or having played the game for awhile. \n\nGood job!",
            "Yes! If you asked me who that was without prompt, I would say it looked like Emily from Stardew. Ive lost count of how many times I’ve married her 😅",
            "yeah !! :D",
            "yes",
            "It does but she needs more pixels",
            "I’d know my girl anywhere! Nice work",
            "Knew who this was from the thumbnail photo. Good job!",
            "It's a little off, but yes, I can 100% tell it's her.",
            "Yes, also Haley >>>>",
            "I instantly recognized that as Emily so I’d say yes",
            "Love it, on my first playthrough. Only one heart away with Emily gave her the bouquet tonight you can say things are getting pretty serious. \nCan we talk about a couple things though? \n1. Wtf Clint, be more awkward. \n2. That dance, takes a lot for an 8 bit character to move you. \nPs. What happens when you get full hearts with someone I'm nervous",
            "I would know that this is Emily from Stardew Valley immediately, even if I wasn’t currently in a Stardew Valley sub. Like, even without context, I would recognize this immediately. \n\nWell done! It’s cute :D",
            "100% it looks great!!",
            "Yuh",
            "Yes. It is very nice.",
            "YAHHHH",
            "It looks great!",
            "This looks great! We can totally tell it’s Emily!",
            "Yes,I love it",
            "I immediately knew so yes",
            "It definitely looks like her, but I would have ditched the purple for the skin tone color",
            "Ok, you've convinced me!! Is it ok if I follow you so when I have a window of time, I can ask for advice?!  ☺️ I'm really impressed!! It's not something I've ever tried. After getting into Stardew and seeing all the fan art, perlers were my best bet. But the kit went in a drawer because life had other ideas! 🤗",
            "BIG YES!!!!!!!",
            "Nit only does it look like Emily, I'm sure she'd accept it as a Loved gift",
            "The arms are very thiccccccc but yes overall it reads as emily",
            "Yes!!! You're inspiring me to get busy trying!!! 🤗",
            "It looks so great!",
            "It absolutely looks like Emily!! Great job!! Love it!",
            "She’s pretty perfect 💜",
            "Yes great job 👍",
            "Obviously.",
            "very obvious",
            "Yes.",
            "Yes. That is literally Emily!!",
            "Spot on!!👏🏾",
            "It's the most Emiliest Emily I've ever seen tbh.",
            "Dead ringer",
            "Omg that's cool! :)",
            "Show the behind, is she a dump truck? Emily is a dunk truck. Good god I just realised how disgusting that phrase is.",
            "yes!!! i want one!! lol",
            "Yeah.",
            "It looks just like her",
            "Looks just like her to me!",
            "so cutee",
            "cant figure out how to edit the post, but thank you for all of the really nice comments!! this is my first day making perlers and emily was my second perler ever so i feel accomplished!! comment yalls favorite characters and i’ll make more :)",
            "did switch version get updated?",
            "No that just *is* Emily",
            "Absolutely!",
            "Emily was my first thought and it’s been a min since ive played lol",
            "Yes.  Who were you trying to make?",
            "You gotta upload the pattern you made , mate. Cuz thats obviously just a picture from the game.",
            "yessirie",
            "Kinda. The color scheme makes it obvious, but it's a tiny bit vague otherwise.\n\nStill, super cool. Nice work.",
            "What artwork is this? And yes it is Emily, very beautiful.",
            "yes! totally does :)",
            "Absolutely",
            "Yeah, it's immediately recognizable.",
            "Yes",
            "It looks like Emily if Stardew Valley was on Sega Genesis.",
            "Umm yesss exactly",
            "Obviously yes",
            "Of course",
            "Have confidence! That looks exactly like her. As others have said, didn't even read the title and knew who it was.",
            "Yes 1000% and it looks awesome!!!!",
            "I recognized her immediately!",
            "I unironically want to take a bite out of that, looks like some high quality candy.\n\nAlso yes, it does look like emily",
            "Omg yes It’s so cute",
            "Yes, it looks exactly like Emily.",
            "thank you !!",
            "Came to the comments to say exactly this !",
            "thank you!! i was hoping people would see it lol",
            "yes!!!",
            "Emily hit the gym. Better watch out Alex, Emily is going to take your place on the gridball field.\n\nJk of course. I love Emily therefore I love this.",
            "yeah idk what happened with the arms 😭😭😭 lowk trusting the process and i shouldn’t have",
            "if it helps this is the second one i’ve ever made, i started doing it today!",
            "🤣🤣🫶🏼\n\nhttps://preview.redd.it/844q2lbl428d1.png?width=1170&format=png&auto=webp&s=f5be1c0b45bddf67f64e1b682b7a0dadf7037190",
            "Done! And I will absolutely let you know! Yay!!!!",
            "Did you use round beads or squares?",
            "Nice",
            "round beads!",
            "A good suggestion for next time is use long squares for the best pixelated look. Then her arms won’t be so stalky"
        ]
    },
    "My Mother's Birthday Gift to Me": {
        "title": "My Mother's Birthday Gift to Me",
        "score": 1999,
        "url": "https://i.redd.it/rj0jp2jm108d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "**We are currently looking for new moderators!**\n\nIf you'd like to help us moderate this community, please see [this announcement](https://www.reddit.com/r/StardewValley/comments/1dk8eoh/rstardewvalley_is_looking_for_new_moderators/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) for details and how to apply. We'd love to hear from you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StardewValley) if you have any questions or concerns.*",
            "Please this is so funny",
            "I feel attacked. (I love it! Your mom is hilarious)",
            "save yo mom",
            "🎶 *I can fix him, no really I can* 🎶",
            "Tell your mom that my birthday is in January",
            "Literally in the nutshell of people who loves Shane gives off a huge \"I can fix him\" energy  \nAnd the fact that your mother is aware about this and your situation makes me cackle and snort",
            "I need your mom to make me one of these for each man I've dated as a reminder to myself that I cannot, in fact, fix him.",
            "Ouch",
            "this is either funny or concerning",
            "She threw shade",
            "YES YOU CAN",
            "This is a horrible life mantra lol!",
            "u/that-1-lame-kid\n\nThanks mom ahhahahahahhaha",
            "Oh my, this is so funny",
            "You can fix him!\n\n...but can you fix the mess he makes of your house?!\n\n(he was my first save's husband, I feel ya!)",
            "dude i just set my flair to this closed it and saw this wtf",
            "oh lawd",
            "That is foul, I love it",
            "I love her so much my Dad found the pattern and she stitched it up so technically it was from both of them in a way",
            "Whoa, maybe I can’t…",
            "Honestly she knows I wouldn't actually do anything like that in real life so it's just comedy hour for her",
            "I marry Shane because he fixes himself. The only thing the farmer does to \"fix him\" is be a good friend and take him to the hospital. After that he gets a therapist, cuts back on drinking, and focuses more on his niece. Watching someone's growth journey isn't fixing somone.",
            "I promise I shed tears at how hard I laughed when I opened it",
            "yea she's just teasing me because I like him in the game I wouldn't ever try employing it in my personal life",
            "I want one now lmao",
            "Damn, my folks can be awesome, but yours are a comedy duo that takes no prisoners. I am slain",
            "I'm sure etsy has some lol",
            "The pattern is made by NicheStitches on Etsy its just called Shane Cross Stitch Pattern"
        ]
    },
    "hey guys, IT'S WIFE!!!!!": {
        "title": "hey guys, IT'S WIFE!!!!!",
        "score": 835,
        "url": "https://i.redd.it/x7bvg4j8618d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "**We are currently looking for new moderators!**\n\nIf you'd like to help us moderate this community, please see [this announcement](https://www.reddit.com/r/StardewValley/comments/1dk8eoh/rstardewvalley_is_looking_for_new_moderators/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) for details and how to apply. We'd love to hear from you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StardewValley) if you have any questions or concerns.*",
            "Love Maru but it might be smart to credit the orginal artist! Unless you are the artist lol haha but I remember seeing this on Tumblr this morning ",
            "These hairstyles make her so much more cute, I love it",
            "When you realize Maru has Robin’s skills and Dem’s brains.",
            "My biggest complaint with Maru will always be her hair. This artwork shows how incredible she could look",
            "There's my STEM bestie! I love how much personality she has in this, especially with the \"Erm, actually\" because that is something I can totally see her hitting someone with one of those. Nicely done.",
            "I married Maru and I love the pretty bombs she makes me. And the occasional crab cakes.",
            "https://preview.redd.it/ioi9v4far18d1.jpeg?width=236&format=pjpg&auto=webp&s=e78a2b000590386640e7cdacb97193086767a85c",
            "If her hair was like this in game I’d probably date her (just to spite Demetrius of course)",
            "Maru 🩷🩷🩷",
            "This makes me wanna wife Maru up today.",
            "![img](emote|t5_2wb7y|51480)![img](emote|t5_2wb7y|51480)![img](emote|t5_2wb7y|51480)",
            "PRETTY",
            "Haley >>>>>",
            "yep it’s the top post when you search up “stardew valley” on tumblr haha https://www.tumblr.com/icepopcider/753746010820509696/everyobody-look-its-our-wife-ok-hcs",
            "Not trying to be smart, I'm just ignorant on the etiquette here, but since the artist signed the image would you still need to credit them?",
            "This has GOT to be inspired by the Diverse Stardew Valley mod sprite/portrait art. Which does indeed make Maru ADORABLE.",
            "Yeah, I never got it before, but I do now",
            "man I love haley but    not arguing over stardew valley spouses>>>>",
            "i love haley too but let maru get some love, girl is literally the most underrated bachelorette😭",
            "Least brainrot Demon Slayer fan:",
            "Not all people notice the watermark and a lot assume that the OP is the artist even if they do see the mark. It’s just reposting etiquette to say “art by _____” :)",
            "Lmao"
        ]
    }
}