{
    "For all UFO/Alien/UAP news": {
        "title": "For all UFO/Alien/UAP news",
        "score": 15,
        "url": "https://uapnewscenter.com/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Former NASA astronaut Brian O'Leary said before his death 'We have Contact With Alien Cultures & Their Appearance Is Bizarre'": {
        "title": "Former NASA astronaut Brian O'Leary said before his death 'We have Contact With Alien Cultures & Their Appearance Is Bizarre'",
        "score": 280,
        "url": "https://i.redd.it/mvokjgsat18d1.png",
        "content": "",
        "num_comments": 68,
        "comments": [
            "[Click here to read the full article:  Ex-NASA Astronaut: ‘We have Contact With Alien Cultures & Their Appearance Is Bizarre’](https://www.howandwhys.com/ex-nasa-astronaut-we-have-contact-with-alien-cultures-their-appearance-is-bizarre/)",
            "\"Their appearances are bizarre\" Posts a picture of a bunch if fine ass aliens...",
            "The smurfs was soft disclosure",
            "Ironically, what *would* be bizarre is if they looked like normal",
            "I’m sure our appearance is bizarre for them",
            "He's an older one by the looks of him , he's just gone home",
            "Is that Ric Flair?",
            "“and use co-rotating magnetic disks for their propulsion systems”\n\nOk so how do they rotate the discs? That takes energy, where does that come from?",
            "Sports Mars Illustrated",
            "His wiki article is interesting.",
            "We are from the planet CH3R",
            "[removed]",
            "[removed]",
            "[removed]",
            "Nik Mallet",
            "Damn, this guy said that Carl Sagan faked the Mars face before he released the photograph",
            "In other news, water is wet",
            "Tell me more about",
            "Former NASA Astronaut Brian O'Leary..........was a complete Kook.",
            "\"bizarre\" \\*unzips pants\\*",
            "Nice to meet ya! *shakes “hand”*",
            "\"It is customary on our planet for the host to permit the reception of a blowjob from the visitor to demonstrate our trust and hospitality. I assure you it is merely ceremonial and extremely customary.\"",
            "🤌",
            "I just got flashbacks of the 3 tit prostitute in Total recall I used to wank it to as a 4 year old before internet porn became so accessible. I was kind of a weird kid I guess",
            "Brian wanted us all to know his fetish",
            "That one In The back has the “ fuck me”eyes",
            "🤌🏼",
            "And the Snorks. Don’t forget about the USO’s",
            "Hey speak for yourself!",
            "The Christmas spirit of course..",
            "Capturing the abundant neutrino energy",
            "Electricity ",
            "Drop 2 polarities in a deep bowl and see what happens",
            "Your account does not meet the post or comment requirements. The combined Karma on your account should be at least 10, and the account should be at least 3 weeks old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StrangeEarth) if you have any questions or concerns.*",
            "Your account does not meet the post or comment requirements. The combined Karma on your account should be at least 10, and the account should be at least 3 weeks old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StrangeEarth) if you have any questions or concerns.*",
            "Your account does not meet the post or comment requirements. The combined Karma on your account should be at least 10, and the account should be at least 3 weeks old.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StrangeEarth) if you have any questions or concerns.*",
            "death by snu snu",
            "Me:  Far be it from me to go against your local customs",
            "I heard a podcast with some traveler guy, and he said the most annoying tribe he lived with was one who saw it as a gesture of good will and respect to let you fuck their wife. It got annoying with everyone trying to get him to fuck their wives, while getting offended when he rejected their offer.",
            "Got a mouth like a tree chipper. Their males grow a new pp after every bj. It feels good to them. LOL",
            "Would",
            "✊✊",
            "boobs were boods and there was an extra one I could wank to that but I definitely wasn't wanking my shit at 4 lol thats wild",
            "Kids today will never know the feeling of realizing you could DRAW YOUR OWN PORN!! 😂😂",
            "4??? 😳",
            "I did it, they bounced around a bit and then obeyed Newton's first law and came to a rest. What was that supposed to prove? I might have the wrong brand of polarities though, where you getting yours?",
            "The drop provided energy",
            "This is why they don't want to interact with us",
            "Oh no, not death by snu snu?!!",
            "You cant deny the local [customs](https://youtu.be/k_9CSr3nGqE?si=2dNpn_wa_85LWx7q)",
            "Lol, what podcast?",
            "wood chipper",
            "My man!",
            "Late bloomer huh?",
            "Costco",
            "I didn't literally mean drop them but sure ok bud keep obfuscating",
            "hahahah. No, I was beating off in my crib. Was wondering what took him so long"
        ]
    },
    "Last message before the internet was cut... listen very carefully.": {
        "title": "Last message before the internet was cut... listen very carefully.",
        "score": 211,
        "url": "https://v.redd.it/zldra6mlu18d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "You mean like…micro plastics?",
            "God do not show this video to a schizophrenic",
            "The level of obsession they have with surveillance and only should tell you how much they fear us or being exposed",
            "I think he is talking about [these.](https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies)",
            "Not a lot of context here",
            "Who's the biggest purchaser of glitter and why?",
            "But... What do they do?",
            "Cocaine?",
            "Chem trails",
            "You store them in your balls",
            "This sounds like something a paranoid drug user would say. “They’re bugging everything! Even the DUST!”",
            "What did he say it’s powered by? I listened over and over but can’t figure out what he said. Please reply if you know thanks.",
            "Welcome to The Circle 🙂",
            "Chemtrails?",
            "Freaky shit like this is why I bailed on society to live in the woods. Fu k all that. Gonna make the best of what time I have left in this human skin, catch me outside… swimming in a river.\n\n*it’s not actually why I bailed… but after watching shit like this it reassures the decision",
            "“to do things”.. like what?",
            "Sounds like he’s describing the plot of Michael Crichton’s book, [Prey from 2002.](https://en.m.wikipedia.org/wiki/Prey_(novel))",
            "https://youtu.be/RlVVCdBPKUU?si=LXIv6tTMGdzp1INx",
            "So, double up on my HEPA filters?",
            "Anyone else think microplastics and smart dust are related to one another?",
            "“Last message” did he die?",
            "FUK",
            "I first saw smart dust in an episode of, \"Ripleys believe it or not\".",
            "New concrete is available that can interact with 6g networks turning your floor/wall into a microchip basically.. i think this smart dust is related to that.",
            "Too late now",
            "Lick it and see if it shocks you or at the least, tingles on your tongue. Early detection device",
            "That seems pretty plausible tbh",
            "Its like a bug as far as i understand it, some dude posted a link to an article which could be about what assange said here. Basically a tiny mini bug that you can install on a motherboard without anyone seeing it cause it's like the size of a speck of dust. \n\nPretty impressive but again i think this is old tech by now, at least for governments. I dont even wanna know what they all have in their inventories to obliterate another",
            "yep",
            "Yes please",
            "I believe cell towers.  GSM towers, I think was the exact phrase.",
            "*they posted on reddit from an internet capable electronic device*",
            "He's an Australian journalist and founder of Wiki Leaks. Julian has been languishing in a max security facility in the UK (Belmarsh Prison) for several years for committing the 'crime' of investigative journalism (exposing US war crimes in Iraq and Afghanistan)",
            "Well did you or not",
            "Goodluck hearing me.over my glorious custome computer fans",
            "Things, for a short time. Evil dust things.",
            "Yes!!!!! Thank you",
            "GSM stations",
            "https://preview.redd.it/m2t0hjvrk48d1.jpeg?width=4032&format=pjpg&auto=webp&s=9c7da2ba1ad7fbb1cc35240f2a6ab39ed8dbe83d\n\nA bird took this photo",
            "I know who he is, I thought he was still in South America via asylum",
            "I knew Dust Bunnies were evil!!",
            "Birds aren't really silly goose"
        ]
    },
    "The Las Vegas Metropolitan Police Department has removed the monoliths, which were discovered earlier this week and described as mysterious. The reason for the removal was public safety and environmental concerns. The monolith is being stored at an undisclosed location.": {
        "title": "The Las Vegas Metropolitan Police Department has removed the monoliths, which were discovered earlier this week and described as mysterious. The reason for the removal was public safety and environmental concerns. The monolith is being stored at an undisclosed location.",
        "score": 207,
        "url": "https://www.reddit.com/gallery/1dlmk19",
        "content": "",
        "num_comments": 95,
        "comments": [
            "You wouldn't think that the aliens would use concrete and rebar to plant their monoliths",
            "They have top men looking into it right now.",
            "Woah the aliens use re-bar and concrete?! Fascinating…I can definitely see why there was a need to remove it. Super dangerous… lol",
            "I could see someone walking out there unprepared and dying of heat or hydration related things being a real possibility.",
            "Feels like we are making this a bigger deal than it is. Someone planted a little shiny, reflective statue in the middle of the dessert and we're making it out like it's some ticking time bomb nuke.",
            "So, then, \"mono\" means \"one.\" And \"lith\" means \"lith.\" And that concludes our intensive three-week course.",
            "Kinda seems lame to remove it",
            "Ahh good ole alien rebar",
            "I think this one is art but research the first one ever in a remote region of Utah only accessible by helicopter.....",
            "Why City police? Seems outside of town...",
            "Sounds like the same shit that happened during the plague.  Vegas PD probably doesn't want to deal with a bunch of rubes getting lost in the desert.  Not so strange.",
            "Monolith actually means single-stone... That's not a stone.",
            "And as we set off into the desert, the sun at our backs we noticed a blinding light that to an uneducated man might appear as if it were a reflection of the sun. But, the way it stayed in one place and the fact that as men of science, we know mirrors are not native to this part of the country. Therefore, ruling everything out, except one of two things. A highly polished Cybertruck stuck on a small hill, or a ufo and we know a cyberpunk can't get stuck on a small hill so....",
            "Terrestrial rebar…gee…that’s interesting",
            "Rebarb and concrete isn’t very mysterious lol",
            "It’s just art…. Why is this strange earth?",
            "Isn't this just art",
            "Nice, the aliens used concrete and rebar",
            "Laaaaame. Why can’t we have anything fun?",
            "Put them back.",
            "Damned kids these days",
            "What are the sizes of this monolith?",
            "Off world steel",
            "Alien tech",
            "It’s a mirror finish stainless steel post. I can make those. Surprised it wasn’t stolen for scrap.",
            "Aliens need footing specs .",
            "Step 2: infiltrate the police secret storage location. Complete.",
            "I found a beer can in the desert once. I think aliens put it there.",
            "Ooo, a piece of candy.  Ooo, a piece of candy.  Ooo!  A piece of candy!  Oooo a piece of candy…",
            "Undisclosed location, such as the local landfill",
            "Aliens use rebar?",
            "Someone just wanted to play laser pointer with a desert kitty and didn’t want to leave their house.",
            "I can understand concerns surrounding visibility from certain angles. Also what are the chances a reflection from this thing could start a fire?",
            "The aliens are gonna be pissed",
            "Lol public safety",
            "\"I did a thing\"",
            "I don’t think aliens would use rebar.",
            "This is why America can’t have nice things 💯☝️🤔",
            "Like in raiders? (Of the last ark)",
            "This is why it should’ve never been posted on here. :( Sucks",
            "Wonder if they used that new fiberglass rebar.... \n\nShouldn't even be posted here. \n\nShould be on r/therewasanattempt",
            "Just another art project 🥱",
            "It’s kind of fun. Why did they remove it? Perhaps there’s a larger reason for it.",
            "The artist who put it there must be really proud of themselves.",
            "Dollars to doughnuts an artist did these.",
            "It’s the only way that could hope for a permit.",
            "Came here to say this. Followed the local codes for footings 🤣",
            "That rebar looks like it was forged on a different planet though",
            "Why not? Reinforced concrete is a good cheap way to secure anything (including alien monoliths) to ground. Why wouldn’t they use it? Are they stupid?",
            "*every gram counts when you're hauling ass through the cosmos*",
            "local resources. gotta improvise.",
            "😂😂😂",
            "Top. Men.",
            "Who do you think discovered concrete? It's alien technology to begin with.",
            "Yeah, people do be stupid.",
            "Easy to assume that these are guerilla art installation projects of somebody\n\nProbably a coffee table art book cooking right now after the alley garage showing in SoHo",
            "Its just a publicity stunt that probably didnt have permission to build anything there",
            "No, it was accessible by car and foot. Biologists found it while doing research on bighorn sheep. Then some locals took it down and took it home. It was later surrender to the BoLM.\n\n\nBoLM was worried tourist would start making trips and start damaging native american sites.",
            "So mysterious!",
            "Step 1: cut a hole in a box...",
            "Hey, I know that typed voice... James Woods? Is that you?",
            "It's a mirror bro",
            "I saw an article on a major news outset somewhere, explaining that the monoliths are a part of an art project some college students are doing.. if I recall correctly…",
            "Have you tried getting a phaseshift installation permit lately? It's a nightmare.",
            "Cause they would use space rebar.. duh",
            "They’re working in shifts.",
            "What the hell is “True Level” anyway. In relation to what? “I’m sorry sir. You know the galaxy is constantly shifting.”",
            "But I thought that space rebar with space concrete is used to secure things to the space, like they do with the satellites, etc.",
            "One is at the postal store",
            "No way you can achieve true level with a bubble of air"
        ]
    },
    "This was posted on X with the description \"Unusual activity recorded on the Sun.\" I cannot find the source, but if you do, share it in the comments.": {
        "title": "This was posted on X with the description \"Unusual activity recorded on the Sun.\" I cannot find the source, but if you do, share it in the comments.",
        "score": 149,
        "url": "https://v.redd.it/iz17m4gav18d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "I can watch this all day. Probably none of this uncommon or unusual.",
            "\"unusual\"? how long has footage like this existed? like how do we know its actually unusual?",
            "This is normal for rhe sun. This is a magnetically charged plasma filament breaking apart and resurfacing. This phenomenon releases solar flares.",
            "Source: The Sun 🌞",
            "This is closer to the original, it says credit to NASA but I can't find the original NASA video. [https://www.youtube.com/watch?v=cDviMcu70T8](https://www.youtube.com/watch?v=cDviMcu70T8)",
            "How is this unusual ?",
            "Activity was probably only recognized by using a different than usual filter.",
            "Absolutely Majestic",
            "Making planets",
            "The source? xastronautkardashian69 flying around the star system getting the best footy.",
            "Cgi",
            "This is not in any way unusual. It's neat to watch though!",
            "This looks like ai",
            "It’s just the effects of solar warming.",
            "I refuse to believe a camera is this close to the sun",
            "Yep, probably aliens, good job, you guys solved it.",
            "Is this at night?",
            "Yesss thank you!",
            "Shut up about the sun! SHUT UP ABOUT THE SUN!",
            "Crappy planets. \n\nStars the size of Sol can only make elements as heavy as iron or lighter.",
            "Have you heard of telescopes?",
            "By definition, not earthlings. \n\nFor fun, speed video up and count the transient sun monkeys, i found 5 paredoila simians facing right.",
            "Night..on the sun?",
            "What a beautiful start to the weekend. I'm fucking laughing my ass off.",
            "I thought my sarcasm was obvious… apparently not",
            "try an /s next time. 🙂"
        ]
    }
}