{
    "Street Fighter 6 Character Guide | M. Bison": {
        "title": "Street Fighter 6 Character Guide | M. Bison",
        "score": 300,
        "url": "https://www.youtube.com/watch?v=oT1SLN39OiI",
        "content": "",
        "num_comments": 98,
        "comments": [
            "Capcom really said 'it's Tuesday so let's drop MvC collection and Bison's character guide'",
            "Interesting to see that they made OD headstomp throw invincible. I wonder if they'd do that for other OD attacks that put you in the air (I'm looking at you, OD buttslam).",
            "He seems pretty solid against projectiles? Wonder who will be strong against him.",
            "I'm curious to see if his lvl 3 and CA have some travel distance or only hits from close up.\n\nAlso I wonder if overdrive crusher will go through Rashid's lvl 2. Seems like psycho punisher will be a counter to that",
            "I noticed that, like guile moveset, your world avatar might probably be able to use bison’s entire moveset since I believe each of his four specials have a unique directional input from each other. Correct me if I’m wrong but I think he has one qcf motion, one qcb motion, one (b)f motion, and lastly one (d)u motion.",
            "And here I thought there was no way they’d be able to top how badass Akuma is. Capcom is the absolute Goat at character design.",
            "I was a Bison player in the SF4 days and tbh it might be time to go back to tha old me",
            "We don't know yet about Dictator's story mode, but I'm pretty sure he wants to get his old power and prestige back (we always saw him as the ruler of Shadaloo, so it's the first time he's in a more \"underdog\" role).\n\nAnd that REALLY aligns with his more \"aggressive\" gameplay in SF 6. I personally REALLY enjoy that \"storyline - gameplay integration\".\n\nFor the same reason, I think that having the manipulative JP as a zoner fits his personality like a glove.",
            "He's gonna be scary when he comes out, but I don't think he'll be the next Akuma or Rashid.  All of his non-EX specials seem punishable on block?  And no EX DP of course.  But he does have great walkspeed and what look like some great normals too, including a cancelable low forward.",
            ">Shadow Rise and it's follow-ups\n\nI realize this is an incredibly minor spelling mistake but it caught me off guard because these videos usually have pretty good production value",
            "I just love his cloak physics!",
            "For Bison mains, it's one of the most important days in their lives. But for him, it was Tuesday.",
            "At the end, Bison blocked Juri's forward HP (-4 on block) and responded with a level 3. Does this suggest his level 3 is a 4 framer? That seems unusually fast.",
            "Rad",
            "Why is there a duck saying \"cuack cuack\" at the end of OD Psycho Crusher?",
            "When does he drop?",
            "Is his drive rush as crazy as it looks!?",
            "He looks really good, but I think it was Max's preview that showed he really seemed to struggle against projectiles. That could be a hard limit on him as Ken, Guile, and Luke seem to still be dominant in the S2 meta so far. Deejay, Akuma, and Ryu are also of concern with their multi-hit projectiles.",
            "Those psycho mines look like a problem.",
            "His specials being unsafe is a bummer but eh gonna require to do more poking the get around those limitations.",
            "[deleted]",
            "So what are our impressions gang? Does he seem balanced? Overpowered? Too early to tell?",
            "he still lacks of antiair but he regained the speed lost in sfv and now has spammable psycho crusher that can be used even safe with OD... ranked would be a mess during first days",
            "I Think SFV bison is better than this one, kinda gives me that vibe.",
            "In Max’s bison preview last week it looked like regular psycho crusher lost to fireballs, now at least beats single hits",
            "*It's Chewsday Innit!?*",
            "Honda having a choice between a throw invincible reversal or a armored one would be interesting",
            "It looks like his L1 might not be invincible to throws (they only mention strikes in the video) so they probably made OD Shadow Rise invincible to throws to give him an additional option to beat throw loops other than backdash or drive reversal",
            "Why would Honda need that? It's supposed to be to stop throw loops. Honda has armor",
            "Why would they?  Honda doesn't sell DLC.  Only DLC characters get privileges.",
            "I know Bison has history struggled against zoners. His new crusher property may make up for that but we’ll have to see how callout-heavy it will be.",
            "At first sight I'd say Blanka would be ok vs him (great A.Air control and no fireball, doll setups and air ball to control space)    \nAnd on the other hand, Bison really seems to have a great kit vs Akuma, his Psycho Crusher seems ideal vs Akuma's air options (fireball, overhead and dive kick).  \nLet's see once he is fully released, but that's my initial thoughts",
            "Jamies projectile invuln move does so probably",
            "I really hope so! ",
            "It'll all depend on how easily he can set up his mines",
            "His non-EX are not plus, doesn't mean they're all punishable. He has multiple safe options on block but he probably needs to space most of them correctly, and for those that are unsafe their value change after he's used the mine. The Psycho mine seems like it's going to be pretty central to his pressure. \n\nHe's probably going to be a drive meter killer, and I'm sure there's going to be some nasty setups with \"I'm going to take 3 bars of drive gauge off of you if you block, and if you parry I get punish counter throw and psycho mine combo\".\n\nHis psycho mine to block pressure seems to be what AKI's poison is to combo conversion.",
            "From the preview videos by Rooflemonger his hk.Scissors is safe on block and maybe mk.Scissors as well, we have no idea how Bomb/Backfist will be on block, Devil's Reverse and Skull Diver are plus on block without meter.",
            "It is follow-ups",
            "In the future the word \"its\" won't exist anymore.  It's time may well have passed already.",
            "Interesting. I am sure I was taught at school to use \"it's\" for possessives too, in the same way you would for names, ie. this is Jane's car. Seems that's actually wrong. I've learned something new",
            "It didn't say punish counter, so I think it's more to show that it has invulnerability. ",
            "Now I can’t unhear the Donald (duck)",
            "June 26",
            "Yesterday",
            "Max also said that psycho crusher doesnt go through projectiles and that he has slow walkspeed, both of those things being wrong. \n\nHe might still struggle against projectiles even if crusher goes through. From what we've seen id be surprised if he was top tier. Seems depended on OD scissor kick for combos, so drive hungry. No reversal. His damage also seemed kinda low. Might be his strong normals and good pressure save him. He looks fun though, will def try him.",
            "Between 1-hit projectile invuln psycho crusher, fully projectile invuln OD crusher, and lvl2 super, it seems he should do fine against fireballs on paper. \n\n\nTraditionally, he's struggled against fireballs, but back then crusher wasn't projectile invulnerable. Also, lvl2 is a super now, not an ultra (charged by taking damage), and has a motion input instead of charge.\n\n\nWe'll see soon, I look forward to playing him!",
            "Bro pulled out the government name",
            "Always the latter duh. How could he be either of the former if no one has even really played him yet?",
            "He is not even out yet. How can anyone tell?",
            "his specials are unsafe,  so he def not OP",
            "Nerf Bison",
            "SFV bison was a menace.. Plus all day with Axe and ex scissor kicks.. Bomb detonation etc.",
            "It was the exact same in the preview lol. It hsasnt changed since then",
            "Max is a Shoto player, he barely touches charge bully characters like Bison, Balrog, Honda or Blanka.",
            "Max also said he has the slowest walkspeed in the game when it's on par with the fastest. I just think it's hard  to get proper info from the short previews these guys get.",
            "Ever since the first trailer released they showed regular psycho crusher beating single hit fireballs. Idk how Max missed that.",
            "Exactly. I think the wakeup dynamic could be quite interesting between these and drive reversal.",
            "He already does, it's vreversal",
            "Remove the armored one, a worthless move that should have been fireball invuln.",
            "I think it's just a case of the writer being too into Bison's character at the moment to differentiate between being only strike invul, or just flat out invul to anything not a projectile. Akuma's video did the same thing, it only mentioned strike invul but it was immune to throws as well.",
            "What??",
            "Armor doesn’t beat throw loops. If anything it encourages it",
            "U gotta do well in sf6 against zoners to be good. Shotos dominate ranked and tournaments and the other good characters also have fireballs.\n\nFun fact: every dlc character has a fireball in season 1",
            "The one time he didn't was in  Super 4 solely because of Ultra 2. The second he had it you basically couldn't throw fireballs. He did pretty decently against Guile in that version. Once they turned it into a charge input that matchup became much worse.\n\nHowever in this game with the new crusher and level 2 being similar to how it was in 4 he might do fine against them now.",
            "I currently play Honda, but am looking to make the switch to Bison. From the looks of it, Bison has better tools to deal with zoning.",
            ">his Psycho Crusher seems ideal vs Akuma's air options (fireball, overhead and dive kick).\n\nThey didn't really mention it in the video, but every single CPU footage I saw had Bisons just routinely anti-air with Psycho Crusher so I wonder if it has anti-air properties too.",
            "I still don't fully understand this. Isn't the apostrophe in it's in this case making it possessive? You would use it in \"Bison's follow-ups\"",
            "It works like \"yours\" or \"theirs\".",
            "Ultra 2 actually originally started out as a motion input and I believe it was Bison's best Ultra according to info I could find from back then. It was changed to a charge input for Arcade Edition primarily because it was way too easy for Bison to just dumpster you for trying to zone him.\n\nSo yeah, I think he'll be fine here.\n\nNote: For anyone who doesn't believe me, boot up SF4 and set Bison to Super edition. The command list will list it as a charge, but the move itself is actually a 236236KKK input.",
            "He said Bison's backwalk speed was the slowest, but his forward walk was (almost) as fast as Akuma's",
            "he probably is doing them too late, Psycho Crusher's startup frames may not have the invul, you have to be into it like Honda's Super from Super Turbo, you have to be flying",
            "Except it’s an armored reversal that beats fireballs. It has a job and it does it well",
            "Re read",
            "It beats normals which are part of the mixup.",
            "My poor manon",
            "Well, Season 2 is guaranteed to at least have 2",
            "They definitely seem to want fireballs to stay strong, which is why they nerfed Cammy's spin knuckle's fireball invul frames to be in line with other similar moves instead of buffing those.\n\nAs I've become an AKI player in season 2, with her slowest fireball animation these fullscreen fireball punishes scare me. I need to get good at using the EX slither follow-up.",
            "> Shotos dominate ranked and tournaments and the other good characters also have fireballs.\n\nIn S1 pretty much since they're the easiest to master.\n\nS2 seems much more leaning towards long (and disjointed) pokes being the meta, and fireball is pretty much a non factor now. \n\nSo as long as he can handle that, he'll be fine.",
            "For words that end in s, you put the apostrophe at the end.\n\nBut \"its\" already implies the possessive and is a unique case, likely due to the contraction \"it's\".\n\nThe baby and its mother. The tree and its seeds. Not the baby and its' mother, or the tree and its' seeds.\n\nSimilar to his, hers, and their. The possession is baked into the word.\n\nThat move is Tom's favorite, all he does is sweep in the corner.\n\nLars' fireball game is weak. He really needs to work on his execution.",
            "In which case it is a contraction. Bison his.\n\nHowever, in the example here it's makes no sense as its not a contraction. It isn't short for anything. If do go by that logic, the non contracted version would be\n\nIt has follow-ups.\n\nOr\n\nIt is follow-ups.",
            "You really never learned the difference between its and it's?",
            "Yeah this makes sense. The guide states that he can beat fireballs while he's moving forward, which to me means the move not having invul or protection against fireballs on startup.",
            "Yeah cus it so effective that Honda cannot even make it out of pools. It doesn't do jack and doesn't flow with Honda's kit.  Guessing in neutral with EX headbutt is a losing strategy. Even the best Honda player \"Curryman\" never does EX headbutt, even during pressure.",
            "Armor stops throws?",
            "“Armor beats throw mixups”…it literally gets stuffed by throws. Saying it’s an option to help with mixups in general is wayy different than saying “it beats throw mixups” lol",
            "Yeah and it would be cool if Honda could choose between beating buttons vs throws",
            "all I was thinking while reading the thread, not even a good tool against projectiles meanwhile bison punishes you fullscreen with a super",
            "Ex slither is nasty. Ive had people try to di my fireball and i ex slide out and can still get a punish counter.",
            "Stops throw mixups as in you have a reversal with armor. Beats jabs. You have something. Armor, or some invul",
            "I said it beats throw MIXUPS meaning the MIX behind people getting this looped is normal or throw. He has an armored reversal to beat part of the mix. Bison does not have armor but he has throw invul meaning he can beat a throw mix with it.",
            "That would make no sense",
            "See, I need to do that. I've only been playing AKI for a few days to get her nice and cozy with my other hardstuck characters in mid diamond where people absolutely love to DI her fireball.\n\nI keep forgetting about moves she has because she just has so many interesting utility moves. I haven't used the L snake step either after they changed it, and I constantly forget that she actually has grounded HP buttons for poke.",
            "Armor beats throw mixups because it beats strikes?\n\nwhat are you on about?",
            "You know the original post was abt the throw loops. Not the mix up. You know what a loop is right. It dosent involve any strikes just throwing on wake so any non throw invulnerable attack is getting stuffed",
            "Again, I said honda has his own reversal to escape throw mix. This is bisons. Itz that simple.",
            "To give this guy the benefit of the doubt, there are people who will do wake up 2mk or wake up sweep in order to interact with the shimmy. If this is the case, that means mixing a meaty strike in your throw loop will yield a higher punish combo. \n\nThat being said, it's a bad gamble and you're now letting your loop lose to blocking. And half the point is that throw loops are oppressive oki that beats blocking.",
            "Alright, then I say that you are wrong",
            "Then you don't know what your talking about."
        ]
    },
    "Buckler's Boot Camp - Posted every wednesday for questions and training": {
        "title": "Buckler's Boot Camp - Posted every wednesday for questions and training",
        "score": 7,
        "url": "https://www.reddit.com/r/StreetFighter/comments/1djilge/bucklers_boot_camp_posted_every_wednesday_for/",
        "content": "**This post is to provide a place for everyone to ask simple questions and chat about anything reasonably on topic.**\n**If someone posts something worthy of their own thread, let them know! Like wise, if a thread is personal or answered in the FAQ elsewhere on the subreddit, point them here!**\n\n[](#break)\n\n| **PLEASE READ!** | ☚☚☚|\n| ---------------------- | -------------------------------------------------------------- |\n| Got a question?  | This is the place! Ask anything you like!\n| Just wanna get something off your chest? | Have at it!\n| Want to help? | 1. Help other players with their questions  |\n|| 2. [Apply for mod status on any of our projects](https://docs.google.com/forms/d/e/1FAIpQLScT3DXcd1hoFdTSTDfxwIAZtZia4GMNbMgOQZcOjLWeZOGHAw/viewform)|\n|| 3. Request wiki edit powers! /r/streetfighter/wiki|\n[](#break)\n---\n*If you didn't get a response in the last thread before the new one was made, feel free to post again!*\n\n---\n\n\n---\n[](#break)\n#FAQ:\n|/r/STREETFIGHTER FAQ ||\n| -- | --- |\n|**Beginning**| |\n|👊||\n|Who do you want to see in season 3?|[Most recent thread](https://www.reddit.com/r/StreetFighter/comments/1dcom6w/my_year_3_wishlist/)\n|Who do you NOT want to see in season 3?|[Most recent thread](https://www.reddit.com/r/StreetFighter/comments/1ddmxbh/hot_take_no_more_new_characters_for_sf6/)\n|--|---\n| Who should I start with?  | [Ongoing reddit thread](https://www.reddit.com/r/StreetFighter/comments/15d4cg8/make_your_pitch_why_should_people_main_your/) |\n| Where can I find a basic overview of each character? | [SF6 Universe Android and iOS](https://play.google.com/store/apps/details?id=fr.karucode.sf6universe&hl=en_US), [Supercombo.gg](https://wiki.supercombo.gg/w/Street_Fighter_6) |\n| What does _____ mean? Is there a glossary?| [The latest glossary thread](https://www.reddit.com/r/StreetFighter/comments/13xguzw/street_fighter_glossary_the_wordsphrases_you_need/), [iPlayWinner General Glossary](http://iplaywinner.com/glossary/), [Infil's glossary](https://glossary.infil.net/) |\n| Tips for Story Mode | [Ongoing reddit thread](https://redd.it/1csk29u)\n|**Training**| |\n|👊||\n| How can I fight people of my skill level?| [Ranked and battle hub tips](https://redd.it/1d1ii4n)\n| Where can I find character combos / bread-n-butters? | https://combotier.com/ |\n| How can I stop being bad? | [For the new players struggling...](https://www.reddit.com/r/StreetFighter/comments/1440dm1/for_the_new_players_struggling_to_learn_classic/) |\n| What are footsies?  | [Footsie handbook](http://sonichurricane.com/?page_id=1702), [Juicebox's explanation of footsies](https://www.youtube.com/watch?v=FQQCan5oo90), [RPS footsies in SF6](https://www.reddit.com/r/StreetFighter/comments/14taq7a/a_relatively_basic_look_at_footsies_and_how_they/)|\n| How can I improve my execution? | |\n| What are 'advanced techniques'? | (some of these are old) [Option selects](http://www.youtube.com/watch?v=aHHoGHcgK9k), [hit confirms](http://www.youtube.com/watch?v=eDMboPnznJc), [negative edge and input shortcuts](http://www.youtube.com/watch?v=_laZyBnClDQ), [input buffering](http://www.youtube.com/watch?v=SbhlZUPFxII), [tiger knee motion and kara cancel](http://www.youtube.com/watch?v=1rGjrBLHumk), [plinking](http://www.youtube.com/watch?v=PfP3oj_8oXM), [pianoing](http://www.youtube.com/watch?v=bmx_mnW9h-Q), [sliding](http://www.youtube.com/watch?v=x6RhIUyEuws), [double tapping](http://www.youtube.com/watch?v=yulm5TFOmRU), [links and frame data](https://www.reddit.com/r/SF4/comments/28li8f/how_do_i_use_frame_data_to_know_what_combos_into/), [safe jumps](https://www.youtube.com/watch?v=XqpiyuwRstw) |\n|**Participating**| |\n|👊||\n| What controller should I get?  | Check out /r/fightsticks, they're more than just fightsticks |\n| Where is everyone posting Avatar codes to copy? | Check out /r/SF6Avatars |\n| Where can I find replays of good players?| [replay theatre](https://replaytheater.app/?game=sf6), [High level replays](https://www.youtube.com/@SF6HighLevelReplays/playlists), or more specific yts like [Guile's Garden](https://www.youtube.com/@GuilesGarden/playlists) |\n| Where can I find good shows? When are they on? ||\n| Where are other fighting game communities?  |[fgc.network](https://fgc.network) and [mstdn.games](https://mstdn.games) twitter alternatives\n| |[supercombo.gg](https://supercombo.gg) wiki-like\n| |[discord list](/r/streetfighter/wiki/discords)\n| |[reddit list](/r/streetfighter/wiki/subreddits)\n| |[Newbie fight club](https://www.reddit.com/r/StreetFighter/comments/14ffkdc/new_to_sf6_and_not_sure_how_to_improve_join_us/)\n| |[Faulty Hands fight club](https://www.reddit.com/r/StreetFighter/comments/14bafxp/faultyhands_club_for_people_with_limited_motor/) For people with limited motor skills\n| How can I get critique on my replays? | You can post here, or make your own thread. Up to you!\n| What is the current version of the game? | The current version is ~~Street Fighter V: Champion Edition~~ **Street Fighter 6**\n\n---\n[subreddit overview: the rules and my perspective on modding](https://www.reddit.com/r/StreetFighter/comments/1bivijx/subreddit_overview_the_rules_and_my_perspective/)",
        "num_comments": 86,
        "comments": [
            "Why is https://combotier.com/sf6 linked as combo site, when it seems that it stopped updating after Aki release?\n\nIt's also just bad.",
            "What is the point of Akuma’s backwards teleport in this game? It’s not invincible to anything, it doesn’t have the grab, and it’s too slow to be used as a shimmy. It feels like it was just put in there for legacy’s sake",
            "What the frick do people do who have more than 33% time spend in training room?",
            "Question regarding available moves when using modern controls. Practicing with Dee Jay and during the in game guides it displayed a combo, 236+B, to do a different version of the Rolling Sabat that has two kicks. \n\nThis isn't documented anywhere in the Modern command list that I see. Are there other classic inputs that I can use in Modern? Just curious if there's a list somewhere of if this is a strange one off with Dee Jay.\n\nAaaand, I kept searching after asking and found my answer here. Has the full modern list with some moves that aren't in the game command list, https://streetfighter.fandom.com/wiki/List_of_moves_in_Street_Fighter_6#Dee_Jay\n\nThanks!",
            "Just started playing SF6, rank low silver.\n\n1. How do you incorporate Ken's Jinrai kick?  Do you use it first or cancel from cr.mk?  If I land the first hit and land the crouch second hit, it feels awkward afterward since it's not a combo.  I usually  do medium low kick for continued harass and repeat.\n2. What's his bread-n-butter combo?  I do JHP/HK + std HP + spin kick + shoryuken which does just under 3000.  In some video I saw a longer one that was still safe and reliably able to pull off.\n3. What are his standard dash combos?\n4. In this game, if you're crouch spamming LP on the opponent's wake-up and the enemy is looking to grab you, who wins?  Who wins if flipped?  The wake-up spamming LP or the standing opponent looking to grab?\n5. I use Ken's cr.mk a lot.  It reaches long and isn't punishable and you can cancel into movesets.  I use that to poke a lot or break rhythm.  How do other Ken players poke around using what?",
            "so Punish Counters is where you attack someone during the recovery of their attacks, but ive seen punish counters in other situations like when someone wakes up and mashes and loses to meaty command grab, I was wondering what other situation will give punish counters",
            "Which setting should I have my battle BGM set to as to hear my playlist?",
            "weird question but I'm struggling with light buttons/strings/combos, not with the execution but I just dont know when to use them, I pretty much always use my 6f crouching strong/low forward as my bread and butter, I have a hard time identifying when I should be using light inputs over medium inputs, I mostly use jab to call out fake pressure mostly and that's about it",
            "kinda new to fight gaming meta so bear with me. when I have oki, I usually alternate between throw, meaty button (cr. HP, cr. MP, etc.) and block.\n\nbut it feels like my opponent knows which option I'm going to take every time. any ways of like, masking it? making it appear more ambiguous?\n\nI'm eating way too many EX DPs attempting to throw/meaty on their wakeup, so I go for the dash-up block, but then they throw me! it's like they're in my head lol",
            "If I like playing Juri and Akuma, what others would y'all recommend based off that? (No to Marissa, Blanka, and Honda, and Sim)",
            "Growing so tired of fighting people in ranked that are “new challenger” but are godlike. Like taking half your health bar in one combo if you make one whiff type of player. I’m in silver rank maybe I just suck but there are a lot of expert level players in the lowest rank and its just not fun, it defeats the purpose of ranked",
            "Maybe an obvious question since I've been playing this game for a year, but is it a thing for people to mess up your parry timing by drive rushing after a fireball?\n\nLike imagine Ken at range starts firing off hadokens and you just sit back and parry them in sequence with quick taps, until he triggers DR at the moment when you're supposed to do the parry input, resulting in the input being too early or eaten and the fireball landing (followed by a combo). Do people do this?",
            "Any tips on doing the Zangief lvl 2 --> 3MP --> OD SPD? For OD SPD, I did lower half circle, then hold the up and press the punch button. I still miss the OD SPD sometimes, usually whiff in the air. Is it possible that I am too far from the target after 3MP (I usually just walk towards the airborne target after lvl2, so my position of doing 3MP is not consistent )? Or the whiff happens because I release too late?",
            "I noticed that you can only cancel a Drive Rush into block after 24 frames. Does that mean that if I react to Drive Rush with Invincible Reversal, I just win every time?\n\nAs the attacker, is there a way to mix this up? I feel like this makes Drive Rush on wakeup pretty much useless, yet I see high level players do it all the time.",
            "How many extra frames does drive rush cancel give you? Does it work like raw drive rush where it's whatever move you did on hit/on block+4?",
            "Is Akuma's divekick plus on block? (specifically the command normal one) super-combo doesn't say.",
            "Does Ed being a boxer kill any chance of Dudley being released someday? Dudley is all I really want in this game",
            "How on earth do you play with the 4 face button PS5 pad?? Just started playing recently and I'm kinda at my wits end already. \n\nThe last controller I played on was a 6 face button madcatz fightpad, on xbox360. I'm having a really hard time getting all the multi press button combos - PP, PPP, etc. The default setup has drive rush/parry on the left shoulders, which I used to use for the 3p/3k setup. Then the DPAD... omg, the buttons are SO rigid, missing inputs and constantly hitting the create button. \n\nThere doesn't seem to be many ps5 options akin to those old madcatz pads, so thought I'd try and get with the times...seeing people use the stock ps5 controllers online. But... oof... my brain is having a hard time translating the finger gymnastics.... \n\nSticks are kinda out of price range for me right now.\n\n pls send halp U\\_U",
            "Hey I just have a general question and I hope it's okay to ask this here: was Kolin particularly popular / liked in SFV? I kinda stopped watching tournaments before she came out but I thought she looked cool. I was kind of hoping there would be a decent chance she'd come back for 6 now that I'm actually playing the game, haha.",
            "So im a new player and i've been using classic controls as i thought it might serve me better in the long run. am i stupid? it seems that players using modern controls are at a significant advantage in lower ranks?",
            "I'm struggling to link the crouching heavy punch after the crouching medium punch on Juri's intermediate combo trial 12. I get it a few times in a row and then I struggle a few times in a row. Is the best method to link hits together to try and wait and time it or is it better to mash? It feels so inconsistent for no reason no matter what I do, and this extends to other characters and other chains of attacks",
            "Is there anyway to turn off the battle pass level up rewards and unclaimed item notifications? I never use battlehub and don't care about avatar cosmetics, just wanted to get us much junk off my screen as possible",
            "that's a shame. I thought it was going to be something good over time.",
            "yeah pretty much. if you're trying to keep your distance you could use it after a fireball or something. there's actually a tourney clip on the front page rn of an akuma using it to create space.",
            "Basically just for stalling imo. If you need to recover some drive gauge or you're going for a timeout win.",
            "A lot of time people just have training mode running in the background while doing something else, and many people spend a lot of time running through combo routes",
            "That's me. I love labbing. About 45% of my game time is spent in the lab (138 hours). Sometimes, I love labbing more than actually playing the game itself. \n\nI actually think that how much fun I have labbing gets in the way of me getting better sometimes. I'll spend three hours figuring out an insanely niche setup or practicing a combo that's executionally difficult, only good if I have 2 bars of super, have full resources, land a stun, and need to build enough meter to get me level 3 to kill (otherwise it's worse than a BnB).\n\nIf I spent more time labbing common situations more I think I'd actually get better much more efficiently. But this kind of weird stuff is part of the reason why I love FGs. I also post a lot of the tech I find. It's nice to know I'm contributing to the knowledge to my characters' communities.",
            "yep just in case that link doesn't fully clarify, most characters can do the regular motions for any special move in order to choose the strength.  doing supers with the motion like this instead of the shortcut will also deal full damage, using the modern shortcuts results in I think like 20% less damage or something.",
            "1. It's good in both scenarios (also canceled from st.HP too) - L/M Jinrai's first hit are both punishable, but pretty hard for the opponent to punish you if you use it at the tip distance. The primary use is to go between the low followup, the overhead followup, and no followup and make the opponent guess which one you're going to do.\n\n2. I think you don't really need to optimize combos at Silver, but if you're interested in learning more damaging ones, you should look into the ones that use the run-enhanced specials. Here's one that might take some practice: cr.LP st.MP HP target combo, cancel into run, run-enhanced dragonlash, shoryuken.\n\n3. Same as above.\n\n4. It depends. Even if you're spamming cr.LP on the opponent's wakeup, if your timing is off, you can still get grabbed. If your timing is right, you won't get grabbed. It's why spamming generally here isn't a great idea, because you're basically leaving it to luck. If you want to practice the timing, go to training mode, set the dummy to throw on wakeup, knock them down, and then walk up and try to time your cr.LP right as they wake up. If you get it right, you'll hit them, and the little \"Counter Hit\" popup will show up. Big tip - try to land this cr.LP at the right timing and go into the combo I mentioned in \\#2.\n\n5. cr.MK is the primary one. st.HP is great too. st.HK has good range but isn't special cancellable. Make sure to just use that one at the tip range.",
            "In the situation you're describing on wakeup, that's very likely the same one as you're describing to start with. Someone mashes on wakeup, they whiff, and their extended hurtbox gets grabbed during recovery. If the command grab had interrupted the mashing, that would cause a Counter Hit instead.\n\nThe other time a Punish Counter happens is sort of an extension of the same concept. If there's an attack that is reasonably disadvantageous on block (eg. an invincible reversal) and it gets blocked, hitting the opponent after causes a Punish Counter. The reason why that is is because you're hitting them while they're still in the recovery of their attack and they aren't actionable/can't block yet.",
            "All the playlists are by character, so either your character or opponent's character (just not stage theme).\n\nThey give you the option to copy a playlist to all characters if you don't care about having character-specific playlists.",
            "The easiest way to think about when to use buttons that don't seem as useful is going to be where every frame matters. So after safe jumps, meatys after specific kinds of knockdowns, and very specific punishable situations like when the opponent is -4 or -5 on block. Those situations are when you can guarantee you're doing x move on the exact frame you need and it *must* be that specific move.\n\nThe harder way is during footsies, that requires training against specific moves and one button or another will be the best choice for each situation that arises.",
            ">mostly use jab to call out fake pressure mostly\n\nGood use. I also have a number of knockdowns where I can frame kill with a dash and then meaty with lights. If you want to wake up mashing, wake up light attack is usually the one you want to go for.\n\nLights are also a good way to take your turn back/continue pressure during low frame advantage situations, like if you're only +1 or +2. For example with Juri's st.MP, you're +2 so realistically you probably shouldn't push cr.MK after and should stick to cr.LK or cr.LP.",
            "other commenters have covered a lot, I would just add that they're also a good option when it's your turn but your opponent is in your face. doing a low forward or crouch fierce will get you counterhit if they jab, but if you just throw out 3 jabs the second or third jab will counterhit if they try to press.",
            "so you're actually doing two options that both lose to the same option select, and it's by far the most popular option for wake up defense. your opponents are probably delay teching — they block for a couple frames on wakeup and then tech. this way they block meaties and break throws, and the tech is pressed during block stun so it doesn't come out if you meaty. \n\n\nas the other commenter mentioned, you beat this with shimmy. walk up like you're going to meaty or throw and then walk back out of throw range right before they get up. this beats reversal since you'll be blocking, and if they're autopiloting their delay tech you can punish their whiffed throw on reaction with a medium very easily, or if you want to full send you can just delay a heavy to catch the throw whiff. \n\n\nthis is the same idea as what you've been doing to bait reversals — walk up and block — except by doing it out of throw range you won't get thrown when they delay tech.",
            "You gotta play your oki's more patiently then, try to practice 'shimming' your opponent, just go back and forward, just walking.\n\nTo practice this go to training mode and do a shimmy with the dummy and mix a throw, a meaty, shimmy into grab, shimmy into hit, you get me",
            "Ken or DeeJay if you don't mind learning charge could be good fits. all four of these characters are some balance of midrange to offensive depending on your particular style, with a rounded enough kit that you can play them lots of different ways.",
            "Those are both shoto-esque characters. All of the other shotos will probably feel quite similar to you - Ryu/Ken/Luke.\n\nNot sure if you're looking for someone with a more drastically different game plan though.",
            "how often are you running into this? with all the changes they've made to how placement matches work I'm surprised you're having this problem. those people should be ranking up fast and getting out of your matchmaking pool before you queue into them again unless you're in a small region or something.",
            "I know someone who is like this. They never play Ranked so their rank is always \"New Challenger.\" Yet, their Rashid feels like they should MR1600ish, maybe 1700.\n\nThese folks might spend a lot more time in either Casual Matches or the Battle Hub.\n\nHowever, if you're running into these folks in Ranked, then they could be running their placement matches. More than likely, you won't run into them again if they placed much higher. Some folks like to spend some quality time in the Lab, mastering their combos and gimmicks, before doing their placements.",
            "I'm not sure this is entirely purposeful since you can still press and hold the parry and it'll come out immediately after the drive rush flash.\n\nIf it happens it's probably more luck/timing because DR-ing after a fireball is a very standard and powerful pressure sequence regardless.",
            "There’s a tech where if you perfect parry a fireball, you can cancel it into a drive rush to punish if you are close enough. People buffer this by doing double forward during the parry input. This is so you cancel if you do PP you cancel it and if you regular parry it, nothing happens. \n\nWhat you’re describing sounds like a botched attempt at this, with people doing the dash input too early",
            "If it’s a spacing problem, add a dash before the 3mp to keep it consistent",
            ">Does that mean that if I react to Drive Rush with Invincible Reversal, I just win every time?\n\nIf there is a gap to interrupt (ie. if it's raw drive rush from close up or a drive rush cancel that isn't a true blockstring), yes, you will win every time. Haven't tested this with every single invincible reversal but I'm almost certain every one should work, even the slower ones (like Ed's).\n\nIn fact, you usually _should_ always attempt the invincible reversal if you're able to react in time, which will force opponents to do true blockstrings on you, which are usually weaker pressure-wise than ones with gaps.",
            "I'm not too sure of the in-depth frame data around this, but it generally works like this:\n\n  \nIf you use a heavy button canceled into a drive rush, you are plus enough that your next attack is a true blockstring, and your opponent cant reversal.\n\n  \nIf you use a medium button canceled into drive rush, you WILL lose every time to a reversal unless you do a light button, like a jab.\n\nMany people auto-pilot into doing mediums canceled intro DR mediums, but that's comepletely fake and is something even high level players don't realize. Whenever you see someone constantly doing that, start using reversals (i think they have to be 7-frame reversals, not really sure on that).",
            "You're being a bit imprecise with your wording so I'm not entirely clear what you're asking here, but the way I'm interpreting this is \"if I do a normal, drive rush cancel into a second normal, how many extra frames on block or hit does the second normal get?\"\n\nAnd in that case, yes, it's still +4 frames for both.",
            "Divekicks generally have variable frame data, because recovery is fixed, but starts earlier if they connect high on an opponent. Generally, a divekick is plus when it hits the knees or lower. ",
            "it depends on the height he hits you. it can be minus if he hits you on your head, plus if he hits your toes.",
            "idk man Capcom has no rhyme or reason for dlc characters. I'd say it's an even 50/50 they either do or they don't",
            "Boxer is not a archetype. Ed and Dudley play completely differently and their similarities are almost entirely visual. So, Capcom has no reason to exclude Dudley because of Ed",
            "I don't use a PS5 pad, and my controller technically has 6 face buttons, but I only use 4 of them because I learned to play on a 360 pad. \n\nI have HP/HK on the right shoulder buttons.  For a PP input I just press MP+HP, thumb and index finger.    Parry and Drive Rush I just do manually, mp+mk.\n\nI think doing it like this is better than binding 3p or something, because characters can have varying strengths of EX moves with LP+HP, LP+MP, MP+HP.",
            "First season had Rashid, Ed, and FANG.  This season has Elena and two KOF characters.  The character choices for DLC have been wild.  Anything is possible and at this point I'd say its impossible to predict what characters will be in future seasons.",
            "She was not particularly popular. Imho, she looks a bit generic, save for the ice skating. If you want to see high level play, search for Kawano, he was very successful with her in tournaments.",
            "It'll take a bit longer to pick up on classic controls, you're doing fine. Don't let the frustration get to you.",
            "they are at an advantage, but that disappears if they decide they want to switch to classic at any point in the future. modern also gets you in some bad habits — modern players at my rank  typically have much worse offense compared to my classic opponents. the nearly guaranteed anti-airs and automatic light whiff punishing are insanely good when you're new, but they become crutches in the long run.\n\n\nobviously any player that recognizes this can work to improve, modern or classic, I'm just sharing the general trends I observe.",
            "In the lower ranks, yes, playing Modern is an advantage. This advantage quickly goes away as you go up the ranks and people get better with their execution and knowledge.\n\nYou're right that playing Classic is usually more optimal, but you can get very very high up in the rankings with Modern. If your goal is simply to reach Master (or hell, even 2000 MR Master), it's 100% doable on Modern and what will hold you back isn't the control style or your character, it's your own skill.",
            "I always try to mash first. If mashing isn't working, learn the actual timing and try to single tap or double tap if necessary.\n\nIf the attack doesn't come out at all, you were too early. If it comes out but doesn't combo, you were too late.",
            "In my experience, links work nicely when I press the button as I see the previous attack hit.",
            "same thing happens after the qcf medium kick part of the combo. sometimes I hit it after the heavy punch, other times nothing happens. and after the qcf medium kick the forward medium punch gets blocked sometimes and sometimes it doesn't even when it feels like I change nothing",
            "Thanks.  On your #2 dash special, crLP stMP HP target combo ---> what does target combo mean?  CAncel into run means forward forward or Ken's unique KK dash?",
            "Thanks.  What's Ken's optimal wake-up rush-down routine?  When the enemy's about to get up...\n\n1. I can either grab.  The best is to just grab while standing with a good timing right?  Or I can jump and land just before to grab to confuse SamShoII style.\n\n2. I can do a JHP/JHK and go from there (grab or punish).\n\n3. I can DI, but he can grab.  So mix it up with 1 or 2.\n\n4. cr.MK and go from there.\n\nIs there a way to punish enemy cr block besides me grab/jump?  Is there a standing crush move by Ken? I can only think of the Jinrai follow-up medium kick which is very slow (it's on second hit).",
            "https://youtu.be/Z31BNyzbhns?si=w7TqRJ6tjl3_wcHM  \n\n0:12\n\nthere is no whiffing from akuma's part and yet it's still a punish counter",
            "I'm usually +10 (or more) on block after a safe jump so I never use a light input in that situation, meatys I know for the 3 characters I've learned (Ed, Akuma, Ken) also end with a medium even if a light is often used as frame kill\n\nbut I see what youre saying with the tight punish situation that require 4 framers, and I think that's the biggest weakness in my play, I have a hard time taking back my turn against characters im less familiar with and im sure there's a bunch of fake pressure that I could be punishing with 4 framers but im too scared to do so because I dont know where in the string exactly I should be acting, this is a lot of knowledge to build over time\n\nthank you for your answer!",
            "yeah makes sense, I think it's the the nitty gritty of -1 to -4 on block buttons/sequences but then they keep attacking and you cant really tell if you can punish or not unless you have that knowledge, guess I just gotta keep grinding, it's especially annoying for lower pick rate characters like kimberley, aki and rashid, the last 2 are gaining popularity so I hope I see more of them but MUs are hard when you dont know much about the opposing character\n\nedit: add jamie to that list",
            "I’d say 25 percent of the time. Like every 3rd or 4th new challenger will be someone who has the characters entire kit memorized. I know I must play ppl better than me to improve but this is too big of a gulf in quality it’s not even fun. Also I only play late at night",
            "I'm guessing that people get away with \"fake\" DR combos because it's hard to react. Like, DI is 26 frames and I still have trouble countering DI sometimes; most DR combos are less than 26 frames.\n\nOn the other hand, it would be interesting to see a bot that is programmed to reversal every fake DR attempt. Even high level players might struggle against it.",
            "It's really a guess like a throw. Reversal is a high risk reward option. Reversal once and you'll probably be successful. Then the player can bait the reversal for next time.\n\n\nSecond part is a bit execution heavy as dp requires hitting forward quick enough during the string when you think they're going for a medium. Needs to be a big button to be able to react correctly",
            "ok cool ty, that was my question",
            "Boxer is used fairly often as an archetype, but there’s no reason there can’t be more than one.  Ed isn’t really the typical boxer anyway",
            "thanks brother ",
            "ok thanks!",
            "yup, no doubt that my skill is not good enough! \n\ni made the post out of frustration lol. ",
            "So there's st.MP, and then there's st.HP, which are both separate moves. There's another one where if you do st.MP and then HP immediately after, you get a different move that isn't st.HP, it's a second gut punch-looking attack. If you've ever played Mortal Kombat or Tekken, they refer to these as \"strings\" in those games.\n\nCancel into run means Ken's unique KK dash.\n\nSo the inputs would be (in numpad notation):\n\n2LP 5MP 5HP KK 623K 623P",
            "Knockdowns are all actually quite specific in this game - there's no \"go to\" sequence because the distance between you and your opponent and also the amount of \"time\" you have to do stuff before your opponent gets up is different depending on how your opponent got knocked down. \n\nFor example, the knockdown from a back throw is very different from the knockdown when you successfully anti-air someone with a DP.\n\nBut you have the general basic ideas down - you usually want to do a throw, which will force people to start throw teching/jumping/backdash on wakeup, and when they do, you can use a strike instead that will counter-hit them when they try to throw/jump/backdash.\n\nOr perhaps they'll try to use an invincible attack on wakeup like an OD DP or a super or a drive reversal. In that case, you want to walk up as close as you can to fake them out, and then block.\n\n>Is there a way to punish enemy cr block besides me grab/jump?\n\nThere's some setups that will let you get Ken's run-overhead (KK into MK) right as the opponent wakes up, but I'm not actually a Ken player so I don't know when you can and can't do that. You're right that Jinrai MK is not really the way to go on opponent's wakeup.",
            "Ah, that's not because Akuma was mashing - he was trying to fish for a parry.\n\nGood reminder, that's also a time when punish counters happen - when you throw parrying opponents.",
            "For sure. In my notes for matchups for specific characters I have noted down which moves are slightly negative so I can remember that's when I need to take my turn back with 2LP or potentially regular throw if they're close enough. It's just a knowledge thing you'll build up over time.",
            "did you check profile? How many hours they have? perhaps they play on battlehub",
            "If you watch high level Modern players, you'll see it a fair bit more often than Classic players due to the ability to react faster.",
            "Thanks! That last DP has a hard time connecting.  So between 623K and 623P, there are no other buttons required?  Does 623P have to be OD to connect?\n\nAlso I'm not seeing too much value in some of these combos because the damage doesn't keep up with the much easier HP or a simple LP (or both) + L tatsumaki + L/OD shoryuken.  With the jump HP/HK, this 'ez' chain does 2930 damage.  No dash or KKs required...  even crmk, if I dash in, I can just do the same HP + Ltatsu + shoryu which are deadly.",
            "ahh makes sense, thanks!",
            "what's your go to resource to check frame data? I might start checking and noting stuff down too",
            "No other buttons. https://streamable.com/t1sf3r Recorded this with inputs on in case it might help.\n\nThe big thing is that it starts with a cr.LP, which is an extremely fast button. Being fast means that the likelihood it hits is higher. It also uses zero meter. As you get better, being smart about your meter use becomes more and more important. If you don't spend it on the combo it means you can spend it on other things like parry or drive impact or drive rush.\n\nOf course, if you're able to hit with a slower, harder hitting button, you want to start your combo that way. But the better you get, the less chances your opponents will give you to use your big attacks compared to your small ones.",
            "https://wiki.supercombo.gg/w/Street_Fighter_6\n\nhttps://fullmeter.com/fatonline/#/framedata/SF6/A.K.I.\n\nhttps://ultimateframedata.com/sf6/\n\nAny of these. I'm partial to Supercombo.",
            "I'll try some more.   CrLP + light tatsu + shoryu is just too good and ez to do though.",
            "As I mentioned before, you really don't need to optimize your combos at this level. Try it more if you think it's fun, but realistically it won't make a huge difference in your gameplay compared to say, anti-airing more often or reacting to DI more often.",
            "Yup that sounds about right.  Some of the combo DMG difference was literally within 100 DMG."
        ]
    },
    "1HP clutch because Ryu is him": {
        "title": "1HP clutch because Ryu is him",
        "score": 709,
        "url": "https://v.redd.it/7n30ihw7b08d1",
        "content": "",
        "num_comments": 112,
        "comments": [
            "Silver rank players got bread and butter combos now? Streets are not safe",
            "\"That's why he's the GOAT! THE GOAT!\" - Cyclops",
            "Silver has combos now??",
            "I’m having a very hard time believing you’re silver rank. Call me crazy, but idk, doesn’t seem legit. Did you just pick up Ryu?",
            "Himberley",
            "Good shit, when I was Silver at launch I could barely string cMk > Hadouken",
            "silver players cooking like this now?? maybe i shouldn’t swap to AKI☹️😭",
            "Yo what was that made up combo IN SILVER.",
            "That guy ain't silver. And you know it.",
            "Found the smurf farming upvotes.",
            "Silver?! wtf bruv 😅",
            "I've seen this before. Being stuck in a rank or a long time, stopped playing ranked and did drills everyday for a month. In a month's time a silver guy can shoot up to diamond.",
            "Lol wow ur smurfing in silver congrats",
            "This is what silvers be doing these days?",
            "tf this is how silver plays now? haha",
            "It ain't over till it's over 💯💯💯",
            "That shit would low-key annoying me ngl. Victory was totally earned though 🤣",
            "Nice job!",
            "I am surprised there was no disconnect",
            "Did he kneed deejay? How come I've never seen ryu's ca before 😅",
            "Lol. And you in silver?! I’m in gold and can’t pull that combo off. Great comeback",
            "“Your range… is one fist short.”",
            "I’m gonna say he started with Ryu when SF6 first came out and got him to silver. Then he found his main and got most of his characters to Master. Now he’s back to Ryu.",
            "That's a really good combo for silver",
            "Dude, I'm on Diamond 3 and you just taught me a close to corner combo. 😂\n\nI normally avoid grounded OD Tatsu since I'm on modern and that move is always scaled but I can still do over 5k damage with this combo which is good. :)\n\nThanks!",
            " MF hits like a truck",
            "Man this is why the burnout system is just so based. I love how they managed to make the no chip thing from 5 a cool mechanic, if you manage your drive well its not over till its over",
            "Smurfs",
            "Deejay with a 60% life lead at 35 seconds and is still burning out and jumping in.",
            "You played clean, I'm surprised you ain't at least plat yet.",
            "for those wondering\n\n5510 without CH or CA\n\n5920 with both\n\nNot Ryu's best dump combo and the carry doesn't seem to be worth it, still a cool one",
            "Smurfs gonna smurf",
            "How does a silver player have better combos than me when im platinum",
            "Nice smurfing, what a clip to showcase ! Destroying a beginner, truly a progamer move",
            "Hol up....people in silver are busting out combos like that?!",
            "Lucky that jump in didn’t get punished but nice comeback.",
            "I'd be so pissed LOL",
            "My man used 5HP as a meaty… AND IT WORKED.",
            "Great combo dude!!",
            "Dunno why everyone says he is smurfing LMAO, there are tons of players who are back trying new characters and ranking them up. I just got Akuma in plat last week but was placed silver with him, and lemme tell you the climb to plat is not as easy as it was 8 months ago.",
            "Ignore the people saying your smurfing if you’re going through placements they never start you a tired rank. That combo was nice though I’m diamond and can’t do that I’ll have to steal it",
            "You ain’t kidding. Did my placements and figured I’d get silver cuz I know how to block. These guys are lab rats that turn any stray hit into a full combo. Problem is they don’t know how to stop so they always do something unsafe",
            "I was thinking this guy, and many, when they start they pick \"new at fighting games\" to be placed with low ranks, and sometimes purposely lose to be in silver and not gold.\n\nJust imo, because as I ranked up, some silver players are better than a lot of gold players",
            "In my experience rank tells you absolutely nothing about a player anymore. I have a Master and some high Diamonds, and no matter which character I use I still constantly lose to Platinums, Golds, and even Silvers. There are countless smurfs (both intentional and unintentional). You have people with Masters/Legends who create alt accounts and just keep themselves at a low rank to abuse others like assholes, or you have people that are far beyond their displayed rank in terms of skill, but just decided to stop ranking because of anxiety, self doubt, etc. Anyone can be anything now, and you’ll never really know until you fight them. I fought a Silver earlier who had like a 76% win rate with 1000+ matches…",
            "Tbh I don't understand how placements work, I fought a guy doing placement the other day who just picked up the game since they had 0 history, they kept jumping and I kept anti airing them and they lost, I checked back on them later and they were doing the same thing but they got put in diamond 1 (I was at plat 2, I think?)\n\nAnd then we have silver players out here with meaty st.hp (I think) into full conversion combo lmao",
            "sf6 combos are the easiest they've ever been",
            "I'm in D3 and I'd probably drop that lol. That's a cracking finish. Probably a smurf though.",
            "Doesn’t help that Ryu is damn near broken with his current damage scaling, lol…",
            "yea im plat ryu and my combos aren’t like that…",
            "judging by the title this guy is smurfing",
            "In casual, unranked new challenger plays like 1800MR…",
            "That was what I was thinking 😂…. I’ve been on a hiatus playing tekken. Going to jump back in for bison, and I was thinking “I’m in trouble”",
            "I was gonna say this guy aint a silver lmao",
            "I just started playing Ryu lol my highest rank character is like mid Platinum",
            "Literally was about to comment, damn silvers got the combos now a days",
            "I'm diamond 2 and I don't got that shit. I got hp dr, hk, hp dr, hp 4hp, heavy Donkey Kick light shoryu level 3. I haven't learned how to add hoshugeki damage in yet.",
            "Nothing particularly hard about that combo.",
            "Yea like a day or two ago. My highest rank is like mid plat",
            "Himothy",
            "This guy is not a Silver player, it's only his Ryu in Silver. How did he manage to only got placed in Silver is another question, might just be that he did practice nothing but high damage combos and negleting everything else.",
            "Yeah, golds have legit combos now. It's quite scary if you don't know any",
            "Nah, silvers aren't this good, this is what smurfing looks like.",
            "Smurfing? I just picked up this character like yesterday and am still learning him of course I’m gonna be low rank",
            "Yeah legit. I got platinum recently and I don't have combos anywhere near this, but just being happy to sit and wait for someone to make a mistake is enough to at least get you out of gold.",
            "People definitely do that, there’s no doubt in my mind.",
            "I personally picked new at fighting games because I hadn’t played since USF4 so wanted to get a better footing for the game. Naturally in the past month playing ranked casually I’ve jumped from Rookie to Gold. \n\nBut there were some questionable times where I’d see an AKI pull off the 70% combo off a stray hit and wonder should they really be in Iron?",
            "I don't know because if you know some basics you rank up pretty fast then once you have one character master you are always sure to be at least diamond for the rest of your life. \nMy take is people are way too focus on combos a low levels, i was amazed how silver guys can hit some advanced combos in low ranks",
            "Win rate is a better indicator of skill and especially win rate vs. your specific rank/MR, which afaik you can't see. I keep thinking they should add something like that and leave the ranked climb as a minigame for people who want to do it. A lot of good players never even touch ranked.\n\nMR is a decent system but it's only really accurate the farther you move from 1500, i.e. the more you play ranked, again.",
            "Man yesterday i played  15 games in casual against a juri ranked master 46k, i still can't believe how bad that player was.\n\nHe was doing literally the same things a gold player would: 2 flowchart aggressive sequences repeated over and over for all the games, whether i was punishing him for it or not didn't matter.",
            "The smurfs are running rampant right now. It’s a pretty big problem for Ranked, and I can’t think of any way Capcom could really address it either.",
            "Why you playing casual thats where all the casual only smurfs are",
            "It's not that it's hard, it's that nobody in silver uses DR anything, let alone multiple DR cancels into super.  I'm pretty sure you could pick up any new character, DR heavy anything as your sole offense starter and easily clear silver in a day. ",
            "if you're doing combos like that in silver it's because you're spending too much time learning combos instead of learning how to play the game",
            "So you're just bullying newbies and bragging on reddit. Gotcha.",
            "Himalayan",
            "I have an Ed in plat but I did this the other day with Kimberly.  I jumped in ranked after watching the in game character guide, 0 practice at all.  I got placed high silver and took a few days just learning in real matches",
            "I looked at ur match history you beat diamonds and and high plats  with Ryu. You obviously chose \"beginner\" and or threw your placement matches.",
            "I legit just started SF6 maybe two weeks ago. I play guile so I sorta naturally play a bit slower. That's almost my game plan to a tee lol. Throw out some safe/cancelable moves and chip them down. \n\nI'm absolutely not good at the game by any stretch of the imagination but I'm about to hit plat",
            "I played against an AKI in Iron climbing from Rookie (selected new to just get adjusted to SF6 after not playing since 4) and I whiffed a normal, they caught me with sHK and boop 70% of my health was gone. They defs shouldn’t have been in Iron if you ask me, their neutral was defs not Iron level, and just mechanically played really well.",
            "When in doubt just go look at their hours in the game, if its really low they created a new account. Using a character they probably spent hundreds of hours playing already. ",
            "Dude a legit Silver is not landing these combos.  Guys like this created new accounts using players they probably spent hundreds of hours playing. Just looking at their profile can tell you how manys hours they've played. Alot of hours they are killers with the character, low hours  they are killers with the character.",
            "I agree that it would be nice to have a more detailed stat screen, and also that MR is the best system in the game currently. But win rate can’t be fully trusted. The problem with win rate is that it can be heavily influenced/boosted if you only play matches against people that are clearly far below you in skill, and a lot of people absolutely abuse that. I myself will often times do Casual and go on a 10-20+ win streak against one person, which inflates my win rate. Sure, I technically *won*, but is that really a good indicator of my true rate when my opponent was a new/lower ranked player? Even then, there are people who go on those streaks and take it even a step further. They’ll simply one and done anyone that poses even a slight challenge, and over time it drastically boosts their %’s.",
            "Could it have been a bot?",
            "I mean if someone wants to spend $60 (or less if on sale) just to smurf for a few hours until they get out of low ranks, then let them waste their money. I really don’t think that many people are doing this.",
            "I sorta like all the Smurfs. I have this terrible semi comboless scrub style that’s sorta anti-smurf.",
            "A day?  20 minutes",
            "It’s not bullying if you get placed in silver and have to climb lol, not unrealistic for a plat player to get placed in silver on an unfamiliar character",
            "I mean. That dejay didn't seem silver either",
            "Lol Plat isn't high. Also, doesn't mean his skill level across all characters translate. I'm an upper Diamond Cammy, but my secondary Guile is definitely Gold.",
            "Placements put you way lower than your rank in my experience, I was diamond 1 with ken and they put my Ed in like gold 5 lmao",
            "I think if you allready have ranked matches, your placements are based on that.",
            "Just because someone is high rank doesn’t mean they’re good dude. I’ve perfected Master rank players on more than one occasion and I’ve never even hit diamond before. I got sliver 1 after placements because I didn’t know how to play him and lost most of them.",
            "Yup, I’ve been noticing it more and more. It seems like people are just straight abusing the ranking system. It’s been a thing since launch, but it seems like it’s gotten way, way worse since Akuma dropped. I would say maybe it’s just a coincidence, something like a bunch of Masters switching to new characters. But that can’t be the case. Once a player hits Master with one character, they can’t place below Diamond 1 when doing placements with another. So these have to be people who are making new accounts specifically to terrorize lower ranked players, which is just corny and pathetic.",
            "Yeah it does not make any sense IMO. I think smurfing is a real issue in games where there's a market for people to buy high rank accounts and/or f2p games",
            "Right, the win streak bonus really piles up 😂 ten or so opponents blocking with their face and you're gold 🥇",
            "Still a plat player, AND though that combo was ass, it's far beyond what silvers can do. That's a person who threw their placement matches.\n\nAnd what does he do, he puts it on Reddit as an epic comeback. Easily the most pathetic post I've seen here.",
            "I'm a master Manon and placed plat 5 day 1 with Ed. Fundamentals matter. This person threw their placement matches. Plat isn't high but fundamentals alone would put him mid golds with any character. And clearly knows combos even though it wasn't optimal.\n\nSilvers don't do drive rush into corner juggle into ca.",
            "Not necessarily. I hadn't played for months, my last character is Marisa diamond 1, just picked Ryu this week and the game felt I was diamond 3. Let me tell you, it's MUCH better when the game thinks you're worse than you are, compared to when it thinks you're better than you are. After 200 matches with an amazing 20% winrate I'm more or less where I feel like I should be (plat 4).",
            "My bad dude. i didn't mean to offend you. Should have known how sensitive you are considering you are smurfing in silver.",
            "Yeah seems strange to me since I would have assumed that many people would have the same goal of improving etc. I worried that some people would have felt that way about me playing but to be honest when I’d started again a month ago I didn’t even know how to drive rush so I guess it made sense. \n\nBut yeah I see people wanting to smurf in a fighting game and it’s like what for? It’s just cringe and not fun for either player I would have thought, but yeah if it’s a blatant skill gap that I don’t think I can learn anything from/someone trying to flex for the sake of it they’re usually one and dones for me. \n\nIf I wanted to watch a Rashid/AKI/Akuma/Ed do one of their massive combos I could just go to Twitter/YouTube.",
            "So do they re-buy the game on another account, or can you have multiple accounts on one license?",
            "oh please bro. just stop talking your whining is an actual eyesore, they posted a combo. both players are still breathing and no one cares as much as you.",
            "I dunno I feel like a lot of players have combos but don’t really have good fundamentals.",
            ">That's a person who threw their placement matches.\n\nWhen I switched from modern to classic, I also switched from my Diamond 4 Luke to JP. After practicing for hours, I jumped into ranked and lost every single of my placement matches. I definitely was not throwing.\n\nI'm not sure if I was placed in high silver or low gold but I obviously climbed out of it super fast but my placements were all vs mid plat-mid diamond.\n\nHe might have thrown the placement matches but that's not necessarily the case",
            "You're being a total douche for no fuckin reason bro calm down",
            "Whatever bruh if this is smurfing to you I think you need to get better",
            "On console, you can make another Capcom Id with a separate email on another account on the same system. Someone could make countless smurfs if they wanted.",
            "You are still breathing so i think I'll post whatever i want bro",
            "That guy is so bothered for nought lmfao",
            "Homie is hardstuck silver and thinks it's other people's fault somehow.",
            "right and op will post whatever they want! so keep scrolling next time instead of blowing a gasket over a bread and butter."
        ]
    },
    "Tokido explains why he pick Ken only(for now/this season) in his new video.": {
        "title": "Tokido explains why he pick Ken only(for now/this season) in his new video.",
        "score": 104,
        "url": "https://www.reddit.com/r/StreetFighter/comments/1dlrgsy/tokido_explains_why_he_pick_ken_onlyfor_nowthis/",
        "content": "Here's the [video from Tokido](https://www.youtube.com/watch?v=43lA_1-BRRM).\n\nSo basically, Tokido said:\n\n1. Akuma and Ken have very similar concept in sf6(for now), so since Tokido already decided to play Ken for tournaments, there is no advantage to use  2 similar characters(can not covering each others' weaknesses).\n\n2. Since they are similar, it's easy to confuse them. When using similar characters, basically you're doing the same thing while pressing different buttons. This may cause more mistakes.\n\nAnd Tokido is looking forward to Akumas's future changes.\n\nAbout the Akuma's playstyle, Akuma is pretty much like a glass cannon version of Ryu in sf6. Akuma has a very strong fireball game(basically top 1 fireball) and it seems Tokido don't really like to stand still and doing fireballs all day. Instead players who are favor of fireball games like Daigo can be seen playing Akuma a lot. Tokido seems have more favor of getting close distance, applying pressure and hitting some meaty combos. So Ken seems fit his playstyle better for now. ",
        "num_comments": 44,
        "comments": [
            "I had more success zoning and playing lame with akuma than going rushdown, I guess tokido's last reasoning makes more sense now. Apart from low health and great fireball game, a lot of his normals are great pokes or whiff punishers (st.hp/hk fwd st.hp/mk). I placed D1, gone back to P5, but now in D4 after having this realization.",
            "Well that sucks. I stole his corner combo and have been using it to great effect, and was hoping to have him available to copy well into the character's future. I'm guessing if the game launched with Akuma, or maybe had him as the very first DLC character, Tokido might have mained him.",
            "Chris Wong mentioned with Akuma low health and FT2 tournament format, playing Akuma is too risky. He thinks Luke is still a better character",
            "The discourse around akuma has been interesting. Angrybird and tokido both put Ken as a stronger character. Angrybird went as far as saying that Akuma isn’t even top 5, which is definitely interesting. Meanwhile the rest of Japan has been switching over to akuma, as seen in the recent topanga tournament \n\nThe shotos in general are in a really good position, all of them being considered top 10. Will be interesting to see how the meta develops tho",
            "Tokido saying he doesnt wanna do fireballs is so hilarious cause i vividly remember watching him do jump back air fireballs for 50 seconds straight every round back in sf4",
            "Tokio always played high tier characters. That's the only reason he picked Ken.  There's no reason ever to play anything but the highest tier characters. Because he wants to win.",
            "Tokido really out here trying to get buffs for Akuma... and this cry for help shit will probably work too because it clear how much the devs love this character.",
            "This is exactly why I stepped away from Akuma and went back to Ken. I can’t stand that fireball/DP baiting playstyle. I like to rushdown as fast as possible and be directly on top of my opponent, and Ken simply does that better than Akuma. Giving the opponent breathing room is not my thing, and I’d rather rush in and get a low kick conversion than toss a fireball and try to keep people out, lol.",
            "Tl;dr: Tokido isn't interested in playing his lifelong main if he's anywhere below the absolute top tier.",
            "Max's hopes of maining Ken one day in shambles.",
            "My man still rocking Ken.  \n\nI wonder if he will switch to Violent Ken if and when it releases.",
            "Master on both Akuma and Ken here, pretty much the same experience. However I'm more consistent with Akuma due to his easier combo. I kinda suck at doing Jinrai combo in the corner.",
            "His fireball is whack, why is it better than Ryus lol",
            "That’s cool. What’s your highest rank on other characters?",
            "You have Daigo, Bonchan, Kawano, Shuto and I'm sure some others",
            "Yeah I agree with that. I think Tokido just think drop a character he’s been using for a whole year isn’t really worth it.",
            "What is his corner combo?",
            "what's the combo",
            "Shoto characters by design will often be strong simply because their base kit is a core part of Street Fighter and honestly any fighting game.",
            "SF4 was the return of a strong FG game after SF3 and there wasn't any parry/drive system. Even you used Focus armor to absorb the hit, it wasn't uncommon for people to still end up losing gray health.",
            "That's because air fireball wasn't limited to forward jump..shit was mad fun back then",
            "I have a pretty good WR against Akuma, but when I run into one that plays him as a super defensive, fireball first zoner my WR is abysmal. I’m not even sure what to do against that, it doesn’t feel like there is any window to jump in, you can’t really DI his fireball, it feels like the only strat is to slowly walk him down like you’re playing against guile. Any suggestions?",
            "Man's gotta pay bills, he's not that young these days. :P",
            "Akuma isn’t his lifelong main, he’s swapped off him several times before when there were better characters.  ",
            "My guy literally measures how far his face is from the TV at tournaments so he can see an optimal amount of the screen, of course he's gonna take any advantage he can get.",
            "Jinrai juggle timings are really easy to miss. I even see pros miss them fairly often. It doesn't help that every type of jinrai has a slightly different timing.",
            "One less total frame, faster heavy fireball.\n\nMakes it harder to jump on him after a fireball and easier to generate fireball traps where they either can't jump because they'll get hit on the way up or because you recover in time to AA.\n\nOutside of the Denjin considerations, his fireball game is straight up superior to Ryu's",
            "Its hurtbox is also smaller, there's basically no hurtbox around the arms.",
            "It's 1f faster than Ryu's. Plus the whole AirFB thing.",
            "You’re crazy saying that",
            "Got 4 masters (dhalsim, honda, guile, ryu), but only floating around 1400-1500 mr",
            "I think it also factors in that akuma can be easily jailed through corners since his ashura senku was relagated to a throw loop now",
            "Hell nah that shit wasnt fun man youre smoking dick",
            "im playing akuma trying to get him to master (p5 rn) you can definitely di or even jump in on his heavy fireball. it has tons of endlag",
            "He's doping with eye drops",
            "I play both and I don’t think it should be better than Ryu. He has so many other tools for offence, the fireball should be Ryu’s speciality compared to the other shotos",
            "Yeah this means mid normals get stuffed by the fireball regularly. He's a neutral monster.",
            "Travels faster too",
            "Don’t look down on that MR. Anyone regularly playing in Master Rank and having 1400-1500 MR are top 2% players in the world.",
            "I actually just lol'd at \"you're smoking dick\"",
            "That’s not correct, 1400 MR is like top 6% ",
            "Top 8% is all of the Masters. Most players reach Master and go back to grinding a new character. Players who play MR regularly, 1400-1500 could be top 2% I have no data just speculation.",
            "Master is always getting bigger, and last I saw Master is at 11-12% of the playerbase and 1500+ was the top 5%",
            "Okay, Still 1400-1500 MR players are among the top 5%, that should be good enough for anyone to not look down upon that rank."
        ]
    },
    "Upcoming QOL Update - Training mode will be accessible from the main menu ": {
        "title": "Upcoming QOL Update - Training mode will be accessible from the main menu ",
        "score": 339,
        "url": "https://x.com/streetfighter/status/1804288356995477682?s=46&t=kzTXbPeJQ5u43GLyT2I4aQ",
        "content": "Street Fighter Twitter account:\n\n“Introducing some QOL improvements and additional features coming with the M. Bison Update.\n\n[Training Mode Shortcut]\nAdded a shortcut to start Training Mode by just pressing [□ button / X button / R key] in the Main Menu.”",
        "num_comments": 57,
        "comments": [
            "Oh thank fuck. Hopefully they continue to make improvements like this.",
            "Please let me open settings menu while a match is being loaded.",
            "Would be the ultimate QoL if we could access it from the activities card on the PS5 lol",
            "now give the option to create a desktop shortcut straight to training mode",
            "Aight, that’s a handy QOL change. The tweet says “improvment**s**” so I wonder what else is getting changed?",
            "I wonder if this means skipping the character select screen also. ",
            "How about replay accessible from post match options?",
            "Why does logging into the main menu screen take a while? It was like that in SFV too, kinda baffling how long it takes compared to most games these days",
            "The only QoL that matter is : **To be able to quit the game from the training mode/rematch menu !!!**\n\nYou have to leave training mode/quit the match, then go back to title menu, then press start and then choice to quit the game. THIS IS THE WORST GAME DESIGN",
            "Why not just go a step further and let us boot directly into training mode?",
            "A QOL change I think we really need is the ability to reconnect online, w/o having to go alllll the way back to the title screen",
            "Very convenient",
            "Beautiful. Hopefully we get an update that allows us to go straight from a match to the replay soon, because it's waaaaaay too tedious right now.",
            "PS4 load times are awful so this will save a lot of precious seconds.",
            "Upcoming QOL Update - The current menus have been replaced with SF4 menus",
            "Love this! I wish there was an option somewhere in the future to immediately replay a ranked match without having to go all the way back to cfn",
            "holy shit this was actually the only problem i had with the game as a whole. capcom is putting a tent in my pants",
            "Can we have the same for ranked? Or maybe have that an option select, either go straight to training mode or any mode of our choosing from the main menu? Can we also have a minimal input queue for ranked, like I don't need to press accept or ok each time connection with opponent times out?",
            "Now give me a shortcut directly from the PS5 homepage and we are set",
            "Good. Now let us quit the game from anywhere.",
            "Finally",
            "FINALLY. \n\nThere are a bunch more improvements needed (pause while looking for matches) but thank god they’re finally adding something like this.",
            "Thank fucking god. I hope they add the option to instantly look at the replay for the Bo3 I just fought.",
            "What I would like is to repeat combo trials instead of it moving on to the next one",
            "goated",
            "The gods have heard my prayers.  I'm more hyped for this than shadow of the erd tree.",
            "Thank God -- finally! 🙌",
            "Now make it auto requeue after connection problem",
            "Just copy everything from Tekken 8s training mode. Combo trials should be built right into training. Or at least have an option to switch between the two without having to go to the main menu.",
            "Amazing!",
            "I hope they allow all characters in practice Only, before you decide to buy em.\n\nCharacter passes are fine but one hour isn't enough",
            "My source says thats planned to arrive soon ^(in season 10)",
            "Why isn’t this already addressed like wtf capcom???",
            "![gif](giphy|cAxfl5Vkfx4fWg4Kzc|downsized)",
            "Or set sf6 training mode as Windows boot app",
            "Make it half \"stand-alone\" where it doesn't load anything else unless you tell it to (as an alternate launch of course).\n\nAlso, what I've been wanting since the SF4 days was a way to watch the replays without launching the game but I know that's not really possible or at least not practical at all in terms of resources on their end with today's tech.",
            "With the last character combination used for training mode! Skip the character select screen all together",
            "Yeah I rather have them fix that instead, it takes way too long for the game to load, but eh this is a nice QoL at least.",
            "I mostly just close it out in task manager or alt f4. On PC at least the game sometimes hangs on close requiring a force quit anyways. It definitely is horrible if you accidentally go one more time back past the title menu you have to reload that start lol",
            "??? PC just alt f4, console use the home button and just close the entire app",
            "I really need that. Every time I suspend my steam deck while in training mode, I need to go back to the main menu, reconnect and go back to training",
            "Yeah and I get connection errors a lot and sometimes it even goes \"offline\" takes a minute or two just to get back to matchmaking",
            "there is an option to auto accept matches, and you can queue ranked and casual from within training mode read through the menus",
            "You can it’s in the menu settings if you press start make sure to check all the tabs",
            "10 mins free after facing them in ranked would be nice",
            "I hate the fact that for me to learn the ropes against new characters I need to have a friend who owns them.",
            "Or make it so that SF6 training mode opens when you sit down in your chair",
            "Why is it even possible to return to the title screen? There is literally no reason to do that.",
            "> I mostly just close it out in task manager or alt f4.\n\nneeding to do this is bad design. its way too hard to quit out of the game using it's menus. I don't have Alt+f4 on my leverless. I shouldn't need to map it.",
            "I have the same issue, it just hangs if you quit, it looks amateur lmao.\n\nAlso constant 10-20 of matchmaking is connection errors...",
            "My mistake for not being clear, I'd like an option for it to continuously search for people to play against even if the connection times out, like SF5. Right now I have to acknowledge the time out for it to resume searching. I gain nothing from acknowledging the time out so I'd like that to be automated.",
            "I'd like it to start training mode when I'm pulling up from work.",
            "There shouldn't be, but frustratingly if you get disconnected from online you need to go back to the title menu sometimes to reconnect.",
            "Ah I just sit by my keyboard. But I definitely agree it's either dumb to get to or doesn't work. as you have to get to the first menu screen. And then even when I do that at times it would just freezes up and doesn't close so I gave up on closing it the normal way a while ago.",
            "Just map it if u have leftover button. If not, using Guide + any button. I map mine Guide + start = quit game. Guide + option = shutdown. Guide + up down for volume control. Best qol change cuz when using leverless, i sit far away from keyboard",
            "I'd like training mode to start right as I take my pregame shit",
            "My experience is that happens if you go to fast lol. Need to wait a few seconds in between changing menus and it will exit everytime."
        ]
    }
}