{
    "Simple Questions & Champion/Role advice: Patch 14.11": {
        "title": "Simple Questions & Champion/Role advice: Patch 14.11",
        "score": 8,
        "url": "https://www.reddit.com/r/summonerschool/comments/1d870ip/simple_questions_championrole_advice_patch_1411/",
        "content": "Hello summoners!\n\nIn order to create better discussion in the subreddit, we will be redirecting all simple or championpool/role questions to this thread. Check out the most recent patch notes on the sidebar!\n\n**What is a simple question?** Typically, we define a simple question as something that can be answered fully within a single, or maybe two at most, comments. In this thread, you can ask any question you need answered about League of Legends, **even if it isn't necessarily about learning the game itself.**\n\nQuestions about what champ to add to your pool or general tip about roleswapping can also be asked in this thread.\n\n*Keep in mind we will still continue to remove golden rule violations, rants, memes, topics against Riot's ToS, and paid services - but the other rules are generally more lax here.*\n\n**What you can do to help!**\n\nFor now, this is a patch-based thread, meaning it will be posted once every two weeks. Checking back on this thread later in the patch and answering any questions that have been posted would be a huge help!\n\nIf you're trying to ask a question, the more specific you are, the better it is for all of us! We can't give you any help if we don't get much to work with in the first place.\n\n**Resources**\n\n* [Our 101 page](https://www.reddit.com/r/summonerschool/wiki/101), with a *ton* of free content!\n* [Our weekly mentoring thread](https://www.reddit.com/r/summonerschool/wiki/megathreads#wiki_mentoring_thread): We have many users willing to provide free mentoring services!\n* [Champion discussions](https://www.reddit.com/r/summonerschool/search?q=title%3Achampion+discussion+of+the+day%3A&include_over_18=on&restrict_sr=on&t=all&sort=new): Check out our previous discussions on champions!\n* [Summoner School Discord](https://discordapp.com/invite/summonerschool): A voice and text chat platform for teaching and learning. We also have a mentors who are available for personal coaching.\n* [Leagueofgraphs](https://www.leagueofgraphs.com/): Stats site - winrates, pickrates and more.\n* [Lolalytics](https://lolalytics.com/ranked/worldwide/platinum/plus/home/): Stats site - winrates, pickrates and more.\n* [OP.GG](https://op.gg/): Stats site - winrates, pickrates and more. Note: stats are for Korea plat+ only, so sample sizes tend to be low.\n* [Patch notes](https://www.leagueoflegends.com/en-us/news/game-updates/patch-14-11-notes/)\n\nWhich do you use? Deviations in stats are typically minor, so whichever one you prefer.",
        "num_comments": 278,
        "comments": [
            "Are there any stat sites that track item data like how TFT does? Like who builds X item the most, who has the best winrate on X item, etc.",
            "what are some good champs in top lane that help with learning to win lane. i usually play tanks up there, but i play them to go even or slightly ahead in cs.",
            "Does Red pet's damage instance give one stack of Conqueror? From my testing, it seems it does but I have not extensively tested it on many champs.",
            "What top laner is the most rewarding to one trick? I mean this interms blind pick ability carry ability and meta resistance.",
            "[deleted]",
            "My winrate with Lucian is 31% in ranked. I'm debating if I should just give him up. But I don't want to. I enjoy playing Lucian, I feel like I'm getting better. I know what I'm doing wrong (getting caught a few times) bust most of the games have just been unlucky. What am I missing? Should I just give him up?>",
            "How important, or what priority to be a bit more precise, has ganking/roaming as a mid player? In particular compared to CSing. Ofc I know you should only do it when the outcome is pretty clear without losing anything.\n\nI ask this because a lot of the time I fall off CSing (and a little bit in levels) between minute 5 and minute 10 and this is mostly to me roaming I guess, and to some extend ofc because I suck at it. ;)\n\nAfter that I stabilise most of the time and either don't fall further behind and sometimes even get back up. It should also be mentioned that it is just in the quanity of CS, but networth-wise I am either on my level or even above. Therefore I feel I am not getting punished as much as I think I should be. Surely because either thanks to just the low elo games I am in (Iron to Silver), or the champs I am playing.",
            "I can’t understand whenever I have to push or concede the first wave as an adc",
            "what champions are infinitely scaling? chogath,senna,nasus,veigar,smolder, is there anyone else?",
            "How can you tell who's winning in the game? I recently got this game and I've been so lost in my games I never know who's winning until someone surrenders or a nexus blows up. I know it's all about destroying the towers but when both teams have some towers lost and some dragons I never know how to read the game state",
            "Lets say I play a ranged mid mage like Ahri or Lux, so an AP champion, and I want to buy an Armor item because enemy team has a lot of AD. Is there a reasonable alternative to Zhonya's? Its probably largely because I am lacking game experience and still in low ranks, but I find it hard to get much value out of the active ability, either because I forget it / react too slowly or because I don't anticipate the right moment to use it and just delay my death.\n\nProbably I should just try to get better at using it, but are there other options I could potentially consider? Without the active Zhonyas is probably not the most efficient item to buy?",
            "Thoughts on rushing echoes of helia on nami?",
            "What is the math behind PTA and conq now?\n\nNow that lethal tempo is gone I’m having trouble deciding what they want us to use for sustained damage now ",
            "Jhin is a lot of fun…but his ult shots using R through my brain. Is there a setting to allow me to use left-click? I probably just threw a game because I kept screwing that up",
            "Are there any defensive items for people who build on hit?\n\nBecause ik we have randuins for crit but idk about on hit ",
            "How do you deal with proxying champions? I thought it was only singed that usually proxys, but I've seen a garen and rammus proxy lately and it's had to punish them with their mobility and in garens case, damage. Like it just feels bad we might have to burn flashes or ultimates just to stop rammus from just peacing out with Q and maybe R then Q",
            "How do you deal with win streaks and then inevitable loss streaks? \nI used to be plat and now i’m climbing out of silver but if I win 3/4/5 games in a row I know i’m going to get a huge loss streak and it prevents me from wanting to queue, why does this happen?",
            "Why do I sometimes get empowered recall?\n\nHaven't played in a while and no clue why this happens.\n\nThis is without Baron buff or eye of the herald or the new boots.\n\nIs this something new added to the game?",
            "Can someone explain prio or priority? I keep seeing it mentioned but it seems like I’m just expected to know what’s meant by it.",
            "how do you build against swain support as an adc? hes tanky and he heals. DOMs or healcut?",
            "Would you consider karthus a hypercarry?",
            "How do I beat (a good) Sett as a melee (as Garen) without junglers help? Problem is, that he is pretty decent/good in teamfights with his ult. While I feel useless. I asked a friend and he says sett is a fair champ and that I just need to get better at Garen. I watched some youtube videos about Garen vs Sett Matchup but most of them seems like waiting for jungler or waiting for huge mistakes by the Sett player. I am around High Emerald/low Diamond elo.\n\nOfc I know the basics, slow push, wave advantage, ability cd abuse. But the Sett players that I fight don't care at all for my huge minions wave and just walk into me use there cc to easy land there big W. Its hard to avoid his stun of E If u have to contest minion wave. This would mean I can never ever fight in minions and have to let him do whatever he wants with my wave. I am not talking about bad Sett players who walk under my tower and eat free shots, I am talking about players who knows how wave control works and just farm up and keep me down. And after like 10 minutes just tower dive me.\n\nThe best I can do is go even. But that is really bad, because he is much more valuable in teamfights and I cant really match him until he makes big mistakes with his E and W.\n\nSo how can I beat (good) Sett players? Bad Setts just waste their W or use It without E, this makes It easy to dodge.",
            "Why was changing corki from ap to ad and removing the packet passive and instead buffing his basic abilities enough to make him picked mainly in bot now instead of mid (both for pro and soloq)?\n\nLike, his playstyle is pretty similar except for the package. He uses his basic abilities the same way and his ult is the same too, same aa range I think and so on. So why did no one play him bot before and why is almost everyone now playing him bot instead of mid?\n\nLike mages have always been viable bot, so it can't just be the ap to ad switch, right? You could play mages before that build ap on botlane and Tristana is played mid as an ad marksmen like Corki is now, so why this drastic role switch for Corki?\n\nIs it just placebo/trendy and he is actually just as viable bot and mid as Tristana and he was just as viable bot before the \"rework\" just like a lot of other \"mage/ap\" champs are? Or is there actually reasons for this big role swap?",
            "Carry junglers that are good to one trick?",
            "How do you not get discouraged about your rank? I feel like I'm about to drop to Bronze III after being Silver for a ton of years and Gold for one year. I feel like I'm in a slump.",
            "What are some champs i should pick up? i mainly play top and jungle. With my most played champs being; Singed, Briar, Jax and Vladimir. Getting kind of bored playing those over and over again so any suggestions?",
            "I just played a game where my Nautilus was standing in the back of the baron pit. He was the closest champion to baron and he was autoing it. We got wiped after that, but our jungler (already low HP) chastised the Nautilus for not tanking the baron, saying that you have to be in front of it to tank the autos.\n\nIt's my understanding that you can be anywhere in the pit as long as you are closest to baron, but I didn't argue much because I realized I'm not 100% sure about that. Can anyone verify which is true? Is it possible that the new barons are different in this regard?",
            "Do Plated Steelcaps and Warden's Mail passives stack? By this I mean: If I build both, will I get the 8% reduced auto attack damage from boots AND the 20% potential damage reduction from Warden's Mail (28% total)? Thanks!",
            "Can the owner of Imperial Mandate proc its mark? It says \"allied champions\" but does that include self?",
            "Just had a thought about manipulating MMR in Diamond+\n\nCould one theoretically boost their MMR by (hopefully) only winning a game that would promote you to D4 and then allowing decay to bring you back to E1? Ideally you'd then win the next game to bring you back into D4, back into a decayable rank (and increasing MMR by winning) and then by decaying you won't lose MMR via losing a game.\n\nOr would this quickly become irrelevant if your MMR gets too high for the visual rank?",
            "[deleted]",
            "[https://www.replays.lol/app/clip/5938732378882048](https://www.replays.lol/app/clip/5938732378882048)  \nI am struggling to find out how this happened  \nHow did Briar's ult not hit?",
            "How do you think the meta would change if both teams had perfect vision on the entire map at  all times",
            "I play League specifically for one friend that is addicted to it. They main Akshan, Teemo (specifically shroom builds usually 'cuz funny), and Singed. What junglers would pair up with these 3 champions well? \n\nRambling: I'm attempting to stick to find some sort of definitive \"main\" so I can accelerate my learning process since I'm trying to catch up to my friend. However, like certain fighting games, I often spend too much time thinking about who I want to play, rather than learning/playing the game properly. Currently been playing characters on the free trial as I slowly grab all the junglers, but no one really stands out since everyone is fun in their own way. Also since I'm currently bad at the game & trying to improve, I'm most likely looking at champions the wrong way",
            "i already ran into 2 garens mid in a row in my yasuo games how do i play this matchup i dumpstered him pre 6 but he gapped me super hard later on cause i barely scratch him meanwhile he 1 taps me if i show up in lane",
            "What's going on with me this season\n\n  \n[https://www.op.gg/summoners/na/FF%20or%20Grief-123](https://www.op.gg/summoners/na/FF%20or%20Grief-123) \n\n  \nI literally can't win can someone please give me some advice.\n\n  \nSure I lose lane sometimes but I swear the times I go even/win lane the rest of my teams hard lose and it's over by 15. Like is this just variance?",
            "What are you supposed to do if you’re playing ADC and as you proceed to mid game, your top and/or mid won't leave the middle lane? Do I just go to the sidelane and play super conservative? I try asking them to sidelane, but it is just ignored.",
            "[https://www.op.gg/summoners/na/Sixyn-1543](https://www.op.gg/summoners/na/Sixyn-1543)\n\nHaving a hell of a time trying to live this season. Feeling like never going into a fight because everything blows me up instantaneously. \n\nJust played a game as Jinx into Ashe, TF, Amumu, Fiddlesticks, and Riven.\n\nIf I was anywhere near the fight, even with max Q range, I'm getting CC'd and/or one shot.\n\nSo many games feel like I'm dead before I can blink or even understand what hit me. \n\nMight be a product of just getting old and playing after work when I'm fried. Any advice?",
            "need champ advice: im looking for a champion that is strong lategame that can be blindable in top lane, that is preferably not a tank. I've been watching drututt play a lot of smolder top, can that work? I've seen wukong has really good winrates lategame but I don't know why he scales. any suggestions, off meta too, would be much appreciated.",
            "Best semi Beginner lane?\n\n  \nI play leauge, but not in a completley completive way, I am currently level 40, and I so I know thing's like wave management, and jungle clearing all exist. I've had a few good games on rammus, a few terrrible games on ekko, and a mixed bag in brand on supp. I was wondering what is the best lane for me? \n\nI have ok mechanics, but its no where near my strong suit, but I can def improve them and learn to hit combos. My strongest suit would be that I'm pretty good analytically. I love learning about characters stat's and sort of predicting how to properly play a match up. Knowing what counters what, and playing around that. ( this person is a glass canon, but they have this ability which shreds this persons armor, so I should try to jump them from a bush.) \n\nso basically, I am really good at knowing the right thing to do, but like a 4-6/10 at actually executing it.",
            "Super dumb question, but I can't find the \"Enemy Vision\" ping in the hotkeys in the settings.  I see others like \"retreat,\" \"enemy missing,\" and \"Need Vision,\" but I do not see \"Enemy Vision.\"  Can someone tell me where to set the \"Enemy Vision\" ping or if there's some way that I disabled it from appearing?",
            "When is the event coming to EUW? Like the bp and stuff. It says June 12, but that is a really broad timeframe",
            "What do you do vs the cheesy garen phase rush strat?\n\n  \nAny time he wants he can Q in do a trade and if he's gong to lose he just walks off at 4000ms.\n\nHe can quite literally just walk up and chunk and then back off untill you're in kill range and then just all in at 4000 movespeed.\n\nWhats the counter?",
            "Can you still climb by just knowing the fundamentals of two roles? Or is it important for game knowledge to know the fundamental of every role? Can I skip that?",
            "How does Blackfire Torch's passive (the AP increasing portion) work? Do you get permanent AP or just while the burn is on?",
            "I am trying to learn Sivir because of the idea of her being able to farm so well and have her Q was appealing to me. \n\nHowever I tried a few games. I am getting poked and denied CS quite a lot. I also noticed I do very little damage and while the enemy can kill me easily, I cannot do the same. Even against a half hp enemy if I got all in they can make it even by killing me too.   \nI end up being even on farm which is not good on sivir, I should out farm my enemy.\n\nHow should I play? Should I ignore my team if they are attacked or go all in? Early game there sometimes fights near drake and during ganks. Not sure what should I do, I feel super weak and has super low range.",
            "Yun Tal Wildarrows\n\nWhat's the purpose of this item? For me it looks like a cheap version of IE that can be builded only if you already have IE and need even more damage. Someone told me that this item is good vs hp stackers but I can't get it. Please explain it for me.",
            "some adc's have the attack range circle around them during attack move click and their cursor is a circle that goes red when its on an enemy champion. however for me, it is a sword which goes red. how do i make it the circle cursor?",
            "Can you guys recommend me any good champ that can be played on mid/jg/top who can hold their own in a sidelane? Atm I love playing Zoe, but only during lane, after that she feels super bad to play since anything can kill you, you can't sidelane, you are hard countered by any diving champion etc. Any recommendation is welcomed!",
            "Why is Brand APC popular now? I hit Masters and in my first 3 games, I’ve had 2 Brand APCs that were pretty useless and now I’m seeing Reddit posts about Brand APC. Did they play him in pro play or something?",
            "I currently main mid (mostly Ahri, Lux) which means I also often get assigned my second role, support. Here I feel most comfortable on Lux, with Lulu my alternative since I won’t always get Lux.\n\nI am still a rather new player and especially on Lulu I have less experience, and I feel games with her are rather hit and miss compared to my other champs. Her W polymorph feels very impactful against dive assassins but hard to get value from otherwise if they don’t have that type of champ. Also I feel more helpless than usual in games where the team is struggling and behind. Sometimes people just get oneshot even when I shield them in time. Maybe that’s just part of the enchanter experience but I am wondering if there are any tips for Lulu for these situations.",
            "Is securing objectives like drakes and barons the winning factor of the game? Or can you still win without them. I know it depends per game, but I always ignored them when I'm playing any role than jungle.",
            "Idrk where to share this if not here: Has anyone ever been in a situation where you want to play league but there are no champs that feel good? I've been playing for 2 years and a half atp and idfk what to play, every single champ feels very unsatisfying to play for one reason or another, it doesn't help that my current main, Ksante, is in a very bad spot in soloQ :/",
            "How do I lane against non-mana champs in mid (Zed & Yasuo for example), I usually play Syndra or Naafiri, both mana dependent. I've been running into this issue where I have a good early game but eventually I end up under my tower with no mana and not being able to back even having teleport. I know I'm doing something wrong, what could it be?",
            "What are some champions in your recent memories that just ran 1v5 into the enemy team and killed everyone?",
            "What am I even supposed to do when we're so far behind that I can't even farm in lane or in jungle out of fear of getting one shot by an assassin? I get it, push out waves, but even then everyone's scrambling to take them usually. With jungle it's like, the enemy jungler knows where I am and just kills me over and over. What to do?",
            "Does Riot have a problem with simple macros?\n\nI honestly don't want to develop carpal tunnel from holding shift+a and spamming mouse click and would prefer to click the 4th button on my mouse for auto attacking champs only.",
            "Hi guys, im dota veteran, but relatively new to lol, and I wanted to ask what mage champions (I don’t really like playing assassins) can kill in mid in a cool way, idk how to call it, like outskill people in mid with style, you know, but also be impactful later? I mean for example I really like velkoz, killing someone with angles in lane feels very satisfying and it takes a lot of skill, but he’s not that impactful later (as azzapp said, and I noticed it too). If someone played dota I would love to play something like sf who can outplay with razes very early, but he’s also crazy impactful with his ult later in the game.",
            "Does anyone know if Last Season's Rank gets reset at the end of the split? And if it does get reset does it show the highest rank achieved or just the rank you finish the split?",
            "What do I do against AP nasus? I have no issue with regular nasus cause you just perka freeze but AP nasus wave clears way too quickly and you can't run him down because of fleet + wither. It's unavoidable 400 damage every time before he even has a full item",
            "Good mid laners to otp or get lots of experience on to carry with?",
            "before level 6 which champions should I avoid and which can I pressure as a cho'gath on top? (yea skill matters but asuming my opponent is on the same level and isnt playing like an AI or curbstomping me)? and for those who I should avoid what abilities should I prioritise?\n\n  \nalso generally speaking which items should I be using, currently doing the heartsteel build from [here](https://u.gg/lol/champions/chogath/build) but before i build said heartsteel it feels like im really behind my opponent so not sure if its supposed to be like that or if i should do something else",
            "I'm realizing that the way I instinctually play is not benefitted by any of the champions I'm playing as. \n\nWhich champion would you think of if I said pure CC/peel, good in team fights/Support but not a big damage dealer themselves?",
            "I play a lot of taric support, but I'm not a huge fan of fimbulwinter. I generally go tear->lucidity boots->locket->knights vow->last item; often I like the last item to be a matchup dependent one (frozen heart generally cause mana). Do I have to keep tear? Do I have to upgrade it to it's full item? Is it troll to sell it so I can get an item with more utility? Am I undervaluing/underappreciated Fimbulwinter? Is this a simple question? Lol.",
            "How do I link a specific match I had in game?",
            "Mitigated loss due to afk player, how does it work, our support stayed AFK in the fountain, disconnected and reconnected 8min afters. We didn't get any lp Loss, really enjoyed that game losing 28LP for free how come ?",
            "Is crit the highest damage output at full items?",
            "i started playing this year, i got placed iron 2 this split, i get +14 -36, is this normal? if so, how can i fix my mmr",
            "Does it take everyone else forever to get games?\n\nMy playtime starts at 8pm. Ill queue for a game, spend 5 minutes in queue it pops (gold - plat elo) 4+ instant declines. Get into a lobby 40% of the time it gets to last pick then declines and starts over again.\n\nLongest it took me to get into a single game was 30 minutes.\n\nAnyone else?",
            "When will the mentoring megathreads be back? I made a post essentially searching for a mentor and it got removed because “there’s a megathread for that” but the last one was months ago and as such completely fails to suit my needs.",
            "Why are crit ADC's building Kraken Slayer still? I thought it was mostly for on-hit focused builds now. Everytime I see an ADC build it seems like they end up doing negative damage unless they're super fed that it doesn't matter. Maybe I'm just missing something I'm mostly just curious. Thanks in advance!",
            "i really like playing nautilus but don't like playing support. am i trolling if i play nautilus in the jungle for quick matches?",
            "Question Renata's bailout. When a champion dies with Bailout active, do they take damage? (ie do they die faster than 3 seconds if you hit them?)\n\nAlso, if you heal a dying champion in bailout, do they live longer than 3 seconds?",
            "For Fizz what 1st items should I be looking towards buying and for what scenarios/ teamcomp?",
            "What do I do as an ADC when my support keeps running it down against enemy adc?",
            "How do I combat things like Thresh and Blitzcrank just walking up to me threatening an engage (Flay or Blitz Speed>Blitz Knockup)when I have an enchanter support with no hard CC like Soraka and Yuumi and I’m playing an immobile ADC like Jinx? \n\nI feel that I either just lose because I stay in my minion wave and try to fight giving them the all in they want or I move towards my tower and leave myself open to getting hooked due to leaving my minions. \n\nI’m more asking about during laning phase for this question btw as it feels pretty bad/wrong? to concede all pressure in lane just because the support is walking up (their ADC is also walking up within follow-up range) and I can’t contest due to the kill threat that these champions have as they just hold onto these abilities threatening to use them if I’m within range (i.e hook, Leona sword, etc…) leading to them crashing and potentially freezing under their tower.",
            "let’s say hypothetically the enemy team doesn’t have a tank nor a bruiser. \n\nSo basically something stupid like Quinn twitch(jg) lux mid and adc / enchanter bot\n\nWhich assassin out of the entire roster would you think be the best pick into something like that? ",
            "What are some champions that were buffed due to a otp/streaming giving advice?",
            "What are some tips for a new player wanting to play Warwick and volibear",
            "Could someone explain in a few sentences how Darius vs Mundo should go Top Lane (for Low Elo)?  That is, assuming the players are equal - what would a spectator probably see from early/mid/late game?",
            "Do i need to make a new account?\n\nMy account is ancient 10+ years.\n\nI play almost every game vs a smurf. Blatantly obvious 70+% win ratio players.\n\nCheck game history and every game is a stomp with 15+ kills \n\nWhat do i do when im playing vs someone who's clearly diamond + who's just cheating to play vs lower elo players.. You literally can't learn anything because they just dodge everything and hit everything. \n\nevery game either we get one and win or they get one and win.. i've probably had 5 even matches out of 50 this season so far.\n\n  \nYet i see people doing climbs on new accounts on youtube and they're in emerald and their laner can't even cs... are older accounts just stuck in smurf queue or something?",
            "As a support, should I die more/less/same amount as the ADC? Both for tanky ones, and mage ones",
            "Im sub level 30, and at this stage of being new, should i be actively learning, focusing on improvement in certain skills every match or should i just be bashing the queue button and just playing while learning passively/subconsciously?\n\n(I play AD Carry)",
            "Emerald 3, peak emerald 1. Trying to get into diamond since two splits.\n\nI generally OTP as Renekton but want to branch out. I’ve got a good understanding of Garen as a backup. Now the question is which should be my third champ to learn\n- Jax for split pushing\n- Ornn for tanking/frontlining. \n\n\nPersonally it feels like I can make most impact by sidelaning as jax/garen and should just ditch Renekton, and don’t bother learning Ornn as I feel my games aren’t decided by me being good but my worst teammate dying at unnecessary spots or times. Hence why I’m leaning more towards jax to split push more/better.",
            "Why don’t pro players play Ezreal ADC with TP + Ignite/Exhaust/Heal?",
            "Is it just me or has League Of Legends become League Of Tanks now?",
            "how to translate a lead into a win as a mage in low low elo\n\nStarted 8/1 last two games, lost both.\n\nEnded 11/6/7 in one, I fed the already fed yi a little bit at the end. Second one was 9/1/6 as they took nexus.  \nFor reference: [https://www.op.gg/summoners/na/brooleyy-cream?queue\\_type=SOLORANKED](https://www.op.gg/summoners/na/brooleyy-cream?queue_type=SOLORANKED)",
            "What's the point of on hit builds? On hit neeko was a thing but didn't play it. Are they good nowadays and what makes them good?",
            "I'm in bronze 2, peak gold 2 but it does not matter.\n\nSo like I know what to do and what my objectives are. But the games are so chaotic. Its making my head burn like I'm genuinly confused on how to make the game less chaotic because at this point I'm pulled towards whatever happens on the map.",
            "When does MMR actually start mattering? Or is the matchmaking system just that f-ing garbage? I'm level 21 and have a 35% win rate. Yeah, I'm not good. But almost every game is a blow out of my team getting stomped. Then it's abundantly clear the other team is dozens of levels higher than due to their mastery and honor levels. I also found a tracker showing I was getting placed in Silver 3 lobbies on average last several games. But I've never touched ranked and with a 35% winrate I'm obviously not Silver level so are the developers just trash at matchmaking or does it not exist because I can't see any other options here. \n\nAlso, what's the best way to report smurfs? Just played against a guy who in only 3 games total and at level 5 had 27 kills and 3 deaths average. AVERAGE. It was abundantly clear he was a very high level smurf by how he was playing Yasuo and predicting every single ability of my Skarner perfectly. Or he was cheating, but I find that less likely but honestly I'm not sure.",
            "Aoe dps/burst mage recommendations that are viable in high elo?",
            "I'm on a 5 game losing streak as top lane where my bottom or mid goes 0/4 or 0/5 at a minimum before 15 minutes lol. I win lane almost every time and then they just int for the rest of the game. I wish people in low ELO would just learn to play safe and you don't have to CONSTANTLY engage. \n\nNot having a great time. It'll even out im sure but just a sad streak.\n\n\nMake it 6 in a row: https://i.imgur.com/wVanY2I.png botlane had 8 deaths before 12 mins.",
            "Best carry junglers/ top laners to one trick?",
            "Best champions to one trick if I dont trust my team and just wanna carry?",
            "What are some of the best carry junglers or toplaners to one trick?",
            "what do u do as an adc when its 10 minutes in and theres a 6/2 irelia diving u at ur tower. my question really is how to carry as an adc when the game seems lost before lanes are even over?",
            "im stuck in a loop i win get promoted i lose get demoted. im legit stuck. how do u people get out of that i took days off i tried playing a different roll and im still in the same bull shit. its got soo bad we stomped the enemy team pre 15  then next game i get yummie jungle insta lock. win the game after then get a pyke who runs from every team fight and leaves bot at 4 minutes. once called out he sits on enemy red afk. this is getting stupid i really hate this game",
            "why is every bronze player d4 when they start talking shit lmao",
            "I think https://leagueofitems.com/ does it",
            "Well, i saw site that can answer on your questions but i cannot remember what was this site. Maybe [u.gg](http://u.gg)  \n\n\n[https://lolalytics.com/](https://lolalytics.com/)  \nOn this site, you can check different items for every champion, when they're buying them, what is the best 1st, 2nd, 3rd item for certain champion and a lot more. With this statistics you can build better than most pro players tbh.",
            "Maybe lane bullies that fall off in mid-lategame, forcing you to snowball earlygame leads if you want to win - stuff like Renekton, Darius, Kled, Warwick, Rumble etc.",
            "Aatrox. You can play him into literally everything.\n\nOr ornn, if you prefer tanks. He's always a good pick.",
            "Camille and Fiora, played at the highest level, don’t really have losing lanes, just slightly more difficult or annoying ones. Aside from those two, champions like Rumble, Kennen, Jayce, etc can be worth picking up because of their versatility and due to the fact that they’re infrequently seen below higher elos, giving you a chance to surprise an enemy that could be caught off guard by your damage.",
            "Go for Camille, champ been meta for multiple patch now\n\n\nCan split very good, can gank other lane, can get a pick on carries",
            "Aatrox. He's been a consistent pick at worlds for years and he's flexible enough to do whatever you need him to if you play him the right way.",
            "Ornn, Yorick, Poppy. All can adapt builds to the game (Poppy with a Sundered Sky/Iceborn/Sunfire/Hollow Radiance rush and any other items after, Yorick lethality or juggernaut, Ornn with any tank item), all have great damage for their role, waveclear, range, powerful einconditions (Ornn monstrous teamfights, Yorick unstoppable splitpush, Poppy either one depending on game) and are quite simple to start off.",
            "Janna and Lulu",
            "Lulu.",
            "Imo Nami is the overall best at her current state she got buffed while aleady being strong which just pushed her over the top even more she works well with many adcs and provide variety of utility.\n\nLulu is very good with hypercarries but some adc prefer other options nami is able to fill  more synergy with variety of adcs.",
            "It's a videogame, you should play whatever you find fun. \\^^\n\nMy WR on Lucian improved a lot once I actually learned his important mechanics, namely using E before double AA from Q/W/R lands so it also reduces my E cooldown (cooldown fully resets with Q/W/R>AA>E>AA), and doing short dashes to get my damage off quicker. Everything else mostly comes down to fundamental stuff like good farming (8+ cs/min), positioning, kiting, avoiding skillshots, playing around cooldowns, knowing damage ranges, itemizing correctly etc.\n\nMight be stupid advice but I also find that I tend to focus more on the game and play better when I'm inspired after watching somebody much better than me - for Lucian I really enjoy [JinCanYi montages](https://youtu.be/l-VqoGv9axI?t=63) (a lot of these plays are from URF but some are from ranked)\n\n>What am I missing?\n\nImpossible to say without seeing a replay.",
            "How many games are we talking about?\n\nI've had champions on similar winrates before and ended the split with them around 55%.\n\nIf it's like 50+ games though it's no longer an unlucky streak. At that point you need to decide whether you value your LP more than playing Lucian. Or just take him to normals instead.",
            "There are two types of roams: ganking another lane and rotating to objectives/jungle fights/placing vision. \n\nA roam to another lane is close to the bottom of your priorities most of the time. The list will usually be\n\n1) do I have to fix the wave \n2) can I kill my laner\n3) can I get a tower\n4) can I /do I need to get a safe recall without losing waves or anything else on the map\n5) can I roam without losing anything\n5a) is the roam likely to work\n6) can I get plates\n7) can I steal jungle camps\n\nThis is a rough example, but basically: you want to get yourself ahead without danger, and most roams to other lanes are very uncertain in outcome. You either get a kill (win), play fizzles out/no one dies or uses anything (time lost) or enemies turn it (massive loss). Only roam when higher order questions are all no, as all these options are higher reward with lower risk. Even dying to your laner in a close duel in point 2 would lead to them having to recall, so only you lose on it - dying on a roam will put you AND laner/s you roamed to behind. This is also why Katarina, Malzahar, Zed etc. Fall off in higher elos - they cannot reliably roam/secure a lane state to make the roam worth it and enemies will respect their roams more.\n\nRoams to allied fights/objectives are on the other hand high on priority. You are not initiating a play, you're reacting to an ongoing situation - guranteed action without waiting around, and it will 99% of the time be within 10 seconds of walking instead of nearly 20 seconds of sidelanes. Additionally roaming to an ally will create/even out numbers advantage on a play calculated to work without that extra body , greatly increasing chances of success. Annie doesn't want to gank enemy Janna/Draven with allied Sona/Zeri, but absolutely does want to collapse on enemy half HP Draven chasing low HP ally in river for a free snack literally coming to her. The difference is action is guranteed in the latter, and situation is calxulated by enemies based on Annie not coming, so her coming dlips enemy's plans. \n\nTl;dr only roam to guranteed plays, focus on more reliable sources of income and XP to gurantee power in mid/lategame big fights.",
            "it completely depends on the champion you play\n\nif I am playing Ahri for example then my entire champion identity is shoving waves after level 6 and roaming and looking for fights with my team. in Ahri’s case, knowing when to look for ganks/roams is a core fundamental that is a very high priority for Ahri players to develop\n\nif I am playing Vladimir on the other hand, then I don’t care at all what my team is doing. my only focus is to be selfish, getting as much gold, farm, and levels as I can. I would only help my team with early to midgame fights if there is something in it for me like killing my laner so I can farm more, getting a double or triple kill, etc. In Vladimir’s case, you could reach a decent rank without ever having to learn how to roam/gank, because Vladmir’s goal in every game is to reach level 16 with 3 completed items and completely 1v5 carry teamfights",
            "There's really only 3 reasons to concede:  \n\n1. The enemy duo hard outranges/outpushes you **and you know that they know how to punish you if you try**  \n2. You are scared of an early cheese gank (e.g. Shaco, or you know their jungler invaded your buff and is behind you)  \n3. You want to bait them into an early cheese gank\n\nIMO you should never go into lane with the intention of conceding because of reason 1 in lower elos.   \nAlways *try* to get the level 2 spike before them, even if they should theoretically get it.  \nSmall misplays like \n\n* leashing too long  \n* leashing when they shouldn't  \n* them playing too passive / scared\n* support not knowing that he has to hit the wave  \n* etc. \n\nare easily enough for you to get push although you shouldn't be able to.  \nTest the waters by starting to push and knowledge checking them. How do they react? If you notice they play it well you can still concede with minimal loss.",
            "Sion (W), Thresh (souls)\n\nBe aware though that infinite scaling doesn't necessarily mean they are late game champs.",
            "What the other comment said, plus ASol, Bard, Kindred, Swain, Bel'Veth, Shyvana and Draven. Some of these are not very practical though, e.g. Shyvana would have to keep killing elder dragons to stack infinitely (game is unlikely to go that long) and she only gets a measly 5 armor and magic resist for it, and Dravens infinite scaling is his passive, giving him a bigger cashout on kill and bigger execute on R.",
            "Comparing the number of kills each team has and tower's they've destroyed can help you estimate how much gold each team has, but a more accurate way is to count completed items on each player and compare them role vs role.",
            "Usually the team who has more kills is winning, but it’s hard to answer this question because knowing who is winning is a high level skill in and of itself. Let’s say that you have two ADCs for example: A 5/1 Draven and a 1/2 Aphelios. Draven has the lead on the surface, but if Aphelios is level 16 with 3 items then actually HIS team is way more likely to win fights because of how insanely good Aphelios is late game. Team compositions is also a factor; one team might be way ahead on paper, but if the losing team has high impact ultimates like Wukong R, Malphite R, etc. then all it takes is one good teamfight for the losing team to come from behind and win the game. As you learn new champions, I would check their statistics on websites like lolalytics.com to see at what stage of the game they are most effective.",
            "Well at the most basic level gold that you get when you farm, kill and get objectives is for buying items, since items (except levels) is how you get stronger. So you could just compare how many items each player have or like if you are top then compare enemy items and yours. To complicate it a bit, a 6 item Vayne is actually ahead of a 6 item Lucian, since Vayne scales harder. So in that case Vayne is actually winning and Lucian is losing (taken in isolation from the rest of the game).",
            "So on ranged squishy mages, often you don't really want to be buying full defensive items.  \n\nEven if you buy an armor item, lets say deadman's plate---if the enemy AD assassin/bruiser gets on top of you, you're still going to die.  But what's worse is you spent all that money on a defensive item, and now don't have the damage to ever kill them.  \n\nIn general positioning IS your defense.  You don't want to be getting dove by them in the first place.  I know this is difficult for a less experienced player though.  Zhonya's is generally the most efficient secondary defensive option, which is also hard to use.  Before fights you would want to think, I Zhonya's X so you're mentally prepared to press it (i.e. zed ult, jarvan dive).  \n\nHp + Ap items might be a better route for you to build more \"defensively\" so you don't get instantly bursted.  \n\nAs an example, Syndra is normally built straight glass cannon, like ludens -> shadowflame -> deathcap.  You've got massive damage, but if you get hit you die.  \n\nThere is a more \"battle mage\" style build though that's viable, but not popular.  In this build you go something along the lines of Rod of the Ages -> Cosmic Drive -> Shadowflame/deathcap.  In this setup, you also run double scaling hp runes.  So what ends up happening is you get a ton of flat hp from RoA, you get a bonus level for even more after RoA stacks, you've got double stacked hp runes.  An assassin jumps on you, you live at like 30% hp, CC him, and then your team blows him up.  You also have more haste, so you can be casting your spells more often.  \n\nThis setup won't work as well with characters like Ahri/Lux, but at a casual level it can help you actually \"play the game\" and give you more margin for error before the enemy dive champs are too fed to even contest.  \n\nFor Lux perhaps try a Archangel (gives shield when low when stacked) -> Cosmic Drive build.  I've tried something similar in the past and found it quite fun to play, having higher haste than normal.  Ahri I'm less familiar with.  The Syndra build is probably workable, but you won't ever have much kill threat on your own (which is probably okay if you're less experienced, you just team fight and hit who you can).\n\nAery - Manaflow/Transcendance/Scorch or Gathering + Magic Boots/Triple Tonic for the Syndra build.  Syndra in particular really likes the RoA level+ and the triple tonic skill point as it stacks her passive faster, so she scales fast with this setup.",
            "only Veigar can reliably build a tank armor item and not have it affect his damage output\n\nsome battle mages like Swain, Ryze, and Cassio can build armor items later in the game because they can get more damage off with the added tankiness, but for mages like Lux they need to go glass cannon. Lux is so squishy that even if you build a defensive item, if a fed Rengar jumps on you at a certain point you’re just dead, so in her and other AP mages’ cases the best defense is a good offense\n\nZhonya’s is the only viable armor for Lux and Ahri so just try to learn how to use the active",
            "Not a Nami specialist.\n\nMandate rush has higher pick rate and win rate.  Think the synergy with her kit is just too strong, she really likes AP and she gets easy procs with her E slowing.  \n\nHelia probably good second after though, in match ups where you can reliably get procs (I don't know if her E generates shards).",
            "Try /r/NamiMains. :)",
            "I think in general for ADC's, PTA is preferred by a vast majority of carries for a long fight rune (giving a % amp + solid proc damage for trading in lane).\n\nI think you'd only really go Conq if you really benefit from the raw AD and if you might not be proccing PTA consistently, i.e. caster ADC's like Ezreal that don't run fleet for short fights.",
            "Conqueror has always only been good on champions that can stack it quickly via abilities and melee autoattacks. For most marksmen your options are PTA and Fleet.",
            "Do you have anything else on left-click? Only thing I can think of is binding R to left-click in games you play him.",
            "I'm not sure what you mean? What makes you struggle with his R specifically? You just hover your mouse where you want his R to aim at, and then you hover with your mouse where each shot should go and you press R for each shot I think.",
            "Frozen Heart",
            "Jak'Sho.",
            "You escort the wave to lane and you don't let the enemy walk past you. You can fight them for as long as it takes for the enemy minion wave to crash into your turret, then you need to back off and go catch the wave instead of chasing them further.",
            "Natural variation. The mmr system always tries to put you at exactly a 50% winrate, so as you win more you face better opponents and your games get harder. Sometimes you get a string of unlucky games (like enemy Draven gets first blood before minions spawn, then the next game you get counterpicked and your teammates lose lane, etc.). It’s best to just focus on your own improvement over everything because it all averages out over time and if you consistently improve and reflect on your gameplay you will climb consistently with a ~52% winrate",
            "If you participate in killing herald, you get a one-time empowered recall.",
            "Whenever one side pushes the wave/minions towards the other side, they have priority. For example, if the ADC has three giant waves of minions that they need to catch under turret, they can’t exactly come help in a dragon fight (no prio).",
            "The laner which has more kill pressure and/or wave clear, meaning they can rotate to help their jungler with objectives.",
            "it also means the laner who is stronger early or has better waveclear early and can move to skirmishes faster. like Tristana mid can push waves fast with her E passive and is strong levels 1 and 2, so it’s easier for her to “get prio” e.g. clear the minion wave quickly and go help the jungler fight for scuttle crab. the enemy can’t really stop her from doing it either because she’s so strong early. junglers will often complain about “no prio” picks like Kayle top, Zed mid, and Ezreal bottom because all of these picks are weak early and can’t push minion waves quickly and are highly susceptible to all-ins if they try to get wave control early",
            "Most swain players do not build much armor/mr. They are tanky exclusively because of their HP and healing, so LDR wouldn’t be particularly effective into them. As an ADC, though, you can typically just wait out his ult from outside of range.",
            "His E has short range and roots on the way back - either weave in and out of max range to bait it out (don't stand in minions, as the explosion when it hits minions on the way back is AOE), or move up close to him to dodge it easily.\n\nWhen he ults, disengage and wait until it runs out unless you're 100% sure you can burst him down.\n\nHe doesn't really build resistances and if you avoid his E and W, he doesn't get to stack up a lot of HP or either.\n\nHealing reduction is not necessary if you play around his R correctly or if any of your teammates have ignite, but it doesn't hurt to get Mortal Reminder instead of LDR if there aren't any champs like Rammus or Malphite on enemy team.",
            "No",
            "he scales but he’s not a hypercarry in the sense that he’ll 1v5 the enemy team at full build the way a Kogmaw/Vayne can",
            "All you need is to go even as garen. Garen has more side lane pressure compared to sett so even if sett is more team fight oriented that means you can be other places on the map while your team can just keep them back",
            "Sett scaling is not as good as Garen. Play for the late game, not early game skirmishes. Consider TP over ignite, and you can go Phase Rush for short trades. Sett's biggest issue is getting kited, so the more move speed (via Phantom Dancer, Hullbreaker, boots), the better.",
            "Before the changes he was all about shoving and roaming with package or poking with rockets while trying to scale for mid-lategame, which mid was the best role for because it's in the middle of the map (more roam opportunities) and it's a short lane (harder to overextend when poking and easier to scale up). He was maxing Q first.\n\nNow his best build is E max with lethality, focusing on the unavoidable damage from E and AAs and he's no longer a lategame champion, he is now a lane bully that falls off in lategame. His E is a 300 base damage + 250% bonus AD AOE ability with 690 range that also shreds up to 24 armor and magic resist, allowing him to deal true damage to squishy targets through minions while still being able to AA and chase enemies down during it.",
            "Well, there's a few reasons:\n\nA big part of it is team comp. Mages can be played bot, but their biggest issue is late game scaling and having too much AP on their team. Merc Treads counter the lane entirely.\n\nAlso, Corki's weird AP/AD mixed ratios lead to him being more of a bruiser, building AD items like Eclipse and AP items like Shadowflame. Not to mention, having package meant that he was more level-reliant, and needed tankier stats to be able to make package plays.\n\nCorki's AD conversion and new passive pushes him towards Lethality and Crit builds, meaning that levels aren't nearly as important for him. He was also given less rockets, meaning that he couldn't proc the same items as often, which he did in mid lane. This effectively turned him from a poke mage/marksman hybrid, to being an auto-attacker focused marksman. The perfect home for a champ like this is in the bot lane.",
            "From hardest to easiest: Kindred, Graves, Udyr, Kayn, Master Yi.",
            "I play for 2 reasons:\n\n1 - I like fair competition (usually provided by competitive games with match making. Trust me, the other option would be boxing IRL, which I do, but there is no way to make sure your opponent is at your level).\n\n2 - I like to impress my friends. Truly. So everything I need to do is be better than then, or at least at their level. This is today between gold and emerald. \n\nThat's why I don't care about my ranking. I always play to win and try my best, but I'm not trying to be \\_the best in the world\\_ so my ranking actually doesn't matter a lot. Also, 99,999999% of the people playing are just playing to have fun, everyone has a life outside of the game that matters way more. Even if you are a kid, being good at the game is way lower than at school. Play for what you like, not for others. If you don't like anything, just play something else.",
            "Amumu, Illaoi, Sejuani",
            "[https://www.lolrecommender.com/](https://www.lolrecommender.com/)\n\nSwap to \"Tags\" and select couple of things you want your champ to have",
            "I just tested in practice tool with target dummies. It was very strange. If the closest dummy is behind Baron, it completely changes its attack pattern. I don't really have the energy to test in more detail right now.",
            "Nope, it doesn’t include the owner.",
            "sure, you could do something like that or dodging to create a large gap between your visual rank and hidden mmr. but there's no real advantage to doing so, since the difficulty of your games will be determined by mmr anyway.",
            "A similar strategy was abused by some players to reach extremely high MMR in challenger a few seasons back (I believe the person who did it even ended season as rank 1 EUW back then).\n\nThey would duo queue to D1 100 LP, dodge in promos (back when promos were a thing), and repeat until they had extremely high MMR while still being able to duo queue in D1. Then when they got to challenger they'd be getting like +35/-15 because of how inflated their MMR was.\n\nI'm not sure how feasible it would be to do it using decay though, because that would take a lot of time (it takes 28 days for decay to kick in).",
            "Depends on the first time player. If the first timer has played similar games before then it is possible. If he hasn't then probably not.",
            "It hit Varus but he had a spellshield from edge of night so the ult was nullified.",
            "The 3 champs your friend plays are all very different from each other, but I'll give you some recommendations that come to mind:\n\n1. Nocturne - very easy to play and learn, clears well, has nice sustain, very long range ult, so you can easily help  your friend or your teammates if you are nearby and you see an opening to ult. \n\n2. Karthus - almost the same as nocturne, but ap version. Good clear, very healthy, good damage, good scaling, has a global ult, so in case someone steps in your friends shrooms when they play Teemo, and they survive on low hp, you just tap r and boom, they die. He is a bit harder to play since you need to learn how to land Q's, which comes down to understanding how enemies move.\n\n3. Nunu - this is a champ if you just want to farm a bit and then perma gank. Later on, if your friend is invisible on mid lane as Akshan, you can just roll in on enemy on mid lane and just kill them, since they can't react fast enough to Akshan coming out of invis and you rolling in. You can also flex him between ap or tank, depending on what your team needs.",
            "It's hard to know what's happening unless we see a vod. But one thing I have noticed just from checking the last 3 days of gameplay - you are playing WAY too many ranked games a day, 12 today alone. Also notice a lot of champs. You need to have 2, maybe 3, that you need to focus on at that rank. You can't improve if you're doing game after game, not watching back your games and trying to learn where you may have gone wrong. 3 games a day max is what I'd recommend firstly. The rest I can't advise on, as we'd need to see vods, see what you're doing post-lane phase.",
            "You can sidelane, you just have to be aware of missing enemies and not overextend. It also depends on what champion you're playing and what the enemies are playing. An ADC like Vayne can sidelane just fine because she can outplay most champions in a 1v1, an ADC like Kog cannot. If enemies don't have any mobile threats (mostly assassins and duelists) then you can splitpush on any ADC because they can't catch you that easily.\n\nIf you assess the situation and decide that you absolutely can't sidelane this game, your best bet is to group with team for a fight and then move back to sidelane to catch farm when wave bounces back, or farm jungle camps if there's no fight.",
            "I hate your build. Kraken rush on crit champs is absolute dogwater. I know the 1 item spike feels good but you're delaying your core crit items and you end up having no slots for defensive items because of it.\n\nIf you went IE+PD rush, you would have an extra slot for Shieldbow or Merc Scim while still being able to grab LDR and BT.\n\nAnd yeah, ADC is definitely not a role you should play when tired. Your positioning and mechanics need to be on point, and in this particular game I wouldn't even think about walking up to enemies without having Cleanse or QSS up.",
            "[https://www.youtube.com/watch?v=NEPBvZdZ4Ys](https://www.youtube.com/watch?v=NEPBvZdZ4Ys)",
            "Generally the easiest role is support because you don't need to last hit and can just focus on everything else, like trading, roaming, etc\n\nThat being said when you start as a support main it is very difficult to play other roles later on because farming minions is such a core skill.",
            "By default it should be h i think ",
            "The way to counter Garen is by simply spacing him. He has no dashes, his kit is very linear, the only way he kills you later is if you facecheck an unwarded bush. This will also depend on the champs you like to play. If you are ok with sending your opgg or just listing here your champion pool I could help you more that way. If you don't give him an advantage early, meaning you don't give him random kills and plates, you will just run him over.",
            "he struggles vs champs that build eclipse or some form of sustain like sundered or hydra that counter his trade pattern. garen has very few winning matchups in the early game, just try not to take equal health trades with garen unless you can permanently poke him, due to his passive healing",
            "The fundamentals for all lanes are the same. Once you get good at one lane you will rise in skill at the others as well. The exception here is jungle. If you become good at mid and jungle you will be good at everything.",
            "Yes, though how easy it will be depends on the role.\n\nTop is an island and you can climb perfectly fine just playing splitpushers and doing your own thing if you're really good at it. You don't need to understand other roles.\n\nSupport on the other hand has to understand ADC because you're laning with them and jungle because you're roaming and establishing vision with them.",
            "> Unique – Blackfire: For each champion, epic monster, and large monster afflicted with Baleful Blaze's burn, increase your ability power by 4%.\n\nYou gain ap while enemies are afflicted with baleful blaze. Once they are no longer afflicted you also no longer gain ap.",
            "As Sivir, you have to understand that you have a weak lane phase. She excels at clearing wave and there's nothing more to her in laning phase. Yes, you are short ranged and will get poked easily. She is not a lane bully so it is better to avoid trading with autos, but it is ok to throw a high value Q if it hits both champs. Her base AD is also so horribly low that you can't even last hit properly with her. Removal of Lethal Tempo has also been hard on her.\n\nWhere she really shines is mid to late game where she can fast push waves and join teamfights and mind you, she is very good in teamfights with her bouncing W hits (which crit!) and Movespeed ult reset on takedowns. Another situation she shines is playing from behind because she can just keep clearing waves till you reach your item breakpoints after which she goes ham. I'd say she is strong at 2 items (ER, Navori). At 4 items she is strongest because at 100% or nearby crits, her W bounces do serious damage in teamfights.",
            "it’s good as a 4th crit item to get 100% on champs that only need one zeal item, like aphelios. it also has a good interaction with hurricane where the hurricane bolts also apply the yuuntal burn",
            "Disable legacy cursor in options while in game",
            "cassiopeia can be played top mid and bot and has some of the best side laning in the game, viktor can also sidelane and hold his own in a 1v2",
            "Sylas 100%",
            "No, his winrate is just high. Maybe because of the new burn item?",
            "Lulu's kit is very useful in the right situation, you might want to learn an easier champion, lulu has too many variations in her spells. Learning something like Janna might help, or just learn Neeko since she can be somewhat similar to Lux.",
            "They are important and should not be ignored. While you can win without them it is far safer  and reliable to win with them. Especially since your enemy could get them instead and use them to become stronger than you.",
            "what are you doing instead of these objectives? If you're just chasing kills you're playing COD, if you're pushing a side lane at the same time as your team is going for an objective, you're helping your team get the objectives by creating pressure elsewhere on the map.",
            "Drakes give stat buffs + global gold + 4 = Elder which is a crushing advantage. Baron gives a very strong push advantage. While conceding either is not necessarily a death sentence it will make for some uphill sledding. Dragons you can concede early and not be too concerned as long as you don’t let the enemy get to 3",
            "You should always have an objective in mind while playing but turrets and plates are also objectives. If you dive top and get top turret and they get drake. It's fine, you got something in return. If you dive bot and get plates while they get grubbs it's fine, you got something in return. Just don't give up objectives for nothing in return. If  you lose bot turret and get top turret it is fine, if you lose bot turret and you just farm mid or top you are losing objectives. Mid T1 is more important than bot T1 and giving up second drake for mid T1 is worth it.\n\nDrakes alone are not the winning factor. Soul is a means to help you close out the game. So getting those first 3 drakes while ahead early game might force them to fight a soul at 25 minutes instead of them being able to farm and get back in the game.\n\nBaron helps you siege their base. If you get baron it is easy to get all T2 turrets. Usually 2 turrets during 1 baron push, then you siege the other T2 without overextending and giving shutdowns. Baron makes you not overextend while sieging turrets. You can just defend the cannon and don't have to walk up to hit the tower. The enemy can't just clear the wave. Without baron you might be forced to dive to get the turret. With baron you are not.",
            "I've had that before. Depending on how many champions you've played so far you could try new champions but I usually just play a different game for a few patches and come back when the meta is a bit different.",
            "Take breaks, I hit my ranked goal in a previous split and lost a lot of motivation to play and pratice my champions. Didn't play for a few months and gained motivation to come back and play jungle Vi.  I've also taken breaks when I felt like I wasn't really advancing skill wise on my champion/role. It happens sometimes it's better to relax and chip at it later on.",
            "As the other person said, take biscuits if you have mana issues. Think about why you use your spells. Don't use any spells only on the wave except if you want to reset or you really need prio because there is a river fight about to happen. Don't use spells to hit yasuo when he has his shield active except if you are full mana, so you get your mana regen ticking. Try to not back before having enough gold to get lost chapter. If you can't afford it, sapphire crystal increases your base mana by 250 which is nearly a 50% increase. It doesn't give you damage tho so it would be nice to have your mana issues under control so you can buy more dmg. Your first back doesn't have to be a tp. If you can use all your abilities on the wave to crash it as fast and possible and the next wave is a canon wave, do not use your tp. Just back buy your components and get back to lane. Then next time you are out of mana you can base buy lost chapter and other stuff and tp back and you shouldn't have mana issues anymore. Also if you don't miss any cs you might be able to buy lost chapter on your first back, so work on your csing.",
            "Take biscuits in your runes and use them when you are next to 0 mana to get the maximum benefit. Whenever you are trading with enemies, try to hit minions as well, so that way you are pushing in the waves. If you are getting dove under your tower with no mana, you screwed in lane management. Try to reset when the next wave that is coming is a cannon wave, since it will still take enemies longer to clear it and it will give you more time to come back to lane with items and hp/mana. Consider using Cosmic Insight as well since it will lower your TP cooldown.",
            "Fed Yi can do this over and over again if the opposing team doesn’t have good CC or doesn’t hold some for him, but it’s less rolling in 1v5 and steamrolling and more jumping into a team fight after it’s already started and cleaning up",
            "From what you said I'll assume you are a jungler, if you are not, let me know which role do you main. \n\nFirst thing that comes to mind is to play a champion that is good in a 1v1 fight or is very mobile. Kindred, Graves, Nidalee, Elise, Rek'Sai, Master Yi, Talon are just some examples. Champions like Evelynn or Karthus can easily get bullied. They scale very well, but if you fall behind early, you're screwed. \n\nSecondly, unless you are playing in high GM lobbies, you can never truly be \"so far behind\". You have to play league like it is a single player game if you want to climb. You take all the kills and all the farm. All the gold should go to you. If you are good enough, you will carry any teams and win 90% of your games. If you're not yet on that level, that is fine, play more until you become better. Yes, some games are lost, I agree with that, however, most of the time when people say \"ff 15 gg\" they say it when you're only like 3 kills behind. If you don't mind, send me your opgg and let me know the game that you felt this happening. \n\nLastly, only focus on yourself and what you're doing in the game. Ignore your teammates and all the random things that they are doing. Go for plays that YOU think will give you the best outcome. If I go and I play in emerald lobby as a GM player, I'm not going to listen to pings that my teammates are throwing at me, since I know that what I'm doing is a better play. I'm not saying this to boost my ego, I'm saying this to hopefully help you understand the mindset that you need to have if you truly want to climb and get to any rank you want. Listen to yourself and believe in it. Good luck on your climb!",
            "you can bind target champions only as a mouse button. personally i have it as my top mouse button and hold it when im autoing champs in a wave.",
            "Ahri is like this",
            "maybe taliyah you can outplay everybody at lvl 3 onwards with your combo and have impact on the map at lvl 6 with your R. Late game your combo nearly oneshots enemies. Your Q ability also takes a lot of skill expression to master with the worked ground.\n\nAzir has less impact early game but at lvl 6 you can outplay your enemies with your R and you are one of the best scaling champions in the game. Not that hard as everybody says to pick up but really really hard to master.\n\nAhri is always impactful but she plays like a little like an assassin lategame, trying to flank enemies hit the charm (crowd control spell) and oneshot them if you are ahead.\n\nsylas is a melee mage/bruiser mage who steals enemies ults so it depends on the enemy team if he is a good pick or not.\n\nsyndra maybe. You can outplay enemies with your QE or WE early and you have some sort of stacking passive that helps you scale into the lategame but I am really no expert on syndra so you gotta try it out for yourself. Also a pretty difficult champion in my opinion. Not quite azir level but definitely up there.",
            "Yes but it's just soft resets. Shows what you ended the split as",
            "He is a really annoying poke champ but pretty squishy. If you have a gap closer like irelia camille renekton you could get on top of him. Try fighting him before he pokes you too much. He only has dmg on his E if he goes ap and that spell has a 12 second cd at every lvl, so as soon as he uses it you win every fight. If you play something like renekton and he E the wave you can double dash on top of him and do your combo. He might wither you, but he isnt ranged so if he is out of your range and you are retreating he cant trade back.\n\nIf you are playing something like garen or darius you cant catch him but he doesn't stack his Q so he doesn't scale very well. Just don't stay in the wave so he has to decide wheter to hit you or the wave and remember when he uses E on you, you can deny him the wave for 12 seconds.",
            "Talon, Akshan, Ekko, Zoe, Taliyah, Fizz\n\nIf you truly master one of these champions to their maximum potential you will be challenger.",
            "One you will enjoy playing that much",
            "Can't help you with match ups, sorry. But as for items, try having a look at lolalytics.com\n\nThere you can see winrates for different items in different orders so you can see whats best.",
            "Leona",
            "Leona, Rell, Naut, Braum",
            "It's completely fine to sell tear, it's a very cheap item so you don't lose much. That being said I think you undervalue fimbulwinter. At the point where you are building it you're definitely not in lane anymore so matchup doesn't matter, the entire enemy teamcomp does. And unless they are all ad fimbul winter will perform better because hp and shields are good against mixed damage. Frozen heart and fimbul winter also synergize well together so you could build both if you get the chance.",
            "If you're not building into Fimbul then the only reason to have Tear is for mana fixing, so you could sell it whenever you judge mana to no longer be an issue.",
            "you go to [leagueofgraphs.com](http://leagueofgraphs.com) enter your [name](https://www.leagueofgraphs.com/summoner/euw/Ceddidulli-EUW) click on the [game then copy the link from your searchadress bar](https://www.leagueofgraphs.com/match/euw/6977896737#participant4). If you want a replay well there you have to either have an external program to record it or highlight the whole game in the lol client. I haven't found a way to change the rofl file to anything else.",
            "It is really annoying. If someone disconnects and you are able to have a surrender vote with only 4 people then you get guaranteed lp mitigation. If you dont get that option then I don't think you get lp mitigation. But it seems to not be consistent.",
            "The highest dps yes.\n\nThe highest dmg by one auto/Q are stacking abilities like veigar Q.\n\nThere are also some abilities like evelynn R that deal absurds amount of dmg when she is full build.",
            "With those gains and loses, I think it would be better to make a new account, since it would take you way too long to climb. Smurfs might also be a problem, since there's a lot of people who get joy from buying iron accounts and then \"style\" on lower elo players. Those people are disgusting and you might encounter them during your climb, which might make you want to quit the game. \n\nMy suggestion for you would be that on the new account, only play ARAMs. This will force you to play a lot of different champions and it will allow you to get a general feel for which champions you might enjoy playing. Here is my suggestion for each role for what it's worth:\n\nTop - Garen, Sett, Mordekaiser\n\nJungle - Warwick, Volibear, Nocturne\n\nMid - Annie, Lux, Trsitana\n\nADC - Ashe, Miss Fortune, Tristana\n\nSupport - Soraka, Leona, Morgana\n\nI wish you the best of luck on your climb!",
            "Depends on when you play in terms of time and on which days. From mon-fri there will be less people since they are working/going to school/training etc. The role that you pick also might have an impact on queue timers, since if you want to play a role that a lot of other people want, the matchmaking system might find it hard to get you in a game. Usually most people play between 2pm-8pm (from my experience playing on both EUW and EUNE).",
            "I could give you some advice since atm I'm just chilling lvling up a new account. My peak is 600lp, so I would say I know what I'm talking about in terms of advice. I am not yet on a challenger level, but I can help you get to higher elo. Send me a message here if you are interested.",
            "The reason is that Kraken Slayer has all of the things an early ADC could ever want.\n\n- Attack Damage\n- Attack Speed\n- Increased Poke\n- Increase All In Potential\n\nIt is all best in slot for ADC. Now obviously you'd want to get CRIT stacking asap, but with no item having CRIT + AS + AD existing period - Crit is the stat that you'd drop unless you get IE first which makes your 25% crit more worth it.",
            "You are correct - it is not a good default item for crit champs anymore and the only reason to buy it is for the 1 item powerspike. After that it falls off a cliff because you don't have IE, you don't have LDR and you don't have a Zeal item, and you need all 3 if you want to deal consistent damage on a crit champion.\n\nRn only on-hit champions should be buying Kraken.",
            "No it is not trolling to play naut jungle in quick matches.",
            "yes to both although heal just gives you only a fifth of a second longer to live but every milisecond might matter",
            "In Bailout you are given full HP in grey health and that decays iverv3 seconds. Healing will marginally extend, and you can kill them out if it just like Sion",
            "Most common 1st item is Lich Bane because it synergizes with his Q and W and gives him everything he wants - AP, AH and MS. If you struggle with mana management, Ludens is also a viable 1st item but a lot of Fizz players skip it nowadays.\n\nFizz functions the same way regardless of teamcomp, so there really isn't much build flexibility there. You could maybe look for a burn build (Torch+Liandry) when you're up against a very tanky team but you shouldn't really be picking Fizz into teams like that anyway.",
            "Focus on not dying and farm as well as you can. Bad supports are the curse of adcs so you just have to suck it up if you play the role. The best thing you can do is try not to feed yourself and get as strong as possible so that if the enemy fails to end the game you can still have impact in the later stages.\n\nI've had quite a few games where my team was able to hold out long enough for me to get to 4 items and start dealing relevant damage.",
            "* Yummi and Soraka are both strong sustain supports. Because of this, you can afford to take small auto attack trades that the other ADC cannot. You should be trying to poke and do short trades as much as possible--especially at level 1-2. In engage support vs enchanter support matchups, your success often comes from how much pressure you apply at level 1. \n* A double range bot lane should have lane priority at level 1 unless you misposition severely. Ensure you get level 2 first to force them to back off for a few moments. This small level lead can give you control of the wave and make it difficult for the engage support to all-in without taking major damage for it. \n* Learn to concede minions you cannot contest. If your support is not playing well, you need to step back. A CS lead can be overcome by being the better player in skirmishes and teamfights. A snowballed lane is much harder.",
            "Punish the engage champ as soon as they move into range. Don't turn and let them walk up for free because if they land that hook you will die, lay down as much damage as you can as soon as they start running at you. \n\nPlay around the minions, force them to tank the minion wave and hide behind the creeps to block their hook. Try to keep the wave either near your tower for safety, or keep a bigger wave so they can't engage as easily, depending on the jungle pressure and game state. \n\nDon't be too afraid and as long as your support is actually supporting and doing what they can, you should still be able to face them down if you punish them for their mistakes properly.",
            "Jg Kha",
            "Viego. Guy literally got a job with Riot because of his inputs on viego.. forgot the guys name. Can go into an AugustUwU stream and ask him",
            "Once you have learned the mechanics a bit (maybe try practice tool or normals), and decide to start playing them in ranked, limit test for a while. \n\nBoth these champs can push themselves way further than you expect in an all in. Especially champs like WW top with barrier, he can go to 100hp then win an all in against most top laners from full HP using the barrier to block burst combos. \n\nJust try and fail and you will learn your limits far better than if you play too safe and don't learn anything.",
            "Darius beats Mundo hard early. Darius should be trying to pressure and mundo should be trying to play trade avoidant and farm safely. It becomes a bit better for mundo as he starts to get components. Once he has first item Mundo can start to trade but most likely loses a 1 v1. Late game mundo is significantly stronger than Darius.",
            "If it's fine with you, could you share your opgg?\n\nSmurfs exist in every elo, and the videos you see on youtube about people climbing, that is the same situation that you are in. A challenger player starts in emerald. Ofc it's going to look like the emerald player has no idea what they're doing. \n\nMaking a new account depends on your lp gains, if you get like +21 -19 then yes, make a new account and only play arams.",
            "Depends. If you can get more kills for your death, 100%. Also, engage supports will on average die more.",
            "Hey! Welcome to league! Everyone learns differently and really it's up to you to determine what works. That being said, I'd say you're still SO new to the game that you can still learn passively. The game is so deep, I'd say that you'll continue to just absorb knowledge through your first 1-2 years of playing.",
            "Your pool is missing an ap champ, so consider Gragas, Kennen or Rumble. Wouldn't recommend Ornn since tanks in soloq are a nightmare. They are only good if you want to be carried, but sine you said you like Garen and Rene, it seems like that's not the type of person you are. I wouldn't recommend Jax since his ban rate and pick rate are rly high, so you won't be able to practice him a whole lot (he is in top 5 banned champions for top lane from emerald all the way to challenger on EUW)",
            "Because having flash is an essential thing to have for most ADC champions. Ezreal does have his E, but it is not an instant cast. Also in pro play, people are not looking for solo kills as much, since, unlike soloq, you have 5 members on both side talking to each other about what they want to do.",
            "Pretty much yea, but you can still itemize vs tanks on some champions.",
            "Sadly this just happens. Luck of the draw :'(",
            "Stop fixating on your teammates, they're out of your control anyway.\n\nI disagree with taking Tabis here - both Swifties and Merc Treads would have made it easier to reach enemies. Also should've been Stridebreaker instead of Triforce unless you only want to perma splitpush (but then you should also have gone for Hullbreaker and taken Legend: Alacrity in runes).\n\nAnd where is your Ghost? The only real weakness juggernauts have is lack of mobility, you absolutely need to be running Ghost if you want to have any chance of reaching ranged champions in teamfights. TP is a luxury that a champ like Darius cannot afford unless you can't teamfight anyway and need to be perma splitpushing (but then Darius is a horrible pick anyway), in which case you'd probably be best off running Ghost+TP.\n\nYour CS was good until ~16 minutes in, then it started falling off and you ended with lowest CS out of all players in that game. Bring it up to a consistent 7-8 cs/min.\n\nAnother minor nitpick I have is taking Unflinching, that rune is straight up trash.",
            "fiora camille riven \nrengar evelynn/fiddle kindred",
            "Most toplane splitpushers are selfish and don't rely on their team to execute their gameplan pushing sidelanes and drawing pressure instead of grouping and able to win outnumbered fights when ahead.\n\nA carry jg can also be a viable option snowballing from kills and taking all resources to self that is what alot of elo boosters do a big jg gap usually carries an entire team even if the rest of the team are losing you have control on the general tempo of the game from where to path and gank and objective control.\n\nThere are multiple champions that fit both niches so I suggest taking a look at general splitpushers on toplane or carry jgs, of course it's also possible to hard carry with other roles but they are more reliant on team play so it's easier with top and jg playing a snowbally midlane can also work and having impacts via roams the worst would be adc that is heavily reliant on team and support can carry via enabling others but less by themselves since they are gated by their xp and gold income.",
            "Keep your gold income high and actively avoid the fed enemies until you hit your spikes.",
            "You need a team to win, you can only carry one bad player, two if your other players are exceptional.",
            "ranked is a marathon not a race",
            "No cap bronze is a mixed bag, sometimes you get these genuis players and sometimes people that can't even click around their champion right.",
            "I love lolalytics! That's the main stat site that I use. However, that's not what I'm really looking for. Something that has more like pages for items themselves, i.e. for the page for Statikk Shiv, it lists stats like the \"top wr% users are these champs,\" or \"most commonly built by these champs,\" etc.",
            "I do play what I find fun, and I've just completely moved my champion pool down to only those who I find fun. I've demoted to Bronze and Lucian is on a 31% WR. I don't know where you'd submit replays for review or if there's a thread of it, but I just do not have the time (or self confidence) to watch myself mess up. I'm trying to get past that. I feel ashamed that I'm Bronze and that I've lost so much, I know I shouldn't be (ashamed of my ranked that is) either.\n\nStill, this is good advice, I do that as well. I try to weave in passive with every ability that I cast. Short dashes were something I didn't think about, I should try that more often.",
            "I just looked, and it seems that out of the 21 games I've played Lucian in ranked, my WR is 30%, so that's only 7 games won out of 21.",
            "Thank you for your detailed reply. I guess I am still very much unaware of the power level of individual items and each stat - I cannot really say how much difference 50 Armor will make in itself. What you say makes sense though, if I am in a bad position I will probably die either way. \n\nYour item suggestions sound interesting though. I think on Ahri I rely too much on Malignance as a first item for the haste on my R, as it seems so crucial to her playstyle. But on Lux maybe the Archangel route could be worth a try.",
            "I’ll have to look, probably don’t want to do that though. I think I’ll just have to get used to it",
            "is frozen heart worse vs crit then? Or they about the same in terms of effectiveness ",
            "Thanks dude",
            "That makes sense, thank you!",
            "So heal cut and don't fight",
            "Also experiment with conqueror and phase rush. Conqueror makes you way stronger earlier and with ignite it makes garen a pretty scary level one champ. I’m not sure if it would beat sett level one but it should make it at least even with an e start.",
            "ah okay, that make sense then",
            "Oh okay, thanks for the answer. I guess he might still see some play mid tho, kinda like tristana even tho his main role is gonna be bot?",
            "A good response. What would you say you do about slumps? I just got demoted to Bronze III and I feel like a failure.",
            "Thank you = )",
            "Thanks for the insight. I usually never play this many games, but I was completely free these past couple days so I basically spent all my time on ranked lol\n\n  \nI realize that the champ pool may seem large, but I've played these champs all in the past (at least old m7) in ranked. I'm generally plat when playing adc so not to sound egotistical, I feel like Im better than 90% of the silver players mechanically. \n\n  \nIdk though tbh I'm the one on the losing streak after all lol",
            "appreciate the reply, this should help! thank you!",
            "First game I tried it last night on Jinx, won't do it again. The 1 item spike really did feel good and I had IE very early but still fell off with it I think.\n\nAs far as Kaisa goes it seems to work out though. Kraken and pickaxe for Q evolve is pretty solid.\n\nFor that game I think I really did need merc and cleanse.",
            "I'd advise against learning support first, learn mid or top.",
            "I have learned only JNGL and ADC so far, does it mean I dont have to learn role fundamentals for the others anymore?",
            "Mid plays completely different than sidelanes because it's so short and open. Botlane plays completely different than top because it has twice as many players in it and is much more gankable due to different terrain.\n\nThe only thing that stays the same is lasthitting but how you control waves, trade, roam, position etc. is all different.",
            "I'm thinking about playing jungle and mid. I do think these roles do compliment each other though I never learned properly how to play mid. I carry most of my games as an ADC but it feels like day and night if I switch back to jungle and I kind of lose my pace. Lmaoo maybe I'm being delusional and its just my mindset, what do I know.",
            "I see, thanks! I will try to capitalize on those strengths.",
            "What ADCs are building 2 Zeal items? I always thought you only ever built one because you’re gimping your damage otherwise.",
            "I'm an ADC player but this also applies. Thank you for your advice, and if you have more don't hesitate to share.",
            "Okay, thanks, I think I want to try azir",
            "Thanks. Heard Fizz is really hard after Master. Been watching GM Fizz OTP last few days",
            "That is one of my problems. Neither dislike or really like any champs",
            "I'll give her a try, thank you :)",
            "Thank you too! I'll give them all a few games :)",
            "Yes completely random",
            "oh yeah ik what i wanna play, and my only real problem is csing so i dont really aram would help with that that much, but ty for the answer",
            "Thing is, nobody is forcing you to complete a single item. Kraken is 50 AD, 40% attack speed, 7% movespeed and the 3-hit passive for 3100 gold. BF Sword+Zeal+2 daggers is 40 AD, 35% attack speed, 15% crit chance and 5% movespeed for 3000 gold.\n\nKraken only outperforms IE+Zeal item as a 1-item powerspike and it's mostly because of the 3-hit passive. From 2 items onwards it's dogwater compared to just going straight crit because it takes forever to get IE+LDR+Zeal item, and it leaves you no slot for a defensive item.",
            "Thank you so much!! Last night was my first game back in LoL in a long time (Non ARAM/Non-Bots).  It was just a normal, but I went Mundo into Darius.   If I didn't know better your explanation was as if you were narrating my match! I got beat well early - but only gave up one lane death - and ended up going 6/3/11 to Darius's 2/5/0 (and I beleive AFKd at the end).  \n\n&nbsp;\n\nIt felt 'good/right', but I wanted to be sure my early game should have been that 'tough' - I do need to learn to farm under tower better, I did 'okay', but he was way up on CS.",
            "I dont vibe with either of these ap champs sadly. Maybe morde? Does he scale well? Are there other good AP options?",
            "The problem is its neither right now. its like hitting 18 then finding out ur mom used ur social to open all these accounts and ur in debt",
            "i got down voted by the random bronze fake d4s lol",
            "Randuins best vs crit but if you just want 1 item and they have many high AS champs frozen heart wins",
            "Ehhh, tbh.. Not really. Tristana is played mid lane because she has high burst damage and kill pressure. She is an assassin/marksman hybrid, and can capitalize on any gank. With the removal of Corki’s AP and some of his rockets, Riot pretty much killed poke Corki, but his all-in isn’t strong enough to 100-0 someone. If you go all-in, you won’t have the burst damage to kill someone, and then you lack escape options assuming you used your W. Tristana, on the other hand, gets resets. This allows her to jump in, get the kill, then safely jump OUT.",
            "This is a really hard question to answer because I don't know what exactly you understand under role fundamentals. But generally you don't need to be able to play all roles to climb. Playing only jungle and adc is just fine.\n\nFundamentals like trading and positioning work just the same in other lanes, the champions are just different. The same goes for things like wave control and roaming.",
            "It works exactly the same. You might want to do different things but the fundamentals remain the same.\n\nFor example if you know how and why you freeze a wave, regardless of lane, then you will know when you should freeze. What lane you play doesn't matter for that. Freezes are more useful top than mid but the reason stays the same.\n\nRoaming is the same. You want to roam when you have your opponent pushed in so you don't lose any minions. Doesn't matter if you're top or mid or support. The situation is the same.\n\nThat's why they are called fundamentals.They are fundamental to your game, regardless of what role you play. Of course there are different situations in the lanes but fundamentals are universal and help you master all situations.",
            "ah im thinking of kraken/shiv/botrk, so non crit items that give good damage early",
            "As an adc main, if the enemy assassin is fed you just have to wait for a missplay on his part. Don't overextend past your turrets except if you are with someone. Wait for them to come to you. Watch where your teammates are going. If they don't leave you the midwave, try to get bot or topwave. Try to ping your team to catch enemies. If you are behind you need to get picks. Don't fight drake unless you are on a powerspike or it is soul. They can't end if you don't take a 5vs5 unless they get baron. Get blue ward (farsight alteration) and ward baron if you think they might be on it. But even then, if they get 2 picks and then turn baron it might be impossible to fight it. Maybe you can crossmap and take a tower. But then again it all depends on teamcomps.",
            "Fizz can struggle vs bruisers, but he counters any mage/adc mid laner after lvl 6 and later. Even vs bruisers, you can still win 1v1s, but you will have to play slowly and go for burst fights, meaning you do your burst with Q+AA+W and you E out and wait for your cooldowns. If you want to learn him go on youtube and type \"lol mango fish montage\" and watch how this guy plays.",
            "I realize I already answered but Nautilus is like this too. \n\nBoth being melee tank supports, in lane you need to avoid poke while picking your spots for a hard engage. you can play more defensively in team fights. Naut is a hook champ while Leona is the inverse, her E puts her on top of the target.",
            "Glad you are back to playing! Sounds like you played it totally how it should have been played. Let me know if you have any other questions or need any help!",
            "Akali, Voli, Gwen, Morde, Vlad, Kayle, Cassio are some that come to mind.",
            "Gotcha, yea that would make it harder for him to be played mid.",
            "He really is an inspiration. Yeah I've played vs an Urgot mid lol and I played the slow game and won vs him in lane so hard he rushed Maw",
            "Thank you for the further insight... I've thought about nautilus before but never took the plunge, let's do it :)",
            "Thanks. Last time I really played ranked, um 2017?, I used to be Jungle(main)/Support.  I've read jungle is not in a great spot, so I'm doing tankier Top/Support Pics. Mundo my top main (as OTP as I can for a while) and support will probably roll with Nautalis (my old support main) and want to use Braum as a secondary. \n\n&nbsp;\n\n**Question would be:**  Who would be good 'backups' other candidates for tanky Top/Support if I can't get Mundo/Naut? \n\n&nbsp;\n\nThanks.",
            "I think Jungle is totally fine if that is what you enjoy. Just whatever you’ll like most! As far as backups go, Skarner is a really good place since the rework and can be played both top and support. Zac is kind of an unconventional fun take you could try out too also. Braum as you mentioned sounds great as a secondary. You could also try out Leona if you like engaging like on Nautilus.",
            "Of course - Leona - duh!  And thanks, I just watched a PekinWoof vid on Skarner...but he makes most things look easy so wasn't sure. I might just keep Garen in back pocket...or while I'm in low elo - Malphite. \n\n&nbsp;\n\nThanks for the thoughts!"
        ]
    },
    "Vanguard Troubleshooting Megathread": {
        "title": "Vanguard Troubleshooting Megathread",
        "score": 76,
        "url": "https://www.reddit.com/r/summonerschool/comments/1ci3f05/vanguard_troubleshooting_megathread/",
        "content": "Hello SummonerSchool,\n\nWith the introduction of Riot Vanguard to League, we wanted to set up a dedicated space for users to troubleshoot their issues with the software. Please feel free to ask questions, detail issues or errors you experience, and give tips and directions regarding getting Vanguard to work properly. Feel free to also link videos or guides that are directly related to fixing Vanguard issues, as long as they adhere to all of the rules of the subreddit (especially Rule 9: No Paid Services).\n\nWhile we understand that this change and the software itself can be frustrating, rants and complaints about the topic are not helpful and will clutter up the thread. This thread is to help users fix their issues so that they can play League again, so any unproductive or off-topic comments will be removed.\n\nPlease see [this thread](https://www.reddit.com/r/summonerschool/comments/1chh5rk/riot_vanguard_isnt_working_for_me_and_i_cant_run/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) for current user-provided tips and work arounds. All future Vanguard-related posts will be removed and directed here.\n\n[Here's](https://support-leagueoflegends.riotgames.com/hc/en-us/articles/24169857932435-Riot-Vanguard-League-of-Legends#:~:text=Riot%20Vanguard%20is%20Riot%20Games,and%20a%20kernel%20mode%20driver) a post from Riot about Vanguard.\n\nApplications that are known to cause issues with Vanguard: MSI Afterburner, Rivatuner, Citrix\n\nAs a side note; we have no affiliation with the main League sub or their moderators, please stop talking about them in this thread. Keep comments on topic\n\nWe hope this helps everyone get back on the Rift. Thank you!",
        "num_comments": 495,
        "comments": [
            "Hey Folks,\n\nWe want to issue a reminder to please keep this thread related to tech problems and assistance. Please avoid simply complaining in this thread. We know it is frustrating having tech issues that prevent one from playing league, but try to understand that it's not a productive use of this thread.\n\nWe made the decision to create this tech help thread to fufill a demand that was not being met by the main reddit and to consolidate tech questions and solutions for Vanguard.\n\nWe aren't a tech-related subreddit, this is outside Summoner School's educational mission. But we do recognize this is important for the league community, so please report any threads that are complaints and lets attempt to keep this thread as helpful to the community as possible.\n\nThanks for your assistance!",
            "I can get into client but i'm stuck before loading screen. \"Reconnect\" screen and nothing. Kicks me out and made me lose LP.",
            "I think that Vanguard totally bricked my laptop. It won't start and I can't use it anymore.\n\nFor context, I was in an Arena game yesterday when I had a Vanguard error that said \"Vanguard needs to be running in order to play League\". I pressed OK and it closed my client. I tried launching the client again but couldn't reconnect to the game as the same error would appear as soon as I joined. I noticed Vanguard was active in my system tray so I thought \"weird, guess I'll just restart the laptop.\"\n\nIt turned off and now will not start at all. Pressing the power button only turns on the USB ports LEDs. Screen stays black, fans don't start spinning, and even the power button LED is off.\n\nSo far, I've tried:\n- accessing the BIOS upon pressing the power button. Nothing happened, no sound. Screen is off so I can't even be sure if didn't work. \n\n- resetting my BIOS. I disconnected my laptop main battery as well as the CMOS battery, then for two minutes did a bunch of holding the power button for 10 seconds before releasing it. I waited an hour before assembling it back but laptop still wouldn't start.\n\nAs of now, I called a Lenovo technician this morning. He doesn't believe Vanguard has anything to do with it, and offered to replace the motherboard. Would that even help? \n\nI apologise for the length of my message but am really desperate to find a fix. I work remote full time with this laptop so that's big trouble.\n\nWould anyone have any suggestions?",
            "I installed vanguard and it told me to restart my computer so I did and it keeps telling me to restart again.",
            "so any solutions for the massive frame drops with this new garbage from Vanguard?  \nI go from 500fps to 10fps just clicking around now.   \nmaybe leave things alone if they are working?",
            "[removed]",
            "After i get into a game, even when im just moving my cursor, fps drop to 0, leave every  and fps go back to normal, then got afk warning and lose LP. What an amazing game\n\n  \nEdit: I've found what app causing the problem. It's ultraview, So i guess you should completely exit any apps that do the same things (exit in taskbar and maybe in task manager), and the problem why be fixed",
            "Can someone help me, since vanguard is running on the pc I can’t use my Ethernet cable to browse, but I can if I use WiFi, the issue goes away if vanguard is uninstalled… I literally don’t understand why",
            "I've \"dodged\" 2 games already because of a vanguard error in champ select... it's absurd that I get a wait timer for something not my fault.  \nEDIT: Important to note this seems to be completely random, I've played 6 games today and had 2 errors in champ select specifically.",
            "having a huge problem with vanguard input lagging",
            "vanguard kicks my friends and claims its not running even though it is now I have 2 friends banned for a while due to this stupid software",
            "# I was in the middle of a game when I got a notifcation \"You need to have vanguard running to play\" when I pressed OK it kicked me out.\n\nI was in the middle of a game when I got a notifcation \"You need to have vanguard running to play\" when I pressed OK it kicked me out.\n\nDoesn't make sense I obviously already had it running and played a few games without problem I never disabled it and had it installed for a long time from valorant already so what gives? Made me lose a round of arena because of that.",
            "My FPS went from a stable 240 on high settings to 40-80 any settings, it's insane, a flex teammate of mine is experiencing the same, 60 fps ish with 500 expected",
            "This fucking trash ass software kicks me from games saying it needs to be running, while it is running, and then I get fucking afk banned and all the other shit, que timers, for leaving etc   \nI have done complete wipes of the client, league, and vanguard to no avail.   \nFix this stupid piece of shit",
            "Are there any players encounter this situation ? I installed Vanguard and received no error code, also restarted my laptop, I can launch Riot client, and click on League of Legend. The game popped up its name at first but then shut down and Riot Game relaunched itself. This keeps happening even after I reinstalled the game after making a clean uninstalling. I have my TPM 2.0 on.  This only happen after Vanguard.",
            "Anyone having the same issue I'm having?\n\nInstalled Vangaurd (as much as I wish I didn't have to) and played a few games just fine, then I started a new game and it said that I needed to have vanguard running to play despite Vanguard still running in tray...\n\nHad to restart my PC to be able to play again, gonna keep going and see how often this happens and if it's consistent.",
            "any idea how to fix this now? [https://youtu.be/CSBoi-BQ8ME](https://youtu.be/CSBoi-BQ8ME)",
            "is it normal that i load into a arena game, i play sett and get the wisdom of ages augment ; my game crash, and the games tell me \" you need riot vanguard installed to play the game\" then gives me a van 84 before crashing my game. How am i supposed to fix this as I HAVE VANGUARD INSTALLED AND IT TOLD ME MY COMPONENTS COULD RUN VANGUARD",
            "I get error saying i don't have tpm2.0\n\nWell my motherboard isn't TPM compatible\n\nSo i guess i can't play anymore ?\n\nAlthough i've played league for decades now in any system( that's the best part about league)\n\n\nThis Vanguard update is the worst update in the history of updates.\n\nPlease Riot roll back the Vanguard stuff or remove it completly",
            "Hey everyone, \n\nI found this sub while looking for a solution (I’m new to league and don’t know where the go to communities are). After downloading vanguard my game will not launch. I press play on the root launcher and it just disappears. I have tried giving permissions as well as opening from different source files. If anyone has had this issue and found a fix, could you please direct me to a solution. I haven’t been able to play since the update. Riot won’t respond to my ticket either. :/\nThis group seems much more welcoming to new players than the riot and official league page so I figured I’d give it a shot here.",
            "Is anyone else having latency issues ? my games either start off on good ping and then spike up to 400ms+ and stay there or my games just start at 400ms+ and *eventually* come down and only sometimes",
            "For all COMODO Firewall users, this solution worked for me :\n\nMy problem was : I could not run any game or replay and was stuck in the \"reconnect\" loop (going back to client everytime without ever going to loading screen)\n\nI managed to solve the issue using the COMODO firewall settings, If you're experiencing similar problems, here's what you can do:\n\n1. Open the COMODO firewall settings.\n2. Navigate to Advanced Protection and then to Miscellaneous.\n3. Locate and check the option labeled \"Don't detect shellcode injections in these applications.\"\n4. Click on \"these applications\" and add the Riot Games folder.\n5. Click OK on all opened COMODO settings windows to apply changes.\n\nScreenshot : [https://i.ibb.co/YBMJxpg/Capture2.png](https://i.ibb.co/YBMJxpg/Capture2.png)\n\nI hope this solution works for you too!\n\n(If that doesnt work, try adding all Riot/League/Vanguard related folders & EXE files separately, but it should not be necessary though)\n\nSource : [https://www.reddit.com/r/ValorantTechSupport/comments/16z6dq0/valorant\\_not\\_launching\\_and\\_no\\_error\\_message/](https://www.reddit.com/r/ValorantTechSupport/comments/16z6dq0/valorant_not_launching_and_no_error_message/)",
            "Any charitable souls willing to give advice on how to get rid of this thing? I wasn't so worried about it initially, but I use this pc for more stuff and can't have this shit ransomware running permanently. \nSince the update a couple of days ago, I've noticed my laptop (don't judge please) running slower, and issues with booting, issues with the hard drive, as well as the laptop not being able to wake up from sleep mode and needing a restart every time. \nTried uninstalling but the league/riot installer wouldn't even start. Manually deleted the files in user/appdata but not sure that solves it. The boot and sleep problems are still persisting. Maybe reverting to the last os image is the best way to go? \n\nSad to leave, given I just restarted playing this year after stopping a long time ago. Hopefully this crap will blow out in due time though.",
            "I was getting Vanguard VAN 128 error. To find what was the issue, I opened vanguard from the toolbar menu, and saw that [***EPMVolFlt***](https://www.google.com/search?sca_esv=f977441fd745688c&sxsrf=ACQVn08HWxTmAxtSrVy8ok3Kkb5sSMTvxA:1714652786084&q=EPMVolFlt&spell=1&sa=X&ved=2ahUKEwiM1-ix--6FAxUsgP0HHYQcCA4QkeECKAB6BAgHEAI) is causing the issue. After a research, I managed to solve it by deleting the program **EaseUS Partition Master**. Hopefull this will help to someone since I lost about 3 hours fixing it in all possible ways I found online.",
            "Anyone having the same issue I'm having?\n\nI'm playing tft, when I enter the game, the game automatically logs out and asks me to reconnect, the same thing keeps repeating when I reconnect and click on game screen so I can't play the game.",
            "I use ICUE because I have a mouse with 12 buttons from Corsair. These buttons are keybinded to my F1-12 keys and are fully used to play League with. (My attack enemy on move is on F1, communication pings on F2, vision ping on F3, and so on) and now I can't use it anymore at all.\n\nThis makes it incredibly hard because now my mouse is completely useless, not just in League but outside of it as well. I wouldn't mind if it was ONLY in League since I'm sure I can find a solution and re-train my muscle memory. But the issue is much worse OUTSIDE of League.\n\n  \nSeriously, what the hell? If there's no fix for this, I'm forced to uninstall League.",
            "I've installed Vanguard and restarted my pc after it told me to do so.  \nAfter opening League the play button is grayed out and it says \"The vanguard session is being started\"  \nI've tried reinstalling Vanguard and doing a bunch of other solutions, but nothing worked.  \nRiot support told me that its because of TPM 2.0 and to downgrade to Windows 10, but my OS had been Windows 10 ever since I began playing League so I have no idea what I'm supposed to do",
            "I found a fix for my issue! My launcher was opening fine, but pressing play just minimized the launcher and tabbing back into it i found an error message saying League failed to launch.\n\n[https://www.reddit.com/r/ValorantTechSupport/comments/uqbyn5/comment/jnf8crn/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/ValorantTechSupport/comments/uqbyn5/comment/jnf8crn/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nEdited this registry value from 1 --> 0 and now I'm in the client. So far so good, we'll see if i experience any further issues...",
            "    So, This is probably already a found trick on how to... Also, I was affected by the vanguardBeingDumbBug. So,\n    \n    This makes you able to play ranked and not reconnect, it's stupid but it works. MY ADVISE IS TO READ THE ALL THE STEPS FIRST WHEN YOU GET TO STEP #3!\n    \n    1. Do these steps first and then start the Riot client\n        * Open your \"Windows Explorer\" (The file window)\n        * Go to \"C:\\Riot Games\\League of Legends\\\"\n        * Locate the \"LeagueClient.exe\"\n        * Copy the LeagueClient.exe to your Desktop\n        * Right-click the \"LeagueClient.exe\"\n        * Choose \"Send to..\"\n        * Choose \"Desktop\"\n        * Right-click on the just created Desktop Icon\n        * Choose \"Properties\"\n        * Go to the \"Shortcut\" tab\n        * Replace the \"Target\" textbox text with \"\"C:\\Riot Games\\Riot Client\\RiotClientServices.exe\" --launch-product=league\\_of\\_legends --launch-patchline=live\"\n        * Choose \"Apply\" in the bottom right corner\n        * Choose \"OK\"\n    \n    2. Start \"League of Legends\" via the just edited shortcut\n        * Go to the \"Account/Profile\" Icon in the top right\n        * Go to \"Settings\"\n        * Make sure the \"Auto Patch\" function is enabled\n    \n    3. If Vanguard doesn't load with client  Do everystep, if your vanguard started with your riot client start from step 4(or at least show in the bottom right tray. (the \"^\" next to the time/keyboard etc..))\n        * Open your \"Windows Explorer\" (The file window)\n        * Go to \"C:\\Program Files\\Riot Vanguard\"\n        * Run \"vgtray.exe\"\n        * It will possibly throw the \"Vanguard has stopped C:\\Windows\\System32\\inout64s.exe\" (Don't worry this is an ongoing bug and Riot has still not fixed this after about 2 years now)\n        * In your tray (\"^\" next to your time bottom right of your screen)\n        * Right-click the \"Riot Vanguard Icon\" (REMEMBER HAVE YOUR RIOT CLIENT OPEN SO YOU CAN USE IT AFTER THE NEXT STEP)\n        * Choose \"Exit Vanguard\"\n        * Choose \"Yes\"\n        * Quickly hit \"Play\" in the Riot client that is open and on top of everything on your screen so you can be fast)\n    (NEXT STEP IS NECESSARY TO PLAY RANKED AND WORKS FOR ME)    \n        * In the \"Windows Explorer\" screen run \"vgtray.exe\" once more to start vanguard and you are able to play ranked again without getting thrown out for not using vanguard\n    \n\nedited for clarity",
            "Since downloading the Vanguard update. I can not get past the client, all i get is a message stating: \"Windows cannot access specified device, path or file. May not have appropriate permissions to access them\" I have done every online fix and none seem to work.\n\n\nI'm running on an old i5 6300 I believe ",
            "After the vanguard update, some of my right clicking goes unregistered. As in, my character wont attack the target for a significant amount of time. the duration is usually about 1-2 seconds but during that time I am standing still or even running into enemies despite me clicking to stop. This issue happens in both the main game, and TFT but surprisingly not in Arena (at least not that I have noticed).\n\nThe fact that it doesnt happen in arena, or any other game I play, means it is strictly happening in LoL and is not a mechanical (mouse) issue. In addition, this is a recent issue that has only started since the vanguard update so I can only really attest it to that.",
            "My riot client will open up, I press play, then it minimizes to the task tray, waits about 15 seconds. Then just continues to do that loop over and over.\n\nI tried clean install, reg edit fix, updates, running as admin. \n\nAnyone run into this yet??",
            "Things are little different on me. After the update, I can launch the game, normally choose champion. But when I enter the game, everything becomes sooo laaaag. All clicks are \"disabled\" I cannot open the shop or move my character or even press esc to exit the game. I have tried restart, uninstall, and no other virus scan software are running, nothing works. My system is win 10. LOL ban me TAT.",
            "New one:\n\nVanguard installs and runs just fine.\nLeague Client opens and runs just fine.\nOnce you go into games, champ select works just fine.\nAs soon as the actual game launches….no game. Just the league client on screen saying ‘Game Currently in Progress’.\n\nWindows 10 Pro, updated drivers.\n\nVanguard and Riot Client on same drive.\nSecure boot enabled\nNo VM running (disabled in Command Prompt).\n\nReinstalled Vanguard a few times, reinstalled client a few times. Tried client on different drive.\n\nAny ideas?",
            "after the vanguard patch I can't get into a game at all, client is stuck on and endless reconnect loop, and whenever i get into a game the client doesn't recognize that i own any champions except ekko and akshan? client will always just boot a black screen with the main menu and nothing else, I tried reaching out to riot support but now whenever i try to log into the support website it tells me that it's down and that i should try again later, so i cant submit a support ticket and i cant even get help from them on twitter. \n\n  \nanyone know a fix for the endless reconnect? or hell, any of the other issues?",
            "I had Vanguard installed and now my Discord is constantly bugging out when alt tabbing to check messages, any ideas how to fix that?",
            "I just qd for a ranked match and after the select i was supposed to get put into the loading screen only to have it full black and an error stating \"cannot connect to server\". I guess im not allowed to play? It made no sense because I had a stable connection and attempted to reconnect at least 5 times.",
            "Hey everyone, League was working fine for me until yesterday when I launched the client and the play button was grayed out and said \"Vanguard session is initializing\".  Has anyone got the solution to fix this issue yet?",
            "Ive lost 50 lp because my screen just freezes until it afk's out",
            "Every time I hit \"Play\" on the league client, the window disappears like it's loading, but league never actually launches. Just pulls up the league client again to click \"play\" on repeat.",
            "getting dodge penalty for a vanguard error during champ select. thanks riot!",
            "every league session i always run into vanguard issues. i play 1 to 3 games and afterwards i get into a game i get a popup saying \"vanguard needs to be running to play league\". i reset my pc but it still happens and the only way to play again is by restarting. this made me lose a shit ton of lp and now 2 accounts are locked out of playing for like 18 hours ;-;. is there a fix or no?",
            "I'm back again. My game still isn't running properly.\n\nThe vgc service stops as an actual game loads in and gives the van 0 connectivity error. Previously this meant I could get into a game but then I would have to restart the vgc service through Windows or by restarting my computer.\n\nNow the same issue is occuring and it's detecting that the service isn't loaded right before the game loads in, giving me an error stating that vanguard needs to be running in order to play (duh) and crashing the game before it loads in when I hit ok. Trying to restart the service during this message does not stop it from crashing the game and the error will come back and game will crash again upon attempt at reconnection.\n\nWhat's even worse is that the game I was in actually starts, so I am an unintentionally forced afk in any game I join because I can never get back into the game because of the constant service stopping and subsequent game/client crashing. The game is now literally unplayable \n\nDoes anyone have a similar issue that can help me fix this? This is driving me insane.",
            "New league player here. I’m having VAN error issues left and right and nothing’s working for me. Asking for a friend T-T\n\nI’m on Windows 11 and its been working fine since I updated. Here’s a timeline of all the issues and fixes i’ve tried:\n\n1. LoL client not launching (both shortcut and direct file)\n2. Tried launching riot client, worked but couldn’t log in with error message “sorry we’re having trouble signing you in right now”\n3. I tried going on the riot website to log in and launching riot client, it worked so i started a game but i got a VAN 68 error code and was forced to exit a game\n4. Tried uninstalling and reinstalling both LoL and vanguard, couldn’t launch client again. \n5.  I tried using vpn to launch riot client and it worked (turned off vpn after i was able to start client). I started a game but got ANOTHER VAN 68 error code. \n6. I tried ipconfig/flushdns and was able to start client and start game but this time i got a message saying “you need vanguard to play” and then later got a different error code VAN 185 and got booted out of a game again. \n7. Tried “exiting” both clients and restarting multiple times, same issues still persisted. \n8. Tried updating my laptop time zone bc i saw some ppl say if time zone is different sometimes it won’t work. Did this but still all the same issues persist. \n\nI’ve restarted my laptop painfully many times and it’s been 3 hours since i’ve tried to fix this issue. Nothing’s really working for me. Weird thing is i see the vanguard icon in my icon tray so idk what they mean when they say i need vanguard to play because clearly i do. I even uninstalled and reinstalled everything. \n\nSorry for the lengthy post but would really appreciate it if anyone who’s experienced something similar or know how to fix this can share their solutions. I’m a bit of a computer noob so I don’t even have fancy programs installed and i really only use this gaming laptop to play games. \n\nWould appreciate the help!",
            "ever since i had to get vanguard i literally can't get into a single game. it gets me through champ select then it immediately sends me back to the client with a big reconnect screen in my face. no matter what i do it doesn't work. i never had citrix, rivatuner or MSI afterburner.",
            "Alright so i have 2 separate errors, After every game, i get van error 0 and it closes my client in post game and then if i restart is gives me 128 and closes( i have fixed this by closing vanguard and opening league really fast) now the other issue is EVERY game even after a complete pc restart, i get into a game and it says \"vanguard needs to be running\" and closes the game. nothing has fixed this\\*including fresh restart, and other methods) and league has not responded to my ticket. I'm running on windows 10 this started on Tuesday 5/28/24",
            "Hi folks, \n\nso far I fixed the issue by uninstalling vanguard, so I am able to write this! \n\nWhen installing Vanguard and restarting my PC, all of my USB-Devices connected via an USB-Hub constantly getting connected and disconnected.   \nAnyone else facing this issue?",
            "After boot up the windows, there was a sudden flash on Monitor logo screen, and when I uninstalled vanguard it is now gone, what with the flash?",
            "Since i installed Vanguard, i can't play anymore. Its not allowed me into game, just loading screen and crash. Only when i exit Vanguard then i play normal but not for long. Restart the computer after that but i can even go to loading screen, just \"reconnect\" screen. Unninstall and reinstall can't fix this error. Help me : (  \nUpdate: I tried to submit a ticket to Riot Games Player Support. Got a respond and a way to fix it, but unfortunly its not working.   \nMy Recording : [https://drive.google.com/file/d/1zesSWy\\_5ggGgWrf99jFkAET6aTzr4NmY/view?usp=sharing](https://drive.google.com/file/d/1zesSWy_5ggGgWrf99jFkAET6aTzr4NmY/view?usp=sharing)",
            "Had the problem yesterday, that I got tapped out to desktop multiple times. \nNot sure if it was caused by Vanguard, but weird coincidence it started the same day. \nMaybe it's an overwolf or porofessor problem. \n\nMaybe MS Teams, that shit acted Up as well..",
            "\"Error 1067\" For me, i can launch a game but 2 minutes after vanguard stops and the game kicks me out. I Reinstalled Vanguard 3 times, Same for the the whole game, i enabled secure boot, Latest Windows Version (Windows 10 so no TMP 2.0 involved), Tried setting \"Vgc\" service to automatic. I tried everything i could think of and still doesn't work",
            "So whenever i want to play League,My Vanguard has a problem with this system file: SystemRoot/system32/Drivers/dump\\_diskdump.sys, I'M using WIndows10,had no problems with the game before Vanguard.Just reistalled my pc like a month ago.Leauge Support haven't replied for 24 hours anyone had this issue aswell? How to fix it?",
            "Hi , Vanguard is blocking me from playing the game when i use an external application to connect on my PC From distance ( Anydesk in my case) , i can use my keyboard but the game block any click from the mouse in the client.                                                Never happened before.",
            "Its not letting me get past the point where I click on Accept Match - it just redirects me to the client, showing me a Button to Reconnect. But nothing happens if I Click, it just repeats and repeats. Uninstalling and reinstalling lol or vanguard doesnt work. Anyone else had this issue? If so, did you - and if Yes - how did you solve the problem?\n\nThanks in advance!",
            "Vanguard installed fine for me at first and the restart went OK. The bios loading did think I had a new CPU installed? After that Launcher works fine and I can lobby and start a game but when the \"game\" goes to load it crashes and says it can't initialize graphics device. I uninstalled Vanguard and restarted my computer and the launcher prompts me to install Vanguard again. Been around since S1 playing casually, mostly ARAM now, but I think I'll take a break until they figure this out. I didn't realize cheating was that rampant they needed a super intrusive software to counter it.  Pass.",
            "I can't open RIOT client after installing Vanguard (and restarting). It just shows windows error that the program is not accessible or I don't have enough permission to run it.",
            "I get a van57 error code everytime i try to start the game, vanguard is running and everything, idk what to do",
            "Not sure if anyone can help me as I have submitted a ticket last night but heard nothing back as of yet. Load the game up and it gets in but then gives me error code 128 as an issue with vanguard so I opened services and tried to make Vanguard start up but it just tells me \"windows could not start the vgc service on Local Computer\" and quotes error 1: Incorrect Function. Everywhere I have looked online says that this can be fixed by uninstalling vanguard and reinstalling it however I have tried that and it has not helped I've even fully reinstalled the riot client and league but that has not appeared to fix the issue either",
            "[deleted]",
            "I downloaded the new patch from the login screen. I got a notificitation do install vanguard so i did. Then the button changed to 'play'. When I press it to launch the client, the login screen minimalizes and nothing happens. I tried pressing play multiple times, also completly reinstalled league and vanguard. Nothing works pls halp!",
            "So basically what I did, is I went and FIRST deleting everything related to Vanguard - Settings/command/add&remove/files, delete everything that you can think of that is related to vanguard and then AFTER restart your PC, and let League Of Legends do the talking (work) to Riot Vanguard.",
            "for anyone who uses Citrix for work try this\n\nhttps://www.reddit.com/r/ValorantTechSupport/comments/1b1c6qi/highly_possible_solution_for_those_players_whose/",
            "Uninstalling Symantec Endpoint Protection fixed 0x0000142 error and client opens now, only disabling service not worked (Smc -stop)",
            "I have other type of error when I try to open lol with vanguard, and the error is 0xc0000142, when I open the riot client and close vanguard I can open the lol client but when I try to go a game the game was close",
            "the vanguard thing just closed my game? and now I have a dodge timer?",
            "Is anyone else having problems with the game freezing? I keep getting this every few minutes the game just freezes - it isn't a network thing, my CPU keeps spiking to 100%, and it is making the game unplayable for me",
            "Is anyone else having problems with the game freezing? I keep getting this every few minutes the game just freezes - it isn't a network thing, my CPU keeps spiking to 100%, and it is making the game unplayable for me",
            "I have noticed in the past few days that when I start a game (new patch + vanguard install) that around 10-15 mins in i start lagging hard, especially during teamfights.\n\nToday the same even on TFT whereby midway through it lags so hard, my client sort of freezes and i get no response, not even when I restart the client. When i try to connect, it hangs on loading screen showing super high ping. Interestingly, it was the same issue when I used my phone to log into TFT and fire it up. It was actually resolved when I switched off my wifi and it was on 4g mobile. My PC is connected via ethernet cable.\n\nAnyone know whats happening?",
            "Do you use Teamview or ultraview? Turn off it.",
            "I have started to experience \"ice-skating\" style lag in every single game, since Vanguard release.\n\nAt first I thought my connection was going through a weird patch, but I'm not having this issue in other games, and it's been several days now.\n\nCharacters visually \"ice skate\" and teleport around the screen. It gets worse in teamfights.\n\nThis is in EUW master ELO. I will be unable to continue playing ranked if the situation continues.",
            "My friend restarted after downloading vanguard and then got stuck in a boot loop and now the pc turns on but doesn't display on the monitor; we've tried reseating the ram, GPU, tried 1 stick or ram in each slot, tried unplugging GPU and connecting solely to motherboard and resetting CMOS but ultimately ends with the same thing of powering on and no display. Any suggestions ?",
            "If any of you guys have vanguard errors try going in c:>program files> riot vanguard right click on properties and go to the second top window and select always launch as administrator on everything you can launch in that folder, also enable it on the riot client",
            "So I installed Vanguard a few weeks ago for Valorant and since then have bluescreens every now and then. There are no entries in the event log nor is the message from the bluescreen any help. Installing Vanguard was a lot of work as I had to activate secure boot, TPM 2.0 and other features in my BIOS. It usually happens when I reactivate the PC from energy saving mode. Not sure what to do other than to live with it.\n\n  \nMore importantly, has anyone used a sniffer and checked if Vanguard is actually safe to use? Can I still use a PC with Vanguard for online shopping, banking and the like? Kernel access sounds as if they now have complete control over everything on my PC. Is cheating in league really that much of an issue that this is required? Also is it even effective against cheating? Other anti cheat tools like EAC are completely useless against cheaters... until now I have just deactivated Vanguard after every reboot. Is there a way to restart it without rebooting my PC? What's Microsoft stance on having multiple windows installations on one PC? Do I need multiple licenses for that? I'm thinking about putting a second Windows on my PC to play this game.",
            "Hey everyone, \n\nI found this sub while looking for a solution (I’m new to league and don’t know where the go to communities are). After downloading vanguard my game will not launch. I press play on the root launcher and it just disappears. I have tried giving permissions as well as opening from different source files. If anyone has had this issue and found a fix, could you please direct me to a solution. I haven’t been able to play since the update. Riot won’t respond to my ticket either. :/\nThis group seems much more welcoming to new players than the riot and official league page so I figured I’d give it a shot here.",
            "I can still play league but microsoft teams somehow just stopped working for me lol",
            "i can't play a game of tft anymore without the game restarting. \nI'm looking over log files and windows error codes.\nmade sure all of my drivers and windows updates were good. \nthis is ridiculous that i can't find any centralized discussion on the issues people are having.",
            "Hello, so since the addition of Vanguard/New Patch, my ping has been very bad, like 120 and above. Could this be the new patch? Arena? Etc? Please help me fix this ;(",
            "I have to run the game as admin in order to even play. Not a major issue, but like... that shouldnt even be a thing. fix your fucking anti cheat to let people play normally.",
            "I have this issue where I start up my computer, can login to play LoL just fine, but after I play a game I get error van 0 and the client crashes. And then it crashes every time the client launches after that with van 128. Not sure what to do. If I restart I can do it again, but I shouldn't have to restart my computer every single time I want to play one game. I've tried every troubleshooting step on their support page.\n\nIt looks like Vanguard is running the whole time but the vanguard service in Windows stops running as soon as the match starts. But you can't start it again without a system reboot. I don't know why it would be stopping mid-game but it's really annoying. I tried to start it from windows services and I get Error 1: Incorrect function",
            "Before Vanguard, my frame rates were 170 fps, after Vanguard it remains at 45 fps. This is horrible. I have MSI, not running Afterburner. Is Dragon similar? Game was great before this obscene and intrusive program.",
            "Installed Vanguard, started a match, picture literally freezes for half a second every time I click or press a button. If I keep clicking the game would just stay still and then show 00 FPS. Latest Windows 10 Pro, pretty much nothing else runs in the background except Afterburner that I need for undervolting + custom silent fan profile. Ryzen 5600, 3060 Ti, 32 GB RAM, game and OS are both on SSD (separate ones). ",
            "One of the systems in my house has Citrix on it for remote work, and I *think* I found a fix that worked (at least for us) without uninstalling the programs.  Hopefully this helps others.\n\nSystem Hardware and Network:\n R7 5700G, RX 5600 reference GPU. Cat6 physical LAN connection to router. 2.3Gbps fiber internet.\n\nSystem OS and Applications:\nWindows 11 Pro. Citrix, Webex, and League of Legends installed. Citrix and WebEx both (annoyingly) are set to autostart with Windows. I cannot adjust these settings without logging in, and I'm not the employee. I'm just the household computer monkey.\n\nSymptom:\nLeague would load up and user could even join a match.  Once the match actually started, Vanguard would freak out and not allow participation, resulting in the account getting reported for AFK and low priority queue penalty.\n\nFix: \nFirst, I selected both Citrix and Webex on the taskbar and exited the programs.\n\nSecond, I pressed the windows key and typed compmgmt.msc (Computer Management) and loaded it.\nServices.msc would work as well.\nExpanded \"Services\" to view list. Find the following two entries in the list:\n\n- Citrix Workstation service\n- - Stop service\n- - Change startup type to Manual\n- - Apply\n\n- AppProtection Service\n- - Stop Service\n- - Change startup type to Manual\n- - Apply",
            "I did the same as others on here. Installed vanguard, restarted my laptop and proceeded to start a game of TFT. Everything was fine until 4-1 and then my ping goes through the roof and the game freezes. So I restart pc and try again, can’t get back into the game and ping showing over 1k. \n\nI followed some steps suggested by others such as clearing out cache and running as admin. All seemed well but then I hit 4-1 and again my ping goes crazy. This has happened probably about 5 times now and between each I try a new ‘fix’. But nothing has worked.\n\nI’m not very good with tech but my internet is fine, the only new input I can think of is downloading vanguard. Issue is always the same, everything going swimmingly until 4-1 and the game is unplayable due to >1000 ping.\n\nPlease help",
            "Hello all,\n\nI just updated League and the new Vanguard anti-cheat system alongside it. \n\nThe problem is - it says that my TPM module is not compatible with Vanguard because it's 1.2 and not 2.0\n\nMy question is, is there a fix for this?\n\nMy friend has the same TPM 1.2 and runs League on his Windows 10 PC without any problems? \n\nI'm on Windows 11. \n\nThank you in advance!  ",
            "I jumped on discord with my friend to play. but we couldn't see each other online. I checked closer and he was not even in my friendlist. We joined the lobby through a friend, and we tried sending each other friend requests, but i just did not see them, neither did he. we both restarted league, and he restarted his PC also. game works other than that.",
            "Getting blue screen of death every 2 or 3 games. (didnt happen until vanguard) anyone else have same problem?",
            "I was about to win a game when I got a notification that \"Vanguard must be running to play League\" etc etc. The game then closed. I checked Vanguard was running (it was), then tried to reconnect. I successfully reconnected - to receive the same message. I then had to restart my computer before reconnecting to win the game a few minutes later. I've never had this happen even when I've used custom skins. \n\nI honestly don't know what/why it happened, didn't have anything running, obviously didn't end Vanguard on my own. I doubt it was some kind of drophack from the enemy and if it was then lol, lmao even. \n\nAlso, since installing Vanguard my boot time for my PC has quite literally over doubled, from 20s to 51 seconds. I've also had really weird computer slowdowns and freezes that remind me of what happens when your drives are full. \n\nI'm really not happy with Vanguard but at least my custom skins still work.",
            "Not sure if anyone is having this issue, but basically i login and press play, then the big League of Legends logo sits there in the middle of my screen. Never opens the actual league client to play a game, mouse flickering. I have opened a ticket but they send the same bs copy paste responses. Tried uninstalling. Have TMP 2.0 and SecureBoot. Have uninstalled and reinstalled Vanguard. Have tried running league client through the riot client itself rather than shortcut. \n\n  \nI can never get past the above issue of the League of Legends logo sitting there and mouse flickering. Rest of my PC works fine though. Not sure if anyone else has had this issue or if there is a fix.",
            "Hi. Im playing on Win10. All works fine n dandy, but every time a game launches my laptop crashes. Like, not just the game, but the whole system restarts. If im lucky and nobody remakes then i can play the game just fine after that single crash. But if someone remakes or the game ends, the crash happens again.\n\nHas anybody got a fix for that? The whole issue looks weird and didnt happen before i installed vanguard",
            "I can only run league as administrator",
            "i hope the bot will respond and solve my problems, but my riot vanguard is installed and it says i dont have it turned on? what do i do, is there a program that doesnt allow me to have it on or what could be the problem, its not i virus im sure of that",
            "# Fps drop to 0 when holding any key on the keyboard after vanguard.\n\nHey everyone, new to the subreddit, just wanted to ask you all if you happen to have any information relevant to the topic.  \nAfter Riot dropped the Vanguard update there have been many problems regarding how it works. Thankfully, for me at least, only 2 problems have arised.  \nFirstly, FPS overall have dropped significantly, but the thing that is worrying me the most is that whenever I hold a key, let's say for ex. \"Tab\", my game freezes completely until I let go of it; if I let my game to idle, fps stabilize in 120 as they should always be, but anytime I click to move my character or cast an ability FPS drop again, a lot.\n\nI would be greatly thankful if you could help me aliviate these issues. Regards.",
            "I keep getting error 128 and league closes. I treid reinstalling, not running as adminstrator via properties. I never had issues before help!",
            "Anyone had this? When trying to use the shortcut for league itself, it says it can't find the path or file to start the game or it's possible i don't have the rights to open it. Even when i run it as admin, still happens.",
            "After the patch anytime I try to stream league to my friends in discord my game full on freezes for 2+ minutes. This is obviously not remotely viable and part of the fun of league is hanging out with friends as they watch me play. Is anyone else having this issue or know a fix? I already have the usual things like hardware acceleration and stuff in discord off. I just want to be able to choose between streaming to my friends or getting an afk warning/losing prio in the first few minutes of the game.",
            "Hei, i was struggling with league not starting after vanguard update. i tried everything but nothing helped. but today i found this video, and finally after 5 days i fixed my league client ! i hope it will help you too. here is the video : [https://www.youtube.com/watch?v=Gr2BJehNjOc](https://www.youtube.com/watch?v=Gr2BJehNjOc)",
            "I’m having issues with inconsistent input lag. I don’t have issues with the client, with ping, or with frame rate. What happens is, all too often I’ll press a button to cast a spell and it will either not register, or it’ll be on a full second delay and cast later and where my cursor was after the delay. This means I’m constantly sending skill shots backwards, or I’m just walking into the enemy team because my champion just keeps walking forward. \n\nI’ve already gotten rid of MSI AB, rivatuner, EVGA precision, I’ve closed as many things off task manager as I can. I’ve checked the network logs and they show no ping spikes or packet loss. They do show some jitter, but in the area of 3-6ms, not full seconds. \n\nI cannot play the game in its current state. I try to play ARAM and consistently get 15-20 deaths and am lucky to get 5 kills. It’s infuriating.",
            "i have a problem with my loading battle screen as whenever after having picked the champion i want to play, the  screen would not come up, saying that league client is having a problem. Even if i can play, it would be extremely laggy. How can i fix this?",
            "Vanguard blocks mouse emulation in DS4Windows, but other features work.",
            "Since I have vanguard on my PC, everytime I play League Im loosing my internet connection for 3-5 minutes then it reconnects. It feels Like Im DDOSing myself while playing league. Does anyone has the same problem?",
            "Hello, does anyone know why when I launch my league client now, it says that it’s still waiting for my vanguard session to initialize? It’s been like this for hours now, is that normal? I play Valorant and I’ve never had this issue before.",
            "I opened riot client for the first time since vanguard was installed. It said to reboot my computer but it doesn't seems to work. I can't even open lol client\n\nAt least I can still plays tft on mobile but I'm more comfortable on pc with normal game",
            "First issue I've had with vanguard ever, mid ranked match it randomly started telling me I need vanguard to play then kicked me out. Is there any way I can regain my LP? I was shitting on my lane",
            "Ever since the Vanguard install, the Riot Client forces me to close the client and open it again to launch a game. The first time I open the client it gives me the you have to restart your system message, but just restarting the client works.",
            "I just ended up having to leave 2 games because once it loaded in I couldn't move...Found this and turns out it was rivatuner...Did the try to test that before pushing Vanguard?  MSI Afterburner and Rivatuner are pretty common tools...",
            "I've gotten 2 games that I've been forced to dodge due to a Vanguard error that forces me out of lobby. This results in a dodge that I don't know how to avoid",
            "I have a clients son's that want to play lol and valorant. They upgraded their PC in order to use tpm 2.0. I installed windows 11 without skipping tpm check and with secure boot enabled. When installing al basic programs everything works just fine. Reset múltiple times without any issue. I leave them for use and test if anything happens. Not 1 day with the new installment and they tell me that when the PC turns on it won't boot. Goin into bios shows everything ok. A reset or select in BIOS the boot device let's them star Windows.\n\nI'm trying to think wtf is wrong with my install. I've already installed it 2 times using differents boot usb. When I use it everything works fine. I turn it off and on without any problem. Then they call me and says it won't boot. After a hitting my head to the wall I remembered the vanguard thing. Could it be possible that it just fuck up my install ? Anyone have experienced something like this ?",
            "Hi guys, I'm here to see if you can help me to fix my error.\n\nAfter the update, I enter to the game as usual, via LoL direct access or via Riot Client (it doesn't matter which I take).\n\nThe LoL client appears to work as usual and when I enter to a game and select my champ, the game doesn't start, the window with the other summoner's rift doesn't open.\n\nThe only thing that I can do is clicking in \"Reconect again\" but nothing happens.\n\nAnyone had similar issues after the vanguard update and know how to fix this?\n\nThank u guys :D",
            "I'm a bit of in a loss, so hoping someone could help. Vanguard completely freezes my entire PC. I hope someone knows a way to fix this.\n\nI'm certain it's Vanguard because it happened 2-3 times and the fourth, I decided to exit Vanguard entirely (close it & not opening League either). No more freezing for the day. So it got to be Vanguard.",
            "I am playing LOL then the game shut itself down, i got Van 72 error, any ideas, thank you guys very much",
            "Vanguard kicking me out of games.\n\nNearly every 2nd game.\n\nCan we disable this bad program somehow?",
            "I had no issues with it, can start the game. Just played one game. Join another one and „you need vanguard running to play the game“ ye.. nice? And how tf do I do that?",
            "my game just constantly freezes for a solid 15 to 30 seconds. randomly. I've tried updating and re-installing everything; drivers, windows updates, the actual game and client, nothing fixes this issue.",
            "Enabled tpm in bios so I could play league again with the new update. Day 2 my computer boots up to a black screen that only shows \"_\" in the top left corner. Sometimes it will go to the windows password to login and once entered in, the whole screen will go black again. I am able to open task manager while in that black screen. One time I opened it and the screen cleared up and was running fine after like 2/3 minutes of sifting through task manager. I turned pc off to make sure the issue was \"fixed\" but it just keeps going through the same process. I have to wait like 5 minutes now Everytime I want the black to clear up. I work from home using this computer so I want everything to be functioning as it was and not have to rely on hoping it will let me in through the black screen the next time I boot it up. Shutdown also take about half a minute for it to register me clicking before it decides to turn off",
            "bro i updated today to finally play and now i get fkin 0 frames in match. for no reason. like wtf is riot doing XD",
            "Ever since I downloaded it, my computer itself has been incredibly slow, but not in a \"slow\" way, it's constantly freezing for \\~10 seconds at a time. The thing that really bugs me is that it's doing this even when I'm not playing League/the client isn't open. It's also been preventing me from loading into games.",
            "I get the \"**Vanguard needs to be running in order to play League**\" error in 3/4 matches, it closes the game and i can not reconnect because i will get the same error. i restart the pc and try to launch the game again and if im lucky enough to reconnect and not crash my game 5 times and get stuck at 5% loading, then i can join the match and see the **DEFEAT**. then go back to lobby start a match and again do the same routine. anybody knows what to do?",
            "Ive been having so many issues with connecting into game. Once the champ select start and I get into loading screen it takes a while for it to get me into the loading screen (1/2minutes) once the game start my game just freeze and it crashes, if i’m lucky enough to be able to connect to the game the game will at least crash once. I don’t have a bad pc at all. Never had any issues before vanguard. Oh and because of all of this I an banned from playing and I have 30 minutes low priority q. Can anyone help me I have trued everything.",
            "tft high ping",
            "Since switching to Vanguard, I seem to lose connection to champion select and \"dodge\" one out of every five games on average. This is on Arena and ARAM, I don't dare queue up for ranked in this state.\n\nSmall message in the top right of screen saying connection lost, trying to reconnect. Spins for a while then closes the client and tells me to requeue. I currently have a 24 hour dodge ban.",
            "Anyone having issues where any key press causes the screen to freeze? My cursor sometimes has that blue ring indicating it's doing a lot of processing. Video example: [https://youtu.be/8avUngdvW24](https://youtu.be/8avUngdvW24)",
            "I keep getting the \"Something unusual has happened\" error with no further information.  \nI tried Riot's Repair Assistant tool or whatever it's called and it couldn't even find the game even when I pointed it at right at both of League's .exe file (LeagueClient.exe) and Riot's client (RiotClient.exe). Would really appreciate help 'cause I can't even \\_debug\\_ the problem.",
            "[removed]",
            "I played League and suddendly my PC turned Off. After restarting it says \"reboot and select proper boot device or Insert boot media inselected boot device\". I tried restarting in Default Mode, but I Just get Back to the black Screen everytime... Any ideas?",
            "Got Vanguard cancer on my PC a week ago. It started throwing random BSOD's, from 0 to 3 times a day. Took me 3 days to analyse what is happening, apparently when Vanguard tries to access protected memory/files, Windows throws BSOD in self-defense (thats what crash dump said in short). Any ideas how to make Windows and Vanguard respect each other's boundries or am I just forced to suffer random BSOD's now every time Vanguard decides to overstep?\n\n  \nThe process responsible for crash was vgk.sys but I remember that basically every BSOD I saw during that week had a different error code and I only debugged the last one so far.",
            "hi i play on a public pc that erases your data if rebooted so ive tried restarting windows Explorer in task manager & also have tried enabling vanguard , but neither methods have worked . any solutions please ? or most likely im just done cuz im not buying pc , wifi , etc. - thanks",
            "I try to enter a game, I play for a random amount of time, and then it tells me vanguard needs to be running, BUT IT IS. I restart my computer, open the game, join the game, and the same error keeps coming up. \n\nHelp?",
            "everytime i launch the league client i cant press on the play button, it says \"vanguard is initializing\" i tried everything i could´ve thing of and nothing worked pls help \\^\\_\\^",
            "ping spikes only during combat, it goes all the way up to 1000ms, for no reason. This makes my game unplayable.",
            "High ping and delay ever since Vanguard update. I already removed background processes and any programs or apps that can affect.",
            "I had to install Vanguard just to play LoL. So I join a game with friends and found that any sort of input FREEZES my game. Go to type a reply to someone in chat, game decides to freeze for each input.\n\nGame is unplayable if any sort of input I give just freezes the game.",
            "With the new Vanguard update it can take over 2 minutes for the game client to launch after champion select. I didn't realize this at first and kept restarting my computer. Additionally, sometimes the game freezes as soon at the map loads, which places me in low priority queue. Since I started playing in 2012, I have not abandoned a match or AFK'd.\n\nIt's incredibly frustrating to not know if my next match will take minutes to launch or if the game will freeze, which will continually put me in the low priority queue, which I have never experienced in the many years that I have played LOL. Please fix these issues with Vanguard or I will have to take a long break from League.",
            "A friend of mine is having client issues after Vanguard was implemented their client will crash and when they try to Jump back into the game the client continues to to crash and wont let them rejoin the game anyone have an idea as to why this is happening",
            "Hi guys,\n\nin the middle of the game (random) i get the message ''Vanguard needs to run in order to play'' even tho i have it on\n\ni tried everything pls help me",
            "I was able to play on my laptop, but not my desktop without getting the reboot loop issue. I uninstalled an app called Citrix on my PC that I use for work and was able to get into the League practice tool without any problems. I will conduct more testing this weekend.",
            "Hey! Idk if its only my problem, but after a match my client is showing me error code: VAN -72. When i tried to reach out to the sup system, it wasnt even there as an optian. So whats wrong if i got VAN -72? ty for yall!! <3",
            "right now I got this issue where every now and then in a game I get a popup \"You need vanguard running to play\" and if i press okay i get booted from the game and the only way to come back is to restart the game. Half the time when i reconnect I get the same popup \\~5 mins later, sometimes I am able to finish the game. Not only this but my client has been extremely buggy and often makes me restart my PC altogether. I fixed my windows updates, updated to W11, still getting the bug. Reinstalled vanguard, reinstalled the game - still have it.",
            "Every 2 games i play, i get ''Vanguard needs to be running, league will now close'' error message. and then it boots me out of my ranked game. (cheers.) Then, it tries to auto-reconnect, 3 times, before im able to close the client, my PC freezes when it ''auto tries to auto connect''.\n\nI simply then exit and rejoin. \n\nThis pointless garbage needs to be removed. It's causing far more problems than it's ''fixed''.\n\n>have gigachad gaming PC - so its not my pc  \n>have ethernet - so it's not ''muh wifi''  \n>Im the only person that lives in my house - so it's not ''other people''  \n>I have nothing but youtube running for music whilst i play - no, the issue is not ''youtube''  \n>vanguard is constantly running - it doesn't crash or stop working\n\nTLDR - riot client fails to acknowledge i have vanguard running, all i have running is youtube in the background for music. Never had DC issues with league before this trash was put in. Any advice?\n\nLiterally doing nothing wrong and likely going to get perma'd soon for constant DCs....\n\n(And yes i know ''dont just make hate comments'' - i HATE the fact that im pretty close to a perma from DC-ing through zero fault of my own and every fault of riot. Get rid of this.",
            "I play on EUW server and before installing vanguard I was playing on a decent ping of 150-170ms. However, after installing vanguard I face 250+ms ping every game for over a week. It's basically unplayable and I have not changed my WIFI or anything.",
            "Can't join any game after Vanguard. It disconnects me and says that Vanguard needs to be running/executing, EVEN IF IT IS. I reinstalled Vanguard, reinstalled League, changed a lot of things on environment to check vcg is running properly and it just doesn't work. I already wasn't able to play Valorant because it keeps throwing me an VAL 5 error, now I can't play League either. Just uninstalled both.",
            "Cant connect to any account anymore, had the van error code -81. Complete reinstalling vanguard, league etc. didnt fix anything.",
            "For everyone who still has the reconnect bug / cant connect to games in general. Starting League through Riot client worked for me. Just Start the Riot Client, as Admin or not both worked and then press play on League. Seems like there is a bug with the direct Desktop League Launcher.",
            "Hello all, \n\nI have tried Services solution, re-installing the game, shuting down testing mode on windows and so on... Still I have this issue. [https://ibb.co/Wnb7CJg](https://ibb.co/Wnb7CJg)",
            "Since the start of vanguard in League, i have been getting huge drops of connections. I mean, i'm not getting ms changes at all, the game just freeze but champs still move. Then i reconnect and see i'm getting slaughtered because i can't back up or react at all. It makes the game totally unplayable and unfair.",
            "I keep getting disconnected because of a vanguard error... please look into it!",
            "Hi guys i have problem with random dc in game attempting to recconect anyone know the fix i legit have to quit league and start it again also send a ticket still no response started happeing after vanguard rellise i only get dc in league while i have internet my packet lost its fine as well speed as well any soullution",
            "REMOVE VANGUARD FROM MY PC THANK YOU.",
            "has anyone else loaded into a game and got \"you need vanguard running to play?\" \n\nwent 5-0 this split so far but now I'm 5-1 by no fault of my own, really fucking tilting. why does the game even let me get through pick ban phase if vanguard isnt running????? huge oversight imo",
            "ok so from the moment u decided to add vanguard to game my laucnher and game is jsut lagging so much launcher is unusable and game lags mid fight from 240 to 01fps also it legitimly lags my whole pc fix your fcuking game",
            "Vanguard update causing random stutters mid game at any time. Especially frustrating during any encounter",
            "After Vanguard was installed I cant play anymore. Everytime I press any button on my keyboard the game freeze for about 1-5 seconds. All my drivers are updated etc, this issue does not appear in any other game and only started happening after installing Vanguard.",
            "Ever since Vanguard implementation I have been getting occasional BSODs related to KERNEL\\_SECURITY\\_CHECK\\_ERROR. I've had 3 so far and funnily enough they happen 7 days apart.\n\n  \nBlueScreenView highlights ntoskrnl.exe as the issue. Two of them with 42e69 Address and one with 2ec187.  \nThese crashes never happened prior to Vanguard in League.\n\n  \nAlso something that has been happening is my Discord will randomly DC and reconnect AND/OR my League client will reload for no apparent reason. Again, this never occurred prior to Vanguard.\n\nI'm on Windows 11, TPM 2.0, system should work fine, disks are healthy, RAM works.",
            "Has anyone had issues with the game randomly disconnecting since the vanguard update? I’ve never had issues dc’ing before, but it’s almost every game since the update.",
            "literally just tried to play a ranked game and got \"vanguard error\" right before i was about to load in from champ select. Was in provisional games so didn't lose lp but im typing this sitting through the 5 minute dodge timer. Idk how gotdang vanguard forces me to dodge by breaking the client but come one",
            "Hello,\n\nI have a problem concerning  vanguard when playing league. Everything works fine for me except that when i launched the game, after few minutes of playing, a message saying \"Vanguard needs to be activated in order to be able to play\" appears and make me quit the game. When i try to relaunch the game the same problem appears again, the only solution that worked for me so far is to restart my pc and re enter the game, but i got recently ban due to several absence in my games.\n\nThe thing is that even the official riot support didn't help me much with it. So i'm hoping someone got the same problem and can assist me with it.\n\nThank you very much.",
            "Meu computador está lento, mas eu não o desinstalei rsrs, vou ter que reinstalar o Windows porque há algo escondido que está consumindo desempenho, está arruinando meu PC.",
            "since the update, the client freezes everytime a match end, sometime it completely crashed. What should i do?",
            "So i have a wierd problem, my PC boots up, Vanguard boots up.\n\nLaunch League.  \n\"You must restart your pc.\"  \nRestart PC  \nCan now play league.\n\nBut this happens everytime i turn my PC on to play league, is this like a sign? or is there something annoying im not noticing.",
            "My cursor has been behaving weirdly roughly around the time I installed Vanguard. I don't know if it could be related to it but ever since my cursor has been acting \"drunk\" as I put it, I move my mouse straight and my cursor moves in waves or in the total opposite direction. Uninstalled Vanguard and the problem persists but I don't know, has anyone been also getting this?",
            "I'm apparently a toxic low prio player because Riot Vanguard had an error during matchmaking",
            "It's bad enough I willingly installed PRC Tencent spyware just to play a MOBA now I'm being gaslit by the spyware lol",
            "Well, since Vanguard came around I have a problem of ending the champ select and when game should load I get black screen on the league window and after like 15 seconds (not always) a window pops up saying unable to connect to the server. and since there were changes to lp gain and penalties in 2 games I lost 110 lp. My acc is already doomed but at least i would love to play the game. I got rid of everything that would interfere with Vanguard, updated windows (helped my duo for some reason) got the interenet setting on pc to default, created exceptions in firewall like a rioter told me to do in support response, deleteed everything connected to riot games and reinstalled and nothing helps.",
            "Is there a way to port settings over from one account to another?",
            "I keep getting the Vanguard Event in which my Vanguard isn't running when it very much so is. It's caused me to get a genuine ranked ban in which I now have to wait 15 minutes for each queue. I've sent five tickets into riot, initially they gave me a solution which didn't work so they advised me to send in my system logs. I sent in a ticket to send those in, they gave me an AI so I asked for a rioter to have a look and I got a message from a rioter in Korean saying \"English Ticket, put down.\" I don't know what the hells going on but it'd be god send to be able to play with my friends again.\n\nIf anyone has a possible solution to this I'd be extremely grateful :)",
            "I installed vanguard, rebooted my laptop, and got into game. I also checked if I could see the vanguard icon in my taskbar.\n\nBut mid game I got disconnected cuz of an error that said “you need vanguard running to play”.\n\nWhen I tried closing the client and reconnecting, it gave me the same error and upon exiting the game client it showed vanguard error van 68.\n\nHow do I fix this?",
            "That's it, i can't play league of legends anymore, was playing with vanguard for like 1week or 2, now i have this problem that COMPLETELY FREEZES MY COMPUTER and i have to restart it every single time, it is random and it can happen whenever, i've run tests to check if it was my cpu or ram but everything was normal, when i uninstall vanguard it doesn't happen at all, i've tried many solutions but nothing seem to work, i love arena but i can't play it because every now and then my computer freezes out of nowhere and i'm afraid it will ruin it",
            "Loading into a game 1/10 times causes league to suddenly crash and freeze my main monitor. Consequently, I can press the windows key but not actually do anything on it. It will permanently load LoL but be fully black. I have often times received leaver penalty and lost LP for this, and has only occurred after installing Vanguard. I have noticed this happening on other games as well after installing vanguard (because I sometimes forget to shut it down when I don't play LoL).\n\n  \nThis is on a completely new computer that is less than a month old. Completely new parts. $2.5k computer. Not sure why it's doing this.",
            "Hi i got vanguard error 84 after 1 game then 2nd game about 10mins got this error.",
            "Packet loss issues since Vanguard update, Riot. I've been playing consistently for the past 4 years on the same ISP and had no issues whatsoever. Starts off like usual, consistently low ping at around 20ms then 10-15 minutes into the game my input commands start getting delayed which leads to odd glitches like skillshot animations appearing late (probably fired a second before the caster moved), and my champ blinking every few seconds. The ping remains unchanged but the game is frickin' unplayable. Kiting is impossible, It feels like I'm playing DOTA with turn rate mechanics. PS. I know it's a League only problem because I can play Valorant and Steam games with no issues, I've tried internet speed and packet loss tests as well.",
            "After vanguard, some times when league opens instead of launching the game it creates an impossible to stop league of legends process that crashes the game every time you tried to open it.\n\n  \nNothing works to kill the process, taskkill, processexplorer, it just stays permanently in the background crashing league every time you try to join a game. \n\n[https://i.imgur.com/JcTszOz.png](https://i.imgur.com/JcTszOz.png)",
            "Riot is gonna lose some players, shame. Cant play with my friend bc the game crashes in the loading screen and she sure as hell is not cheating. Doesnt matter what Vanguard likes or doesnt like. These kinds of false positives are ruining the game for us.",
            "Why do some midlaners ward the mid lane (literally the mid)",
            "Ever since I installed Vanguard league specifically has been freezing every 1 minute for 1 second to 8 minutes (most likely causing game crash when that long). During these periods of time it accepts no inputs and apparently loops the last input I did when it froze. In just an aram game today I walked all the way into enemy spawn because of this. Does anyone know of a way to fix or address this problem?",
            "its crashing my pc, whocrashed is telling me its a vanguard issue with its driver but i do have msi afterburner so idk what to do\n\n  \ni can play games in SR, but half way my game turns off my pc (no BSOD) and restarts..",
            "I have a problem each times I get into I game I can't move for x amount of times in most case it's 1 min or 1 min 30 so I'm starting to move before my mates get the remake message so it's fine but sometimes it takes a bit more times so by the time I can move the remake is done",
            "Everytime I try and open the league client there's like a 10:1 ratio of my computer slowly freezing and inevitably blue screening I've tried clean restarts not having background apps like rivatuner running, changing system locale most of the things. I have TPM 2.0 and never had this problem previously before vanguards league of legends release and never since valorants vanguard release. I don't understand what more I can do. If anyone has had the same problem and have solutions would be much appreciated if people could share their answers",
            "Please help. Ever since i updated to Win 11\nIngame while playing ranked game Vanguard Van:0 keeps appearing even though its okay for the first 15 minutes. Its really frustrating and really just destroys my gaming experience.",
            "After the update, i stopped trying to play lol, my high-end pc loads really long and it freezes all other tasks and apps my pc is doing in the mean time, it takes about 10 minutes for lol menu to launch, that's just not acceptable",
            "I'm having this Vanguard bug: [https://ibb.co/KWkRzt2](https://ibb.co/KWkRzt2)\n\nAnyone knows how to deal with that? Even if my Vanguard is running normally, this issue occurs to me, then i need to restart my PC and start lol again, but when i shut down my PC and try to play another day, turning on my PC normally, this thing just happen. I see that i can close Vanguard and restart my client and i can finish that match, but what reliability i have to this approach? Can anyone help my with this problem?",
            "I am having a really weird bug that after installing league with vanguard when I launch league I keep heraing windows sounds every now and then. I think it's the sound you normally get whenn connecting or diconnecting a USB device. I have no idea what is actually going on since I can see no popups or anything else. Has anyone else had this happen or know what could be happening?",
            "Hi.\n\nI hate vanguard. Any Nvidia actualization or overlay notification be from Nvidia, antivirus, even my web browser makes the \"vanguard\" turn off my client, cut the internet and now I have 2 bans -40lp and lost a clash.\n\nRiot needs to optimize it.",
            "Hey,\n\nmy screens I run league on keeps turning black, when I have my browser on the next monitor running with [u.gg](http://u.gg) ot [tactic.tools](http://tactic.tools) . Can anybody relate or does anybody know to maby fix the issue?\n\nThanks in advance",
            "i was playing well till today morning my last game i think at 12 pm i close game open couple hours later , the game stays open for a while then the play button is grey ( cant press anything ) and force me close by error van 84 the thing is i dont have connection problems bec game open fine and my internet is good and i followed instruction try restart client and league i did like 10 times nw and nothing is done",
            "Vanguard Error: VAN 84 how to fix it got it in the middle of the game so can't do anything plus now i have to agree to something cuz Riot had problem not me and if i ever get it again will it count as intentional leaving and will i lose Lp in ranked I don't know where should i provide information to make Leavebuster warning go away cuz i am not agreeing to that.",
            "Got a VAN 84 error while mid game - repeatedly tried standard fixes of restarting client, restarting PC, restarted my router. Nothing helped.\n\nNow the game is finished I keep still sporadically getting the VAN 84 error while just having the client open, obviously I'm not going to bother even trying to queue while this is happening.\n\nThat's one way to cure the addiction ig...",
            "updating for u guys i got 2 connections at home both of them different companies and i still have same error 84",
            "Vanguard Error: VAN 84 how to fix it got it in the middle of the game now i have to agree to something cuz Riot had problem not me and if i ever get it again will it count as intentional leaving again and will i lose Lp in ranked I don't know where should i provide information to make Leavebuster warning go away cuz i am not agreeing to that. And i still can't do anything after the game ended it just spam sends pop ups of van 84 whenever i join the account can't pls help. It's account specific problem cuz on other accounts i don't have this problem.",
            "Im also getting the Vanguard Error 84.\n\nRiot is aware of it and seems to be working on a fix.",
            "I have repeatedly had the \"Vanguard needs to be running\" error message a few minutes into a game, which was very frustrating because i kept getting booted when i tried to reconnect. A reboot would get be back into the game but that would be 2 minutes later. Which puts me so far behind, its rediculous. Anyway, I was checking for the processes and it looks like the vanguard process is \"vgc\" in the windows process list. This isn't running on boot but starts when the clients starts it looks. I dont know how vanguard works but the following trick got me back in a game pretty quick.\n\nAfter a \"Vanguard needs to be running\" message I opened a powershell window as administrator. Pasted the following function and ran it. Then opened the client again and logged back in. This has worked every time so far. Hope this can help someone else.\n\n    Function Reset-VanguardLeagueClient\n    {\n       $proc = \"vgc\",\"League of Legends\",\"LeagueClient\",\"LeagueCrashHandler64\",\"LeagueCrashHandler64\", \"RiotClientCrashHandler\",\"RiotClientServices\"\n       foreach ($p in $proc){\n          get-process $p | Stop-Process\n       }\n    }\n    Reset-VanguardLeagueClient",
            "To solve it, this tutorial explains it very well: [https://youtu.be/i68GHcLQwBs](https://youtu.be/i68GHcLQwBs)",
            "I've started getting this bizarre error popup in random games that just says **\"Vanguard Event: You need to have Vanguard running to play.\"** Vanguard is running at all times when I play and I have to end up restarting my whole pc in the middle of a match. I haven't seen anyone else mention this issue and it's really getting on my nerves since it seems completely out of nowhere and Riot Support hasn't gotten back to me after four days.",
            "This seems like a weird one, but I am 99% sure it's related to Vanguard; when I uninstalled it, everything worked like normal.\n\nWhen I right-click on my Desktop (Windows 10), my CPU usage momentarily doubles, and one of several things visually happens:\n\n* my Desktop (but no open windows) will pause for a second, then flash black,\n* my Desktop, task bar, and maybe some windows including Firefox will freeze for at least several minutes (idk what the minimum time actually is, I always used Task Manager to end or restart tasks)\n* I get the context menu, but then the above freezing+flashing happens while I'm in it or once I try clicking on any option (the context menu then goes away after my screen comes back)\n\nPossibly related, though inconsistent, is the fact that my \"Desktop Windows Manager\" and \"Windows Explorer\" processes also gradually grow in memory usage the more I try to right-click.\n\nThis only happens on my Desktop; right-clicking works normally in my browser and in the file explorer. I've restarted several times, uninstalled and reinstalled everything Riot a couple times, tried DISM and SFC (both found no errors), and updated my graphics drivers. Any other ideas?\n\n\n\nedit: clarity",
            "I found out that what caused this issue for me is that I have this app called Citrix Workspace installed on my PC.   \nSolution from this post helped me resolve the issue:  \n[https://www.reddit.com/r/ValorantTechSupport/comments/1b1c6qi/highly\\_possible\\_solution\\_for\\_those\\_players\\_whose/](https://www.reddit.com/r/ValorantTechSupport/comments/1b1c6qi/highly_possible_solution_for_those_players_whose/)",
            "I've been dealing with this all day. I thought I was going crazy trying every single method to fix it. Please let me know if you find something before I do and vise versa. I can't get in to a game it just is a constant \"reconnect\" button that doesn't do much.",
            "Bumping this issue as I’m having the same problem.",
            "Same issue here",
            "The same thing is happening for me",
            "Same issue here.\nAlso, after trying to get into game (works for practice tool too), vanguard seems to fk with everything, until I press reset button on my PC: Programs open already run fine, but I can't run any new ones, including windows task manager and even system restart.",
            "Same issue here on Windows 10... Have to quit Vanguard then uninstall it and the game... I can't play TFT anymore.",
            "I have this same. I was create ticket but RIOT still cant resolve this problem.  \nVGC blocked my Riot Client and i see only button RECCONECT nothing more, no eny warning massage.\n\nHint1: You can cloce VGC and game started property but only for 5min and thisa same again, next you get Penalty and restriction account for nothing.",
            "Same issue on a 3500 pc. Shame",
            "Happening to me constantly. It's impressive how they manage to constantly fuck up the game even more each time,.",
            "seems like you have the one case that was addressed in detail by riot\n\n\\*\\*\\*\n\nAbout \\~0.7% of the playerbase bypassed Microsoft’s enforcement for TPM 2.0 when they installed Windows 11, but the rollout of Vanguard requires that those players [now enable it to play the game](https://support-leagueoflegends.riotgames.com/hc/en-us/articles/24170417829651-How-to-Fix-Error-VAN9001-by-Enabling-TPM-2-0-Win-11-Only). This requires a change to a BIOS setting, which differs based on the manufacturer. Vanguard does not and cannot make changes to the BIOS itself.\n\nBIOS settings can be confusing, and we’ve seen two niche cases where it’s created an issue.\n\nThe first is that many manufacturers prompt a switch to UEFI mode when TPM 2.0 is enabled, but if the existing Windows 11 installation is on an MBR partition, it would become unbootable afterwards. Some OEMs support LegacyBoot mode with TPM 2.0, but to support UEFI mode, Windows 11 must be installed on a GPT partition. [Microsoft has a guide](https://learn.microsoft.com/en-us/windows-server/storage/disk-management/change-an-mbr-disk-into-a-gpt-disk) and a [helpful tool](https://learn.microsoft.com/en-us/windows/deployment/mbr-to-gpt) that can help avoid a reformat and reinstall if you’re in this scenario.\n\nThe second was a player we spoke to that accidentally also enabled SecureBoot with a highly custom configuration. While Vanguard makes use of the SecureBoot setting on VALORANT, we elected not to use it for League, due to the older hardware that comprises its userbase. Older rigs can have compatibility issues with this setting, and that’s actually one of the primary reasons the Vanguard launch was delayed.\n\nFor example, some GPUs are known to have Option ROM that is not UEFI SecureBoot capable (especially older cards), and sometimes this can result from players having flashed it themselves to “unlock” the card. If the Option ROM isn’t signed, enabling SecureBoot would prevent your GPU from rendering anything (since it won’t boot), resulting in a black screen. There would be two ways to fix this: Connect the monitor to an integrated graphics card (if you have one) and then disable SecureBoot in BIOS. Remove your CMOS battery to reset back to default settings.\n\n**TL;DR - We DO NOT require SecureBoot for League of Legends. Don’t enable it unless you are sure you want to.**\n\n  \n\\*\\*\\*\\*",
            "It bricked your laptop prob. When you agreed to League of Legends TOS you have (most likely unknowingly) agreed to their arbitration agreement. That means that you can't sue them in court. What is also means is that you can use their agreement to force them into arbitration, which will cost riot probably a minumim of $10,000 to $15,000 dollars, even if they beat you completely uncontested. Because of this, if you force them into arbitration by filing a form with the AAA (American Arbitration Association) for a measly few hundred bucks, Riot would be legally bound to uphold their end of the agreement which includes paying for the Arbitration fees, which typically range from $10-15k. The first set of fees comes after the initial \"settlement\" period is over... Basically once you have decided you are unwilling to take their settlement offer. Once you decline they will have to pay roughly $4,500. Due to this they will offer to settle for 2-3k. The entire process will take you 30ish days, approx 2-4 hrs of your time and net you enough $ to buy a new laptop. Your Welcome.",
            "Something similar happened to me, although it is desktop. The RGBs turn on, but it doesn't give signal or show anything on the screen. I thought it was my GPU so I unplugged it and connect the HDMI to my integrated GPU from my CPU and it also doesn't work. My technician believes it is the motherboard but I don't know, I don't want to be all conspiracy and shit but man, what a timing to be after vanguard",
            "Not sure if anyone gave you the answer but to fix this what I had to do was go into the Riot Vanguard folder (C://Program Files/Riot Vanguard for me) and run installer.exe to uninstall it, then run the riot client to install it again and then restart.\nThat fixed the restart loop for me.",
            "It kept doing that for me, so I did a system restore after a bunch of troubleshooting. Then my system could not repair properly so ended up doing a full factory reset LOL. All my documents are saved on Cloud anyways. I hope no one else goes though this.",
            "same issue and when i start the vgc service manually i get \"windows could not start vgc service on local computer : error1 incorrect function \"",
            "LOL the anti-cheat is rekking honest players... but ofc it is",
            "If you have MSI Afterburner, Rivatuner, or any program similar to that running in the background you will have to shut them off. That fixed it for me.",
            "Do you use rivatuner?",
            "same case here, have tried every single thing possible.  \nlmk if u find something",
            "[removed]",
            "[removed]",
            "[removed]",
            "To add to your comment because this issue is super common and it's caused by different apps, not only ultraview.\n\nIf someone is presenting the same issue described here, it could be caused by an app that creates some sort of overlay or any app that tries to inject themselves into executables. Vanguard then recognize this as malicious and it doesn't let you play.\n\nThe way I found the culprit (In my case it was a [unknown small app I used to keep random windows on top](https://github.com/navossoc/MenuTools)), is by going to the task manager and closing every background process [under this section](https://i.imgur.com/Z9xoagH.jpeg), these are usually non-essentials; I went to a game after that and checked if I was still freezing. I was not, so the only thing left was to identify which one of those apps is making Vanguard go haywire. \n\nIf the app is an overlay thing like rivatuner, then you might need to close it before opening the game. But if the app is a sort of injector, you can go directly into the game and then close the app from the task manager, the game then will unfreeze. This is useful to know to identify the culprit.\n\n---\n\n**So to debug this type of issue I recommend:**\n\n1) Go to task manager, close every app under \"background Processes\" umbrella. Some will reopen again but these are usually windows processes that are probably not the culprit.\n\n2) Go to the game and see if the issue persist\n\n3.1) if it doesn't persist, then restart the machine so you can test from in-game with all the suspect processes opened in order to identify which app is the one ramming heads with Vanguard. Go to step 4.\n\n3.2) if it persists, then your issue is not one of those apps. It might be something essential like a driver, or a windows thing (can't help you there)\n\n4) Go into the game where you are frozen in place, then open the task manager and try closing the apps you closed before 1 by 1 until you unfreeze. This happens immediately if it's an injector, so you can close one app and check league, and repeat until you find the app that's creating the issue.\n\n5) In the case you don't find the app after doing this, the software is probably a pre-overlay. So try any software that creates some sort of overlay across any other app, like discord, rivatuner, gpu filters. You can try closing 5 apps at the time and the opening a game to see if you can identify the culprit this way.\n\nAfter identifying, you can choose between uninstalling, closing before opening league, or reporting to riot to see if they can patch that issue.",
            "thanks for your information, i exit ultraview and lol is normal",
            "Do you use rivatuner?",
            "same problem",
            "I close msi afterburner and rivaturner and the  fps drop from every input disasspear, same issue I have with valorant when I have msi afterburner in the background I cant open valorant because it crashes",
            "I have a similar issue, but inverted. Vanguard blocks my netr6164.sys file which is used by my wireless lan card (WIFI).  \n   \nSo far uninstalling and reinstalling vanguard doesn't work. My process was: Install vanguard, reboot, WIFI breaks, uninstall vanguard, reinstall WIFI card drivers, reboot.   \n  \nI guess I could try the Ethernet cable, but I've wasted enough time.",
            "omg i have exact same issue",
            "Same, Riot need to take thier own advice...abandoning games ruins the experience for your teammates and is a punishable offense... XD whats their punishment?",
            "I have something similar happening to me - in random games, in chap select the message that I need to run vanguard to play will just pop up and I’ll be disconnected and will get a q timer. But my Vangard is up all the time and running in the background - I can see it! It’s also not a connection problem (I checked). So beats me what is happening and why so randomly.",
            "Same just happened to me for the first time - luckily not a ranked game - but really? I have a 5 min dodge timer because riot vanguard \"failed\" in champ select? :(",
            "This is happening to me rn!! And I have to do pentaly games with 15 minute queues bc it said I had “disruptive behavior” afking, like what??? Does anyone know how to fix this ??? ",
            "I'm having this problem every game now",
            "Same",
            "bro i had this shit during ranked game wym this is so wtf",
            "My too! I don’t have any issues with the client, getting into a game, or frame rate. But there is inconsistent input lag that is making the game unusable. I’d say like 80% of inputs work just fine, but around 20% don’t register at all, or they register a full second later. I’ll try to cast a spell, then walk backwards to reposition. The spell will be on a delay, and then will cast backwards because my cursor is behind my champ. I cannot play this game with this input lag.",
            "I'm also having this issue. Not using afterburner or anything like that.",
            "I lost a ranked game because of that, furthermore when it kicked me out i tried reconnecting but to no avail. Tried closing the client and reconnecting, kept saying \"Credentials don't match any account\"   \nEnded up losing 21 lp + 5 lp from going afk and getting leaverbuster and lp penalty for 2 games",
            "saem thing happens to me every game on one PC, but not on my laptop. Ive tried so many things to fix it on my Pc but nothing works. I created a ticket aswell as a bug report in game and no response, any fix guys?",
            "Any updates on this including what OS you're on?",
            "turning off firewall fixed that problem for me",
            "same here. usually had 240+ and limited it to 240. now i have drops to 115 or even 90 and i have a completely oversized pc for league lol.",
            "Same here!!!! I'm so pissed!",
            "I opened a ticket and they copy paste the same solutions that you can find anywhere, make a clean uninstall and reinstall, and guess what? It doesnt work, so yeah, they need to make a patch to remove it or fix it somehow",
            "I encountered a similar situation after installing Vanguard without any errors. The game would launch briefly and then close. I resolved this by ensuring that the Riot Client was not running in the Task Manager and then launching the Riot Client as an Administrator. This solution worked for me. Hope it helps :)",
            "I'm having the same problem too. Only thing that changed was vanguard.",
            "I'm also suffering from this problem. I've tried to close anything related to Vanguard and launched the game again. It did let me in but when I found a match and prepared to play I got disconnected and cannot attempt to reconnect.",
            "same problem. I'm playing tft, when I enter the game, the game automatically logs out and asks me to reconnect, the same thing keeps repeating and I can't play the game.",
            "Had this try unistalling vanguard, restarting then update the game through the client , it should reinstall vanguard",
            "same problem... no solution yet.. I even unistalled league but nothing",
            "I have this exact same situation, i've tried E V E R Y T H I N G to fix it from completely uninstalling about everything to every single driver update, the game does start if you open the riot client and then click on play, but since vanguard isn't running it won't actually get you into a queud game. This problem is completely riotsided. i played the day before this diabolical plan of an anti-cheat they implented.",
            "run into the exact same issue, and tried every thing mentioned in this thread but no luck. Anyone figure out how to solve this?",
            "having the same problem, has anyone able to fix it yet ?",
            "I had this happen in the middle of a close ranked match. 17 minutes in with a dragon fight starting, and then suddenly a pop-up saying \"Vanguard must be running\". Booted me out, Vanguard icon was still showing in system tray. It let me rejoin but I got the same message instantly and kicked again.\n\nHad to restart PC as well to fix it, but by the time I was able to play again it was too late. Dragon and multiple turrets gone. What a joke.",
            "Just replying to say same thing happened to me. Played multiple games and then randomly had this issue occur, changed nothing. If your anti-cheat software is going to randomly cost non-cheaters ranked games its going to make your game unplayable and kill your playerbase. I have no objection to anti cheat software having played League enough years to encounter some definite cheaters, but it has to be functional.",
            "same issue here if u find a fix please share",
            "same thing happens to me",
            "Same thing here",
            "i got the same shit, any fix",
            "Same thing and tried all the steps i can find online and all the steps the support gave me yet the issue still persists and i got about 4 penalties by now because of this",
            "If you disabled vanguard at any time between playing games then you have to restart. You might also need to enable secure boot.",
            "honestly the same thing happens to me, more than once, like every game how its going, i dont want to restart my pc every single time that happens, especially since it happens almost everytime im in a fight against someone and after i come back im down a level and 400 gold and also some waves, around 500 gold worth of glitch every single games makes it imposible to climbe, i still havent found a solution to the problem long term and ig yall havent too, i might stop playing for now since its so anoying",
            "I have this problem except restarting doesn't fix it. I can't play games whatsoever anymore",
            "Same with me.",
            "I had the same problem, tried a lot of things, but eventually this fixed my problem:\n\nOpen Registry Editor (just type regedit in Windows Search)  \nGo to:  \nComputer\\\\HKEY\\_LOCAL\\_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Image File Execution Options  \nSet DevOverrideEnable = 0 (double click and change the value)  \nRestart PC",
            "That's exactly what I'm getting too.",
            "same problem if u find a solution tell us",
            "Same thing",
            "have you got the solution?",
            "What is your operative sistem? What is your processor name?\n\n1- If your processor is intel 8th and above then you need to go to the bios and enable your TPM.\n\n2- If you have an intel 7th or lower, you need to install or reinstall windows 10 and all updates available.",
            "you either need to go back to windows 10, uninstall league, or have a TPM compatible motherboard. Unfortunately you can't have Windows 11 with no tpm2.0 AND Vanguard.  \nIdk how many years of collective programming experience these guys have. 200 years as well?",
            "I don't think there is a fix yet, might just need to wait for riot to solve it unfortunately, good luck though.",
            "samee bro havent found a fix yet :/",
            "SAME",
            "did u fixed it?",
            "Thanks very much! I was stuck in the reconnect loop and this worked for me! Legend",
            "Yeah, I just uninstalled until I can set up an old laptop for gaming and using the disc drive. I'm not running this crap on a machine I need to be secure and reliable. It's just a game that I'm probably better off without anyways. Maybe gonna try mobile, open up the steam library,  or do something healthier than gaming, we'll see",
            "Save and backup all of your crucial files, then format your hard drive and reinstall your OS\n\nIt sucks I know, but it's really your best bet to get your computer back to normal. Trust me that in the long run it will be less of a headache just starting fresh than trying to hassle with custom uninstallers and system restores.",
            "That solved it for me. Ty so much.",
            "did you find out the solution?",
            "I’m using something called an Azeron and have some bindings on my Logitech mouse as well. \n\nThe Azeron has its own software too. \n\nIn the last couple days I’ve been running into keyboard/button freezes, input delays, and millisecond registration issues with buttons, clicks and combos. \n\nI don’t know if it’s vanguard or something else in the client that’s causing these issues. \n\nIn the previous years I’ve never had a problem.",
            "icue was making vanguard not work for you?",
            "yeah im lucky i dont have any custom icue keybinds because it doesnt even launch on startup anymore since i installed vanguard, and it refuses to open even when i try to launch icue myself. annoying but not the end of the world for me i guess. still, its the principle of the thing yk? and for people like you its literally fucking w your ability to play the game",
            "Hey I got the same problem as you are, have you found a way to fix the issue yet?",
            "Vanguard was kicking me out of matches and said that it needs to be running. I reinstalled it and now I'm having the same problem as you are, haven't find a fix yet.",
            "I can get all the way up until the game loads and then vanguard stops running right when it finishes. Does this trick work for that too?",
            "I'm getting the exact same issue. Just downloaded Vanguard when prompted from the Client start, got prompted to restart my pc, and now, whenever I try to boot up the Client, it gives that exact same error message.\n\nAny help would be appreciated plz.",
            "Try shutting everything down from Task Manager, then going to the C:/RiotGames folder, then Riot Client folder, then run the RiotClientServices application as administrator (instead of just trying to launch from a League Client shortcut, like I was doing). From there, just select League and press Play on the Riot Client. Someone in here suggested this and it solved the problem of the League Client not launching for me, now I'm in the game client. Nothing will load within it so now more troubleshooting to do, but step by step I guess...",
            "I wish I had better information to share, but I've been having a similar issue. I've been trying to open the client from LeagueClient.exe, but I just keep getting the \"Windows cannot access specified device, path or file...\" error message. I've tried the \"fixes\" Riot is suggesting on their support site (reinstalling league, unchecking run as admin) and a bunch of other stuff(uninstalling all riot games, deleting folders, installing games in a certain order), none of which have worked. I did also try exiting Vanguard and then opening LeagueClient.exe which didn't show the message, but as expected, didn't let me open the client because it was asking for Vanguard. Instead of opening the League Client, it took me to the Riot Client. So, it does kinda feel like Vanguard is messing with it somehow. Hopefully there's an actual fix soon!",
            "Have you tried launching with the riot games launcher (red hand icon) instead of the leagueclient.exe (L icon)",
            "I had the same issue. Tried re-installing Vanguard and restarting PC but didn't work. I launched Valorant and after I updated Valorant, my League started working.",
            "Have you found a fix?",
            "I had this same issue for a while before Vanguard. Also pretty sure it was exclusively LoL, and it for sure wasn't my mouse since the issue stopped after a (pretty long) while. I'm afraid I don't have a fix for you but since I have had the exact same issue I don't think it's Vanguard related... Not sure if that's a good or bad thing... Bright side is it did eventually stop for me",
            "same here, no solution found yet. Someone else mentioned citrix in other comments, but I don't have that app installed.",
            "Exact same situation",
            "My situation is similar, but my client and game just disappear from the taskbar when the game starts.  In task manager, the game and client will still be running in the background.\n\nWindows 10, drivers up to date.  All programs on same drive.  Idk about secure boot or VM.\n\nI have been making it work by opening the riot client and task manager, force closing league and the client in task manager (in the background processes section), then opening up league again through the riot client.  Sometimes I have to do this 2-4 times, but it has eventually worked and let me in.",
            "Mine randomly disconnects and reconnects since vanguard. Looking into its capabilities to cause this",
            "have this very same issue now. then after a few minutes of opening the client, a vanguard 84 error will pop up saying that league needs to close.",
            "im in same boat :(",
            "[deleted]",
            "someone plz help me? : (",
            "Are you doing a secured boot in bios? This resolves some user's issues.",
            "MS Teams is probably the culprit. Changing the video settings from fullscreen to borderless solve it for me (Teams notifications dont change to desktop anymore)",
            "I use mobalytics and no issues from there",
            "Do you use a KVM Switch?",
            "i think that's because they don't allow remote play anymore because you could be cheating on that pc from a distance or something.",
            "Do you have a KVM switch or preinstalled software from companies like cooler master or corsair or something like that? or MSI Afterburner",
            "Today my friend had 4 matches terminated because vanguard detected cheating.",
            "run it as admin. type league in your windows search bar and open it in its file path > right click, \"run as administrator\". worked for me",
            "did u find a way to fix it ? i have same problem",
            "same.",
            "bump because this acc solved my issue for League of Legends",
            "Same here. Any solution?",
            "Same here. It feels unplayable. My CPU is just ramping to 100. It's a Ryzen 5600x",
            "Yeah I drop to 45 fps and my cpu spikes 80%, I only have League and that Vanguard running",
            "Proly related to Directx9 deprecations and not vanguard, check drivers updates and windows updates",
            "did you figure anything out for blue screen?",
            "I'm having this same issue. I've uninstalled Logitech G Hub, rolled back NVidia drivers, disabled full screen optimizations, the works. At first, every time I moved my mouse inside the League window it would freeze the entire picture until I stopped moving the cursor, and would freeze for about a quarter second every time I clicked and unclicked. I've gotten it down to just when I click inside the window. This sucks really bad. R7 5800X3D 32GB RAM 3080Ti.",
            "issue is afterburner",
            "Hey I actually had this issue a long time ago! It just stopped doing that eventually, so not really helpful but at least we know it was happening pre-vanguard!",
            "Any updates to the need to have vanguard running to play issue?",
            "Exact same problem and I still can't be able to get in a real game including trial mode.\n\nI went to vgc file to check the logs, but it was in broken characters.",
            "im having the same issue right now before if my friend made a lobby i could jump in a game but now i cant for no reason",
            "Thats the exact problem I have. I can see that Vanguard is in C:\\\\Program Files\\\\Riot Vanguard, but I am still able to open League and select a game, but I end up in the reconnect loop after clicking accept. My friends won a game without me yesterday and I got penalized lol. I was able to get it working on an old laptop I have, that has the same antivirus software and other programs as my desktop. \n\nI uninstalled Vanguard and Riot/League of Legends, but nothing works after reinstalling. I'll uninstall Vanguard but when I open Riot the progress bar won't spin and I just get a restart prompt. \n\nI opened a support ticket with Riot and will let you know what they say.",
            "[deleted]",
            "Any updates?",
            "[deleted]",
            "Your post has been removed under the grounds of [Rule 3: No Rants or Complaint Posts.](https://www.reddit.com/r/summonerschool/wiki/rules#wiki_3._no_rant.2Frage_posts)  \n  \nRemember that /r/summonerschool is here to help you improve and that we need information on aspects of your gameplay that can be controlled. Complaints, swearing and/or ranting may discourage constructive replies.  \n  \n* Consider reposting your thread, but with a calmer tone.  \n* [You can read on how to improve your post with more details about yourself here.](https://www.reddit.com/r/summonerschool/wiki/101/criticalthinking)\n* [Our Wiki has a section on Mentality, Toxicity, Autopiloting and Tilting.](https://www.reddit.com/r/summonerschool/wiki/101#wiki_mentality.2C_toxicity.2C_autopiloting_and_tilting)",
            "Nvm fixed it Cable of SSD was out",
            "Any updates?",
            "Any updates?",
            "Any updates on how to fix this?",
            "Found any fix? I got the same issur",
            "Any update on how to fix this",
            "I've been having this error as well. Client stuck at Vanguard is initializing, then popping this error code. Has anyone else encountered this?",
            "Literally me. But its worse because she doesnt let me help. Its annoying asf.",
            "Wrong mega thread. It's to see if the enemy laner returns to lane directly or if they walk to another lane prior returning or if they are already in lane if they roam. Most do it when they are backing and can't respond.",
            "If it works after a restart but not when you \"start your pc normally\" it suggest that you have the option \"turn on fast startup\" enabled. Disabling that option should fix the issue. It doesn't work properly on some ( mostly older  ) systems.   \nSteps to disable the option:  \n1. win key + r ( run ) powercfg.cpl  \n2. choose what the power buttons do  \n3. change settings that are currently unavailable  \n4. disable turn on fast startup.  \nAfter that shut down your pc and turn it on again.  \nShould work.",
            "Same thing happened to me at the same time as it did to you so it's probably not a client-side issue.",
            "This is worked. I had to download Citrix for my nursing program to do HLCs for a hospital clinical. I just deleted it and now I can play league again. I tried everything. I didn't do the work around, just deleted Citirx. Thank you so much.",
            "hey man, just wanted to say thank you so much. this was my exact issue and I spent two days trying to troubleshoot and you fixed it. huge relief, thank you again.",
            "i have to comeback and search your post in the sea of everything.. this actually fixed my issue. bump you up up!",
            "Dude, i literally love you right now",
            "I also have this and am still tinkering",
            "Same here, I still searching for a solution.",
            "I decided to reinstall windows instead of troubleshooting dozens of possible apps that could lead to this problem.  \nIt helped, I can now play league. However, it takes about 3 min for me to load into the game. After champ select, main game client starts and sits at black screen for 3 min, after which I see the loading screen with 98% loading complete.",
            "Depending on laptot\\\\mobo. If anything gargamellor said wont help You either need to flash bios in CRISIS MODE with usb or worse actually Get a programmator and flash bios directly on chip(which you don\\`t want to go near if you dont know what you are doing)",
            "> That means that you can't sue them in court.\n\nThat completely depends on your local laws. TOS doesn't mean shit on its own.",
            "Sorry to hear it's happened to you too! I'm supposed to have the motherboard replaced tomorrow, I'll let you know if this fixes anything.  Fingers crossed in the meantime!",
            "This helped thank you.",
            "That really sucks dude, I hope you can find out what exactly went wrong cause that's so messed up. Sheesh.",
            "I did [https://support-leagueoflegends.riotgames.com/hc/en-us/articles/28977185962259-Troubleshooting-VAN-128-Vanguard-Error](https://support-leagueoflegends.riotgames.com/hc/en-us/articles/28977185962259-Troubleshooting-VAN-128-Vanguard-Error) and it works for me",
            "holy sheeeeesh, thx alot",
            "Do you know what these other similar programs that Vanguard might not like would be? I don't have MSI Afterburner nor Rivatuner, but I have the same problem.",
            "My game would literally freeze with any input from mouse or keyboard, uninstalled MSI Afterburner and it was fixed. Thank you sir",
            "Thanks, this worked perfectly.",
            "you are a legend, it was rivatuner.",
            "> MSI Afterburner, Rivatuner,\n\nI have both of those installed but neither has the \"start with windows\" check, so they are never in the background. Do you think they could still give me trouble?",
            "MAN THANK YOU. It was the MSI Afterburner! And I know its not an issue with Afterburner but this stupid vanguard messing with everything. I've lost 6 games trying to play and couldn't even move! Love you <3",
            "yes. but that doesnt solve the Vanguard problems.",
            "At this point, I'm hoping Riot pushes a hotfix for this mess.",
            "If you have any sort of GPU monitoring software running in the background like Rivatuner/MSI Afterburner it will cause this problem.",
            "[removed]",
            "Glad that i can help",
            "have you gotten a solution? i have the exact same issue and i cant find one",
            "Play a different game lol",
            "did u already fixxed it? im having same isse :>",
            "Just had this happen to me, can say that it never let me back into the game. I closed my client and everything, and I'm currently sitting in practice tool to see what happens. So it was seemingly just a one time thing? Still very annoying though",
            "Didn't work for me, I have just tried",
            "same issue, same resolution. Thx !",
            "Is there a permanent fix like this",
            "This fixed the issue of the league app not launching for me and \"Windows cannot access the specified device, path, or file. You may not have the appropriate permissions to access the item\", which was my initial problem. Now nothing within the League Client will load, but hey at least it launched! \\*laugh cry emojis\\*",
            "Had the same issue, to fix it faster you have to close all riot/lol/vanguard tabs in the task manager then restart LoL. It cost 1min but at least u can go back int he game earlier ...",
            "I was getting that too regularly, for some reason disconnecting the lan cable and playing on wifi fixed it",
            "I'm gonna intervene by saying secure boot is not required and can brick your OS with Vanguard",
            "Secure boot is a fix for only Windows 11 how about windows 10",
            "Literally exactly the same feeling bro, shits fucked",
            "This is the only thing that helped me! :O Thank you so much!",
            "still not sure still researching made a ticket as well",
            "still no solution riot still hasnt responded either",
            "Lower than 7th gen with windows 11",
            "Ok, at-least it’s not just me. Thank you for the response!",
            "the problem fixed itself for me",
            "You're welcome! Glad it helped",
            "Unfortunately had to update to Windows 11, league support didn't know why it was happening, they just told me to update to windows 11, i did and it works now :\\\\  \nBut not much of a solution imo, since if I was in windows 10 it still wouldn't work",
            "I could only fiz it by updating to Windows 11 :\\\\  \nThis sucks, I kept talking to League Support but they didn't know what the problem was either",
            "Then it sounds like it happened during a patch. It just so happened that it started during this patch for me, and whatever was causing your issue was eventually found and patched.",
            "Welp shit",
            "https://www.reddit.com/r/summonerschool/s/xwnm0Eccph try this one and if it doesn’t use the alternatives in those comments.",
            "I uninstalled it, just had it for testing, don't really need it on my private PC anyways",
            "Nope",
            "No, nothing at all :(",
            "But - ive heard that ppl, that are using citrix workspace, had these issues too. After deleting, it worked. Im currently Trying this one out too, i'll let you know if it worked for me.",
            "That was the first thing I tried but with no effect.",
            "Support of riot don't have any idea, they said me try to reinstall vanguard and try to change the DevOverrideEnable on 0 in registres of Your Windows, then they said me to try to reinstall all Game whit unstall with cleanner but the dame error when i reinstalled ",
            "Nope. The one and only time I encountered the error, and I haven't changed anything.",
            "Yep, I also checked my vanguard logs but it is in chinese, arabic and random symbols. I have a ticket with riot and sent to them but I doubt I will get a fix. Guess it's time to uninstall league, been playing for 7 years but not worth my time to try and fix if they don't even care themselves.",
            "I used a support ticket too but the answer was too much complex and I didn't knew if it was a good idea to enter in the \"deep\" of my PC. If any of the solutions that they tell you works for you, don't doubt to telling me please. Thank you mate, I hope we can come as soon as possible to the Summoner's Rift, AND STRONGER THAN EVER.",
            "Yup apparently it was because my vanguard was of on the tray so i needed to turn it on from task manager",
            "I think I found my problem, I had a non-original Windows version that appears to be missing, that's why it didn't boot up. But the question is, did Vanguard delete my Windows loader because it wasn't official and detected as a breach? Or did my Windows file go corrupt coincidentally one day after Vanguard came out? Either way, I hope you get to find an answer to your problem as well!",
            "if they arent actively running in the background it should not cause issues.",
            "I have uninstalled Afterburner (and anything I could think would do this i.e. ICUE) still have this issue. Wth it is only when I click to move, fps goes from 120 to 1. Literary cannot play this game anymore.",
            "It seems to have gone away in its own. I did get rid of MSI Afterburner and EVGA Precision, but it’s not like results were instant. Still get the occasional ping spike though"
        ]
    },
    "Today I learnt that Movement Speed stacking is not linear": {
        "title": "Today I learnt that Movement Speed stacking is not linear",
        "score": 12,
        "url": "https://www.reddit.com/r/summonerschool/comments/1dltjsc/today_i_learnt_that_movement_speed_stacking_is/",
        "content": "[Plot of Movement Speed](https://na.cx/i/n632SFc.jpg)\n\nI have plotted the effective MS, and below are the detailed descriptions from the [Wiki page](https://leagueoflegends.fandom.com/wiki/Movement_speed)\n\n>Movement speed caps\n\n>When the raw movement speed is greater than 415, there are two soft caps applied:\n\n>-The raw speed between 415 and 490 gets multiplied by 80%.\n\n>-The raw speed over 490 gets multiplied by 50%.\n\n>The two ranges have their reductions applied at the same time before being added back together.\n\n>As an example, if the calculated raw speed is 600 before soft caps kick in, it is reduced to (600 − 490) × 0.5 + (490 − 415) × 0.8 + 415 = 530, which means an 11.7% reduction of the original movement speed.\n\n>These are the simplified formulas:\n\n>-If the raw speed is 415 or lower, no cap is applied.\n\n>-If the raw speed is between 415 and 490, final speed is soft capped to (Raw MS) × 0.8 + 83.\n\n>-If the raw speed is above 490, final speed is soft capped to (Raw MS) × 0.5 + 230.\n\n>When the raw movement speed is less than 220 another two soft caps are used:\n\n>-If the raw speed is below 220, final speed is increased to 110 + (Raw MS) × 0.5.\n\n>-If the raw speed is below 0, final speed is increased to 110 + (Raw MS) × 0.01.\n\n>Example 1: If the calculated raw speed is 180 before soft caps kick in, it is increased to 180 × 0.5 + 110 = 200.Example 2: If the calculated raw speed is 0 before soft caps kick in, it is increased to 0 × 0.5 + 110 = 110.Example 3: If the calculated raw speed is -10000 before soft caps kick in, it is increased to -10000 × 0.01 + 110 = 10.\n\n>Only the slow with the highest value is taken into account within movement speed calculations. All additional slows are ignored until the higher-valued slow wears off.",
        "num_comments": 4,
        "comments": [
            "I once heard bwipo say a throwaway comment on his stream that part of why ghost got so powerful after a patch was that they reduced the %speed, but increased the duration so less of the stat got lost to DR.",
            "Is nonlinear the correct wording here? Someone educate me😂",
            "I think you're right. Linear implies increasing one value increases the other by a fixed amount. i.e some translation of y = x.\n\nBut the graph here isn't. It has linear sections, but overall it is non-linear",
            "It's correct yes"
        ]
    },
    "Let's talk about how and when to gank bot. Because I kinda struggle with it in all honesty.": {
        "title": "Let's talk about how and when to gank bot. Because I kinda struggle with it in all honesty.",
        "score": 7,
        "url": "https://www.reddit.com/r/summonerschool/comments/1dlqim7/lets_talk_about_how_and_when_to_gank_bot_because/",
        "content": "Disclaimer: Maining Lillia, a champ with bad ganks pre-6 and probably the worst tower diving for a melee champion because dots trigger tower shots isn't ideal for this. But in my experience, ganking bot feels often just way less consistent than ganking top.\nI wanna play devil's advocate here and argue why I personally prefer ganking top over bot and then I want you to explain to me why I am probably wrong lol.\n\nWhy I am ganking top:\n\nTop is less volatile, but one kill can potentially snowball harder.\n\nI don't know if it is just me, but it feels like in almost every game bot lane is just a constant Massacre. They are fighting, like, ALL THE TIME, and if there isn't like ten deaths before ten minutes,  it's a pure farm lane where nobody is in a good position to be ganked. This is due to the existence of the support, which can enable or disable fighting depending on the pick. Hook and engage supports are obviously more deadly than enchanters.\nTop is a different story. Usually there is one guy completely dominating the other and pushing him extremely hard into the tower, which is usually a perfect gank setup (btw I am playing in low Elo and people don't know when to push in and when not to. Often they push hard without rotating for an objective.). But they do not nessesarily outright kill each other. \n\nFrom my perspective, a good gank mostly relies on the surprise momentum and the number advantage. It's usually more convenient to bet on a  2v1 in top then a 3v2 in bot, primarily because there is a lot that can and will likely happen between the moment I move towards it and my arrival. Chances are the moment I am there somebody is already dead and there goes my chance for the Gank - regardless of on which side the death is. If the death is on my team, there is no numbers advantage anymore and my teammate is probably going to recall or just hold the line and my Gank wouldn't change much. If the enemy dies, he is going to flee under his tower and there goes my Gank opportunity.\nIn top this happens in general just way less often.\n\nTop in general has it also easier to really snowball with the advantage from the Gank because it's in general just the more statchecky lane. While ADCs main damage is also mostly point and click, the dynamic with range and the support makes it way easier for both sides to swing the tide into the other direction (which is also what is ment with \"bot is volatile\").\n\nI know that the ADC is supposed to be the primary carry of the game in the late game and top lane is kinda more ambiguous in how much impact they will have, but in all honesty, in soloq at least it feels something extremely random who will actually carry in the end. Might be also because of my low Elo and that I often play normals.\n\nThat would be the reasons I have why I prefer ganking top. Now pls comment why I am wrong lol",
        "num_comments": 9,
        "comments": [
            "the rule of thumb with early game ganking is to gank the most volatile lane, because you can swing the advantage in your favour the most, or the lane with the best gank set up. If top lane has two bruisers, they’ll be fighting a bunch, meaning you can swing the fights in favour of your team and leverage that advantage. If your bot lane has good gank set up, like blitz/naut/leo etc, ganks are much more likely to work out bot. So before you even load in, look at your lanes to see where the most volatile match up is, and where the best gank set up is. Path towards that lane initially. Don’t force ganks that aren’t there though. Lilia is not an early game powerhouse, which means that ganks are a matter of opportunity. Wasted time on a gank is time lost clearing, so never go out of your way to force unless it’s basically guaranteed you can convert the gank.  \n\nFrom there play around your win condition, which will be team and game dependant. I also would say, especially with top, you often don’t want to be camping top once the lane is effectively won lane. That’s not to say don’t gank a winning lane, but don’t gank a WON lane. Because now the outcome doesn’t change with or without you. You have to know top matchups to know when this is though, as it differs each game. But as a top main, if I’m 3-0 with a level and CS lead, I don’t want my jungler showing up unless I ping for it, it can slow down my tempo. Instead, I want my jgl to leverage my pressure into snowballing the game state. Play OFF your strongest members now. That could be as basic as counter jungle topside if your laner is strong and able to assist. Sometimes that is cross mapping, like if your fed top is pushing T2 top and dragon is up. Or it might be about hovering them when you know the enemy team are looking to shut them down. \n\nSame principle applies for bot really. Make sure your carry doesn’t get shut down, leverage their pressure to advance the game state further etc. but if bot is ahead, you don’t want to cross map them like you would with top. Instead you’d want to enable them to get as much as they can. Hover them so they can get tower gold and cs safely, play for obj and fights, etc",
            "As an adc suffering in low elo, the best moment to gank is when I’m being pushed under my tower. Just activate sweeper and run at the enemy from behind. However, check the state of the wave first. Ganking when I have 3 waves under my tower is gonna get all 3 of us killed, most likely. \nSometimes I’ll let the enemy push into me even tho I’m much stronger just because I want them in a position where it’s easy for the jungler to come and gank. \n\nPlease, for the love of rngeesus, don’t take my wave if you did ganked and took a kill or 2. I don’t mind you helping me push when I have to crash a wave after gank, but if you only come bot to tax 3 waves coming my way for no reason, imma follow you around jungle and the game is gonna go to hell.",
            "Bro I’m just still trying to wrap my head around a low elo jungle who knows top lane exists!! I swear yesterday I was playing and 5 games in a row not one gank top side, didn’t matter if I was 5/0/0 or 0/3/0, I’ve got to the point that if I’m ahead enough I’ll go take grubs or Harold by my self. It’s been so bad in the recently I switch to jungle so I could maybe understand why they don’t gank top but nope still don’t get it cause your natural rotation of camps will have you right there to gank them multiples times in the first 10 min",
            "Letting the enemy push before a gank hell yeah. Rare sight.",
            "The last thing might be not because of I just wanna tax you but rather because need to establish lane priority for an objective 😐",
            "Botlane prio for drag is hard because what *should* happen is the support roams to drag with you as the adc pushes out the wave. Then, *if* the enemy mid/jg responds, adc moves up. Watching the jg hit the wave to push it faster right after a fight means watching no less than half that cs probably go to someone else, either the jungler or the other team’s minions",
            "Takes wave, gets prio, recalls.\n\nGod damnit.",
            "Honestly I wouldn't mind if that *would* happen :,D"
        ]
    },
    "Cheese ganks in emerald": {
        "title": "Cheese ganks in emerald",
        "score": 3,
        "url": "https://www.reddit.com/r/summonerschool/comments/1dlu5lh/cheese_ganks_in_emerald/",
        "content": "I wanna discuss the whole cheese ganking concept. Every game in low emerald it seems like the jungler that cheese ganks (pre 3:00 min) seems to break the mental of laners super early. \n\nAs the opposing jungler it feels like if you don't do the same, no matter how much of a cs lead you get or punish by taking the opposite map side camps, you just lose the game cause players mental gets broken.\n\nThen they stop rotating to help on objectives which should be free goven enemy recalled, makes the game impossible. But I'm hesitant to cheese cause I feel like I will fall too far behind if it doesn't workout. What to do?",
        "num_comments": 1,
        "comments": [
            "Ping them and tell them to ward specific area at 2:30. Chances are your teammates won't pay attention where enemy jungler started, so take that responsibility on yourself. You should have a rough idea where your enemy jungler is at all stages of the early game. If they didn't get a leash, but you have mid prio, ask them to check enemy raptors and see if they've done it, this should already tell you enough where they are pathing. However, in lower elo, you sometimes have to do sub optimal play just to make it work, so if you are 90% sure that enemy jungler will cheese a bot gank pre 3:00, then try to get there at 2:50."
        ]
    }
}