{
    "SwiftlyNeutral - Daily Discussion Thread | June 21, 2024": {
        "title": "SwiftlyNeutral - Daily Discussion Thread | June 21, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dl63sa/swiftlyneutral_daily_discussion_thread_june_21/",
        "content": "**Welcome to the SwiftlyNeutral daily discussion thread!**\n\nUse this thread to talk about anything you'd like, including but not limited to:\n\n* Your personal thoughts, rants, vents, and musings about Taylor, her music, or the Swiftie fandom\n* Your personal album + song reviews and rankings (including TTPD)\n* Memes, funny TikToks/videos that you'd like to share\n* Screenshots of Swifties acting up on other social media platforms (ALL usernames/personal info must be removed unless the account is a public figure/verified)\n* Off-topic discussions, or lower effort content that might not warrant a wider discussion in its own post\n\nAll sub rules still apply to the discussion thread and any rule breaking comments will be removed. Please report rule breaking comments if you come across them.\n\nIf you are taking screenshots from places like TikTok, Twitter, or IG, please remove all personal information before posting it here. Screenshots posted to make fun of users from other Taylor-related subreddits are not allowed and will be removed.\n\nComments directly linking to other Taylor Swift subreddits will be removed to discourage brigading.\n\n*Posts that are submitted to the sub that seem like a better fit for this thread will be redirected here. A new thread will post each day at 11:00am Eastern Time. This thread will always be pinned to the subreddit for easy access.*",
        "num_comments": 254,
        "comments": [
            "Something I've been thinking about is how much people want to be 'right' about Taylor. I think some of this is Taylor's fault for gamifying things (but never her personal life). It's just interesting to see when I and others could not care less about that side of her fame.",
            "I find Kayleigh Teller to be very strange.",
            "I saw folks sharing their own lists here of tracks they like and I never fully felt like I could do that yet. So far, I streamed the anthology 15 times now (long commute) and the only fully developed cohesive standouts are:\n\n- Guilty As Sin?\n- The Manuscript\n- loml\n- Peter\n- Robin\n- Clara Bow\n\nMost of the album is now forgotten or not enjoyable at this point. I just took these out in a separate album and stream them.",
            "Again with the paternity test about The Black Dog all over this fandom. I actually once cared about this, but now I'm just so over it. Matty doesn't care about Taylor, he's engaged. Joe possibly cares even less. Travis is just shaking it off. If she's sending signs she's just being a fool, which I don't believe she is actually. \n\n\nTo me personally she's playing swifties as fools because she knows people will try to decode songs that sometimes just go well together. Swifties are just doing a huge favor by streaming the songs 25251717 more times to discover hidden meanings and some think it's Joe, others are sure it's Matty, some have entire thesis it's even Kylie, a minority believe it's Harry Styles and everyone swear they have better evidence. It's honestly exhausting at this point. ",
            "That fire video was too funny! I’m glad nothing bad happened and everyone was okay. \n\nAlso cat crumbs! I love seeing her cats",
            "[removed]",
            "The fandom is going to be Insufferable this weekend and I’m equally 😬🍿",
            "I miss the sub when it was on private lol\n\nLike I like this place because it is neutral. But when you have people from that sub just piling on - it's hard to engage when you know it's not a good faith discussion. \n\nAnd I find it hard to take the person seriously when they rail about the stupidity of swifties and then proceed to display the same behaviour and spread misinformation to suit their own narratives. It's beyond weird to hate someone so much you post about her endlessly in snark subs AND pop culture subs",
            "I had a friend who’s a huge Swiftie in my car for a long ride and she played mostly recent Taylor. I didn’t realize just how repetitive some of her rhymes are and how she repurposes some lyrics. I still enjoy her music but this is why I can’t listen to a playlist of her recent works.",
            "I think there was a post about this earlier. But I’m very sick of the “x city won.” Feels like she just uses the same 5 base songs to match with others",
            "I’m kinda excited to see the surprise songs over the next few days! Not from like a “lore” perspective but I’ve been really enjoying the mashups she’s been doing recently. It’s interesting to see how she uses her own works creatively",
            "I didn’t care for Gracie’s collab with Taylor. I saw Aaron was producing it so I got excited. Even without Taylor, the song wasn’t interesting but it was one of those features where the featuring artist didn’t add anything special to the song. She was literally just there.",
            "I'm a Woodvale truther, so therefore I tried my hand at creating my own Woodvale playlist featuring songs from Midnights and TTPD (+ Safe & Sound... tracklist spoiler?) I don't think this is the final version, but here's at least the first try if anyone wants to take a look 😊.\n\n\n\n\n1. Would've, Could've, Should've\n2. The Great War\n3. Safe & Sound\n4. I Hate It Here\n5. You're on Your Own, Kid (Strings Version)\n6. The Prophecy\n7. loml\n8. Chloe or Sam or Sophia or Marcus \n9. I Look in People's Windows.\n10. The Bolter\n11. High Infidelity\n12. The Albatross\n13. Peter\n14. Bigger Than The Whole Sky\n15. How Did It End?\n\n\nBonus tracks: The Smallest Man Who Ever Lived, Clara Bow, The Black Dog, Cassandra, Robin, and The Manuscript. ",
            "She did NOT just combine the bridges of Hits Different and DBATC 😭😭😭 and then The Black Dog x Come Back… Be Here x Maroon?? London you won so bad",
            "Has anyone seen the new Taylor/scooter documentary that just came out? Is there anything new or is it just all rehashed stuff?",
            "is she actually in the cleaning cart right before she goes on stage or is that a joke swifties made up??",
            "ttpd (the title track) i used to consider one of taylor's worst songs ever. now it's among my absolute faves 🙂",
            "Us fucking slaps, and is one of the best bridges she’s ever been attached to. Plus, it’s fascinating to hear Taylor Swift get the Taylor Swift feature treatment for the most part",
            "I came across the but daddy I love him performance on YouTube and I’m thinking.. am I the only one who finds it insulting (couldn’t think of a better word?) that she points at the audience as she sings *I just learned these people only raise you to cage you* I meannnn😭😭 this isn’t a subtle shade anymore.\n\nEdit: deleted the last sentence",
            "I love the collab with gracie and the video gracie posted on instagram where taylors extinguishing the fire on the counter is very sweet :)",
            "Thought I'd post this here to get people's thoughts\n\nI traveled down to Cardiff for The Eras Tour and when I was asked by people I met why I was in town, I would tell them it's for Taylor Swift and the response was always the same. They intend no disrespect to her but they just don't get it. They don't see what's so popular about her, how she can fill stadiums and have fans queue up for hours/miles just to see her. They acknowledge that she's talented and good at what she does but good enough to have the fandom she does? They didn't get it\n\nPersonally, I think it's 50% her talent and 50% her marketing team. Apple make great phones but there are other phones that are just as good for a fraction of the price but they don't have the marketing Apple do",
            "I know this is a Reddit-wide problem and not a this sub specific issue, but when I get downvoted into the negatives for ranking my personal list of favorite to least favorite of Taylor’s albums, I start missing when this sub was private. 😭",
            "That was really nice of Taylor and Travis to invite their families all the way to London when they definitely broke up weeks ago because their PR contract ended (for the 53rd time in 6 months). \n\n🥅",
            "playing 2 songs about ratty mashed up with come back… be here WITH HER BF IN THE AUDIENCE is wild behavior",
            "I thought with Travis actually being at the show we’d be spared the ‘Matty-coded’ ‘sending signals/messages’ surprise songs discourse, but alas it has now shifted to ‘I can’t believe she played these songs in front of Travis, she wants Matty back!!1!’ 💀. \n\nLike why is he allowed to move on but she isn’t? Did Taylor get custody of the Maylor shippers in the divorce?",
            "Hi there - just saying I’m thankful this sub exists after being bullied repeatedly in the main sub for suggesting the book with US written on the cover could have be a The Story of Us reference (in addition to Gracie Abrams).\n\nI’m more of a lurker, just wanted to post here a few times in case this sub decides to go private again so that I can get approved. 👋",
            "Gracie’s new album is fantastic and Us is beautiful. I’m so glad she’s getting the shine she deserves, she’s a very talented young woman.",
            "I'm a swiftie since Speak Now and Midnights was my least favorite album of hers. So when TTPD came out, I was excited to hear it. I tried to love it, but after a week of the release, I couldn't. It feels like a jumbled word salad.\n\nEverything sounds the same until I hear people making an AI cover of Olivia Rodrigo singing \"I Hate It Here\" on tiktok. It sounds so good that I tried to relisten to TTPD again, but my initial thoughts remained the same.\n\nIt makes me so confused how even Taylor's \"I Hate It Here\" sounds like bland chicken to me, someone who has been Taylor's fan for so long, but the same song and lyrics sound so good in a different voice (unfortunately, in this case, AI, which is unethical and scary af)",
            "https://preview.redd.it/f67rhaeu2y7d1.jpeg?width=1170&format=pjpg&auto=webp&s=aaa24b6fde4bd54601add7ea11eacf498d5d5a4b\n\nWhy are they reporting he's in London? This is a Taylor account lol",
            "Yall think we’re getting a run and kiss staged moment this weekend?",
            "Regarding who the Black Dog may be about — didn’t Jack post a pic of the day she recorded it at ELS? Wasn’t she wearing those flowery jeans? Was that before her breakup with Matty? If so, then that means she wrote the song before she broke up with Matty and it’s more likely to be about Joe. Unless Jack is lying and trolling lol I still feel like it’s a Joe inspired song.",
            "Anyone watching the new Max documentary about the Scooter Braun masters issue?? What are your thoughts? \n\nPersonally, I think it makes it very clear that Taylor very intentionally played the victim in this situation and lied to mislead her fans and the media to gang up on Big Machine, Scott, and Scooter. And apparently their families. \n\nI’m curious if this will open anyone’s eyes or what the response from Taylor or her fans will be.",
            "I’m disappointed Travis and his crew showed up today. I was really hoping this nonsense would be over by now. Like please bring back the time before I knew this man existed.",
            "She’s been playing maroon pretty frequently in her mash ups - I wonder why? Going to sound parasocial and she can do what she wants obviously it’s her songs but I’m just more inclined to think that there’s some truth about her sending secret messages in her acoustic songs  🤷🏻‍♀️ \n\njust my thoughts because she just played maroon recently and she has hundreds of songs to choose from, so it seems “strange”? (not sure if that’s the correct word), that she’ll choose to play it again so soon, and her choice of acoustic songs do seem to somehow reflect what’s going on usually!",
            "Where can I watch today's performance live online?",
            "What I think is that :  just Maybe Taylor called the entire brigade down to London because it matches well with the documentary release and does something just to drown out all the noise of the documentary.",
            "[deleted]",
            "Well my Swiftball is off to a rough start 😅",
            "did the scooter/taylor documentary reveal anything new? the snark sub is talking so much shit I just want to know if anything like absolutely horrid came out",
            "Rep tv potentially being about matty and not joe, the mashup today might directed about matty, folklore and evermore about him… damn, as someone who doesn’t like this man i have to go through it rn… it was real love after all ",
            "She has excessive main character energy for someone who is only “famous” for her relationships as far as I can tell.",
            "Oh god, what did she do now 🫣",
            "Idk who this is, should I keep it that way",
            "She has zero chill",
            "So bizarre.",
            "Watch as she does nothing and makes them look like clowns again like she did in the 100th show. Lol.",
            "people need to just accept that she is straight. she's literally the straightest most gender conforming woman alive. she is not secretly gay no matter how many imaginary conspiracy theories people invent. Let Her Live.",
            "[removed]",
            "On a weekend where everyone’s speculations are running wild about literally everything else, she’s gonna finally drop Rep TV.",
            "The dancers are not helping with the speculation with the insta posts and comments.",
            "I'm seated as well. It will likely be insufferable, but will we will get some big pop culture moments?? 👀👀👀",
            "What's going on this weekend?",
            "![gif](giphy|12aW6JtfvUdcdO)",
            "I block people who I notice regularly derail conversations or have particularly bad faith takes so that I don’t accidentally engage with them in the future",
            "I generally agree but it’s so quiet when it’s on private",
            "I agree, the difference was STARK the second it came off priv. It kind of feels like some people just come over from the snark sub to spread misery by fighting and insulting people here outside of their echo chamber",
            "This sub should've been for approved users since day 1. And honestly it was a nice time when it was born, you could actually say unpopular or/and neutral opinions that you could not say in other parts. Now, you have to be careful...You can't even make a civil discussion about the lore without having people downvoting you or attacking you cause you don't share their opinion. ",
            "IKR I can practically name the users who are just obsessed with taylor because their history is just either commenting here or on other taylor snark related sub. The haters and the stans are not so different after all.",
            "I was thinking about this last night, I went down a rabbit hole through some old posts and was struck by the difference in the conversations. As in actual nuanced discussions among multiple people in one thread.",
            "yep",
            "the \"car\" and \"bar\" rhymes are on another level. she seems to only use that rhyme on good songs, but still!",
            "This album has proven to me that I just don't care for Gracie's music",
            "It sounded like a generic pop song to my ears. If I heard it on the radio I would have thought it was an unfamiliar to me TS deep cut.",
            "I have a feeling that this was meant to hit TTPD and didn't so Gracie used it for her album. \nOn the other note , I was very disoriented with the Lyrical Video and just like you didn't care for the song. I thought a lot was happening at the same time.",
            "Taylor 🧍🏼‍♀️😅",
            "Justice for Chloe or Sam or Sophia or Marcus!!\n\nI think its one of the saddest love songs she's ever done. It felt like she was mourning time itself",
            "I was also thinking about combining some of my other favorite songs from Midnights and TTPD to create an extended play/mini-album with them.\n\n\nThe songs are, in no particular order: Lavender Haze, Maroon, Anti-Hero, Midnight Rain, Fortnight, and So Long, London. My brain is also screaming at me to include The Archer, so that'd be included as well. \n\n\nI was additionally tempted to add Sweet Nothing, Mastermind, and Dear Reader, but I feel like the songs above allow for an E.P. with a focus on sleepless nights reflecting on failed and/or toxic relationships (so... basically the original Midnights concept lolll.)",
            "Woodvale or not. That is a great playlist.",
            "I love it. I WISH IT WAS REAL",
            "Taste",
            "Did you actually make the playlist (I was thinking of making it myself on Spotify but I don’t want to make a new one if it was already made by you)?",
            "I guessed that portion of death by a thousand cuts on guitar as well as 'come back be here' for surprise songs this weekend . But a chaotic combination and two great bridges in the guitar acoustic !",
            "Watching it now, it does show a bit more about the masters deal, it pokes holes in Taylor's narrative (at least a bit to me bc I don't remember reading about people who spoke up against Taylor back then). However...most of it is stuff we already know like her dad making money from the deal and how swifties attack Taylor's critics (a lot is about the fan army)",
            "There are videos of her exerting the cart. She's in there.",
            "A lot of the sports stadiums don’t have covered or underground access to the stage as it’s on the ‘pitch’ so she needs to use something to get her there where she’s not seen. It’s cute and funny but ultimately just a practical thing.",
            "She's in the cart. I feel it's because she wants her reveal to be in the birth of Venus intro and not walking to the stage .",
            "It’s not only her worst title track but also one of her weakest songs for me. Lyrically and sonically.",
            "i don't consider it a good taylor song but it's far more catchy that i wanted to admit at first. the stupid line about golden retrievers and the ending part got stuck in my head",
            "I have realized the whole of ttpd has many many catchy lyrics but not that many great songs, so I occasionally hum one or two lyrics of a song but if I try to listen to it as a whole, I don't really like it.",
            "I truly love the song overall but there are like five lines I actively cringe at lol",
            "I really loved her backing vocals though. They elevated the song perfectly!",
            "I’ve been listening to it on repeat all morning. I love everything about it. Both Gracie and Taylor sound beautiful, the song is gorgeous, and I’m glad Gracie didn’t allow it to become the Taylor Show. ",
            "Her feature on Haim's Gasoline is almost non existent, so at least she's fair and consistent. Honestly I don't think it's an ego thing and everyone is giving her shit for nothing.",
            "It’s gotta be such a powerful feeling to be able to shit on the people who are the source of your fame and wealth and have them cheer. And not only cheer, but continue to be your fan and buy any and everything you put out. I don’t mean that her doing so is good but just imagine how she feels when she does that",
            "I hate that song and even hate it more that it stayed and Long Live went away.",
            "It’s a dark performance, way darker than it comes across on the album. The way she straight up sneers at ‘try and come for my job’ is no bullshit, like ‘try, bitches, just try it, I dare you. I will always win.’ I was kind of shocked, it sounds like a throw away line on the album.",
            "We never really get these real moments of her, she used to share her life like that but has stopped over the years. Was kind of nice to see her just in a real life setting",
            "I just watched it and laughed so much. It also made me realize that I didn’t really know how to use a fire extinguisher because I’ve never really thought about it? 😅",
            "Ok so side note about this story that kind of freaked me out.  When the candle fell over and they didn’t know, Taylor supposedly said “oh, it’s just one of my cats knocking around” or something along those lines.\n\nAm I the only crazy person whose brain was immediately like. “Ma’am are you really leaving unattended candles lying around with your cats like this?  Or like you thought it was the cat just knocking something over and you also knew you had a candle burning and didn’t immediately think your kitchen might be on fire?”\n\nMy brain would have immediately, even drunk, been like OMG what if it was the candle and assumed my house was gonna burn down and checked on it right away.  Am I like crazy paranoid or something?  I was literally racking my brain about it all day after reading that!",
            "I feel like it's the same with anything else that's super popular. Like how I don't get the appeal of the marvel franchise or going to Disney twice a year as a childless adult lol",
            "I’m kind of sick of the question “but why do you like her so much” or “what is it about her that makes you like her?” Like idk she’s my favorite artist? Why does it require more of an explanation? Lots of people have an artist that they’re a die hard fan of, that they would follow on tour to another country/continent and no one questions them. When people lined up to see End Game I didn’t question why they love Marvel so much. I thought that’s fun that they have something to be excited about and want to line up for. Why can’t people just feel the same way for us? \n\nI hate to call misogyny, but I can’t see another explanation, no one has to explain why they followed KISS or AC/DC on their world tours or why they lined up all night to see the first screening of End Game, or showed up 5 hours early to tailgate for their favorite football team. It’s only stereotypical female interests that get questioned like this. I’m questioned about liking Taylor Swift or lining up for the new Twilight movie back in 2010 to see a first screening, or enjoying the Barbie movie, or questioned if I *actually* like the sport I’m watching and know the rules.",
            "no offense, but i think that 50% talent is being a bit generous. 75% of this success is because of her marketing, this is the culmination of almost 20 years of laying the seeds",
            "I think nostalgia plays a huge part, and the recent late-millennial desire to reconnect with girlhood. Everyone I know, whether they were fans or not, grew up with Taylor. She was the soundtrack of middle/high school. Being able to go back to that time with a perspective of love and joy can be really fun and empowering. Some people are even now able to share that with their own little girls. That sort of energy is contagious!",
            "There's a lot of random downvoting even for perfectly harmless takes. \nYesterday a few minutes after every single comment I was downvoted. Ridiculous to say I guess this but felt like was being shadowed /trolled ",
            "The click bait articles of them breaking up are so tiresome once it actually happens people won't believe it",
            "I can’t believe some random surprise songs, the snark subs and an online psychic weren’t correct 😔.",
            "At this point I feel she is messing with the fans :) The Matty fans thought she'd play the song in Dublin. But she actually played it in London; but then she also threw in Maroon at the end. Then she also added 'come back be here' with the I guess you're in New York today' verse which people could interpret as Joe.\n\nSo while fans argue about muses, there is so much engagement for a tour that has crossed 100 shows! The surprise song mashups is what is keeping the Eras Tour fresh for most of us1\n\nEdit : But more or less in the recent shows she uses the mashups to tell a story arc too :like Cornelia Street- Maroon; or Great War- You're Losing Me- I survived the Great War.   Black Dog- come back, be here and Maroon",
            "Very wild to do that in front of her current bf while singing you want ratty back basically…. She’s nuts ",
            "It’s probably because it references London and nothing more. People need to let go of this Matty thing. \n\nAlso the Black Dog is definitely about Joe. The fact he smirked when he said he’d never been to vauxhall was telling. There’s a zillion bars called the Black Dog.",
            "I don’t get how the black dogs about ratty",
            "I'm a maylor shipper ( don't attack me pls ) but i agree with what someone said i genuinely feel like it's insulting to her as a performer to insinuate she cannot sing a song on stage without it somehow meaning more",
            "I love her. I don’t get the hate either! Us has been on heavy rotation this morning. ",
            "Agreed, I’ve never got the hate for her.",
            "I feel like she’s lost her spark with a very specific kind of songwriting. The more storytelling, rhymes that are super clever, descriptive imagery, etc. vibe\n\nMaybe because she (claims to have) written at least some of the lyrics on TTPD as poetry first, but I agree with the “word salad” sentiment and I think that’s the reason",
            "Because this probably means he and Kylie will be at a concert this weekend.",
            "I already can hear the scraping sounds of the Tayvis are done goalposts being dragged. Again.",
            "100% lol",
            "I’ll be coming back to this comment if it happens 💀",
            "Did this happen? Haven’t seen anything about it",
            "They’ve been apart for a month, of course we are lol",
            "I expect extra staged everything. After the somber tone of their pap pics in Italy I hope there is some genuine affection mixed in. But given other couple happenings - who knows!",
            "I’m predicting the absolute most I’VE NEVER BEEN HAPPIER vibes lol",
            "That was actually debunked, she was wearing dark bike shorts when she recorded that part of the song in Jack's video - you can tell when her leg moves slightly that the flower pattern is on the couch.\n\nSomeone found those shorts and it matches her outfit from 6/22... [they explained more here](https://www.reddit.com/r/SwiftlyNeutral/s/50Q0RpllwS). The sweatshirt she was wearing earlier is on the back of the couch\n\nSo yeah it was def recorded after she & Matty broke up. The location of the actual bar is debated though. But there are enough other things that point to it being about Matty IMO - he's a smoker (Joe isn't), the Starting Line being one of his favorite bands and he covered their song, he tends to hook up with younger girls, etc.\n\nAlso the narrative in the song lines up with Matty ghosting her. The Black Dog is sung from the perspective of someone who can't understand why the person who has left her doesn't miss her at all... and that just doesn't line up with what she's told us about how things ended with Joe. In So Long London, she knows why it ended - she's sad but accepted that the relationship was over for good.",
            "No there’s flowers in front of her so it looks like she’s a wearing flowery jeans but she’s wearing black shorts. You have to look at the video  a bit closer and too can see the shorts instead of the flowers.\n\n[https://www.reddit.com/r/SwiftlyNeutral/s/v2xBfGhupL](https://www.reddit.com/r/SwiftlyNeutral/s/v2xBfGhupL)\n\nAnd here’s the video of her recoding the black dog. Look past the flowers and you’ll see The black shorts.\n\n[https://www.reddit.com/r/TaylorSwift/s/PKHkt35vFq](https://www.reddit.com/r/TaylorSwift/s/PKHkt35vFq)\n\nhttps://preview.redd.it/f9e2xqtce08d1.jpeg?width=1170&format=pjpg&auto=webp&s=e964438573f8ebb36825809cc62bd92beed47108",
            "I’m firmly in the camp of “this is an ESH situation and I’m not spending my time watching a docuseries to rehash the same things I’ve seen argued on the internet for years already”",
            "I had no plans on watching it but this commentary & others have started to peak my interest a bit 🤔\n\nEta: typo, *pique, (ty for the correction!)",
            "I'm just waiting for everyone to watch and someone to put the bullet points out. 😂",
            "I have no plans to watch it. But I'll never side with a record label over an artist. Even when that artist has $1 billion.",
            "Not just a take on this but honestly, I hate all these docs, they are generally boring AF and usually don’t tell us things we didn’t already know because gossip/entertainment reporting is so extensive already.",
            "I thought they paid equal attention to both sides of the issue. was it biased towards Scooter after all?",
            "And some people got stuck with ME! 🤡🤡🤡",
            "She's also played YOYOK more times than Maroon ",
            "I wonder if she just likes it and it works well as a ‘base’ for mashups.",
            "There has been what seems to be an almost chronological lyrical retelling/ recounting of her history through these mashups. It’s actually genius.",
            "@tessbohne on instagram and @tessdear on tiktok. she livestreams every show :)",
            "@taylorswifthockeybro YouTube",
            "Nobody is paying attention to that documentary. London was always planned to be a big show, attendance wise. Travis had said weeks ago on the podcast that the London shows would be fire (or some other bro-y thing, I can’t remember how he phrased it )",
            "Since 2017\n\n\nEdit: actually i can't remember if it's since 2016 (snakegate) or 2017 in rep era",
            "I’ve blocked/muted that sub. They’re so unhinged, they’re giving the SMM folks a run for their money. They’re convinced Joe ghostwrote all of Folklore and Evermore and Taylor just took the credit for herself and that she’s always used ghostwriters for her music. Absolutely unhinged conspiracy theories.",
            "most of this is based on fan theories",
            "A lot of this I would say is probably because Taylor takes phrases and metaphors she used with Joe and deliberately reassigns them to Matty.\n\nFor example 'starry eyes sparking up my darker night' in Call it what you want' is about Joe.\n\nBut this phrase is right there in 'Smallest man who ever lived' which the consensus is about Matty.\n\nSo if we start taking TTPD as the main reference for her entire discography and reverse check all the albums, then it would definitely seem like all the older albums are about Matty ! Instead of us accepting she has decided to reassign a lot of metaphors she used for an ex to another muse for whatever reason post-breakup (probably as a way of the author taking control of the narrative to say I can shape the story)",
            "Also, let’s live in dream world for a moment and say she’s gay. At the very least that would mean she has made the conscious and continued decision to stay in the closet. It’s fucking gross for people who genuinely think she’s queer, many of whom are queer themselves, to demand she come out. I can almost guarantee those same people would be up in arms if someone did that to someone they cared about IRL.",
            "gaylors are very convinced she's going to come out soon and it's pride month so their hopes are high",
            "Pride month, Gaylor theories etc ",
            "That or do not a goddamn thing 😂",
            "They are trolls and it’s hilarious. After over a year of the fans they know just which buttons to press 😆",
            "Eras Tour is in London and I think Travis is speculated to be there (or might already be there, idk. I don't keep track of him)",
            "She’s in London and apparently the entire Kelce clan along with the Mahomes family are there. Some people think she will use this as an opportunity to make an Announcement. So you’ll have the part of the fandom that fawns obsessively over them in really creepy ways, the part of the fandom that is either tired of the romance or thinks it’s PR, the part of the fandom that thinks she’ll end up with Matty still, and the part of the fandom that has strong feelings about her relationship with Joe and how she treated him all fired up at once. On top of that, you’ll have a dash of people who find it hypocritical when fans cry misogyny at people who “center her career around a man instead of her talent” when the men are clearly part of the brand she’s selling. So entertaining and also messy 😂",
            "I've been doing this lately too, but unfortunately, I've found out that when you block them, you can still see their comments. It's not the worst thing because it means they can't reply to me, but it just seems like a bad system. \n\nWhich also means I saw someone I blocked asking about the \\[deleted\\] (which is what they see when they're blocked) and someone was advising them that you could see the comments by signing out and looking at the page -\\_- god, I hope people don't care that much to do that.",
            "Yeah I prefer when it’s not private, it’s too quiet",
            "I don't mind the quiet tbh. The takes were more nuanced and the criticism felt more genuine. Compared to now where you can tell hating is an Olympic sport for some people.",
            "Oh for sure, some people definitely come here just to bait and argue and downvote. For a while, everytime i posted a comment, it was immediately downvoted to like -4.",
            "if she rhymes car with bar you know the song's gonna be top 5 on the album",
            "True ! This is one metaphor I've got used to. I think it is there in all the last 5-6 albums\n\nedit: rhyme",
            "Gracie has a lovely voice, she sounded wonderful at my Eras show, but her music has never been interesting to me.",
            "Same same.",
            "And of course, the one where Jack put his finger on it. 🤷",
            "the only legit ttpd song for me",
            "It's such a beautiful and sad song, I definitely agree!",
            "Thank you so much! I was a bit nervous sharing this (I'm always that way with commenting/posting), so the kind words are appreciated! 😊😊",
            "Thank you!!! I did make a Spotify playlist for it, if you'd like a link???",
            "Thank you!! :)))",
            "Hiya! So, yes I did make a Spotify playlist for it! It's just of the \"main\" tracks, so none of the bonus ones I mentioned at the very end. Here's a link if you'd like to give it a listen :)))))) [https://open.spotify.com/playlist/1VAo4TpDgDkkGiIzA8znvZ](https://open.spotify.com/playlist/1VAo4TpDgDkkGiIzA8znvZ)",
            "I feel like its a good doc for people that aren't really fans but are curious and wonder why she is doing the taylor versions",
            "do you think it will change the way the public views the masters dispute or nah?",
            "the awful lyrics are still awful, i've just conditioned myself to either ignore them or lean into the cringe. but i really love the chorus, and also the whole concept of this irreverent, twisted romance; it's got a \"we make each other worse <3\" kind of vibe that my brain cannot resist",
            "no for real, i do this too. i talk about how much i don't like down bad, fortnight, and who's afraid of little old me? but i still find myself humming the tune of these songs like pls get out of my head!!",
            "She has a full verse on Gasoline and they added very noticeable vocals on the bridge chorus that are unique to her. What more should a feature have? 😅",
            "God things like this make me glad I'm not a swiftie. Taking away \"the fan song\" and adding a song telling the fans off. Like being handled like a child lol. \n\nImagine just being a normal fan and having to sit through her singing that, flipping them off and shit, gesturing at them. Be like 50 cent saying what the fuck did I do lool.",
            "I really miss them but I get why she doesn’t.",
            "if people hadn't been so mean to her (despite what people say on this website, people were really cruel to her in 2016) she probably would have continued in some bursts, instead of going completely dark",
            "Just remember PASS \n\nPull out the Pin -\nAim - \nSqueeze (the handle) -\nSweep\n\nI have had to be safety trained a lot, so hope this helps!",
            "when taylor said “bitch” when the fire extinguisher didnt work yea that was very me",
            "I mean... Leaving an unattended open flame and you have three cats running around, the cat could be very much on fire.",
            "yes, it's not that deep or exclusive. we're in the era of super niches and personalised feeds. what's the biggest names and most obvious facts for me might be somethings you never heard about (which is interesting and dangerous)",
            "I don't mind someone saying they don't see the appeal, don't get what's supposed to be so good about her. What I don't like is when someone comments and makes it clear they are talking out of ignorance and are unfamiliar with her. Had someone criticize her for doing the same thing her whole career and playing it safe. You say that, you are advertising you are commenting on a thing you know nothing about",
            "Because Matty smokes, he has done covers of The Starting Line (one of his favourite bands) he's got a history of dating younger girls, there is a Black Dog bar (she calls it a bar in the song, not a pub) in Cork, Ireland, right by the venue & The 1975 played at, which is frequented by famous people (incl Mattys father) & some super sleuths have matched the cloths she was wearing when recording the song to the same outfit she was photographed wearing on 22nd June, so was after the breakup.. None of of it fits Joe",
            "The parasocial aspect is literally what she built her career on. It’s not surprising that this has continued on her tour too",
            "No that’s really true. For clarity, I don’t have any issues with people that liked them as a couple, it’s the obsessive ‘she’s not over him’ ‘everything is linked to him’ from a vocal minority that gets a bit much.",
            "“If they loved each other they’d keep it private, and now that they have, let me tell you how they’re breaking up, otherwise they’d be public with their affection that’s all staged. In conclusion, Taylor actually misses Joe or Matty and this is all actually a cry for help.”",
            "‘They kissed, it’s PR!!!!!’ ‘They didn’t kiss, it’s PR!!!!!’\n\n🤡",
            "I mean I’ve never thought they would be done without London tour dates. I’ve always maintained July training camp end or engagement",
            "I'm so excited to go lurk around the other sub later haha",
            "Deep sigh…..especially since her dad is there 😭",
            "I was hoping someone would say no because of the layout of wembly or something 😭",
            "I am definitely anticipating staged outings, especially if multiple chief players are coming, like Mahomes, and especially if Kelleigh is coming.",
            "I agree with this and it almost feels like she was fucking with Joe by singing this after his interview earlier this week??",
            "Lol my sentiments exactly",
            "Just because someone more mean on Reddit will eventually tell you: *pique*\n\n\nSaid with love!!!",
            "😂😂😂\n\nI’m almost finished but also 30 weeks pregnant so I don’t have the energy to summarize for you. I am so sorry 😅😅",
            "I hope someone does too! I can’t watch where I am.",
            "I think in this case they are both operating like corporations tbf",
            "Same, I don't give a shit, labels shouldn't own artist's IP. It might be legal, it might be an industry standard, it might be very profitable for them, but so was sending children to work in coal mines and we got over that as a society.",
            "I can’t stand the entertainment related docs that are just a rehash of what anybody who cared to know already knows, and doesnt include the actual parties involved.",
            "No they have one episode of Taylor’s perspective and one episode from Scooter’s - I don’t think it’s biased, but there’s evidence that “Taylor didn’t know” and “Taylor didn’t have an opportunity to buy her masters” are false, which makes it pretty obvious she was manipulating the facts to get her fans on her side. \n\nPlus the fact that her fans were threatening to kill Scooter’s kids and he asked her to stop them and she didn’t, is pretty gross",
            "Just because it shows both sides and scooter looks better in the end doesn’t mean it’s biased towards him. It means the facts show Taylor manipulated the situation. It’s just the truth, not bias",
            "Thankyou!",
            "Thankyou!",
            "Also, he basically has a month left before he has to report to training camp, when he schedule will start to get crazy, so why wouldn’t he go to the London shows considering he has been in mandatory OTA and minicamps a lot of the last two months until just this week, so their time together is limited and has been limited. He probably wanted to be able to go to as many European dates as he can while he can.  He has already said he is planning on going to Milan.\n\nIt seems like kind of a stretch to assume it’s a conspiracy against the doc for a guy with limited time to see his gf over the next few months to go see his gf perform and tack a family vacation on to it for good measure.",
            "Probably electric, since that’s his favorite word 😂",
            "This is the funniest thing I’ve read all day. We’ve gone from “she gave Joe pity credit because they were dating, he has no musical talent whatsoever” to “Joe was behind those albums this whole time”??? 😂😂😂",
            "What does SMM stand for?",
            "that sub is ALWAYS pulling up videos from Taylor's teenage years and using it to prove she's a bad person. these (presumably grown) people are judging the actions of a then- 15-year-old. also i saw a comment today under a video of teenage Taylor where someone said she was the ugliest person in her friend group \"even then.\"",
            "But not a goddamn thing is what she already does most times 🤣 *whines*",
            "i misread Travis for Taylor and was like \"ok hm i think she is\"",
            "You forgot the part of the fandom that thinks she’s coming out this weekend!! How one woman inspires so many fervent takes on her personal life I’ll never understand. 😂",
            "You forgot the people salivating for Rep TV. If people think she’s making an announcement, they’ll for sure be clowning about that…for like the twelfth time in less than a year.",
            "Gotta say that the addition of Safe & Sound was perfect.",
            "Thanks",
            "Yes! Agreed!",
            "I doubt it, it isn't that revealing...",
            "People will pick apart everything. She should have peace in her personal life so I don’t blame her. I sometimes think of her as TS the brand and then TS the human, we don’t see the human often. Even the pap walks ect are not the human, but the brand giving us what we can think is the human, if that makes sense. The BTS of music videos, clips her friends are approved to post ect give little glimpses of human.",
            "Haha thanks! Hopefully I never am in the situation I need to use one but it is definitely good to know",
            "I howled at the whole video, it’s peak ‘drunk after a night out having to try and be a grown up’ and I’ve never related more.",
            "Is it bad I cackled at that for a brief second?  My brain immediately went to Looney Tunes.",
            "I have three cats and prefer my house not to burn down. Unattended candles - not a thing. (But I also don’t have a song that just came out about fires turning into ashes).",
            "Idk why the recording date is debated so much, it doesn’t really tell us when she actually wrote the song, right? Because June 22 wasn’t six weeks after the Matty breakup anyway",
            "Jason Kelce could perform Christmas Tree Farm shirtless and it would still be ‘Matty-coded’ 💀",
            "Screeeeaaaaatch 🥅",
            "No but this is all the snark subs in a nutshell",
            "Lmfao",
            "And to think, we must only be a few months away from the one year anniversary of our very first “it’s PR, they’ll be over in a few weeks!!” 🥺",
            "There’s no indication that multiple chiefs players are going lol, just a bunch of stalkers tracking people. The mahomes always take a vacation in Europe and a lot of sports players were in Cannes for that festival.",
            "I appreciate you!!! 🫶🫶",
            "Oh no. I just said it as a general thing. I know someone in the fandom is gonna do it. I hope you get some nice rest and good food. Have fun! :)",
            "They didn't own her the songs, which is why she is able to re-record them, they do own the original recordings of the songs & that's part of the contract she signed with them, so they were never really 'stolen' .. Taylor still gets royalties from those recordings 🤷",
            "That is such a big chunk of them, and you don’t know which one you may or may not get upfront.",
            "I find HBO seems to be really bad at these types of documentaries. I was super excited for the Bama Rush documentary that they did, and the trailer was nothing like the actual film. It wasn’t great.",
            "Did Taylor say she didn't know though? And she didn't have a real opportunity to buy them if I'm not wrong. She was offered the chance to \"earn\" her albums back one by one if she signed on and produced new albums. \n\nThe death threats were gross - but correct me if I'm wrong, when Scooter appeared on that Facetime with Justin right after the Famous video - Taylor had also received a plethora of death threats including her friends who supported her like Selena and Abigail. Why would he expect grace for his family that he never extended towards her? \n\nMaybe I'm biased but I've never liked Scooter lol He's always felt scummy from the start. I remember when Ariana left him - he told her team she would be back and when she did come back, he rubbed it in her face.",
            "I assumed that the documentary wouldn't be making a case about who was in the right because all the sources I read reported that it would be unbiased",
            "That’s a safe bet lol",
            "SaintMeghanMarkle",
            "They are also saying that her and Gracie rushed out and recorded their collab to try and ‘ruin’ Charli and Lorde’s, despite the fact it’s just come out on Gracie’s album that was announced months ago and there’s video footage of them recording it ages ago 😅.",
            "Oh I know, that’s what would make it hilarious 😂",
            "I almost forgot about them, the way they’ve been out crazied as of recent",
            "I wonder if the whole obsession with Taylor’s personal life will stop if she ever gets married and has kids. It’s crazy how there are so many sub fandoms within the TS fandom. \nKarlie is married with kids and you just have to read through her ig comments to see how delusional people are",
            "Kinda wanna see the meltdown of what might happen if she comes out as bi/pan, but also announces an engagement to Kelce. But I also kinda wouldn't, because I imagine the discourse would get mighty biphobic.",
            "But why do they expect it this weekend specifically? Just because it’s Pride Month?",
            "Thank you! In my mind, it would be the lead single for the album! I almost forgot it was Woodvale coded until I saw someone else (I think on this subreddit??? It's might've been a YouTube comment I'm not sure) point it out! ",
            "So what makes you think it isn't Matty?",
            "Maybe that’s what the surprise song is today 😂\n\nI actually love that Jason and Kylie made the trip. Maybe this will silence the “Kylie doesn’t like her because she’s such a normal person and Taylor is such an evil witch” narrative.",
            "Please 💀",
            "I personally always spend Christmas in a Midwest city for my PR boyfriend.",
            "kinda crazy everyone just projects onto this relationship…and thinks the world revolves around The Eras Tour lol",
            "Maybe I need to reiterate because it's not getting through: I don't give a fuck what bunch of guys in suits who never made a single note of music put  in the contract. They shouldn't own the recordings of her or any other atists' performance, it should belong to people actually making the music. Oh, and rights to intellectual property shouldn't be traded like a commodity. I will always support an artist over industry parasites like Scott Borchetta or Scooter Braun.",
            "We turned on the Depp/Heard one on Netflix because we didn’t know it was basically just footage compiled for easy viewing 😒",
            "She said in an interview that she found out about the sale with the rest of the world when the news broke. Maybe she meant she found out that it actually happened at that time or whatever, but to me it seems like she was trying to say she had no idea this was happening, which really isn’t the case. \n\nI don’t know the details of the deals they were trying to negotiate. Maybe they weren’t real legitimate offers, but it seems like she had other opportunities to buy them for the right price. \n\nOn the death threats - I mean I agree that no one should be making or encouraging others to make threats. But it goes like way beyond okay to target someone’s kids. Seems like an opportunity to be the bigger person, but maybe I’m expecting too much. \n\nAnd I also agree Scooter seems scummy and def not like a great person. But at the end of the day, he made a business deal that he was legally allowed to make.\n\nI think Taylor just used the whole situation to make herself more successful, so they both benefitted",
            "This comment we’re replying to doesn’t state that it’s biased towards scooter. It says it makes certain things clear. That’s still being unbiased even if those facts paint Taylor in a bad light.",
            "... what the hell",
            "Karlie ig comments are...something else. That woman can't post a pictures with her husband without someone commenting \"Taylor miss u!!\" \"She still at the Restaurant!!!\" \"Take her to the lakes!!!\"",
            "She will coming out as bi, announces she's marrying Travis but also having joe's Babies and adopting a kid with Ratty and his fiance\nEdit: oh! And she will announce another variant too",
            "I actually think it is about Matty, just saying that people could reasonably take it to be about Joe",
            "What a lovely idea, it’ll never happen but nevermind 😆 now it’ll be ‘I took a picture of Kylie not looking happy for 1 second and this proves that she hates her but it’s also PR and she’s still in love with Matty/Joe/Ethel Kennedy but also a lesbian’. \n\nI think it’s nice they took the trip too. Jason for the 22 hat!",
            "If you willingly sign a legal contract that states who has ownership of the recordings, it's a bit rich to then claim they were 'stolen' they weren't stolen at all.. Taylor's own father made millions out of the sale so to also claim you had no idea the sale had happened until the public knew has to be taken with a grain of salt.. If she didn't like the terms of her contract, she should never have signed it.",
            "I absolutely agree that I think Taylor benefited from the situation. The eras tour and the re-recordings are basically feeding each other at this point. \n\nBut there was no way she could have known that in 2019.  And when Taylor spoke out, she even had some exec from Big Machine telling her on Twitter that her \"shine\" was off - basically that she was on the decline. Taylor herself thought Lover was it and that's that. \n\nI mean Scooter got backlash on Twitter but it was nothing compared to 2016 snakegate so I guess she could have been the bigger person, but then again I can see why she chose not to. I remember when the sale happened, Scooter's friends congratulated him for \"buying\" Taylor swift.\n\nI do agree that it's possible that she was playing with language tho! What I took at the time was that she knew it was going to be sold, she didn't know it would be sold to Scooter.",
            "k I didn't know Taylor manipulating the information was an objective fact though",
            "They are not serious people.",
            "She should limit her comments to just mutual follows because those are the only comments that are normal as you can see with her mutual KK 😂 This is under her husbands bday post\n\nhttps://preview.redd.it/fuddjq2vfz7d1.jpeg?width=1179&format=pjpg&auto=webp&s=a80b8d439f2e6783ece29450c38c86441f9ad09a",
            "Bruhhhh 🤦🏻‍♂️",
            "Not Kim Kardashian being the only normal human in this screenshot 🤣🤣🤣",
            "why are you being rude? I didn't know Taylor manipulating the facts was actually proven until now-- the way I was told, it was something Scooter alluded to during the master's dispute but nothing ever came out of it"
        ]
    },
    "Megathread: The Eras Tour in London": {
        "title": "Megathread: The Eras Tour in London",
        "score": 20,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dl4qge/megathread_the_eras_tour_in_london/",
        "content": "The Eras Tour has officially arrived in London, England and will be there from June 21st through June 23rd.\n\nPlease use this megathread for all discussion about Taylor’s stop in London.\n\nTo reduce repetitive posts, we will be removing most other posts about the London concerts through the 23rd.",
        "num_comments": 120,
        "comments": [
            "For the amount of times she chooses to play Maroon (or YOYOK) they should've just been in the setlist...",
            "Nicola Coughlan is there and that’s the only person I care about.",
            "London you won so bad with those surprise songs 😭😭",
            "It's London tour! what do you think the surprise songs?\n\nhere's my guesses:\n\nlondon boy x how did it end   \nthe last kiss x hoax   \nall of the girls you love before x false god   \nhappiness x it's time to go   \nso long, london x closure\n\nthere are rumors that travis will going to watch.",
            "Surprise Song Guitar: Hits different x Death By A Thousand Cuts\nPiano: the black dog x come back, be here x MAROON\n\nYALL I can’t breath 😭",
            "Maroon has to be her favorite song ever written at this point, and with good reason",
            "Apparently the royal family is there.",
            "Prepared to lose The Black Dog and So Long London this weekend. I'm very curious about what song mashups she'll do! I want So Long London/ It's Time To Go",
            "I have this feeling that she will mashup so long london with tolerate it. Idk why but I feel she’ll play tolerate it there since she removed it from the setlist. I am not ready. \n\nAlso, I don’t think she’ll make a big announcement except for maybe a music video. She just released the behind the scenes for Fortnight. It seems to me she is closing it up with that. We’ll see 🍿",
            "Damn it I missed Hits Different😭",
            "i might be completely wrong and then y’all can laugh at me but i think she’ll play london boy. i know a lot of people think she won’t play it since it’s so obvious a joe song and she can’t change the meaning in any way but she loves playing songs that have something to do with the city/date. like welcome to new york in new york or paris in paris or high infidelity on april 29th… so i think she’ll play it, maybe in a mashup with so long london",
            "As a lover of all the bubblegum pop songs on Lover, I’m ecstatic she might play London Boy",
            "I feel like Ross Travis being confused for actual Travis at Eras shows has become something of a fandom tradition now 🤣",
            "Acoustic set\n\nGuitar Hits different x Death by a thousand cuts\n\nPiano The black dog x Come back be here x Maroon\n\nOkay she's trolling lol",
            "Wow so maroon and black dog together… why was my Saturday surprise combo played tonight. I was convinced and my friend who was going was going to record it for me that was how convinced it would be on Saturday. ",
            "Florence Welch joining her for Florida! would be iconic, but that's probably because that's the only song I like from TTPD.",
            "Unpopular opinion, the only part of the black dog that I actually like is the bridge and the \"old habits die screaming\" part, other than that, sonically speaking,  I don't like this song, I especially dislike the chorus, for some reason it sounds like a parody",
            "Okay. London won.",
            "I do mastermind with the swiftie who got me into this mess and my score is… 0",
            "Woow a triple mashup so far on piano??",
            "Piano #2: Come Back Be Here mashed with Maroon",
            "Can she please do a mash up of London boy & so long London!! \n\n“You know I love a London boy.. So (so) long (long) boy.. darling I fancy you… I saw in my mind..” \n\nI’m not a musician so who knows if that makes sense lol",
            "I’m sorry, but Jason happily collecting bracelets is cute af.",
            "*Joe is in NY promoting*\n\n\nTaylor:  \n\n\n\"I guess you're in New York today\nI don't want to need you this way\nCome back, be here\"\n\n\n*also sings the black dog, maroon, hits different and dbatc as if it wasn't already obvious*",
            "Does anyone else find the camping overnight odd?\n\nI saw some people camped out on the streets of Wembley, of all places",
            "I wonder if any of the royals will show up. Shake It Off was played during the changing of the guards at Buckingham Palace and the Royal Family IG account posted a video.",
            "I'm going on Sunday and cannot waaaait\n\nFeeling like Better Man will show up as a surprise song at some point......",
            "My condolences to all the concert goers who have to use up a surprise song on London Boy",
            "I am so pleased London is pulling out all the stops to welcome Swifties. Sadly I am out of town this weekend so I won't be able to spot you in the wild.",
            "I can't wait for the surprise song discourse this weekend",
            "The way London won. Taylor what did America do to you",
            "Im watching the live and there was talk about how many seats are empty but its still kind of early? But people are going to be pissed if they arent filled because of not being given code/access to get tickets and now this lol. But it's also a super big venue compared to many others shes toured in Europe (idk about the American venues). Like others had capacity of 40-50k iirc and this is 90k and the second biggest arena in Europe",
            "ITS THE BLACK DOG",
            "I’m going to punt on Gold Rush featuring somewhere in the surprise songs as Jason is there and it has the Eagles line in it. Beyond that, I have no idea.",
            "What time is she supposed to go on today? London is five hours ahead of east coast right?",
            "The Black Dog on piano, so far...",
            "Surprise Song Guitar: Hits Different + Death By A Thousand Cuts",
            "Piano Surprise Song: The Black Dog",
            "Does Taylor herself start at 17:25? I wanted to stream it  from Aus, but it would be about 2 in the morning.",
            "YOYOK too -I think she wanted to include them but they dont fit with the rest of the Midnights set which is glitzy and more upbeat - even the slightly sad songs are 'dancing while I'm sad' ones",
            "I have loved her since I saw her on the best show ever- Derry Girls !",
            "Same. I love her!",
            "and it’s just the FIRST DAY😭😭",
            "So long London will definitely happen but probably at the very last London show.",
            "Jason , Kylie ,Ross Travis, and Aric I think are all there . Trav came in last as he was speaking to her security and then shook hands with Scott",
            "End Game",
            "London Boy x Death by a thousand cuts /Holy Ground\n\n(Those two are the only uptempo ones I can think of to mash up that also conveys a story is over. Cos London Boy is a bop and I'm struggling to see how it would turn into a sad ballad)\n\nFlorida with Florence Welch (I'm burying my hopes for this music video after this weekend)\n\nEndgame or Come back be here - these two due to the London references\n\nWe were happy x Happiness or Hoax (I'm sure we will get an unplayed Folklore/ Evermore song in London at some point)",
            "I’d assume that on her next run of London shows we’ll get Come Back, Be Here, especially if she and Travis are still together and he’s in practice and can’t travel. I’d say it’s a possibility for this weekend but I think she just did it a few weeks ago",
            "IT'S SOOOOOOOOOOOOOOOOOOOO GREAT!",
            "They are. I saw Jason and Kylie.",
            "Which ones??",
            "London Boy/So Long London would be so funny",
            "I think she’s going to save so long, London for the last show",
            "I mean almost all of rep and lover is about Joe...and she also plays other songs that are obviously about Joe (e.g. cornelia street)\n\nI think she will sing whatever she feels like, regardless of whether it is a Joe song... she'll play it at least in a mash up.",
            "Yeah I think she's def playing it lol I don't think she can resist. ",
            "Why do people think she wont play a song which has a city in the title that she can actually only play in that city ?\n\nAlso London Boy must be so much easier to perform than So Long London as its a bop -and if she mashes up she will likely skip the most personal verses; but having seen her do Sweet Nothing and peace and how did it end, I think this one will be a cakewalk compared to those.",
            "I think she’ll play it too at least once while she’s in London. I feel like she might save it until Travis isn’t there though lol",
            "It 100% got me not 15 seconds ago on Twitter.",
            "Honestly same, I find it really boring except the old habits die screaming bit. But then again I love London Boy so what do I know ha.",
            "It was infuriating to see live because she performed it so well and it has so much potential to be a great song if only she’d edit herself into writing better verses ",
            "Same!!! I hate the opening line too and the way it’s sung",
            "How did you not get points for the Rep outfit? Lol",
            "& The Black Dog!",
            "I wonder what bop would go with London Boy . \n\n\nI still think she'd play London Boy x something on guitar and then So Long London x something on piano on Day 3.",
            "The way he showed his arm to Kylie like, Look how many I haveeeee. Too cute.",
            "this is insane😳 woaahhhhhhh",
            "Lol, this is going to be an eventful couple of days.",
            "This is exactly what I thought while she was singing those songs!!! Like what is she up to??",
            "It was really common for Harry Styles shows last year, even at stadiums. It’s big for smaller venues obviously too. I think it’s grim and pretty dangerous tho.",
            "She had to ask for help in different GA sections over ten times last night - I think she did a good job of managing it but there’s only so much you can do if people are not looking after themselves. Saw way too many people posting about camping from the night before, not sleeping, and not drinking not to lose barricade spots",
            "The Kansas City Royals have games all this weekend, and quite literally have *no* affiliation with Taylor Swift.",
            "I’m going on Sunday too! I saw someone saying a Better Man/ Black Dog mash up would go well.",
            "ohhh, that's a good song choice.",
            "London Boy is fun, y’all hate fun sometimes istg",
            "I for one cannot wait to hear the audible disappointment of many others around me while I bop away.\n\nAnd then she pulls out a TTPD song and the smile fades from my face.",
            "It’s resale tickets being priced too high, the issue is professional scalpers get so many that they can afford to not sell all their inventory, their markup is so high that if they 60+% of what they have they’ve made a huge profit and they’d rather wait and see if someone desperate to go will buy last minute than drop to a more reasonable price, unfortunately that means some tickets will go unsold despite there being tons of demand. Everyone wins except actual fans.",
            "It was full by the time she finished the Lover set. Over 88k people.",
            "It’s a possibility but didn’t she do gold rush relatively recent? Obviously she repeats as much as she wants but I feel like she did it mashed up recently. I also think that Never Grow Up may be a good contender. Kylie Kelce used that one for a TikTok once and I think she said she loved that song. Maybe she’ll sing that since she’s there.",
            "Haha so wrong 🤪",
            "2-2:30! i’m pretty sure it’s gonna be 2-2:30 until she comes back to north america",
            "was not expecting it",
            "mashed with death by a thousand cuts",
            "Based on other Europe timings she goes on at 7 or 8pm local time.",
            "Tessdear on instagram creates timetables so you can look up the beginning times in your own timezone!",
            "I love derry girls! I was in high school in the 1990s (not in Northern Ireland) and that show perfectly encapsulates being a teen girl back then.",
            "Umm no. I read Prince William and his kids",
            "William and kids",
            "I’m trying to find the best place for a transition between the two bc it would be so funnt \n\nI’m thinking like: You know I love a London Boy / You swore that you loved me, but where were the clues?  \n\nBut I would love something with: You know I love high tea, stories from Uni, and the West End (any of the verses that name places in London) -> tied into And I’m just mad as hell ‘cause I loved this place\n\n(I’ve put way too much thought into it)",
            "I'd giggle at the cheer chaos of it all.",
            "I think so too!",
            "I think at this point she recognizes that the songs are more than just “lore” for herself now because of fan interpretations and love for them. At least I’d hope so",
            "i think people mean that with the other songs she could sing them as if they’re about travis or something, but she obviously can’t do that with a song like london boy. but yeah, i don’t think that’s gonna stop her from playing it",
            "Not the ‘two hims’ striking again 😭",
            "I love London Boy and The Black Dog so Idk what that says about me lol",
            "Emotionally I don’t count the rep outfit. ",
            "and the fact that she was singing for joe while travis was there 😅😅😅😅",
            "Doesn't happen at venues where they have assigned seating in the GA section. Another reason it's a better/safer option.",
            "Is this sarcasm lol",
            "Pretty sure they mean the royal family of the UK!",
            "Girl",
            "Ahhh so exciting! It's gonna be warm, make sure you stay hydrated!!",
            "Stay stay stay is one of my favourites, so I sympathize with hating fun haters but I just can’t with London Boy I’m sorry lol",
            "She did Gold Rush with This is What You Came For recently",
            "I can’t keep up, maybe? Maybe it’s too obvious with the Eagles line. I did think Never Grow Up for the same reasons. Watch her do neither now 😆",
            "Glad to meet a fellow fan ! Wish more people would watch this show. But then again I could relate more to it because of the girls school run by Catholic nuns in the 90s stuff .",
            "I was joking 😩 (I mean, about them being the royals)",
            "Maybe she'll change the lyrics to past tense. That would be epic",
            "London Boy is fun, yeah it’s cheesy but I think it’s a good song lol",
            "💀💀💀 really insane n1 of London hahaha",
            "Lmao at the fact that this clarification was even needed",
            "Hahaha yes I meant the British Royal Family of course. A big Swiftie account just posted that Prince William and his kids will be there - dunno how true though!",
            "I just looked and jeez, I’m not sure I’ll need my tights and big jacket 😆.",
            "Nooo it’s fine, I just love it cuz it takes the piss lmaoo",
            "People don’t like Stay Stay Stay??"
        ]
    },
    "Taylor posted a selfie with Travis, Prince William and his kids on her social media accounts": {
        "title": "Taylor posted a selfie with Travis, Prince William and his kids on her social media accounts",
        "score": 85,
        "url": "https://i.redd.it/urslusoyc48d1.jpeg",
        "content": "It's the first photo with Travis she posts and the first time she posts a photo with a boyfriend on Instagram since 2016 (Calvin was the last one).",
        "num_comments": 81,
        "comments": [
            "The randomness of this whole scenario is sending me into fits 😂",
            "Those kids look exactly like william",
            "Many, many layers to this, but all I’ll say is that this is quite possibly the funniest/shocking way she could have opened up the eras tour in London.",
            "Travis wearing a Team USA hat is truly sending me",
            "The picture posted by the royals’ account is one without Travis though 🙃",
            "Going Instagram Official by posting a picture w the future King of England at your stadium tour is something only Taylor Swift could/would do",
            "I think this is cute? William and Taylor have met previously before and even sung together? And his kids are at the age where they would likely be new Taylor swift fans. I bet a lot of their classmates would have wanted to go!\n\nAlso, seems like their cousins are also there!",
            "“Talk about a hard launch” has me confused because we know she’s been in a relationship with Travis?",
            "https://preview.redd.it/rhfntfrlg48d1.jpeg?width=1170&format=pjpg&auto=webp&s=fe6392fbd5d053fc2dbb2f1912b4083447e9a788\n\nI didn’t make this but I saw it yesterday and this pic makes it 100 times funnier.",
            "Has Taylor had work done recently?",
            "Taylor’s impossibly white and tightly aligned veneers look so unnatural, can’t focus on anything in this photo. Good for them i guess.",
            "Well that’s a choice lol.",
            "Her face is so unnaturally smooth it’s distracting",
            "I feel like she’s going to regret attaching Travis to her brand in this way if/when they break up",
            "Sorry her teeth look super fake and distracting 🙈",
            "It would have been so much cuter without both men",
            "Charlotte is just William as a girl. She looks so happy here.",
            "The way I got the ick. Not at the kids, or Travis, or Taylor but Prince William sucks. I'm sure the British press will use this photo to further terrorize and harass Meghan Markle.",
            "Idk I think it’s cute. Sure, they might be Royal but their mom has cancer, their grandpa has cancer and that’s gonna be tough. I hope they all had fun.",
            "No but fuck the British monarchy. She never posts selfies—I guess it’s the least surprising thing that she’d find the royal family exciting but…ick.",
            "Taylor Swift and some fans.",
            "Travis instagram debut",
            "lol. It looked like she decided to sneak Travis in the pic knowing William would be the main draw .",
            "I love this for those kiddos 🫶🏻",
            "Someone asked \"why is Travis in the picture\" and the response was \"the kids probably wanted him in it\"\n\nSwifties get *big* mad when you say it's more likely the kids have no idea who he is outside of Taylor because American football means nothing to British children\n\nApparently that *fact* is \"ugly\", \"evil\", \"trying to diminish Travis\" etc etc. But it's just *true*. People who follow American football over here (and I am one of them) need to stay up until the stupid hours of the morning to follow it, no one under 14 is doing that and very few - even over 14 - even want to.",
            "Nice to see a photo of Taylor with a guy whose entire existence seems to be based around shamelessly chasing clout and demanding the public’s attention despite the public’s rapid declining interest in him and loss of patience with this “I am famous because I am famous” mindset. \n\nAnd the royals are there too.",
            "The selfie pic the Royals posted was cute!",
            "I’m just here to see how this is actually a PR stunt, proves she doesn’t care about the guy, they’re over, or this is a silent plea for Joe.",
            "I'm very confused about when did this happen? It's not before the concert (she's wearing a jacket) but not after either (not the midnights one), can anyone enlighten me please?",
            "lol sad for them",
            "He’s so unserious 😆.",
            "I can’t help but stan.",
            "I won't rest until we get Jason in a selfie with the royals",
            "Travis isn’t really relevant (I mean that kindly) to them. Taylor has obviously taken a personal pic too with him there.",
            "*2 future kings. Travis in his USA hat is hilarious.",
            "Dead. So bloody true!",
            "I think it’s very sweet given how stressful and worrying things must be at home w their mom’s cancer.\n\nAlso, Charlotte in a sparkly Fearless-themed dress is very on point for a 9 yo",
            "People have completely run \"hard lunch\" into the ground and now it's meaningless. You can't have a hard lunch when there's already multiple photos/videos of you and your boyfriends holding hands, kissing, going on dates, going on vacation, celebrating the holidays, being with each other's parents and more",
            "I think it’s a hard launch of the tour in London not of her dating a Travis",
            "I think it means on her social media platforms (aside from the TikTok or her YouTube shorts) this is the first time she’s posted her personal life in this way for years.",
            "I thought the same. The filler is fillering.",
            "She had her veneers changed",
            "The answer is always yes but her teeth are looking especially large lately.",
            "I'm used to it because the ones she had before were much worse lol",
            "she seems so airbrushed, it's uncanny",
            "You mean like every other ex-boyfriend she's posed with pics with? I don't see how it's any different than singing about an ex every concert that she broke up with 15 years ago?",
            "That already happened when she mentioned him in her Times interview. At least an Instagram post she can always delete if they break up, although if it were me and I wanted to make it Instagram official with my boyfriend I'd use a photo only of the two us as the first one and certainly not a photo with the future king of the UK. \n\nIt'll feel quite disrespectful if she ends up deleting the photo and if she doesn't she'll be forced to keep an ex on her Instagram feed (which I'm guessing it's not something she'd feel comfortable with considering that she even deleted the reel in which she was talking about the meaning behind lavender haze just because she had vaguely mentioned Joe).",
            "Nah she’ll just write a song or album about it. She used to do the same stuff or at least similar stuff with Calvin and look at how that ended. She constantly posted Calvin on her IG. I don’t necessarily think she’ll regret Travis being in a picture with her and the Royals. And based off the pic The Royals posted, there’s some pics of them without Travis. Not entirely a big deal. I think her mentioning him in her POTY article when she was only dating him 3 months will be more of a regret if they ever do break up,",
            "Hahahaha, no.",
            "It’s probably because the kids were there more than anything. Also we don’t know that Meghan wanted a pic that public. Meghan gets shit for being alive, so it could be another excuse to send hate.",
            "The British media is so pathetic and embarrassing",
            "Bingo. She attended the Eras tour in LA and didn’t get a selfie as far as we know. 100% this will be spun into another battle in the idiotic British media obsession with her. And I agree on Prince William.",
            "No one cares about Meagan. She doesn’t move the needle for celebrities to shun the future King of England.",
            "Taylor is friendly with him so this isn't surprising, they sang together about 10(?) years ago during 1989 era and she wrote \"Happy birthday mate\" on her caption (It was his birthday yesterday).",
            "[removed]",
            "And you said nothing hit the whole truth. Taylor lived in London during everything Meghan went through, taking a picture Prince William and posting it is just a choice.",
            "Yeah, they really deserve it with how little they have.",
            "It must be a depressing disaster of a day on certain subs.",
            "I think she put the jacket on to cover up the bodysuit because it’s a bit more appropriate for posing with royalty, particularly kids. Meeting royals and the optics are quite strict.\n\nETA- nothing wrong with the bodysuit at all, but royal stuff is quite old fashioned in attitudes.",
            "Before the show. She may have put it on out of respect or didn’t feel comfortable meeting them in just her bodysuit. Could also be a dress protocol thing?",
            "She probably put the jacket on to take the pics with them. Not saying her bodysuit is inappropriate by any means, but they’re Royals lol. It looks like before the show. Her hair and makeup look fresh and untouched.",
            "These pics seem to usually be after the midnights set but she probably put the jacket on to be more appropriate for the pic.",
            "Ah he looked just like his mother until he hit his early 20s\n\nMaybe his kids will do the opposite switch to the one he did",
            "💀 \nHe was good looking when he was younger at least",
            "Exactly! The kids had a rough start to the year and they look so happy getting to meet Taylor and I’m sure she was happy to perform for them also. \n\nAlso, of course they are going to be in a more private box. Security alone must be a nightmare if they were in the regular seats. This way it’s probably less bothersome for everyone else to enjoy themselves.",
            "Charlotte looked so adorable! Loved her braided hair and glitter dress 🥹",
            "The hard launch was when she showed up to that first football game. 😂",
            "Ah okay Ty!",
            "Plus probably the highest-tech stage makeup that exists. Just looks a bit creepily Photoshopped!",
            "I know about her veneers changing but her cheeks look unnaturally big in this picture",
            "When did she stop having her natural teeth?? All that money and this is the best they could come up with??",
            "It's definitely for the kids! Taylor's got a rep for being extremely kind to other people's children. A few months ago. Emily Blunt shared a cute [story](https://www.hollywoodreporter.com/lifestyle/lifestyle-news/emily-blunt-taylor-swift-daughter-haircut-1235888687/) about Taylor meeting her daughter and how Taylor gave her daughter a confidence boost.",
            "I wouldn't be surprised if they met behind the scenes! But it wasn't shared because Meghan literally cannot walk outside her home without facing an onslaught of misogynistic and racist articles (and these articles were done to protect William and Kate's musty asses).",
            "They're all salivating at the ways they can spin this photo. I wouldn't be surprised if eventually there's an article about how Meghan and Taylor met but Taylor thought she was a clout chaser.",
            "Yeah, the optics aren't great! She is also not the only celebrity who's met the royal family post Meghan leaving. Regardless that family (not the kids) sucks big time.\n\nThe way his family treated Meghan is abhorrent. I was a Suits fan since day one, so I always feel a little extra protective of Meghan because she was truly delightful to all of us fans.",
            "Ok yes, that makes total sense, I don't know why I didn't think of it. Thanks! So this is likely before the concert?",
            "Yes pretty sure there's something about cleavage and meeting the royals (or something like this), I didn't even think of it when i posted, thank you!",
            "Great points you're making, thank you!",
            "Exactly. People did the same with Sabrina and Barry, saying that the video was their hard lunch as if they havent already attended two red carpets together",
            "No worries, it’s not that clear!",
            "Yes I think so! I did the same double-take, but I remember years ago Princess Anne came to my aunts workplace and there was a faxed list of rules and etiquette for them to follow when she was there. I imagine either by her team or theirs she was advised to wear the jacket."
        ]
    },
    "DAE find it upsetting that Taylor has formed a close friendship with Gracie Abrams despite her openly talking about wanting to fuck a 14 year old when she was 18? ": {
        "title": "DAE find it upsetting that Taylor has formed a close friendship with Gracie Abrams despite her openly talking about wanting to fuck a 14 year old when she was 18? ",
        "score": 117,
        "url": "https://i.redd.it/fec0yy0cr18d1.jpeg",
        "content": "Given that Taylor has spoken about being a victim of sexual assault herself, it’s unfortunate to see her allign herself with someone who openly showcased her sexual desires a literal child when she was a grown adult. ",
        "num_comments": 161,
        "comments": [
            "![gif](giphy|31TsJOgYOvIWWYMEaR)",
            "Sadly Gracie wasn’t the only one saying this shit about Finn during the first couple seasons of Stranger Things. Both him and Millie were highly sexualized by adults. I like to give people the benefit of the doubt but this shit was…..idk. Calling him a cute kid or a handsome young man would be appropriate, but acknowledging his age and saying you’re “down for him” is disturbing.",
            "What?  Never heard of this.",
            "Wait what the fuck??? He looks about 9!!! Oh my god\n\nETA: I cannot stop thinking about this. That is a baby!!! Like what the actual fuck is wrong with her???",
            "She was attracted to a child on this series when babysitter of the decade, Steve Harrington/Joe Keery, was right there??\n\n![gif](giphy|l310xkkI0lnhOe3OOW)",
            "The person in the image looks 10, not even 14. Even as a joke that is really disgusting to say. Idk why people say things like this and pass it off as a joke when it's not really something you should joke about.",
            "If you actually went through every artists interactions/collabs, you will find that the artists who stand up against stuff like sexual abuse, harassment, especially of minors and women, have 100% of the times interacted with someone who's involved in such stuff. Its gross. Artists don't actually care about these things. They speak a normal line and gain followers. The most recent example, apart from Taylor ofc, is Kendrick. He literally called out Drake for being a creep and pedo, also abandoning his kids. But just few days ago, Dr Dre opened up his concert. Dr. Dre has been accused by multiple women for abusing and beating them up. That was maybe decades ago, but still, the fact he never apologised properly proves he never improved as a person. How can Kendrick call out Drake, when he literally collabed with Kodak Black? A guy who was arrested for sexual assault, and battery to a TEEN GIRL? \n\n\nThis is just the few popular examples. The real losers in this whole fight are victims themselves. These people just support them in fake manner to increase followers and use them as weapons to bring other artists down. No one actually cares about them. Its really hard to find an artist who hasn't collabed with someone that does not have a past related to gross things like these, makes me wonder if the artists themselves choose voluntarily to collab with people like them or the industry is so corrupted that you just can't enter and NOT meet people like these, they are everywhere.",
            "He LOOKS like a child so not sure how she’s “incredibly down” ……. very yuck",
            "EL COME GET YOUR MAN\n\nI got really confused I thought this was the stranger things reddit before reading everything fully 💀",
            "i mean WHAT!? ",
            "I literally remember when this was a problem, and sadly it wasn’t even just her. Finn (the actor) talked about how disgusted he was during this whole situation. There would have for sure been more of an outrage if it was the opposite gender",
            "[deleted]",
            "Well, Taylor did date Connor Kennedy when he was a minor and she was an adult, so... birds of a feather and that.",
            "She has some really weird friends... \n\n![gif](giphy|3ohhwqB1XtvYJ8jwUE|downsized)",
            "![gif](giphy|l41Ye7i203TfEADYs)\n\nForgot about this",
            "Reading so many comments be nonchalant about the post made by Gracie terrifies me.",
            "Taylor’s also friends with Zoe Kravitz who made similar comments about an underage Jaden Smith. She clearly doesn’t see this as a dealbreaker when it comes to public association, just like hanging out with sexual assault apologists and racist misogynists",
            "same with lena dunham👀😭",
            "My eyes became dinner plates! This is fucking alarming and so deeply inappropriate. The commenters trying to brush this away, also alarming.",
            "Judging by Taylor’s history with Connor Kennedy I’m gonna say this is probably pretty far down on things she cares about",
            "I mean she did go public with Conor Kennedy on his 18th birthday... but this is a major yikes. I'd argue he looks even younger than 14",
            "I'm in high school and unfortunately my peers joke about these things all the time. it's super weird and icky. also: why the hell would Gracie post this on a public Instagram account? she knew people were gonna see it",
            "This is very gross, but also not unheard of. Think a senior in high school dating a freshman. It unfortunately happens. At least she wasn’t even older or him even younger. Date responsibly or it’s the “Olsen-Twin Countdown” all over again.",
            "I remember this happening. It was the first time I heard about her and ever since she gave me the ick. It sucks what Millie and Finn had to go through",
            "I think this is a vile joke, but Gracie Abrams saying this reminds me more of when my Tumblr friend who reads Ao3 a lot says something wild because she forgot she was out in real life with witnesses and not anonymous on the internet anymore lol \n\nBasically this is bad and I hope she apologized for this and also she should keep away from kids but I really think this is just a very cringe joke from someone who had a moment of insanity",
            "Wrong or right, why the fuck would she post it and publicly too? I don't get it, it's like that Machine Gun Kelly and asking outloud why teens are so attractive or something like that. Like if you have these kinds of thoughts, that's one thing but writing it outloud and for the public eye, REALLY???",
            "Gracie Abrams is very strange for that but how do we know Taylor is aware of this? Not like I’m a huge fan of hers but I’ve never heard of this so maybe Taylor hasn’t too?",
            "Whaaaaat???? This is so gross also posting this online like it’s okay??? He looks like a baby in this picture",
            "That's so gross Finn looks just like a kid here so weird to have those kind of intentions.",
            "lol I’m sorry but 18 year olds are still in high school. They can legally do stuff, sure, but they are not “grown adults” nor do they even have fully formed brains. And young people say weird shit. Let them grow without think pieces on everything.",
            "This is weird for sure, should've been an inside thought, but I'm not going to pretend there's anything insanely weird about an 18 year old being attracted to a 14 year old lol. They're both still high school age. Did you really not have any friends in high school dating people in the grades above? I'm not saying this isn't weird but I don't understand why Taylor or her team or anyone else is supposed to be up in arms about this. ",
            "It's a distasteful joke I'm assuming, I don't think Gracie is actually interested in 14 year old boys. The tone is not giving dead ass serious. Now obviously we don't know these people so I could be wrong and maybe she's a total creep and that is 100% serious, but I'm not going to assume the worst about people if there's another, more logical explanation available.",
            "Wow posting that on a very public platform about a 14 year old who looks like a 9 year old is certainly a choice. Thinking that at all is fucking wild. He’s not even 14 and looking 18 or something. Anyways who are we kidding Taylor does not give a shit who she aligns herself with in fact she’s probably only thinking about getting under Olivia Rodrigo’s skin.",
            "It’s just an 18 year old girl making an incredibly inappropriate and gross joke. 18 is basically a child too, and 18yos do stupid shit all the time. If you’re upset by this I think you need to take a deep breath.",
            "A teenager liking a teenager? Dear God, the horror!",
            "Wut",
            "Gracie is messy. She's a nepo baby. As someone who liked camila I have seen her shady behavior. She shaded camila alot. But moving forward she's a pedo. ",
            "Yeah I think about this all the time :(",
            "Can someone pls explain this to lil old me",
            "There is such a chasm between “teenager makes inappropriate comment about a peer on the internet” and “this is a pedophile”. Words have meaning and to brand Gracie as a full-on pedophile for a single yucky comment she made as a child herself is absurd.",
            "Pedo vibes 😬",
            "Why else would Taylor be besties with Lena Dunham?",
            "This is inexcusable imo. I remember being 18 and stupid, I’ve made a ton of dumb statements but checking out 14 year olds never crossed my mind, let alone shamelessly posting about it. \n\nIf she’s comfortable posting this then what are her inner thoughts that she doesn’t share with the world?\n\nAlso don’t want to derail but I do think TS is just cozying up to Gracie to get under Olivia’s skin just like she did with Sabrina and Paramore. Kinda obvious at this point.",
            "Why are female paedos so casual with it",
            "Taylor is also a pedophile so it tracks",
            "i knew many people who were saying things like this at the time… but i am HIS AGE. (edit: am actually 2 years younger lol) \n\n\nadults saying those things are GENUINELY DISTURBED INDIVIDUALS.",
            "\nEdit: she was 18",
            "He looks younger than his age, which makes the situation even worse. Sexualizing a minor leaves a bad enough taste in your mouth. Posting it on social media for people to see is just downright sociopathic tbh",
            "I’m a year older than Gracie and when I was 18 I had an argument with a girl from uni about this, bc she was saying the same thing as Gracie and I was like ew that’s genuinely disgusting, he’s a BABY",
            "Yeah it’s fucking gross. I don’t understand how female pedophilia gets overlooked.",
            "Women have done this for a long time and it’s so fucking gross. The twilight guys had to deal with this a lot. One of the stranger things kids (idk his name, the one with the curly hair and was on Broadway), a woman in her 40s said she had a crush on him since he was 14 and he was like that’s actually very weird and makes me uncomfortable. And good for him for calling that out it’s so wrong",
            "In fairness to Kendrick, he never said he was on a crusade to stand up for victims. He said that he hated Drake and specified it wasn't even necessarily deep. Then Drake tried to fight back and Kendrick decided all bets were off. He wasn't 'calling out' Drake, he was engaging in a proud tradition of diss tracks, and it just so happened the guy he was dissing has behaved very inappropriately with minors.",
            "I was ranting about Drake/Kendrick/Dr Dre to my partner today. Most people making the kind of money these folks are making don’t care about any issue unless they can use it as a pile of mud to sling. It’s fucking miserable to watch.",
            "Hit the nail on the head.",
            "He spoke about what Gracie said? What did he say? I can’t find anything on Google about it.",
            "Ummm unfortunately this is the same Taylor Swift that made her appearance in a David O’ Russel film (Amerdam) and this was after publically admitting to molesting his niece. \n\n“In addition to other alleged outbursts, Russell was accused of sexual misconduct off set by his 19-year-old niece, who told police that he felt her breasts in 2011. Russell, who confirmed the incident but stated to police that his niece had been acting ‘very provocative and seductive’ and had allowed him to touch her, did not face any charges.” ([x](https://www.washingtonpost.com/arts-entertainment/2022/10/07/david-o-russell-movie-allegations/)), ([x](https://www.vulture.com/2022/10/david-o-russell-abuse-assault-allegations-timeline.html)), ([x](https://www.femestella.com/amsterdam-director-david-o-russell-sexually-assaults-trans-niece-verbal-abuse-amy-adams-physical-assaults-george-clooney/))\n\nHonestly, this Gracie thing was widespread when it was happening. I think a lot of people are just now understanding that the woman who said these things at that time was THE Gracie Abrahams. \n\nHiring Gracie is indicative of a larger issue of Taylor Swift willingly going into relationships with people who have an unsavory past and overall, not really caring too much what the public thinks of some very specific decisions that’s she’s made in relationships. \n\nIt’s fascinating because for someone who seems to really care how the public perceives her, there are various issues where she clearly doesn’t.\n\nTLDR: Taylor Swift’s role in David O’ Russel’s film “Amsterdam” is arguably even worse than Gracie as the abuse actually transpired (but defending Gracie but your pouting to Taylor’s behavior here like it’s an anomaly. I truly wish that were the case.",
            "You don’t think celebs like Taylor swift has a team that looks at everyone they associate with and looks at their scandals and lets her know ? She and they probably figure it doesn’t matter bc it’s a female wanting a male child, unfortunately",
            "She also dated 18 year old Harry styles. He wasn’t a minor, but still.",
            "Ew wtf why is no one posting about that in this sub??",
            "If it was an 18 year old boy talking about how badly they wanted to fuck their 14 year old daughter I’m sure it would be different lol. Gracie is fucking sick.",
            "Unpopular opinion but I never subscribed to the notion that Lena is some dangerous grooming pedo. She made it pretty clear that she was a child herself, said she didn’t get any sexual thrill out of what she did with her sister, and child psychologists defended her saying the type of scenarios she described are actually very normal between siblings that are in a similar age range. I definitely think it was weird for her to talk about it in her book given that’s something I would take to the grave, but I always thought people were doing too much with that.",
            "Nah I’m Gracie’s age and Finn Wolfhard/ the stranger things’ kids seemed sooooo much younger than me during this time. There’s no way I could have looked at any of them and thought they were hot bc they seemed like babies/ little kids. Four years isn’t a big age gap for adults but the gap between 14 and 18 is huge.",
            "It’s a gross inappropriate comment but it’s a high school senior talking about a freshman. \n\nMuch different than a college age person talking about a high school freshman",
            "18 year olds post about being “down” to hook up with 14 year olds??? Like sure they don’t have fully formed brains but if they’re posting this, someone should say something.",
            "Thank you for this. I have no idea if TSwift would know about this, I have no idea if it's serious, but I do know an 18 year old is not a grown adult. An actual grown adult can recognize that. Legally an adult? Technically. But that's about it.",
            "I don’t know what a high school senior would see in an eighth grader. All the seniors who dated anyone below ninth grade were always shunned and looked down upon (rightfully so).",
            "All the seniors that dated eighth graders in my school were (rightfully) judged and looked down upon. It’s odd and creepy.",
            "I understand wanting to give her the benefit of the doubt, but let’s be real: if an 18-year-old boy posted a picture of a 13 year old child (that looks about 9) and talked about wanting to sleep with her (whether it was a joke or fully serious), it would be a different story.",
            "An 18 year old is a legal adult talking sexually about a 14 year old who looks 9. Speak for your fucking self because there’s no way I’m talking about a 14 year old like thar even at 18.",
            "If you don’t see anything wrong with an 18 year old wanting to fuck a 14 year old that says a lot about you ngl",
            "This is really creepy and inappropriate shit from Gracie but I wouldn’t immediately label her a pedo, that label gets thrown around way to easily on the internet these days.",
            "Camila is definitely a better person than Gracie imo. Camila might’ve retweeted some racist edgy shit when she was a middle schooler but at least she didn’t talk about wanting to *fuck* a middle schooler when she was a grown adult.",
            "18-year-old Gracie Abrams made an Instagram story talking about how she wanted to fuck a 14-year-old boy.",
            "She was an adult.",
            "What does Gracie have to do with Olivia?",
            "Olivia and Gracie are still friends. Olivia comments/likes Gracie's posts on Instagram.",
            "Taylor and Hayley Williams have been friends since 2010",
            "No she’s not lol",
            "she was 18. stranger things season 2 (where the scene is from) was released october 27 2017, her birthday is september 7 1999",
            "Toxic masculinity is why. “Doesn’t matter had sex” type of thinkong",
            "It really does and I don’t understand why either.",
            "I also remember Justin Bieber being absolutely lusted over by grown women, celebrity and not. It’s such a disturbing trend to see this go largely ignored.",
            "Gaten Matarazzo",
            "Sorry I don’t think it was the Abram’s one, but another celebrity this article \n\nhttps://www.independent.co.uk/arts-entertainment/tv/news/finn-wolfhard-stranger-things-model-comment-ali-michaels-instagram-season-2-cast-a8043291.html\n\nTalks about it and there are a few more about him being stalked by adults as a 13 year old as well. It’s a shame how many people lusted after him as a child.",
            "she dated matty healy.",
            "No prob not cause that sounds insane",
            "I don’t find Harry Styles weird in the same way the Kennedy kid is. Harry and Taylor were in the same field and dealing with very similar life situations. Harry, at the time, was arguably more famous, so the power dynamic was a bit different than most.\n\nThe Kennedy kid was weird tho",
            "Wasn't Taylor Lautner 17 too, and she was an adult at the time? Sensing a pattern.",
            "*Plenty* of people here talk about it.",
            "Lena Dunham has many other issues besides that that make her a bad person. Including when she defended her Girls writer who was accused of raping a 17 year old girl, claiming she had “insider knowledge” that made it in the “3% of false accusations” then she came out and said I actually didn’t have anything I’m sorry I made that up.",
            "I agree. Grace Dunham herself spoke out against people calling Lena a pedophile for that incident. Seven year olds are not predators. Whether or not Lena should have written about it, another story. But god damn she did not molest her sister.",
            "It shouldn't be unpopular. I think, for all the weird shit Lena Dunham is about. Speaking openly about something that is normally a deeply shameful secret was brave of her.  It was something she was certain to get lifelong shit about. \n\nPeople should know that if they did something similar as a small child, that it is not terribly unusual it shouldn't carry an adults shame and guilt. Sexual abuse requires an intent and comprehension that simply doesn't exist at that age. \n\nI just really really hope she got her sister's okay to publish that information. She is a gaping twat if she didn't.",
            "thank you\n\nit pisses me off because if you say anything in defence of it (not that i would defend the actions but ykwim) you are called an enabler or a sympathiser. \n\nlike no i’m not gonna pretend that a very very young child touching their younger sibling (while not good don’t get me wrong) is the same as an older sibling molesting their younger sibling. especially when i’ve seen psychologists and the like say it’s not the same",
            "That being said I don’t think Gracie should be cancelled or permanently labelled a predator for a dodgy instagram story (so I guess I agree with you on that), but it is still weird and imo it’s a slippery slope to say it’s okay for an 18 year old to find a 14 year old hot - not saying this is necessarily what you were saying, but it’s what could be taken from it.",
            "Isn’t the difference between a high school senior and a college freshman literally a few months between schooling (traditionally, not everyone enrolls at 18 Ofc)",
            "It’s disturbing and alarming an 18 year old wanting a relationship with a 14 year old.",
            "Jeez.. At 18 I was paying rent & living a 12 hour drive from my family, I was working full time, paying taxes, grocery shopping & cooking my own meals.. generally sorting out my own shit.. I was an adult in the eyes of the law & in my own eyes, I was certainly not a child. At 18 you can fight in wars, buy alcohol, get married, get a mortgage.. You are no longer a child.. Is it because she's a female that you don't find it off? Imagine the outcry if say, 18 year old Harry Styles (or any other 18 year old male) had publicly said the exact same thing about a 14 year old girl.. There would have ended his career 😕",
            "14 is usually 9th. 5 is Kindergarten, 6 is 1st, 6+8 = 14, 1st+8 = 9th. \n\nGracie had just turned 18, so this would've typically been a high school freshman and high school senior. Still weird to me, but not out of place in my district at least.",
            "Well idk how old you are but times have sure changed a lot since I was in school lol. I never dated an older guy but it was really common and not seen as weird at all.\n\nThe first high school I went to was 8th-12th grade and we were def mingling with the seniors. My friend and I used to hang out with two senior guys, my mom didn't like it because they had cars and she didn't trust me riding around unsupervised at that age but she didn't think the guys were creepy or anything.\n\nETA: I should clarify that I'm not trying to defend this weird ass tweet, I'm just not surprised Taylor doesn't care about if she knows. I'm pretty sure I've heard that she was being invited to senior prom as a freshman which is the same age gap we're talking about here. ",
            "In what other reality are you living in where men face serious consequences for sexualizing young girls?",
            "Why do people always try to flip the perspective and say 'if the tables were turned people would be outraged (or something down those lines)'. No they wouldn't be. It happens all the damn time. All the time. Have you ever noticed what type of attention underaged female tiktok stars get? In my country we have a royal family and the middle daughter of that family has gotten so much attention for her looks throughout the years. And she only just turned 18 this year.\n\n\nI have so much material on this because I have an entire 'men are evil folder' on my phone lol. ",
            "Oh please. No it wouldn't.\n\nThat scenario happens constantly and no one gives a crap about it. I'm so sick of this 'If the gender was reversed!' bs because the gender has been reversed for ages and no one bats an eye.\n\nJustin Bieber was 21 when he told his minor fans (13&14) that they shouldn't worry, because it was just four more years till they were 18 and no one said anything. There was no outrage or 'cancellation'.\n\nMGK was 19 and complaining, saying he wished \"13 yo girls weren't allowed to be so hot\".\n\nAshton Kutcher was 25 and Hilary Duff was 15 when he said how she was just \"one of those girls you're waiting to turn 18.\"\n\nMultiple celebs made comments sexualizing Natalie Portman when she was 12 (and looked 9).\n\nNo one said anything about it or cared.",
            "It would be a different story for sure. An 18 year old girl is not perceived the same way as an 18 year old boy, though I still think the story is very much giving unserious vibes. Also looking at Gracie's history, nothing nefarious came out about her on that topic after that, so for now I'm giving her the benefit of the doubt.",
            "I’m not saying I would have done this or you would have done this - it’s clearly gross and inappropriate but it’s obviously a horrible joke. If this upsets you so much I think maybe you need to calm down. There are legit predators out there and I don’t think fkn Gracie Abrams is one.",
            "This screams of the internet looking for something to complain about. It's really not that big a deal. It's not like she was in her late 20s and saying it. That would be wrong.",
            "Not defending what Gracie said in any way but an 18 year old is not a grown adult. Most 18 year olds are still in high school. They’re teenagers and you don’t suddenly become, or think like an adult as soon as you hit 18.",
            "Camila was 12 ehen she reblogged those posts. I am not defending her. But she has grown up and has being very vocal about her activism. But the tweet whicj Gracie liked was litreally bad against camila. ",
            "They used to be good friends and Gracie opened for Olivia back in the day. It’s speculated that Lacy is about her.",
            "Well sure, it’s all under plausible deniability. Ik they didn’t become friends overnight. But when you add everything together it’s a little sus.",
            "Conor Kennedy",
            "Oh damn, I remember seeing it at the time and was told she was 17. But looking it up now from forums everyone at the time was saying she's 17/18 so ig that's where the mixup happened.\n\nSidenote: I tried googling it but oddly NOT ONE SINGLE article has been written about this??? It's so strange\n\nhttps://preview.redd.it/i3zdxjp1w28d1.jpeg?width=1080&format=pjpg&auto=webp&s=a1aa384664af024defd125042288cb170e95ebe3",
            "> Talks about it and there are a few more about him being stalked by adults as a 13 year old as well. It’s a shame how many people lusted after him as a child.\n\nAnd it’s sick how Gracie is one of those people and is still able to get success, despite how she openly talked about wanting to fuck a minor when she was a grown adult.",
            "The entire pr industry exists",
            "She has a PR team for this exact reason.",
            "There is nothing weird about a 17 year old and 19 year old dating.",
            "maybe i’m remembering the wrong person but i’m 80% sure that one of the female actresses from “the affair” came out and said that she says she didn’t want to do anymore sex scenes/nudity (?) and lena met with her and convinced her to do them or something.  that soured me a lot tbh…but that’s only iirc",
            "Yeah I’m aware of that and wish more people brought that up instead of that debunked “pedo incest” nonsense.",
            "Btw Lena's sibling goes by Cyrus now and uses they/them pronouns",
            "Seven year olds can be predators. Perhaps not in this case, but children can absolutely be predatory. See: James Bulger.",
            "I agree with you and am glad to see I’m not the only one who feels bad that Lena got a lot of shit for opening up about that. I’ve had similar experiences with family members just like Lena did and would hate for someone to view that akin to sexual abuse or grooming. Lena has done a lot of vile and nefarious shit but I will always defend her when it comes to the whole sister debacle because the way people (mainly those on the far-right) tried to paint it out to be as some big pedophilic controversy was just puzzling and wrong.",
            "People just want to dogpile someone they see as the face of the militant feminist leftwing movement and thought that bringing up baseless allegations of pedophilia would work better than calling out the actual nefarious shit she’s done (re: her slandering a rape victim saying she had “insider information” that she was lying and then admitting that she didn’t).",
            "Oh I very much agree. My shock was in response to the very nonchalant way the above commenter seemed to brush off this behavior.",
            "Not once did I defend what she said. Not once. I said 18 year olds aren't grown adults, and they aren't, sorry. I was also very independent at 18, and I still was not mentally an adult. There are 18 year olds with children, they still do not have the emotional or mental maturity of an adult when it comes to many things. \n\nI do not care what all an 18-year-old is legally allowed to do. That varies from state to state and country to country, it means nothing. Are 16 year olds adults to you because they can drink in some places? Or because some have babies? Or because some get married? Are you saying that an 18 year old is really on the same playing field as a 40 year old then since they're allowed all the same legal rights, and if so, is it okay if they date?? 😐\n\nAgain, I'm not defending what she said. It was gross and incredibly stupid. But she wasn't an adult. I'm just tired of the internet acting as though the minute a person hits some random number chosen by the government that they miracously shift into this big, bad, brilliant adult overnight. It's just plain silly.",
            "👏👏 Couldn't upvote enough. As soon as people drag in the 'if a male did this' - argument, it's over for them lol",
            "THANK YOU\n\nif i have to hear “well if the roles were reversed” one more fucking time i’m gonna blow my brains out",
            "I don’t believe people make jokes like that without a sliver of honestly. Obviously she’s not saying she wants to have sex, but she’s pretty clearly saying she’s attracted to a 14yr old in an inappropriate way. \n\nBy posting that publicly she’s allowing the possibility that this boy is going to see or hear about this post. That’s incredibly messed up and I would say serious. ",
            "I agree that Camila has shown that she’s grown since that incident. It’s not my place to forgive or defend her but I think we can all acknowledge she put in the work to unlearn what she was taught and cares deeply about injustice.",
            "Gracie is not that special for Lacy to be about her lmao",
            "Wasn’t he 17 and wasn’t she 19?",
            "I mean if she made this post on 2017, she wasnt really in the hollywood scene yet so maybe no one batted an eye or cared because she was most likely a nobody by then. If i’m not mistaken she started being in the music industry on 2018. Tho i could be wrong but thats just my take. Still disgusting tho, was starting to like her as an artist",
            "Her daddy is worth $300 million. It was probably easy for him to make sure no reputable news/gossip outlet posted about it.",
            "It got erased offline",
            ".......okay then\n\n\n*edit: down vote all you want, that shit's still illegal. ",
            "Tbh even if this isn’t true it certainly sounds like something she’d do which says a lot lol",
            "Can't believe some of the responses you're getting. people and their wild opinions lol\n\nSo Josh Duggar isn't a predator either since he was 12 when he started molesting family friends and his sisters? Is this what we're doing now?\n\nBeing a kid does not absolve you of all your actions I'm so sorry to tell some of y'all.",
            "I simply disagree. I don't care how evil the actions of a 7 year old are, they cannot be characterized as a \"predator\". They reflect the abuse they received. I don't think there's an easy answer to \"what age can someone be a predator\" but 7 is definitely not it",
            "No, those kids were 10. Which is the absolute lower limit of criminal responsibility in the UK. The UK has one of the lowest ages of criminal responsibility in the western world, other than the weird states in America that straight don't have one. \n\nSexual abuse requires understanding and intent. A 7 year old does not have that comprehension at all unless they have been abused themselves.",
            "Honestly I think Lena enjoys negative attention. So it gave me the ick. (Her motivations, not what she disclosed.)\n\n I do find it  irritating when people make moralistic arguments but base their stance on situations on how much they like whoevers involved. \n\nAlso, even if it wasn't Lena, it's really hard to have a conversation about how prepubescent children are much more sexually curious (not aware) than people want to acknowledge - without sounding like a pedophile lol.",
            "Yes I meant to reply to the other commenter lol. Yes we are dumb at 18, we say weird shit, but that’s predatory shit** which isn’t normal or ok",
            "Typical social media brain where people think that just because they’ve seen something parroted countless times that it’s a real or coherent argument. Critical thinking is dead.",
            "REAL 😆 it’s a good song lol.",
            "that was Taylor Lautner. Taylor and Conor Kennedy were 22 and 18 respectively at the time of their relationship. it was probably the weirdest thing she's done imo but it doesn't make her a *pedophile*. that is a very strong accusation and I wish people didn't throw it around so flippantly",
            "Her dad is JJ Abrams. Like Star Wars director JJ Abrams. Even if she is publically unknown, her dad's status makes it impossible for her to be a \"nobody.\" And his wife is a public relations executive. They can probably sweep the biggest dirt piles under the rug.",
            "Another nepo-baby pop star.  No wonder she gets along so well with TS. (I was not aware her dad was the filmmaker who single-handedly ruined BOTH the *Star Wars* AND *Star Trek* franchises.)",
            "Exactly",
            "You can find it in two seconds with one Google search",
            "i feel like 17 and 19 is perfectly okay— those could be two kids a grade level apart in school. \n\ni do think it’s gross she dated the kennedy kid when he was a high school senior and she was like 21 though 😭",
            "The age difference between Taylor and Taylor Lautner wasn’t weird imo, but the age diff between her and the Kennedy kid and her and Harry Styles was weird",
            "I agree that the word pedophile gets thrown around when it doesn’t apply, and as someone who has dealt with CSA, it really pisses me off. I don’t even consider Gracie thirsting after a 14-year-old to be “pedophilia”, as gross and weird as it is.",
            "Connor was 17 when they started dating. She used to sign him out of school so they could hang out.",
            "With all that money in the bank you’d think he’d hire someone to teach her how to sing and write lmao",
            "That’s why Taylor is hanging with her, she wants to be in movies/direct movies so badly he’s hoping he’ll help her since she helped his daughter",
            "22 going on 23",
            "Dating him was one thing but going to his high school and signing him out to pick him up was another 💀",
            "I'm sorry you had to go through that :(\n\nand yeah, I feel like pedophilia accusations are even more common now that some of Drake's inappropriate behaviors have come to light",
            "No way she did that",
            "Thank you, but yeah I agree. People just love to knowingly misuse that term when the words they’re looking for are either hebephilia or phebophilia (granted, all of them are gross)."
        ]
    },
    "Pince William dancing to Shake It Off ": {
        "title": "Pince William dancing to Shake It Off ",
        "score": 35,
        "url": "https://v.redd.it/mczbm4onf38d1",
        "content": "Get it King 😂",
        "num_comments": 22,
        "comments": [
            "I’m dying 😂 he definitely wins for the most enthusiastic guest she’s had so far.",
            "https://preview.redd.it/ln7qhtnh948d1.jpeg?width=1170&format=pjpg&auto=webp&s=18cd5b27182838e4ceee57dc09ceb74ea20a3968\n\nTravis in his USA hat meeting Prince William 😂",
            "LMAO I hate the royal family but this clip is actually very endearing. He’s LIVING.",
            "I can't believe he used to be the hot one 🤣\n\n(I tease! I grew up in Australia and am a similar age, so Wills was always heartthrobbin' on the magazine covers.)",
            "https://preview.redd.it/olvajl52d48d1.jpeg?width=1284&format=pjpg&auto=webp&s=a2e0db0a982cf1dfd5aa35dd4ff55c27d7ff9af0",
            "William is the cringiest ever.",
            "Its not him 😂 there are many in uk who looks like him",
            "Him trying to be friendly but not touch him and get tased by royal protection officers 😆",
            "I think there is Princess Charlotte on the right so…",
            "Lmao! I read him and the kids were in a super private box so that no one could pics of them.",
            "What do you mean?",
            "Huh?",
            "If it was her there would be close up pics and videos of her and her dad. They are standing with the other fans and no one has any videos except this one?",
            "Possible he might have gone if his kids are fans but will keep it private. Uk journalists will rip him to shreds if he is found out dancing like this while his dad and wife are going through rough stuff.",
            "It’s likely a reference to the US secret service telling Travis they would taze him at his white house visit",
            "Royal protocol is that you don’t touch them- hugs, hands on arms, arm around, that sort of thing. You are often briefed on it before meeting them. Sometimes they relax it but rarely.",
            "There is another one xD\n\nhttps://preview.redd.it/dxr32p0ja48d1.jpeg?width=600&format=pjpg&auto=webp&s=f71e3ca18a23b7c3cfe9b0c748aa2b4f5e179d81",
            "Well videos and a close up selfie are all over social and traditional media today… he doesn’t seem that concerned with it being private.",
            "The video has already been posted by Sky News so it's definitely him also you can see in the pic with Taylor it's the outfits both him and Charlotte were wearing.",
            "I think this is conclusive evidence I can’t lie 😆",
            "Happy to be proven wrong!!"
        ]
    }
}