{
    "Sydney Daily Random Discussion Thread 22/06/2024": {
        "title": "Sydney Daily Random Discussion Thread 22/06/2024",
        "score": 0,
        "url": "https://www.reddit.com/r/sydney/comments/1dl9y5u/sydney_daily_random_discussion_thread_22062024/",
        "content": "Welcome to /r/Sydney. Feel free to use this thread to chat, self-post, or ask questions.\n\nNew to this subreddit? [Our wiki](https://www.reddit.com/r/sydney/wiki/index) has lots of good info on getting around Sydney, what to do when you visit, where to eat, and more.\n\nUsing a third party app or desktop view on mobile and can't read the sidebar? Please [**have a look here**](https://docs.google.com/document/d/1yt_ZZ7Y686kU1kdEOq0HOrXZNY56E1-r85nDgfB412o/edit) first ಠ⁠_⁠ಠ\n\nIf you're new here, please read [the answer to pretty much every self post](https://docs.google.com/document/d/1yt_ZZ7Y686kU1kdEOq0HOrXZNY56E1-r85nDgfB412o/edit), [reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439) and [self promotion](https://www.reddit.com/wiki/selfpromotion#wiki_here_are_some_guidelines_for_best_practices.3A).",
        "num_comments": 68,
        "comments": [
            "It’s very rude of the rain to wait for the weekend to arrive!",
            "Finished in the top 40 in Parkrun today, so that's something…",
            "I’d like to thank yesterday me for forcing herself to do two loads of laundry instead of putting it on me in this rainy day.",
            "Sometimes you grind the beans just right, steam the milk perfectly, and make the best coffee of the week on a Saturday morning. This is one of those mornings. Next up: bacon, eggs, tomato, mushrooms, beans, sourdough toast, and a food coma on the couch.",
            "Bloody hell when they said rain today I didn't realise we were expecting such a down pour. Ugh I just want to catch up on laundry",
            "So pissed off with NRMA. got a quote for green slip, paid for it, and didn't receive the email with policy documents. Can't find a way to retrieve it without registering an online account. And when I try to do that, says I don't have a policy with them so can't register. Phone customer service been on hold for an hour and then randomly got the call cut off. fuck me.",
            "Off to Supernova today. Anyone interested, remember to buy tix online - $45 (inc booking fee) vs $50 at the venue.",
            "Cooking some fish in a garlic sauce with salad for lunch then going to sit in my local library for reading then coffee and cake.  Currently watching my husband play the Elden Ring DLC and getting destoryed by the second main boss.  I beat the first boss (or what I think is supposed to be the first boss) last night but getting massively killed even with the new levelling system.  I am once again reminded how bad I am at FromSoft games even having beat a few of them now.",
            "So wet they've had to put cones to mark the underwater boundary lines at kids footie, but the game goes on.",
            "This is perfect weather for laying under a big fluffy feather quilt and binge watching Netflix :-)",
            "It's pretty freakin' unpleasant outside.",
            "$4.95 Connoisseur update:\n\nEnmore Foodworks had the normal price. I showed the lady the catalogue on my phone & she said \"we're not selling at that price, it's too low\"\n\n\"But the page name is  https://foodworks-enmore.myfoodworks.com.au/catalogues? Isn't this your page?\"\n\nShe reluctantly sold me one tub.\n\nPetersham was better. \"Ooh, very good price! More than half off!\"\n\nAbout 2doz tubs there last night. Not too many varieties left.",
            "Rain woke me up - Dang it. I was looking forward to another sunny healthy walk to boost my mood.",
            "Afternoon naps with cats are the best. Especially when it's cold and rainy.",
            "Does anyone have any recommendations for an enclosed cat litter box, particularly one that can suit cats that pee standing up? I know the Michu Mayitwill is one of the more popular ones, but a lot of the reviews say it’s not leak-proof for cats who pee upright.",
            "Drinks tonight in the city for a casual friendly catchup?  \nThrowing this out into the ether. Hope I don't get downvoted or removed, just a human trying to connect to another human. A friend bailed last minute but I have other plans lined up already in the area, and don't want to waste a good night out. Was planning to have drinks at 8:30PM, seeing if anyone is keen to join me otherwise I'll be on my own. If there are more of you, the merrier! I'll DM details where if you comment/DM me. (Purposely leaving out my age and gender for reasons but I'm in my 20s, if that helps).",
            "Nothing like figuring out the heater in my car doesn't work during winter. However, it does work - only turning left at about 60 kph. New car soon?",
            "Quick question,\nDo you need to go three years without receiving a demerit point to have any current ones removed? I incurred two last year in april 2023 and it looks like one more last week. Will the two be removed in 2026 or do I now need to receive none until 2027 to have all three removed?\nThank you.",
            "Does anyone know a good place to play snooker which isn’t cityheroes or Hornsby RSL? Cityheroes is terrible and Hornsby is great but crowded",
            "Send me your cordless vacuum cleaner recommendations please! My Dyson V8 animal has decided to break down right in time for EOFY.",
            "Does anyone know of any good driving instructors in the $60-70/hr range around the sutherland shire, preferably someone that is good with anxious learners",
            "longshot but you know those chilli jam condiments at places like papa rich - what do they look like?\n\nThey're not in coles (obviously - even though coles actually has a bunch of asian stuff now like chilli oil and gochujang) so I can check out the asian marts but still unsure what I'm looking for.\n\nLast one I found was a jar labelled 'chilli jam' but turns out that was for cooking (it was an oily paste to use for stir fry, not the condiment).",
            "Well Done! \n\nI just got back from the Shiraz Trail parkrun in McLaren Vale. PB and first number 1 token. I love parkrun tourism.",
            "Congratulations!! Esp for a day like today! You earned a good rest :)",
            "Rain even tomorrow, but looks like sunny week ahead",
            "Sometimes you grind the beans, sometimes life grinds you.",
            "Perfection",
            "Sounds amazing for a day like today!",
            "I’m glad I did most of my washing yesterday when I was wfh. The sound of the rain is nice though.",
            "How did you pay? There must be some kind of reference number involved, surely? Unless it was a clever scam.",
            "Sliding tackles are on. Whether they want it or not",
            "I finally got on the B99 train years after it's left the station. I should have gotten into it much sooner lmao it's amazing.",
            "When even the cat doesn’t want to go outside.",
            "Little setback but hopefully we can all stay warm and recuperate. Enjoy some hot beverages, quiet time and naps. I am looking forward to some more movement and walks when Ms Sunshine comes back!",
            "I’m glad my appointment was early this morning as the rain wasn’t coming down as heavy on my walk to/from (& coffee detour on the way). I came home & did the cleaning up & have settled in to watch the new season of restoration Australia. We were going to go to the swans vs gws match, but I don’t fancy heading out & sitting in the rain.",
            "I first read that as you took 2doz tubs and I was about to applaud your committment.",
            "I snagged a tub from Foodworks Redfern yesterday but yeah, not a lot of flavours either.",
            "I've had both cats coming and going from under the blanket since about 3/3:30. I have up sleeping about an hour ago but I know as soon as I get out of bed, these two will jump in my warm spot and go to sleep.",
            "Rain rain go away.. come again another day",
            "I’m sitting in the car waiting for my washing to finish and I can like feel my bed calling me. It’s been a day.",
            "https://www.petstock.com.au/products/moderna-top-cat-litter-tray\n\nThis could be a good option since it's solid the whole way down . Definitely might be cheaper to experiment with a new litter before a new litter box though",
            "You may have already tried this, but your cat may use the tray like that because they don't like the litter. If you try a new one, they may stop standing to pee. \n\nAs for the steamer box, my girls have tried some and my tip would be to make sure whatever one you get is ventilated. The two I had **stink** and I can't ever seen to get rid of the smell.",
            "Just the heat? Does the cool function work?",
            "No every time you get a demerit point it will be removed after three years and it doesn’t get added to the recent one. In your case the two that you incurred last year will be removed in 2026 and you will have to wait until 2027 to get the most recent one removed.",
            "Electrolux or Samsung vacuums are great. Dysons aren't great anymore and are way too pricey.",
            "What's wrong with the Dyson?",
            "I think that's a bit too low of a price unfortunately. Most are usually around $100 per session.",
            "Sambal is the name of the sauce. You should be able to find a few brands.",
            "Well done!\n\nYou're apparently missing my gag though, less than 40 people turned up for my Parkrun.",
            "I'm going to do all my washing and take it to the laundromat to dry, otherwise it just won't be done",
            "They all went for a big face first slide after the game. Think they actually came out of the puddle cleaner than they went in.",
            "I still feel sad about Andre Braugher's passing. He's a great dramatic actor AND B99 showed how he could transfer that into comedy (I hold the belief that it's harder for a dramatic actor to be successful in a comedy than vice versa. Comedic timing and sensibility is a skill not everyone has) - I had hoped he'd win an Oscar one day. :(",
            "It gets a bit weird and uncomfortable in its last season as it tries to cope in a post-George-Floyd ACAB world. You may want to quit before that.",
            "I think I've bought about 1doz before, but my freezer is a bit full atm.",
            "Yeah, it was like lots of cookies & cream, a few vanilla (surprising - they're normally the first to go), couple of Belgian choc, and salted caramel macadamia. Didn't notice anything else, but there might have been others.\n\nNo PB or Jam Donut :(",
            "Master manipulators cats",
            "Yeah, just the heater doesn't work. Cool works fine.",
            "Thank you very much. Happy cake day :)",
            "Looking to get a new cordless, I’m open to trying another brand. The port for the charging cable is acting up and won’t always start charging when I plug in the charging cable unless I fiddle with it and it sits a certain way. Just wanted to see if anyone had experiences with other brands",
            "Man I remember doing my driving lessons back in 2016 for $50 per hour.. I guess literally everything has increased in price nowadays.",
            "I could do 80-90",
            "Haha, I just looked at the Sydney weather.",
            "I felt really sad about that even though I'd never watched it because of how many people I knew who loved that series. 61 feels so young to go. That's my parents age, and they've only just started going grey.",
            "Jubbs and Bobs: *\"you are getting very sleeeepy\"*\n\nMe: Yeah, because you keep waking me up.",
            "I'm in the process of getting warranty repair for my v8 animal, it's kinda sweet. They just send you new parts until the problems fixed. I'm wondering if eventually I'll have an entire new machine built piecemeal."
        ]
    },
    "Give Way to buses is a law, not a courtesy.": {
        "title": "Give Way to buses is a law, not a courtesy.",
        "score": 382,
        "url": "https://www.reddit.com/r/sydney/comments/1dlpvtj/give_way_to_buses_is_a_law_not_a_courtesy/",
        "content": "If you don’t understand the basic road rule of Give Way to buses, then please do us a favour and get off the road.\n\nJust in  case you failed your learners test and don’t understand what I’m talking about, here’s a refresher.\n\nIf a bus is indicating ( min 5 secs ) and is pulling out from a bus stop they have right of way.\nFailure to Give Way is worth a $362 fine and 3 points.\n\nIn this lovely weather today it’s especially important because it’s harder for us to see.",
        "num_comments": 137,
        "comments": [
            "I get stuck sometimes trying to work out if they are leaving the bus stop and staying in their lane (which is clear for a long distance ahead of them) or trying to pull across a lane.",
            "Since you bring it up, tell your buddies down at the depot to actually indicate for five seconds, and not to lurch out into traffic after 1 second, or when I am already alongside them.",
            "I've no dramas with giving way to buses, but they need to get the whole bus into one lane before they stop and not pull out as soon as they put on their blinker. As with car drivers, there's a fair percentage of bus drivers that need a freshen up on the rules.",
            "I love this post because its bringing so much attention to how wild and dangerous Sydneys bus drivers are haha",
            ">min 5 secs \n\nReckon you can post that somewhere in your depot? Because I've lost count of how many times a bus driver has decided indicators are a courtesy, not a law.",
            "Are the buses that indicate for min 5 seconds in the room with us rn?",
            "How many bus drivers actually indicate for 5 seconds before leaving the stop? Zero, that's how many.",
            "What about when Ive passed the back of the bus and they weren’t indicating off the curb and then they pull out on me? Happens all the time. Maybe bus drivers who do this should get the fuck off the road also.",
            "I once saw a guy who obviously felt he was cut off by a bus jump out of his car and slap the bus driver’s window demanding the driver come out to settle it mano a mano. ‘Twas pretty funny.",
            "I always give way to buses.\n\nHowever, when you pull into a bus stop, I'd appreciate it if you would tuck your bum in to allow those in the left-hand lane to pass you.\n\nMost people will let you out, you don't need to block them.",
            "I don't give way to buses because it's the law.\n\nI give way to buses because I don't want to get sideswept and killed for being in its blind spot.\n\nI've seen buses take out cars in driveways and nearly run over pedestrians in this fine city, I'm not taking risks with them.",
            "Maybe bus drivers need to learn to indicate properly and actually show some fucking courtesy to other drivers, then, eh?\n\nEdit: while you’re at it, actually pull into the lane properly when you stop to pick up/drop off.",
            "So they actually indicate first right? Sick of Sydney bus drivers flashing once then pulling out into moving traffic then acting like they did nothing wrong.\n\nYeah you’re at work and your job is shit, we get it, doesn’t mean Sydney bus drivers get to act like the road is only there for them.",
            "Bunch of car drivers got busted yesterday flying down the bus lane near town hall .. Remember car drivers, these lanes are for buses and motorcycles not for you to jump cars.",
            "Yes into and out of bus stops\nNot give way to them when they just want to change lanes and turn into you.",
            "During school time you can't even tell when they're pulling out because the back lights are always flashing",
            "Just when leaving the kerb though right?",
            "Not like there's a sign on the rear of the bus saying so or anything",
            "Back in my day, the give way sign said \"please give way\"\n\nWhat happened to the please?",
            "Dickhead drivers won’t gaf anyway because they must get to their destination 2 seconds faster.",
            "U do realise it's the bad bus drivers that give them a bad name",
            "Another day another whingepost...",
            "Not once in my life have I witnessed a bus indicate for 5 seconds before pulling out",
            "I make it a point to give way to buses, but some bus drivers insist on turning their indicator on AS THEY ARE PULLING OUT, and that makes it very difficult.",
            "I'm always amazed at the number of people who drive as their profession; whether it's bus drivers, truck drivers, or taxi drivers, and who're often the more dangerous drivers on the road. The way I see it, if you have so much more time on the road, you should be more used to the conditions. I've driven for work before and I can say I figured out how to operate around cars who often would drive erratically or just plain badly, but I think with the case of buses, it's almost more than guaranteed that the problem is in the driver's seat of the bus than it is of the public.",
            "Love it when I get the bus driver wave for giving way to the bus. Always makes my day.",
            "In NSW, this rule only applies to buses with the sign, it's about 50/50 in my area that have the sign. \n\nIt also says you *should*, not that you *must*, so maybe the bus drivers should look at the back of their bus for the sticker before jumping up and down. \n\nI'm all for giving a bus a chance to pull out, I'm the guy that slows down and flashes a truck/bus, but this post isn't as black and white as it thinks it is.\n\nhttps://www.nsw.gov.au/driving-boating-and-transport/roads-safety-and-rules/heavy-vehicles/buses#:~:text=Bus%20lanes-,Priority%20for%20buses,in%20front%20of%20the%20driver.",
            "Genuine question as a recent immigrant to this fine country. \nDo pedestrians have right of way when crossing a side street?\nSeems like a lot of people don’t even look for cars before just stepping straight out. \nI’ve also seen a guy lose his shit at a car that was indicating and turning off a main road onto a side street because he the car honked him to move on. He was taking his sweet time just pretty much just standing in the road and didn’t look before stepping out. \nI’m not talking about the roads where the sign says to give way for pedestrians or where there is a crossing and the lights are green but the green man is also showing. \nJust regular side roads off of main roads. \n\nIn the UK the rules have just recently changed where pedestrians now have right of way but because it’s not been that way forever, most drivers are unaware and I’ve lived my whole life giving way to cars. Also I don’t want to end up as road kill. \n\nCurious about what is right over here.",
            "I didn't spend all this money on a huge truck I don't need to wait for buses or bikes or people crossing and pedestrian crossings.",
            "One of the first things I noticed when I started driving a few years ago was how little bus drivers indicate. Majority of the time there is no indicating for 5 seconds. It's indicate and start pulling out",
            "It’s a bonkers rule that there’s different rules for different vehicles on the same road. Blew my mind when I first got to Sydney. Found out about it the usual way, a bus just pulled out in front of my after indicating for one second, like it was a magic wand or something.",
            "So to be clear when the bus pulls into the bus stop and immediately indicates to leave the bus stop while picking up passengers I am expected to just stop there behind them and wait until they actually pull out?",
            "I like the buses that leave the kerb with zero indication and force you into oncoming peak hour traffic when youve past 3/4  of their length then ride their horn   - almost as if theyre blaming you for not using their insanely overpriced, overcrowded and ultimately inconveneient service.",
            "Sydney drivers are absolute shite but even we respect the buses.",
            "I would give way if getting past was an option. \n\nBut, I'd like to ask our lovely and dedicated bus drivers to also pull off to the side when stopping at a bus stop. Last couple of days I've been stuck behind two buses that just pointed its nose in but left it's arse blocking the lane.\n There was time and space to get more parallel, seemed like, just don't wanna..",
            "Fuck buses",
            "Or when buses are queued and they use hazard lights so the signal for I'm coming out and you have to give way is identical to their signal for I'm staying out, please go past.",
            "I got stuck once with one using hazard lights. When you can only see one side of the bus you can't tell.",
            "Relatable",
            "And then the flashing lights are left on for a distance",
            "Exactly. You can’t tell.",
            "Yes a couple of things are  confusing and disruptive ..  bus drivers usually signal when leaving their stop even if not leaving their lane, forcing cars in adjacent lanes to stop.  Also, buses often sit at a stop with their flashers on that other drivers may mistake for wanting to come into your lane. The give-way law makes sense but they need to fix those problems with bus driving etiquette to make it less confusing.",
            "It's easier if you know the routes. I know if the 270, forex, is just pulling out or if it's about to change lanes when and where because I used to take it all the time.",
            "I’m glad the majority of comments on this post have correctly pointed out that impatient bus drivers are often the problem.",
            "Yeh this is the real issue. While busses have right of way that doesn’t give them the right to turn their blinker on and pull out regardless of who’s in the next lane or observing what speed they’re doing. Drivers shouldn’t be expected to jam on the brakes.",
            "Also that when they have room to pull the whole bus in, not just leave their ass hanging across the next lane",
            "This happened to me. I was halfway up the bus, nowhere to go. He put his indicator on and just pulled straight out. I was pushed into the oncoming lane in front of a round-about. Luckily no one was in that lane. Then looked at me as if I was at fault. Like, mate, did you even look? Where am I meant to go?",
            "Yeah but to be fair Sydney car drivers do that shit all the time. I'm literally the only person I know who signals when she's about to change lanes, instead of waiting until I'm already changing lanes. I hardly expect bus drivers to be any different here.",
            "OP themselves is so aggressive for no reason, pretty indicative of the average bus driver in my opinion",
            "Or how many drivers in Sydney think an indicator means they can just start gliding into my lane and I'm the dickhead because I don't automatically pump the brakes to let them in. \n\nThe levels of entitlement in this city are out of control. \n\nYou wanna change lanes, find a gap and then speed up or slow down and MERGE.  Don't just try to glide into my lane or drive next to me for a kilometre and look over at me frantically like I'm being a meaniehead. You can just slow down and move over 🤷🏻‍♀️",
            "The ones around my area put their indicators on and try to immediately leave and when people don't react to it instantly some press the horn and act upset.",
            "They do where I live. I'm so used to Sydney drivers not using their blinkers until they're already merging that it legit makes me nervous.",
            "I do every single time.\nMy system is indicate as soon as I’ve pressed the button to close the front door, that takes about 3 seconds, then it’s another 3 seconds for the sequence of door brake release, handbrake and accelerator touch until the bus can even begin to move, adding on mirror and blind spot checks.\nOn average for me it’s at least 7 seconds until I start to move.\nAt least 30 times a day I have near misses wth drivers that either don’t understand the give way rule, or don’t care and just want to get in front of the bus.\nIt’s especially fun at sunrise and sunset when the sun is reflecting of your mirror and you are pretty much driving blind.\n\nThe incident today that inspired the post was a car that missed slamming into me by inches, blasted his horn at me, despite the fact that I’d sat in the bus stop and indicated for well over 10 seconds, let 2 cars go and started moving slowly before the 3rd car where there was a decent enough gap and plenty of space if he’d just slowed down.\n\nAt the end of the day I know it’s a big joke to everyone and you think we are all assholes, but let me assure you that it’s a really common cause of accidents, and 99% of the time the car not giving way is the one that is found at fault.\nWe not only have cameras on every angle of the bus, inside and out, but all buses also have a data recorder which shows the buses speed, how fast they were going, how long they were indicating, whether they were braking during accidents.\nSo good luck with that.",
            "which part of Sydney do they do this? I've seen a few comments saying this but I've never seen it in the six years I've had my licence.",
            "I had a bus driver do the opposite to me once, the bus was trying to accelerate to stop me from merging in a totally normal way.\n\n\nCranky busman.",
            "Have you seen the size of the vast majority of bus stops in Sydney!! They are half the size of the bus..",
            "We do, unless the bus stop is too small, or some peanut has parked into the bus zone and we can’t.\nIn the city, inner west, and eastern suburbs, a large number of the stops just don’t allow enough room for it.\nIt’s more important that we get the front door in with no gap so that elderly people, or people with prams etc can alight easily than to tuck the back in.\nThe saying is, the front door is guaranteed, the rear is a maybe.\nMaybe just be patient and wait 20 seconds so people can get off safely. Trust me we’d prefer to tuck in all the way.\n\nI seriously had a woman lay on her horn non stop last week while I got out and extended the ramp for a wheelchair.\nIt took less than 30 seconds.\nThe only reason I wasn’t tucked in was because a tradie had decided he should be allowed to park half into the bus zone.",
            "Probably not the case there but you can use a bus lane (not a bus only lane) for up to 100m in order to turn at an intersection or enter/leave the road.",
            "Also probably not the case here, but taxis and cars with hire car plates can also use the bus lanes.",
            "This one is egregious. Basically every light cycle you'll have multiple cars driving in the bus lane. It also causes problems for people following the rules because they get cut off or stuck in the intersection as the bus lane gronks will cut across as the light goes red.",
            "The school lights and the indicators are different lights.\nIt isn’t hard to tell them apart if you look.\nThe whole idea is that during school run time you slow the f#ck down and give the buses all of your attention so you don’t plow into children.",
            "Realistic guess. It's cheaper not to print please.",
            "it went the same way as courtesy to let buses have the way.",
            "It probably went the same time as the police went from “Police Service” to “Police Force”?",
            "\"Please\" made it sound like you have a choice ... the wording change was deliberate and mentioned in the rules.  Where a vehicle has that specific \"Give Way\" sign on the back, you must give way.\n\nhttps://www.nsw.gov.au/driving-boating-and-transport/roads-safety-and-rules/heavy-vehicles/buses",
            "There was that time back in '96.",
            "[ROAD RULES 2014 - REG 77 Giving way to buses (austlii.edu.au)](https://www5.austlii.edu.au/au/legis/nsw/consol_reg/rr2014104/s77.html)\n\nThis legislation says you must though.",
            "Not sure where you live, but every metro bus in Sydney has that sign.",
            "On page 133 of the nsw road user handbook it says you “must” give way to buses with that sign: https://www.nsw.gov.au/sites/default/files/2022-11/Road-User-Handbook-English.pdf",
            ">  Do pedestrians have right of way when crossing a side street? Seems like a lot of people don’t even look for cars before just stepping straight out.\n\nLegally yes. Road vehicles must give way to people walking across streets and roads. But inertia is a bitch and cemeteries are full of people who had right of way.",
            "Pedestrians do have right of way so we use that to pull our phones out of our pocket just before crossing the road and scroll instagram while crossing.",
            "Assuming no traffic lights or pedestrian crossings:\n\n* If drivers are *entering* the street the pedestrian is crossing, the driver must give way.\n* If drivers are *exiting* the street the pedestrian is crossing the pedestrian must give way.\n\nThat's my understanding of the law, but I'm not 100% sure. Happy for somebody to look it up and correct me. Also there's a general rule about drivers needing to not run people over (those obviously aren't the exact words), so regardless of anything else you can argue that pedestrians *always* have the right of way.",
            "Sydney drivers are 100% shite and territorial and that extends to the buses.",
            "You really don’t want them to fuck off. If buses disappeared and more users were forced to drive then the roads would be even more clogged than they are now.",
            "Yes the hazards, make them different somehow!",
            "This right here is the best solution. It’s beyond me why everyone doesn’t research and memorize every bus route. Bloody idiots.",
            "Completely unscientific but I put it down to privatisation.  The last few years, the local operator has been advertising for new drivers and services cancelled due to  driver shortages ... guessing the quality of successful applicants has dropped due to the supply side issues?",
            "If you can see they want to change lane for hundreds of metres why not let them in? There might not be any clear gap behind you for multiple cars. Them slowing down to find a gap impacts more cars than you slowing down a little to let them in",
            "King St, Newtown. Dozens of times every peak hour...",
            "I drive round basically all of Sydney for work, it's everywhere.",
            "Bus zones are always at least the size of a bus.",
            "I'm often impressed by how they managed to squeeze into some pretty tight bus zones. \n\nAdd in the high amount of cars parked in the bus zones or overhanging significantly, and it's no surprise half the bus has to stick out.",
            "Please could also signal choice.",
            "I don't mind being wrong and I generally allow buses/trucks to pull out to help with the flow of traffic anyway, so my only question is why does the official NSW Gov site use different language? Annoying.",
            "“As a driver, you must give way to pedestrians:\n* in shared zones\n* at pedestrian and children’s crossings\n* when turning at intersections\n* when doing a U-turn\n* when entering or leaving a driveway.”\n[Source: Sharing the road with pedestrians](https://www.nsw.gov.au/driving-boating-and-transport/roads-safety-and-rules/sharing-road-overtaking-and-merging/sharing-roads-pedestrians)\n\nCaveat:\n“When turning left or right at a roundabout, you do not have to give way to pedestrians unless there’s a pedestrian crossing.\nHowever, you must always take care to avoid colliding with a pedestrian.”\n[Source: Pedestrians and roundabouts](https://www.nsw.gov.au/driving-boating-and-transport/roads-safety-and-rules/stopping-giving-way-turning/roundabouts#toc-pedestrians-and-roundabouts)",
            "Ok that makes sense. \n\nDoes this also apply where there is a proper crossing where you have to wait 12 minutes for the green man?",
            "I do that so that the drivers will actually stop at pedestrian crossings.",
            "Not from what I've seen, but Sydney's a big place so it probably varies from area to area. North Shore and Northern Beaches don't fuck with the buses.",
            "Don’t forget to walk your route first, scoping out any potential for confusion with buses. Might be best to video them for future reference.",
            "When this annoys me there is a clear gap. I'm not one to speed up to close a gap for spite either. They just want me to brake. It's really strange driving behaviour, because the kind of person that does this seems to be really timid and *needs* to be let in, which I usually end up doing, because they're disturbing and distracting me.\n\nNo one knows how to merge anymore!\n\nAnd I'm sorry, that's not true that them slowing down for a few seconds impacts other drivers.  How does them slowing down to merge impact everyone so much more than me slowing down and impacting others in my lane anyway? \n\nYou know what impacts others minimally? Going with the flow of traffic and finding a natural gap to merge or change lanes if you need to.",
            "Which still wouldn't be long enough to fully pull into ... they shouldn't be expected to do parallel parking when picking up passengers.  Could be lazy drivers but possibly some  bus zones need to be longer.",
            "because they are idiots - there are other things there that are also wrong but they won't fix it.",
            "You are meant to wait till it is green before crossing. \n\nIt comes under Contributory negligence for anyone curious.",
            "We travel around the same areas. Maybe everyone respects the B Line but they also have dedicated bus lanes.  Buses aren’t respected on Ryde Road or the Pacific Highway.",
            "Become the bus driver. Drive the route for at least five years. Now you are ready.",
            "Not a bad call. \n\nI’ve actually heard of a couple folk staking out each bus stop and noting down which driver is on which shift, and their driving habits so that they can tailor their daily commute around the individual bus driver habits",
            "My thoughts of them slowing down to change lane is when there isn't a clear gap behind you. They'd have to go at a slower speed until there is a gap to merge, which could be multiple cars. If there's space behind you well that's their fault\n\nSydney would be a better driving experience if people were more courteous. There's too many impatient and arrogant drivers who have the expectation of every driver around them to be perfect",
            "Personally, I chose to do an apprenticeship at Mercedes in Germany so I could really get inside the mind of the machine.\n\nIt's really the only way to prepare yourself for Sydney driving.",
            "Are they the same people who have installed a radio in their car so they can call the driver and find out their intents?",
            "I heard of a couple installing radios, but it didn’t catch on. Apparently the bus drivers were big users of the radios. They use the radios less than their indicators, if you can believe that…"
        ]
    },
    "just some passersby on a rainy afternoon :)": {
        "title": "just some passersby on a rainy afternoon :)",
        "score": 231,
        "url": "https://www.reddit.com/gallery/1dllzj1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "They're always extra adorable in the rain. The cold seems to make them want to snuggle up to each other.",
            "Beautiful visitors 💗",
            "Looks like the decided to break up in the end",
            "I miss seeing these arseholes. The only birds I see now are indian mynas and ibis'.",
            "Are you in West Ryde?",
            "Mongrel birds...always attacking the other birds (pidgeons/bush turkeys/bin chickens etc). But people like pretty things!"
        ]
    },
    "Sydney road rage attack accused Bradley Wilkinson held Rhyce Harding \"intentionally and forcefully\" against moving vehicle": {
        "title": "Sydney road rage attack accused Bradley Wilkinson held Rhyce Harding \"intentionally and forcefully\" against moving vehicle",
        "score": 85,
        "url": "https://www.abc.net.au/news/2024-06-22/alleged-fatal-sydney-road-rage-victim-rhys-harding-court-detail/104010970",
        "content": "",
        "num_comments": 63,
        "comments": [
            ">The defendant spoke only to confirm that prison staff had given him his medication, praising the nurses for their professionalism.\n\nNurses really are angels. Especially here, keeping it professional when (presumably) knowing he intentionally did what he did.",
            "This should put to bed all the speculation that was going on yesterday. The victim wasn't holding onto the vehicle as the aggressor, he was _being held_ by the accused, which is so much worse.",
            "This is how you ruin your life and future. By letting your anger control you, resulting in the death of someone.\n\nEven if the guy that exited the car was maybe aggressive, there are ways to sort of resolve or navigate this... INSTEAD of letting your anger overwhelm you.",
            "What the fuck? I have no words, I just wish I knew less.",
            "\"Mr Harding got out of his car after feeling threatened by a driver following him.\"\n\nNot victim blaming. But that's got to be a sliding doors moment.\n No one is in the car in front is getting out to talk to the guy behind him in any sort of peaceful context.",
            "Needs a 30 year minimum custodial. Nothing less. The absolute cunt",
            "From the picture in the paper it looks like he has his foot in the drivers window.\nIf so did he kick the driver?\n\nAnd was the driver trying to escape?\n\nToo early to say.",
            "The *pleasure* this Bradley Wilkinson took in feeling another person's pain, as he held onto the victim, before dropping victim under the wheels of his vehicle, indicates a narc-like character trait.\n\nAlthough the likelihood of jail is high, he'll learn plenty new and devious skills whilst inside. Understand that he will game the system. Before getting back out and living out his life. The truth of the passage of life is always uncomfortable.",
            "I think it's totally random that the 2 men involved lived in suburbs right next to each other.",
            "Not to diminish their professionalism, but they've probably seen a lot worse so they're accustomed to treating people well regardless of what they've done. That takes a special kind of strength and conviction a lot don't have.",
            "They really are. They have a hard time getting the right medications to inmates, but they do it really well. Every single day there's thousands of inmates inside jails that need medications. Usually they make them up during the night, and you go to see them in the morning and they hand it to you, but on lock down days, they go cell to cell with a big book, and a cart filled with meds that they've made up especially for you. Then there's all the little mistakes that happen like inmates changing their meds recently, or their dosage. They'll write it down in a notebook, and always get it back to you.  \n\nPlus you've got hundreds of inmates on the trucks too. Going to and from courts, being shipped to new jails. It's a never ending job.  \n\nAnd that's just meds. Add in the burns. Injuries. Medical issues like rashes and stuff. Absolute fucking angels they are.",
            "yep there we go. killed the guy by holding onto him like a coward, felt him go under his car tyre and then ran and hid for the night. they should never let him have a license ever again. we're better off without people like this on the road",
            "What are some of those ways? You could try to drive away without holding the victim I guess. That’s pretty much the only option.",
            "It's hard to say without knowing the exact circumstances of their interaction but generally speaking it doesn't often end well when someone gets out of their car to confront another motorist.\n\nI don't know what it is about driving but for some reason it turns even the most reasonable people into raging lunatics sometimes.",
            "This guy gets it. Manslaughter accused probably panicked after the kickboxer victim maybe threatened him.",
            "Again, all the disclaimers about this poor guy.\n\nBut. \n\nHow does anyone know why he got out of his car? How did they work this out?",
            "Well that is exactly what victim blaming is. Dude did not expect or deserve to be murdered.",
            "Witnesses said he was wearing hi vis clothing and jeans, and the CCTV shows the half of the body wearing hi vis closest to the window. He was being held by his hand or his arm.",
            "If the driver was trying to escape, he could have yanked the guy out and then went on the left lane...?",
            "He'll be going to gaol.",
            "> they should never let him have a license ever again.\n\nSadly I don't think the lack of a license has ever stopped people like this from getting behind the wheel if they felt like it.",
            "Lock your doors, close your windows. Drive away when possible.",
            "Both were dickheads. The victim practiced kickboxing and got out of his ute and the accused sped up quite a bit before the victim fell - I feel like this was to increase the damage.",
            "You empathise with other humans. Well most people do at least. So you can forgive another human for delaying you or whatever.\n\nYou don't empathise with a steel box on wheels. Even though we all know a human is inside, if we don't recognise a human, we don't treat them like one. \n\nThis also applies to not recognising people in motorbike helmets and riding leathers or bicycle helmets, sunnies and lycra bodysuits as human.\n\nBeing in a car at highspeeds turns you into a sociopath.",
            "Probably something to do with your car being your own private space, an extension of home or even self.\n\nAnd to a high extent, we're cut off from so much unspoken communication, mostly only using vehicle maneouvres like brake checks, tailgating and honking to try to communicate - all very flawed and easily seen as a threat to the aforementioned personal space.\n\nAlways good IMHO to try to make things nice on the road, like waving thanks, holding up a \"sorry, my bad\" hand gesture if maybe you've made an error, letting people in, etc.\n\nCan't do much about aggressive tailgaters though, other than trying to relax and ignore them, let them pass easily when possible.",
            "Apart from most Sydney roads being like a car park, these car parks are filled with dickhead drivers that are infuriating. Like the guy that does 10k under the speed limit or the one that slams their brakes on for no reason. Most Sydney drivers will have some form of road rage.",
            "Funny, just this morning a Redditor was telling me about how they got out of their car to explain to the very loud car behind them what they were doing not immediately cutting across traffic and could they please stop honking? and the other driver was pissing themselves.",
            "If it was his foot in the window as others have indicated I would say he’s done more than threaten, pretty hard for driver to reach out and grab his foot and hold it if it’s on the ground,He’s almost certainly kicked the driver or vehicle. Possibly overcharged think they might struggle sticking a manslaughter charge",
            "People who speed and crash and die don’t expect or deserve it either. Not sure what that has to do with anything. He did something extremely stupid and dangerous.",
            "Well honestly he shouldn't have gotten out of the car and confronted him.",
            "Yeah and will eventually be released and will be given back a license to do it again when he gets angry he was delayed 2/10ths of a second at a red light.",
            "In this Justice system he will be nominated for a bravery award most likely 😪",
            "No, but it makes it easier to whack them when they do.",
            "Doesn’t work if you already had your window down. It wont let you put it back up if theres an obstruction in the way.",
            "This is why I keep my car doors locked. So if I bip someone who loses their fucking mind I can continue bipping them from the safety of my steel cage instead of being hauled into traffic and having the shit beaten out of me.\n\n(I am only half joking here.)",
            "Funnily enough when I was driving a taxi I used to depersonalise the other drivers and just see them and their vehicle as an object.\n\nSo it would be \"that object came close to me\" instead of \"that bastard cut me off!\".\n\nSo as you are not seeing a person you don't get road rage as you can't get road rage over an object.",
            "> Probably something to do with your car being your own private space, an extension of home or even self.\n\nI only recently found out that the Gary Numan hit song \"Cars\" was inspired by him experiencing a road rage incident. The song does capture the feeling of your car being its own private and usually safe space.",
            "I have no idea how others have concluded he was being dragged by his foot. Witnesses said he was wearing hi vis clothing and jeans, and the CCTV shows the half of the body wearing hi vis closest to the window. He was being held by his hand or his arm.",
            "So the appropriate punishment is being killed? Ok. So like women shouldn't go home with a man or she's asking to be raped? Cool. Totally not victim blaming. This is what gives men with anger problems a free pass to just do whatever they want. The problem is the person who did the 'wrong' thing.",
            "If only you had warning like them getting out and walking up to you allowing you to lock windows and doors.\n\nAlso driving with window down in winter?",
            "Wonder how the accused managed to get a hold of his arm…\n\nAlmost like the victims arm was inside the accused vehicle for some reason, before the accused grabbed hold of it…",
            "Of course not. There's no \"appropriate punishment\". The outcome is the outcome. I have no control or judgement over what happened there. What I am saying, is that if he didn't get out of his car and start a confrontation, it wouldn't have happened.  \n\nThe MEN with the anger problems met and the situation happened. Both men.",
            "I drive with the window down lol. Did it just yesterday. I love the fresh cold air",
            "Or maybe he just grabbed it himself ?",
            "Lmao. \n\nThere’s no shortage of road rage videos on the internet. Go and watch a few and then come back and tell me how many of them showed the violence being instigated by the person who remained inside their vehicle. \n\nI’ll give you a clue: it’s virtually zero."
        ]
    },
    "How much is your usual electricity bill per quarter? Ours is now $3k and this seems insane to me": {
        "title": "How much is your usual electricity bill per quarter? Ours is now $3k and this seems insane to me",
        "score": 86,
        "url": "https://www.reddit.com/r/sydney/comments/1dlmzon/how_much_is_your_usual_electricity_bill_per/",
        "content": "As in the headline. Going to ring Energy Australia on Monday but this can't be normal can it?\n\n  \nEDIT for clarity: Two bedroom house. Three people. No aircon!!",
        "num_comments": 220,
        "comments": [
            "Total cost isn’t meaningful without knowing the actual usage and rate. Also whether it’s a workshop, grocery store, 6 bed with 10 people in it or a couple in a 1-bed apartment.\n\nApprox [900 kWh at $300 per quarter](https://i.imgur.com/gRKxSdB.jpeg) here for a 4-bed house.",
            "300 a quarter. 2 bedroom apartment",
            "Big 5 bedroom home, 2 freeloading teenagers each with a bedroom TV, pool filter running 3-4 hours a day, at home ev charging, wife who insists on using the dryer when it’s sunny. Ducted AC in the house, split system ac in the pool house….approx 900/quarter. Will get solar soon. $3k per quarter seems pretty crazy",
            "$600 a quarter in spring/autumn and $900 a quarter in summer/winter. 2 bedroom average Sydney drafty weatherboard shed.",
            "Are you growing weed?",
            "My back of envelope calcs says that’s over 100kwh per day. Which is insane.\n\nEdit: And impossible. Unless you’re running a factory.",
            "Mine is about $220 per quarter. I live in a highly insulated 1 bedder.",
            "Let me guess, you’re with AGL?\n\n4 bed with pool. 150 a month power. That was over summer. Will be closer to 200 in winter. With Amber\n\nI was paying $1200 per q with agl before I switched. I swear they are doing something dodgy with billing",
            "300 a quarter but its gonna be a lot more cos the house is freezing and the AC is on to heat us 😭😭😭",
            "Is it based on \"actual\" or \"estimated\" data? \n\nDo a comparison using the [energymadeeasy.gov.au](http://energymadeeasy.gov.au) website to find a better provider. It gives you the option to enter your NMI (national meter identifier) - do this because then it will work it out based on your actual consumption over the last 12 months.\n\nBe aware that lots of places are having a price rise on 1st July and the [energymadeeasy.gov.au](http://energymadeeasy.gov.au) site will show you the current price until the price rise hits. You might be better off waiting till 1st July to do the comparison. \n\nAnother tip - if you tell the new provider that you're \"moving in\" they will organise a special meter read and transfer you over immediately. If you just want to change providers it waits till the next billing cycle. The special meter read costs - $15 or so I think - so you'd have to work out if it was worthwhile based on the number of days to the next cycle. Given the size of your bill it would probably be worthwhile.",
            "You're bad with your energy usage.",
            "Last quarter Jan - Apr (94 days) was $230.27 for a 2bdr apartment. Just myself and my cat :)\n\nUsed air con a bit during that period but not frequently. I wfh a couple of days a week. I'm not frugal but definitely mindful of unnecessary usage.\n\nIn winter I rarely use the air con for heating. Dissipates so fast. Big fan of electric blanket I use continuously on the bed and lounge when watching TV. Massive reduction in cost compared air con.",
            "Was $1k for the entire year. Love them $125 credits",
            "If you’re running aircon all the time it makes sense, that shit costs a fortune",
            "Are you 3D rendering 24/7 on multiple computers? Even then, that amount is outrageous",
            "More info needed. That seems absolutely insane.",
            "Dude, my mate was growing weed, had fish tanks and a sauna and had a cheaper bill than you.",
            "Electric oven, fridge,  reverse cycle AC used less than 30 days a year, all lights LED, 2 bed, 2 bath, apartment (<5 years old), $300 per quarter.",
            "750 2 bedroom terrace couple",
            "$250 every quarter. We have a two bed house",
            "Do you have a pool with multiple pumps running? A lot of winter heating? ",
            "One lives in annappartment by theirselves and other live with a family or roomates in a manaion with high ceilings.   Context kinda matters? 3 K seems high.",
            "Mine was about that. If you are WFHyou are probably consuming a lot of power during the day and that really adds up. You should think about changing energy providers. Check out the government one. https://www.energymadeeasy.gov.au/\nYou can upload your bills and it will tell you the best deal. Energy Australia was owned by Australia but was sold to china and they might not have your best interests at heart. If you are in a position to go solar I would 100% recommend.",
            "I just got our gas bill from energy Australia and it was more than our electric!! They were super unhelpful and I’m changing providers. After the initial signup discount they absolutely rort you.",
            "My last bill was 1300. I cried. Tiny 3 bed house with two people\n\nNormally over Christmas when I have two weeks off and its hot it was before insulating, 787 at most and about 700 last christmas/summer quarter. my last was 937 when its normally 587 and should be leas with 4.5 insulation\n\nMy bedroom aircon was dying which has been replaced but I am getting solar also now because even with that dying, costs are way above what they should be based on the past post insulation bills.",
            "Do you have electric hot water? The only time I’ve had a massive blowout on electricity was when I had a malfunctioning hot water tank that was running 24/7 because it wasn’t holding heat for some reason.",
            "www.energymadeeasy.com.au maybe of use to you.",
            "$700 pq with two adults and a teenager. Before the increases started it was half of that with the gaming pc switched on all the time. It stays off now unless updating and actually gaming.",
            "Usually was 5 to 600, but the last one was 999, with no extra use than normal for the time of year. 2 adults small house.",
            "Unless you have a hydro grow setup that’s fucking insane. Australians get screwed in every way possible. It’s time we stopped being so apathetic and hold our government accountable",
            "Approx $200pq for a 2bd, 2ba apartment. I wfh 3 days pw & we are generally homebodies.",
            "1300 a quarter.  2 adults and 2 teens in an uninsulated 60’s house, I run the dryer for each wash load, in the summer I don’t run air con but the pool pump runs.  In winter I run 2 air cons 6 hours a day each.",
            "Depending on the season 600-800 a quarter for a 3 bd house. WFH, kids, ac and gaming pc’. That’s including hot water as no gas.",
            "$240 for 2 adults and 1 child. Plus $270 for gas (gas-heated water, and oven).",
            "$100 per month",
            "Five in home 800 per quarter . Average",
            "300 per month with 10 kWh solar. This winter gonna be 1.5-2x more",
            "With agl and it’s just over $300 (thank u heater)",
            "You must have a pretty big hydro set-up in your house. Wtf!",
            "I am in a 4 bedroom house on my own. I don't have lights on at night.  No heating or cooling as well. and I am the only one in the house and mine has been around 800.00 sometimes more.  I am not going to keep an eye on it cause I am sure they are just guessing the meter",
            "$1200 in winter , $800 the rest of the year. 3 bedroom drafty old house, 6 people, adults work from home. I run a full load in the large washing machine everyday at least once and always use the dryer, as when I use the line things never get dry on time and usually come back with spiders/bugs. We use the AC pretty much constantly or we'd have to use outside parkas and beanies inside and I get actually depressed with the cold. Also we have to use the AC to lower the humidity frequently or we'll get mold. Electric heaters on low in the children's bedroom at night. Fan heater in the bedroom for everyone's daily shower. Curious to see this year's winter bill with the inflation.",
            "$500/quarter for a well-insulated 3 bedroom apartment, family of 4",
            "2 people, 2 WFH F/T. 3 br duplex. $3000 year because we use Air Con freely.",
            "Around $250 currently, less in summer.\n\nSolar + gas hot water & stovetop.\n\nI avoid using elec as much as possible during peak.",
            "$3k is a scary number. How big is your house?\n\n$575 last quarter for a 3 bed house, no gas, ducted aircon and aircon.  We have solar but the bill is more in the summer months, especially when we run the aircon in the evening. \n\nThe water heater runs off peak on a dedicated circuit, so we don’t get the benefit of solar there. Could definitely save a fair bit with a heat pump hot water system when we get around to it.",
            "Ok reading through the comments here has me really … what’s your kWh rate?\n\nI am 3 bed, electric stove, portable and reverse cycle heating only 30.97kWh per month but my bill is $390+ per month!! With AGL.",
            "It might be one of your appliances e.g. oven, fridge, washing machine that's really old and using up A LOT more power than necessary.",
            "I’m at about 350 pq for a 3 bd house and working from home. Check what you are running small space heaters and oil heaters will cost more than you think. My old oil heater is an art object in the corner now. Last winter I used it cost me 500.  Never again",
            "It could be your bitcoin mine or your render farm.",
            "1 couple in a 2 bedroom apartment, we use the clothes dryer a lot because our apartment gets very little sun, no gas so cooktop and hot water is electric. About $300 a quarter, more in winter.",
            "What kind of hot water system do you have? If it’s a regular old immersion heater, leaving it turned on is like throwing money in the bin. Turn it on for an hour in the morning and an hour in the evening and leave it off otherwise.",
            "We're currently doing $900 a quarter averaging 40kWh a day, greatest usage being 70kWh in a day in summer with aircon.\n\nOur bill is offset by solar.\n\nBefore the price rises, we were $1000 a quarter without solar, dropping to $300 per quarter immediately after installing solar.\n\nObviously we are very glad our investment in solar has paid off (and has been paid off in less than three years).\n\nWe are acutely aware that much of our power consumption is for luxury items.",
            "Ours is $1100 with 3 people and 5 bedrooms. Single level",
            "Mine is dirt cheap but body corp is very high",
            "Four bedroom home\nTwo adults\nOne not working\n\nLast bill Dec 23 - Mar 24 \n\n630kWh\n\n$373.39\n\nDaily supply $1.24 (91 days = $113.10)\n\nGeneral usage $0.41\n\nNo aircon\nHardly use dryer",
            "I'm paying 3K a quarter and also about 2K over winter for gas.",
            "Was about $600 per quarter, 3br house with 3 people but gas hot water. Installed solar a year ago and now about $100 per quarter in sunny months, it's been cloudy for ages though so I expect a bigger bill next time.",
            "Insulation (or lack of) makes a huge difference.",
            "Last one was $820 for my tiny 1 bedroom apartment, 2 people. Barely use anything, also with energy aus",
            "I just paid $171.57 for the last quarter for a two bedroom flat. But only one person lives here.",
            "$550 3 bed home. I mainly work from home",
            "You’re with Origin, aren’t you?",
            "Has your contract ticked over into the reference rates?  They are pretty high.\n\nHave you got underfloor heating?  That costs a small fortune to run.",
            "$266 for 881kWH for the quarter ending 20 June. 3BR double brick house.\n\nI have an 8kW solar system so most of my appliance use is between 8am-5pm and any excess gets me a bit of feed-in credit (about $100 this quarter, heaps more in summer). I also have gas for stovetop cooking and instantaneous hot water.",
            "That’s a lot of usage no matter what your situation.\n\nFor that amount I assume you have the least efficient electric hot water, on peak, maybe an EV being charged at home and ducted aircon set way too high almost 24/7\n\nOr if your bill has suddenly gone up 10x it’s just a meter read error somehow",
            "How big a house are you powering and/or what the hell are you running to rack up a bill that big?\n\nOur annual bill for a 4 bd, 3 bath McMansion in suburban Sydney is roughly about half your quarterly bill.\n\nI doubt we could use $3000 worth of electricity if we wanted to per annum, let alone per quarter.\n\nI'd suggest you stop the hydroponic setup and bitcoin mining as a starting point.",
            "About 300-400pq. 1 person, 1 dog, WFH full time, no air con but oil heater on every night for 12 hrs.",
            "I'm amazed you haven't been raided for growing umm a lot of indoor plants so to speak.",
            "550sqm house, aircon runs most of the time, heated pool, underfloor heating, etc, I have 13.3kw of solar and 30kw of batteries.\n\nFamily of 5, gas appliances (incl hot water), house largely empty during the day, 3 days a week, minimum occupancy 2 days a week (wife WFH).\n\nMy power bill in eastern suburbs is $1,300 per quarter.",
            "I usually pay ~$380/quarter for 2 adults in a 2 bedroom unit, $3k seems very excessive but without context of how large your household is it’s hard to say",
            "$300 a quarter. 4 bed house with pool filter, also have solar.",
            "Ok you’re similar to me. We’ve just moved into a 6 bedroom house with 5 kids, a pool and an occupied granny flat. \n\nYes we can use 100kWh in a day and it’s real. With the granny flat consider 3 fridges, heating across 380sqm of house and 7 people plus a pool… \n\nPlus a teenager with an electric heater\n\nShit adds up",
            "I'm paying like $110-160 a month and $100 a month for water.\n1 bedroom apartment. \n\nEmbedded network with Energy Locals (previously Energy Trade)\nAm I getting absolutely fucked?",
            "Ours was $2500/q 4 bedroom family home",
            "Yeah somebody cocked up in the calculation. Do you have a smart meter or a manual spinning one? You are completely not liable to pay that",
            "Mine is around $500 for a single person household (not including gas usage) and I just got an email from my provider telling me that prices are going up from July 1st by coincidentally the exact amount that Albo is offering as an electricity bill rebate.",
            "We had the aircon on every single night in summer and I thought the $623 bill was outrageous",
            "That shit ain't add up, call them",
            "This quarter is looking toward $1500\n\nThats on top of 30kw of solar on the roof and a 25kwh battery. \n\nOff peak hot water and ducted air con seem to be the things that do the damage. \n\nSwapping out the hot water to heat pumps now to see if that helps much",
            "Have solar panels so it depends, but would say $300-500/quarter. 4 bedroom house, 4 adults and 2 kids.\n\nThe electric hot water system is 1/3 of the bill though (controlled load circuit).",
            "$3k???? How big is this house and how many people live there????? Mine is around $300 a quarter. When my kids were home and I lived in the snowy mountains and had heating running all winter plus using the dryer constantly it got as high as $800 in the winter quarter.",
            "$4-500 a quarter. 3 bed house. 2 adults and one kid. We have a 6kW solar system. We do run AC as necessary and use clothes dryer. Cooking at home does run up the bill a bit too.",
            "- Townhouse\n- 2 adult and a child\n- 6kw Solar\n- All electric/No gas\n- $350 a quarter over the 2 winter bills/$0 for the 2 Summer bills. \n\nPlanning on getting an EV which will increase that but it’ll remove the $120 a week on Petroleum Distillate. I’ve worked out it’ll cost $30 a week for about 20,000km a year. So an extra $390 a quarter. $3,000 a quarter sounds crazy.",
            "Is your hot water electric? Is it leaking",
            "Government is using taxpayer dollars to subsidise wind farms at the rate $500,000 P/a per turbine through Renewable energy credits whilst closing down coal fired plants. Expect more increases.",
            "$350pq, three bedroom house with three people.",
            "6 bedroom, 4 bathroom, 2 garage house, built 1948, poorly insulated, washing machine, dryer, TVs,  PCs, microwave running often, doors and windows open for the cat, electric heaters in various rooms, 5 adults, electricity Jan-Mar: $600.",
            "About $150pq for a 3 bed 2 bath with detached home office, 2 adults working from home and 2 young kids. We have solar and an EV. We are fairly low energy users though, averaging about 8kwh day, and very mindful of behaviour in picking the right times of the day to use appliances or charge the car.",
            "OP subscribe to Bill Hero. It costs $50/year and you upload each bill and they tell you if there's a better deal.\n\nOur last bill was $1200. I used BH and we switched and under the new plan pricing, out last bill would have been $750. \n\nYou can also use the NSW government energy switch tool but I got a better result from BH.",
            "I have no idea how you're sticking to that few kWh per quarter for a four bedroom house presumably inhabited by more than one person. That's wild.\n\nI'm in a one bedroom apartment and wfh I use approx. 800 kWh per quarter. You guys must never be home.",
            "Last bill was about $260 for the quarter, two adults in a 2 bedroom apartment with one WFH full time.\n\nI can’t imagine having a bill over $1k, yet alone $3k.",
            "Family of 4 here (2 adults, 2 teens) in 4 bed house, with (salt water) pool, but gas heating, stovetop and hot water (so no reverse cycle A/C) - use about 2100-2250Wh per quarter, at a cost of around $750-$800 give or take. Running the pool pumps is about 15-20% of the usage (according to the providers energy insights reports). Time of use metering with AGL currently - we do try and minimise peak time power usage.\n\nI don't know how you get that down to only 900 kWh? Amazing!",
            "The other point I want to make is about how electricity is used. It's important to be honest with yourself and ask, 'Am I conscious about how frivolously I use electricity?'\n\nPersonally, I've noticed this a lot since my divorce. When discussing bills with my ex-wife, I've seen firsthand where energy 'leaks' occur. Halogen lights left on instead of LEDs, using a dryer instead of a simple airing rack for clothes—even without an outdoor line, a cheap $20 rack can save a lot. \n\nStarting with a waste-conscious mindset is a great approach.",
            "Why is my AGL $340 for 670kWh ?!?!",
            "Wow that is a lean household. I'm 1240kWh per quarter for 4 pax. We do run reverse cycle for heat and air con. We also have a crap ton of devices, TV's, computers etc. Hot water/cooking via gas.",
            "That's really good, who is your provider?  \nWe are two adults in a townhouse and running at $250 / month (750/quarter)",
            "Struggle to believe this is real. I’ve had $700 quarters in summer with aircon in a three bedder, no pool and solar covering a lot of the daytime power usage (dryer, dishwasher and aircon).",
            "Considering your usage and basically not caring at all about electricity use I'd say your figures are hella low. Running a space heater at night in a one bedroom apartment would get you to that cost. Ask me how I know.",
            "I am pretty much same situation as you, with solar but without the EV. Also have a heat pump for the hot water. \n\n\nSummer I’m about $900 a quarter. \nAutumn/Winter about $600 a quarter.\n\nWould be interested to know how much you save with the solar. Think my issue is I have a 13 yo a/c which needs replacing.",
            "Similar for us, 3 kids, 2 adults, pool, ducted air, 10kw solar, about $200-250 during cooler months, less during summer when solar output ramps up, less ac as we have big ass fans instead. Ac gets used in winter more.\nDid find agl had put us onto their basic plan at some point, so had to put us back on the value plan to hopefully see a 10-20% lower bill.. Pissed about that, checking why they did that.",
            "$720 for this leaky 2 bed fibro. I've been running the dehumidifier quite a bit over summer and using the clothes dryer probably more than I ought to.",
            "weed-laced bitcoins",
            "This is my first assumption if someone has a bill that high",
            "They'd have to be running 50+ lights to get it that high.\n\n240w light x 12hr is only 2.8kwh a day.",
            "And if yes, can I come get some",
            "It's possible. We hit 90kWh now and again.",
            "I was with agl as well. Was paying $240 a month for gas and electric in a 1 bedroom flat. Am now with momentum and pay$140 a month for electricity for a 3 bedroom townhouse. I’m still baffled as to why agl cost so much more. Lesson learnt!",
            "Energy Australia!",
            "Thanks heaps. We don't use much. No aircon. Put the heater on about 10 days per year. Could it be the hot water tank perhaps??",
            "Inconvenient truth right here",
            "We don't have aircon! I'm beginning to think there's something seriously wrong here.",
            "Depends on the air con. Ducted or old air con yes; new RCAC air con should be much more efficient.",
            "We're over here with no weed, fish or sauna. Something's definitely up.",
            "Please share your provider (and do you have electric hot water?)!",
            "We do and I’m now convinced this is the issue!",
            "Surely there's no way you're running heating or anything? My bill is not even as low as 200pq in the summer when just running fans?",
            "Consider a heat pump dryer! We use ours everyday, sometimes twice.",
            "This seems like a real world usage for a 4 Brm in NSW.",
            "Even that seems a bit high based on your usage.",
            "I'm paying $110-160 per month on an embedded network. Am I getting screwed?",
            "What the absolute fuck",
            "Feel your pain. I’d love to change the hot water system to a heat pump system.",
            "How does govt subsidised energy increase ones bill?\n\nI know we're in an investment phase, but isn't part of the point of renewables to be cheaper?",
            "are you Amish?",
            "Who are you with?",
            "So the solar is saving you a motza? Your daily usage is similar to mine, but my bills are more like $750-$800 per quarter.",
            "Just wondering how this bill hero is better than other price checking services. A lot of them are completely free, so what is the incentive to pay a subscription fee for the same service?",
            "Does it tell you why the hell your bills so high outside of bad rates?",
            "Yeah same, one person in a 2 bed unit here and my last bill was $300. htf are you managing that in a 4 bed house unless you have solar you are running off most...",
            "There’s 3 of us, 2 permanently at home. House relatively new and well insulated. We rarely switch on AC or heating as not required, good internal temp all year around. We do have gas for cooking and hot water which might make a difference. Nothing else out of the norm and not power conscious at all.",
            "Have you tried living in the dark and not using appliances? I'm sorry but you're just not trying hard enough 😩😩😩",
            "I'm 2 people in a 4 bedroom house. $300 to $350 per quarter.",
            "I’m in a two bedroom apartment, WFH full time, and my wife likes to bake. Most evenings we’re cooking dinner at home with the electric stove/oven.\n\n509 kWh last quarter.",
            "4 br house with 2 people. Usage is under 350 kWH per quarter. Water heater uses gas though.",
            "My bill is $1200 per quarter. And it's 2 adults and 1 child. 1 adult WFH full time. Some quarters it goes to $1500. But it is a 4 bedroom townhouse. My provider is Origin Energy and we don't have any solar panels.",
            "Check your rates?",
            "Origin.",
            "It's not in America though, it's in Sydney",
            "And not turning the light off when you leave the kitchen. That’s the big one",
            "That high hehe",
            "We all have hot water, that's not it. Machine shop around and see if you can get a better rate?",
            "Anecdotally; I once had a very high power bill and my housemate and I found out the squatters next door had broken into our laundry and run an extension cord through a window. They ran an “art gallery” and god knows what else to the tune for $600 in a month 10 years ago.\n\nSo look for extension cables and freeloaders. Best of luck!!",
            "Our hot water is powered by gas we use AGL..",
            "We don’t run the ac on heat at all. We have a couple of heated throws for when we’re on the lounge & we have electric blankets for the beds during winter.\n\nIn summer we run the dry cycle for a couple of hours first thing in the morning & it helps keep the place at a consistent temp throughout the day.",
            "Yes, will do when the current one dies",
            "Is this where you can’t chose suppliers and must use one offered from building management?",
            "Government energy policy allowing suppliers to increase rates and pick subsidies to cover their costs. Most of my life the majority of our power come from coal fired power stations and power bills were never an issue like they are today.",
            "Energy Australia",
            "We were in credit every quarter until mid last year as our solar (it’s only 6.6kw but it is a lot more than we self consume) usually produces a lot more than we need. Then wholesale prices went up and we got bills again.\n\nNot sure what the downvotes mean - I treat energy usage as a hobby so I’m not bullshitting. Haha",
            "Possibly not a lot. It does give you the option to route your bills directly to them and they contact you when there's a better option. \n\nI was using them side by side. The government tool recommended a plan we were not eligible for because we don't have a smart metre. I then built a spreadsheet based on our last bill and plugged in a few of the recommended options and the one BH recommended was the cheapest.",
            "Yea gas hot water removes a chunk of the bill. Electric hot water was $37 for us last month only for two people, one shower a day. So for yours id expect $1k a year",
            "What’s the basix/star energy rating of your build?",
            "Right. I’m stuck in an apartment that probably has a negative insulation value and it’s either run the split system or suffer through 15 degs internal temp. At night I use a column heater",
            "Are you running the aircon 24x7 or something?\n\nI’m with Red Energy, apartment with no solar panels or anything.",
            "That's fucking wild. 2 adults, 1 toddler. Adults wfh 3x a week. I average 400 a quarter. And I play a LOT of videogames.",
            "Ah yes the ol' \"if America is worse it's fine for us here in Aus\" argument 🙄",
            "I’m thinking there’s something weird happening with the hot water heater.",
            "Gas for cooking….?",
            "Most of the time yes, but for me when I moved in they said you have to sign up with them first, then you can change if you want.",
            "Sorry, but you didn't explain how. \n\nIf you're complaining about energy providers shouldn't be getting subsidised while increasing prices I could understand. However if anything the subsidies should increase their margins and reduce the need for CPI, but you're saying the subsidies are causing price increases so I still don't see the link.",
            "Right, will check them out and compare. Thanks!",
            "I mean it balances out in the end. You’ll save on your electricity bill but be spending more on your gas bill.",
            "Not 24/7. But usual usage. We also have washer and dryer thaf runs regularly.",
            "Do you use gas for your hot water and cooking? I can't fathom the power bill being that low otherwise.",
            "Nah, it's the use of 'hella'",
            "Yes, we have gas cooking & hot water. Our gas bill averages $110pq.",
            "I’m not complaining, just saying that we never had these ridiculous power bills for most of my 65 years when our only source of power was coal generated.",
            "Yeah thats it, i notice it alot more now we have eliminated gas completely from our place",
            "All electric cooking.\n\nI’m not sure how the hot water works here, maybe it’s all covered by strata. There’s no tank anywhere in the unit or our garage.\n\nWe also have no A/C and very light usage of heaters.",
            "was that before or after they were privatised by the state government ?",
            "Hot water can comprise a significant chunk of the electricity bill, so that makes sense -- maybe strata puts it on each apartment's quarterly strata fees instead.",
            "Both"
        ]
    }
}