{
    "Weekly r/Tattoos Question/FreeTalk Thread! - June 03, 2024": {
        "title": "Weekly r/Tattoos Question/FreeTalk Thread! - June 03, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/tattoos/comments/1d72ou1/weekly_rtattoos_questionfreetalk_thread_june_03/",
        "content": "***It's question time!***\n\n------------------------------------------------\n\n\n\nPart of our subreddit's recent transformation includes a new weekly discussion thread! Ask any question you'd like, and people from our community will give you their most honest opinions/answers. Please remember that most usual rules apply.\n\n\n\nImportant rules:\n\n------------------------------------------------\n\n\n\n- No **aftercare/medical questions/advice**\n\n- No **pricing questions/advice**\n\n- Please be kind to your fellow tattoo-lovers, and follow [reddiquette](https://www.reddit.com/wiki/reddiquette)\n\n\n\nSome examples of things to ask the community about:\n\n------------------------------------------------\n\n\n\n- Tattoo placement\n\n- Skin tone\n\n- Tattoo subject/style/design\n\n- Recommended tattoo artists in your area\n\n- Pain\n\n- *Anything else you'd like!*\n\n\n\nIf you're asking about your tattoo, please provide an image of the stencil or final tattoo, rather than elaborately describing it in a paragraph. Also, remember that unless a user has a verified flair, their advice *may not* be coming from a history of tattooing.",
        "num_comments": 108,
        "comments": [
            "Hey I’m thinking about getting a tattoo. I’m an autistic male has anyone that’s autistic had tattoos before here? I’m worried about getting overstimulated and melting down or not being able to finish the tattoo. I’m high functioning I’m just scared because I do have a decent amount of sensory issues.",
            "Hi! It might feel out of topic, but I'm an aspiring tattoo artist and was looking for information about how you started. I feel a bit lost. I know that I have to draw, I have a good basis (anatomy and can draw in different styles), and I practice. But I don't know where to start to get a \"book\". Should I draw flash tattoo sketches? Should I explore how to place a tattoo? Should I learn how to draw in American Traditional, Neo Traditional, New School, Black and Grey, Realism, Japanese, Tribal, Script / Lettering, Watercolor, and Geometric tattoo styles? I have no idea.",
            "Any tattoo artist recommendations in Croatia or Albania?",
            "Hi! Have no tattoos but I have an idea of the first one I wanna get, but its not something I've seen before and I think I'd feel more confident in getting it, if I saw how it looked on me. Anyone have advice on the best way to get like a \"test print\" done? I'm totally new to this so dunno if this sounds stupid but I'm looking almost for a sharpie version of it on my body so I can spend a day (or hour) looking at it and seeing if it looks how I want.\n\nAnyone have any leads on how I can do this? More than happy to pay an artist to do this for me, if thats the best recommended path.\n\nThanks!",
            "If there are any tattoo artists in here, has anyone brought an AI generated tattoo to you? If they have, did you tattoo it on them?\n\nMy friends and I were talking about them and we’re pretty divided on it. But none of us are tattoo artists. Just looking for some opinions from artists.",
            "So far I've got one tattoo, wrist/lower arm, all tickety-boo. I'm ready for my next one, I know what I want and that I want it to go on my thigh, above the knee.\nI live in Scandinavia, so it's gonna be warm for the next 3, 4 months,  then shorts and dresses without tights are a no go.\nShould I try to see if someone can get me in in the next month or so, so I can let it breathe as much as possible? Or is it wiser to get it in autumn, so I don't have to cover it when swimming outside? Obviously that will mean fabric covering it pretty much all the time.",
            "Is there actually a big difference between a very expensive tattoo gun and a cheap knock off? I’m asking about the battery powered ones.",
            "Looking for a TRASH POLKA tattoo idea. Thinking a sleeve. I love the song “Demons” by Imagine Dragons and was hoping to capture some imagery and lyrics into the tattoo.",
            "I'm trying to find a fine line tattoo artist and/or baroque painting tattoos in WA/OR. From Seattle to Salem ideally, but im open to further away. I'm having a very difficult time finding exceptional artists for these.I love tattoos of the human figure and florals/animals in particular. Pls help I've been looking for so long",
            "Does anyone know of any tattoo artists near NC who do softer realism? I like the styles of @dorok.tattoo (insta) and @mustafaalakoc_ (insta) but neither of them are even in the US. I haven’t been able to find a tattoo artist with a similar style close to me. So I was just wondering if anyone knew of any? I’m open to traveling a bit it doesn’t have to be in NC. I just don’t want to drive more than like 6 hours or so.",
            "So I'm interested in getting a half sleeve traditional Japanese with a Koi on my upper left arm. I alredy have 2 tattoos on my lower arm that are not trad Japanese. One is a portrait of my dog who passed and the other is sone orchids that wrap around a bit on my forearm. Would these existing tattoos clash with a trad Japanese sleeve on the upper arm?",
            "Does anybody know of an artist with a similar style to Jacob Gordon at Eternal Ink, West Virginia? Particularly anyone in the UK. Love his use of negative space and contrast",
            "I am looking to get a fine line tattoo near Birmingham, AL, does anyone have any artist recommendations? I want to pay for a good tattoo but also do not want something overpriced. This will be my first tattoo.",
            "Does anybody have recommendations for a greyscale artists that's works in realism, in North East united states?  I live in central New York.  I'm hoping to get a forearm sleeve of outterspace.",
            "Is an elbow tattoo a bad idea for a first tattoo? Online or seems that the forearm is the place most beginners get one because of pain tolerance and healing I guess? However there is a cool concept I have seen and it only works on the knee or elbow. Is this a good idea for a first timer?",
            "I have an older tattoo I'm dissatisfied with, and I'd like to spruce it up (turn the triangle into a 20-sided die and add a dragon). Should I send the description to the tattoo artist and let them work out the actual art? Or draw/have it drawn myself and send the ready thing to ask for a quote? I'm not sure what the etiquette is. I have two tattoos, one was an official symbol of a character and the second was a simple triangle.",
            "Hi guys! I really want to get a Sak yant tattoo (traditional Thai tattoo) but I am worried that I will not be able to get it in the area that I want it. I have wanted a twin tiger sak yant on my knee but I cannot find anyone else who has had a similar tattoo and I am not sure if it is allowed because it might be disrespectful to have the tattoo so low on the body. Does anyone know if you can get the twin tiger sak yant on the knee ?",
            "Hey everyone, I need some advice. I want to do my first tattoo, so I am looking for some advice, I am male and want to do a small tattoo to see how i like it. placement would be upper arm or shoulder, where i can keep it hidden in the beginning. Any idea where i can search for motives?",
            "I'm getting a \"chrome effect\" tattoo soon. It will be my first tattoo. Originally, I wanted it done in all navy/dark blue, but the artist does not use blue ink.  They said there are a lot of issues with blue.   They recommended they use black or grey ink.  Which should I choose? Should I say grey and have some black and white ink used for shadows and highlights?",
            "Why are a lot of flash tattoos just random, nonsensical stuff? I like the idea of smaller, simpler tattoos versus bigger more detailed ones but I wouldn't get probably 95% of the flash tattoos I see.",
            "So how do I decide if I should get a specific tattoo?\n\nI’ve never gotten a tattoo, and am thinking of getting one done on the inside of my forearm. But I can’t decide if there is anything worth immortalising on my flesh in my life. \n\nHow do you decide if something is worth being a tattoo?\n\nWhen I asked this question to an irl friend, she said that only one of her tattoos had a meaning, others she got because she liked the design… which didn’t help me at all. \n\nAlso, how painful are forearms to tattoo?",
            "Looking for an artist in the Nashville/Murfreesboro area that has experience doing the embroidery style tattoos. Any recommendations appreciated. 😊",
            "Hey I’m having a hard time finding any shops near me that have the style I’m looking for so I thought I’d take a shot and ask in here. I want to get a small b&w realism godzilla tattoo. I’m looking for shops in the general upper left corner of PA like around Erie, Edinboro, but I’d be willing to travel to the Pittsburgh area if there’s any ones there that have a good realistic style. \n\nAny recs would be insanely appreciated!",
            "Can someone help decide if a tattoo artist is good? I like his portfolio but I'm not sure what to look for. I don't have any experience to know if his line work is good, or shading etc\n\nHe's a newer artist but seems to do really good work",
            "Does anyone know the meaning behind the tattoo *(•••) my friend saw it on someone’s forehead and google didn’t have an answer so I’m curious.",
            "Is getting the same tattoo in the same placement as someone else frowned upon?? I saw an influencer post on their public story about how they’re annoyed someone got the Berserk mark in the same placement as they did, but you can’t copyright an area on your body so like what 😭 What is the general feeling about that??",
            "[removed]",
            "I have a question and I don't mean it to be rude or to upset anyone. I've been wondering this for a long time. Why do people get so many tattoos now days? They look great when you get them but when you get old, you're gonna still have them and they're going to be faded and wrinkled.",
            "Hi! Could anyone tell me what the style in the link below is called? Thanks in advance.\n\n[4 TATTOO DESIGNS](https://imgur.com/a/Z8fuAnf)",
            "I’m looking for tattoo ideas. I have a long and thin scar on my stomach below my belly button. I want to get a humorous tattoo, but I don’t know what to get. \n\nI have a big fat stomach lol and I hate that scar, I wanna get a funny tattoo there.",
            "If you have a spine tattoo along with other tattoos, how would you compare pain levels to those other tattoos? For reference, I have ink on both feet (covering the ankle bones) and a multi-session shoulder blade piece and both of those were generally fine, but I’ve also heard horror stories about spine placements before.",
            "Hi guys, \n\nFor people who have geometric, fine line tattoos, \n\n  \nHow well do they hold up with time",
            "hi all! thinking about getting a very small and simple tattoo on my rib, but I’m also in the process of losing a significant amount of weight (planning over 100 lbs). has anyone had experience and would know if the tattoo would hold up well after weight loss?",
            "Totally new to this sub/group\nhow do i go about posting tatoos\nI recently had done? Im sorry im\na newb 😂",
            "[removed]",
            "[removed]",
            "people with NECK/UPPER CHEST TATTOOS, did you find yourself having to change your jewelry/clothing styles at all to not have it clash with the tattoo? I have smaller tattoos (mostly 2”-4”) on my arms, legs, and back as well as little stuff on my hands but I’ve been wanting to get a tattoo on my upper chest/back around my neck, loosely based on an actual large collar-shaped necklace I have. I’ve been experimenting with wearing it under different clothing than I would normally pair it with to see if I still like having that shape with different necklines and I’ve found that I do still love how it looks under a slightly open button up shirt or a t shirt which are honestly the most common necklines I wear. the design would be all black with mostly finer lines (nothing thicker than a millimeter) but would extend several inches down my chest from the base of my neck and taper symmetrical up and around the back of my neck. I only have black tattoos rn because I like to wear a lot of bright colors and I don’t want to worry about the tattoo colors clashing with my outfits or jewelry, and I’m hoping that will still be true for this chest piece. but I am wondering if getting it will make me stop wearing necklaces I love since they would be laying on top of this intricate black design. does anyone who has tattoos in this area have thoughts on this? once it healed/you got used to it did you feel like it “faded” from prominence when you look at it enough to be able to wear big necklaces on top of it, or does the shape of a big necklace look bad to you on top of the tattoo?",
            "I’m looking for a tattoo artist in the Baton Rouge area. I want to get a teddy bear with red roses behind/around it on my forearm. I’d say medium sized at most. Not sure on style but leaning toward color realism or perhaps illustrative. Willing to travel a little as this will be my last. Advice, please?",
            "Hi! So I'm looking to get a fine line/minimalist tattoo and was debating where to get it. I'm abroad right now, and was thinking about going to Astrid and Miyu. I'm hesitant because it's a chain. I just can't find any artists in the area where I'm staying who do fine-line and have openings within the next month. Should I just wait and go to an artist at home, or is going to a place like Astrid and Miyu fine?",
            "I was thinking about getting 4 Japanese characters on my inner forearm. I was just wondering how tall the should be and what orientation works the best for them. I'm 18, so growing might still happen.\n\nnote:(the characters mean: red blue)",
            "[removed]",
            "just got a tattoo a couple weeks ago of some orchid flowers that covers pretty much my entire inner forearm and now, i'm thinking about filling out the entire half sleeve (1 continuous piece rather than a bunch of random smaller ones). how do you decide if a style would flow well with your current tattoos?",
            "I live in Westminster, Colorado and I was wondering if anyone had any artists to recommend. I've got 3 tattoos I definitely want done but I want them to be super dark and decrepit. 1 of the 3 is of Heilung, so a good artist that can tattoo people is also welcome. Any dark artists out there?",
            "Hello all, i got a tattoo a few years ago. At that time i was into text tattoos but this is something i have come to regret. Now i wanted to do a cover up with some black/gray design. So my question is that since the letters i want to cover up is quite dark and thick lines, how hard would it be to cover up something like that ? Would i be able to see it trough the new design ? Most good coverups i have sen was originally old faded out tattoos. Thanks",
            "Just a quick question, more for artists..  Is it a dick move to ask your artist to see what ideas they have drawn up for before your appointment day?\n\nAppointment scheduled for Saturday, was gonna ask the artist if I could see any ideas she  had  drawn up... To see if they captured what I described to her \n\n\nI have been to this artist multiple times, she's just always nailed what I wanted... This idea had alot of pieces to it and I'm hoping it will come together nicely...\n\nThanks in advance",
            "[removed]",
            "I can tell you next week once I've gotten my first. I'm a bit scared but well, it can't be worse pain than the bad sickness I had last year",
            "i am autistic and have a good amount of tattoos all over my body! i will say, some spots really overstimulated me, i would make sure to talk to your artist beforehand and tell them about your concerns, i just take breaks when it’s overstimulating to cry and move around, then try to gather myself back to the chair, i would bring headphones and entertainment too, that also has helped me in the past!",
            "OMG I have the same question +1 😭",
            "I’ve had some work done and was good, my tattooist allows me to listen to music/podcasts or watch shows on my headphones. I find that if I get into my thing it’s really easy to basically detach from getting the work done.",
            "i mean you can ask them to draw it up and put a stencil on you, that’s probably as close as it will get, the stencil won’t show and shading or color if that’s what you’re looking for",
            "90% of my tattoos are on my legs and I’ve personally got them at all times of the year. At the end of the day it’s really just going to come down to your personal preference. You’ll want to avoid excessive sun exposure and swimming for at least 4-6 weeks until you can put sunscreen on it, so if you have a lot of outdoor plans this summer and want to wear shorts, then it’d probably be better to wait until autumn.",
            "There's definitely something to be said for being able to be comfortable in shorts or a skirt while it's healing (and to not be freezing!), however you have the sun factor to deal with. It will definitely hurt in the sun (like a bad sunburn) for the first two weeks or so, and you shouldn't really put sunscreen on for the first few weeks. \n\nI've gotten most of my legs/torso done in the winter or early spring. While the clothing can irritate it, for sure, I don't really have to worry about any other factors (sun, swimming). But I try to wear dresses/roomy pants and never jeans or tight pants while it's healing, for at least 2 weeks because it can be painful.\n\nI think it comes down to preference. Imo neither is necessarily \"better\", but whichever fits your lifestyle best.",
            "Depends on how well you know yourself and your pain tolerance. I super can't handle things like stubbing my toe or getting a papercut, so I knew from that start that joints are a no-go for me. If you think you can endure the pain, go for it!",
            "Cause other people do want those things",
            "I only have two tattoos (planning on many more) so take this with a grain of salt, but that reponse from your friend seems kinda fair. For me, I just know I want tattoos, so getting the first one that had meaning just kinda broke the seal and now I’m already much less selective because I just want more. I’d say try to decide on something, then just wait. If you still like it after months have passed, you’re on the right track. I’ve had ideas come and go and I’m thankful I didn’t book them when I thought of it.\n\nForearm wasn’t bad for me, I just got my second on the underside of my forearm",
            "got my inner forearm done recently (first tattoo) and the pain is super manageable. it was like a 4-5 hour session and the last hour was kinda tough cuz the skin at that point is super tender so every wipe feels kinda abrasive, but even then, it's not thaaat bad. the first couple hours are a piece of cake (like a 2-3/10 pain scale). the most it got up to was like a 4 or 5. i think it's more of the length of time that you feel pain rather than the severity of the pain. you'll be fine",
            "I doubt they are the first to do it anyways. Who cares, do what you want :)",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Sure, but I’ll be wrinkly too! Might as well have some pretty artwork along with the wrinkles.",
            "People go on and on about how looks fade, you get ugly either way when you get older etc. So who gives a shit, really... I don't mind.",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "My advice if you only want to get your inner forearm done is to do just one character, this will allow to fit it nicely and help you get a more cohesive and nice full sleeve piece in the future. In my opinion doing four characters on a forearm would be too crowded. Just my opinion. Cheers!",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Thanks that would be great!",
            "Right on! I appreciate the your response! I will definitely keep that in mind!",
            "Sounds good!",
            "Thank you for taking the time to answer. Did you have any issues with clothing constantly rubbing at it?",
            "I don't own jeans but I'm pretty dependant on workout clothes. Also anything past end of August will mean I'd be wearing tights every single day. So it is soft fabric, not like jeans, but definitely tight.\nGoing without pants in Scandinavia during the fall/winter is not an option 😂",
            "I have seen myself to have a high pain tolerance as I have had Crohn's for 14 years however I have no idea what tattoos feel like.",
            "It all makes sense now, thank you ☺️",
            "I have something in mind that I’ve liked for 14 years now, so I guess that I wouldn’t regret it. \n\nI might just book an appointment in the winter, when everything is a bit less sweaty. I really like the idea of getting a tattoo tho",
            "Hi, just wanna tell you that I didn't get it done because I caught a cold. In case you were waiting",
            "I feel that. I live in sweatpants mostly lol I'm literally freezing from October to May haha",
            "It's like getting prickled by a needle while sewing except the needle is attached to a machine gun. To me it hurts like hell. Results are worth it tho.",
            "Yeah, that seems safe enough! I’m doing the same, I don’t want to have to worry about being out in the sun during the summer so I’m gonna get tattooed when it’s colder and I can wear layers. \n\nBest of luck!",
            "Thank you! I hope you feel better soon and can get your tattoo!",
            "We got like two feet of snow in April this year, so unless you want your bits to freeze off, you want to have some coverage 😆",
            "Ty, you too"
        ]
    },
    "Weekly r/Tattoos Question/FreeTalk Thread! - June 17, 2024": {
        "title": "Weekly r/Tattoos Question/FreeTalk Thread! - June 17, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/tattoos/comments/1dhwcaq/weekly_rtattoos_questionfreetalk_thread_june_17/",
        "content": "***It's question time!***\n\n------------------------------------------------\n\n\n\nPart of our subreddit's recent transformation includes a new weekly discussion thread! Ask any question you'd like, and people from our community will give you their most honest opinions/answers. Please remember that most usual rules apply.\n\n\n\nImportant rules:\n\n------------------------------------------------\n\n\n\n- No **aftercare/medical questions/advice**\n\n- No **pricing questions/advice**\n\n- Please be kind to your fellow tattoo-lovers, and follow [reddiquette](https://www.reddit.com/wiki/reddiquette)\n\n\n\nSome examples of things to ask the community about:\n\n------------------------------------------------\n\n\n\n- Tattoo placement\n\n- Skin tone\n\n- Tattoo subject/style/design\n\n- Recommended tattoo artists in your area\n\n- Pain\n\n- *Anything else you'd like!*\n\n\n\nIf you're asking about your tattoo, please provide an image of the stencil or final tattoo, rather than elaborately describing it in a paragraph. Also, remember that unless a user has a verified flair, their advice *may not* be coming from a history of tattooing.",
        "num_comments": 52,
        "comments": [
            "Hi, first post on Reddit 🥴 \nI’m getting my third tattoo done, it’s two olive branches around my knee. How painful are tattoos in this area? I’ve had two very intricate ones done on my calf and the pain was bearable but I’m just wandering how painful a tattoo will be around my knee?",
            "Hi babes! Wanting to get my first tatt and looking for advice on how to find a good artist. I'm wanting one along my inner forearm that's decently good sized, so should I jump straight in and go for it? Or do a small tatt as my first? If you have any recs around OKC I'd love to hear!",
            "Hi All! I'm looking for a good traditional artist / fine line artist in Bali Indonesia. I see a ton of tattoo studios, but every studio has a ton of different artists with different art styles. Any help is welcome!",
            "Hi everyone, I want to get my first tattoo done, but I'm unsure about the placement. The motive I want is a slightly modified version of this illustration\n\n[https://victorianweb.org/art/illustration/sullivan/69.jpg](https://victorianweb.org/art/illustration/sullivan/69.jpg)\n\nFor the placement I wanted my upper left arm and center the image right smack in the middle there. But I think that it is to big for my arm (circumference \\~ 32cm / 12.6 inches). The modifications to the image are mostly small things around the hourglass and the snakes body vertically elongating the whole image slightly.\n\nHas anyone done something similar in terms of size and placement?\n\nAnd the second question, how do you prepare individual images for a halve/full sleeve. If were to get the image above on my arm, how do I plan for the next bigger images or backdrops? Is that just an artist thing or are there good resources to look at?",
            "So I'm getting [this](https://imgur.com/a/M0CXJgH) on my shoulder later today, and I don't know how long it'll take. How long does it usually take for words to be tattooed? This is literally my first tattoo and everyone keeps asking me how long it'll take for me to get it done, but I don't know. (The \"2)\" isn't going to be part of the tattoo, just the words in black)",
            "I desperately want finger tattoos, but for obvious reasons, I can’t bring myself to get them…yet. Does anyone know or recommend decent tattoo pens to draw on temporary tattoos?",
            "Hi everyone. Hope you can help me out. What style of tattoo is [THIS](https://www.instagram.com/p/Condl3kso-D/?utm_source=ig_web_copy_link)\n\nReally want to either get a second sleeve or big leg piece in this style.",
            "Any recommendations for good tattoo artists in Phoenix Arizona?",
            "Hello there! \nI've been tattooing as a hobby for a few years, but mostly basic stuff. A friend wanted to do an armband, which by itself is no big deal (the design to do is simple enough), but for the life of me, I can't get the stencil to line up perfectly... How do you, more experienced people do?\n If it helps, the width of the design is 8cm, top forearm measure is 27 and bottom is 22. \nThe design is just triangles, one up, one down and so on.\nThanks in advance for any help!!",
            "Anyone know any tattoo artists with designs that are very reminiscent of like 80s metal show flyer art? Like sorta zombie/demon maybe a little creepy gorey tattoos? Big horror and metal fan and got my first tatt which sorta is in line with that style. Much thanks to any help!",
            "Debating on getting a big botanical and fauna piece on my left arm - love the artist and her work. But am currently seriously more active than previously so expecting a degree of bulking up (have already changed ~15kg in the past two years).\n\nAlternatively looking at a smaller piece for my leg from a different artist who lives a short flight away.",
            "My spouse has been looking for an artist that can do designs similar to these. [https://imgur.com/a/6dR5xkw](https://imgur.com/a/6dR5xkw) but so far every artist she has found has been out of country. Any western US artists that do similar styles?",
            "Hi all! I have an appointment for July 9 for a tattoo touch up. This tattoo is on my thigh above my knee and in the summertime I tend to get photo-dermatitis on the tattoo. It just started flaring up and I have a lake trip coming up next weekend. I want to cover the area from the sun until my appointment so I was wondering if anyone had any recommendations of something to cover it that’s also waterproof? Thanks!",
            "So I made an illustration a long time ago and was thinking i'll get something like that tattooed on my forearm. Are there any Al tools or websites that can convert drawings or illustrations to something more tattooable? 🩵",
            "I want to get a mouth with teeth around my knee and an eyeball inside it. However this would be my first tattoo. I consider myself to have a decent pain tolerance but have no idea what a tattoo feels like. I expect it to hurt anywhere but is it insane to get a first tattoo on the knee? For those who have done this how bad is it?",
            "Hi All\n\nJust one simple question!\n\nI know its probably common for you all to hear people asking about pain. But I'm pretty sensitive but REALLY want to get it done. \nHow bad is the pain? (especially around the wrist/forearm. The top side)",
            "Feel kinda dumb for having to ask this considering I already have 5 tattoos...\n\nWhat's the best way to find an artist for the specific thing you want tattooed, if you aren't doing what I did for 4 out of my 5 tattoos and showing up for your appointment with a picture of the exact thing you want inked that you found online or had a friend write?\n\nContext: I want a horse tattoo to commemorate my \"heart horse\" who passed several years ago...like I want it to look like him, not a more generic tribute to him. I've spent like 5 years periodically searching the internet to find what I want, and 99% of what I've seen I find either super tacky, or is nice but not what I'm looking for. Looking up different tattoo artists in my city on their IG I have yet to find anyone who's done a horse tattoo, let alone one I like the style of. Most animal tattoos done are cats, dogs, wild animals like lions, etc.\n\nI'm nervous of doing something to piss off a tattoo artist (think pet peeves) without realizing it's a faux-pas. Like is it a faux-pas to message an artist asking if they know of any artist in the city who'd be good to do a horse tattoo? or is that in poor form? What happens if I think I've found someone, they sketch something out for me and I realize it's really not what I'm looking for, wrong style, etc....is it bad to tell them that and back out, or is that wasting time? \n\n  \nMaybe I'm thinking too far into this? haha",
            "I’m thinking about my next tattoo design and i’m leaning towards greek mythology. Is that appropriate for a tattoo or is it iffy with culture? I have researched a lot and i just want a persons opinion on this one as well. :)",
            "Does anyone have advice for orientation of inner bicep tattoos? This is a bare area of my left arm that I'd like to explore getting tattooed, but I'm not sure about placement for this area. Should I be aiming to have something that's right-side-up when holding my arm up, as if to flex? For example, a sick-ass panther or other long animal? Or should it be more like other arm tattoos that are right-side-up when my arm is at rest, even though it won't really be visible without me lifting my arm? I know it's ultimately up to me and my artist, but I wanted to get the thoughts of some other tattooers/tattooees as well. Have a great day!",
            "Getting line work done on a large forearm piece on Jun 30th, then going to Disney, Universal Studios, and a water park with family on July 3rd. How should I protect it, especially in the water?",
            "Can I get a 5/6 inch black and white tat at noon and go to work at 6? It’s a floral design. I emailed my artist, but haven’t received response yet, and my boss needs to know if I can work ASAP. In your experience, how long do these things take?",
            "Has anyone gotten a cuneiform tattoo? Is there anything in particular to consider?",
            "Wanting to get my first tattoo, I really want a design from a specific tattoo artist, but this artist lives in another country (Arang). Is it acceptable to use a picture of this artists design and ask local artists if they can copy it?",
            "Hello! I'm getting my fourth tattoo in July and am still struggling with deciding placement. It's meant to be a medium sized Medusa tattoo, and originally I was thinking back tricep but my trainer told me that as I lose or gain weight or muscle, the tattoo will likely warp and suggested forearm or lower back instead. I'm not too keen on either of those suggestions.\n\nAll my tattoos so far are easily hidden because I work a corporate job in Singapore and while the culture is getting more liberal, it can sometimes still be quite frowned upon in a corporate setting. I have one on the back of my neck, a small one on my bicep and a large one on my ribs.\n\nAny ideas would be helpful! I was pretty set on the back tricep but am now heavily rethinking the placement.",
            "Hey everyone,\n\nI have two tattoos on my shoulder that I want to combine but unsure exactly how to do that. I thought using an Al might be a good idea. Does anybody know of an app where I could just upload a picture of my tattooed shoulder and have Al finish it for me?\n\nThanks!",
            "What do you wear to an appointment when you’re getting your actually boob tattooed?!",
            "Hi there everyone! I recently had an Icarus piece done on my back that I am not completely in love with. I was unhappy with the feet the first session and went back to extend Icarus’ cloak to cover them, but ended up disliking the tattoo more. I love the head, wings, and torso, but am looking to get the bottom part covered up. However, I am not sure what to get it covered with so as not to ruin the look of the piece. I live in Pittsburgh and would be getting it done by @markalbertattoo on instagram for style reference, and would like to get the gothic ecclesiastical style incorporated somehow. Anyone have any ideas? Here is a [picture of the tattoo.](https://share.icloud.com/photos/00aT6oTh4M0RgvbVJZII5yn1Q)",
            "Is it likely that I can get a tattoo on the bottom of my foot, with the knowledge that it will fade and intent for it to fade?  I want a small (around 2cm square), simple design on the sole of my foot, with the expectation that it would be noticeably faded after 6 weeks, & probably gone or unrecognisable within 6 months. Is it likely an artist would do this for me if I explained my situation.?",
            "[removed]",
            "I’ve found all of my artists through Instagram. Generally searching “tattoo shops in *location* Instagram” will pull up a bunch, and then you just start sorting through to find styles you like and doing deeper dives into the artist.\nI have a piece on my forearm that was practically painless, as long as you stay away from the wrist and crook of the elbow.",
            "[removed]",
            "Hello! I went to Bali and spontaneously got a pretty big (for me) tattoo on my ribs. I went to Two Guns, you can liaise with them via IG DM and I felt they were so professional and the work was great. They have a bunch of artists you can choose from based on their portfolio. Out of all the studios that I researched, I really liked them the best. No regrets, my tattoo healed amazingly!",
            "I would say that the design you share is too wide to be placed in an arm nicely, I see something on those dimensions fitting on the back or chest, though I will give a nice artist you love their portfolio, artistic freedom to alter the concept and give you some rad inspired design.\n\nSpeaking as a tattoo artist assistant/ husband that spends Monday to Friday listening to tattooists complaining, I would say that the best you can do to your artist and to yourself is to hand them a pdf of some kind containing references going from the concept (words, feelings) to visual references other than other tattoos that compile what you like about your ideas but mainly give them artistic freedom to create something in their style. My advice is to look for an artist you love their portfolio.",
            "inkbox has some! i’ve never used the pens specifically but they stain and i would assume stay for a while like pre designed tattoos. :))",
            "Read the tags",
            "I would tell your friend to really think about that design choice, because I receive multiple clientes every month with bands wanting to cover them up (one of the most difficult cover ups) and because you say it is a hobby and you just do basic stuff. Please try to re think on something more on the kind of work you like to do the most and something that could be easily cover up or removed in case it ends up looking bad. No offense, just trying to be reasonable.",
            "Greek mythology tattoos are actually very popular right now. I’ve seen lots of Zeus, Poseidon, Medusa and (especially on this subreddit) attempts at Icarus lately. No one will bat an eye if you get something like this, Greek myths have been treated as part of the general Western canon since the Renaissance.",
            "Right side up when your arm is resting at your side is the only answer. You will see it just fine",
            "I would wear a UV long sleeve shirt and stay out of the water.  Definitely no soaking",
            "Don’t work or reschedule the tattoo. Too many variables.",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Right on! Thanks for that. Appreciate the help",
            "Well shit. Foiled by my lack of SM experience once again. \n\nThanks.",
            "Thank you! I just wanted to see what fellow tattoo people would say :) I’m thinking of getting Apollo somehow, not sure about the design yet !"
        ]
    },
    "Mr Burns by Billy Tanos at iimmerse tattoo Brisbane AUS": {
        "title": "Mr Burns by Billy Tanos at iimmerse tattoo Brisbane AUS",
        "score": 1729,
        "url": "https://www.reddit.com/gallery/1dlhk7y",
        "content": "",
        "num_comments": 142,
        "comments": [
            "Thank you for the submission, iimmerseta2! Please make sure your post follows the guidelines found in the sidebar, or it will be removed. If you're asking a question, please delete your post and ask in the pinned Weekly Discussion thread.\n\n###Users, please report any comments that break rules, such as ANY comments on personal appearance (both insults and compliments), promotion, or unnecessary rude judgment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Release the hounds.",
            "Whats the tan thing in the middle?",
            "[removed]",
            "I really like the vest.",
            "It looks like he has a giant member.  Maybe two.",
            "The Pit Vipers are a phenomenal touch",
            "I also have a mr. Burns tattoo. Its him glowing green in the white robe walking out of the woods saying i bring you love. Got it at a covention. Wish i remembered the artists name.",
            "All the uncultured swine in these comments, its his vest! Made of real gorilla chest! He is not clutching onto 2 big cocks 🤦🏼‍♀️\n\nEdit: sick tat, op",
            "I didn't notice his head tattoo until the third slide, was too focused on the pit vipers.",
            "This is a masterpiece. So well done and hilarious!",
            "Riff Raff x Mr Burns",
            "“No they’re saying ‘Boo-rns Boo-rns’”",
            "The vest looks like it ejaculates",
            "Absolutely love this. Genuinely surprised at the amount of people who don't immediately get the gorilla chest! Surely one of Mr Burns' most iconic moments in The Simpsons",
            "I'm not a Simpson's fan but this is a really well done tattoo",
            "Excellent",
            "As long as Furious George is still ok.",
            "M R .  S N R U B",
            "Nice cock bro",
            "This is visually stunning!  I love the colors and the shading.\n\nI don’t understand what he is clutching with his hand…   Looks like two enormous cocks but I’m guessing that’s not what they are.\n\nEither way that adds to the tat because it keeps peeps wondering",
            "Ohhhhhh. He's got a gorilla chest... and not holding girthy smooth-headed dicks.",
            "Is it just me, or is there a pair of peniss?",
            "What's going on here?",
            "This is the best tattoo I have ever seen.",
            "Release the hounds",
            "That is some impressive line work! Really really really well do tattoo",
            "Man, people are weird. What kind of cocks would those even be? \n\nI LOVE this tattoo. Original, colorful, and perfectly cromulent. \n\nMy only question is the initials on his fingers. RPH? RTH?",
            "Idk if I get but i definitely don’t hate it",
            "Really cool dude",
            "This is fuckin dope 🔥🔥🔥🔥",
            "you’re a fucking legend mate i’d get a bender tattoo from you",
            "2 giant shlongs",
            "What is Mr burns hugging?",
            "Bruns looks great but why is he hugging 2 white d**KS?",
            "Why his chest look like two poorly drawn dicks",
            "This tattoo is epic.",
            "This is fucking bad ass!!",
            "This is fucking outstanding.",
            "All I see is him hugging a giant split in half dick!",
            "He’s holding 2 dicks",
            "I'm so confused by this... why is he holding rocks to his chest?",
            "First thought was two penises. Maybe or maybe not...",
            "This is one of the best tattoos I've ever seen.",
            "[removed]",
            "See My Vest (synth/outrun remix)?\nYes",
            "Do you have 2 Mr burns tattoos?",
            "I absolutely love how the tattoos were done in blue and then the blast over of yellow turned them green. Your artist is unreal and very detail oriented. Love the colour theory.",
            "Is he a ninja turtle what the fuck ????",
            "Done well but makes zero sense I hate it",
            "Not here for jokes can someone actually explain what the hell this is?",
            "This guy is gonna show people his tattoo and no one will understand it. He will constantly get “what is that he is holding and what is that weird colored slide thing in front of him with the monkey face on it?” It’s so bizzare",
            "Mr Dick Holder",
            "This is fantastic",
            "Don't mind me, I'll just be standing around",
            "Moooocaaaasines saltarines con la piel de dos mastines",
            "Unironically hard as fuck",
            "That’s definitely two dicks.",
            "The style and technique is amazing really. It looks very good. But those 2 cocks in in the middle look off. Apparently it's his chest maybe a touchup where it gets more defined with some abs and shading so it's more clear what it's supposed to be.",
            "The full ensemble from the song would have made more sense than just one random piece.",
            "Lamentable",
            "The finger bangers are upside down",
            "P you yy yo. u",
            "On my hand please.",
            "It’s a nicely done tattoo but…. why\n\nLike why",
            "Real gorilla chest",
            "It’s a vest",
            "Wait till you see the loafers",
            "Are you implying that you cannot see his vest????",
            "Couple penises or more specifically peni",
            "Hugging a couple of dicks.",
            "Two cocks",
            "sorta looks like two...umm",
            "[removed]",
            "Not two weenies",
            "this was my initial interpretation too and i still am not sure what they’re supposed to be",
            "That's what I saw too 😆.",
            "Can’t unsee it now.",
            "Yeah, shoulda thought that one through",
            "“Yeah, I gathered that”",
            "Be my guest",
            "I literally just texted this to my boyfriend in the other room. I said I’m sorry but like… right??",
            "[reminded me of this](https://i.imgur.com/JwtN6T9.jpeg)",
            "That's what did it for me.",
            "“It’s bringing love don’t let it get away!”\n“Break its legs!”",
            "You need to be there for every time someone asks this person about the dicks.",
            "But would you want a tattoo where you’re constantly wondering if people get it or they think you have 2 giant dicks on your skin?",
            "I was saying boo-urns.",
            "Regardless of the reference, it looks like two dicks at a glance. Genuinely surprised at the amount of people that don’t comprehend that.",
            "[See my vest!](https://youtu.be/TyWVaZsUQjc?si=USYgvbZ3qdZq5a10)",
            "RTH\n\nRelease The Hounds",
            "That's not his body, he's wearing a gorilla chest vest. I'd say look up the song, but first I warn you - it's catchy AF.\n \"Mr Burns, See My Vest\"",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Because it’s sick as fuck.",
            "Feel this sweater, there's no better than authentic Irish setter",
            "I really like the vest",
            "It looks like... not that",
            "Made from real gorilla chest",
            "Former gophers?",
            "My childhood just came back to me.",
            "See his vest!!!!!!!",
            "That's what I was thinking",
            "first thing that came to mind",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "Real gorilla chest!",
            "Is that not what it's supposed to be?? I don't watch the Simpsons... but that is Mr Burns hugging two penises.\n\nAnd it's REALLY well done, minus some detail and depth on the penises.",
            "Of course lol. Thank you! I suppose I won’t release the Richard Simmons bot on you…for now",
            "See this hat, twas my cat!",
            "That’s two ….",
            "Grizzly bear underwear",
            "It was that or skin my chauffeurs!",
            "See my vest!",
            "My partner, who loves the simpsons, has informed me that it is indeed the gorilla thing everyone is talking about but he doesn’t think it translates well as a tattoo. He said the concept is cool, but it just doesn’t work for a tat. Which as someone who doesn’t watch the simpsons, I agree.\n\nThat said, I hope the OP likes it! And most simpsons fans like it so go off!",
            "Evening wear, vampire bat",
            "But a greyhound fur tuxedo would be best!",
            "Pretty much exactly what I thought as someone who has seen the episode. Great tattoo, great work, great design on its own, but doesn't read well as a tattoo.",
            "These white slippers were albino African endangered rhino",
            "Grizzly bear underwear",
            "Dont forget the loafers that were gophers!",
            "Turtles’ necks I have my share",
            "See my loafers, former gophers!",
            "Beret of poodle",
            "It was that or skin my chauffeurs!",
            "On my noodle it shall rest"
        ]
    },
    "New addition by inkzuko at ad infitum in Bochum, Germany.": {
        "title": "New addition by inkzuko at ad infitum in Bochum, Germany.",
        "score": 88,
        "url": "https://i.redd.it/p8g6rbnxz38d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Thank you for the submission, FishermanComplete791! Please make sure your post follows the guidelines found in the sidebar, or it will be removed. If you're asking a question, please delete your post and ask in the pinned Weekly Discussion thread.\n\n###Users, please report any comments that break rules, such as ANY comments on personal appearance (both insults and compliments), promotion, or unnecessary rude judgment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "This is beautiful! Very nice piece",
            "The saw is the law!",
            "I like this one!",
            "The detail on this is amazing! Great work",
            "Thank you :)",
            "Always glad someone recognises it, that’s what’s up😎🤘",
            "All probs to the artist, inkzuko!",
            "I always find it kinda funny when i hear that song cause I know the area they grew up in, and its like.. not like that at all. \n\nThey are from like 10 mins outside of the 3rd largest city in tennessee, where all the farm land in the area still is.",
            "That’s interesting, I am curious, what about the depiction of The Valley? It’s a very vivid atmosphere that Phil paints there, it’s probably all quite subjective. I always related more towards their more personal side of lyrics instead of the „deep south pathos“ leaning side"
        ]
    },
    "Peonies by Yuuz, guest spot at NonSeoul in Los Angeles, CA": {
        "title": "Peonies by Yuuz, guest spot at NonSeoul in Los Angeles, CA",
        "score": 273,
        "url": "https://i.redd.it/9euyomwvo18d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Thank you for the submission, Ohheyboo2! Please make sure your post follows the guidelines found in the sidebar, or it will be removed. If you're asking a question, please delete your post and ask in the pinned Weekly Discussion thread.\n\n###Users, please report any comments that break rules, such as ANY comments on personal appearance (both insults and compliments), promotion, or unnecessary rude judgment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "I like the strong colors",
            "5,000 dollars probably ",
            "[removed]",
            "Did that tickle?",
            "I always wonder if he gets bored drawing the same peony.",
            "Your comment has been removed because your account is too new. Your account needs to be one month old before you're allowed to post/comment. \n\n**Do not message the mods asking for your post to be approved, your request will be ignored.** Thanks for understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*",
            "I get what you're saying, as I have a full side tattoo but that area there sucks, feels like electric shocks across the ribs. My flank tickled like fuck though because I'm ticklish and I struggled a lot to stay still. Many years later I can't bring myself to get the tat filled in with designs I had in mind as part of a larger design.",
            "Probably not. They aren't licked on by kittens. Probably sucked.",
            "Thank you."
        ]
    }
}