{
    "Megathread Hub": {
        "title": "Megathread Hub",
        "score": 506,
        "url": "https://www.reddit.com/r/TaylorSwift/comments/14sl7a7/megathread_hub/",
        "content": "Welcome to the megathread to rule all the megathreads! Please use this post to discover all of our active megathreads.\n\n# The Eras Tour Megathreads\n\n**Current Show**\n\n* [London, England (UK)](https://www.reddit.com/r/TaylorSwift/s/MfsVrJTaVH)\n\n**Regional Megathreads**\n\n* [UK & Ireland](https://www.reddit.com/r/TaylorSwift/s/rFUJhbd9GQ)\n* [Europe](https://www.reddit.com/r/TaylorSwift/s/b5sYtLfqVD)\n* [North America (2024)](https://new.reddit.com/r/TaylorSwift/comments/1cneldt/the_eras_tour_north_american_2024_megathread/)\n\n**General The Eras Tour Megathreads**\n\n* [Tour Discussion](https://www.reddit.com/r/TaylorSwift/comments/1cnevug/the_eras_tour_discussion_thread/?sort=new)\n* [A View From Swifties Seats](https://www.reddit.com/r/TaylorSwift/s/D71mrCd5fW)\n* [Fan Outfits, Costumes, and Bracelets](https://www.reddit.com/r/TaylorSwift/comments/1cnesy2/fan_outfits_costumes_and_bracelets_megathread/)\n* [The Eras Tour (Taylor's Version) Megathread](https://www.reddit.com/r/TaylorSwift/s/GumCft3F3o)\n\n**Ticket Trade & Resale Megathreads**\n\n* [Ticket Trade Thread](https://new.reddit.com/r/TaylorSwift/comments/1cs3rfv/taylor_swift_eras_tour_trade_megathread/?sort=new)\n* [Ticket Resale Thread](https://new.reddit.com/r/TaylorSwift/comments/1cs3qva/taylor_swift_eras_tour_resale_megathread/?sort=new)\n\n**Songs, Setlist & Outfit Details**\n\n* [The Eras II Tour Main Setlist](https://open.spotify.com/playlist/7BQP9iGgEdY8rGzkvaiEOb)\n* [The Eras I Tour Main Setlist](https://open.spotify.com/playlist/611cd0RuTRvnJN2qDXC1t5)\n* [Surprise Songs](https://open.spotify.com/playlist/2QoBnrCoYFoU3Pyl4gGmjL)\n* [Unplayed Songs](https://open.spotify.com/playlist/1HGzXD4YsewiU7rFWJZ3Wt?si=373dc5499bc14ee7)\n* [Setlist Spreadsheet](https://docs.google.com/spreadsheets/d/e/2PACX-1vSbpOLgnmNTCADiUalKW_SnfMBcxeixvolce_k6iO9EYgXT_nFpl1VAUbQJGpXff5AkivyUrPahJL3N/pubhtml)\n* [Outfit Tracker](https://docs.google.com/spreadsheets/d/e/2PACX-1vQnrx6YFAPuhBd6mWhlzqLDcuc2pXy4HPO_IdyC-BdXDZ-ukog4KrqyDO2bGYmJfD2zyMfMHXQuqnja/pubhtml)\n\n# General Megathreads\n\n* [Theory Thread](https://www.reddit.com/r/TaylorSwift/s/Jewuhp6NVs)\n* [General Discussion](https://new.reddit.com/r/TaylorSwift/comments/1dc8e7u/general_discussion_thread/)\n* [AMA with Rolling Stones Rob Sheffield!](https://www.reddit.com/r/TaylorSwift/s/zKmj2khwsS)\n* [The Tortured Poets Department Discussion](https://www.reddit.com/r/TaylorSwift/comments/1c7magd/the_tortured_poets_department_megathread/)",
        "num_comments": 0,
        "comments": []
    },
    "The Eras Tour Megathread: London, England": {
        "title": "The Eras Tour Megathread: London, England",
        "score": 110,
        "url": "https://www.reddit.com/r/TaylorSwift/comments/1dk71a0/the_eras_tour_megathread_london_england/",
        "content": "NO SALES OR ISO! YOU WILL BE BANNED\n\n[Main Setlist Playlist NEW](https://open.spotify.com/playlist/7BQP9iGgEdY8rGzkvaiEOb?si=4ee4d96f7be54877&nd=1&dlsi=aa48c3e6218b4be6)\n\n[Surprise Songs Playlist](https://open.spotify.com/playlist/2QoBnrCoYFoU3Pyl4gGmjL)\n\n[Unplayed Songs Playlist](https://open.spotify.com/playlist/1HGzXD4YsewiU7rFWJZ3Wt?si=373dc5499bc14ee7&nd=1&dlsi=420dbeeaa05d4b92)\n\n[Setlist Spreadsheet](https://docs.google.com/spreadsheets/d/e/2PACX-1vSbpOLgnmNTCADiUalKW_SnfMBcxeixvolce_k6iO9EYgXT_nFpl1VAUbQJGpXff5AkivyUrPahJL3N/pubhtml)\n\n[Outfit Tracker](https://docs.google.com/spreadsheets/d/e/2PACX-1vQnrx6YFAPuhBd6mWhlzqLDcuc2pXy4HPO_IdyC-BdXDZ-ukog4KrqyDO2bGYmJfD2zyMfMHXQuqnja/pubhtml)\n\nAre you ready for it London boys (and girls)? Please use this thread to share photos and videos, talk about the show, arrange meetups, ask questions, etc. We will be posting a new thread for every city.\n\nShow List: Wembley Stadium\n\n* Friday June 21st- 7:30pm\n* Saturday June 22nd- 7:30pm\n* Subday June 23rd- 5:30pm\n\nFor more information, make sure to check out [the official Eras Tour website](https://tstheerastour.taylorswift.com/). Upcoming tour dates can also be seen in our events widget.\n\n**Other Megathreads:**\n\n[Megathread Hub](https://www.reddit.com/r/TaylorSwift/comments/14sl7a7/megathread_hub/)\n\n[Tour Discussion](https://www.reddit.com/r/TaylorSwift/comments/1cnevug/the_eras_tour_discussion_thread/?sort=new)\n\n[Ticket Trade Thread](https://www.reddit.com/r/TaylorSwift/comments/1cs3rfv/taylor_swift_eras_tour_trade_megathread/?sort=new)\n\n[Ticket Resale Thread](https://new.reddit.com/r/TaylorSwift/comments/1cs3qva/taylor_swift_eras_tour_resale_megathread/?sort=new%20Reddit)\n\n[A View From Swifties Seats](https://www.reddit.com/r/TaylorSwift/comments/1cjb8b9/a_view_from_swifties_seats_megathread_3/)\n\n[Fan Outfits, Costumes, and Bracelets](https://www.reddit.com/r/TaylorSwift/comments/1cnesy2/fan_outfits_costumes_and_bracelets_megathread/)\n\n[Theories Thread](https://www.reddit.com/r/TaylorSwift/comments/1d5h76i/theory_megathread_june_2024/)",
        "num_comments": 3473,
        "comments": [
            "Taylor you have EIGHT shows in London you don't have to do everything tonight",
            "London, I still can't believe it 😭🐾\n\nStats:\n\nHits Different had its second performance on the Eras Tour and also its second performance ever, having made its live debut in Chicago last year. Death By A Thousand Cuts had its fourth performance on the Eras Tour and its sixth performance ever. The Black Dog made its live debut tonight! Come Back…Be Here had its fourth performance on the Eras Tour and its fifth performance ever. Maroon had its seventh performance on the Eras Tour and also its seventh performance ever, having made its live debut in East Rutherford last year.\n\nMaroon is now tied with You're On Your Own, Kid for the most-played surprise song on the Eras Tour. (Unweighted. Weighting for mashups, You're On Your Own, Kid still has the lead.)\n\nDeath By A Thousand Cuts was previously combined with Babe during the Singapore leg of the Eras Tour. Come Back…Be Here was combined with Daylight during the Melbourne leg of the Eras Tour and with The Way I Loved You and The Other Side Of The Door during the Lisbon leg of the Eras Tour. Maroon was previously combined with Forever & Always during the Sydney leg of the Eras Tour and with Cornelia Street during the Liverpool leg of the Eras Tour. This is the first time Hits Different or The Black Dog have been played as part of a mashup.\n\nTaylor has now played The Smallest Man Who Ever Lived live more times than The Outside.",
            "All of us rn\n\nhttps://preview.redd.it/xay8w6rbsz7d1.jpeg?width=1170&format=pjpg&auto=webp&s=cce237f59bf67a400832f8bb2aab5ad90fb1915f",
            "Do you think Prince William yelled 123 LGB",
            "https://preview.redd.it/xrmt3c7pty7d1.jpeg?width=968&format=pjpg&auto=webp&s=49d40806122b91a63139b2e4e6084dc2f1d82435\n\nkylie trading bracelets! (featuring debut era ross)",
            "https://preview.redd.it/a2gviibfiz7d1.jpeg?width=1084&format=pjpg&auto=webp&s=ee88aca5b5cee28163a4f3c6193b03fe305c7214\n\nthis is going to ruin the tour",
            "Jason trading friendship bracelets at the show!\n\nhttps://preview.redd.it/piovvgx9ry7d1.png?width=896&format=png&auto=webp&s=356833325619649565c32f77660c92bb5e5d65fb",
            "Tonight's surprise songs really were incredible\n\nI still can't believe it 🥲",
            "https://preview.redd.it/9hgjc29cwy7d1.jpeg?width=886&format=pjpg&auto=webp&s=f58254244da23d3680826afe6e29cf4d25b1daae\n\ntravy made it to the big game!",
            "Heads up check your email\n\nJust got off the waitlist and got 3 seats next to each other facing the stage for 178 pounds!!!",
            "After 17 years of being her fan, i cant believe I am actually going to finally see her now! 🥹",
            "Taylor and Travis is obviously not new news (lol) anymore, and Jason and Kylie’s friendship with Taylor is also not new news anymore, but I’m so excited seeing Jason and Kylie are there today!!! \n\nAs an Eagles girlie, it just feels like my worlds are colliding all over again lol I feel like I need to tell everyone I know that they’re there 😂",
            "I feel like maybe we need a separate mastermind thread",
            "Totally aside, but I like how I am starting to recognize some Redditors in here as frequent fliers and I get tickled when I see y'all for each stream 🥰🥰🥰🥰 Y'all are the reason I keep coming back... cause it sure as heck isn't my Mastermind score! 😅",
            "civil engineers are shaking",
            "https://preview.redd.it/xstoue3bsz7d1.jpeg?width=500&format=pjpg&auto=webp&s=4e956340c5b62cb98831fc901e338ba23b124a15",
            "prince william really got to hear those surprise songs over ME",
            "prince william doesn’t deserve to hear these songs when i haven’t",
            "I am so here for Jason's first eras show.....this is gonna be so much fun. Kinda want a Jason stream and a Taylor stream lol",
            "I’m 36, but if I was standing there watching Taylor come toward me to give me the 22 hat I would be fully sobbing by the time she reached me. 😂",
            "I need an HD version of that Hits Different x Death by a Thousand Cuts mashup right now btw",
            "I live quite close to Wembley and there’s so many people walking around my area all dressed up and sparkly. Giving me serious FOMO 😫\n\nHope everyone has the time of their lives!!",
            "I think a fun way to mess with us would be a 22 shirt that says “Look What You Made Me Do.” Especially if/when she starts teasing Rep TV.",
            "I know everyone wants London Boy x So Long London at one of these shows but I want So Long London x happiness (I'm just desperate for happiness to be played in any way at this point 😭 We Were Happy x happiness would also be great but she avoids the Fearless vault like the plague)",
            "GA on the floor seems like hell. People are dropping like flies and it’s 64 degrees outside.",
            "I love that Taylor pointing out people in the crowd. But for the love of god please take care of yourself and those around you. Be safe out there. 88,000 people is a lot of people in one area and security and first aid can only be so quick. \n\nOn the other note. She looks genuinely so appreciative for these big ovations. She truly loves us and what she does.",
            "How does she have the breath control to be able to do that!?",
            "Byeeee\n\nhttps://preview.redd.it/1172b834sz7d1.jpeg?width=959&format=pjpg&auto=webp&s=5f527ddfc818235ec4c152f2643afe70dffbe87e",
            "when the universe experiences heat death, you will still find taylor playing maroon during the acoustic set",
            "I just need to start guessing Maroon on piano every time.",
            "Prince William is sweating bullets in his suite during Vigilante Shit.",
            "I would like to shout out the girl at the front of Section 501 who had a series of belt loops each with a different album of friendship bracelets on giving her treasures out to everyone. Amazing stuff.",
            "Can't wait for london boy x so long london 💀",
            "She’s saving London boy for all her London swifties right? And So long, London for when she leaves",
            "Hey party people! I went Full Parent Mode - I have tissues, wet wipes, ibuprofen, and a box of protein bars if you need them! \n\nI'm heading to Wembley via Jubilee and will be in a blue top with a Mx Americana sash and the worst tiara money can buy near the red zone. \n\nPlease say hi!!\n\nETA: I'm number 200 in line :)",
            "Gold and blue again? I have to totally rethink the way I predict these outfit choices… 😅",
            "This feels personal 😂\n\nhttps://preview.redd.it/zp2ui6z53z7d1.jpeg?width=1170&format=pjpg&auto=webp&s=ba8d2ee4d10d55e0f6a48c876fcfc4741a5ec9ed",
            "New Rep outfit, let's keep my perfect 0. 🙃",
            "Wow I can’t believe she also repeated the rep outfit from Cardiff!",
            "2 points gang represent!",
            "Did she lose her bags or something? I was so confident with my mastermind this morning 🥲",
            "Why is the crowd so fighty tonight? London you need to calm down!",
            "She looks kinda stressed tonight, I feel like her attention is really on the crowd and their safety",
            "I feel like she's been hypervigilant about the GA sections ever since South America. I guess it makes sense after what happened and people pass out or need a breather all the time with GA gigs. We're used to those in Europe so I'm sure the staff is very well prepared and are taking good care of the folks who need it! ",
            "Remember when I said get in the CAH. I love this streamer",
            "I'm not gonna lie, I absolutely love how this streamer says, \"GET IN THE CAH!\" So precious!!!😄😄😄",
            "People are freaking out about this and I don’t know if they’re clowning or if it really means something 😭\n\nhttps://preview.redd.it/mluhuaiihz7d1.jpeg?width=544&format=pjpg&auto=webp&s=15d78dd696abf3218d9e3399f1ded393c0c38acb",
            "She did warn us about the person she was about to become lol",
            "\"Have you gone to therapy?\"\n\n\"Yes check out my TTPD stream at the Eras Tour\"",
            "somewhere in europe there is a truck full of sparkly outfits and a driver with a dead gps",
            "now THIS is a MASHUP, gosh I'm soooo jealous of everyone there but equally excited for y'all!!!",
            "My husband just looked at me like that’s not how the song goes",
            "Blondie said you WILL get maroon again if it’s the last thing I do bitches ",
            "To those trying to get home from Wembley… May the odds be ever in your favor",
            "JASON ANS KYLIE ARE AT THE ERAS TOUR! THIS IS NOT A DRILL ‼️‼️‼️‼️\n\nhttps://preview.redd.it/w0kaflulqy7d1.jpeg?width=896&format=pjpg&auto=webp&s=b1cbf0d63376b9393e79ee102c81894b5c506a71",
            "[Nicola Coughlan](https://pbs.twimg.com/media/GQnhucMXkAAXBZX?format=jpg&name=900x900)",
            "https://preview.redd.it/uvum7jx1jz7d1.jpeg?width=583&format=pjpg&auto=webp&s=3e904dc33a7602283eb29665de5b5ab62801df0a\n\nshe’s mocking my mastermind points rn",
            "https://preview.redd.it/82xdf1orqz7d1.jpeg?width=500&format=pjpg&auto=webp&s=e475a6d0c3da8bfd0ab7d0bbe5126227b99d8497",
            "https://preview.redd.it/unpaehp4cz7d1.jpeg?width=892&format=pjpg&auto=webp&s=b107e199321f8c74a43356e7876e4fd9b41f3590",
            "my working theory is that: the location tracking thing is true, the pub is in london, but it’s not called the black dog",
            "Hi London! For those of us watching streams, I've added a Time Zone converter to my spreadsheet here: [https://docs.google.com/spreadsheets/d/1WZyhckHAwOosHGA65h5dp5SHL5aoUMiyYXcY1k5MYUM/edit?gid=174092590#gid=174092590](https://docs.google.com/spreadsheets/d/1WZyhckHAwOosHGA65h5dp5SHL5aoUMiyYXcY1k5MYUM/edit?gid=174092590#gid=174092590) I'll update live throughout the show to estimate the start of each era!\n\nAlso the spreadsheet tracks all eras tour data I could possibly think of - enjoy!",
            "Is this the first time Jason has been at a show?",
            "https://preview.redd.it/9ylih9r3zy7d1.jpeg?width=1290&format=pjpg&auto=webp&s=96fde41b045c31199d9d7917e25e305dbbfcd53e\n\nnew microphone!",
            "loll her gushing about London, she really does love it there, she wasn't kidding",
            "This black Fearless dress shaping up to be the YOYOK of the Fearless dresses.",
            "0 point gang!!",
            "Awww look at the little Rep girlie! 🐍",
            "The 22 hat recipent repping Rep. 🤡",
            "Guys what if she does peace because jason is there??\n\nMaybe mash it up with The Albatross: “and they tried to warn you about me… BUT you know that I’d, swing with you for the fences”",
            "idk if this is a hot take or not, but the Red era is too damn long 😂 it always feels like it lasts forever!",
            "These pre ATW speeches keeping getting longer and longer",
            "I love these megathreads for each show. I get to ignore the stream chat and come here instead.",
            "I give up with mastermind 😭 thanks Reputation bodysuit for my only two points",
            "I still miss the 1 😭",
            "I will clown with everyone if she repeats 1989 when she has so many options for that one",
            "I'm just boarding a flight and truly think this might be the first time I pay for wifi 😅",
            "Not me thinking Taylor just came in so flat but it was the streamer lmao",
            "I really do think she’ll go back to seated pitch instead of standing if the venues allow it after this tour. There’s been too many incidents.",
            "GET IN THE CAH",
            "I feel so bad trying to see the color of her bra. For my Mastermind score.",
            "Holy shit y’all this streamer is at therapy right now",
            "This is why I couldn’t stream. I’d sound like a feral cat the whole time",
            "This streamer is going to feel a lot better after she's screamed all of this out",
            "Is this girl… ok",
            "“She’s in the orange dress, I feel sick”",
            "ITS A LONDON BRIDGE",
            "Oh that connected well! Tasty! That \\*puts shades on\\* hits different",
            "She's messed up DBATC before so I can imagine she must be so proud of herself for doing both those bridges perfectly.",
            "Just think…..two more nights in London coming. Will we survive? And then what will she do to us in August? ☠️",
            "See you tomorrow clown squad",
            "Omg gutted that I lost the black dog, I’m going tomorrow 🥲",
            "This is one of the coolest things I have ever done. Wembley was just another level.",
            "the shows we've all been clowning for...\n\nhttps://preview.redd.it/ok8pl1tl7q7d1.png?width=596&format=png&auto=webp&s=7b04276fe7b8d5a8c09c88908318dd995b02f765",
            "i miss folkleric...........",
            "kAM: \"WHY DONT YA JUST BOG OFF\"",
            "Is she aware of Mastermind, trolling us all by being the ultimate outfit repeater???",
            "Aaaannnnddddd now I’m fully convinced she just found out about mastermind and is trolling us all",
            "Okay at least 1989 has to be different, no way she'd do Wales colors again 😂 I'm hoping for orange/blue!",
            "Some mastermind hot takes:\n\n-\t90% of the outfits will be the same as Cardiff\n-\tShe won't sing any song with London in the name\n-\tShe will repeat at least one 1989 outfit color",
            "This is my fave background dancer fit. I want a sparkly Victorian funeral outfit",
            "LONDON BRIDGES 😭",
            "MEGABRIDGE",
            "There's a [video ](https://www.instagram.com/reel/C8fhHAuurV3/?igsh=MzRlODBiNWFlZA==) of Travis singing along to So High School and it's very cute 🥰",
            "I need to know if tonight is a \"Karma is the guy on the Chiefs\" night.\n\nIt's like the flag on Buckingham Palace that's only raised when the King is in residence.",
            "EVERYONE'S a Swiftie! 🤴🏼👸🏼\n(Royal Guards playing Shake it Off)\n\nhttps://www.instagram.com/reel/C8edJ_iMuLV/?igsh=MXM1ZWlsNHMzMzc2dw==",
            "Oof I’m off with a flying 0 on mastermind 🤣",
            "travis not wearing a matching set feels wrong. someone give him some stripes or polka dots or florals or something",
            "I guess Taylor is clowning with us tonight and repeating ALL of her fits from Cardiff. WHO'S LAUGING NOW, EH?🤡🤡🤡🤡🤡",
            "So she knows about mastermind/swift ball and is screwing with us tonight, right?",
            "FEMALE RAGE: Streamer Edition",
            "me at the netherlands x france game :Do something, babe, say something\" (say something)  \n\"Lose something, babe, risk something\" (you're losin' me)",
            "BRIDGES FOR LONDON 🌉🌉🌉",
            "The shows will apparently be on the early side again. Also, note that there is an extra opener for the shows this weekend and the Sunday show is slated to start even earlier. Here are some estimated time zone conversions.  \n\nFriday/Saturday:  \n[Mette/Griff](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Opener&iso=20240621T1725&p1=136&am=30)  \n[Paramore](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Paramore&iso=20240621T1815&p1=136&am=45)  \n[Taylor](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Taylor&iso=20240621T1930&p1=136&ah=3&am=30)  \n[Surprise Songs](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Surprise+Songs&iso=20240621T2210&p1=136&am=15)  \n\nSunday:  \n[Benson Boone](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Opener&iso=20240623T1640&p1=136&am=30)  \n[Paramore](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Paramore&iso=20240623T1730&p1=136&am=45)  \n[Taylor](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Taylor&iso=20240623T1845&p1=136&ah=3&am=30)  \n[Surprise Songs](https://www.timeanddate.com/worldclock/fixedtime.html?msg=Eras+Tour+Surprise+Songs&iso=20240623T2125&p1=136&am=15)",
            "What is happening on hockey bros stream rn",
            "I was not prepared for this level of outfit repeating",
            "i feel like tonight is going to be the lowest winning score in mastermind history",
            "I really like the new 1989 outfits.  I think she likes the flowy skirts better.  Especially for a song like Blank Space when she uses her hips more. But that strut will forever be iconic no matter the outfit.",
            "No wonder the streamer apologized before TTPD part started 🤣🤣 she's really feeling But Daddy I Love Him ",
            "YOU DONT GET TO TELL ME ABOUT SAAAAAD\n\nHoly shit. Streamer chick is having some therapy right now.",
            "Our streamer is literally losing her voice in real time 😭😭😂",
            "Not gonna lie I recorded some of my stuff from Tampa N2 and sometimes I go back and watch my own videos and just hear me ugly sobbing and crying as I cream lyrics and honestly I really can't blame any streamer for not sounding as bad as I did. 🤣",
            "I really wish she did the full Down Bad song. The amazing SFX are too good for only a verse and chorus. And it has becoming a fan favorite fast.  It’s my favorite song on the album proper. But the transition into Fortnight is probably the best of the show.",
            "Hits Different x DBATC!!!\n\nILLEGAL...STRAIGHT TO FUCKING JAIL!!!!!!",
            "Taylor before she chose today’s outfits.\n\nhttps://preview.redd.it/d7jy8o9ywz7d1.jpeg?width=660&format=pjpg&auto=webp&s=e66d4e1403e96a929f68d9e86eb072e67eab19f9",
            "The fact that it started raining during midnight rain was magical ❤️",
            "I can’t stop thinking “omg I can’t wait for Jason and Kylie to see this part!” Yes I’m super excited about my imagined reaction that strangers are having to the show I have watched 100 times. I’m FINE!🙂",
            "Wish I could change my surprise song guesses to I Forgot That You Existed x This Is Why We Cant Have Nice Things and I Hate It Here x The Lakes",
            "https://preview.redd.it/hvjtcaokrz7d1.jpeg?width=1070&format=pjpg&auto=webp&s=318c189ea064430b3d4b7365b6aaf45a61412f89",
            "I’m just glad she did almost all of The Black Dog first because it’s beautiful and we needed it all before she mashed it up",
            "On the drive home now after the concert. That was insane. I’m in shock! I can’t believe the surprise songs we got- I’m beyond thrilled! \n\nAlso mastermind score was 90.",
            "Yaaay the thread has been opened! I’m so excited for tomorrow although a little nervous because I’m going alone! I’m hoping there will be some other lone wolf swifties to form a pack with 😂 (also because it would be great to have someone to take a photo or two of my outfit!!)",
            "man i love being unemployed and able to watch all these livestreams. wish i could get paid for this shit",
            "https://preview.redd.it/dxnj7v55ry7d1.jpeg?width=480&format=pjpg&auto=webp&s=69608022208eb83affcad5e8629315a6d8375f53\n\nClowning time 🤡",
            "Was Jason Kelce signing a New Heights hat at Eras Tour London on your bingo card last year?\n\nhttps://x.com/FaIIinInRoses/status/1804210719191449823",
            "She saw that we expected blue pink every n1 for the entire tour and decided to simply never wear it on n1 again 😭",
            "It’s least it’s not freezing any more for her 😂",
            "So she wore gold blue bodysuit for the second show in a row... the one that goes with the BLACK blazer... 🤡",
            "god my mastermind score is in the GUTTER 😭",
            "Is there a fight happening rn",
            "At this point I am convinced I only play Mastermind to hurt myself,  LOL 🤡🤡🤡",
            "at this point she’s going switch up the order of the guitar and piano surprise songs songs so i don’t get any points at all",
            "Everyone still sitting at 0 on mastermind, we'll get our 2 pity points next!",
            "I’m watching long live on the film of eras tour cos I feel robbed of it, will return to live stream after",
            "The rep outfit being the only thing I’ve gotten right on mastermind just brought me to my knees",
            "I love Marjorie so much ❤️❤️❤️\n\nI just wish I could listen to it a tad more without sobbing lol",
            "Thank you to whoever posted that list earlier about 1989 combos for my 14 points.",
            "you guys really make me want to start playing mastermind",
            "Streamer sounds like she won’t be forgiving or forgetting or letting go",
            "oooh the streamer is FEELING this. Who hurt her?",
            "Woah. TTPD streamer goes hard",
            "The question is which lethal bridge will she do bc they are both epic and well-loved",
            "THERE’S “LONDON” IN COME BACK BE HERE",
            "Girly why didn't you just add Maroon to the Midnights section when you redid the era's to add TTPD?",
            "Tomorrow or Sunday I think a wild YOYOK will appear lol",
            "Hello fellow Swifties, who's excited for Wembley??? \n\nBadly needing this livestream today as my own personal Peter/Chloe et al. subject (literally named Peter...LOL) who has haunted me so stunningly for the past 15+ years has decided that THIS is a great time to slide into my inbox again and try to rust a summer that is already far from sparkling. Trying to stay strong in my insistence that the shelf life of those fantasies has expired and that we will NOT be waltzing back into any rekindled flames and that it needs to stay buried. \n\nThank goodness for the wisdom of TTPD to talk sense into me! Hope everyone has a great afternoon/evening, wherever you are watching from!",
            "I’m seeing Billy Joel and Stevie Nicks tonight, so I’m loving this Eras tour pre-show in my bed.",
            "First the black blazer then the silver/black dress??",
            "12th appearance of the black dress in 21 European shows!",
            "That’s 80 minutes of ATWTMV HAHA",
            "I do the little delicate hop in my house whenever I hear this song 😂",
            "I always get a bit sad that we never got the trees in Edinburgh N1, they look so nice :(",
            "I am triple tasking with a meeting and doc review lol",
            "Did she just wave at him? 🥹",
            "This streamer is actually me in regards to how feral I go over TTPD.",
            "This streamer is FEELING it 🔥",
            "The girl on Kevin’s steam is 😡🤬😤😾👿😠😖🗯️",
            "I HOPE SHE DOES BOTH BRIDGES",
            "I wish someone loved me like she loves singing Maroon as a piano surprise song",
            "The Black Dog live, you were the loss of my life (my favorite song on TTPD and i am not there)",
            "Not me applauding from my couch after that 😭",
            "TAYLOR WHERE IS THE DAMN LIVE ACOUSTIC ALBUM",
            "Nothing to do with the concert but a warning for everyone who booked a hotel through booking com in the upcoming days. We got an email that we need to refresh our credit card for the booking through booking com (the official website) and did it. Turned out that the company apparently got hacked. So please be careful, i hope that no one besides us will loose money from it",
            "It's our time guys! \n\nITS BEEN A LONG TIME COMING!!!",
            "I’m going tomorrow and keep seeing people on tiktok saying they missed paramore bc of the queues to get in, how early should i get there for seated? Genuinely majorly stressed out bc i love Paramore and tay equally 😭 ",
            "GOOOOD MORNING EVERYBODY! It's been a long time coming but here we are! Finally! Are you ready for Night1?!",
            "I somehow don't think we're getting anything rep-related on the day of a new TTPD merch drop (and I'm the first to clown for rep TV)",
            "Resisting the urge to watch the live steam so my first time seeing her at Wembley is IRL",
            "I’m starting out mastermind strong and already know I got the lover guitar wrong because of this outfit lol 0’s all around",
            "This fight on the Taylor swift hockey bro stream?? Help",
            "Black jacket, black dress…",
            "clocking in at zero points!!! on fireeee tonight 🔥🔥",
            "It never ceases to amaze me how quickly she can transition between sets. Like I know she has people helping her change! But still crazy endurance",
            "This is the longest I’ve stayed at a zero so far in mastermind, at least I’m guaranteed 2 for Rep, right? ![img](emote|t5_2rlwe|1087)",
            "Well we know there will be one more outfit repeat haha",
            "OMG ANOTHER REPEAT",
            "Because I understand pattern recognition tomorrow ill be guessing all outfits from Liverpool n3!",
            "YOU DON'T. GET TO. TELL ME. ABOUT. SAAAAAD!!!!",
            "10/10 for the streamer's therapy.",
            "Did Kam just make her do the YMCA? 🤣🤣",
            "Damn, Hits Different x DBATC is a sad girl mashup!",
            "MEGA BRIDGE",
            "Maybe she doesnt hate london after all",
            "Wow she nailed it too",
            "Youuuuuuu London girlies won. Damn. Quaking with these 🌉",
            "TRIPLE HOMICIDE",
            "London, how does it feel to be god's chosen?",
            "PUT HER IN JAIL !! And throw that piano away !!",
            "WHAT THE FUCK WAS THAT",
            "still not over The London Bridge",
            "I am SICK at the surprise songs. Played 3 of my favorites back to back oh my god",
            "Just got back to my hotel from Wembley lol. This was by far the most fun and cool thing I've ever done in a while. I'd do it again for N2 if not for time and money.",
            "something about the kelce's showing up for her first show in london just makes me feel warm and fuzzy",
            "TAYLOR SWIFT YOU ARE AN OUTFIT REPEATER!!!!!!",
            "okay guys if we all petition really hard to taylor nation, maybe we can get a formal paid high-quality live stream of the december 8th final show. i thought of that earlier this week. i would gladly pay $20, heck $50 to get a movie quality live stream for the last show and have a watch party.",
            "https://preview.redd.it/y0kyke3prz7d1.jpeg?width=1170&format=pjpg&auto=webp&s=1f854b0292e54becbd8a22d98c2caeeee1fd0a5d",
            "https://preview.redd.it/3xbooopurz7d1.jpeg?width=1170&format=pjpg&auto=webp&s=4475802b967aec327eb34606aa704ad8c6b8086a\n\nAre you kidding me",
            "https://preview.redd.it/sag70005sz7d1.jpeg?width=1179&format=pjpg&auto=webp&s=c999a282d908077989ea1b1e54fdb6a78a73b4a9\n\nWould’ve gotten the whole thing right if she had t added maroon, but this saved my mastermind score today",
            "WEMBLEY PARK MERCH UPDATE\n\nOh my god, so easy. I got there at 6:10, didn’t even queue but basically walked up to the counters. Unfortunately in my section they were sold out of XS blue crewnecks but had everything else. Paramore merch was cute too.\n\nSo well-organised! What a fantastic idea!!",
            "I can’t live stream with you all due to work tomorrow so I’m going to post my surprise song predictions now:\n\nI feel like London will get a few really good ones - but I have a feeling So Long London will be saved for the last London show in August. So I’m going with:\n\nState Of Grace x I Wish You Would/The Black Dog x Cornelia Street",
            "NOT THE WATER CUP LADY SINGING!! HAHAHAHAHA",
            "FIGHT lol",
            "TAYLOR DID YOU LOSE THE LONG GOLD ONE OR SOMETHING 😭😭",
            "I’m not masterminding well tonight 😢 0",
            "Still sitting pretty at 0",
            "I just adore little swifties!! She was so cute 🫶",
            "i'm supposed to have an appointment at exactly the time the surprise songs are supposed to start and I'm sitting here like....is it too late to cancel?....probably. lol",
            "Hiiii besties!! I was in a meeting but I am here now",
            "Not streaming today, but I popped in on Mastermind confident I was doing pretty decent to see that my score was TWO. 😂",
            "Ok at this point she’s got to be trolling the Mastermind players, right?",
            "Okay I’m suspicious af of all these repeats now I’m ngl\n\nLike I don’t think it means anything necessarily. But it’s suspicious 👀",
            "Mm, the no-longer-rational anxiety about the surprise song set coming next. Delicious.",
            "OMG we have our boy from Cardiff on Kev's stream!🤩🤩🤩🤩🤩 (Or is it just me?)",
            "DEATH BY A THOUSAND CUTSSSS",
            "London Megabridge!",
            "SHUT UP THIS IS MY SONG",
            "I hope the streamer is doing good cause those tears were PERSONAL",
            "I GUESS YOU’RE IN LONDON TODAY",
            "I can’t wait till the good quality vids of the surprise songs are posted. I can’t hear a thing in these live streams 😂",
            "taylors like “what you guys thought i wasnt gonna sneak in maroon?”",
            "new surprise song challenge: how many songs can be mashed up with Maroon",
            "Holy shit, that was incredible",
            "Kam's solo is always a highlight, even on a grainy livestream!",
            "Doing the Travis Karma dance 🙌🌊",
            "You guys… can we get a separate mastermind thread? This thread has been completely hijacked by it and let’s be honest.. your score is not that interesting to other people. I am really not trying to be a jerk but this has become 80% just people posting their scores and 20% concert content. It’s not fun during the streams anymore.",
            "Do we know the stage times for each performer? Specifically looking for Fridays times if anyone has any deets? ![img](emote|t5_2rlwe|1067)",
            "YOU GUYS! ITS FINALLY HAPPENING!! 🩷💙💜♥️🫶🏼",
            "Does anyone know if the VIP lanyard actually does anything?\n\nOn a related note - I’ve got two VIP tickets and therefore two VIP boxes and it’s safe to say my husband does not want his 😅 I wanted to just give it to a random kid or something at the concert but it’s quite big and heavy.  Is anyone on here going with a kid/tween and driving so you can stick it in the car? Would really love to give it to a little swiftie fan!",
            "A completely irrelevant but nonetheless interesting (to me) stat I just discovered while working on my mastermind: Taylor hasn’t worn the Purple Lover suit on a N1 since Kansas City N1. 🤔",
            "Anyone else going solo? I’m hoping I’ll be brave enough to ask people to trade bracelets and ask someone to take a photo of me at the stadium",
            "Some surprise songs prediction:\n- London Boy on first night\n- So Long, London on final night (either the last one in June or in August... or both)\n- The Black Dog\n- Any songs that mention London (e.g. Message in a Bottle, Come Back...Be Here, Beautiful Ghosts)\n- Maybe an Ed Sheeran guest star and they'll perform any of their collaboration (Run/End Game/Everything Has Changed)\n- EDIT: I think she'll play End Game with or without Ed just because she filmed the music video there and she's played End Game by herself before\n- [This article](https://www.timeout.com/london/news/17-times-taylor-swift-has-mentioned-london-in-her-songs-052024) said that Clean was written in London and Christmas Tree Farm was recorded there too, so maybe those two songs also have a chance",
            "Wait. Jason and Kylie are there?!?!!!?!",
            "I’m going to the last Wembley show in August and this is getting me so excited I can’t wait",
            "lets do this London!!!!\n\nhttps://preview.redd.it/ohv8tm7mvy7d1.png?width=596&format=png&auto=webp&s=1ab1f0dffd8a541184e65eb513de18c80e834730",
            "I love these girls and they are way too hype to stream well 😂",
            "Taylor I love this dress too but three shows in a row is crazy 😭",
            "sitting on a lovely mastermind score of 0 tonight 🤡",
            "Omg the streamer with the Fortnight tattoos!!! Yesss",
            "Omg I am so dumb! After watching this show 100 times have I just noticed that the Speak Now girl in the box isn’t a dancer it’s actually one of her backing vocalists? She’s not mime singing she’s actually singing! Wow I can’t believe I never noticed that.",
            "Okay im entering clowntown now after that outfit repeated.. only question is what does this mean?",
            "Champagne Problems will never ever get old.",
            "I’m in front standing tomorrow and am actually worried given the amount of incidents",
            " DON’T CALL ME KID! DON’T CALL ME BABY!",
            "Here comes Travis’s favorite Era other than TTPD!",
            "To the girl on Tess stream: mood",
            "Girl u ok?",
            "She just knew we all chose London Boy for Mastermind and decided to screw with us 😭",
            "This mashup might break the Champagne Problems applause record.",
            "Love that she did both bridges",
            "don't blame me these mashups made me crazy",
            "So i guess chevron suit and magenta coat is coming?",
            "I still think one of best things she does is greets the obstructed viewers during Anti-Hero. Just to show those people she hasn’t forgotten about them.",
            "Thank you all, that was a wonderful way to spend Friday afternoon! (I am pleased to say I resisted all temptation to fall prey to Peter's charms and offers for rekindled flames and will stay strong through the weekend!)",
            "We had pretty decent seats and amazingly four seats in the row in front of us sat empty for the whole show, people were asking several grand for seats there on the resale sites!",
            "Videos of Prince William dancing aggressively to Shake it Off has dropped. I’m dying of laughter, it’s super cute 😂😂",
            "The Kelce fam is in London, y’all about to get a hell of a show! Keep an eye out for shirtless Jason 😂😂😂 [Jason in London](https://x.com/tayvisnation/status/1804138098982310039?s=46&t=YEO8VjoV85pDWvTJG3hq2w)",
            "Look at all the friendship bracelets!!\n\nhttps://preview.redd.it/w0v8dzzvsy7d1.jpeg?width=959&format=pjpg&auto=webp&s=65f6c4fda523d26fcd3b4f3f9ca288f9f70cea79",
            "She fucking LOVES London",
            "one thing I've deducted from the surprise song set is that taylor loves clean, yoyok, maroon, and dbatc",
            "Omg the streamer is actually full on sobbing SAME BESTIE I WOULD BE TOO",
            "While I’d love to see what mashup she chooses I can’t help but desperately hope she does the whole song",
            "This poor girl crying her eyes out on this live stream is all of us",
            "Ok pretty confident this one is from tonight, she put up Travis’ signature Archer pose to start So High School! [I’m dying](https://www.tiktok.com/t/ZTN8woCSC/)",
            "Filing out mastermind for tomorrow and ya know what I would love?? A new speak now ball gown with green folklore dress vibes. Some forest fairy queen shit",
            "I don’t expect so long London until the last (and my) show in August but mashing it with either happiness or Peter would my dream",
            "Just reading on WIkipedia that Mette, the opener, played the role of CASSANDRA in the Cats movie in 2019. If anyone hasn't submitted their surprise song guesses yet ...",
            "Woooo I made it in time!!! So excited for these shows!!!\n\nI'm happy to see that the Kelces are there but man, there's no way she's playing any of my surprise song guesses now 😂",
            "LET ME SEE YOUR HANDS top 5 moments of this tour",
            "my mastermind score is in shambles",
            "Oh fgs we know new salt and pepper is her new fav for fearless too",
            "210k Mastermind entries today?? It's been climbing so fast omg, Cardiff only had 180k (Paris N1 only had 44k)!",
            "I’m just gunna keep picking the Trouble shirt until eventually she wears it 🤷🏻‍♀️",
            "What if she repeats all outfits all London nights and then only changes the Rep outfit? 🤔",
            "So excited for my first points of the night ☺️",
            "Alright I don’t care about the bad Mastermind score, I just want to get one of the first surprise songs right cause then I’ll have gotten every category right at least once. So please Taylor, play The Story of Us, Long Story Short, or London Boy (in the first song).",
            "Streamer got some “watuh”, all is well. ❤️",
            "I knew she’d do the OrangeyRed + Blue Set for the British flag 🇬🇧 but couldn’t decide in which order (top or bottom), so I just went with OrangeyRed for both 😂",
            "I see flag theory is ALIVE and well",
            "Oh I would have guessed black gloves of mastermind had bothered to ask!",
            "We have made it out of the outfit repeats!!! (so far anyway 😂)",
            "we’re about to get I Forgot That You Existed x This is Why We Can’t Have Nice Things",
            "DEATH BY A THOUSAND CUTS?!?!??",
            "WHAT A MASHUP OMG",
            "lethal bridge",
            "london bridge and (we're) falling down",
            "THANK GOD I PUT DOWN THE BLACK DOG ON PIANO FOR TONIGHT",
            "THE BLACK DOG/COME BACK BE HERE/MAROON?!",
            "maroon too!?!?!? absolutely unhinged!!!!",
            "Maroon for favorite child",
            "Mashups lately have been nothing but tears and screaming and just fucking endless pain",
            "I’m in pain over the surprise songs tonight, I was hoping for the black dog x come back be here on my show💔 I missed it by two shows fr",
            "Aight folks, good luck traversing back from Wembley this evening lol",
            "What is Kevin talking about rn",
            "Over a year of dodging setlist spoilers and tour movie clips was totally worth it - a magical evening. Got so lucky with secret songs and the atmosphere in our second was incredible. I really wasn't ready for how much of a spectacle it was going to be and I got to experience it all completely fresh, which was just how I hoped it would be. So glad I made it! \n\nAlso tip for goers today - the food at Wembley is really expensive but there is an M&S selling sandwiches, so I had a big lunch and then bought sandwiches for dinner haha",
            "Prince William and his kids are attending tonight's show of Taylor Swift's 'The Eras Tour' in London!",
            "I managed to get a code from my friend and got obstructed view seats! I’m so so so excited I’ve been looking for tickets for weeks.",
            "I’m playing mastermind for the first time 😃 I also filled it up half asleep so watch me get 3 points",
            "Ticket master seem to still be releasing tickets. Refreshed from 6pm to 10pm and eventually got options for seating. Great seats as well. Very happy wife. And I love Paramore so win win.",
            "i want the chaos of a london boy x so long london mashup",
            "I think she got her hair trimmed 🤔the bangs look shorter?",
            "Streams are brutal tonight",
            "My mastermind is going very badly",
            "These streams tonight lol 😂",
            "A classic Tracy beaker quote from Kam",
            "These streamers are major ATW girlies. I mean, same.",
            "Taylor tonight was supposed to be the swirls we just did the bagel...",
            "So far my ChatGPT results have landed me at zero points so far. I have a really bad feeling about my score today.",
            "I loveee the outfits her dancers have on for Ready For It so much, they’re so fun",
            "Gold Rush x Peace 🤡",
            "welcome to church yall 💒",
            "Greatest transition ever!!",
            "Seeing Taylor duck under the stage is still SO funny to me",
            "I went with green folkmore since she's in a repeating mood...watch her break out the purple tonight",
            "Outfit repeater!!",
            "There's actually no way... She has repeated every outfit from Cardiff so far except the 22 shirt... this has to mean something right?",
            "Ok now I’m clowning on these repeats, this is too much. She has worn this damn berry three shows now!",
            "What time are surprise songs? I can't tune in but I want to know when to check this thread to see what you all are saying lol",
            "TIME FOR WITCHCRAFT 🌕",
            "Can't wait for the 1989 outfit reveal. Will it be another repeat (I don't think so)? But if so, what does it mean?",
            "I still think the shoe might be orange, the orange skirt has a noticeable gradient so the bottom is much lighter than the top. When all put together, the lighter-colored shoes would fit into that gradient.",
            "Those who have correctly guessed a surprise song (instrument + album + song): HOW DID YOU DO IT?",
            "This streamer in really feeling it",
            "I’m having his baaaaby!!! \n\nNo I’m not 🙂‍↔️",
            "oh god who hurt this steamer 😭😭😭",
            "BUT WHAT IF THEY DID!!!!!!!!!!",
            "Orange….then green? I thought TTPD was black and white!?!",
            "Combined with Death By A Thousand Cuts!! What an incredible mashup choice!",
            "I had DBATC as a surprise song and the inhuman noise when I heard those first chords live. I’m so happy for London swifties!! ![img](emote|t5_2rlwe|1072)",
            "London just got served like it's high tea at the Savoy.",
            "and if she mashes this up with the great war? what then?",
            "What the fuck",
            "The Black Dog x Come Back Be Here x Maroon is 😭",
            "how are the people there still standing and breathing??????",
            "rip me i died dead",
            "Welp, I'm going to be processing that devastation for the next 5-7 business years...",
            "Everyone said that we should guess the songs that reference London. What did I guess on piano? Hits Different. Zero points. ![img](emote|t5_2rlwe|1087)",
            "12th appearance of the Chevron bodysuit!",
            "Ok so she just said “change things up” on the night where she is repeating everrrrrrrything 👀",
            "WHOS AFRAID OF A LITTLE OLD SWEEP\n\nhttps://preview.redd.it/emyp9xpsmz7d1.png?width=875&format=pjpg&auto=webp&s=2b86135d8b2e396c9309823f42effe8cf0dcfb3b",
            "Jason showing off his bracelets to Kylie \n\nhttps://x.com/i/status/1804223376342552875",
            "I love how sasssssy she is when Travis is there",
            "My mastermind is horrible today, only reputation correct 🙃🙃",
            "Good old ttpd dress got me my first points on mastermind. 😭🫠",
            "Two of her favorite bridges ever written I know that’s right!",
            "Her talking about bridges and my first thought is “London Bridge”",
            "Any fans watching the stream live from the ACTUAL London Bridge are losing their minds.",
            "This girl is full on weeping",
            "SHE CANT EVEN HIDE THE FACT THAT SHE HAS FAVORITES THIS WOMAN IS SICK",
            "I wonder if Taylor is just legit messing with us all on mastermind knowing we would never pick repeat outfits",
            "tonight’s mastermind feels studying for an exam and still failing",
            "https://preview.redd.it/iyszp1sewz7d1.jpeg?width=1290&format=pjpg&auto=webp&s=832451b285eb487dc42d879ecbe26cac7da39ba2\n\nSpanish royalty! Crown Princess Leonor and her sister Sofia are apparently also there.",
            "I think Taylor found out about Mastermind before the show today. This was sabotage. ![img](emote|t5_2rlwe|1066)",
            "Anyone else never gonna emotionally recover from the black dog?",
            "What an incredible evening… truly one I won’t soon forget. I’m still smiling. (And crying from the surprise songs.) It’s true what they say - you get the surprise songs you need in your current life. And I think a part of my heart healed by sharing this experience with 90,000 of you. The whole experience was truly once in a lifetime. Thankful and grateful. \n\nHope everyone got home safe x",
            "https://preview.redd.it/rm9qjtvdrp7d1.png?width=800&format=png&auto=webp&s=a1e8dd76228b66c4e3b38ff15102c5b4a7429a8f\n\nEntry and show starting times according to Wembley Stadium",
            "Why does mastermind keep going back and forth on asking about the TTPD gloves? Is it because there’s other extra questions this time? Are they only asking the gloves question when there aren’t other extra questions? Seems off to just drop it.",
            "I forgot to bring friendship bracelets for my sister and I 😭😭😭 At Wembley right now and looking at everyone trading but I'm too shy to ask 😅\n\nGreat atmosphere already!",
            "Super jealous of everyone going over the next few days!  I bet the London shows are going to awesome 😊 \n\n\nEnjoy it, and take it all in when you're there, for many this is a once in a lifetime opportunity!",
            "They aren't selling the pink tour shirt at the merch stands, honestly heartbroken (not really I'm just being dramatic lol)",
            "I can't wait to see what happens today and this weekend in general for Taylor. This is going to be so much fun watching it with all of you! Are Travis, Jason, and Kylie really there?",
            "[Jason Loaded Up](https://pbs.twimg.com/media/GQnXtkzWcAAKvW_?format=jpg&name=900x900)",
            "blue AGAIN? She JUST did that",
            "Is blue and gold the new favorite child? 😪 AGAIN TAYLOR?",
            "Ffs sake I knew I should have gone blue pink AGAIN",
            "Any bets on what Kam will say in WANGBT",
            "I have 0 points.... ew! ",
            "I’m watching rugby at the same time as the stream, if my team wins I’ll say it’s thank to Taylor lol",
            "hehe at the non-brits in the thread struggling to figure out what kam said",
            "Leg 🦵",
            "Come on Taylor, give us back Long Live to celebrate N1 in London! 🤞🏻🤞🏻🤞🏻",
            "Okay she's definitely trolling us on purpose 😭",
            "These are all the same as Tuesday except for the Red Tee 🤣",
            "New merch drop in the store all",
            "Okay FINE I’ll play Mastermind tomorrow",
            "No roof = big fire 🔥 🔥🔥🔥🔥",
            "What happened to Kev? Just tuned in and all the comments make it seem like something bad happened.",
            "in your jehovah's witness suit - who the fuck was that guy?",
            "Hitd Different! I already think London will have all the best combos. All nights!",
            "OMG I’m so jealous 🥲",
            "OH YES LET’S GOOOO I FIND THE ARTIFACTS CRIED OVER A HAT",
            "do Taylor and I share the same top 2 bridges?",
            "MEGA BRIDGE YES",
            "London Bridge indeeeeeed",
            "BLACK DOG???",
            "Black dog",
            "THE BLACK DOG",
            "Oh I'm ready to scream The Black Dog bridge",
            "AAAAAND MAROON???",
            "Damn you LONDON. Really!!! 🥺",
            "she really loves london huh",
            "These surprise song mashups are half the reason I convinced my husband to fly to Amsterdam. I’d be on the floor after these if I was in London.",
            "at this point i’m just gonna guess midnights for all surprise songs lol",
            "Hope everyone had an amazing time tonight and got home safely!!! Please if u have pics of ur seat, can u share them for us going to the later dates (esp if u have 121 or 552) 🫶",
            "Also I just don’t see her singing London boy while Travis is right there lol",
            "Is tonight the night we get Mary’s Song 🥹",
            "I feel like she sounded a bit more nervous than usual in that ATW speech. Means a lot to her first night of London. Best city in the world after all",
            "Will she repeat the surprise songs too? 😆",
            "The lights are always green during WAOLOM folks ",
            "https://preview.redd.it/elvpqxcapz7d1.jpeg?width=682&format=pjpg&auto=webp&s=abd208d0e3e76c72d9626b26b8143696818aee3e",
            "This double bridge!!!!!!!! 😍🥹🤩🥳",
            "WHY ARE THEY RED?",
            "can we talk about these surprise songs choices during the attendance of TK+family??? that's so wild to me 😭😭 but crowd loved it!!!",
            "If she’s wearing the same Red shirt as in Cardiff as well, I’m gonna start clowning.\n\nFor what?\n\nFor REPeating (TV) 🐍",
            "“Since people are trying to cancel me, I think I’ll go shirtless for the entire Midnights era.” YESSSS KEVIN 🔥🔥🔥",
            "We have a Jason Kelce sighting in London:\n\nhttps://preview.redd.it/7k9kw3sf1y7d1.png?width=675&format=png&auto=webp&s=435845c24d9e12ce17d916f5d81066834bb89135",
            "Forget the folklore girl, TTPD girl just arrived lol",
            "Kev’s current streamer could be a backup vocalist, this is so much better",
            "She only has chaos planned",
            "Love these stats. Half the Fearless vault begging to come out to the acoustic set just once while Maroon, DBATC and Come back, be here have all been played so many times !",
            "Princess Kyanna at the Queen’s show!!! I’m dying!!",
            "Feat security with the bombastic side eye.",
            "It always feels extra offensive when it’s like this too 😭",
            "That's adorable! I bet he plans on taking them home to the girls (who are likely too young to attend such a long concert at this point).",
            "I went tonight and I predicted The Black Dog x Come Back, Be Here!! I lost my everloving mind when she actually played them! And then we got MAROON on top of that?! Incredible!! I still can’t believe it. I’m on cloud nine right now.",
            "LOVE!! thanks for the update so I don’t have to keep checking twitter LOL. Also I love that he stays backstage with her so long, so cute!",
            "please",
            "It would be funny though if ME! were his favorite Taylor Swift song",
            "I was just posting this! These kids have amazing composure. I could never!",
            "I have a code for partially obstructed tickets!\n\nEDIT: I used the code to get u/puffin5678 some tickets.  I no longer have the ability to get tickets for tonight.  Cheers!",
            "are people drinking a lot or is just the amount of people together down there?",
            "I so agree with this. While I completely get the eagerness to be first in line and try your hardest to get close to barricade, if you're doing it at the expense of your own safety, as well as the safety and enjoyment of those around you and Taylor's ability to put on the show that \\~100,000 people paid to be at, you're making decisions for the wrong reasons. As someone who was at the insanely humid Tampa shows, this is just not necessary and it's so unfair to everyone if people are willfully disregarding their hydration and nutrition to everyone else's detriment.",
            "And YOYOK",
            "Mastermind should add a bonus question lmao\n\n“Will Taylor incorporate Maroon into the surprise songs? Yes/No”",
            "Just guess Maroon and YOYOK for every show",
            "Lmao the image of him reacting to it has me cracking up",
            "Not in front of the children, ha!",
            "It’s definitely happening.",
            "I think the same. I don’t think she will use So Long London until the second set of shows at least. Not only since it’s the end of the European leg and the last of the London shows. Also I think Travis will be at the first set of shows and he won’t be at the second set so the vibe will be very different.",
            "ikr, i usually go with pink/blue for the first night in long stops like this",
            "she accidentally set her other outfits on fire",
            "AGREED, I thought it was just me but her vibe seems to be a little off tonight",
            "DEBUTATION\n\nJk I have no clue",
            "Sir, this is a MEGABRIDGE",
            "And just because I’ve seen it other places, the guy with them dressed in yellow in the cowboy hat is not Travis. It’s Ross. The other of the “two hims.”\n\nTravis seems to stay back/out of sight until the countdown is on.",
            "As a fellow short adult, I’m cracking up that she can’t reach the general public to trade friendship bracelets.",
            "her being at the eras tour makes me so happy. she’s the cutest",
            "Fuck us all when she eventually get a new rep costume 😂😂😂",
            "she's obviously announcing Rep TV at London N2 /s",
            "I like this theory + the theory that she chose The Black Dog bc of the depression symbolism. Depression as a narrative and a theme is rampant throughout ttpd, so it would track if she wanted to reference this special bar that is making her sad now, but didn’t want to actually name drop a real location.",
            "YES!! He and Ky are seeing it for the first time!!’",
            "So Long London is gonna hit so hard if/when she makes it a surprise song.",
            "same 😭 and the note change was so iconic too",
            "I can't even tell if I'm clowning, convinced she's trolling us because she finally found out about Mastermind, or just really fucking confused. 😂",
            "I support you in this endeavor",
            "At least they're not screaming 😅",
            "I fully agree. I think this stresses her out too much and I don't really blame her. It stresses me out just watching her react to it!",
            "I cant look back at my videos bc of this",
            "she mad as hell ngl",
            "She's really gettin the demons out, huh.",
            "She HAS to be aware of Mastermind at this point. I mean 200k people are playing today! There's no way her team doesn't know and hasn't told her. \n\nI wouldn't put it past her to mess with us because of this. 😭",
            "I feel like she always does Chiefs when he’s there",
            "She sings Chiefs when he's there and he's there.",
            "Fans always sing that line even if he's not there (he is though)",
            "I was there! I was the only one singing & dancing in my area though",
            "“Fuck your Mastermind” edition",
            "I see what you did there 😆",
            "Every time I'm in this thread I think \"should I start playing mastermind\" 🤣",
            "Hello fellow swiftie attorney! Big fan of breaking up the day with these livestreams lol",
            "I was waiting for that…I saw her wave and I’m assuming at him! 🥰",
            "Tortured Poets Mega Super Black Dog variant confirmed 🖤🖤",
            "Good one. \n\n\nI do think Florence Welch will join her for Florida too ( my hopes of that music video are now down 😞 )\n\n\nAlso I am hoping she would play one of those \"never played live\" songs from Folkmore : Hoax,  Happiness , Closure are the ones pending after a.year !",
            "Choosing to believe that's Post Malone's mom",
            "1. Don’t pressure yourself to remain in a spot if you need the space, she’s just as good on the screen.\n\n2. Eat properly before.\n\n3. Hydrate and limit alcohol intake.",
            "Make sure you Dress appropriately for the weather, make sure to stay hydrated, and it’s more worth it to step out sit down and take a break rather than remain at the front!",
            "In case anyone is curious, they’re in the tent on the surprise song piano side. Opposite of the side Travis was in for Argentina. Ya know, if Taylor’s constant glances over weren’t going to give it away lol",
            "🎶 I'm just mad as hell 'cuz I loved this place for so long, London 😭😭",
            "i’m so nervous for the surprise songs, it’s gonna be favorite child behavior",
            "That VIP tent gonna be PACKED.",
            "Homegirl probably has to get her hair done weekly  in order to keep those bangs in check. 😭",
            "She always says that when describing folklore",
            "Miss Ma'am, do you remember what you wore last time? I didn't know today was Groundhog Day!",
            "I have a vague gut feeling that Jason is to blame!",
            "I'm still recovering from witnessing a triple mashup in person",
            "UPDATE: They are at the show.",
            "“So Long, London.”",
            "I saw someone joke \"get outta my pub\" and I'd love it.\n\nMaybe Sling yer hook?",
            "Bo'll o' wota",
            "Agree, I think saves London Boy and So Long London for the August shows cuz he will be at Training Camp",
            "LMAO god imagine the chaos if she did!!\n\n“So there’s no rules anymore… *sings the same songs*”",
            "Jason brought shorts for Jason! And the ever present flip flops 😂💜",
            "Right!! Like he literally kissed her goodbye and put her in the cleaning cart 😘🧹",
            "Dude I would bet most of the people in the pit are dehydrated, if anything. Not willing to give up the spots they have stood in line holding since 4:30pm for a bathroom break.",
            "Pretty sure Benji set that fire 🔥 🐈",
            "Ross is never beating the Travis allegations 😂",
            "exactly! and look, most pubs in london are either called like the king george or some hipster name like pine + crane or whatever so you might as well replace it with something on theme and melodic.",
            "I've never been so excited for strangers to enjoy a show. I hope they have a blast.",
            "Do it! It’s so much fun!",
            "Haha they’ll be in the royal box",
            "I feel like royalty would surely be in a box??",
            "For the rest of the tour 😂",
            "Okay I can’t lie though, imagining something like “and I hope it’s shitty in The King George” has me laughing 😂"
        ]
    },
    "Prince William dancing to Shake It Off": {
        "title": "Prince William dancing to Shake It Off",
        "score": 716,
        "url": "https://v.redd.it/pm046blhd38d1",
        "content": "Get it King 😂",
        "num_comments": 78,
        "comments": [
            "I was expecting polite clapping but he is LIVING for it",
            "damn, i didn't know he could move like that",
            "Remember when Prince William followed Taylor onstage to sing with Jon Bon Jovi😂\n\nhttps://preview.redd.it/b2hwaacnq38d1.jpeg?width=1170&format=pjpg&auto=webp&s=7a7c9b2d12b612a8ae706b8296b6c84adfe649be\n\n[People](https://people.com/royals/prince-william-reveals-how-taylor-swift-convinced-him-to-sing-on-stage-i-followed-her-like-a-puppy/)",
            "Are we sure that’s him? Lol",
            "He totally let himself go in a good way and it's great that he seemed to be really enjoying it!",
            "Yeah I was there closer to the VIP booths, saw him going in.",
            "Pretty sure that’s Carlton",
            "oh shit, he’s getting down with it!",
            "[Link to a tweet where the video quality is a little clearer](https://x.com/sohighschooll/status/1804438883213406503?s=46)\n\nSame future King of England, same 💕☺️",
            "1989 girlieeeeee!",
            "Damn William, get it!🕺🏽 I’m glad to see him having fun. YES he’s a prince and YES he is unfathomably privileged and rich, but I have a warm heart for him as I would anyone whose father and wife are fighting cancer at the same time. Awesome video.",
            "Get it King 👑🕺🏻",
            "Can anyone say what other celebs/famous people went to this show?",
            "YOU TO GIRLLL(boy)!!",
            "I was not expecting him to go that hard 🤣 it’s kinda cute how into it he is.",
            "Good for him! He probably needed that.",
            "Omg I am LOSING IT. This is so good.",
            "He was there with his cousin and her kids and some other friends as well. The picture that there official Instagram posted was so cute 😭",
            "Adorable",
            "Little kicks?",
            "Now this is just way too cute! 🥺",
            "Is that his brother to the left?",
            "That is not him",
            "That can be controlled with medication today! \n\nPhenobarbitol, levetiracetam, zonisamide and potassium bromide…?",
            "[removed]",
            "That's what's sending me 😭 I've never seen him let loose this much hahaha",
            "Dancing like nobody's watching is The Only way. \n\n\nThat or, in your mind, you're dancing like crazy, but since you're in a lift, you'd have to muster all your self control",
            "He's really going for it lmao",
            "is that him!? if so i am DYING. shake it off sir, looks like you’re overdue 😂",
            "Amazing that Taylor has this effect on literal royalty hahaha",
            "I remember reading this. It was so cute.",
            "100%. Princess Charlotte is there too! She's on the right",
            "According to the photos that were posted, that's definitely him",
            "if i could give this comment an award i would ![img](emote|t5_2rlwe|1066)",
            "With. This. Sick. Beat.",
            "Princess Leonor of Spain and her sister Sofia, Salma Hayek, Stella McCartney, Cara Delavigne, Zara Tindall,  Lily Aldridge, Nicola Coughlan (Penelop in Bridgerton), Kelce brothers (obviously)",
            "And based on your user name, one you'll hopefully like... Nicola Coughlan was there in VIP too",
            "Keir Starmer and Cara Delevingne were there that I know of, Travis Kelce and co as well too obviously",
            "some of the bridgerton cast - the only one i know for sure is nicola coughlan",
            "I am almost 100% certain I saw Molly Gordon (The Bear, Shiva Baby) walking around",
            "Sweet fancy Moses",
            "What 😭???",
            "That's literally the prince of England OMG 😭",
            "Poor guy has a lot to shame off these past few months. Go Wills!",
            "I DID NOT expect him to be going that hard  😂😂",
            "hehe i mean she has royal blood herself lol",
            "i loveee this emoji smmm ![img](emote|t5_2rlwe|1066)![img](emote|t5_2rlwe|1066)",
            "Emma Bunton was also there according to her instagram! Leslie Mann was also in attendance",
            "I didn't find out til after that Nic was there and I was wearing my Polin bracelet 😭",
            "I can't see the top comment but as a Brit I can promise you that family doesn't deserve any respect 🤣",
            "😒 get some life , he is prince because of his father.",
            "They said that too many people are stupid for dancing to Taylor Swift.",
            "Please don't speak on behalf of all Brits, it's weird behaviour.",
            "That's literally how royalty works?????",
            "Bsdk ghar mein toilet nahi hai kya, jo jaha taha hag raha hai chutiye?",
            "Now imagine being so stupid that you come into the Taylor Swift sub to tell the people there that they’re stupid for dancing to Taylor Swift.",
            "Must've been matty h's alt account",
            "You don't know what \"A\" means? The royals' wealth comes from colonisation and murder. Prince Andrew is a sex offender and they paid off his victim. I have no time for these evil lizards taking my money and demanding my respect 🤣",
            "[removed]",
            "Lol , that's why I said , there fans are kids , logically impractical & critical thinking me toh hai hi zero",
            "Fr like girl what did u expect to happen",
            "You’re on a Taylor Swift fan sub. Like are you lost? Go back to your corner of Reddit and stay there.",
            "We’re all supposed to realise how stupid we are, I guess. Yeah, cool, thanks?",
            "So what dear , are you so cowardly that you can't take criticism , pampered girls.",
            "Well if ur stupid for stanning Taylor Swift then my IQ is -500 and I am proud of it 😎",
            "Criticism for dancing to music? Why can't we just enjoy something we like",
            "And man your profile is gross.",
            "Oh to be as miserable as you.\n\nDoes your mommy not love you enough? It’s ok, you can still get help.",
            "none of your business that were enjoying what we like and there's no need to make anyone offended. you are you and we are we.",
            "That’s why we like Taylor Swift. She teaches us smart people words 🤣",
            "Holy shit, I just looked. I stand by my comment about his mommy not loving him enough. “Degrade my sl*tty f*t friend” like what? You ok babe?",
            "Not once, not twice. Three separate posts about it. If that’s their friend, girl needs to ditch this one."
        ]
    },
    "the fire at taylor's apartment": {
        "title": "the fire at taylor's apartment",
        "score": 4249,
        "url": "https://v.redd.it/qmww8lm46y7d1",
        "content": "nsfw: swearing\nbenji at the end is so funny",
        "num_comments": 403,
        "comments": [
            "Benji at the end… he definitely started it",
            "This is so funny to me lol … when she can’t get the extinguisher to work “…. bitch.” 😂😂",
            "https://preview.redd.it/6uvcqqt1jy7d1.jpeg?width=668&format=pjpg&auto=webp&s=ef6b448c626de1708de307482fdc634f56a997f6",
            "*If I'm on fire, you'll be made of ashes too.* - Benji, probably",
            "Our purses are ruined… and my shoes… and the whole room I think. 😂",
            "*So yeah, it's a fire, it's a goddamn blaze in the dark and you* *~~started~~* *extinguished it*",
            "\"BITCH\"\n\n  \nGod I lover her SM lol",
            "……this is not the main thing, but why are her shoes on the counter????",
            "This is so chaotic and relatable, this absolutely looks like something that would happen to me and my friends lol. XD Also love the video with her and Gracie writing Us!!! Seeing two friends just so dang excited about what they're doing is very heartwarming!",
            "This video has been cracking me up all day lmaooo Taylor struggling to get it to work (“BITCH-“), Gracie just standing there laughing at everything, poor Benji peeking in like wtf ?? hahah and Taylor in the beginning, “no I think we’re gonna DIE!!”",
            "She really meant it when she said “I’m gonna burn this house to the ground”",
            "Easter Egg for Picture To Burn??? 🤡\n\nDebut is coming. /s",
            "Gracie pointing at Benji at the end was what absolutely MADE me.",
            "I just love seeing her like this. She seems so happy. Us is also an amazing song.",
            "Real life really is just Sims",
            "she's so CALM though, like confused af but calm. I would have been crying and letting it get so much worse.",
            "Everything about this is hilarious 😂 Rumour has it if you listen real carefully you're gonna hear the fire extinguisher replying \"don't call me that!\"",
            "I’ve seen several comments about making sure to keep your fire extinguishers current. This is true! However, I do have a tip that is relevant to the lazy people who will (like me) not remember to check them yearly, get a fire blanket to keep in the kitchen. It’s made to smother any type of fire and will not expire. \n\nAlso, baking soda will put out a grease fire. When my dad almost caught our kitchen on fire, he put it out with baking soda. I’ve never forgotten.",
            "As someone who trains people how to put out fires as part of my job, this is absolutely hilarious.\nOn first watch I was like “babe, no. Do this, not that etc”\nThen on second watch I was like “she’s had wine, it’s the middle of the night, I’d have just panicked and died” \n\nProps to her, I’m trained to know what to do (at my work) but no idea what I’d do at home after a few drinks (buying a fire extinguisher asap!) 🤣",
            "A little insight into Taylor's domestic life. Shoes on the counter and no access to a wet tea towel that would have put the fire out immediately. \n\nHowever points for knowing where the fire extinguisher was quickly, having one that worked and being able to make it work. I failed on all three counts once and barbecued a lawnmower.",
            "Why isn’t her smoke detector screaming at her? I can’t even put my oven on certain temperatures without my alarm being triggered by the heat, no fair!",
            "Not going to lie but Taylor really is someone I’d love to be friends with!",
            "I can't get over how calm she is like this happens all the time 🤣🤣. The slew of profanity that would be coming out of me trying to get the fire extinguisher to work and she's like \" were just gonna fire extinguisher it\" I can't 🤣🤣🤣☠️☠️☠️",
            "This video is everything. So funny, love that Gracie posted it!",
            "*The room is on fire, invisible smoke*",
            "Benji at the end... \" I told her not to do that. I'm the perfect golden child\"",
            "With Benjamin making a cameo appearance",
            "Not me snoopin at what little things are going on in the background what’s out and about",
            "I started a fire at your apartment straight from the disappointed fire safety department.",
            "“You left your fire at my apartment”",
            "holy asmr what is Gracie doing with her mouth before she and Taylor laugh. omg",
            "This is hilarious because when Gracie described this in an interview, she was talking about what a boss Taylor was saving them, meanwhile Taylor was actually like “I think we’re gonna die!” ",
            "cover and smother cover and smother cover and smother",
            "Nobody: ...... \nDr Taylor Alison Swift;   BITCH!",
            "taylor when she said the rep vault tracks will be “fire” 😭😭",
            "What was on fire?",
            "WHY ARE THE SHOES ON THE TABLE???",
            "Wait? Who released this video?? 😂",
            "Haaaaa\n\nThis is going to be such a good unintentional PSA on how to put out fires though. And I bet you fire extinguishers go out of stock this week hahaha",
            "\"..bitch-\" 💀",
            "thank god that she finally got it working im so proud of her![img](emote|t5_2rlwe|1066) and she was smart not 2 use water",
            "“…It smells really good though”",
            "The way this is legit one of the funniest videos I’ve ever seen",
            "Uhhh, I’ve literally just been binging through the show *9-1-1*, so the timing of seeing this post is really something… 😅😅😅",
            "It smells really good though...  🤣🤣🤣",
            "Well at least now she knows how to use a fire extinguisher, heh heh. 🧯🔥",
            "Taylor’s dress has a strong TTPD vibe",
            "Her dress is really cute 😍",
            "I love the cat 🐈 essentially strolling in dissaprovingly rolling its eyes 👀 and being like you stupid biatches",
            "this is so funny and relatable real 🤣🤣 hysterical",
            "LMAOOOOOOOO GOTTA LOVE HER",
            "I’m impressed she knows where the extinguisher is!",
            "Reading this thread while the computer-based portion of my annual fire extinguisher training plays. I wish I could edit blond hair on this little stick figure who is considering what to do, running around, and finally putting out the fire with an extinguisher.",
            "This is like a celebrity version of an ad for those fire blankets. lol :D",
            "maybe this will help someone, but a fire that small, js cover it. smother the fire out with a pan or smth",
            "Why is this so funny tho 💀😭",
            "That was a small fire. She could've just thrown a big pot over it. Now she has to clean up the fire extinguisher, though I hope we get a song about it.",
            "I also love how Gracie’s first inclination is to record the situation. I’d be running and screaming lol",
            "Does this kitchen only seem small to me?? I mean small for tswift money bc I’d love this kitchen lol",
            "![img](emote|t5_2rlwe|1082)![img](emote|t5_2rlwe|1070)![img](emote|t5_2rlwe|1081)",
            "Wait, when did she post this? I missed it!",
            "She is so calm 😭 much calmer than I would have been lol",
            "i love this",
            "Where / when is this from?",
            "I’m dead this is something I would do then be like bitch work lol",
            "This video and thread might save lives!",
            "she’s so me",
            "Our queen put out an actual fire! Also, this video is so relatable and I love it. ❤",
            "Literally calm, and not scared",
            "Hilarious",
            "The battle with the extinguisher is something I felt 🤣",
            "Good exercise!",
            "\"I'm not even mad. That was amazing.\"",
            "This is all of us. I love her sooo freaking much!",
            "Impressed that she had a working fire extinguisher and knew where it was.",
            "Ok can someone explain why it didn't spray the first two times? It looked like the trigger was fully pressed all the times. Is that how it's supposed to work?",
            "She needs the fire blanket.",
            "Was this at Taylor’s or Gracie’s house?",
            "I love this so much.",
            "what a waste of resources that human is. ",
            "It's not a part until something on fire.",
            "I'm rather surprised that she didn't have smoke and fire detectors in that apartmemt. Especially know what she paid for it. I bet it got retrofitted pretty quickly after that if she didn't.",
            "ok but what is on fire? is it a cake or a candle?",
            "How did you get that video?",
            "Where did this video come from???",
            "Not me going “PASS, Taylor! PASS!!” While she tried to use the fire extinguisher lol",
            "i cannot tell for the life of me, what the thing on fire actually is lol",
            "Oh dear 😂😂",
            "“And the whole room I think” 😭😭😭",
            "shes amazing",
            "Lmfao my husband just shows me this and goes ‘you have to pull the pin!’ lol",
            "Save the shoes!!",
            "Cover it with a pan.",
            "Toss some baking soda on it next time Taylor",
            "My smoke alarm goes off if I look at it sideways. I worry for her safety in (if) the absence of smoke detectors.",
            "So how many of these do we reckon we're going to see as Eras Tour costumes this weekend?",
            "Wow",
            "Put a bowl or plate or lid over it lol",
            "Who’s taking the video?",
            "# Put A Lid On It - Squirrel Nut Zippers (1996)",
            "pouring baking soda on it would work too",
            "Ok, everyone who's buying themselves a fire extinguisher after seeing this: \n\n#Have it an easy to access place! Don't stuff it in a cabinet somewhere, make sure you can grab it easily in case of a fire!",
            "the tortured taylor's apartment",
            "lol  where did you get this video?",
            "This is literally the  commercial for that  fire blanket I always see on instagram.",
            "Fire burn and cauldron bubble",
            "I have had this exact situation happen with a big candle fire in the kitchen and I wish I could have been this calm about it.",
            "Pull the pin .... point & spray ... purple k for kitchens",
            "this is why I don't use real candles anymore. I'm so freaking paranoid about fires.",
            "I couldn’t help but think she should have a bunch of Fire Blankets! Fool proof.",
            "The totally calm way she's like \"we are going to die\" haha.",
            "Why fuck would just not drop a wet towel over the top of it, no mess no fuss. But hey, at least you don't need no man I guess 🤣🤣🤣",
            "Fire? That's an overexcited candle. Just cover the thing",
            "Can someone please explain to me how two candles have set on fire while they’re together, and how tf candles set on fire",
            "That’s an apartment?!\n\nSheesh.",
            "Where is Travis at???????",
            "Does anybody know if this video is recent?",
            "Well...there's a first time for everything, even for using the fire extinguisher. Having lighted candles out and a free roaming cat don't mix.",
            "I don’t know what’s better: Taylor calling a fire extinguisher a “bitch” when she can’t get it to work, Gracie *trying* to offer some advice but being barely able to get it out because she’s laughing so hard, Taylor saying “we’re gonna die” in the most casual and almost cheerful voice ever, Gracie pointing an accusatory finger at Benji, or the lyric puns in these comments",
            "Omg it's so small. Flour, a towel. Just smother it instead of struggling.",
            "Benji coming in to see what's happening and being like 'these dumb bitches' 😅",
            "Whose content was better Taylor swift fire extinguisher or twitch channel creator igumdrop fire extinguisher blanket?\n\nTough one",
            "She doesn’t know the PASS method apparently.",
            "You left the flames on at my apartment\n\nStraight from the fire estinguisher department",
            "Or just throw a towel over it ffs. Where did the common sense go?",
            "Literally just put a lid on it or another pot on top",
            "Taylor, babe, put a lid on it..",
            "She’s gonna burn this house to the ground",
            "Salt would have been easier.",
            "Question though: Why was the fire alarm not going off? I fry chorizo in a pan for a minute too long and mine is blaring. This is a full-on fire and nothing?",
            "Where did you find this video?",
            "WHO IS THE CAMERAWOMAN?!",
            "That fire took longer to put out than her longest flight",
            "But why isn't the fire alarm going off?",
            "\nShoes on the counter=adhd we put out shit in the most random places",
            "Be nice to Taylor. She’s the hardest working person in the music industry",
            "Really she couldn’t just smother that fire or put it in the sink?",
            "Wait is this the Taylor swift hate sub? Cuz this sure looking stupid as hell",
            "Lost respect 4 this jackass",
            "[deleted]",
            "Well, Looks like her next song/album will be about Fire.",
            "She rents??",
            "Stop filming, slide into sink start faucet. Or put on pot holders and put in sink",
            "Just cover the fuckin thing. Y’all, please learn basic fire safety. It can save your life.",
            "Now don't out down the smart phone and help with the fire....",
            "put a pot lid over it",
            "Did grace say this happened to me before and stop",
            "has to be fake... really,  someone holding phone and isn't helping?",
            "Ah yes, when a house fire breaks out…record it… cos you’ve GOT to get it on social media 🙄\n\n\nEdit: am I missing something here? If a fire breaks out in your friend’s home (which spread very fucking quickly btw), and you decide to do fuck all to help but just pull your phone out to record….? It’s so ridiculous, no? Literally the best example of when people record when they should be helping and videoing would be the last fucking thing on your mind 🙄",
            "My last birthday cake had more flames ![gif](emote|free_emotes_pack|facepalm)",
            "Let her cook",
            "She didn’t even know how to press it 😭😭😭",
            "Next time, just, put a lid on it. \n\nThere's a joke in there somewhere.",
            "Put the phone down and help put out the fire 🧯 Couple of modern idiots",
            "“Call the slaves to clean this up”",
            "Why…….why can’t she read directions? Why does she know anything about fire safety. Why didn’t she just use a wet rag?",
            "Box of rocks is looking pretty f'ing smart right about now.",
            "She’s such a hero!! 🤮",
            "Up vote if you hate Taylor Swift be truthful",
            "Don't rich people have like ceiling extinguishers?",
            "I can't imagine thinking that would \"ruin\" my purse or shoes. They're totally *not* ruined.",
            "\"Oh look, the table on fire, quick record and post it on the interwebs.\" 🤦‍♂️",
            "Stupid",
            "All I can think about is her shoes on the counter after walking in NYC 🤮",
            "She needs to calm down",
            "Ooo and Gracie is holding up a 1 at the end! Keeping the 321 countdown going I think until we get Karma!",
            "\n\nSo yeah, it's a fire, it's a goddamn blaze in the dark and Benji started it",
            "Well, it wasn't Bille Joel, that was sure",
            "You don't get to control someone's emotional response to being called bitch in front of the entire world.\n\n-- the fire extinguisher",
            "I’ve never felt more seen 😂",
            "When she says, \"I think we're gonna DIE.\"",
            "I know lol when she said that literally me : 💀",
            "I'd have an equal reaction to an extinguisher not working lmaooo",
            "She’s literally me when I get mad at stubborn objects 😂",
            "This was what stood out to me too haha relatable",
            "I think TS didn't pull the pin of the fire extinguisher.  Once the pin is pulled out, it's effortless to spray.\n\n\nI would have been worried about the Cats being sprayed or getting that chemical on their paws.\n\n\nTime to check smoke alarm batteries.🤷‍♂️",
            "Literally me",
            "My exact response when something isn't working like I thought it would",
            "Taylor is just like us!!!",
            "All she needed here was a damp cloth...what a disaster.",
            "I literally never listen to the ice spice remix so it's the first time I'm discovering these lyrics 💀",
            "LMAO ![img](emote|t5_2rlwe|1066)",
            "Underrated reference HAHAHA",
            "Literally a mastermind ![img](emote|t5_2rlwe|1067)",
            "hahaha witty reference! never thought this lyrics exist on her Karma song",
            "Omg 🤣",
            "It’s ok she just buy another room and have it replaced lol",
            "smells really good tho 🤣",
            "I once lit a candle in my room and then forgot about it and left my music playing. As I walked back into the room, I noticed the candle was all melted and the exact lyrics that I heard were the lyrics you mentioned.",
            "Literally how I talk to inanimate objects.",
            "The way she said it though…",
            "I mean this in the best way, she uses the B word the way Donald Glover describes using the N word.",
            "Lol I was wondering that too 😂😂 and did they both put them up there? She says “our shoes” but why were their shoes on the counter to begin with?! Hahah",
            "I imagine her shoes are generally cost the same as a down payment on a good car, that may warrant a spot on the counter 😅",
            "I've put my shoes on a table or countertop near my purse if im rushing getting ready to leave and want easy access to them and also don't want to trip over them (or to help remember to wear that pair instead of my typical shoes!). But i never put them upthere once i get back from somewhere...",
            "I'm choosing to believe they are new shoes and they're still on the counter bc she just unboxed them🤣",
            "Cats. Cats is why 🤣",
            "I can forgive everything but this. I don't care if they're designer Taylor, the counter is where you prepare food!",
            "I’m guessing the cats. We all know she wears very expensive shoes a lot of the time, and though she is a billionaire, she probably doesn’t want to have to replace them constantly, and she’s mentioned that Olivia in particular is a bit of a troublemaker. Probably learned to leave her shoes up high where the cats won’t get to them 🤣",
            "Yeah, my brain is just life flashing before my eyes at that,  on the kitchen counter not any counter a kitchen counter.\n\nThis is what people mean when they say these riches people are crazy out of touch. What are they doing? Trying to get some siren of disease.  They will have to worry because like if they get slick with the plague, they can literally just carry it. I guess I don’t know crazy they live in York?! do you know what those streets are like? I can’t.",
            "She’s rich enough to be able to afford a cleaning service, so having to clean the counter wouldn’t prevent her from putting them there when walking by, for convenience’ sake.\n\nUs poor folks are constantly keeping in mind that we have to keep our items and possessions well cared for, because we can’t afford to replace them, or have to do any cleaning/repair ourselves. \n\nThe rich don’t think like us, in preservation mode.",
            "Probably because she’s not cooking a lot at the moment hahah",
            "Where can one watch this?",
            "Taylor said “no I think we’re gonna DIE” in the calmest tone ever though",
            "(Kitchen to Burn remix) (Taylor's Version)",
            "He went 🧍‍♂️",
            "NOT \"I think we're going to die\" sounding like \"Please pick up some eggs at the grocery store\" 💀",
            "I think she’s pretty used to high stress situations just from being a famous singer",
            "I thought she seemed like a reasonable level of flustered that I would aspire to be in that situation... until they showed they cat!  I have started a few kitchen fires and the struggle between believing in my ability to put it out and continuing to try VS abandoning all hope and chasing down my cats to toss them in pillow cases to make our escape is so hard!  I just assumed the cats weren't there so now I agree, she was SO CALM!",
            "Well she’s also extremely rich and can afford to have anything repaired or replaced many times over so I’m sure that factored into the lack of panic lol",
            "I mean she wasn't in any danger, it was a tiny fire that she could have covered.  Also, there is another person with her that doesn't scared enough to put down the phone.",
            "fire extinguisher about to get a daily mail exclusive, being like I only saved your life blondie 🙄",
            "IDK about the baking soda but the fire blanket needs more upvotes. It doesn't spread the fire like an extinguisher can, and can help avoid the need to use chemicals in a confined space.",
            "A number of fire departments and related groups advise against fire blankets. There is little instruction provided for the correct and successful deployment of one (distance, blanket position) and they absolutely should not be re-used no matter what is advertised about reusability which a lot of tout as a selling feature. Are they better than nothing? Sure. Can they be useful? For people on fire or something very small. If you do buy one, make sure it is UL listed. \n\nWhen cooking you should never leave anything on the stove unattended, have lids handy (or a sheet pan/cookie sheet larger than your pans), and if something catches fire and it's safe to do so, put the lid on, turn off the burner and leave it there - do not move it. That will be faster than locating and deploying a blanket that, in a panic, may not be placed correctly which can result in people trying to adjust the blanket while the pot/pan and/or contents are still on fire and getting injured as a result. \n\nSource: volunteer firefighter and fire prevention educator for my station. Recently attended a fire prevention conference where a few groups presenting spoke against the use of fire blankets over smoke detectors, fire extinguishers, and general cooking safety.",
            "Gracie said this was 6 a.m. and after they drank... I'm assuming they drank quite a lot considering the time... So I definitely agree with you",
            "\"I had the wine\n\nIt was the middle of the night\n\nI just panicked and thought I would die\"\n\nThis would make a great lyric!",
            "She said not to use water, so maybe it was a grease fire? Do you use a wet tea towel in that case?",
            "> barbecued a lawnmower\n\nOdd thing to serve at a cookout",
            "Meanwhile over on Amazon: Random uptick of fire extinguishers being purchased across the world (I imagine...)",
            "shoes on the counter? 😭",
            "And at least it looks like the fire was regulated to like one specific area where it seems you put candles so like they’re trying to prevent fires at at least you know",
            "I’m almost certain her cats would have destroyed expensive shoes before and she’s learned her lesson 😅",
            "I once had three fire extinguishers and an ongoing oil fire in my kitchen. \n\nAll three failed, in my panic I dumped water on an oil fire (I was 11) it was super effective; and by that I mean a fireball rolled across the ceiling and across all cabinetry and melted ceiling tiles on me. \n\nLuckily I was able to call the fire department to put it out before it burnt the house down.\n\nWho knew you could just dump 5 lbs of flour on it....\n\nFire Department did verify that literally all the fire extinguishers were defective despite 2:3 clearly saying charged.",
            "Or even just a pot lid would have fixed it. Just put the lid on and fire is out",
            "Okay your last sentence has me rollin 😂😂😂",
            "Its essentially an oil fire, water would have made it go kaboom.",
            "Her maid is gonna have a hell of a mess to clean up. That extinguisher powder goes EVERYWHERE.",
            "Obviously this is all staged my dude, to make her look relatable",
            "And she wrote 17 new songs about this day, and make another billion.",
            "This is what I was thinking! Surely she has a fire alarm system?",
            "Yeah I just commented elsewhere that imo that is the most concerning part of the video",
            "Also I would’ve thought she has full time security watching cameras of every room but clearly not 🤷🏻‍♀️",
            "Gracie also!",
            "I suspect the amount of wine drank properly contributed to her calmness. I know I'm soooo much less stressed when buzzed 🤣",
            "She was like “it’s gonna be fine” and Taylor’s like “no we’re gonna DIE” lol",
            "Gracie is SO chill lol",
            "It’s the silent laugh that happens when you run out of air lol",
            "She is laughing, it’s just a silent laugh probably bc she was laughing too hard",
            "Yeah a cookie sheet or pot lid would have put that out pretty quickly I suspect.  But the extinguisher is the next best option.",
            "A candle",
            "it was on gracie's instagram!",
            "Also my main question too!!",
            "Honestly, in the moment, I think I’d go for the most extreme option just to make it stop. But good to know because I hadn’t thought about using a big pot",
            "To be fair being drunk and it being the middle of the night doesn’t always yield perfect results.",
            "She aint cleaning shit up.  She'll take her jet to her next apartment down the street.",
            "It's huge for an apartment in NYC!! Her houses definitely have bigger kitchens",
            "Kitchens don’t need to be big to be functional. Usually exceptionally large kitchens are worse to cook in. If he hired a good interior/kitchen designer and emphasized how much she likes cooking they would have made sure to design it to be functional over expansive/showy",
            "There is like a metal pin that keeps it locked for safety you have to pull from it first (I think you can hear it cling to the floor just before she got it working). It's there so it doesn't go off accidentally if something presses the handle. \n\nThis is why it's really good to take time to read and get to know all your safety- and protection devices etc in advance, since it's kinda hard to focus reading instructions when your curtain is on fire, there is smoke and the fire-alarm is blaring in your ear 😄",
            "Candle fires often don't trip smoke detectors",
            "Water on a candle wax or grease fire is bad. It can spread the fire. She could have smothered the fire since it’s fairly small, but she handled it fine either way. The objective was to put out a fire and she did.",
            "I see people saying they were knocked over by the cat.",
            "Actual answer: Candle wax can act similar to grease and putting water on it could make the flames worse",
            "Someone’s gotta record for the internet fame",
            "Im picturing them gathered with a coven around a sorceress table.",
            "the fire extinguisher’s about to enter its reputation era",
            "Stop 💀💀",
            "I love how overdramatic they're being over what basically amounts to a candle that has melted into a flaming puddle 😂😂\n\nobviously it *could* have gone much worse, but this is definitely the kind of shit you spend the rest of your life laughing at, like \"hey, remember that one time....\"",
            "I thought this was fake??? and was like wow, they edited that fast!!",
            "You all never listened to this version and now you switchin' up your behavior\n\nIt's okay, baby, you ain't gotta \n\nworry, karma never gets lazy",
            "the emoji ![img](emote|t5_2rlwe|1079)",
            "only time verbal abuse is okay!",
            "I told my tea towel to eff off last night lol.. she was being RUDE (wouldn’t hook back onto the rail 🫠)",
            "It's \"our purses and my shoes\", you can see the two purses and then the chunky black shoes\n\n....which I just checked tswiftstyled. $3k YSL purse and $265 sezane loafers 😭",
            "My only guess is they were out eating or whatever, took them off cause they were uncomfortable on the way home, and just set them down on a counter when they got home.",
            "According to tswiftstyled they’re less than $300! I expected them to be more expensive too, but she does sometimes wear more “affordable” items!",
            "The only thing I can think about is not wanting the cats to get them on the floor. Since I’d never put my shoes on the floor when I get home, cause my dogs will rip them apart given the chance (I’ve put them in the cupboard).",
            "I prep food in the kitchen counter- could never put my shoes there, seems too unhygienic",
            "Growing up I was taught putting shoes on a counter was bad luck.",
            "According to superstition that beings tragedy lol so I never do that. Maybe the superstition started because it’s super filthy to do that",
            "That's nasty",
            "…it’s really easy to wipe a counter down with some kind of disinfectant. Y’all keep acting like it’s so hard to clean a counter",
            "i dont think her wealth has anything to do with where she sets her shoes down😂 i have sat my shoes down on the counter before and then wandered off and forgotten about them. and its not that hard to wipe down a counter. ",
            "ok chill. I’ve seen multiple friends get into bed with their dirty ass shoes on and it’s not bc they have a 24/7 maid lol.",
            "It’s on Gracie’s Instagram!",
            "They’re burning all the *kitchens* even if you aren’t one.",
            "dont give taylor ideas my bank accnt is crying right now![img](emote|t5_2rlwe|32929)",
            "I mean, I'm sure they were also drunk which helps lol",
            "There’s no way I’d not have died 🤣 props to her!",
            "I’d very much like writing credits on TS12 if Taylor lurks in this sub 😎 (😂😂)",
            "It was a candle wax fire, but no, you should not use water or a wet towel to put out candle wax or grease fires. She did the smart thing. \n\nEveryone should have a kitchen fire extinguisher, and keep them current because yes they do expire by losing pressure over time.",
            "This is very important for fire safety especially for grease fires. DO NOT!!!!! use water to put out grease fires people!! That’s how my neighbors immediately kickstarted a huge house fire and lost their house. 0/10 do not recommend and it was honestly pretty traumatizing too. Make sure your fire extinguishers aren’t expired.",
            "Baking soda should work and is in basically every kitchen.",
            "Won't help in a grease fire. They do make small fire blankets for stuff like this that is another option to a fire extinguisher.",
            "I am no expert but for chip pan fires a wet tea towel cuts the oxygen off straight away. The fire extinguisher did the trick though but would have caused a mess.",
            "You're far better off getting a fire blanket so that you don't have to guess. Fire blanket and an extinguisher. ",
            "A cookie tray over the top would have ended this in seconds with much less damage.",
            "You can buy a fireproof silicon towel that you toss over small fires to put it out",
            "a wet towel would probably work.  the idea here is to smother the fire, to cut off the oxygen.  and a wet towel would probably do that.\n\nwhat you don't want to do is pour or spray water on it, since water and oil don't mix.  the force of the water will just spread the burning oil around and make your fire bigger.\n\na wet towel won't do that.  it will either put out the fire or catch on fire.  but it won't spread it and make it worse.",
            "It was unintentionally barbecued. I learned that when something starts to burn and also has petrol in it the result is fairly spectacular.",
            "Her power!",
            "I just realized I don't have one.... whoops",
            "Yeah I’m checking mine tomorrow and ordering a new one if it’s expired 🤪",
            "No, no, no, no you cannot put flour on a fire.  It can make it worse.  Only baking soda.",
            "Smoke alarm detects smoke. Candles and wax fire burns clean enough to not create lots of smoke.",
            "I don't know... When I was young, fire safety was drilled into us all throughout childhood (e.g., \"stop drop and roll;\" touch the door before opening; etc.) but I get the sense that younger folk these days don't know how to deal with fire. And Taylor ain't *that* young.",
            "Haha yea but somehow I imagined it’d be a “normal” sized (non nyc sized lol) kitchen.  The kitchen is prob at least 2x the size of my room in nyc lol",
            "I know but the space to the left of the island seems narrow",
            "Never said put water on it, I said a wet towel wouldn't have ruined anything. It would have just smothered the flames out, with no messy or costly clean-up. This I know as that is what we teach to do in the kitchen. But as you say, the main objective was met, and no one was hurt. So that is a good thing.",
            "I think it already did after the comment, it was like....Are you Ready for it?",
            "Yep, but Gracie said it was 6 a.m. and they had drank (I would believe a lot, since they were awake until 6 a.m.) so I'm not sure how dramatic was Taylor being and how much she was just not sure of reality",
            "so i keep my head up, my bread up\n\ni won't let up",
            "[deleted]",
            "(Verbally abusing AI is also acceptable since it doesn't have feelings)",
            "Dude it's not that deep",
            "Oops, you’re right! So it’s just her shoes then at least 🤣\n\nRip to both Taylor’s shoes AND their purses though lol",
            "Ugh yes Gracie, save the YSL!!!! Shook",
            "I thought about that too, but don't the cats just jump up there anyway?! Lol, maybe it helps differentiate between toy and not toy though",
            "My cat has vomited into my shoes before 🤣",
            "\n>my dogs will rip them apart given the chance (I’ve put them in the cupboard).\n\nThose poor dogs!",
            "If you have a cat, you need to always clean the counter before food prep anyways",
            "I hear ya, but my adhd needs what it needs 🤣 and its never shoes that are visibly gross, definitely not my everyday shoes/hiking boots/etc, more like heels or nicer shoes i wear once a year (though, yes, of course they can still pick up germs)",
            "Taylor seems like she’s very clean, she probably cleans the counters before she cooks, seeing as that’s what you’re supposed to do *anyway*",
            "Same!! Putting shoes on the table will make you end up poor according to my cultural superstition hahaha",
            "Same! But with new shoes. My brother once inadvertently put a shoe box with my new shoes inside on the table and I was so mad I cried 🤣",
            "Swaying as the room burned down",
            "Oh, they for sure were. Gracie talked about this moment on an interview and said it was like 6 a.m. and didn't know how Taylor handled it so well given the time and how much they drank.",
            "Nah smart thing would be to smother it with a sheet pan since it was contained in the circular candle holder thing, and then they wouldn’t have breathed in the fire extinguisher chemicals.\n\nBut overall they handled it fine.",
            "Putting water on a grease fire to use simple terms, makes it explode and launch burning grease everywhere that might be on fire",
            "Google says a wet towel is fine for a candle wax fire if you can smother it and remove the oxygen using the wet towel. Obviously not a grease fire.",
            "And watch a video or read up on how to use it! I was taught how to use one at some point and that information (buried somewhere deep in my brain because I don't ever remember actually learning it) came in handy when I had to stop the fire shooting out of my grill and hitting the side of my house.",
            "Nope wet towel would have been fine just laid on top of the candle.",
            "Smart thing would have been to take a bowl and put it over the fire. People underestimate how messy fire extinguishers are. For Taylor it’s no big deal because she has cleaners, but for you or me it would be a nightmare.\n\nAlso a wet towel is perfectly fine for a candle wax fire.",
            "Even a broken clock is right twice a day.",
            "I would not have guessed a candle fire counted as a “grease fire” so thank you, you learn something new every day!",
            "This happened to my BBQ the other day. Baking soda did wonders on the grease fire and immediately extinguished it. It's also way easier to clean up than the aftermath of a Fire Extinguisher.",
            "Or salt. For a fire this size salt would work fine.",
            "Flour is also a good alternative.",
            "Yes, but under pressure, a lot of people don’t think of these things. Their first thoughts go to water or a fire extinguisher, if they have one. Most people don’t really think of these little tricks, even somewhat calm-under-pressure people like Taylor and Gracie",
            "Thank you for this new item to put in my bug-out bag. I LOVE BEING PREPARED",
            "I think this is a candle. Which reminds me I need to get a new fire extinguisher if I’m gonna be burning any candles.",
            "I'd think the stuff explicitly designed to burn violently burning is kind of obvious",
            "As a childhood pyromaniac (turned scientist!) I can appreciate your respect of the spectacularity of fuel and dangerous machinery 👏",
            "Have it an easy to access place! Don't stuff it in a cabinet somewhere, make sure you can grab it easily in case of a fire!",
            "That's actually how it was extinguished funny enough. They didn't run in with hoses or extinguishers. Only axes and fans. It was a 2 quart aluminum pan that had the oil in it. So not super huge. Was able to smother it.\n\nI learned some lessons that day for sure.",
            "Fair enough!",
            "For NYC it’s humongous",
            "BABY LET THE GAMES BEGIN![img](emote|t5_2rlwe|1066)",
            "Facts",
            "They were literally just joking.",
            "Wow, that is quite a lot of anger in response to a silly lyric joke",
            "I mean... neither was my joke. lol",
            "They don’t stay in the cupboard for long. I think they secretly enjoy it",
            "Somehow I feel like Taylor will be fine on that one... 😹",
            "You'll end up poor because you'll have to buy new shoes after using a fire extinguisher to put out a candle fire.",
            "My Mum always told me it was only unlucky to put new shoes on the counter. But once they'd been worn once it was no longer unlucky. Seems the wrong way around to me...but what do I know!",
            "Exactly.  Smother it with something non flammable. Jesus. Doesn’t take much thought.",
            "Is this an AI answer from google? Or a reputable site? Can't be too careful anymore.",
            "P.A.S.S. (Pull, Aim, Squeeze, Sweep) is **grilled** into my brain thanks to the documents I deal with for work, but I have no idea if I'd remember it during an actual emergency. 😂",
            "It doesn’t really count as a grease fire, but pouring the water can cause the wax & fire to splash up & all over from being displaced. There’s a video of exactly that happening to Gracie from years ago which is probably why she’s so adamant that they don’t use water.",
            "Like another person said, candle fires aren’t grease fires but throwing water onto it can displace the wet wax and cause the fire to get bigger. I mainly mentioned grease fires as that’s what the person I responded to mentioned\n\nI still think it’s very important that everyone knows specifically not to use water for grease fires because it will cause the flames to pretty much engulf the room within seconds. That’s what happened to my neighbors, their fire spread throughout the interior of their home. By the time they ran out their front door it was already very large with lots of smoke. There’s youtube videos you can watch to see how grease fires react to water, it’s not very pretty",
            "Fun fact - most fire extinguishers for class B and C fires are going to have mostly sodium bicarbonate in them. Baking soda.",
            "I recommend fire spray vs. an extinguisher if the latter is tricky to use. And unlike the latter, it can be reused. Helped my now-husband, who wouldn’t have had anything in his kitchen had I not bought it as a gift for him.",
            "It's one of the reasons they are dangerous unattended. If something goes wrong the smoke alarms won't go off until the carpet/curtains/table is on fire creating black smoke",
            "Lmao yeaa",
            "Some people panic, especially when they've never been in that situation before. This type of this isn't exactly covered in schools, so without some training you just don't know how you'll react in this situation beforehand.",
            "Wet towel/even a dry towel is fine. Liquid candle wax is similar to a grease fire just not as intense. If you used water on the wax, it would just disperse the liquid wax everywhere but it would stay lit. A grease fire would explode with flames if water was used",
            "I've personally put out candle fires and deep fryer fires (clueless roommates) with a **moist towel**. You want as much moisture in the fabric without it dripping, soak it and give it a quick wring it out.\n\nSmall fire extinguishers can be dangerous by spreading the burning fluid, especially when people use them too close",
            "Wait Gracie has experienced this multiple times? 🤔 lol",
            "She even starts to mention that lol"
        ]
    },
    " Eras Tour London Night 1, Surprise Song #2 - June 21, 2024 ": {
        "title": " Eras Tour London Night 1, Surprise Song #2 - June 21, 2024 ",
        "score": 563,
        "url": "https://v.redd.it/k0stayl0k08d1",
        "content": "",
        "num_comments": 74,
        "comments": [
            "Seraberra I appreciate so much how you always find a full video with good audio!! You rock!!",
            "GIRL JUST PUT IT IN THE SETLIST",
            "London N1, surprise song #2: The Black Dog x Come Back...Be Here x Maroon (the favourite child)  \n\n* [Source: xtianproductions (TikTok)](https://www.tiktok.com/@xtianproductions/video/7383107755915103521)\n* [2024 Surprise Song Link Tracker](https://www.reddit.com/user/seraberra/comments/1d3fv88/eras_tour_surprise_song_links_2024/)",
            "Can we just assume that she's mashing up something with Maroon or YOYOK each night now? 😂",
            "Maroon must be in her top five songs of her for sure",
            "This was so insanely good! I love all of these songs and love that Taylor included a little snippet of her favorite child! 😁",
            "Oh my God, her face when she says brave man 😳",
            "just when we thought the piano surprise songs was just gonna be the black dog, she started singing come back.. be here, and then maroon",
            "This mashup was actually insane 🥰",
            "Between this mash-up and the MEGABRIDGE from Surprise Song #1....I feel like London Night 1 basically won the whole tour!!!",
            "I waited all day for someone to post black dog. You guys are the best. Tears in my eyes",
            " ![img](emote|t5_2rlwe|1079)  ![img](emote|t5_2rlwe|1079)  ![img](emote|t5_2rlwe|1079)TAYLORNATION if you're lurking in there, tell your boss we're going to need a clean digital track of this one -- take my moneyzzzzz ![img](emote|t5_2rlwe|1079)  ![img](emote|t5_2rlwe|1079)  ![img](emote|t5_2rlwe|1079)",
            "Maroon is elite and I feel justified by being so obsessed with it lol. It’s a never skip for me.",
            "At this point maroon doesn’t count as a surprise lmao",
            "as someone who lost the love of her life this week, i can’t handle this ! love u tho taylor <33",
            "Cause of death: Taylor performing Hits Different x Death by a Thousand Cuts and The Black Dog x Come Back... Be Here x Maroon (for the fourth time) in the same night, even if I wasn't there.",
            "omg the crowd’s screaming is so british!!!!! i love it (honestly idk why it surprised me im so silly)",
            "Ok i love this but her posture is vicariously painful",
            "I love her for this.",
            "Lost black dog just 4 shows before my Amsterdam show 😭😭😭",
            "😂😂",
            "Damn. 👏👏👏",
            "Wow",
            "Anyone else notice they messed up and switched the bracelets to the midnights color too early? 👀 ",
            "I want this on streaming 🥹 I also want haunted x exile on streaming",
            "For anyone standing, could you tell me if by any chance there was some space somewhere in the back?\n\nI'm going with my friend and she's very short. She's worried she's not going to be able to see anything so we are trying to figure out what to do.\n\nStanding in queue since early morning is not an option as we don't have VIP tickets so no early entry plus, we have to work.\n\n:( help.",
            "unhinged",
            "Does anyone else think the Black Dog/cbbh/ maroon mashup the week after Joe said he’d never been to the black dog was purposeful? Seems like setting the record straight to me, along with a healthy reminder of the red flags she missed",
            "Ah yes the actual \"black dog pub\" in Cork, Ireland. Where Matty played a gig 10 minutes away from on 13 June 2023. Not the disgraceful one in London that neither men probably ever stepped in thats taking all the credit for a payday",
            "Aw, thank you 🥹 it's fun to share and discuss them with everyone here!",
            "I’m not a big fan of megamash-ups replacing full length performances, but oof. Someday when she does a whole show of these, I won’t be upset in the slightest.",
            "Ikr? at this point we all know she wants it lmao",
            "Heard maroon first. Felt like we won the lottery last year but it’s definitely her favorite child! Not mad about it!",
            "I would give ANYTHING to hear CBBH live",
            "All Healey songs? What message is she sending? Still not over Matty? Travis is right there!!",
            "I know, girlie loves these. Maroon has been played 6+ times now",
            "I mean, same. Although picking a top five of any of my favorite musicians is next to impossible for me.",
            "I came running to the comments to see who else noticed!!",
            "YUP! I was shook!",
            "Also, I can’t believe we got The Black Dog played IN FULL and then Come Back Be Here AND Maroon on top of that 🥲",
            "And you predicted The Black Dog!",
            "I was there last night and cannot overstate the extent of the crowd reaction to both. Amazing moment",
            "Truly. I don’t see how this gets topped!",
            "I was there and I turned to the girl sitting next to me and I just said “oh we won” 😂 It was AMAZING.",
            "I've not bought a single live version release, but I would drop money so fast on both tonight's surprise songs.",
            "we also still have each others location, and he’s 7,000 miles away 😭",
            "As someone five weeks deep in breakup grief that hasn’t let up, I feel like the combination of surprise songs was speaking to my very soul",
            "It went red halfway through the Black Dog. And then when she started Come Back Be Here, it shifted to blue and then back to red when she started Maroon. 😅",
            "I was sat on the left side and there was lots of space at the back of the crowd - plus bc the stage is raised I reckon you’d still get a great view from the side of the stage ☺️",
            "Nah, because I don't think she also wants him to come back and be here.",
            "I think it was ALWAYS her plan to sing the black dog in London. ",
            "Chloe et al makes it pretty obvious that Maroon is about Healy. The reference to the bandThe Starting Line” that The 1975 covered makes it pretty obvious that The Black Dog is also him.",
            "1,000%. \n\nAnd someone explain to me why she did that mashup of Cornelia Street/Maroon. It was completely seamless. Is there even a more Joe song than Cornelia Street?",
            "100% a big thank you! I'm not always able to find them myself quickly and yours is the first profile I check :')",
            "I’m glad she at least found a way to sing all of the black dog in a way. But cbbh was because she wanted to say London lol. ",
            "So much hate lol. Right there with you!",
            "6 you say???🤡🐍",
            "When she sings Come Back Be Here but you're already here\n\nhttps://preview.redd.it/2casht7s218d1.png?width=1158&format=pjpg&auto=webp&s=f3b57e0cbc44a9d5a700711f02aee83d75a43282",
            "I did too!",
            "I was there too and the moment the light up bracelets turned red towards the end of The Black Dog was incredible, one of the most magical concert experiences I’ve ever had",
            "Oh no! Hugs 🥲❤️",
            "Especially because the night we got in the big fight that led to the breakup, he told me the next morning that it had been playing through his head all night and morning",
            "Oh thank you so much! That's good to hear. I think being at the back will probably be our best choice",
            "I don’t think her singing that means she feels it now, she probably played it so she could say London. I was dying for a London Boy/So Long London mashup but I think all the surprise songs she played tonight closed that chapter.",
            "Its not that black do pub though. Not in London. It has to be the black dog pub in Cork, Ireland. Matty played a gig 10 minutes from there on 13 June 2023.so time line fits perfectly. Also she mentions \"the starting line\", thats one of his favourite bands. Joe also confirmed he has never been to the black dog in London, so that pub is lying and just riding the publicity train for a pay day. See how quick they were with the merch? If either lads were regulars surely they would protect them.",
            "Think she was also winking at Trav with CBBH!",
            "I would join you but my clown suit is currently at the dry cleaners'.Carry on soldier🫡",
            "This meme will literally never get old 😂",
            "The only meme to matter from tonight 👏🏽👀",
            "I think she'll save So Long London for her last show in London in August.",
            "your flair is so real"
        ]
    }
}