{
    "Shop Distribution - The Nerdiest Post you’ll read today": {
        "title": "Shop Distribution - The Nerdiest Post you’ll read today",
        "score": 1301,
        "url": "https://www.reddit.com/r/TeamfightTactics/comments/1d3c09b/shop_distribution_the_nerdiest_post_youll_read/",
        "content": "Hey folks. Mort here with what is going to be the nerdiest game design post you’ll see in a while, but I wanted to share it with you. Generally in all aspects of life, even if you’re confident in something, it’s helpful to double check your biases and make sure you’re actually correct or not. So that’s what I did.\n\nWe’ve all seen posts where a player rolls down 50 gold and doesn’t see the uncontested unit they’re looking for, heck you may have even been on that end yourself (sorry, but wait for the punchline). Sometimes, this experience can be so stark that you’re concerned with the reliability of the system. Could this be bugged? I can’t really be that unlucky—is something wrong with the game? Now, my initial reaction is that this is a common thing called “confirmation bias” where a recent experience is being weighted more heavily. This, in conjunction with negativity bias, where negative experiences are seen to have a higher impact, become the fuel for many “Mortdogged” experiences. But even with knowledge of these biases, is everything fine? I mean, TFT has had its share of bugs, so let’s take a deep dive in the design space to make sure everything works as it should.\n\nFor this experiment, I focused on 4 costs. We pulled out 6 copies of nine of the Four Costs (these are our contested units), and left the other three Four costs as our uncontested units, with all 10 copies in the pool. At this point, this means there are 4 copies of the contested units (36 contested units total) and 10 copies of our three uncontested units (30 uncontested units total). If we do a large extensive roll down, we should see uncontested champions (30/66) 45% of the time approximately.\n\nWe ran this experiment for the first time, with Ornn, Ashe, and Kaisa as the three uncontested units (lol, Ornn is uncontested, right?), and here are the results.\n\n* Ornn: 136\n* Ashe: 168\n* Kaisa: 120\n* Lillia: 58\n* Morgana: 52\n* Kayn: 58\n* Lee Sin: 61\n* Syndra: 38\n* Nautilus: 53\n* Galio: 61\n* Annie: 50\n* Sylas: 46\n\nThe total 4 costs seen was 901, and the uncontested ones made up 424. This is (424/901) 47% of the time, which is within expected variance for something of this sample size, and matches our expectations. Good news. But of course, one time isn’t enough, so let’s run the experiment two more times. \n\n* Ornn: 154\n* Ashe: 141\n* Kaisa: 178\n* Lillia: 57\n* Morgana: 72\n* Kayn: 48\n* Lee Sin: 53\n* Syndra: 57\n* Nautilus: 52\n* Galio: 62\n* Annie: 52\n* Sylas: 41\n* Total: 473/967 = 48.9%\n\nAnd again\n\n* Ornn: 150\n* Ashe: 140\n* Kaisa: 152\n* Lillia: 63\n* Morgana: 58\n* Kayn: 55\n* Lee Sin: 48\n* Syndra: 54\n* Nautilus: 47\n* Galio: 60\n* Annie: 64\n* Sylas: 55\n* Total: 442/946= 46.7%\n\nSo yeah, generally we’re seeing the results we’d expect with a sample size this big. It’s not EXACTLY 45%, but the law of large numbers shows that this is expected, and if we dramatically increased the sample size, we would likely converge to that expected 45%. From a purely mathematical standpoint, it seems like our shop is working as expected. Huzzah!\n\nSo all is good right, and there’s nothing to be done…right? Well…no actually. Just because it is mathematically correct does NOT mean the design is perfect. If you’ve ever watched my stream, I’ve talked about how good design doesn’t just let RNG take the wheel, and designs around the core player experience. In this case, the player is not rolling down 1000 times and letting the law of large numbers do its job…instead, it’s rolling down 60 gold and expected results that are intuitive, which is that uncontested units show up more.\n\nLet’s repeat the experiment, but instead of 1000 rolls, let’s only do 40 and see what happens. Same thing, with Ornn/Ashe/Kaisa as our uncontested units, and see what happens.\n\n* Ornn: 8\n* Ashe: 6\n* Kaisa: 1\n* Lillia: 6\n* Morgana: 0\n* Kayn: 1\n* Lee Sin: 6\n* Syndra: 2\n* Nautilus: 4\n* Galio: 4\n* Annie: 0\n* Sylas: 2\n* Total: 15/40 = 37.5%\n\nBecause the sample size is so low, the variance expands pretty dramatically. Much like if you flip a coin 10 times and hit heads 7 times, 70% is way higher than 50%, but the reality is when the sample size is lower, the variance is higher. Again, this all lines up from a mathematical sense…but from a game design standpoint it’s pretty rough. Kai’Sa is uncontested here and is seen one time, while Lee Sin has 6 copies out of the pool, and is seen 6 times! These are the experiences people have that feel off, and make them not trust the game.\n\nNintendo games do a lot of fudging behind the scenes I’ve talked about before, to try to make expected outcomes more likely to happen. Famously one of the most basic versions of this is in Fire Emblem, where they double roll odds, so if something says 75%, it’s actually 87.5% so it FEELS more like 75% to people (A 95% chance in Fire Emblem is much closer to 99%!) Based on this, I think there are improvements we can and should make here, so the game behaves closer to what you would EXPECT it to, even if it is within acceptable outcomes.\n\nPersonally, this was awesome for me to confirm and was a good use of time yesterday. I like constantly challenging our game design to see if we can do better, and I think this confirms we can. It won’t be easy, it won’t be overnight, and it may not even be soon…but I think it is worth exploring, and I think we’ll start doing that as soon as possible. \n\nThanks for reading all. Hope your roll downs are within expected variance, and take it easy :)\n\n",
        "num_comments": 211,
        "comments": [
            "Going to keep this pinned for a while since the amount of conspiracy theories about shop odds have been a little high recently",
            "Mort, thanks for being so engaged with the community. TFT isn't perfect but you instill faith that the people behind the scenes care and are doing their best and that's all I can ask for in a multiplayer game.",
            "Wait...Fire Emblem has been lying to me since 2003? What can I even trust anymore???\n\n\nThanks for looking into this some more and doing a more in-game representative rolldown to see just how silly it can be sometimes!",
            "There is a simple fix to this. Give me all of the units that I want, and don't give me the ones that I don't want.",
            "Ok that's cool and all but you're still a nerd",
            "Wouldn't it just confuse things more though to have a hidden percentage that doesn't align with stated values? People can hardly understand MMR vs Rank as it is lol. There's already a lot of tft knowledge I would never have if I wasn't following high elo players who explain hidden mechanics.",
            "Great post! I've had several discussions in this sub with people claiming It was bugged and I explaining them It was probably just confirmation bias. So I'm glad I can take a victory lap now lol.",
            "In todays world of video games I am truly thankful for the time you put into this game and into the community. Great post and thanks again for being awesome Mort",
            "As a fcking nerd, I really like this nerd post",
            "I don't know if it was Spotify or some other music platform.\n\nIf you play your playlist with hundreds of songs it sometimes happens that the same artist comes 2 times in a row, or even 3 times.\n\nSo they changed the \"true randomizer\" and made it less random because people complaint it was not really random. \n\nIt was but true random doesn't \"feel\" random to people.\n\nBut that's exactly what random is. Sometimes you roll the dice and get 6 three times in a row which feels so good and lucky. Then you hit 2 three times followed by a 1 and you think the fucking dice is rigged.\n\nHumans are biased",
            "i cant think of anyone who deserves their job more than you",
            "Amazing to see how responsive you are to community discussion, a full analysis and reddit thread not 24 hours after some twitter discussion on the topic!\n\nAlthough most of this will likely focus on 4 costs as the key carries, I'd also like to see some attention given to 1 costs.\n\nParticularly in Set 10 with the prevalence of Superfans, not hitting a key unit like Kennen for almost an entire game could make it really difficult to round off your comp.\n\nWhen exploring design solutions, do you think it's worth considering that different unit costs should have different associated variances? Maybe high costs could be less reliable, but lower cost units more so - therefore reducing some of the RNG downsides when finishing off your comp if you decide to play around high rolling a 4 or 5 cost?",
            "Thank you Mortnerd❤️",
            "All I gathered from this is that it's not my fault I'm bad at this game",
            "I'd love to see a quality of life improvement where the tooltip on my unit shows how many copies of that unit are left in the pool:\n\n- Ensures player's don't need to google shop sizes from an out of game source.\n- Scouting for units out of the pool can be difficult in combat, and sometimes big models block little models on the bench.\n- Units can be in someone else's shop, which is knowledge you can't account for and can make a HUGE unknown impact on your rolldown when bag sizes are small.\n\nIf for example there are 6 Ashe's left in the pool, I might decide to roll down on 4-2. If I see in the tooltip there's actually 1 ashe because 5 of them are randomly sitting in someone's shop, I might wait for 4-3 and the shops to recycle.",
            "It's similar to how the random button in a playlist does not produce a random distribution but something that feels random to the average person (e.g. it nevers plays the same song twice in a row). \n\nThat said, I hope if these kind of things are added to TFT the mechanic is fully transparent and not some hidden tweak of the odds, because it can become very unintuitive to e.g.  hit something 90% of the time when I should only hit 50% of the time. It feels like the game is cheating even if it is in the player's favor, and I've always hated when games like Fire Emblem do this.",
            "thank you mortdog, very cool",
            "Was this simulated rolling at level 8 or level 9?",
            "As a stats guy this post gets me hornier than 3 of the same 5 cost in a level 7 shop.",
            "Ask a human to write an entire page of random coin flips, and ask a computer to do it. It would be insanely easy for you to be able to tell which is which, because the computer generated list will sometimes contain very long streaks. Humans would never feel comfortable putting H 8 times in a row, but every 8 character string has a 1/256 chance of appearing as one. In a page with 500+ letters it's actually more likely to appear than not.\n\nThe counterpart to the law of large numbers is, well, Murphy's Law. Even something very unlikely will inevitably happen if you repeat an experiment enough times. \n\nI remember a long time ago, Riot Xypherous was working on how critical strikes functioned in Summoner's Rift. This was when a standard crit was 200% damage and people would put in 1% crit runes into their rune pages. A well timed crit could change an early game lane trade into an unexpected kill and snowball from there. It was especially noticeable when, every so often, someone could randomly get multiple crits within a few attacks. Meanwhile, you could invest in early crit (25%) and not crit at all in an 8-attack trade.\n\nSo I think Xypherous made crit chance lie to you, sort of. Each time your attack does not crit, you gain a hidden bonus on your next attacks. When you did crit, it would get reset to something *lower* than your listed crit chance (like half, I would guess). It was mathematically set up that in the very long run your total DPS was unaffected, but the crits would feel more evenly distributed. As far as I know, it still works like this, or if it was changed it was by a rioter less communicative than Xypherous.\n\nYou don't need me to tell you this, but it's definitely okay to lie, as long as people don't know *and* as long as the \"true\" mechanic allows for people's assumptive play to still be viable/optimal. Like would people play any differently if uncontested units were forced to appear more consistently even at small samples? Would anyone ever even notice?",
            "Thank you Mort! Much love big dog",
            "Thanks mort!",
            "I love creating scenarios and running stats like this....... are you hiring...?",
            "Thanks a lot for the detailed post. I must say I have been on the receiving end of the low variance roll, not hitting the unit I needed in a 80+ gold rolldown. I know that it is statistical variance, but it still feels horrible to experience as you can feel you got basically \"cheated\" out of any good decision or play you might have done earlier.\n\nAs some people have suggested, I think some sort of \"random playlist\" mechanic could be nice for the game, as true random is usually not very enjoyable. Balancing the odds of the next rolls based on previous rolls would make sense in that case. Maybe you could even have a \"pity\" system where if you haven't rolled one unit at all, it is guaranteed to show up after a certain number of rolls ?\n\nThanks again for checking in with the community, we appreciate it a lot :D",
            "Thank you!",
            "Happy birthday Mort",
            "Thanks a lot Mort, I made a huge scene at work. I couldn't stop myself from yelling \"This guys a nerd!\" after reading your post.",
            "I think it's really good you are putting some thoughts into this.\n\nOf course, TFT is about RNG and that's what keeps it interesting. I just had to think about a [post](https://web.archive.org/web/20200314084825/https://boards.na.leagueoflegends.com/en/c/developer-corner/0RYiPNBI-quick-gameplay-thoughts-december-13) by Meddler on the boards a long time ago, where he talked about input randomness vs. output randomness, and how especially the latter *can* be frustrating. I feel like the shop in TFT can be seen as both simultaneously.\n\nEspecially in the early stages, it's mostly input randomness. You can choose to buy or not to buy the champs you're being offered and you will probably try to build a team around what the shop is offering you.\n\nBut once you start actively *rolling* for specific champs, it basically turns into output randomness. You invest x amount of gold, and either you get the desired champion(s), or you don't. In the later stages of the game, you usually can't really react to what the shop gives you anymore, instead, you rely on the shop giving you what you need.\n\nI would say having good eco and therefore having enough gold to actually roll a lot is one aspect of skill in TFT, so it does feel incredibly frustrating when you do manage to accumulate a lot of Gold and XP and then you get absolutely nothing for playing well because variance wasn't on your side, and someone with less gold (and maybe worse eco management) is just hitting and wins against you.\n\nOf course just having enough eco shouldn't mean you don't need to care about chances anymore and the game gives you everything you want. But I do think there could be improvements to ensure that after playing well for most of the game, you don't suddenly lose everything you built towards just because of bad luck.",
            "Mort you are awesome, I love that we have you as lead dev of the game we love. I recently had one of those Riot Surveys about TFT and not once did I downvote anything dev or balance related because I know you guys care. Mistakes can happen and you do this all with one hand tied behind your back due to patch cycles and PlayStore timings. My only grievance is with the absurd cosmetic prices and gacha rolls which I expect you have less say in. Keep up the fantastic work. I will however keep using 'Mortdogged' because it's too funny to act like you're some diety that influences and checks every single roll that's made",
            "One of the things your missing here is that the variance can also go the other way.  Having a system that lets you sometimes get that 2\\* 4 cost online early feels more fun than having an even system that's predictable.  Great post like love the amount of research you've done!",
            "> It won't be easy, it won't be overnight, and it may not even be soon...\n\nWill you let us know when something is implemented? \n\nAnd if yes, will you share details of the mechanic or not?\n\nThanks for being open to investigate and discuss it!",
            "Hey Mort, I think it's awesome that you're sincerely responding to the community concerns here. I don't have any opinion on whether there's a lingering bug here, but I think it's important to point out that the analysis you've done isn't sufficient evidence to eliminate the possibility.\n\nEven when the overall distribution of outcomes is correct (in this case, how many times each champion shows up in the shop), the system as a whole can be functioning incorrectly in a way to make tail events like not getting any copies of a particular champion significantly more likely than would be expected. This is because there's still possibilities of correlations between rolls, and there are many possible styles of correlations that leave the overall distribution untouched.\n\nI want to post two stories about imperfect RNG that I was directly involved with where this was the case.\n\nThe first is related to Pokemon speedruns circa 2013. The Pokemon Yellow speedrun involved catching a Level 6 Male Nidoran (a 5% chance) just before Viridian Forest to use as the main fighter throughout the run. The runner Gunnermaniac was saying \"When you get a level 6 Female Nidoran, if you get a 3 step encounter it's ALWAYS a level 6 Male Nidoran.\" (The game prevents encounters before taking 3 steps so this is the earliest possible second encounter). I initially dismissed this as confirmation bias, as many people in these threads are doing now.\n\nThe RNG used in the gen 1 Pokemon games doesn't resemble the types of RNG that would be used in games today, but even so the individual RNG values were sufficiently unpredictable that it made sense to treat them as random. But it turned out that the RNG value used to determine whether an encounter happens was correlated with the RNG value used to pick which encounter it was in such a way that only changed slowly over time. The overall encounter rates would always average out, but the distributions for encounters at particular times does not resemble the overall encounter rate at all. Very frequently there are only a few possible encounters after accounting for the timing.\n\nWe took advantage of this in what would be known as \"DSum Manipulation\": http://wiki.pokemonspeedruns.com/index.php?title=Pok%C3%A9mon_Red/Blue/Yellow_DSum_Manipulation (It would later be generally replaced by full RNG manipulation that involves rebooting the console and performing the exact same sequence of buffered inputs to get the same result).\n\nThe second story is about Slay the Spire. There's a relic in the game called Snecko Eye which replaces the energy cost of each card with a random value from 0 to 3. Ever since the game was released, people would post about how they hate Snecko Eye because it seems to screw them over by giving them all high cost cards. Eventually a player decided to record all their energy costs over the course of a run and made this post: https://www.reddit.com/r/slaythespire/comments/7yph7x/snecko_eye_stats/\n\nIf you read through the comments there, you can see a lot of the same patterns that we see on this issue. [People saying the poster is unlucky](https://www.reddit.com/r/slaythespire/comments/7yph7x/snecko_eye_stats/duiaqy5/), [people checking large sample size aggregate statistics and saying it looks fine](https://www.reddit.com/r/slaythespire/comments/7yph7x/snecko_eye_stats/duigd37/), [the dev posting a snippet of code that seems to imply there is no issue](https://www.reddit.com/r/slaythespire/comments/7yph7x/snecko_eye_stats/duihnmc/). But at the same time there were people pointing toward the real problem: [sequences of numbers were repeating more often than expected](https://www.reddit.com/r/slaythespire/comments/7yph7x/snecko_eye_stats/duj3d60/).\n\nI was motivated to dig deeper and [posted a followup thread](https://www.reddit.com/r/slaythespire/comments/7yxcpa/snecko_eye_costs_are_kind_of_predictable/). Even though the RNG itself was OK, the way the devs seeded it for each fight meant that consecutive fights would get nearly identical sequences of random rolls. That meant that if you look at it over a whole run, the chance that you get an unreasonable number of 3 cost cards is significantly higher than it would be had each roll been independent.\n\nMy takeaways from these experiences is to be a lot more skeptical about even the simplest looking implementations of randomness. It's much easier than people expect to accidentally create correlations between random values, and these correlations can meaningfully change the tail probabilities. There are more comprehensive statistical tests like [TestU01](https://en.wikipedia.org/wiki/TestU01) that will probably catch a lot, although I haven't tried using it personally. So I don't like dismissing the people who still believe there's a bug as conspiracy theorists. The nature of randomness makes it difficult to prove that there's a bug and it's easy to dismiss people's intuition as confirmation bias even when there really is a bug.",
            "why don’t you place the number of remaining champ in the pool ? How can we trust that you fix the bug effectively when you failed us at the most fundamental thing in game ?",
            "Thanks for looking into this, but I'm still pained by spending 100+ gold and unable to 3 star a basic unit. That shouldn't happen no matter the luck. It feels, and while you said feeling is different, it feels like it's so hard to get 3 stars this set, and ruins my experience, as my fun is had by having one big gold carry.",
            "Does the percentage change at all depending on how many 1 costs or 2 costs are out of the pool? Say there's a lot of 3 costs out of the pool, will it affect the 4 costs being pulled at all since there are now less 3 costs in the pool? I don't know if I'm getting my question out right.",
            "Was there ever a mechanic in place, where if you got a champion in your shop, but did not buy them, they would be locked from your shop for a set number of turns?\n\nI feel like that would change these stats quite a bit, but it would also make \"fail rolling\" (accidentally skipping your champ) even worse.\n\nAnother idea would be, that if you do not buy a champ for 5+ rolling rounds, the odds of seeing champs you have not seen in these five rolls increases slightly.",
            "Great post, really good info. \n\nThe thing I always remind myself is the story of the statistics professor who asked students to write 100 heads and tails or to flip a coin and copy it down. He could tell 100% who had made it up and who had flipped it. \n\nThe fake ones would alternate heads and tails back and forth. \n\nThe real ones would have heads ten in a row and then ten tails in a row. \n\nAnyone who has played poker can tell you how this works! 99% chance to hit is a 1% chance to miss. \n\nThat said - is all of the RNG actually random? Because I swear I never see anyone play kogmaw reroll but when I try it cause I hit 2 star kog, I notice someone else also hit it. \n\nDoes the game make some traits more available than others or is it just confirmation bias?",
            "Good post, just wondering though, when you say:\n> Now, my initial reaction is that this is a common thing called “confirmation bias” where a recent experience is being weighted more heavily.\n\nIsn't this recency bias, not confirmation bias? I'm sure both biases are present.",
            "Isn't the magic of TFT that when it is at it's best and the player knows what they are doing it is a game of adaptation to your circumstances? \n\nYeah it sucks not to hit that uncontested Kaisa you might have hoped for but regardless of what items you have slammed I think that roll down should have provided you with enough 4 costs you should be able to build something out of.\n\nTo me at least the game feels best when I do a good job of reacting to what RNGesus has dumped in my lap. That is when I feel like whatever knowledge/skill I have impacted the game. Sure I won't get a first every game but I should be doing well enough to climb.\n\nWhen you start massaging the results that feels like we are just moving further towards forcing stuff because we know it will work out in the end.\n\nIf there were to be tweaks made I think it would be better to look into ways to encourage the flex play.\n\nAs GV8/Goose said \"You always highroll, you just don't always notice what the game gave you\".",
            "Nerds.",
            "Wowowowowowow who do I blame now tho?",
            "This is a really interesting post. \n\nIn reality the changing pool size in TFT makes it incredibly difficult to determine whether a player not hitting an uncontested unit is due to variance or if its the expected outcome.  Being uncontested doesn't necessarily mean that you're likely to hit a unit. \n\nOne example I could think of when this could be the case is if you are the first or the only player to be rolling for a specific tier of champions. Another example could be when most players are dead, and most copies of units have returned back into the pool. These are factors that players may not consider when deciding to roll down.\n\nIf you repeated this experiment where you are searching for the same three 4 cost champions (Ornn, Ashe, Kai'sa), but all champions remain in the pool, on average 25% of 4 cost champions that appears in your shop will be one of the three champions you are looking for. That's almost twice as unlikely compared to an average of 45% in Mortdog's example despite the units being uncontested in both situations.\n\nTo put this into perspective, if you rolled down and saw 40 4 cost champions in your shop, you would on average have 10/40 of the champions to be either Ornn/Ashe/Kai'sa if all units remained in the shop. In Mortdog's example where other units are contested, you would expect 18/40 champions to be what you are looking for.\n\nAnd the thing is that these are static examples, so who knows what the actual odds of you hitting a unit are when multiple people are rolling down at the same time. Statistics can be super unintuitive to understand but overall I think TFT is doing a great job so far with variance all things considered.",
            "Great post, thanks for the transparency Mort! Your point about Nintendo games fudging percentages behind the scenes makes me wonder if Pokémon does the same with its RNG, especially with regards to move accuracy and secondary effects. Feels like I miss 70% accurate moves way too much and get flinched more than 30% from Rock Slides haha",
            "i am forever thankful and in awe for the hard work and unceasing dedication you bring to this game. you are truly one of a kind, mort :)",
            "Very cool! And a great read! As a player that likes to scout early to play the most uncontested 4 cost this direction seems very promising. If something similar to the double roll mechanic makes its way to tft,  making the percentage of uncontested units higher, will that make the contested units even harder to hit?",
            "im new to tft and i gotta say i love how engaged u are with fellow players and community feedback. super impressed. thanks for your hard work, mort.",
            "[deleted]",
            "this post makes me sooo happy... as a statistics nerd myself, due to my study, I also thought about this \"problem\" as you could call it",
            "Curse you, seeing me playing your game on my phone is the fastest way to enrage my wife I’ve discovered. ",
            "I think the problem with \"fudging the numbers\" in the players favor is you never really know what the player is looking for. \n\nIf they are going after a single copy(or 2-star) of a contested unit to round out their comp, adding more weight to the uncontested units would make that almost impossible.\n\nOn the upside, though, it would encourage people to get creative about playing uncontested comps/units because they'd be much easier to 2 star. It would make it harder to 3 star things in general, and dramatically increase the value of champion duplicators to get the final copy of a unit.",
            "I love Mort Dog",
            "I absolutely love that mortdog used the term \"mortdogged\" in a post. Jokes aside though, thank you for always be so transparent and communicating. It's one of the many things that make this game so awesome.",
            "Until i see the actual code of the Shop i think its coded like absolute Dogwater. But well i wont ever be able to see that.\n\nNot hitting a 4 Cost in 50 Gold thats fine Percentage wise.\n\nBut someone else finding 7 of lets say Syndra and you cant even find a single one when youre playing Hyperroll where Level difference is not a thing. Thats what makes me wonder if the System is broken.\n\nDont get me wrong im not saying its broken. I cant do that. Im saying nobody will be able to convince me until i have the actual code.\n\n\n\nAlso Mort of you repeat the experiment with 40 Rolls but buy the 4 Costs. You can buy. It would be interesting tonsee that.",
            "Personally, I root for pure RNG based shops, and thus hope that there is no internal \"bad luck protection\" algorithm in the game in the future.\n\nSimplest pseudo-rng I know is dota's crits. Phantom Assassin had like 4x crit modifier with 15% chance.\n\nThe actual crit chance is like 5% on the first hit, if that didn't crit then 7% on the second and so on, and when you crit it all resets, so with a lot of samples it averages to 15%.\n\nyou hit a minion like 7 \"stacks\" without critting, then your next few attacks would almost guarantee a crit so that was very useful in fights.\n\nso pseudo-rng is exploitable, and although TFT's algorithms(if there are any) are hidden, different players' habits and timings could bias the outcome, and that's what people are worried about.\n\nI go 8th because pure RNG fucked me up <- not the game's fault, not the devs' fault, heck not even my fault, I may rage for a while but understandable\n\nI go 8th because \"bad luck protection\" gave me bad luck <- totally game's fault, totally devs' fault and NEVER my fault, pick up your torches and pitchforks and set Mortdog on fire\n\npre-Season10 I would have thought all \"algorithms\" an 8th place loser's joke, but ever since the 77754, it was inevitable that people lost faith in the RNG.",
            "The dev of Civilization made a nice post about it on how they changed basic math to match player expectations but I am not sure if it has a place in TFT.\n\nIf you change the way the random is done. It means you are giving an advantage to one kind of decision and leads to several issue. \n\nFor instance, if we alter the math in order to make uncontested Champion shows more, it means that once a champion is hit by someone, it is even less likely for another player to get it which can lead to frustration if they based their comp on it. \n\nThis is even more true when all 4 cost champions are not equally strong. In the example, ornn, Ashe and Kaisa may be the weakest. So If you have a bad early game and reach lvl 8 late, you are forced to be lucky or play a weaker comp and thus lose for sure.\n\n\nI hope English was clear enough",
            "Awesome (nerd) post, altought i wonder if taking out of the pool an uncontested unit reduce significantly the next rolls.\n\nI.E You saw 8 ornns in 40 rolls because you had 1/66\\*X% (x beiong the odds of 4 cost) of seeing an specific 4 cost, but, if you buy 2 of them it comes down to 1/64\\*X% to 2 starred it. \n\n  \nI'm asking this because the actual problem is not hitting your main carry/tank and altought i think 45% is low, maybe if you add this to the ecuation so if you start reducing the champ pool by 1 after 5-10 rolls that percentage may go below the expected or maybe it remains the same, either way it'd be awesome if you can answer me this as a nerdge info lover.\n\n  \nThank for everything!",
            "So thats why i never hit my 4 cost as 2 star and never see 5 costs cool",
            "Who'd have thunk - learning statistics are SUPER Effective.\nLove the post Mr Mort.\nCan't wait to see how this finding builds TFT in future patches/Set/?!??",
            "Isn’t there an article that showed because games warp odds people have wrong expectations what 90% actually means?",
            "In early season this was completely destroyed and many high elo players quit the game because the skill didnt account for the outcome of the game at a needed level. Since then the system feels the same and isnt rewarding players playing uncontested strats.   \nHell there are lobbies where 4 people are going the same thing and are having 3 costs, while you are going your own uncontested way and get none.   \nYou say that in the 40 rolls the sample size is low, but if you are rolling for units you wont get many rolls out of it in a game. So yes, the game system feels way off for the player and leads to justified frustration.",
            "I feel like more resources need to be allocated to QA so there are as little bugs as possible. Even though you statistically ‘proved’ that this mechanic is not currently bugged, I think people more than anything don’t like the feeling that something may have been bugged (even though they were just unlucky). This would get better if bugs were present less often. I personally don’t like hidden me rules, but that is just my opinion.",
            "Hey Mort, see how dota treats RNG. Maybe it will help find a better way to handle this issue: \n\nhttps://dota2.fandom.com/wiki/Random_Distribution",
            "This has been on my mind for a few sets that people don’t seem to think about. The unit is uncontested, but are they really? You scout and see ZERO ashe’s out of the pool and have 70 gold to roll with. You roll and hit none???? But in reality other players may have rolled or been rolling, if 4/7 players have an unpurchased Ashe in shop your odds are lower without you actually being aware of this in any way. So rolling becomes more of a gamble the lower the pool size which is much more apparent in a 4 cost meta as opposed to 3-1 cost meta. Much like you can dent a 3 star 5 cost by just locking shop with one copy of the unit as the enemy sells their entire board rolling down thinking they are all in the pool. I don’t think a solution exists for this aside the fact of rolling down when others are to ensure the most reliable odds since people will be more likely to “wait” to roll again with desired units in shop meaning they are less likely to be sitting on your unpurchased desired unit. \n\nP.S. Much love to you and the team Mort. I know community may make it seem like the game is hot trash, but they still end up playing way more than their opinions would make you think. ❤️❤️❤️",
            "My friends friend told me that shop odds can increase 1% for every legendary skin you own and 0.5% for every legacy skin. So now im getting 5 costs on level 1 ! True story. \n\nP.S  My dad works at counter-strike.",
            "Hi Mort! I'm wondering if these experiments were done with one player rolling down or all 8 (as is typical of 4-1, 4-2) I always feel like I'm missing uncontested units because they show up in someone else's shop right before I roll. I've had many duelist games where I pass up like 6 Annie's in the roll down and see like 1 lee. I just assume some one who's looking for Annie is also missing. I'm not sure how much this stirring the pot effects everything or if it all evens out due to random variables summing together to guassians blah blah blah.\n\nI also have been going back and forth between buying other 4 costs to pull them out of my shops. but this also increases odds of my units showing up in other players shops too. I haven't payed enough attention to know what works better.\n\nBasically it sounds like a giant math problem that can't really be solved analytically. I really enjoy hearing about these experiments though. I've read somewhere that crits in league are handled via markov chain to make 30% crit chance more reliably ensure ~1 of every 3 attacks crit. I'm not sure what more sophisticated models could be/are employed in tft and I get the feeling you don't want to give away the keys to that car but regardless these insights are really fun to hear about.",
            "This is considered nerdy?",
            "Hey Mort, i just whould like to say that having u as the main head of my favorite game makes me allways hyped and engaged with the upcomming solutions that makes the game better!\n\nThank you a lot for your comprometiment with the comunity!",
            "We dont want to mess with the high roll potential cuz those are fun but is there room for some sort of like \"introduction filter\"\n\nLike and example would be the first copy of any unit exists in your own pool so if all 10 lee sins are taken you still have your X% chance to see ONE as long as its your first, etc    \n  \nWould a system like this even be helpful or recognized?? Genuinely interested in the design space here",
            "Love to see the numbers be brought up and remind myself that even games that give you a 99% chance of hitting something like crit chance isnt always consistent and could even give you two 1% procs back to back. Now understanding there are 30% chance at low sample size, I can see how sometimes it doesn't work out and the only way to play for better odds is to roll down and better intervals. \nSo don't be too afraid to save that extra 50 gold if ur healthy to get back up. Skill = knowing how to stabalize ur health and odds to keep you in the game.",
            "A counter for the remaining units might be useful",
            "Why are people allowed to join as a group? Couldn't groups easily unbalance contested vs: uncontested on purpose to troll? Or am I missing something?",
            "> A 95% chance in Fire Emblem is much closer to 99%!\n\n\nAnd so is the enemy minions 1% crit chance.\n\n\nI really started avoiding enemies with any crit chance die to a few implausible deaths",
            "When I see; Players typically roll down 60 gold (30 rolls) so let's see what 40 rolls looks like.\n\nIt makes me wonder how bad 30 rolls looked that you needed 10 more to make it postable? Alternatively was there was some other reason for first emphasis that 30 rolls was the norm, but choosing 40 rolls for the example?",
            "Thanks for addressing it Mort.\nIf everything is working as intended, I guess some of us are just the victim of statistics.\nNot a flawed system.\n\nSide note: A fun game mode would be where odds for 1-5 stars changed every stage.\nMaybe ill finally get that Annie 🤣",
            "Wow, you are super dedicated Mortdog, thanks for this! It is so awesome to see a game developer so passionate about their game and connecting with their game community with updates and information. The game may never be perfect and that's okay but I'm happy to see you and others are working on it to make it better each day. :)",
            "Why did you guys keep making new setts with less and less content? We go from epic dragons, spats that can win games, fun econ traits you can force. To everyone forcing the exact same units/items/augments based on wr statistics. Instead of creating a new sett every few months and watching it die after a few weeks since it gets solved so fast, why not double the champ pool and mix old and new setts together so people can play what they enjoyed from older sets with new content.",
            "We investigated ourselves and found we did nothing wrong.",
            "Fantastic write up! Love these nerdy stats and data breakdowns. \n\nIt makes me curious if TFT has any behind the scene predictive augment selections too. Like, am I more likely get offered a Hedge Fund, Dryad Emblem, or Fortune Emblem Augment if I'm running Dryad/Bruiser/Kobuko?\n\nOn that note, if you ever do read these comments, I'm curious what the reception is to the hero augments this set. Because personally *(if you didn't see my recent post about them* [*<here>*](https://www.reddit.com/r/TeamfightTactics/comments/1cy8d3n/future_idea_for_hero_augments_when_selected_that/)*)* I absolutely love them, and have loved them since their inception. Specifically, I have always loved Hero Augments for lower-cost units, because there is a satisfying fantasy with turning these low cost, often expendable units into serious power houses as the game goes on.\n\nTo that note about my previous comment, I am curious if there could ever be an implementation of Augment-bias based off user playstyle? As in, If I *am* presented with a hero augment, I am *extremely* likely to pick it, but the issue for me personally is that I hardly ever get offered them. I've easily played over 500 games this set so far, and I've seen Shen's augment 4 times, Garen's 6 times, Kobuko & Yorick's 3 times, and Neeko's only twice. Which is disappointing to say the least! Because when I do get them, but it's just \"*one of those games*\", it sucks to know that it could be literal days or weeks until I get the offer again.\n\nAny chance we'd be able to see carry augments for *all* 1 cost (and maybe even 2 cost) units in future sets as a staple? But have their appearance rate depend on the user playstyle, so people that avoid them like the plague are given the absolute lowest possibility of ever seeing them? I ask this because any time I try turning a 1 cost unit into a proper carry, they typically lose the sauce between wolves and chicken rounds, and it's a bit sad. I also think it makes for a really fun opportunity to, like Nasus' Stacks on stacks, or Galio's Justice Punch from set 8, turn traditionally tank/front line units into hypercarries.\n\nSorry for the long post- I know you're busy! Thanks for this write up. Hoping for more low-cost hero augments next set! They really are what keeps me playing more often! Not a coincidence that for Set 9 and 10 I took a backseat since that had little to no hero augments at all!",
            "[Do you guys regrett circumcison? : r/circumcision (reddit.com)](https://www.reddit.com/r/circumcision/comments/1cltqm3/do_you_guys_regrett_circumcison/)",
            "Great post and I would love this change. I think accounting for variance due to small sample size is a great idea. Not sure how you will accomplish it but I support it!",
            "Rolled at level 4 try to 3-star storied champion Garen, 80 golds and found none. 22 copies, only has 3 on the enemy board, where is the rest? Cannot even have fun.  Not to mention those time the card only come when I am close to 8th place. If you have spare time, please use it to do some good, charity and stuff instead of writing this BS lol. We all know the game is rigged af, just check [op.gg](http://op.gg) if the player with low WR 49% - 51% they are guaranteeing strongest board in the lobby, and never try to play to same comps as them, if not, its an auto 8th, we all know the trick.",
            "Ok but what about one of my games I played today where I didn’t see a single Chogath in my shop until level 7 in hyper roll",
            "First of all, thanks for confirming a longstanding issue I've had - even if math doesn't support it!\n\nRealistically it comes down to a few things:\n\nCan you always make use of the units you do hit? Can lowrolled units still fight for higher spots or at least to not go 8th? If the answer is no to both, the amount of skewed missed rolls is that much worse and practically makes \"off meta\" nonviable as well.\n\nZyra Ghostly for instance is S-Tier right now but the things that need to align to actually go for it is crazy because the odds of missing units is THAT much higher than just going highlevel which at the very least lets you play for a 6th instead of an 8th\n\nLooking forward to seeing potential solutions in the future",
            "[deleted]",
            "95% shouldn't feel like 99%. 95 should feel like 100 percent the fifth time. i almost made that an essay.",
            "contestion is a boring concept. add more other randomization sources in the game so the optimal play isn't always to hard force a comp and then just remove contestion entirely.",
            "why wont you put the old bag sizes back?",
            "Too many words. I need to hear what Shadow Mort has to say about this, nerd.",
            "Is this across any level or at an optimized level for highest chance of that cost?\n\nLike is this based on that level 5 2% or level 7 or 8?",
            ">while Lee Sin has 6 copies out of the pool, and is seen 6 times! \n\nyou must have run this on rereplays client",
            "Okay but what about my secret power to harness the seeding algorithm in my subconscious and predict my future shops, that's definitely real, right? RIGHT??",
            "LIKE PLEAAAASE!!!\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..\n\n..hello? 😿",
            "While I do feel the temptation to write \"Nerdge\" just as I do in twitch chat, this actually feels really insightful, so as to debunk one’s own recency/ negativity bias.",
            "[deleted]",
            "Could be interesting to do the experiment one more time but this time you could hold some tier 4 unit to show the impact on the stat.",
            "Immediately disregarding this entire post as a load of shit to obscure how the actual mechanic works. My guy has direct access to the source code and is the boss of the people that wrote said code. Why would he preface this entire thing as an experiment. He could literally just have one of the people that actually understands how it works explain the mechanics at play in the shop but instead he makes some long winded post that tells us absolutely nothing. Guess mortdog hadn't been glazed by his fanbase recently enough so he had to show up for a bit.",
            "As a fellow nerd and social science student (I work with statistics all the time) I don’t find this very nerdy, but actually quite reasonable.\n\nIs something wrong with me?",
            "Speaking of Nintendo, did the do the opposite with Pokemon? Focus Miss comes to mind..",
            "Oh yeah Nintendo games love to do some cheatchy doodles. One that people may recognize more is the ai behaviours in Mario Kart. Im not a nerd or anything close to Mort, so I suggest giving it a google and read the in depth stuff, but a classic example is that the AI with rubberband and gain more speed if the player is in first",
            "I think multiple games lie to their players about RNG outcomes (in their favor) to make sure they don't start complaining that the game is rigged. \n\n  \nForgot what it's called but there's a game where you can shoot someone with a gun and it has a chance to miss; the devs rig the \"miss chance\" in the players' favor so they don't complain that their gun that misses 5% of the time is actually missing 5% of the time (the real miss chance might be more like 1%)",
            "Yeah here is the serenesforest page about \"True Hit\" which is the coin termed in FE at least: https://serenesforest.net/general/true-hit/\n\nHit under 50 is actually decreased, and hit above 50 is increased is how it works.  25% hit in FE is actually only 12.75% (in games with true hit)",
            "Fire Emblem's 2 RN system is interesting. it has the double effect of making high hit rates higher than displayed AND low hit rates lower than displayed. For the most part player units have good hit rates, so what the second thing does is that your high evasion units become even better at dodging than what the displayed numbers would suggest. It's a really good system in a single player environment because the player both hits and dodges attacks more often, which removes a lot of frustration at no cost because the computer can't complain that the system is rigged against it.\n\nThe funny thing is that the actual cost of this system is clarity, because the displayed numbers are \"fake\". Ultimately it doesn't impact the player negatively because the displayed number matches player expectations despite being technically incorrect. Usually sacrificing clarity isn't good, but in Fire Emblem's case it works out.",
            "Small thing to note, that is not the case for a handful of other games in the title. \n\nMost notably the Double Roll or 2RN System is present in \n\nFire Emblem Binding Blade\nFire Emblem Blazing Blade\nFire Emblem Sacred Stones\nFire Emblem Path of Radiance\nFire Emblem Radiant Dawn\nFire Emblem Shadow Dragon (DS)\nFire Emblem New Mystery of the Emblem (Japan only)\nFire Emblem Awakening\nFire Emblem Three Houses\n\n\nThe following use a Hybrid System where rates below 50% go back to single roll or 1 RN \n\nFire Emblem Fates\nFire Emblem Shadows of Valentia\nFire Emblem Engage\n\nThen the older home console games use 1RN",
            "Hell yeah he is!",
            "Aren’t we all?",
            "Nerd alert",
            "Rather than some static hidden percentage, I think the approach they'd probably take here is a \"course correct\" when results start to shift too far outside of the mathematically expected result in order to reduce variance.\n\nFor example, in the 40 rolls test let's say the chance of hitting Kaisa each of those rolls is 10% (made up number). If, after 15 rolls, you still don't see a Kaisa, the odds may start to gradually shift such that you are more likely to see one. Maybe the 16th roll has her at 12% instead. And then if you still don't hit, maybe 15% for the next roll, then maybe 19% for the next roll etc. until you hit her and the results start to look more like expected.\n\nWith that design, there wouldn't really be any metagaming or additional knowledge required on the player's part since it's just making the result align a bit closer to what is expected even with a small sample size.",
            "I don't think he brought up the example because he wants to add manipulate hidden probabilities, but to show that Nintendo has realized that players tend to perceive probabilities differently from how they actually are, which is why Nintendo changed the probabilities so they match what players would expect.\n\nIt doesn't sound like Mort has a concrete idea of how to reduce frustration because of bad luck yet, so I'm curious as to how he will approach this. But I doubt it will include hidden probability changes. I'm sure there are other ways to fine tune this.",
            "This is an issue because reality doesnt align with stated values already. Hence getting mortdogged.",
            "To be fair, *it was bugged* until quite recently. Units weren't being put back in the shop on player death. It was addressed in the patch notes.\n\n[For those that missed it.](https://www.reddit.com/r/TeamfightTactics/s/NqKg1chd5c) Streamers had been talking about it for quite some time, and it's probably the catalyst for the current distrust in the system.",
            "I think it just doesnt help that when it happens it sticks out like a sore thumb in your memory. I've probably played hundreds of matches of TFT in my time, but I'll probably always remember the one or two games where I got burned by the shop. \n\nOn my way to winning a match, sitting at 6/7 units, just need that one last guy to fill it out and they just dont ever appear in the shop. Spend all of my money rolling down and dont see them once. Finish the game and check the after match report and no one else is playing my comp and zero people have the unit I was looking for. Like how can an entire match go by and have a unit just not exist?",
            "Apple Music had this issue famously with the original itunes randomizer.",
            "I mean point 3. I dont think its intended to know that. And if you trying that hard its np to check the amounts of units overall and learn it. \n\nIts also a was of \"skill expression\" to scout and count. Everyone has to do it if he wants that info.",
            "Hey so what you’re talking about here in points 1 and 3 aren’t QoL improvements they are power user features",
            "It basically creates a playlist of all the songs within the playlist in a random order.\n\nFunnily enough, people are so used to looking for patterns that we often still find patterns in the random playlist. Like 2 songs that were vaguely about california after another, or 2 songs from the same artist within 2-3 songs. So people still don't believe it's actually random. Turns out if you just randomly sort songs these things happen, so there's occasionally also even things that make it less random (like spacing out songs from the same artist) that make it feel more random.\n\nAs always people just suck when it comes to evaluating chances and probablities",
            "> It's similar to how the random button in a playlist does not produce a random distribution but something that feels random to the average person (e.g. it nevers plays the same song twice in a row).\n\nApples and oranges my friend. True randomness does not exist. That is all.",
            "> You don't need me to tell you this, but it's definitely okay to lie, as long as people don't know and as long as the \"true\" mechanic allows for people's assumptive play to still be viable/optimal. Like would people play any differently if uncontested units were forced to appear more consistently even at small samples? Would anyone ever even notice?\n\nWhen a content creator figures out the algorithm and high level players leverage this knowledge to change their play style.",
            "Pros figure out how to game any system, and then content creators blast on about whatever it is. Look at Genshin/star rail/wuthering waves \"relic manipulation\", completely unnecessary min maxing that makes a good conspiracy theory thus content",
            "[https://www.riotgames.com/en/work-with-us/jobs#product=&craft=insights](https://www.riotgames.com/en/work-with-us/jobs#product=&craft=insights) doesn't look like it but you could just check from time to time",
            "Last set people got super angry at the pity systems they implemented, not sure if they wanna go back there",
            "I can’t imagine the headache balancing this. Ok, it feels better. Wait variance is leading to 3 stars in two turns so no one can contest strategically. Ok. Bring it down but not too much. Maybe just the high rolls bring those down. So if the already have 8 copies in their bench make it a little more rare to get the last one? Sure let’s try that. Well that was horrible. 3 stars took 8 turns uncontested lol. Sounds like a nightmare.",
            "No, the amount of champs in each tier doesn't impact the initial roll. The system always first rolls for what tier to grab (so 20% chance for 4 cost at Level 8), then goes and grabs randomly from the available champs in that tier.",
            "To add onto the other answers, if you’re searching for a specific unit, buy others of the same cost while you're rolling down to get them out of the pool. Having the same odds for the cost to show up, with those ones out your specific one is slightly more likely to show up.",
            "Unless the pool is completely drained (including other people's shops), no.  \nIt changes which 1/2/3 costs show up, but the odds of seeing any 4-cost at level 8 are 20%.",
            "This was very briefly in the game for the beginning of set 4. I think it was just if you didn’t buy a champ it couldn’t appear in your next shop.",
            "The last line always has been a thought in the back of my head. \n\nIt feels like in the early game occasionally, two or three people are offered basically the same first shops and are set on the same line. Yeah, you do tend to notice when its a really niche opener like going ahri 3. Its like \"bro we both have 5-6 ahris and ap items?!\" Meanwhile 15 games will go by and nobody will even try that line.",
            "The bag sizes were lowered to stop people from all contesting each other. making some traits \"more available\" would actively sabotage that intended design and make no sense",
            "RNG is usually not random. There are 2 kinds of random, Pseudo random and hardware random. The problem with computers is that they are programmed by humans so it can't just \"get a random number\" This generally translates to \"Grab a number from our long string of random numbers(seeds)\". But the actual string of numbers isn't random, its predetermined and can be used again(this is why in speedrunning you can determine which seed you have and there for know what will \"randomly\" happen) And is often used in computers as its usually good enough.\n\nBut to actually get a random number the computers needs to look at something that is random, as the computer itself can not be random. This is where hardware random number generators come into play, which are pieces of hardware that look at something specific like noise generated by zener diodes at a specific voltage. Riot could use this for TFT, but I doubt it.",
            "Yeah confirmation bias is weighing/recalling experiences that fit your narrative more heavily",
            "The main problem is that there is not much diversity in what you can go for, each 4 cost unit (premier carry) fulfill their own niche and at most you have 2 that can use similar items. This is caused by the smaller champion pool in TFT compared to other games (the price we pay for big seasonal changes)",
            "The early stages are about adapting. But when you're Level 8 and have a full comp and you're only missing a few copies of your level 4 carry, you can't just casually pivot and throw your whole board away and and this point you need a carry that *works* with your team.\n\nTFT is both about adapting as well as about resource management. \n\nImagine you managed your eco well the whole game so that you have enough gold that if you invested all of it into rolls for the champion you need, you should get said champion multiple times according to the mathematical expectancy value.\n\nBut variance says no, you don't get the champ a single time, and your whole eco management skills for the last 5 rounds accomplished nothing and some other player who didn't manage their eco well is getting some lucky hits with far less rolls.\n\nThat's not really fair in my opinion and does eliminate some \"skill expression\" if you can call it that.",
            "Alot of comps dont have high cap win cons after another person gets one copy of your 4 cost carry. That feels really bad.",
            "You are playing with 7 other people, the chance of you being the highroller is 1/8. If you flip a coin several times in a group of 8, someone is going to get like 7 heads flips",
            ">I go 8th because pure RNG fucked me up <- not the game's fault, not the devs' fault, heck not even my fault, I may rage for a while but understandable\n\nThis is not how it works. The devs saying \"the shop is pure RNG\" would not be believeable for many many many players and they would still grab pitchforks. That's why bad luck protection exists in the first place.",
            "https://www.reddit.com/r/CompetitiveTFT/comments/1cn8z2z/holding_4_cost_units_and_grief_your_opponent/\n\nhttps://vastier.github.io/TFT-Rolling-Odds-Calculator/\n\nYou can experiment with it yourself, but the conclusion this user came up with is that in a 2-way contest, holding 1 copy of a unit is worth about 10 extra gold needed for these opponents to hit. In a 3-way contest, this is worth 25 extra gold. So it is very worth it to hold units your opponents want.",
            "Do you say shit like this irl too?",
            "this is not a test he is explaining how statistics work and why it is unintuitive",
            "Wtf my guy? He knows how it works, it really isn't complicated. He literally was just checking that it wasn't bugged by seeing if the math worked out appropriately. Bug checking something like that every once in a while is smart. Your comment is idiotic",
            "Watch some videos about RNG in video games and inform yourself before spouting so much bs \n\n\"MUH JUST CHECK THE CODE\" if it would be that easy bugs wouldn't exist.",
            "Pokemon uses a normal psuedo-random generator, which is why you see things like Focus Blast missing a lot. Even though it is just 70%, people feel like 70% should happen more often than it actually does, especially in a small sample size. Just because you miss once, there's no protection mechanic to prevent you from missing again. Though Game Freak is the developer for Pokemon and not Nintendo.",
            "Unfortunate does not begin to describe",
            "Mort isnt a nerd not socially awkward enough for that 🤣",
            "XCOM on lower difficulties will give a cumulative invisible buff to hit chances that resets on a hit. So every miss makes the next shot a little better, but it doesn't show you that. On the highest difficulty, maybe the 2 highest ones? it does not cheat in your favor anymore and just uses the displayed odds.",
            "Pfff whaaat??? Naaaah I can't be",
            "This also would make high rolls a little less likely. If you only get Lee Sins for three shops, the odds for Kaisa and other 4 costs slightly increase. \nHitting a champ with an increased rolling chance and then not buying them, should always reset the counter though.\nSo if after 21 rolls you get your first Kaisa and skip it, then your chance goes back to the base of 10%",
            "This actually exists for crits in League of Legends already (and I wonder if it does in TFT, too). If you get less crits than you should, it secretly increases your crit chance, and vice versa reduces it if you are getting too many.",
            "> \"course correct\" when results start to shift too far outside of the mathematically expected \n\nJust make sure that the percentage is based on X rolls and not infinite rolls\n\nSo instead of \"in 1000 rolls you should see 45% Orhns\" it should be \"in 20 rolls you should see 45% Orhns\"",
            "We had the 77754 algorithm last set to prevent bad luck on shopping headliners.\n\nI wanted to try out a 7 spellweaver reroll seraphine.\n\nskip the kda seraphine, evelynn, lillia, kaisa, spellweaver annie, gragas, I could never get my desired spellweaver seraphine because it was kinda permalocked lol.\n\nSo my concern is that even with good intentions, any algorithm asides pure RNG is going to have singularities that backfire against the player's needs.",
            "If there were other players holding units then It wasn't uncontested. I get your point but usually when players are already starting to die the Game is very advanced and most players have already made their big rolldowns, so I don't think this affected the complains we are talking about very much. \n\nI'm sure many people will still believe It because a) people suck at statistics and b) people love to blame the game instead of themselves more than anything. But most complains where due to confirmation bias and players in this playerbase being crybabies.",
            "Sometimes this happens with a 1 cost, and it makes me go insane. I still remember a game in set 9 where I didn't see a single jhin (a 1 cost ionia/vanquisher) the entire game. I don't think I'll ever forget that loss, it's more prominent in my memory than any amazing win I've ever gotten",
            "That's exactly what confirmation bias means",
            "Understood its a trade off of skill expression to QoL , but I think the QoL aspect is worth it. You can make more informed decisions with readily available information.",
            "I know it doesn't actually matter since both scenarios are the same, but what if the entire x-cost pool is sold out? If the shop rolls x-cost in a slot, does it just reroll the slot until it hits a cost that's not x, or does it pick from the renormalized chances of all the other costs?",
            "Yeah, I still am not a big fan of the champion pool reduction. I get the idea that 3 stars were too easy to get in set 9, but I think the fix went a bit overboard. Maybe 10 5-costs and 12 4-costs would be better. I haven't run the maths so I can't say how much it would help, since it technically makes uncontested 4 costs harder to hit though... Something feels wrong to me with the current odds now that the headliner mechanic is out of the set...",
            "But its not a coinflip.\n\nIts not as simple as 50% heads 50% tails.\n\nThings like i described happen way to often. It doesnt make sense statistically for them to happen this often.",
            "[deleted]",
            "I think someone can be a nerd and be sociable at the same time.",
            "Good point! Yep, it would work both ways.",
            "I really like this. I always thought they would use the \"bad luck protection\" from set10 in some way to make the roll downs more enjoyable.",
            "The vast majority of complaints are indeed confirmation bias, but when there's a *major* bug affecting shop probability less than 3 weeks ago, I think it's wrong to automatically dismiss inquiries into the validity of the shop as \"crybabies\". They were 100% right then, they could be right again. \n\nI'm glad Mort ran the numbers on it to show that it's currently working as intended.",
            "Yes, I know. I was just adding an anecdote to support *why* people would be feeling that way and experiencing the confirmation bias.",
            "Thats absolutely true, the question us just if they wanna design it that way or not.\n\nNever hurts to ask for something i guess",
            "In this incredibly unlikely scenario, the game simply goes \"no valid pull, roll again\"",
            "Rerolling a slot till it hits a cost that's not x, and picking from all costs but x with their chances renormalized are mathematically equivalent (as rerolling a slot till it hits is performing rejection sampling https://en.wikipedia.org/wiki/Rejection_sampling).",
            "Oh, I am not talking about the smaller pool size but the number of champions specifically. The pool size does exacerbate the problem but I think the deeper issue lies in the champion variety.\n\nRealized this when I watched this video from a Dota YouTuber who has experience in game making: https://youtu.be/MrogaUVUYpo?si=a0yxxQeGQehkmVCC?t=30m30s",
            "It also doesn't make sense for the game to be biased towards certain players in the lobby. My example was just to illustrate that good luck is more likely to happen to someone else in the lobby because there are 7 of them and 1 of you",
            "You really needed someone else to tell you how probability works in the first place?",
            "[https://www.youtube.com/watch?v=qZZ1OWQTgqQ](https://www.youtube.com/watch?v=qZZ1OWQTgqQ)\n\nI leave that here \\^\\^",
            "Damn the man started his victory lap just to get clotheslined 😂",
            "Yeah but that would have a balanced and specific effect. Also, I didn't think it was a bug.. I just figured it out when there's 1 kaisa left and I see it still on a board, it's not in the shop yet.\n\nUnintuitive and clunky != bug",
            "I also had this question, thanks",
            "The game is not biased. Being Biased means it would have an actual conscience.\n\nAs i said until i see the actual Code, nobody can convince me the shop is properly programmed. Things that have a really statistically low chance of happening are happening to often.",
            "ohh I see this vid again :V Thanks for reminding me the differences since those terms are often used interchangeably so. 😅",
            "Except in previous sets, the dead units would go back into pool instantly. Suddenly in Set 11, there was a massive issue that took dead units out of the pool until god knows when, and it was confirmed a bug when it was fixed.\n\n100% a bug and was even labeled a bug fix in the patch notes.",
            "Except it was never like this prior to the set, was listed and treated as a bug, and clearly was unintentional behavior.",
            "you could easily boot up a normal game and verify the randomness of shops yourself but i have my doubts you would to be honest",
            "Are you sure? I swear it has come and gone as a \"feature\"",
            "That wouldnt prove anything. I would have to keep track of every shop of every player over the course of the game. Which is impossible to do.",
            "Why would this be a feature? It would be hella toxic.\noh? You are sacrificing health by not rolling your gold and getting your powerspike so you can roll with better odds once your contestor dies? Well FRICK YOU the contested units where on their board when they died so you still don't hit, and you also die; or if you know you're losing you could buy and play the key units other players need to screw them over from beyond the grave",
            "You could just track your own shops unless you're implying weird stuff happens to everyone except you no? If the shop coding is screwed up its equally screwed up for every player in the lobby",
            "Can you start TFT games with 8 people? If yes you could potentially test this right now by getting the Mobalytics tool (saves your shops) and play 10 games with a set group. Should at least have a hint if it's working correct or not. 1000 games would be better but is unrealistic.\n\nBut honestly. The code wouldn't reveal all of it. In the past even if devs showed the code the RNG was still influenced by some other things. (see comment from the guy posting links for Slay the Spire)",
            "these guys just want to feel moral and intellectual superiority lmao  \n\"Oh I'm very skillful and gentle so that I don't complain unlike other toxic confirmation biased crybabies even when there is a bug\"",
            "Quotes around the word feature",
            "You cant just look at your own shop. Its a whole system.\n\nWhen you for example have an Irelia in your Shop and all other Irelias are already in the game. Nobody can find an Irelia cause its in your shop.\n\nYou also would have to keep track of all the units already out fo the pool. To properly access if the shop is working correctly. Furthermore you definitely need a lot more games and rolls than a couple hundred. You would need thousands.\n\nIf its screwed up its screwed up fro everyone of course that is the case. Thats the issue.  \nIf the game would be perfectly balanced that wouldnt be a problem you can paly what the shop gives you. You cna do that if the shop is screwed and broken too, but if someone else gets a lot more of a certain unit than everyone else, because of a broken shop, then that throws palying what the shop gives you out the window.",
            "You have to do this a couple hundred thousand times lol",
            "I thought you were referring to something along the lines of 4 costs appear more/less often than the % odds state for example.   What you're describing really just sounds like normal RNG variance to me though. If shops were so mega off something was definitely wrong more people would notice and it would be provable in some way",
            "I think a sample size of 8 people rolling what 100-200 times a game over 10 games is already a decent amount of data that as I said \"at least give us a hint\" if it's correct or not. Mort used 1000 rolls in his example."
        ]
    },
    "Mortdog on people complaining about the current meta xD": {
        "title": "Mortdog on people complaining about the current meta xD",
        "score": 58,
        "url": "https://clips.twitch.tv/CrepuscularRelatedJuicePeteZarollTie-F5NEGpjZJASCTfbT",
        "content": "",
        "num_comments": 76,
        "comments": [
            "This sub is filled with people like these. 80% of the posts have the dumbest complaints and constant whining",
            "Man I honestly don't know how we don't have more outbursts from Mort like this. The man is leading a team on a game with a WILDLY difficult balancing factor to it and streaming as a normal gamer on his off time. Still getting bombarded with bonehead comments like the one he's replying to here. He has WAY more composure than I think I could hold. \n\nAlso, Fk that dude in the comments lol.",
            "I almost bet the guy who said this at his chat has already done a similar post here complaining about it too.",
            "God you couldn’t pay me enough to be the figurehead like mort or phreak.  It seems like no matter what they do people are always going to tap and complain and having to be the person responsible for listening to it all sounds agonizing.",
            "I love Mort",
            "Lol the fuck is reaper/lux meta",
            "Which color though?",
            "Based Mortdog",
            "At least he got that gamer soul in him",
            "based and mortpilled",
            "Mort had time today! It must be so boring to get all this whiny posts everyday about X comp being too strong from people sinking 100s to 1000s of hours on TFT sets as if other activities don't exist in life.",
            "3 of those S-tier comps require a hero augment, 1 requires a spat, 1 requires a specific artifact. I think the meta is fine but claiming that there's 9 S-tier comps is just misleading.",
            "hi mort",
            "I think people just need to accept that they don't like the set. I agree with Mort. The game feels actually fairly balanced and there's a bunch of fun comps to play. If people keep complaining about the few comps they lose to over and over each patch, it's not \"the meta\". It's just you not liking the set. And that's okay. Don't shit on it. Just take a break and come back next set. That's alright. TFT shouldn't consume your whole gaming life.",
            "Games just have a lot of people who complain and unfortunately due to a lot of audiences and platforms they don't do it in a constructive way. And then there's the whole 30 second attention span thing as well where people love each split at first and then by the end, \"it's so dogshit\". I started playing in set 7 and really got in because I enjoyed noxus/shurima in set 9 and at the complaining was just ridiculous.",
            "This set just isn't good. Maybe make a better set and you won't get as many complaints. Also you reflect terribly on riot and tft when you say stuff like this because the game dev with a forward facing job is supposed to be \"above it all\"",
            "pencil in your nose like itchy way or john wick way?",
            "The meta with garen kobuko shen was actually fun",
            "Unpopular opinion - this set is amazing and is one of the best, is amazingly balanced and hasn’t gotten boring at all",
            "Stick a pencil in your nose lol I love it",
            "It’s so nice having a dev like Mort. I love that he tells these idiots off. Never leave me Mort",
            "Most S Tier comps require a specific spat / hero aug to exist\n\nHell even some A tier comps do\n\nThe issue isnt the meta though, its that the roulette decides all",
            "He should be perma banned on chat and on TFT",
            "What a lovely adult. Loved this take almost as much as him finding excuses for the ahri skin cost or whatever that was",
            "Nah this set is simply bad",
            "he hates the game and hates players\n\nit's not the players fault he cannot make more than 3 comps competitive at the same time  \nglad i quit",
            "Instead of just play something else.\n\nThat's what I do until the next set.\n\nIt's like a cheat code.",
            "He so wanted to say “stick a pencil up your dick hole dude” but had the restraint to avoid that. I respect him so much",
            "or it was just a one off comment which was met with advocacy to self harm",
            "Realistically people are complaining about things that affect at most 2-5% of the player base at any given time. Especially in standard league. Sure corki or whatever is strong but I guarantee you Jimmy that isn’t why you’re stuck in bronze",
            "pretty sure the money helps, but they are not hiding like other devs which players should appreciate",
            "Phreak is kinda weird tho. He says a lot of dumb things from time to time but I still respect him for covering in depth about the patch notes.",
            "Imagine being president lol",
            "\nI hate it when people put mort and phreak in the same category because mort is easily 100 times better human and dev.",
            "Whines about whiners, tells players to kill themselves, supreme overconfidence, what's not to love!",
            "The two current strongest comps in the game",
            "Noob.",
            "It's really not that misleading. Sure, 3 of the 9 have a requirement -- well, you get multiple opportunities to meet those requirements. Locking the 'best of the best' behind a little RNG is a good thing: it makes it more exciting to hit.\n\nDidn't hit one of them? You should be playing flexibly, because there's 6 comps still left in S tier.\n\nAnd A-tier comps can absolutely beat S-tier comps when the stars align... and, in a game like TFT, they align all the time.\n\nI don't think Mort is being misleading at all.",
            "These are still S tier comps, it is actually better to have S tier comps require specific conditions.",
            "Shen is the only comp there you can't play without the augmen, Kobuko comp can be played as bruisers flex, and spats are fairly common in the game now. And sure you need artifacts to win with some of those comps but even if you dont hit it's not an instant 8th, you can still play for a top 4. IMO even if technically incorrect saying there's 9 s tier builds is a fair statement",
            "Reaper and Lux reroll dont, and as a proof I climbed to Master with them, you just put the units on the board and win",
            "he had nothing to do with the ahri skin cost, and he has done absolutely nothing bad in this clip.",
            "Clearly you didn’t watch the clip. Get off the subreddit if you quit.",
            "I legit thought he was gonna say \"go stick a pencil up your ass\" but yours makes more sense lol",
            "I would say in your nose is arguably worse",
            "lol \"advocacy to self harm\" so dramatic.",
            "Your kidding right",
            "Deservedly.",
            "Idk what mort looked like before being the figurehead but it’s been like almost 2 years for phreak and he looks like he’s aged 10, no way they’re getting paid enough for that level of stress.",
            "Phreak says weird things but it makes sense to him since he has all of the behind the scenes data we don’t have access to.  Of course mains and high elo players are going to feel differently because at like master+ it just becomes a completely different game.",
            "I'm sorry what? There's no way he tells players to kill themselves and he doesn't seem overconfident at all.",
            "If that was your take away from that clip you def are hardstuck plat",
            "Does he really tell players to kill themselves lol? I watched him a couple years ago but had to stop because he just whines, he’s obnoxious",
            "he's legit one of the reasons I stopped playing",
            "Lol I was thinking it meant reapers and lux on the board at the same time",
            ">you can still top 4\n\nIn your elo, yes. Against decent players, no.",
            "so anyone who complains about a game to it's devs should hurt themselves?",
            "Im wondering what behind the scene data he used for the karth comment 😊",
            "Then why are you here? He lives in your head rent free, right?",
            "Im sorry for being a D1 peasants I should have know better than to talk to you king",
            "Is this in response to his \"stick a pencil in your nose\" comment?\n\nWhat a leap",
            "[deleted]",
            "Fuck off",
            "The actual amount of pings people do on ultimates lol",
            "how should I kill myself",
            "Give me a method",
            "give me a method",
            "It is well documented that the change got implemented because a rioter got pinged and got salty about it so straight up removed it from the game.",
            "Certainly not by sticking a pencil in your nose lol. Get over yourself",
            "Off-fucking",
            "If you think one singular person has that much power at riot I have a very large bridge to sell you",
            "give me a method",
            "how should I end my life",
            "You are simply denying reality then."
        ]
    },
    "As a former TFT \"Whale\", the new treasure realm makes me not want to spend at all": {
        "title": "As a former TFT \"Whale\", the new treasure realm makes me not want to spend at all",
        "score": 17,
        "url": "https://www.reddit.com/r/TeamfightTactics/comments/1dls2mr/as_a_former_tft_whale_the_new_treasure_realm/",
        "content": "This probably has been discussed to death already, but the new treasure realm system makes me not want to spend money on TFT. I have the KDA Kai'sa Skin plus a few other mythics including Lee Sin and arenas.   \n  \nI would at the very least spend 200€ if not more of my disposable income a month on TFT because I felt I got something even if it was really not that worth it. The old system disallowed duplicates and rolls felt like they gave you something even if it was lowkey trash, the revolving shop sounds nice but really I feel like I get less bang for my bucks with this system even if it might be around the same in theory.  I do really miss the feeling of opening up a cache to get something whacky or unknown.\n\nPretty much all of my recent rolls of the new system have been duplicate realm crystals and it feels very discouraging to me to keep spending on it. I will not resume spending money on TFT and am happy to just use the free currency to roll occasionally. \n\nHow do other people feel about it? Especially people that were high spenders who own multiple mythic chibis.",
        "num_comments": 17,
        "comments": [
            "You can now buy more precisely what you want, sometimes.you have to wait very long for the shop rotations though. This comes at the cost of getting less unique rewards from pulls and the realm crystals overall making every little legend require more pulls if you need to buy them instead of pulling. Overall it's more expensive to get them all now but it is easier to get a single specific one.",
            "I would take 100 crystals instead of random useless legend which iam never gonna use. At least crystals will be used for chibi legend",
            "bro its so insane, i was thinking about buying the pass for the pulls, but first i did the free pulls from the event, 90% of it was just 100 realm crystals, so i decided not to xd",
            "Idk man I just got that lit beach arena for 2500 crystals. I'm pretty pleased.",
            "yeah... I spent too much but atleast I was guarenteed the chibi in around 10ish rolls since I had everything else and now all I'm getting is the crummy crystals that are effectively useless to me",
            "It’s always so interesting to me to see whales complain about massively overpriced content, as if the reason companies don’t do this is BECAUSE of whales being willing to spend large amounts of money chasing that gamba high\n\nBut anyway yeah treasure realms and TFT monetization bad",
            "... I'm a TFT whale and I didn't even realize the new system even gave out tacticians anymore, thought it was just a crystal dispenser. And I've already put in a couple hundred to get the poro fluft. Wack. Is that what determines the variance in crystals?\n\nThe reason I've put so much in is from rolling for specific things. In beta, I ended up with all the little legends just trying to get the sugarcone furyhorn at 3*, and same thing for pretty much one in every set since until the pink shards. I'm not a fan of chibis, but keep falling in love with these random legendaries and specific boards. I much prefer being able to buy certain ones from the shop. If I can ever get the Chinese new year board with the poro audience, my whaling can finally stop.",
            "you can gamble. get new thing if not get the new thing to buy it for free... it's win win for you plus you get mythic points to save for new skins",
            "Is it the second time I see this same post?",
            "I enjoy having more agency in the process of choosing rewards. \n\nPersonally I really disliked having only 2 or 3 mythic treasure realm options available at once for long periods of time.\n\nIn regards to wether people get more bang for buck, i got fluft of poros without spending any extra money because of the pengu pass tokens.  And now have 8 mythic tokens again after spending only like $30 nzd and the free tokens. This seems way better than before, but now that I have very limited tokens without buying them (only battle pass left but still deciding whether to buy) the remaining 2 medalions would cost me like $90ish dollars if I only got garenteed medallions. This still seems quite expensive, but more on par with league hextech crafting gems before they made it a dust.\n\nBut also I may have gotten very lucky since i pulled the x4 medallions reward 2 times. And dont know if this is likely since I havent looked at the rewards table yet.",
            "SB Ahri was my last hurrah, this system is bogus.",
            "How about we don’t complain about a cosmetics in a game that is 100% free?",
            "Yeah it's like people would rather spend ***two hundred quid*** gambling than be patient with that they want to actually get. Jesus Christ what am i reading.",
            "why getting all of them if 90% are bad",
            "i mean he still can gamble...",
            "How do you buy the thing you want without spending 200 with the new system",
            "Wait for it to rotate back in? I have like 1900 green things from the pass or whatever. There nothing i require since i have Darkstar Whisker, Malphite Chibi, and a squink of some kind. Eventually I'll have X00 for whatever bullshit tactician i like in the rotating shop and I'll pick it up. Or have x000 for whatever fancy board i like. I use Grotto of Secret Spa anyway, the dragon statue rules. \n\nLike for real, does Child Neglect Bruce Lee Sin or Condescending Morgana or Actually Pretty Cool But Not Necessary Star Guardian Classroom Board require you to spend 200 quid a month?? I understand FOMO, I play Magic the Gathering, but it's a self control thing. Thank god the gambling is less appealing."
        ]
    },
    "Where is bro running to?": {
        "title": "Where is bro running to?",
        "score": 56,
        "url": "https://v.redd.it/7c70i302r08d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "he's got places to be!!!",
            "Just putting in some exercise. Gotta be ready for the next battle!",
            "Working on his cardio for his turn in battle",
            "Bro is trying to escape his demons xD",
            "DEMACIA!"
        ]
    },
    "How did Rek’Sai do the most damage?": {
        "title": "How did Rek’Sai do the most damage?",
        "score": 12,
        "url": "https://i.redd.it/jsjiusdya38d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "I mean, we need s lot if info in that round. Did ornn hit her with 3 radiants when he casted? How many of your team died? Did reksai hit things with like 40 spectres on them to absolutely truck them?\n\nOrnn probably got her the items and then she slapped the shit out of things that took 300% more damage",
            "Cause she’s the queen \n\nSlay girl(god this sounds so dumb)",
            "I can see the mascot",
            "Punched hardest",
            "Probably got radiant TG with BT/Titans or something similar from Orrn",
            "For a serious answer It have many reasons, 1 orn damage is only around him + he stand at one place when he cast and his cast time is very long if not interrupted which mean he won’t move to important or back line target otherwise, 2 rek’sai damage have 3 different scaling if I remember correctly and it very potent so if she itemized properly she can deal ton of damage and her ability can move around even when she casting which mean she won’t miss her ability and it hit around her, 3rd ghostly damage multiplier as I say she can hit 360 around her so she can take advantage of the ghostly damage very well and plus the gear from orn ability she can easily deal 1k+ per target not taken into account if she hit multiple enemy",
            "Rek'sai does not have ghostly emblem so she would not geg the damage buff",
            "1 star reksai with no items bro",
            "Ghostly amp isn’t affecting only ghostly units. This was the case for a very short time and got reverted",
            "You do know what orn 3 do don’t you ? And as I say when orn 3 cast he won’t move = we won’t be able to damage range enemy, and because he slam random item on most of his char for the effect most item that orn make gonna go into rek’sai"
        ]
    }
}