{
    "Would you live here?": {
        "title": "Would you live here?",
        "score": 7277,
        "url": "https://www.reddit.com/gallery/1dl2s2q",
        "content": "",
        "num_comments": 731,
        "comments": [
            "You should see the shit hole I live in now. I’d take this if a shark was my roommate.",
            "Poor AI really struggled with door placement and what should be inside the glass. So no, I'm not living in this prison that doesn't have doors into the bedroom.",
            "Would I STAY there? Fuck yes, that place looks awesome. \n\nWould I LIVE there? I cannot even imagine what kind of upkeep process (and oh lordy the expenses) would go into owning that house. No thanks.",
            "Fck yes...might be terrified every single night but dammit some things are worth it...",
            "Yes, but bathroom aquascaping is suspect.",
            "I would if it were real and not a crappy AI render.",
            "Absolutely. Sure, the fear that the glass is going to crack and I'm gonna drown would always be in the background but I could live with it if I got to hang out there. The bedroom might be a little much though",
            "oh look, a 3d-render/AI-generated stupid house... again",
            "Absolutely yes!",
            "To be honest, yes. Bring my Subnautica base to reality.",
            "This looks like some hot AI nonsense",
            "Downvote ai crap",
            "I would stay there for a few days but unfortunately you used AI",
            "Find it kinda hilarious someone watermarked this work of ai. Settle down Picasso.",
            "Only if the water there was still illuminated at night",
            "Gonna say no just because there’d always be water all over the floor and shit",
            "No way! I love my overpriced apartment that overlooks a shopping center",
            "Ever seen a structure in ocean water? That glass is getting covered in barnacles and algae and stained by salty water spray in a week.",
            "No, but not because of the thalassophobia, but because of my claustrophobia.",
            "Evil villain-ass house",
            "you’re asking this to a subreddit full of people that are terrified of water?",
            "And have fish watch me take a dump? Jack off? Sit around in my underwear playing xbox while drinking entirely too much boxed wine? Cramming Shredded cheese down my throat at 3am like some kind of cheddar goblin!? Yes. Yes, I would.",
            "Does the tinman have a sheet metal cock?",
            "Lmao never. This is Rich people drowning in a submarine driven by an Xbox controller type stupid.",
            "Hell yeah!",
            "No. This gives me heart palpitations and neverous sweats just looking at it",
            "No",
            "Would be a very cool place to stay in for a short vacation, but it just doesn't feel like \"home\". Where's the TV at!",
            "Would stay here for an experience. But the amount of mold and damp would get so tiring after a very short while 😓",
            "This is fine because o can actually see the bottom and it's really well lit, I could do this for maybe a week haha",
            "I've always wanted an outdoor shower for my underwater bathroom.",
            "I wouldn't want to live in it, but, I'd love to stay there for a few nights. Amazing.",
            "I can see the bottom im good with it",
            "If I knew is was engineered properly and if I had magnetic scrubbers to clean the outside, or else it would be ugly and useless within a month.",
            "Nope!!!!",
            "Without question",
            "in a heartbeat!!!!!",
            "As long as I can see the ground and the sun at the same time it's fine. I can deal with this.\nUntil it becomes night then I might start feeling nervous.",
            "Unfortunatly not cuz it looks fake",
            "yall got trader joes",
            "Cost of upkeep would make me say no, not the water",
            "What kind of dumb question is that?\nOf course ANYONE would be happy to live there. Ffs.",
            "In theory yes, in practise I'd sell it to an overly rich idiot and buy something sane.",
            "I would kill to live here",
            "If I was given that place absolutely. I probably would anyway depending on where it was. If it was so far in the middle of nowhere that even getting food or necessities was difficult.",
            "Even with thalassophobia, why wouldn't you want to live there? As long as I'm not *in* the water, I'm fine.  This is no different than going to an aquarium.\n\nAs long as I can get amazon deliveries, I'd love living there.  I'd just never go in the water.",
            "If there was regular maintenance on the place, free of charge, and a town or city nearby, yes, I would.",
            "Absolutely",
            "Absolutely",
            "I would always feel the urge to pee.",
            "Can’t afford it",
            "If I were an evil supervillain maybe",
            "I'd have to pee all the time but yeah.",
            "If i dont have to clean the windows, Friends live nearby and its Rentfree, Why not",
            "I would sacrifice everyone I've ever MET to live in this place.",
            "Hell yes. Could finally live life as a mermaid (well, as close to it as possible).",
            "Not sure if I'd live there, but I really wanna do acid there.",
            "The water is cool but it’s not comforting at all that shit looks like a bomb shelter",
            "Yes, it’s beautiful",
            "Definitely not covered under flood insurance.",
            "Imagine taking a dumb at night and seeing a shark",
            "I literally can't imagine a more ideal home 😍",
            "Nice! I’d consider this how thick is the glass?",
            "Yes I would, I'm only here becuase I like the look of the pictures :)",
            "Wifi’s probably ass",
            "I think I *have to live here*",
            "Absolutely! It's not bright clear water that scares me. It's the dark, murky water where you can't see beyond the surface. Some giant gaping maw could be inches away, and you would have no idea..",
            "I hope they didn't use carbon fiber for the bedroom, it's  not made to withstand the pressures of 20 feet depth",
            "Yes",
            "Is this real?",
            "Looks like my no mans sky house",
            "Can I get Internet? If so yeah",
            "How far is the grocery store?",
            "Just don’t turn the heat on a chilly night and crack the glass oh and be sure to make friends with the local orcas or you could be in for a bumpy ride",
            "As long as the mafia doesn't dump bodies from above, sure",
            "Um hell yeah??? Imagine getting zooted and listening to records in that room. Amazing",
            "Yes",
            "The fucking showerhead outside the glass, fucking lol. Although the huge open gap would suggest it’s all part of the aquarium…",
            "how do you get to the bedroom?",
            "I’d invite James Bond to my island and had a real life 1v1 man with the golden gun match",
            "What’s the maintenance upkeep like?",
            "As long as there’s no HOA",
            "The last place you want to hear the sound of glass breaking.",
            "No. Then I'd be the asshole who built a house right in the middle of something beautiful.",
            "ohhh yess n",
            "Imagine sleeping at night and having bright red eyes looking at you from the depths...",
            "T\nYes",
            "Imagine being stumble-drunk in this place.",
            "\"Aquatic Dune\" vibes",
            "My apartment is the size of a shoebox. Yes, I would.",
            "Where is \"here?\" \n\nPirate infested waters? \n\nHurricane alley?\n\nNear a factory?\n\nNear a power plant?\n\nThis affects my answers?",
            "I’d live there in a heartbeat, but my bedroom is going to be above the water.",
            "absolutely. I'm not really afraid of water (I'm in this sub but i don't have thalassophobia or anything LOL) and this would be so fun",
            "Clear water doesn't scare me. I would happily swim around in that. It's the dark, murky stuff that might be hiding Cthulhu that makes my various orifices clench and/or go limp.",
            "Terrifying but the bathroom looks dope.",
            "100%",
            "Hell yeah! It's not even deep!",
            "That would be pretty darn cool",
            "Washing those windows is going to be a pain in the ass",
            "100% yes",
            "Is it leakproof? Does it have a decent sized space where my dogs can run? Yes to both? Then absolutely. I would sleep peacefully under the water like that.",
            "Yes.",
            "Definitely.",
            "Hell yeah! Looks like a James Bond villain lair!",
            "Hellz yes",
            "No way. There’s no possible way this place has tacos and a grocery store within walking distance.",
            "Yes it's so relaxing being under water.\nAlso not deep enough to bother my ears.",
            "It’s all fun and games until you have a Jaws 2 situation.",
            "5th picture looks like Unreal Tournament when they were showing off their fancy water textures",
            "In the daylight I love it, but I imagine at night it would be terrifying.",
            "I’ll probably walk into the glass walls a few times over and over.",
            "Yes, but what happens during high tide? Or a storm?",
            "Luxurious weekend, sure.  To live in every day, no.  It would be completely impractical.",
            "Yup",
            "every minecraft house i build:",
            "Dream Home fs!",
            "hell yeah i ain't paying rent",
            "My dream house",
            "Yes, in constant fear….\n\n“You hear that crack?”",
            "That is the coolest house I have ever seen in my life give me it now! WHERE IS IT!",
            "100% would. However the glass walls must be at least 1 foot thick",
            "Is it free? Then hell yes",
            "Must be a magical experience",
            "How's the Internet connection? Probably haha",
            "Nah. It looks to be a long helicopter ride away from a grocery store 😅",
            "The bedroom would be terrible like that.",
            "I have enough of an issue with water intrusion into my house NOW, and it isn't under water.  \nThank you, no.",
            "Absolutely.",
            "I wouldnt want to wake up and have to swim from my bed",
            "No. Too remote.",
            "now tbh, it looks amazing, BUT you cant see the toilet. do you flush your poop out, then look out of the window and say: hey, there it is!",
            "***intense Subnautica related PTSD***",
            "It’s neat but I feel like having a reflection of water 24/7 would give me a real head ache. Also I’d be too stressed about the idea of the wall collapsing",
            "Absolutely, I can see the bottom; is nice.\n\nBut if it was built/floating hundreds or thousands of feet above the seafloor, with nothing but the dark depths under my feet?  Hell no.",
            "This is every minecraft house I've ever built",
            "Absolutely. Water is only scary if I'm in it and can't see the bottom/anything on the horizon.",
            "Yes, but I really wouldn’t want to deal with the upkeep.  Algae would start covering those windows almost immediately.",
            "So the top of the house is divided from the rest",
            "People who don’t rely on “paycheck to paycheck”, income🤷‍♂️",
            "If structurally sound, absolutely.",
            "Tbh I'm Hella scared of open water in most cases but this looks chill",
            "Would love to sleep with the fish",
            "It's pretty awesome! But I'd be concerned about structural failure...",
            "YES",
            "Hell yeah",
            "Yessss",
            "When can we move in?!",
            "Theoretically yes, although not sure how practical it is irl",
            "Yes but id get a curtain for the underwater bed",
            "Fuck yes I would and I’d go diving every day\n\nIt’s AI tho",
            "For free? Yeah, of course",
            "Tendo em vista que n deve ter nada perto eu acho que n",
            "My actual dream home.  Absolutely.",
            "What are the HOA fees like?",
            "I would live in pics 2 and 4.",
            "Wow. James Bond movie set",
            "Omg imagine the amount of fingers prints?  be cleaning the glass alllllll the time",
            "I would Airbnb there",
            "No",
            "honestly yes, looks very cozy imo",
            "Not unless I was a Bond villain.",
            "If I didn’t have to shower outside while standing on coral then yes",
            "Yes I will if you can explain how I get to my downstairs bedroom",
            "Too many moisture problems",
            "My bones hurt only with the idea",
            "Sure .. only if it's real ..  \nBut be aware that it will require a lot of regular expensive maintenance ..  \nI've been through this before!",
            "Definitely maybe yes",
            "I would love to take a nap, during the day in that room. But at night…? No way.",
            "If it looked exactly like that, sure, I’d give it a go. But only during the daytime. I cannot imagine what that looks like at night.. no thank you.",
            "Too hard to clean",
            "Oh yes",
            "Where are the other two pictures?",
            "I would live in a pineapple under the sea idf it was less than 17hundo/month",
            "In a new York minute I would",
            "Hell no",
            "Hell yeah",
            "In a heartbeat.",
            "The upkeep costs are probably insane",
            "I’ve built this house in Minecraft",
            "Fish judging my late night streaming and snacking choices, no thanks",
            "I'd take it even if I had a narrow window to leave one a month. \n\nI'd take it even if it had bedbugs and an octopus infestation",
            "Wow amazing! I would never leave the house!",
            "as long as I'm not in the water with scary creatures yes",
            "Nope. Nope nope nope. \n\nI’d be so scared it would implode.",
            "How about no…",
            "Ocean house from Eisenhorn Omnibus",
            "Ohhhh wow I wish I could live in a place like this.",
            "That looks AWESOME!",
            "How much is flood insurance?",
            "Not a chance. But I wouldn't mind visiting for a night or two",
            "No I can’t live in AI.",
            "Aquaman aah house",
            "Unfortunately it’s technically in New Jersey, so no.",
            "If there is no interest, I would like to live there.",
            "Fun vacay but what a trippy nightmare for life!",
            "tbh with u if it involded sharks then n no thank u",
            "I’d like to vacation there. \n\nIs this a AirBnB? \n\nNo. It’s a Water BnB!",
            "Fuck yeah",
            "That’s some Bond villian shit I’m in",
            "Yeah. As long as there is like stairs or smth in that bedroom back up to the other parts of the house.",
            "Do you have to keep your bedroom chlorinated? Even if salt water how do you keep your bed dry? \n\nI love everything about that place other than swimming to your bed. They didn't think that one through very well.",
            "My fear of the water is only matched by my love of it so that’s gonna be a yes",
            "All that water ….now I have to go to the bathroom.",
            "It doesn’t seem to be too far under the water. I think I could.",
            "It's cool. But if you're asking me if I want to own this home and be responsible for maintenance, upkeep, taxes, etc? No thanks. Whatever you have to repair is going to cost 10x the price because it's a non standard home. And it's probably out in the middle of nowhere.\n\nIt would be nice for a vacation, but I wouldn't want this to be my primary home.",
            "I would open a bot farm there",
            "Yup 💯",
            "No",
            "How much is the HOA fee?",
            "I can smell the mildew",
            "Yes, I could be living like character, The Deep off The Boys. 😎🐬🐋🐳🐟🐠🪼",
            "As another redditor pointed out, that glass pane underwater will always get dirty and cleaning them will be a pain everytime.",
            "Absolutely, I'd love it",
            "If I move the bedroom yes. I'd be to paranoid to sleep in a room under water with wide open windows",
            "This is literally a Minecraft house.",
            "This screams AI. No, it would be impossible to keep the glass clean, the humidity would be a bitch. The noise would be indescribable especially during any kind of inclement weather. How does it handle the tides? Is this high tide? If so it's gonna be nasty AF at low tide. If you must build such a thing put it in a lake rather than the ocean. If I had the fuck you money such a structure would take I'd build something into a salt mine or other such large underground stable space. Maybe a mountaintop chalet.",
            "Can we please not start posting AI images here, completely ruins the premise of the sub.",
            "Absolutely",
            "Nah, I'm good in my 600 sqft apt.",
            "I really think that's cool, but I'd hate being there at night",
            "With sea level rising like it is? Nope.",
            "100% yes but I’d get kicked out from being in a trance forgetting to eat, sleep, or go to work from how pretty everything is.",
            "I would, but then I'd break something and spring a leak, struggle with fixing it and end up breaking more until it wasn't a house anymore. I'm too clumsy for that lol. \n\nCool aesthetic though",
            "The Deep would love this place",
            "When can I move in?",
            "Man idk.. seems too wild for me",
            "I would be so happy...I wonder if the tho can take on water too if it goes up!",
            "Live? No. But I’d def vacation there for a few nights",
            "I would literally work for free for the rest of my life to live in this.",
            "Just make sure that the upstream flash-flood debris barrier is fully functional before staying there.",
            "Nope",
            "Yes. Nothing sounds more relaxing that taking a shit surrounded by fish.",
            "Looks like somewhere a James Bond villain would live.\n\nI'll take it.",
            "No, I wouldn't be able to afford the taxes.",
            "I mean, I'm not irrationally afraid of derp water so that's not the concern. But...I would make the submerged room literally anything else other than the bedroom. If the water tightness of that room were to become compromised, I sure as hell wouldn't want to be asleep during that.",
            "Obviously",
            "AI crap",
            "Sure",
            "Is this real?",
            "Live?  No. Vacation?  Def\n\nAs long there’s a door on the bottom bedroom",
            "It would be a little weird to wake up to snorklers and scuba divers watching you sleep.",
            "I currently don't have anywhere to stay so yes I would",
            "F yes",
            "How often would we need to clean the window from the outside?",
            "HELL YES!",
            "Yup. At least in the above water part. I’ll skip the below water part.",
            "For free yes. couldn't afford the rent on that otherwise",
            "i feel like the shimmering water would get extremely nauseating after a while",
            "No",
            "Looking at picture #3, all I can say is that room is going to be a huge breeding ground for mold.",
            "Yes, gladly.",
            "What’s the rent/mortgage?",
            "Hell yeah",
            "Probably not IRL but also this is just the houses I build in Minecraft",
            "I would.",
            "I’m not sure about any of them ! The rocks can come down and other stuff",
            "Who cleans the algae off of the windows?",
            "What’s the next question, would you take a million dollars, a cheeseburger and 7 virgins? \nBrother come on",
            "The bottom room reminds me of when I'd play the Sims and lock one of them in the basement with no way out.",
            "I feel like we need to mandate that anything created by AI is labeled as such.",
            "Duh",
            "When I was younger, absolutely. Not now, though.",
            "Hell yeah !",
            "Yes absolutely",
            "no i dont like minimalist arkitecture i prefere inticretly ornemental houses. its just not my style",
            "I could, would I? is another question",
            "Fuck yeah.",
            "If the lower glass had more than one layer of safely glass so my ads could get out if it cracked , then yeah",
            "Is this Rust in UE5?",
            "I would surely try!",
            "That second pic is so dope",
            "You bet your sweet bippy I would!",
            "I'd certainly visit.",
            "Imagine needing to go diving to clean your bedroom window, surely that'll get clogged up with algae etc",
            "Absolutely not. It would have me on edge all the time.",
            "HELL YEAH!",
            "hell yea",
            "Yes. 100%",
            "No privacy, I have to clean and maintain all this. no nearby stores...",
            "No. Mildew in your sheets for sure.",
            "I don’t fit inside my computer case, sadly",
            " Absolutely! That would be a lovely place to live.",
            "Assuming that the ventilation and waterproofing are immaculate? Yes, without the slightest hesitation.",
            "No",
            "No, but only because I saw the video of the guy drowning while proposing to his wife at one of these.",
            "TRON LEGACY",
            "Yeah",
            "This is my base in ARK survival evolved lmao",
            "We love finding new ways to die don’t we?",
            "Yes, definitely.\n\nI would feel like I'm in Subnautica.",
            "The bed surrounded by a foot of water got me gud",
            "Very tempting, I would except after realizing that the seal on those underwater windows will not last forever and after a few years I risk drowning in my sleep or having to pay for very expensive regular maintenance. I mean if you ever have to change the window too you can't exactly drain the sea/lake.",
            "Hi, this is your UberEats delivery driver. . .",
            "Oh look my Minecraft house",
            "What's the upload and download for the internet?",
            "I DONT TRUST THE STRENGTH OF THE GLASS",
            "Dire dire docks playing on loop 🔁",
            "No it’s not nice enough for me",
            "Nah I’d be bored as fuck. I need projects and gardening and places nearby I can walk to. This is more like a vacation home. Couldn’t do it full time.",
            "It’s lovely!",
            "I’m have to share a place with ppl who are lazy either of those place would be better",
            "Absolutely! Just sleep with a tank & regulator next to your side of the bed.",
            "is this real? I have seen many a cg place...",
            "100%",
            "Built it in minecraft.",
            "I think the appropiate question is who can live here certainly not my blood xD",
            "It will be blurry in no time. Also if you poop, will you see it float?",
            "You haven't lived until you've dried yourself using a wet towel from under the sea. Why is it floating outside the bathroom? How do I access it? You just swim, silly.",
            "In a heartbeat 😍",
            "Love fish so yes but who washes the algae of the windows?",
            "Don’t like the tub other than that add curtains then we all good",
            "Does the toilet just dump out into this water? It wouldn't be a deal breaker, I'm just curious",
            "Yep!",
            "Yes!",
            "yes",
            "Totally, but not under the water though. How can you breath?",
            "Hell no. I’m terrified of what lives beneath the water.",
            "MOIST",
            "Why TF would you put a towel bar there?",
            "Totally would. I would also be newly divorced.",
            "That house looks badass AF! I'm living in the tractor of an 18-wheeler, and this looks like heaven (the view from the tub!). It's right there by the shore, there's nothing scary abt it.",
            "Can I order Uber Eats there?",
            "Whet do you mean \"would I live here?\". I would live anywhere as long as it was mine and i could live there safely and securely.",
            "Obviously",
            "AI is stupid.",
            "Nope. Besides the fact that water is scary, the design is bad and it looks so isolated. I feel like I'd lose my mind if I lived in it.",
            "I'd have to pee a lot",
            "Live here? No. Too much maintenance.",
            "No, and it has nothing to do with the water. It looks cold and uninviting. The bathroom is nice. I don't get the attraction to concrete walls. Looks warehouse-y. I know someone who built a concrete house at the beach. Whole inside was polished concrete. Felt like a dungeon. A cold dungeon that will be freezing in our winter.",
            "I would have no issue staying there. If it was black water or dark seas, that’s a different story lol",
            "So many fish would see my wiener.",
            "This, and Troy McClure, belong in a thalassophilia sub.",
            "Hell to the yeah",
            "I'd be worrying more about the sheer cliff hanging over its roof",
            "Absolutely. I love these sorts of designs. This reminds of my favorite minecraft house I made.... Im such a fucking loser.",
            "I would!!",
            "Naw - not because of the sea but because it was built by an idiot. Rooms make no sense.",
            "Depends on how thick the glass/walls are lol",
            "Look, at this point the possibility of being a homeowner before the age of sixty overrides most of my fears or phobias.",
            "Nope hurting my stomach just looking at it.",
            "If they added a reasonable amount of storage space, sure. As is, I don't know where I'd put any of my stuff.",
            "A few days yes, but not permanently...",
            "This is where I went in my imagination as a kid",
            "100 percent",
            "Hell yeah!",
            "Nope",
            "I don't know if it would be better or worse at night",
            "I bet getting groceries is a pain in the ass.",
            "In a heartbeat",
            "Looks like the first house i built in minecraft 12yrs ago",
            "AI bs",
            "It's probably a bitch to keep that window nice. I remember having to scrape the hull of my boat once a month and that wasn't much more than a hand tool and some dive gear. I wouldn't even know where to begin keeping the algae and barnacles and shit off the glass without scuffing it up. And if you neglect it for awhile, one of your walls is decorated as a dirty fish tank.\n\nEdit: i didn't realize there more pics. Fuck. That. Unless it comes with a staff to clean all that underwater glass and scrape growth off the underwater parts of the house, I'm out.",
            "Yes!",
            "I wouldn’t be able to sleep thinking that 1 crack in the glass would end my life when sleeping",
            "Nope",
            "Just don't try to hang a picture.",
            "If I was a Bond villain.",
            "I hope inflation doesn’t effect house repairs.",
            "Absolutely not, I have a huge fear of large bodies of water and Nature can be very unpredictable possibly destroying that place with enough weight and pressure. The sound of water will make me constantly need to use the bathroom 😆 I’m more of a forest/woods/mountain kind of person ⛰️ 🌳",
            "Absolutely.",
            "DoorDash is going to be expensive",
            "This looks like the kind of place where your tech company CEO invites you out to evaluate how good the AI is on a humanoid robot he developed but then the AI manipulates you into helping her murder the CEO and escape, leaving you locked inside unable to escape or call for help.\n\nSo sure, I'd check it out.",
            "I'm sorry... are you saying it's FREE?!?!? Hell yes.",
            "If build by Engineer, YES.\n\nIf build by Designers, **NO**",
            "Fears be damned, class is superior to feeble mental terrors",
            "100% yes",
            "That actually looks very calming to me",
            "I would freak out at night.Thinking I’ve seen a Friggen Plesiosaurus in the dark waters moving about …. Nope nope nope",
            "That's my Minecraft house how did you get these screenshots ?",
            "If you lived here you would wake up every morning thinking you are wet and drowning.",
            "The question is how will you sleep? If you sleep, you will miss this beautiful view😍",
            "Depends where I’d be getting my groceries.",
            "I would have narcolepsy if I lived here. It looks so calming",
            "For me it’s the fear of deep water, big animals, and stumbling upon large shipwrecks and things. This is not that deep, probably never would see a big animal, and obviously no shipwrecks. Sign me up.",
            "If I had some kind of transportation to be able to get out of there when I need to sure why not. I love water and the ocean.",
            "Hell ya, in a heartbeat!",
            "Absolutely I would! That would be so relaxing…",
            "No. Nope. Nah. Never.",
            "I would beg to live there! But then I'm not thalassophobic and indeed love the sea and scuba 😉",
            "A dream man honestly",
            "Only if it has a pool",
            "Heck yeah",
            "As much as we have the phobia, this place is too beautiful to let this opportunity go by",
            "Which Bond villain lives here currently?",
            "Would I live here. Stupid question. It’s a goal to just get to smoke a bunch of green in the underground room view.",
            "I was all for it until I saw the underwater bedroom.",
            "Hard yes",
            "Nope",
            "That is so cool it doesn’t look real.",
            "No, I'd love to visit but maintenance would cost a fortune.",
            "Hell no but I’d love to rent it. Can you imagine the maintenance?",
            "Fuck yes, that's amazing. Absolutely gorgeous",
            "Id need to practice being a super villian",
            "Depends, how good of an internet do you have there? Like I aint fucking with more than 40 ms",
            "For sure! Too shallow for any huge scary creatures to show up, really.",
            "How long is the walk to the grocery store?  Will there be any good bike trails nearby?\n\nI mean, the cats might enjoy watching the fish…. \nSo there’s that.",
            "Whats the upkeep like?",
            "Yes, it’s gorgeous!",
            "Happily.",
            "That is my DREAM home…obviously I am the exact opposite of a thalassophobe though.",
            "What Minecraft mod is this?",
            "Only if I didn't have to wash the windows.",
            "The bedsheets touching the water,, brotha euugh🤢",
            "Absolutely!.",
            "Open ocean and deep water I can't see the bottom, I'm terrified of.\n\nIf I can see land in any form I am okay, especially if I'm in a shelter designed to be underwater. \n\nI think it would be pretty dope to see fish swim by as I'm enjoying my coffee, seeing the sunrise glimmer through the water. That is peace\n\nEdit: Even though it's AI or a poorly done splice job, it's a nice concept.",
            "Only if I can fail to kill Bond.",
            "Totally.\n\nI don't care what horror movie sci-fi gotcha is hunting me or built into or haunting the house. 100% I will move in tomorrow and live happily until the ghost of the shark who is the true architect swims through the walls and eats me or whatever.",
            "The shithole for this place is probably just a hole in the floor.",
            "Hehe, shønk... 🦈",
            "Why do sharks explode? This is because sometimes their brains and sexual organs are made of M80s. Sometimes, to attract mates, a shark will explode. And, sometimes they explode just to attract giant killer bees.",
            "😭 this comment made my day. I can close reddit now.",
            "Ya but what if you have a jerk off a dolphin roommate weekly?",
            "You mean Bruce!?",
            "What if the room came with two murder hornets instead of a shark?  An interesting 'would you rather' situation.",
            "[Does your apartment look poor?](https://youtu.be/cJH_0jxL-w8?si=fjELt-PjJCnmb982)",
            "I couldn't initially decide if they were toilet paper dispensers or electrical outlets underwater in the 4th image by the potted plant that's clearly underwater.",
            "I personally think the whole thing is a mess. All of these pictures look like different places rather than all one building.",
            "Yeah. This is some Sims torture shit.",
            "That room is for guests",
            "duh u can just use the living room\n\nlook at the glass half full.\nor rather, house half useable.\n\ndont be negative",
            "Having to suit up with scuba gear to scrap all the barnacles off the window every week isn't appealing to me. TBF, neither does cutting grass...",
            "Oh the mould!",
            "Don't worry it's an AI image so you can't live there.",
            "[deleted]",
            "Who wouldn’t want their shower and towel rack to be on the other side of the glass in the water?",
            "But the outdoor (underwater) shower is cool.",
            "You didn't like that the bedroom at least 3 feet of water on the floor and somehow was completely open in the ceiling to the sea like some kinda reverse moon pool?!\n\nYou're not even trying to fit in with the rest of the Sahuagin!",
            "The closest option irl is The Muraka in Maldives",
            "Standard rooms are 10 ft in height so not much to worry about pressure. Earthquakes however might crack the glass but that can be mitigated by building the structure on some sort of a 2d damper.",
            "Waking up to pee at night might be quite the fright.",
            "Maybe it would be better if it wasn't though...",
            "True, I didn't think of that",
            "If you can afford a house like this you can also afford a maintenance team to scuba dive down and scrub the windows every few days",
            "What if we added some spiders and snakes? Would that help?",
            "Straight up my first thought was if Amazon delivered",
            "Constipation cured!",
            "Sharkitect",
            "I’ve seen this exact thing happen at least twice.",
            "Airlock in the floor I hope",
            "Nothing like the view of a neutral buoyant turd floating by your bedroom window.",
            "All hail the shork",
            "So messy.",
            "I hate that I know what you’re referencing. What a weird experiment…",
            ">jerk off a dolphin\n\n0.o",
            "Murder hornets would quickly be met with a quick swat from the morning news! Can’t really do that to a shark.",
            "I think those are the shower/ tub knobs even though I don’t see a shower head?",
            "The towel holder really brings the room together (according to the ai)",
            "The sink faucet is a reflection of a reflection?",
            "This is what your dreams look like if you drink enough Gatorade before bed",
            "Those windows wouldn't stay clear for long either. You'd get a nice green hue from all of the algae build-up.",
            "I wonder if there's a tech solution to the barnacle and mould/fungus issue. Like, say running an electrostatic charge across the surface. Dunno, has anybody ever tried this?",
            "And mildew! You’d wage a war and never win",
            "lol thank you for clearing that up",
            "Man at bar: “I live under the sea.  It’s a gigantic glass house I had custom built underwater.  Also, I’m rich.  I’d have to be to have built such a place!  So what do you say?  Wanna come back to my place?”\n\nwoman at bar:  “uh, ok Spongebob.  Good luck with that.  Now please stop harassing me, crazy person.”",
            "How are you going to get down in your bedroom to have the sex? There's no doors, portholes, or air locks. Almost like a dumb AI made it?",
            "Those views would get you sex",
            "Man, i'd be so distracted, it would get you laid but then you'd see like, a glowing Jellyfish or some wild shit and lose focus lol",
            "It looks like coral is stuck on plain rock as opposed to what is usually seen in nature. Just being a reef 🤓",
            "Shower/bath knobs are also under the sea…. oh well, guess I’m getting wet anyway?",
            "How about the 1st and 7th images showing a bedroom with no way to enter or exit?\n\nOr the bathroom in the 6th image with the towel rack and shower fixtures outside, in the water and a glass wall that only extends to the counter top which for some reason extends out into the water?",
            "I'm gonna need you to look over the details of the place and if you give it the okay I'm moving in ",
            "I'm gonna need a guide rope because that rippling/lighting is gonna mess with my head",
            "Especially if the bed sharks bite",
            "But you must fight the fright, peeing at night can be full of delight, a simple flip of a switch to turn on a light.",
            "Just write a script and you got yourself an emmy award winning masterpiece",
            "You son of a bitch",
            "Sharknado prequel",
            "Oh ya and he’s always fucking high out his big ol dolphin mind",
            "There sort of looks like a shower head above and too the right. Though again it appears to be completely outside in the ocean lol.",
            "Shower head is in the ocean....",
            "Good eye! It's the wrong side to just be a reflection, and there's nothing below it for a physical faucet",
            "Gatorade?  What is in Gatorade to cause weird dreams?\n\nOr is it that your brain makes up stories about your full bladder?",
            "Nah! You’d just get one of those magnetized scrubbers used on regular aquarium fish tanks but big, **VERY, VERY BIG**!!!",
            "just filter the water of all nutrients fuck the environment amirite /s\n\nbut in all honesty by the background scenery idt there would be too much algae in that area naturally",
            "Well, maybe copper dusting throughout the glass and architecture might help with algae... but other wildlife not so much.",
            "so, there are a few of ways to do that. \n\n1) have an external propeller to push the water at a fast speed across the external windows. It won't eliminate the issue totally, but that would do an OK job.\n\n2) Window wipers set for a swipe x times an hour.\n\n3) You may be able to build a laser scanner that would burn off the tiny barnacles",
            "Pet sharks with fricken laser beams.",
            "What if you're giving your partner the business and scuba divers swim by?",
            "AI generated rooms are always off but adding the underwater element makes this one really bad",
            "You ain't wrong, Sharknado is a classic and a masterpiece. 10/10 I would love the Sharkhitect. \n\nGet that coin.",
            "Ok but Jason Alexander has to do the voice of Sharkitect",
            "I just noticed the towel bar floating out there too 💀",
            "Also the sink drain isn’t connected to the pipe, it’ll just pour onto the floor.",
            "I was going for the bladder joke, but readers should feel free to read in whatever context makes the joke work best for them personally",
            "Yep, that would be a giant filtration system! I live in a landlocked state, so I hardly ever see any water that's not murky ha. I guess you probably see a lot clearer waters in places like the Mediterranean.",
            "Ultrasound?",
            "That's why you have the Blackwater-trained guard sharks with frickin' lasers on their heads. They keep the rabble out, but will also be discreet and not watch you.",
            "What if the only way you can cum is to see scuba divers and they have to lock eyes on you at an exact moment?",
            "Literally what came to my mind when i said sharkitect in my head",
            "That's brilliant",
            "Youthpastorryan just did a short about all the horrible cameos in the Sharknado movies. Looking at you mainly Jared from Subway!",
            "Shark Vandelay",
            "Ah man, that made me laugh out loud after I went back to look for it.",
            "The tap is in the mirror lol",
            "Also the numbering on the pictures suggest some didn’t pass the sniff test and OP excluded them.",
            "Towel bar got me."
        ]
    },
    "Hell to the no": {
        "title": "Hell to the no",
        "score": 40,
        "url": "https://v.redd.it/x6ryv63u748d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Id stop talking and start paddling before the sun sets",
            "id cry",
            "Don't leave the boat!",
            "Cause who knows what comes up when the sun goes down 🤷‍♂️ I’m shaking rn thinking about it. This one time, I was on a cruise to Mozambique, and my partner wanted to go out for a smoke..it was daytime, as he was smoking I look at him, and I say to him, I just saw a shark, a big one, eating violently on something..he turns to me, and says, every time you get close to water you imagine seeing crocs, or sharks..the guy next to us says he saw it too…so now you can understand why I’m shaking for this guy.",
            "Lol",
            "I was thinking he looks too far from the boat, with a completely disorienting empty horizon on each side I’d be scared that he’d drift far enough to lose sight of the boat, then how easy would it be to never find it again.",
            "Wow thanks for the anecdote! I feel u, and am currently binging his vids on tik tok… do u think it’s bravery or mental issues that pushed him to do this absolutely incredible yet insane feat?"
        ]
    },
    "Dive team in the Arctic checking out the icebreaker's propeller.": {
        "title": "Dive team in the Arctic checking out the icebreaker's propeller.",
        "score": 444,
        "url": "https://v.redd.it/qaqcrs1e6w7d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "This one gets me. I couldn't even imagine looking down in this situation.",
            "Man I hope they unplugged the power cord first",
            "I think diving in central europe in the winter already sucks. I can't even begin to imagine how it must be like where they service ice breakers.",
            "Ya know…I’m curious as to what sorta things divers who do this are afraid of. Like, what do a Navy wreckage or salvage divers look at and say “Oh, abso-fucking-lutely not. No way am I going *that*. Nope, find another sucker.”",
            "“Yep - definitely still attached to the ship, Steve”.",
            "This is what Lockout Tagout was made for. I’d triple lock that sucker!",
            "/r/submechanophobia",
            "You are a pilgrim to the deeps. And remember, God lies in all realms.",
            "I hope that is decommissioned or broken otherwise I would hate for it to kick into gear while inspecting the blade.",
            "How many feet down?",
            "Imagine looking down, and then looking up.",
            "You turn the breaker off Bob?",
            "The boring answer is probably things that they're unfamiliar with like most people.  Fear of the unknown.  Given they work as professional divers, they likely aren't afraid of diving related things unless there's an actual risk to safety (too stormy of conditions, etc).  Their fears are probably random... one might be afraid of spiders, another afraid of heights, etc.  \n  \nFun answer:  Cthulu.... they're afraid of Cthulu until they come to love and warship it.",
            "Clowns."
        ]
    },
    "This is pure madness ": {
        "title": "This is pure madness ",
        "score": 4,
        "url": "https://www.reddit.com/r/TikTokCringe/s/S0pqjv18PU",
        "content": "",
        "num_comments": 1,
        "comments": [
            "HUH?!?!"
        ]
    },
    "This game is a literal nightmare for us. [Still Wakes The Deep] ": {
        "title": "This game is a literal nightmare for us. [Still Wakes The Deep] ",
        "score": 47,
        "url": "https://i.redd.it/zbalzuy4lx7d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Great game, like Alien Isolation is depends on atmosphere. And that's one of the hardest things to do in a game.",
            "Def less ocean horror than I thought but a great game with tons of claustrophobia (and still some spooky water wading/swimming here and there)"
        ]
    }
}