{
    "Official Verdict League": {
        "title": "Official Verdict League",
        "score": 91,
        "url": "https://www.reddit.com/r/ufc/comments/19c6ker/official_verdict_league/",
        "content": "Hey guys, just in case you missed the pinned comment on the discussion thread, we now have an official verdict league to replace the old Reddit predictions feature. Use the link to join or I will oil you up personally.\n\nhttps://verdictmma.com/seasons-leagues/league/rufc-predictions-league-3524?token=b3edf2d63b7ae137794c3564323238d4&isShareable=1",
        "num_comments": 40,
        "comments": [
            "oil me up then",
            "Yo why isn’t there a pinned discussion for this card?",
            "![gif](giphy|VYk5o8rvpTI9j2cjnG|downsized)",
            "why? reddit poll was cool and fun. aint signing up to some bs site for this... thanks for ruining the fun you farts",
            "Official verdict - Jon Jones is a homo",
            "I installed the app and after I login, it's just stuck on a blank screen. Anybody else? I'm using a Galaxy Fold 5",
            "Why is Vicente luque fighting Joaquin Buckley",
            "Looks like there’s only a few bangers on here. But maybe I’ll be pleasantly surprised ",
            "Just joined, made my picks for the card.",
            "What book am I supposed to buy?",
            "https://preview.redd.it/cc3jsgtjtduc1.jpeg?width=1024&format=pjpg&auto=webp&s=98c1e70ac2ed0ea35e2c2de488e36dfbf27d2d5c",
            "Uhh what? ",
            "He couldn’t’ get him out with his hands, so he laid and prayed.",
            "Islam looks alot less confident than he has past few times.",
            "Kudos to Dustin for going at it, islam is a fucking cheat code, Love him hate him, can’t wait to see him get matched up with some diversity.",
            "Calling it:\n\nConor is out of the UFC and will be fighting in the BKFC permanently. \n\nMichael Chandler just got fucked out of his millions and waited 2 years for nothing.",
            "anybody else unable to bet on any ufc fights on fanduels right now they all appear locked for me",
            "![img](emote|t5_2qsev|11885)",
            "It wasn’t up to us. Reddit removed the predictions feature and this is the best we can do in the meantime",
            "sean brady had an injury during camp and had to pull out",
            "😭",
            "Conors too big to be fighting in bkfc plus he has fights left on his contract",
            "oh. I apologize then.",
            "Reddit dude with class! \n\nRare as hens teeth"
        ]
    },
    "Armfield AMA Delay": {
        "title": "Armfield AMA Delay",
        "score": 2,
        "url": "https://www.reddit.com/r/ufc/comments/1dlr20s/armfield_ama_delay/",
        "content": "Apologies everyone, the AMA has been delayed due to a sudden issue that came up for Garrett. It is being rescheduled and we will post an update in the next few days on when that will be.",
        "num_comments": 7,
        "comments": [
            "[deleted]",
            "K",
            "Well I'm sure less people care now. Who tf is that guy anyway,?",
            "Had a banger of a fight last weekend. Fellow Reddit nerd like the rest of us degenerates",
            "He’s the official fighter of r/ufc have some hespect"
        ]
    },
    "How an interview changed the sport": {
        "title": "How an interview changed the sport",
        "score": 1258,
        "url": "https://v.redd.it/7t8mofhst28d1",
        "content": "",
        "num_comments": 119,
        "comments": [
            "Learns English only to troll Izzy.",
            "All-time great sports rivalry. A couple of legends.",
            "Surprised this rivalry in the ufc ended so fast. Izzy lost then sent Alex’s head to the moon and they went completely different paths. The way he left Alex in Miami 😭",
            "If u posted this on TikTok there would be about 200 comments going smthn like ‘now izzy da guy in bar beat that guy one time😀😀’",
            "What’s the song at the end?",
            "That \"Come to Daddy\" line was cool AF",
            "Thanks for reposting it again I almost didn't see it this week.",
            "Didn’t change the sport bro, it set up a few good fights but it changed AP’s life for sure tho",
            "Izzy pulled a Ray Stanz with those comments",
            "This guy really is something else, from SEVERE alcoholism to Poatan. Love this guy",
            "The hate boner some people on this sub have for Izzy, a sports athlete they never met in their lives is absolutely insane lol. \n\nThen they write all this fan fiction about a \"rivalry\" that Alex himself says isnt a rivalry and he'd happily train with Izzy lol. \n\nJust watch the fights & stop being over emotional. Or go to therapy or something. Goddam",
            "I beat that Guy one time",
            "We all need an Adesanya in our lives. \nNothing will motivate you like a good rival. \nThis is the type of shit why i love MMA.",
            "I can't believe Izzy actually has any fans.",
            "Why do people act like that story ends there. Izzy comes back and knocks his head off but probably that is not a good end to the story for Pereira fans.",
            "How many times will these be reposted?",
            "*hmm*",
            "Cut out the best part where he said “trynna get a dick suck from a crackhead or some shit” 😂",
            "Reports have shown that Pereira's walk-around weight out of camp is north of 230 pounds. For a reference point, former UFC middleweight champion Israel Adesanya's walk-around weight is in the range of 203-205 pounds. Keep this is mind folks!",
            "Great video.",
            "Say what you want, Poatan is a monster and Izzy fought him multiple times and beat him the last time. The way Poatan is beating people in LHW aged Izzy's win against Poatan like fine wine.",
            "I like both the dudes a lot. They are true warriors",
            "I'm in a weird spot with these two, as they're easily my two favourite active fighters.",
            "Gotta get the interview with Demetrius Johnson interviewing Izzy in a bar talking about Alex. It's gold.  Izzy lit that fire and that fire took over.",
            "Dope edit",
            "Track goes hard too. Not heard it in years.",
            "Izzy spawned Thanos right to ufc with that interview",
            "Alex is the baddest mothafucka, unmatched",
            "When the lyrics dropped I got goosebumps",
            "It will forever be 3-1",
            "The Chinese fellow never learned the first rule of the street.\n\nNever get high on your own supply.",
            "Izzy is washed up bro. He got lucky and won 1 out of 4 fights and acts like hes the man LOL lame af",
            "Now show where Izzy knocks his head off.",
            "Adesanya: “god I wish he spoke English…….”",
            "Legend",
            "huh",
            "It was an incredible outcome, but when someone says 'no rematch', you know they think they can't do it again. And wish to dine on that KO for all times. It's like scoring a goal and then taking the ball home. That's the Adesanya mindset.",
            "I think they respect each other a great deal.  Both have great legacies and don't have a whole lot more to prove, including against each other.  Alex was the only one to do to Izzy what he did to him.  And vice versa.  \n\nThey don't need each other to elevate themselves individually anymore.   They're already two of the biggest names in the sport.",
            "He was getting pieced up in that fight before the knock out really. It was so one sided up to that point and Izzy was almost done. He landed a great punch because Alex was way too aggressive and left himself open and you can’t do that against a striker of Izzy’s caliber even if you’re a striker of Alex’s caliber",
            "Reddit nowadays is just regurgitated Tiktok videos so it's probably already there.",
            "I got matches with these songs:\n\n• **Beautiful (Super Clean Radio Edit)** by Eminem (01:34; matched: `100%`)\n\n**Album**: Beautiful (International Version). **Released on** 2010-02-03.\n\n• **BigJohn - Beautiful Eminem Remix** by BigJohn863 (01:10; matched: `100%`)\n\n**Album**: BigJohn - We Goin Live. **Released on** 2013-10-23.\n\n• **Beautiful** by Eminem (01:34; matched: `100%`)\n\n**Album**: Relapse. **Released on** 2009-05-19.",
            "First time I see this lol",
            "But mom said it's my turn to post this",
            "First time for me, you must live on this subreddit 24/7",
            "🤣🤣",
            "He’s the voice of gay anime fans",
            "Casual mindset, you don’t have to follow him and see what he does outside of the cage to be a fan of his. I’m a fan since he beat Whittaker in 2019.",
            "Ofc a Izzy fan has an avatar like that 💀💀",
            "Why do Izzy fans pretend that Izzy somehow won the rivalry when it's still 3-1 ?",
            "Cause that Pereira interview was after the knockout, genius. He called out Adesanya at LHW for the trilogy and offered him a free title shot, and Izzy refused it. That's the actual end to the story.",
            "Till Izzy fans learn how it is",
            "They both 185 on the scale baby… ",
            "Unless they fight again",
            "really nothing lucky about training everyday for 20 years. dude was 2 seconds away from knocking him out at the end of round 1 in their first MMA fight. \n\nI swear some people on this sub gotta be in the 8th grade lmao",
            "LOL :fat dude eating chips meme:",
            "Concentrated Hater Energy. Massive Respect.",
            "I won. It's over.\n\n\n\n\n\n\n1-3",
            "Adesanya was talking about himself. He'll be looking at Alex saying \"I beat that guy once.\"",
            "> That’s the Adesanya mindset.\n\n~ Reddit Guy",
            "yeah especially when Alex was lighting him up right up until he opened up too much and got blasted into orbit",
            "To be fair, when these guys fight, they both take a few years off their lifespan. I think both men are a bit reluctant to go at it again.",
            "I mean it's a massive risk for Adesanya so it makes no sense for him to go for it. Also even if he won everyone would be saying they're still 3-2 to Pereira.",
            "Not really an Adesayna thing. I've hear Chael say that it's a unwritten rule for fighters to not take a rematch unless they think they can do better than the last fight.",
            "[deleted]",
            "Why does Izzy need the rematch? Looks like you cant accept the outcome of the last fight.",
            "TikTok is just regurgitated reddit content\n\nFull circle",
            "Apple Music, Spotify, YouTube, etc.:\n\n\n\n• [**Beautiful (Super Clean Radio Edit)** by Eminem](https://lis.tn/lyKaf?t=94)\n\n• [**BigJohn - Beautiful Eminem Remix** by BigJohn863](https://lis.tn/KgmKO?t=70)\n\n• [**Beautiful** by Eminem](https://lis.tn/Beautiful?t=94)\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon. Music recognition costs a lot)",
            "Good bot",
            "Im gay and like anime & I prefer poatan",
            "Omg rainbow colors = gay ha ha super joke",
            "Alex himself said he never saw it as a rivalry. Why are you writing this weird fan fiction about 2 dudes you never met in your life? Take that shit to tumblr",
            "Because the Alex and Izzy \"rivalry\" is Adesanya's story. He rescued Alex, lost to him, and then conquered the giant that he created.",
            "I'm a proud Izzy hater but I honestly believe that if they fought 100 times they would win 50 each.\n\nBut still, 5-1",
            "1-1 in MMA, and he won that first kickboxing fight if you actually go watch it",
            "Dude is desperate to be the main character - did you not see the video Alex is refering to? Doesn't take a professional psychologist to work that one out.",
            "Oh yeah absolutely.    \n\nIzzy won the first kickboxing fight and he was winning the 2nd kickboxing fight but he got knocked out by accident. But if he didn't get knocked out he would have won, so I'm gonna have to give that win to him.     \n\nIn the first MMA fight he basically won in round 1, and he also would have won the decision if it went all 5 rounds, so Izzy actually won that fight twice. And in the second MMA fight he won via KO, but also his post-fight celebration was really cool so I count that as another win.   \n\nIf you look at this rivalry from a completely unbiased perspective, the score is like 7-1 in Adesanya's favour and you cannot change my mind.",
            "Looks like you're making shit up to help with your delusional mindset.",
            "Good bot",
            "Based.",
            "Ah. A Jon Jones fan.",
            "Are you gay?",
            "Just showing Izzy fans a mirror.",
            "I don't why Izzy fans keep feeding his \"Main character\" delusions. There is no story. It's just life.\n\nLet's see this from Alex's perspective. You've beaten this guy twice, yet you're also losing to your personal demon: alcoholism. Then you see the guy you beat twice shit talk you in an interview, claiming that your only claim to fame while you're rotting in a bar is \"I beat that guy one (It was actually two) time.\" And then you realize something, he's right. In spite of all your triumphs, you've let your demons consume you. And you make a vow to yourself that you're not going to die from liver failure, only sustained by bygone glories. You enter a completely different sport with different rules and you beat that shit talker again, becoming champ. And even though you lose to that guy in the rematch, you don't let it get you down. You move up a div and become double champ, while the shit talker is probably sitting in a bar coping \"I beat that guy one time.\"\n\nIf anything, this rivalry is Pereira's story.\n\n>He rescued Alex, lost to him, and then conquered the giant that he created.\n\n3-1 is not conquering. It's not even settling the scales. Especially when Izzy promised there'd be a rematch with Alex and then backed out. And Alex has won against opponents that beat Izzy.",
            "HIS-tory",
            "why cant it be pereira's story too?\n\nIf Izzy comes back and wins the belt again that only makes the story of their rivalry better imo",
            "Then got CLASSED by... Sean strickland???",
            "No way Izzy would win max 35/100",
            "That s beside the point. Alex wanted a rematch at MW; Izzy said no. Alex wanted to fight him at LHW; Izzy said no again. That says it all about what Izzy thinks of him",
            "For real, it's 2-2 if we're being honest.",
            "Cry harder please. He lost the first fight, plebs on reddit that haven't actually watched the fight and know the kickboxing judging system will say that Izzy won it lol. Iz dickriders are convinced he is the most unlucky person ever. Lost to judges, accidentally got knocked tf out twice. Cry harder please 🙏",
            "the video hes referring to is of adesanya responding to something pereira was doing, and giving the same energy back.\n\nwhy does that offend u?",
            "Perfect. Everything. Down to the last minute details.",
            "Thank you, akshaj16, for voting on auddbot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
            "He fought this guy 4 times already give him a break lol xd.",
            "That's quite opposite of being honest. Honesty would be relaying what the official decision was, not what everyone on reddit who suddenly became kickboxing experts and judges thinks of the decision.",
            "as a completely neutral 3rd party. you sound like the only one crying bro lol\n\nAlso izzy was 2 seconds away from knocking him out at the end of the 1st in their 1st MMA match\n\nwhy are you so passionately attached to the outcome of 2 fighters you never met in your life? its a bit weird tbh",
            "Kickboxers and muay thai guys fight each other crazy amounts of times. If anything, I think it's more interesting the more comfortable you are with your opponent's game because it feels like they know what the other is gonna do next",
            "But Izzy and his riders keep saying Izzy settled the score when it’s 1-1 MMA and (a disputed) 1-3 overall, so my comment was just a factual reminder that Poatan is not the one ducking an MMA trilogy.",
            "I have no biases towards Alex or Izzy. I like both guys but if you honestly think that Alex won the first kickboxing fight between them then you're crazy or didn't even watch the fight in the first place. If you need some experts opinion go watch Joe Rogans take on the first fight between them.\n\nEdit: Typo",
            "It's a 5min round, he didn't finish him cry harder. I also don't care. I wrote a reply that took approx 10 seconds to type. Stay mad 🙏",
            "“Experts”\n\nJoe Rogan\n\n🤷‍♂️",
            "The LAST fucking person I'm going to for perspective is Joe Rogan. It would not surprise me in the absolute least bit if he's never actually seen the fight and is just going off what other people tell him.",
            "you're having extreme emotional outbursts & trying to project it onto others. Its a bit fascinating to watch",
            "Joe Rogan is an Expert. Been with the UFC for more than 20 Years. Has a Blackbelt in Taekwondo and two black belts in BJJ. How is some random Redditor more knowledgeable and questions his expertise?! Touch grass, man",
            "What about Demetrious Johnson?",
            "Yes I'm fuming 😭 where do you get this idea, Zimbabwe psychology diploma ahh",
            "Same Joe Rogan that said Izzy was up 3-0 on Jan going into round 4?\n\nBeing an expert doesn't mean you aren't sometimes biased or have bad takes.",
            "Didn't DJ say that Anthony Joshua would beat Ngannou in an MMA fight?",
            "Ay don't disrespect that degree. The guy made 400 trillion  dollars for it",
            "you unironically are"
        ]
    },
    "No way UFC just posted this": {
        "title": "No way UFC just posted this",
        "score": 868,
        "url": "https://i.redd.it/oirrfg9rr18d1.jpeg",
        "content": "",
        "num_comments": 91,
        "comments": [
            "Dont do my boy Dustin like that 😭",
            "Is danawhitescousin an official UFC account?",
            "As someone who it took 13 years to have my son, this hit me super hard.",
            "“You’re taking everything I worked for “ Israel Diaz",
            "Actually spit my drink for this shit haha",
            "The wording of “teenagers in the lunch break” is confusing. Poor delivery. 7/10",
            "He's not making them money anymore, why wouldn't they take pot shots at him?",
            "Premise is funny, delivery is terrible.",
            "I don't get it",
            "Alex is a generational talent. Not a knock on dustin but Alex is legit a special fighter",
            "Chee Wee Wee",
            "Chama",
            "Martial arts used to be about respect, then Dana happened",
            "Frl",
            "Bruh",
            "This is so true",
            "Ppl out here tracking cycles and ovulation while I defeat birth control. Call me an ICBM because I’m nuking them ovaries after 3 disappointing pumps",
            "Talking about ch*ld s*x is insane dana.\n\n![gif](giphy|WmX7xoMQJzyKNksePs)",
            "Ayo its like fertility decreases over time or summin lile wat?? Aint no way nature made us most fertile during pubity nature into some weird shit dawg",
            "But on the flip side Chandler is going to retire still wishing for the Conor fight. And Dustin fought him three times.",
            "It’s the fight business",
            "Yes\n\n![gif](giphy|jI3EBNa1aKSaIpH2PB)",
            "13 is actually a really young age to become a parent",
            "You smash??? Brotha maybe somebody lying",
            "Did you forget to fuck?",
            "Don’t rush in next time.",
            "Yeah shit ain’t funny.",
            "brather you must smash \n\nAlso sorry you had to deal with that",
            "I had the oposite, kid happened by accident (the damned woman had medical papers on being infertile!) - but I love him to bits so it all worked out",
            "Womp womp",
            "Bro was slipping his girl the pill the whole time.\n\n>super hard.\n\nI’ll bet",
            "This is what happens when you outsource meme farms to India.",
            "Where did they post this?",
            "Dustin had been trying for a belt for years and Alex comes in and gets two quickly.",
            "I don't think the UFC was ever about respect. It's pure business and entertainment. ",
            "Ok Chatri",
            "this shit happened in boxing way before it happened in ufc",
            "Respect is boring.",
            "Dustin had 3 red panties night 💋💃🏻",
            "Okay Dana 😂",
            "![gif](giphy|kGiKJNlIljFdinlJsB)",
            "Naw, smash everyday like Khabib say. Hahs",
            "Naw, had plenty of \"ring time\" lol Just didn't have the $ for IVF until I was older.",
            "![gif](giphy|nkOWtXwuH2aneU0MAn)",
            "Smash everyday. Haha",
            "Good thing that wasn't the other way around or she would have killed you when she ended up pregnant. Haha",
            "Kids just didn’t want to swim",
            "This shit wasn’t even funny at all",
            "I was down 4 rounds, but like Miesha Tate and Leon Edwards proved, it ain't over until that bell rings for the 5th round.",
            "I was slipping her something, just wasn't working. 🤣😂",
            "No way this was posted by anything resembling the UFC's real accounts, just fan meme accounts",
            "They didn't, official social media accounts of major sports leagues don't post low effort memes like this",
            "Yeah I get that, but I just don't get the meme. Teenagers at lunch?",
            "Not the ufc, martial arts in general",
            "😂😂😂",
            "You are right, i stand corrected",
            "People are killing each others in a cage and the disrespect is what makes it exciting?",
            "Until you’re on the other foot",
            "Had my one and only daughter at 43. We didn't try for 13 years though. Maybe just a few years when we realized it was now or never and adoption was gonna be a pain the ass.",
            "Me Habib be smashing like cans. As well as doing the sex",
            "Oh so true! 😆",
            "Boohoo",
            "Teenage pregnancy? What's not to get lol",
            "I just meant I don't think Dana White is responsible for the lack of respect in martial arts. ",
            "By respect do you mean letting some fat idiot heel kick your thigh as hard as he can to make himself look superior in a demonstration in some shitty town hall with hard wood floors.\n\nMartial arts being about respect has always been an over conflated fallacy.\n\nUntil the ufc half of martial arts was about swindling idiots to pay for martial arts classes that don't work.\n\nLooking at you aikido, kung fu, arakan, ninjitsu, etc, etc, etc.",
            "Yes. \n\nI couldn't care less about 2 people beating the crap out of each other if it doesn't have drama \n\nWhy should I care who wins then? Who am I rooting for? Why am I rooting for them? \n\nLook at naruto fight scene and it won't feel like anything unless you know the story",
            "Gotta protect yourself when smashing the cans, otherwise end up cut. Lmao",
            "Not funny 💀💀💀",
            "That makes sense. Thanks my fella",
            "Ofc it is not his responsibility alone, but i think he played a major role",
            "No, by respect i mean not talking trash about your opponent who’s in the same boat as you, and you mentioned bullshido, but not what works, like muay thai, karate, taekwondo, wrestling, judo etc which are the bases for modern MMA",
            "15 yr old teenage girl logic",
            "I disagree.\n\nImagine failing at something for 13 years. Couldn’t be me.",
            "Don’t be a baby lmao",
            "Weird, am I living in a timeline where Muhammad Ali didn't exist?",
            "I mean id rather fail for 13 years than live in fucking Arkansas 💀💀",
            "Yeah because no wants to touch you mate or sleep with you so of course it wouldn’t happen to",
            "Thats why i said i stand corrected, it started woth boxing before mma",
            "Oh so I pissed you off so much you had to go look at my profile and that is the best you could come up with?! LOL",
            "I don't see where you said that.\n\nBut in reply to your previous comment I listed bullshido on purpose as the point I was trying to make that so much of martial arts was not about respect that this whole fallacy needs to die",
            "Mate, no matter how you spin this, Dana did not invent the concept of talking shit. This stuff sells, no wonder people do it. Regardless of your opinions on the man, be thankful that he did stick through the dark ages and advanced the american mma sphere by so much.",
            "Arkansas 💀💀",
            "Womp womp 😅",
            "https://preview.redd.it/dqln72y6y38d1.png?width=547&format=png&auto=webp&s=ea9a270e1c647b57255ca133ad77c6be1b46ee1b",
            "People like you love saying things like “that really pissed you off huh?” As if that’s not a reflection on themselves. You piss people off because you’re a cunt. Imagine being proud of that 🤢",
            "These foos are butthurt 😂😂😂😂",
            "One can have both a positive and a negative impact, im grateful for what he did to popularize the sport, but i hate the encouragement of trash talks by him and his team, and i know this shit sells, and i could care less, im still going to voice my opinion on the matter",
            "Arkansas, Bro",
            "I can respect that"
        ]
    },
    "What happened?": {
        "title": "What happened?",
        "score": 1657,
        "url": "https://i.redd.it/bpu763pwl08d1.jpeg",
        "content": "",
        "num_comments": 378,
        "comments": [
            "Jon getting a favourable judges decision again.",
            "Well how’d that happen when he 10-8 his wife",
            "Still remember the police report and security audio of his kids asking security to call the police on him because he was beating up his fiance. Pretty sure his kids were far from happy about him that day.",
            "I thought he had all daughters?",
            "Am I the only one shocked that he has a son?",
            "https://preview.redd.it/n17l8pbbj18d1.jpeg?width=1200&format=pjpg&auto=webp&s=2e0e0721304e851df6363a31a4eb56a007c144e4\n\nI know who's gonna be excited to hear about this",
            "Huh, they had a split and got back together during Jones fight against Gane, looks like they split again\n\n\nBut also, 50/50 custody with this man's history 💀",
            "His wife fucked up.  Never leave it in the hands of the judges 👨🏻‍⚖️",
            "Son fearing for his life",
            "I thought he had 3 daughters. Since when does he have a son?",
            "Used to work in probation and I’ve seen guys who did similar things to Jones that would never get any form of custody and rightly so. Bros on camera only a few years ago headbutting cop cars and hitting his wife in front of his daughters this judge is smoking fent",
            "Went to a split decision with the court system also.",
            "How does a violent abuser get any custody ?",
            "Hope he doesn’t beat on him",
            "All the dads in healthy marriages with 100 percent time with their children in shambles",
            "Split decision",
            "Probably be happier with 100% …..",
            "Does the judge have CTE?",
            "I hope his kid doesn't look at him like a judge one night.",
            "Son? Doesn’t he only have 3 daughters?",
            "I've got 100% custody of my kids, making me, technically the happiest dad in the world.",
            "Jones is the kind of filth who beats his children’s mother in front of them.",
            "I thought that he only had daughters. Is this like a random kid he made while fucking around?",
            "   Another test from God 🙏 passed with flying colors 🏳️‍🌈",
            "Who is this gay guy and when will he defend the belt",
            "Oh really Jon?  That's great!\n\nRemember that time where you hit that pregnant lady with your car and ran off?  You almost made somebody the world's saddest dad that day.\n\nI hope you think about that when you go to bed at night and then poke your eyes out in your sleep.",
            "Didn't even know he had a son i thought he had like 3 daughters",
            "Is this the son that chael referenced when he said Jon had a secret and left something in Idaho?",
            "Dude found out he has another kid, dealt with the situation in private, and shared that he is taking responsibility for the child.\n\nY’all: Hatin’.",
            "He got his moving punching bag back",
            "I feel like I'd be happier with 100% custody lmao but I guess 50% spent with the kids and the other 50% coked up isn't too bad either",
            "Not the happiest son in the world I bet.",
            "Ngl that kid gonna light it up one way or another.\nHopefully Jesus is by his side.",
            "This is just god testing… his son",
            "Since when did he have a son? With Jessie?",
            "I had no idea jones had a son",
            "Next fight she will be in the octagon with that same fake ass smile and pink ass “3 piece combo” suit",
            "Good for him. As a parent whose kids mom sucks ass as a person for the most part she’s starting to try to get in their life and it’s nice to see. Good for him",
            "That’s nice he’s going to spend more time with DC now 🤣",
            "I think people know it’s a joke, it’s just not funny lol",
            "Son's gonna win every middle school argument from now on",
            "He had a son?",
            "How tf does a wife beater get shit but a jail sentence. No accountability.",
            "Every picture I've seen of JJ with his family it's always him, the wife, and like 4 daughters. When did he have a son? Someone's trolling.",
            "Jon so old he be gettin’ split decision wins over his (ex-)wife",
            "Homelander and Ryan dynamic lol",
            "Guess Cyril will start spending every second weekend at Jon’s from now on",
            "Same judge as the Reyes fight 😂",
            "Hmmmm questionable decision, to be sure. But also I’m pretty sure the happiest dads are the ones that are happily married to the mother of their children, who both share 100% of the custody 🤔",
            "Looking forward to giving him a flogging, no doubt",
            "He was granted 50/50 custody of his son",
            "So this will mean he needs more time off",
            "27-1-1",
            "First draw in his career",
            "Time for a coke party to celebrate.",
            "Hes just happy he doesnt have to pay child support. ",
            "He's happy because with 50/50 custody he doesn't have to pay child support",
            "Whichever family court Judge granted Jon Jones ANY such custody, much less 50%, should be immediately disbarred for life and tried for child abuse crimes.",
            "Sad George Michael",
            "I bet that there’s happier dads with full custody",
            "I thought he only had daughters with his ex?",
            "Another test from God passed. Yay!",
            "He needs to stay off social media.",
            "Obsessed",
            "He will now be fighting within 6 months",
            "Zaddy jones is available??\n\n![gif](giphy|6l8uTe6Gm8tK8)",
            "50/50? He mustve gotten some badass lawyers",
            "Bruh you literally posted what happened.",
            "Your honour: I hit women not children",
            "Jon by split decision",
            "I thought he only had daughters with his wife. Do we know if this son might be from another woman he cheated with?",
            "Jon is gonna force his son into the UFC lmao",
            "Used to have full custody",
            "His name is Daniel Cormier",
            "I guess this explains his “two small mansions in the same town”",
            "How many Navy Seals does it take to remove Jon Jones phone from his hands?",
            "the goat lawyer",
            "Dodging the child support that way at least where I live",
            "Another custody battle to talk about\n\n![gif](giphy|CDmT3Zxq5Va6NXFiht|downsized)",
            "Now if he would just unify the belts.",
            "I wanna know how his son beat him 50 times",
            "Good 4 you",
            "Did his wife leave him?",
            "Tailored suits, chauffeured cars, fine hotels and big cigars",
            "This is the last thing that should happen.",
            "Undefeated",
            "I've never put my hands on my partner and we spend every day with our son together. But sure jon, you're the happiest dad in the world",
            "Wasn't he just talking about how great his marriage or something was to some dude in Instagram or Twitter dms? That went south fast",
            "I need his lawyers",
            "Dude only has daughters though…",
            "Happiest? Ehh. Not happier than dads with full custody",
            "Jon Jones is the happiest dad in the world but I could give less of a shit about how Jon Jones feels. I want to know how his son feels.",
            "regular jon jones stuff happened",
            "Some rich asshole got another problem solved for themselves. Whoopdie-doo.",
            "wtf I don’t think jones has a son lmao",
            "Good for Coco jones. Cheal sonnen has 100% custody for a kid that's not even his bc his weiner doesn't work lol!",
            "Great you’re half a dad",
            "I swear he only has daughters",
            "12 o'clock elbow!",
            "Mario Yamasaki was the judge.",
            "I thought he had 2 daughters",
            "Son?",
            "That's just until his next conviction...",
            "Then there's DP, and Max",
            "Does that mean he only gets to beat his wife on weekends?",
            "the poor kid ![img](emote|t5_2qsev|8972)",
            "What is it with judges and giving favourable decisions to Jon Jones?",
            "Who did Jon or Jon lawyers payoff now?",
            "Coke fiend who drives under the influence and hits women gets custody (because he is rich)",
            "But does his new ‘partner’ get called daddy by the kids",
            "Every fucking comment thread on almost every post in this sub is pure gold. Yall are fucking hilarious. I love this community.",
            "Have a line to celebrate",
            "He's trash for sure.",
            "![gif](giphy|925d3f6OKqvQUaJbZz|downsized)\n\nThe judge in question.",
            "I have to assume he told the wife agree to this or I’m whipping your ass again.",
            "Good for him.",
            "that poor unfortunate son",
            "Judge has a short memory.",
            "Reminder: Chael Sonnen also beat his wife in a Vegas hotel and he also plead guilty to a reduced charge, just like JJ.",
            "His baby mama’s lawyer was Dominic Reyes?",
            "Don’t fuck it up, idiot.",
            "Unpopular opinion; Jon earned the decision, he clearly landed more blows",
            "New sparring partner unlocked",
            "How much you call an elite compared to you. I have multimillionaire friends, several billionaire friends. Friends in the highest branches of the military. Meanwhile you make 3-D designs you have no followers. Probably still trying to pay off your house. Willing to bet you live in an apartment. But yeah, make fun of me. 😫😂I got a domestic violence charge about 4 years ago now, maybe even five years ago. Meanwhile I've made close to $20 million since then. My wife is NOT still with me, DOES NOT fuck the shit out of me every night. My life is NOT Gucci. 😌 Telling my buddy Jeff to shush probably wasn't a good idea, it's not that hard to find you.",
            "The Dom Reyes fight judges are doing custody battles now???",
            "This man should not have custody.",
            "Imagine thinking 50% is the best case scenario fir your kid. Oh wait, he wasn’t thinking about the kid.",
            "All jokes aside I bet he is happy. Hope he’s a better dad than he was husband. Kids can change a man if they let them. For the better.",
            "Same judge as Reyes fight.",
            "Dana white paid the court judge",
            "He got 50/50 custody of his son",
            "Wait, did he finally beat some sense into this wife or ex? Or was it the gay stuff that was the last straw for her?? I'm genuinely curious. Also, is this real?",
            "Congrats on being 50% of a dad",
            "I have 50 custody of my kids. It’s not always easy to get. I’m not a Jones fan at all. Very much the opposite. But this makes me respect and like him more. It shows he’s making real efforts in his life to change and be a better man. I hope you keep it going, Mr. Jones.",
            "I never knew he had a son. Always thought he had 2 girls with the white chick who’s been with him forever.",
            "Jon Jones beats women.",
            "Did he beat the shit out of his wife yet again?",
            "Convicted Wife beater gets partial custody of children, 50/50 split. \n\nIs the headline",
            "Poor kid",
            "The other 50 goes to Reyes",
            "Funny how Everyone bashes jones like Dan white isn’t on video slapping is wife. Everyone let that go so quick.",
            "The one time a father shudnt be given fair custody. Wtf is wrong with y'all in America",
            "I don’t think his son is happy about this decision",
            "Did he have to eye poke anybody?",
            "10 out of fucking 10",
            "Never lost in the court or the octogon",
            "Nice",
            "Who the fuck would award custody to a felon cokehead? Dana must’ve paid for an All Star lawyer for Jones",
            "That was a nasty line by you",
            "This should be top comment, but i suppose nobody needs well thought out wit when there's an easy wife beater joke hanging so low, and homophobic pejoratives close at hand.",
            "Gold, well done",
            "He 10-8'ed the judge too",
            "I thought she fucks him every night?",
            "Long term girlfriend. There was never no marriage.",
            "He's rich.",
            "gun charges, pregnant run over, drunk crashing with whores, street racing, rehab, steroids (not legal you know), attacked a hooker and probably most damning, thinks Dana is a good guy",
            "Steve Mazzagatti was the judge!",
            "Favorable judging.",
            "Threatened to do it again if she didn't give him custody, obviously.",
            "Because he's P4P the undisputed whiniest champion of the world.",
            "There never was ~~no~~ marriage.  Literally.",
            "I'm guessing it's because the judge thinks a child needs both mom and dad",
            "He never married her.",
            "hes a millionaire & a sociopath. Prolly has amazing lawyers, went scorched earth, & played the victim at the same time",
            "This implies she actually won 2 of 3 rounds.",
            "As a single father to an infant child, I will forever have that security guy’s voice engrained in my head…that entire recording was just beyond shocking and disgusting…\n\nJon Jones, like almost every professional athlete, has gotten away with far too many felonies due to being rich. If it were any one of us, we would be buried 6 feet under the fucking court house.",
            "Yeah, that was rough. For the kids to go by themselves down to the casino floor and ask for help really shows how bad the abuse that was happening was. Im sure they had already seen some shit, Jones gets way to fucked up, when his fighting career is over it's gonna be really bad. His extremely long time fiance left him after that for a good while, but shes back again. She should just go to court, get an amazing alimony and never look back. Staying could cost her her life.",
            "Wasn’t he literally just saying his wife fucks the shit out of him every night in DM’s to complete randoms? Glad she finally got away from this loser.",
            "Fuck….. I haven’t heard that….",
            "Same here.. I thought he had 3 daughters only. The weirdo have a son too? You think it’s from the same woman? I kinda think it might be from another woman he cheated on his wife with",
            "Doesn't Jon have kids in at least one other relationship going back to a very young age?",
            "I'd bet my house his son's name is Jonathan Dwight Jones Jr.",
            "he doesn’t have a son, he’s on cocaine again",
            "Me too. Thought he only had daughters",
            "Just to correct you, there was never no son.",
            "Dear Adonis",
            "https://www.essentiallysports.com/ufc-mma-news-shocked-that-he-has-a-son-jon-jones-sharing-custody-battle-news-as-daniel-cormier-catches-strays-leaving-ufc-fans-confused/\n\ncool little easter egg. ur comment in an article lols",
            "“Both these fighters have gone through custody battles in the past”",
            "As an LGBTQ ally I think he deserves to be a dad just like everyone else.",
            "I thought he only had daughters to her?",
            "Well he’s gotta make sure they follow in his shoes somehow\n\nMost likely the shit filled shoes 🤷‍♂️",
            "He had the son with a different woman",
            "I though he only had daughters I wonder if this is with a different women other wise why wouldn’t he just say his children.",
            "Baby mama just be broke as fuck and strung out most of the time for the judge to offer a violent man 50% custardy.",
            "Underated comment",
            "What does this comment even mean",
            "Tbf he needs to fear for his life only half the time",
            "Can’t wait till Poatan TKOs Jon Jones in the first round for the heavyweight title. Dude needs some humbling.",
            "Hes talked previously about a 4th kid he had in highschool prior to meeting his wife/fiancé I believe this is probably that kid",
            "Yeah and all these comments slurping it up lmao, I’m pretty sure he’s trolling or some shit",
            "Money",
            "Money and/or connections. My stepdad is getting milked for child support (for his son who can visit him a month out of the year) by his emotionally abusive ex-wife because she and their son live in a really small town and she works for the court.",
            "Strickland  senior special",
            "He had 100%. He was stoked he got some extra free time.",
            "then the mom wouldnt have any? xD",
            "he had a son with his first girlfriend when he was a teen, thats why he got into mma, to support them. Probably never talked about it because he lost custody super early.",
            "I have 100% custody of my kids and am with them 24/7, so that makes me the happiest dad ever! (I have no children, they're still in my body.)",
            "then you should(or probably shouldnt) listen to Jons children calling the cops on him for beating up their mom in front of them , its fucking heartbreaking",
            "Daaanng,,,, I remember him saying something like that.. made no sense then, but now!!!🚨🚨🚨🚨🚨Uncle Chael dropping’ them nuggets!",
            "100% custody doesn’t really happen anymore unless one of the parents severely abused the kid or a parent voluntarily relinquishes their parental rights. Almost always going to be some parenting time on both ends.\n\nA parent might neglect to use their parenting time and it ends up that way but I’m just talking about what American courts will generally order.",
            "It could be worse",
            "Yeah. If this is unsupervised, the fuck are they thinking?",
            "The dude may make mistakes all the time but that doesn't mean he's a danger to his kid, i think it's a little melodramatic to say the judge should be disbarred and tried for any crime let alone child abuse crimes.. looking at Jon like he's hopeless and always going to be the worst of his actions is exactly what's wrong with the world, just because Jon has done some horrible things doesn't mean he likes that he did them, I'm sure he feels like a piece of shit for what he did to his wife and how he's fucked up parts of his career, we don't know the internal struggle he's gone through, I couldn't imagine the mistakes I would make if I were given his life, 26 years old and on top of the world. The guy is being ordered 50% visitation, that's a huge punishment if you can't see that idk what to say.",
            "Who the Fook is this guy? Stop traffic, bc I have friends who own a failing business! Not one of my friends is a millionaire, I do live in a apartment, I also take it to the max everyday watching shows while stuffing down hot 🔥 cheetos! I'm well above the bmi I should be, I did have a fiancee until she needed time to think! The only sex I have is with my hand, and tbh, it's not that great. You know how much I've made in a year? A few thousand. You want to come against me? I'm your worst nightmare made flesh. In the time it takes you to find me, I assure you I will do everything in my power to avoid a fight. And I mean everything. When you do finally catch up to me, I CANNOT WAIT, for the look of disgust on your face as I fall down quicker than a million dollar hooker. You'll realize that that's all time, you won't get back. Sure I may be hospitalized, but think of all the nurses that will scoff at my poor attempts at charm. And I damn sure don't know anyone in any branch of the military. A marine cheated with my ex. So I tend to avoid them. I have 14 followers on fb, mostly family. And one hot girl I'm sending money to ta help her sick mom. \n\n\nSo come on brother. Enter night.",
            "Maybe 50% will make Jon a better dad.",
            "50% custody would be normal custody for separated parents lol one week at moms, one week at Gaylords",
            "idk about him reforming himself bro, like i understand being optimistic and shit but stuff like this where he \"reformed\" himself already happened in the past and we were back at square one in a couple of months or a year.",
            "Jesus christ how many times can that narcisistic sociopath make you believe some utter bullshit like that. He's a trash person and forever will be one. I always like to believe people can change, but some people are so far gone. He's one of them, motherfker got 0 objective introspective.\n\nLets just hope his son is alright and not getting abused like his mom did.",
            "He's done the same thing for years. Act like a good Christian with values then be an utter dickhead. \nHe just talks nice. \nDoesn't show anything. .if you've ever seen posts from parents in these situations...it's mostly to make a comment about their ex.",
            "If you think this result is because Jon Jones is, “making real efforts in his life to change and be a better man,” and not due to the fact that he is a multi-millionaire, then I have a fucking bridge in Nee Jersey to sell you.",
            "I mean, he didn't Have to, but he probably did",
            "Another W after a pathetic poke for Bones Jones!",
            "Yeah, his ex",
            "Nah, oblique kick.",
            "Even though she should have",
            "hes a millionaire & a sociopath. Prolly has amazing lawyers, went scorched earth, & played the victim at the same time",
            "Chill out brother",
            "Calm down you fucking mark.",
            "Muh phobez",
            "It IS the top comment you speedbump",
            "![gif](giphy|VKbuFuRLeiYdW|downsized)",
            "That was a nasty line by you",
            "This is the answer.",
            "There's no way Jones thinks Dana is a good guy.",
            "he attacked a hooker?",
            "Shit, I was on the goats side... Until you said the last one.",
            "Besides she could be a terrible mother. we don’t know the circumstances. crime doesn’t only happen to good people. we have ample evidence over the years he’s a terrible person but that also means anyone  contemplating whether to have kids with him at this point has ample evidence why they shouldn’t. We don’t know if the judge is wrong here",
            "Not if the dad is violent drug addict who makes poor decisions around every corner.",
            "no child needs a jon jones in it's life",
            "Agree with almost everything you said man. \n\nI know you probably just threw it out there harmlessly, but it’s unfair to say “like almost every professional athlete”. Jones is such a significant outlier. Lots of good people in sports. \n\nAll the respect to you though for being a single father. I have an infant son and can not imagine what you’re going through. Hope you had a good Father’s Day.",
            "Jon Jones is one of the worst humans to be getting success that he has. Almost seems like a joke . Talking about god all the time - well if god is real they should clean this cunt up from our planet",
            "\"people hearing Jones beat his wife in front of his kids is punishment enough\" - Dana White, GOP spokesperson",
            "GSP would never 🐐",
            "Yeah cause you’re not rich. The fuck. You’re not him. Get in through your head.",
            "He's not even that rich I think. I mean not McGregor level rich",
            "Unfortunately it’s the other way around. Women are most likely to be murdered by their abusive partner when they leave or are planning to leave the relationship. If they do manage to leave they often use the courts to continue to harass them. I work in the field and have seen it so many times, the shittest dads who couldn’t give a fuck about their kids will take the mum to court for custody, just to continue to fuck with her. Sometimes the woman will go back just so she doesn’t have to leave her kids alone with him. Abusers are obsessed with control and when they feel like that control is slipping away that’s when they are most dangerous. I hate to say this but until our systems can actually keep ppl safe when they leave abusive relationships, sometimes the safest option for them is to stay in the relationship.",
            "Article with summary what happened\nhttps://www.mmaweekly.com/news/jon-jones-felony-arrest-details-daughter-asked-for-police-to-be-called-after-jones-allegedly-assaulted-fiance\n\nSecurity 911 call recording \nhttps://youtu.be/dJgwukbD5p0?si=chPgE3-XNjdPu5hN\n\nJon Jones getting arrested\nhttps://youtu.be/j5cPAucms5c?si=07OYjnH3vxO606hA\n\nIt was terrible to read through and listen to. I really hope she stays away from him for good, even after getting beaten up by him in front of his kids, she was still trying to protect him. Got so bad that his daughter asks security to call the police to help her mom.",
            "He had a son as a teenager and all of the rest of his kids are with the same woman",
            "Dude none of that shit matters if you're a good dad to your kids, as someone admittedly a little biased towards a dad after losing 3 months w my 9 year old bc his mom who has been, what I thought a legit good person and someone I had really grown to appreciate as a friend not just a co-parent - started dating some insecure asshole w jealousy issues, and out of nowhere she tried to cut all contact and accuse me of literally everything, every parent should be able to see their children AS LONG AS YOU ARENT BEATING THEIR MOM OR THEM. Something you have to take into consideration w Jones no doubt about that, but if he's actually being a good dad and not doing the obviously wrong and dumb hurtful shit that will affect his children- he should be able to be w his kiddo. Lmao damn Jones makes it very particular to defend him seeing his kids but he brought the doubt and mistrust on his own self",
            "You are retarded 😂💀",
            "😂😂😂😂😂",
            "Lmao remember on the episode of JRE when they talk about it and he says along the lines of \"I have all girls but I believe God will give me a son when I'm ready\".",
            "![gif](giphy|wSCAy1zJbcUG4|downsized)",
            "What does that have to do with literally fucking anything?",
            "I'm an lgbtq person and I think he deserves to be a dad when he can go multiple years without a scandal... So I hope he has good luck with God's tests!",
            "What on earth does you being a LGBTQ ally have to do with this ???🤣🤣 tf",
            "😂😂😂",
            "What a good comment - now we can confirm every prof that asks what this has to do with anything is a certified casual 😂😂😂",
            "That means a lot to Jon",
            "It's a joke about how fighters should make sure they win by KOing their opponent rather than going to scorecards. The joke is in how those who decide fights and those who decide custody battles are both called 'judges'.",
            "Even if they did fight this would literally never happen lol",
            "Poatan kos jones becomes the GOAT no questions asked",
            "Math barely adds up, he 36 rn even if the kid is at most 17 he had to have been around 19 give or take when that kid was born, kid in high school? Brotha must’ve got his girl pregnant either prom night or day of graduation",
            "What a twist!!",
            "Ah, okay. I know he got into MMA to make money for his child (ala Wilder), but I figured it was for his eldest daughter. His eldest son is almost a grown man. Wild to just now get half custody",
            "They only ever live a couple of months, it's a shame and I send my condolences",
            "Way to ruin my joke",
            "No one but Jon, his (ex?)fiancé, and the court system will know the truth if it is supervised or not due to family court cases with minors being sealed. \n\nIf there is a God out there, I hope it is AT LEAST supervised visitation…smdh…\n\nI think they were thinking: $$$$$",
            "“The dude may make mistakes all the time but that doesn’t mean he’s a danger to his kid…”\n\nOne Google search of Jon’s rap sheet will say otherwise. Jon Jones is a danger to his son, himself and society. He should have been in federal prison years ago. \n\nStop justifying and simping for evil criminals who deserve nothing but prison and/or worse. It’s disgusting behavior on your part. Especially when you speak like you personally know how Jon feels, lol. It’s just pathetic. Just stop.",
            "Come on. Let’s be realistic here…\n\nThis is Jon Jones we are talking about.\n\nThat shit ain’t ever gonna happen.",
            "damn. He really didnt have to. He could have beaten anyone to a pulp without it, but he still did. underrated joke.",
            "You’re a bad girl",
            "You're a fucking domestic abuser dude",
            "You’re a fucking punk, dude.",
            "Jones thinks Jones is a good guy… which kind of makes everyone a good guy in his eyes. Maybe except Hitler or Stalin.",
            "Let me rephrase what I originally stated then:\n\n“Like almost every other professional athlete that has a history of being a POS.”\n\nThank you! From one father to another, never give up on your child and always fight for them. When they get older and understand, they will love you even more for being a good man and father to them. Family and survivability are the only two things that matter at the end of the day. \n\nMe and my kiddo will be just fine. :)",
            "Maybe not necessarily sports in general - but sadly in the combat sports world, I don’t think Jones is actually a huge outlier compared to most other athletes in his field\n\nBoxing & MMA has so many domestic abusers - if you’re comfortable having a career of violence it’s not that surprising that it can bleed over into personal life",
            "Idk man Mike Tyson in the 80s 90s was something else too lol",
            "Go listen to Alec Baldwins lib ass talk to his daughter, dumbass",
            "Literally what I just said. \n\nThat you for regurgitating what I said and then adding a random and unnecessary twist. Very helpful!",
            "There are different levels or rich. \n\nJon Jones is multi-millionaire rich (8-12 million-ish). \n\nConor McGregor is Jeff Bezos rich and has $500+ million in the bank.",
            "If that was true, wouldn’t his son be an adult now?",
            "Really? Is this true?",
            "Source? I remember on the Joe Rogan podcast ages ago he said he didn't have a son, and he was praying to have one or something,",
            "Let’s say he had a son at 18. That would make the son 18 years old because Jon is 36. Then what custody is there to speak of? Jon’s off his rocker",
            "Yeah I remember that, that’s why I’m shocked.",
            "Yeah and he was talking about getting his sperm washed so he could have a boy one day lol",
            "The rumors that Jon is gay",
            "It was a joke spaz",
            "such mad boy",
            "Lol ally. I’m going to start calling people who don’t agree with me enemies🙄",
            "What is up with all these people replying to an obvious joke? Are you people fucking stupid?",
            "It is irrelevant here. The thing is Jon's criminal history.",
            "You missing some lore brother",
            "[deleted]",
            "oh maybe im mistaken maybe it was his daughter that got him into mma then. how fucking young was he when he got his son then? Oo",
            "Don’t worry bro I stopped reading his comment as soon as I realized he was going aCtuAlLy",
            "Tell another Christopher Walken story, about the jackals, the pregnant lady, and the lions.",
            "Makes total sense. \n\nI should clarify, I didn’t mean for that to sound so depressing with “I can’t imagine what you’re going through”, I just meant it must be a lot and can’t imagine doing it without my wife lol!\n\nSounds like you’re doing great dude. Glad to hear.",
            "There could definitely be more in these sports than others, but it’s still such a massive outlier.\n\nI just went to the ufc website and looked at the top 15 in each division. I don’t think I’ve heard of one other fighter in those lists that has had any form of legal controversy. Obviously that isn’t fact checked, but if there is one or two at most that I’m not aware of, they’d still fall in to the category with Jones as being major outliers.",
            "The fuck does that have to do with anything? And why the politics?",
            "Just get rich and stop complaining",
            "I just mean that maybe his richness isn't the case, because much more rich dudes get imprisoned",
            "He could be like 17",
            "Jon just got custody of his 22 year old son. Hes gonna force him to play teeball & teach him how to ride a bike with training wheels",
            "His son is Dana white with how bad Dana has been sucking Jon off in interviews.",
            "yes thats why he got into fighting, to support them.",
            "Yes, it was briefly mentioned on the recent Roku series they put out",
            "A rumor requires approval from the gay community now",
            "Bi, so is conor. If you haven’t seen the yacht pics….yeah.",
            "Were you not already?",
            "well.... yes, yeah",
            "Lore ?? Tf is this world of War craft 🤣🤣",
            "Jon subs him in 1 lol",
            "Jon could show up at 205lbs and still submit Pereira easily, I don't like the guy but we're talking about one of the most dangerous grapplers ever in MMA vs. a kickboxer.",
            "God damn you Poatards are exhausting. I promise you that we can have a post where you don’t bring him up and everything will still be alright.",
            "Buddy…",
            "Jones would kimura him and ignore the tap n just break his arm to prove a point",
            "I actually didn’t use that word 🤓",
            "Glad I could rephrase and make things make sense. \n\nIt’s all good. I did not take it personally and I sure as hell would not get upset over something someone said to me on Reddit of all places, lol. Not directing that comment specifically at you either.\n\nI’m doing my best and at the end of the day, that’s all you can do, brother. :)",
            "Your troll attempts are weak and pathetic. \n\nGet a job and a life, kid.",
            "The fuck sorta shenanigans go in your family gatherings",
            "🤨",
            "No, he got into fighting so people wouldn't suspect he's gay",
            "Well, I knew about the daughters but not the son",
            "Support his coke addiction you mean",
            "This all but proves it now",
            "I feel like you were drooling when you posted this",
            "Goddamn you're smart.",
            "Already what?",
            "Maybe it’ll make sense if you add more emojis",
            "🤣🤣",
            "100%. Ya guys thought Gane looked bad against Jones? Jon would be whispering a sweet “chama” into Poatan’s ear",
            "[deleted]",
            "What the fuck is this, the Father Channel?",
            "Keep complaining without change.",
            "Or what if he had kids so people wouldn’t suspect he’s gay but he didn’t think it thru all the way THEN in turn got into fighting to support them? 🤔🤔",
            "Turns out that’s the only thing he supported yeah xD",
            "Having 50/50 custody confirms he’s gay? How does that make sense",
            "yes",
            "English motherfucker, do you speak it",
            "Ok how many 🙄 😳 😐 🤔",
            "none of that equates to alex beating jones .",
            "stop getting so emotional bro",
            "You didn't catch his injury then i suppose? My money is on you just willfully ignoring it",
            "u/RazorThought can’t even count to foive. My kid can though.",
            "Your post history suggests that you’re 5’2” fat, and have a small dick, all of which are self-admitted. \n\nYet I’M the one who is complaining?! 💀",
            "Jesus you’re slow.",
            "Holy shit Tito, you can just say it’s you.",
            "The approval from the gay community duhhhhhh",
            "it's a joke dummy",
            "such dumb boy",
            "It's a joke about the rumour that Jon is gay. The 'ally' part was just a jab at Jon being gay.",
            "Yes, you’re complaining. Rich people can beat their wives you can’t. It’ll stay that way.",
            "[the gay community?](https://youtu.be/EpZCKnha464?si=75LNZXgg-u-LqQXq)",
            "Who cares if he is gay in a conversation about him getting custody of his child?? See why it's confusing??",
            "Sad and pathetic, get a job and get help.",
            "Well, you did not deny that my previous comment was false in any regard. \n\nYou are 100% a Reddit Moderator and proud. \n\nCongrats, I guess?…good luck with that and have a nice evening. Or morning.",
            "I was hoping for strickland pic, dissapointed",
            "It's funny because the original comment seems superficially supportive of Jon, but Jon himself would hate it because it implies the rumours that he is gay are true. It's not directly relevant to the custody thing, it just used it as an excuse to make the joke.",
            "You’re on r/ufc buddy"
        ]
    }
}