{
    "Upcoming AMA with Yuan Fung and Matt Ford from the UAP Disclosure Fund, on Saturday, June 22 at 1:00PM PST": {
        "title": "Upcoming AMA with Yuan Fung and Matt Ford from the UAP Disclosure Fund, on Saturday, June 22 at 1:00PM PST",
        "score": 87,
        "url": "https://www.reddit.com/r/UFOs/comments/1diw6nd/upcoming_ama_with_yuan_fung_and_matt_ford_from/",
        "content": "Hello Everyone!\n\nr/UFOs will be hosting an AMA with Yuan Fung and Matt Ford from the UAP Disclosure Fund, on **Saturday June 22 at 1:00pm PST** ([Click here for your local timezone](https://www.timeanddate.com/worldclock/fixedtime.html?msg=r%2FUFOs+-+AMA+with+the+UAP+Disclosure+Fund&iso=20240622T13&p1=137))\n\n[The UAP Disclosure Fund](https://www.uapdisclosurefund.org/) is a nonpartisan political nonprofit 501(c)(4) that advocates for greater government transparency regarding unidentified anomalous phenomena (UAP). They work to support new UAP legislation, provide legal representation for whistleblowers, promote scientific research and raise public awareness in an effort to better address the UAP issue.\n\nTheir team includes:\n\n- Luis Elizondo (Board of Directors)\n- Garry Nolan (Board of Directors)\n- Karl E. Nell (Board of Directors)\n- Christopher K. Mellon (Advisory Board)\n- Kirk McConnell (Advisory Board)\n- Yuan Fung (Executive Director)\n- Matthew Ford (Director of Strategy)\n- Lesley Duckworth (Chief Financial Officer)\n\nThe UAP Disclosure Fund is [currently petitioning](https://www.uapdisclosurefund.org/#petition) for UAP legislation to be included in the 2025 NDAA.  Now is the time to let the U.S. Senators who cosponsored the UAP Disclosure Act of 2024 know that you support including a new version of the UAP amendment in the 2025 National Defense Authorization Act (NDAA)!  You can sign the petition [here](https://www.uapdisclosurefund.org/#petition) to let lawmakers know that UAP transparency and legislation is important to you.\n\nYuan Fung has worked for over 20 years as a creative director and consultant for campaign politics and issue advocacy. He has worked on behalf of congressional, gubernatorial, senate and presidential campaigns.  Highlights include the late Senator Harry Reid, and both of Obama's presidential campaigns.  He has also done work for causes like consumer safety, the environment and clean energy.  Leveraging his political expertise and talent, he is now the executive director for the UAP Disclosure Fund.\n\nMatt Ford is an Emmy-winning political consultant, media personality, and producer based in Los Angeles. He is a trusted advisor to leading congressional representatives and their staffers on the UAP issue.  Matt has spearheaded numerous successful projects as a producer, including creating over 100 political ads for social media platforms which have been viewed by millions.  His production prowess extends to hosting The Good Trouble Show, where he engages in thought-provoking discussions with influential figures such as Senator Kirsten Gillibrand and other prominent political figures.  He is now the Director of Strategy for the UAP Disclosure Fund.\n\n---\n\nWe're thrilled to have Yuan and Matt participate in this AMA with the community, and we know that everyone is sure to have lots of questions! If you're unable to attend, but would still like to ask questions, feel free to share them below and we'll do our best to facilitate them on your behalf.\n\nIf you have any feedback or thoughts on other guests you'd like to see, message us directly here or let us know in the comments below.",
        "num_comments": 38,
        "comments": [
            "Just a friendly reminder to everyone that during the AMA, the mod team will be actively removing any questions that are inflammatory, overly accusatory or otherwise uncivil (no different than any other AMA that we have conducted in the past). With that being said, we absolutely want to be permissive in letting the community ask whatever questions they might have - even if they are hard questions. We just want to ensure that the questions are asked respectfully and with kindness towards guests that have given their time to engage with the community.\n\nAlso, please post your questions as top-level comments, not as replies to this sticky. We will not collect any questions that are posted as replies to this stickied comment. Thank you!",
            "**QUESTION**\n\nIf what Grusch has said is true, and If multiple, high level whistleblowers have already provided evidence to congressional staff, who are now well aware of things behind the scenes that the public is not privy to, how realistic can “public pressure”  be at this point? If the UAPDA can be blocked by just a handful of people, presumably under the influence of the “gatekeepers”, what inside deals can be made to persuade them to disclose? Every strategy thus far essentially boils down to pleading with them. What can organizations like yours offer the “gatekeepers” that would be enticing for them to give up their secrets?",
            "Shout out to y'all, I think the mods do a great job (for free!) to keep the sub moving. Thanks for doing the work so we can have interesting conversations.",
            "Guys, I probably won't be available when this happens, so someone please press Matt Ford on his \"OGA are conducting retrievals\" story. While I believe there are crash retrievals, I don't see how or why he and the guy at Liberation Times would be privy to this information. \n\nThey drop this bombshell, we talk about it for a week, then it just goes away and nobody questions him on his sources and nobody presses for more info. Everyone talks about Coulthart and mocks his continual \"I can't divulge my sources\" spiel, but this was one of the biggest things ever dropped in this community and nobody even questions it.",
            "[removed]",
            "I donate $2k a year, what exactly would my money go towards if I made that donation to you?",
            "How can I watch live?",
            "Was this AMA requested by the community or this team?",
            "There have been public disclosure efforts in the US for the better part of a century. Is there any actionable information collected by the UAPDF –no need to share in this moment, I’m patient– that makes the board of UAPDF think that this push will return different results?\n\nAdditionally, due to the lack of progress over the previous 50-60yrs, many who bear an interest in this topic have become jaded by public disclosure efforts such as yours. Are there any avenues of disclosure an individual could pursue (that don’t involve donating money or disclosing my identity) that might result in more salient, personal disclosure? I.e. is the UAPDF aware of any practices or protocols that could result in contact experiences and/or increase an individual’s metaphysical understanding of the phenomena? Or is the UAPDF aware of any widely/freely available resources that could shed light on these mysteries?",
            "Don't give the demons your money",
            "**Question for Matt Ford**\n\nIf you had an opportunity to communicate with one of these NHI tonight, in person and up close, would you? Why or why not?",
            "How was Congressional oversight unconstitutionally cut out of a significant part of the American government for so many years?",
            "Great question. Please make sure that this is asked in the actual AMA as none of the tough questions ever get posted in the main thread.",
            "Exactly.  Still waiting on the catastrophic disclosure we've been  hearing about from all this evidence that apparently exists 🙄 ",
            "[removed]",
            "I’ve donated $100, and like the commenter above can match a similar monthly amount. The difference here is I have already given money to your cause because I trust each and everyone of you associated with it.",
            "You will get a signed copy of Lue's book",
            "The AMA thread will go live this Saturday, June 22 at 1pm (PST) and will be stickied at the top of the subreddit (where this current post resides).  Q&A will be text-only, in traditional AMA format.",
            "The mod team reached out to them in invitation to answer community questions.",
            "👍. Let’s hope so",
            "[removed]",
            "This isn’t an answer to their question lol",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "We're Looking For Moderators": {
        "title": "We're Looking For Moderators",
        "score": 55,
        "url": "https://www.reddit.com/r/UFOs/comments/1dhlfck/were_looking_for_moderators/",
        "content": "Hey everyone, we're looking for new moderators for r/UFOs. [Lack of moderators is still one of the biggest issues facing the subreddit.](https://www.youtube.com/watch?v=VxlIcsWHZHI) No previous moderation experience is necessary. Patience and an ability to communicate are the most important skills to have. \n\nWe have two levels of moderators: **Full Moderators** and **Comment Moderators**. Comment Moderators only act on comments and have less responsibility overall, but are still able to apply to be Full Moderators at any time. \n\nWe're accepting applications for both. You can apply and see the details for each via the links below. If you want an even more granular overview of what moderation entails, you can look through our [Moderation Guide](https://www.reddit.com/r/UFOs/wiki/moderationguide). If you'd like to see an example of what working through the modqueue looks like, you can [watch this walkthrough video.](https://www.youtube.com/watch?v=UHkzORqmeHw) \n\n&nbsp;\n\n\n#[Apply Now](https://www.ufos.wiki/apply/)\n\n\n&nbsp;",
        "num_comments": 79,
        "comments": [
            "It appears that there are 60+ moderators already for this sub (based on the ticker). Are most of them dormant?",
            "I work for the USAF, is that ok or do you have too many of us already? Asking for a friend. Actually the guy in the cube next to me 😂",
            "I'm a current moderator of numerous different subreddits I am more than happy to help",
            "How much does this pay?  My hourly rate is $78 per hour and what are the 401k and medical benefits?",
            "Be careful. Reddit is full of political partisans. I'd hate to see this sub ruined.",
            "Applied.",
            "Here here here",
            "Does it matter if even when multiple people flag a misleading post for violating multiple rules no one moderates it? [https://www.reddit.com/r/UFOs/comments/1dixkui/comment/l97tur8/](https://www.reddit.com/r/UFOs/comments/1dixkui/comment/l97tur8/)\n\nLike, what is the purpose of moderation if it isn't to cut down on disinformation?",
            "How much does it pay?",
            "How many moderators are you looking for in each case?",
            "Are video interviews still required?",
            "are those bots generative AI?  \nI think that chat GPT could do a good job moderating with little help, but I'm aware there's no income",
            "Forgive me but - your application process appears to require the applicant to join your [Mod Discord](https://discord.gg/kJcvZXEbcD), apparently because you keep mod in-communication off-site for whatever reason, therefore requiring the person applying to set up a Discord account.\n\nWhat actual steps have you and your team taken to establish that the r/UFOs sub member the application process requires said application submission form link to and the person actually *writing and submitting* the application concerning that r/UFO's member are, in point of fact, actually the same individual....?\n\nSurely, anyone can set up a Discord account - claim to be u/so-and-so from *here* and submit an application to you making that actual sub member appear a total sociopath: there is literally no way you can establish the person submitting the application via Discord is actually the r/UFOs sub member they claim to be. \n\nThey could literally be anyone inclined to throw shade on anyone here they simply just don't like and don't wish to see granted admin privileges at any point, or else instil a bias against on the moderation team's watch list. \n\nAre all your security arrangements this well thought through, or are there any funnier ones you're keeping for later...?",
            "Appreciate the hard work you all do. ",
            "I'd be a terrible mod because I'd be deleting every dumbass starlink post and still frames of white dots and get all the bozos all pissed off.",
            "no",
            "The are currently 68 moderators for r/UFOs. 9 are bots. 11 are inactive (we do quarterly check-ins and then demod inactive mods on that schedule if they don't respond). [6 mods perform 50% of significant actions](https://docs.google.com/spreadsheets/d/1H--XIuPwkBKad8hBTrn3oh4KFny6NJA0jXssB1IQ-Jw/edit?gid=1990006949#gid=1990006949) in terms of moderating posts, comments and the modqueue, posts. Another 21 mods perform the next 45% of significant actions. I'd say there are about 28 active mods currently. \n\nIt's important to keep in mind many moderation tasks extend past the modqueue and there are many aspects which can't be tracked, such as efforts developing or maintaining our bots, responding to modmail, organizing AMAs, interviewing and training new mods, running monthly mod meetings, and maintaining [the subreddit wiki](https://ufos.wiki/).\n\nThere is significant variance in terms of how much each mod contributes and in what area. All this is relative though to how much work there is to actually do as well. I could spell this out with metrics if you're interested.\n\nIn my experience most people only mod for 3-12 months and then fade out. This aspect combined with the explosive growth of the community over the last year pretty much necessitates we issue calls for new mods every 3-4 months or so, just to try and keep up. Unfortunately, the subreddit has been undermoderated for a couple years now along with the the expected growing pains, so getting it up to a sustainable point has been difficult.",
            "Each dormant mod is a ticking time-bomb.",
            "I am former USMC, and I bully out any of your well-groomed kind before they can become mods",
            "If you're currently stationed at Eglin make sure you mention it in your application so we can get you onboarded immediately!",
            "Great, you should follow the link to apply.",
            "It pays 0 USD / hour.",
            "You can choose between no dollars a month, or zero dollars per hour.",
            "It pays in power boners. Every time you remove a post or ban someone you get a raging hard on.",
            "> How much does it pay?\n\n~~The CIA pays us GS-15 market/COLA adjusted by where we live as remote employees.~~ \n\n[I mean nevermind, nothing to see here.](https://www.youtube.com/watch?v=NuAKnbIr6TE)",
            "We don't have a specific goal in mind. In the past, we've accepted all good candidates who apply. There usually aren't so many applicants it warrants us turning people away solely on that amount.",
            "We've never required video interviews, but we do require an audio interview.",
            "We do not currently have a form of pre-verification in place. Although, I've yet to come across an instance where an application was redundant, came across as sociopathic (or some other extreme negative) to the extent we treated the user differently on the subreddit as a result. We could still easily add this form of verification to our process to prevent this from happening and will do so as a result. Thank you for the suggestion.",
            "Thank you, much appreciated.",
            "The white dot pics are debatable, but starlink posts in good faith from sincerely perplexed newbies are understandable. I'd rather be helpful to them, than act as a gatekeeper. Respect could translate into a new, productive member of the sub. Also, it takes less than a second to scroll past those posts.",
            "I think it’s totally unreasonable to assume or expect the average person to accurately research what they see before coming to a place like this. Most won’t even know where to start, and even if they found ten videos by others here or on YouTube… they still won’t look right to our new witness, who saw it with stereoscopic vision and in real time. No recording ever looks the same. \n\nThere’s no reason to freak out over the maybe several we get a day. \n\nAnything that eradicates stigma and gets people talking, sharing and looking up is objectively good. Gatekeeping on this topic and subject matter is diabolical. Anyone doing it is a problem.",
            "lmao damn.",
            "Sounds like you’d be a great mod",
            "The whole mod thing is just too subjective. Most of the time they seem to just be seen to do something whenever complaints are registered rather than loot at the context. I understand that it’s voluntary and they get tons of complaints but this results in a lack of impartiality as only certain personalities complain.",
            "k",
            "28 active mods and you have problems?\n\nI've been modding various subs for 10+ years (have other accounts to keep separation) and that seems like a moderator organization issue.",
            "If it's such an expansive sub with such high needs someone needs to consider paying people. Don't ask me how, I know its not an easy thing to suggest, but the moderation of 2 million people is not a task volunteers can realistically achieve. I'd like to help, Im sure many would, but we have day jobs and this is a hobby. UAP related industries are quickly becoming a real thing and this sub is forefront of the discussion...in any case, I appreciate the sacrifice you guys/girls make but boy howdy that's a task.",
            "What about inactive legacy mods?",
            "And I wonder how much reddit makes per quarter?? Bs they don't pay moderators, yay capitalism!",
            "Well. I don't get out bed for anything less $45 an hour. Go to know. Hard pass",
            "Thanks for clarifying! I'm probably across the world from everybody, so synchronous comms would be hard to work with",
            "Happy to help.",
            "go and google \"trail of lights moving across the sky?\" and then say that again. The most basic search entry and you would have all the answers you need so you're 100% wrong but you do you.",
            "Sounds like the average mod.",
            "Context is important but so is tone. If I'm a dick to you, you have no license to be a dick in return.",
            "With more mods, we could have more resources to moderate beyond the mod queue. We still do that.",
            "What are those other communities like? What levels of toxicity and controversy do they endure? Ufology is a very controversial subject in many dimensions. There is also a great deal of anger as a result of the coverup and stigma, some of which is reflected towards moderators. \n\nHow large are the communities you moderate and how many active mods do you have for them? How long do they stay active regularly? \n\nHow often do your subreddit rules change? How often and to what length do you have to deliberate such changes internally and externally? We have a very lengthy and thorough process, on both ends.\n\nDo you use a flat structure where all mods have an equal say in votes? Or does just one or a handful of people direct things? Reddit is inherently hierarchical, which is an arguably more efficient and faster organizational model, it just has a number of cons we prefer to avoid.",
            "Hey, thanks for the appreciation! It's nice to get good feedback as well as criticism. \n\n> someone needs to consider paying people\n\nI'm pretty sure that's explicitly against the Reddit rules. \n\nMost of the mods have day jobs and there's no minimum for participation other than checking in every few months, I guess. \n\nIf you'd like to help, don't let the volume of moderating duties deter you! It's a team effort, not a competition. Heck, if you just wanted to do comment moderation and limit your activities to approving comments (the ones that don't break any rules), that would be welcome. \n\nAnd if you have any questions, feel free to reach out here or directly. I've been a Full Moderator since January.",
            "No one as a mod is expected to sit and \"watch\" queues, you do it as you have time and energy. Even like 15 minutes a day times a hundred people is a huge boost. Some days I do lots, others none at all.",
            "peer to peer money like BitcoinCash and Monero could easily solve that.",
            "What about them? We have a flat structure, so all moderators are treated the same. No mods above me in terms of seniority are currently inactive. I've been moderating here since 2021.",
            "mods shouldn't get paid at all they just ban anyone who shows a slight different opinion",
            "It’s perfect for you then, because you can do it in bed for free",
            "Not a problem. We have mods all over the globe, so I don't think anyone is entirely alone at any given moment. I'm awake right now, for example.",
            "Google returns different results to everyone. Not a good argument.",
            "You also run the risk of intel com agencies infiltrating you.",
            "mostly crypto subs which are always under relentless attacks from scammers and spammers.\n\nThe mod policy of the subs I manage can be distilled into:\n\n1.) Never censor based on ideology or feelings\n\n2.) Remove trash (spammer/scammers)\n\n3.) Defuse conflicts between the users (1 warn to attempt changing the attitude of the offender, 2 time temp ban (or if they won't change their comment),  re-offenders get a permaban. Strive to keep bans to a minimum, while protecting civilized exchange of ideas.\n\n4.) Prevent the sub and mod team to fall victim to business or political interests.\n\nIf most or all moderators abide these basic rules and you have good time zone coverage then it shouldn't be hard to keep the sub tidy and clean.\n\nIf you want I can help  (GMT timezone), but I will only operate based on the above 4 rules.",
            "No most of the anger is caused directly by the mod team, they're censor happy and pretend to be transparent when they're not. They ban posts about alien life in a freaking UFO sub. Ridiculous.",
            "stop lying, you guys just ban anyone who shows a slightly different opinion than yours. And the mods in this sub are 100% compromised and get paid to do so",
            "Applied !",
            "It might be an incentive for some that's certain. Again, it's not an easy thing to suggest. The mods are not, probably, reddit 'employees'. Unless there is a patron or benefactor I suspect it's a lost cause but really, it's crazy this sub is so large with unpaid help at all. If nothing else it proves the community is dedicated and passionate and they are big pluses.",
            "How about letting AI do the moderation and letting mods do verification of the moderation. Automate the work. Could do it myself. Without enough consistent feedback of users/mods the AI can auto adjust as needed until no more manual intervention is needed.",
            "😆 oh I laughed out loud.\nCaught me off guard.",
            "Can confirm. In bed at this very moment.",
            "I believe in Freedom, but not working for free. Thanks for the offer though, I currently have employment and fine with that.",
            "If a state actor wants to infiltrate the mod team, they're already in there.  There are instances of them placing three assets in groups as few as seven if you read up on counter-terror ops.  Us recruiting more mods doesn't increase the risk at this point.\n\nEven so, we're a decentralized team with public logs and internal channels for raising and settling disputes when we identify inappropriate moderation.  It's not a hierarchical system where anyone is above reproach.",
            "Not true. I certainly haven't been paid. It's explicitly against reddit's rules. How would we be compromised? To what end? There are many diverse viewpoints and opinions on the mod-team, so if there's an attempt at compromise, they aren't doing a very good job. \n\nBanned accounts can appeal to the whole mod team for review. Our bans are not based on the opinions of the banned user, they are according to our stated rules and the reddit content policy.",
            "Actually it's very easy. The code is there for a BitcoinCash tipping bot so mod payments could be automated from a pool, based on mod activity.",
            "[We do currently use AI to moderate hate speech.](https://moderatehatespeech.com/) Reddit also implemented their own version of this recently, natively. I'm unaware of any other such pre-trained tools which could be easily applied to Reddit which also wouldn't cost us money to host and implement.",
            "No (pseudo)AI is good enough for such tasks.",
            "I never said they'd be doing a bad job as a moderator.  Just that they could be there, which is a problem in of itself.\n\n\nIn fact logic for spying would dictate you would want to do a good job to keep your cover.",
            "yeah lets trust the police to investigate themselves that makes 100% sense",
            "Sounds interesting? Who provides the pool though? The cash gotta come from somewhere doesn't it?",
            "The community.\n\npeer to peer money like this enable permissionless, low cost micropayments without going through any institution.",
            "you want the mods to get paid? you realize they are compromised and already get paid?",
            "It's true, Jeremy Corbell gives us each an Arbys gift card each month to remove anything mean anyone says about him.",
            "I guess most 100K+ subs get compromised. The real solution will be a completely new platform. Then these centralized and censored shitholes will be just a bad memory."
        ]
    },
    "Mystery sonic boom traveling at 400 miles per second rattles Mediterranean resorts": {
        "title": "Mystery sonic boom traveling at 400 miles per second rattles Mediterranean resorts",
        "score": 612,
        "url": "https://insiderpaper.com/mystery-sonic-boom-rattles-mediterranean-resorts/",
        "content": "",
        "num_comments": 176,
        "comments": [
            "\n\n\nThe following submission statement was provided by /u/Yoyoyoyoy0yoy0:\n\n---\n\nThe region’s Geophysics Institute and the University of Florence said in a joint statement that whatever caused the boom was traveling at 400 miles per second.\n\nIt is not the first time mysterious sonic booms have been registered on Elba, the Corriere della Sera said. Similar events in 2012, 2016 and 2023 have yet to be explained, it said.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/UFOs/comments/1dlfbj9/mystery_sonic_boom_traveling_at_400_miles_per/l9oerdt/",
            "I've just read the news in the original language from [https://www.iltirreno.it/piombino/cronaca/2024/06/21/news/boato-sulla-costa-l-ipotesi-bolide-i-dati-e-le-prima-analisi-su-cosa-ha-spaventato-mezza-toscana-1.100542099](https://www.iltirreno.it/piombino/cronaca/2024/06/21/news/boato-sulla-costa-l-ipotesi-bolide-i-dati-e-le-prima-analisi-su-cosa-ha-spaventato-mezza-toscana-1.100542099) , an italian newspaper and I noticed an error of translation in the post that OP linked. The speed of the object is said to have reached a 400 meters/second ( around 0,25 miles/second ) , which is way slower than 400 miles/second.\n\nNow, I don't know if it's a coincidence but also the new experimental Lockheed Martin X-59 supersonic aircraft is expected to fly at 925 miles/hour which is around 0,25 miles/second.",
            "[deleted]",
            "The region’s Geophysics Institute and the University of Florence said in a joint statement that whatever caused the boom was traveling at 400 miles per second.\n\nIt is not the first time mysterious sonic booms have been registered on Elba, the Corriere della Sera said. Similar events in 2012, 2016 and 2023 have yet to be explained, it said.",
            "wait what? I bet it was written as 400 m/s (meters/sec) but the author thought it meant 400 miles per second.  The speed of sound is 343 m/s which could produce a sonic boom.",
            "Why would Italian geophysicists use imperial measurements? And wouldn’t a sonic boom travel at um… the speed of sound? Stay in school, kids",
            "1,440,000 MPH?",
            "This is the funniest UFO I've ever seen. Mixing up meters and miles is so hilariously obvious, with just the right amount of blind US bias - it's chef's kiss perfection.",
            "At a litteral million MPH, if it interacted with air at all it would cause alot more devastation than a sound wave.",
            "I'll copy my comment from somewhere else in this thread for everyone to see. Especially for those who thinks it's just a random meteor.   \n\n\n650000 m/s is really a lot for a meteor. Asteroid's speed would generally be in 10s of kilometres per second, not in hundreds. 650000 m/s is also around 2% of speed of light.   \n\n\nIf their calculations are right the object's velocity is more than galactic escape velocity and the objects they detect could be extragalactic in origin. It would make this detection the first of it's kind.   \n\n\nUFO or not it's either a false detection or not a prosaic object.\n\n\nEdit: apparently it's a translation error and the speed was 400 meters per second not 400 miles per second ",
            "Really fascinating situation and link O.P. Great catch. Also, loving the back and forth conversations and educational posts in the comments. Sometimes, I lose hope in this subject and sub. But posts like this remind me it's about curiosity, wonder, and truth. Whatever the truth is",
            "Title of this post is misleading and objectively wrong. The sonic boom itself cannot travel at 400 miles per second, that is impossible. The speed of sound in air is about 0.2 miles per second, which is 767 miles per hour. Sonic booms travel at or close to the speed of sound, not 400 miles per second. It is the *cause* of said sonic boom that was traveling an alleged 400 miles per second.",
            "UFO’s don’t create sonic booms.",
            "This particular thread exemplifies what's wrong with this sub. Someone posts an interesting article and people suggest maybe it's a typo, then immediately people who know nothing more than the rest of us start saying \"it's not a typo\" and provide all sorts of bullshit justification without any real vetting at all. So the idea starts to run until it actually turns out it was in fact a typo and everyone who confidently said it wasn't just disappears. This makes this entire sub seem like a circle jerk and a waste of time. Do better.",
            "So, 400 miles per second is equivalent to 1,440,000 miles per hour or 643.736 kilometers per second. What in this universe can go that fast?",
            "Last year there were random, insanely loud booms heard and felt around my state. There is still\nno word about them from anyone despite pushes for answers",
            "Sonic boom is not like usual UFO. May indicate a new record speed meteorite. Fastest officially recorded meteorite is 160000 mph (per _hour_). Seems like a stretch to break the record by orders of magnitude though",
            "An UAP that forgot to silence the sonic boom.",
            "If it’s traveling that fast than it’s technically never anywhere for more than .000001 of a second if that so does that mean it’s never really anywhere?",
            "400 miles per second creates a boom a bit larger than a sonic one",
            "Nothing was traveling in atmosphere at 1.44 million miles per hour. Voyager 1 is only traveling at 38,000 mph, in *space*. \n\nNot doing the math, but I'm pretty sure something moving that fast would either burn up instantly and/or completely ionize the air around it. \n\nIf it was 400 *meters* per second, that's more believable, and also completely uninteresting.",
            "I always just assume they're testing new weapons systems aha",
            "Why hasn't the headline been rewritten or this taken down? ",
            "Could it have anything to do with the multiple near earth asteroids passing by over the last few days? https://www.techspot.com/news/103457-two-airplane-sized-asteroids-hurtle-past-earth-today.html",
            "Hidden nuclear testing? No idea just throwing it out there.",
            "Holy shit the original reporting says 600km per second.... this is crazy fast what the hell",
            "If there was a sonic boom, it's unlikely to be NHI",
            "Couldn’t this be a rail gun?",
            "I think it’s most likely a very close meteorite or a secret weapon being used as a deterrent/warning because of the looming threat of WW3.",
            "Pretty wild, this could have been a massive asteroid/meteor/space rock whatever and destroyed the Earth in a split second. 400 mps and woof.",
            "Aliens craft dont make sonic boom.",
            "Meteor.\n\nNext!\n\nEdit: for all the silly billies downvoting me, I'm going to remind you that \"healthy skepticism\" is right there in the sidebar.",
            "400 miles a fucking second. A second. That will get you to the moon in ten minutes.",
            "It's literally a meteor.  Alien spacecraft don't create sonic booms.",
            "400 miles per second is ~0.2% the speed of light. That is fast enough to escape the gravitational pull of the entire Milky Way Galaxy.",
            "I knew it had to be a typo. I have no idea why someone would assume that an Italian publication uses miles instead of meters or kilometers. 400 mi/s is equivelant to 1.44M mi/h or 2.32M km/h or Mach 1877. Those speeds are absolutely insane. It wouldn't be a small rattle, it would likely feel closer to a tornado - or worse.",
            "Exactly. They'd only be using miles per second if an anglophone audience was their target, and even then they'd provide a conversion. No EU country is measuring anything in miles lol",
            "The Mediterranean is one of the busiest areas in the world for air traffic. I can’t imagine they test anything there as it would be too dangerous.",
            "I can't imagine they'd be flying an experimental plane outside of North America",
            "So are the original reports of 600kmh (372mps 1,342,161mph) and 400 mile per second announcement from a university all wrong and where did that originate? As in where did the Italian newspaper linked to here get the 400 number from? Obviously the newspaper isn't conducting research...",
            "Probably not a typo but a machine translation hallucination.",
            "Mach 1891 😆. Must be a typo",
            "The speed cannot be accurate ... not sure what the real speed would be, though. Maybe 400 meters per second? That would still be super fast.",
            "The original source in an Italian news article states it as 400 m/s which would be 400 meters per second, not miles. Barely over Mach 1. Why would the Italian news use miles as their measurement? The author of the article on the website you linked either isn’t aware of the metric system, or intentionally misquoted it as miles. My money would be on the latter seeing as it’s a nonsense clickbait website where the next recommended article was “10 signs you may have witch blood”",
            "According to [this page](https://education.nationalgeographic.org/resource/meteor/?t) 400 miles per second is way too fast for a meteor! The fastest meteors entering our atmosphere can travel up to 44 miles per second.\n\nUnless that site you posted made a typo, 400 mps seems to be proof that wasn’t a meteor.\n\nEDIT: I found another source that states the [400 miles per second](https://gulfnews.com/world/europe/mystery-sonic-boom-rattles-mediterranean-resorts-1.1718939092725) speed, so it doesn’t seem to be a typo.",
            "Can you link to the official statement from the institute?",
            "Probably secret US/ ISR aircraft testing if they didn't detect a meteor. UAP form a \"spacetime bubble\" around their crafts and aren't associated with sonic booms ",
            "It might be a meteor, like many said, but it is weird that 4 meteors makes sonic boons in the same place within 12 years. Also, meteors that no one saw, right?\n\nWhat might be the odds?",
            "They also said it was in line with a meteor.",
            "That's some top-notch journalism for assuming Italians use the imperial measurement system and not metric 😂",
            "> it meant 400 miles per second.\n\nat this speed it would create way more than a sonic boom\n\nsomething interacting with air at those speeds would be leaving lines of plasma behind it",
            "Yeah I’m trying to find the original Italian source for this, but all I’m getting are random English sources (and an Arab one) that are literally just the same article copy and pasted everywhere. Weird.",
            "I found Italian sources that say 600 m per second\n\nLook up the story on ground news it links a few spots.",
            "> And wouldn’t a sonic boom travel at um… the speed of sound\n\nyes, but that doesn't mean the object that created it wasn't going way beyond the speed of sound. it takes some sort of object going than the speed of sound to cause the sonic boom. \n\nthe sr-71 causes sonic booms and also goes well beyond the speed of sound.",
            "The speed of Jizz.",
            "To speculate for a moment, maybe sometimes uap use our planet as a stone skips across water. Perhaps, we are an intergalactic shortcut and that's why we sometimes get hit accidentally and wreckage is found?",
            "They already detected one prior... The NRO and NASA kept it classified until releasing it, which then Avi went and recovered some of the material.",
            "This same thing happened in Minnesota about 6 months back..was recorded on ring videos",
            "This is the most interesting and original post that I've read on this sub in about a month. The back and forth discussion is 🔥\n\nI'm loving it!",
            "That statement is not backed up by complete knowledge of every type of uap known or unknown.",
            "Not generally but to have 4 \"meteors\" explode above the same small island so loud it can be hear across the island in the span of a decade or so is very weird. ",
            "Right now, alien craft (not UFOs) have not even been proven to exist. So for a random person on the internet to know it's properties is just whacko",
            "[That's not entirely accurate](https://www.reddit.com/r/UFOs/comments/17wj711/yes_uaps_can_and_have_created_sonic_booms_help_me/).",
            "Ah darn slightly too fast to be Tesla's stuff\n\n...\"Nikola Tesla, the inventor, w̶i̶n̶n̶e̶r̶ ̶o̶f̶ ̶t̶h̶e̶ ̶1̶9̶1̶5̶ ̶N̶o̶b̶e̶l̶ ̶P̶h̶y̶s̶i̶c̶s̶ ̶P̶r̶i̶z̶e̶, has filed patent applications on the essential parts of a machine the possibilities of which test a layman's imagination and promise a parallel of Thor's shooting thunderbolts from the sky to punish those who had angered the gods. Dr. Tesla insists there is nothing sensational about it, that it is but the fruition of many years of work and study. He is not yet ready to give the details of the engine which he says will render fruitless any military expedition against a country which possesses it. Suffice to say that the destructive invention will go through space with a speed of **300 miles a second, a manless airship** (1,080,000mph 1,738,091kmh) *without propelling engine or wings*, sent by electricity to any desired point on the globe on its errand of destruction, if destruction its manipulator wishes to effect.\n\nTen miles or a thousand miles, it will be all the same to the machine, the inventor says. Straight to the point, on land or on sea, it will be able to go with precision, delivering a blow that will paralyze or kill, as is desired. A man in a tower on Long Island could shield New York against ships or army by working a lever, if the inventor's anticipations become realizations.\n\n\n“It is not the time,” said Dr. Tesla yesterday, “to go into the details of this thing. It is founded on a principle that means great things in peace; it can be used for great things in war. But I repeat, this is no time to talk of such things.\n\n“It is perfectly practicable to transmit electrical energy without wires and produce destructive effects at a distance. I have already constructed a wireless transmitter which makes this possible, and have described it in my technical publications, among which I may refer to my patent 1,119,732 recently granted. With transmitters of this kind we are enabled to project electrical energy in any amount to any distance and apply it for innumerable purposes, both in peace and war. Through the universal adoption of this system, ideal conditions for the maintenance of law and order will be realized, for then the energy necessary to the enforcement of right and justice will be normally productive, yet potential, and in any moment available, for attack and defense. The power transmitted need not be necessarily destructive, for, if existence is made to depend upon it, its withdrawal or supply will bring about the same results as those now accomplished by force of arms.\"...\n\nNew York Times\nDecember 8th, 1915",
            "HTF do you know? lol",
            "4 ‘meteors’ in 12 years all exploding over the same island isn’t unusual and worth investigation in your mind? Disregarding it with ‘next!’ just makes you look like a bit of a tit. I’ve no idea why you’re wondering about downvotes 🤷‍♂️",
            "Healthy skepticism = two words with no links + instructions to tell people to move on?\n\nYou're getting downvoted for being short and flippant, not because your comment is skeptical—btw I agree that it could be a meteor as that's far more of a grounded explanation.",
            "[deleted]",
            "saying it's a meteor when meteors don't go anywhere close to that speed isn't \"healthy skepticism\". it's throwing shit around because you want to say you solved it.",
            "Lmao I was picturing that like what would that even be, it’s just nowhere at that point if it’s never in one spot 😂",
            "Sardinia which is not far from the event, can count many military bases and it has been the site of Nato military exercises for years and Lockheed Martin is also involved in the business now ( those informations can be found in many public articles). What if the recent intensification of exercises had to do with the war in Ukraine? Not to be ruled out, given that Ukrainian soldiers have been trained in Sardinia in recent months.\n\nNow, the next things I'm going to say it's just speculation and working with imagination, so don't take it seriously, but it attracted my curiosity:\n\nAnother coincidence that occurred is that in the past 2 days right when the event occurred, the entire sky in most of Central Italy and part of Northern Italy was foggy, as if covered by haze. Not to be a conspiracy theorist, but what if some geoengineering operation was carried out to hide what could be visible in the sky by inducing the arrival of Sahara wind just in these days?\n\nReturning to the topic of geoengineering, a month ago there was a reoccurring anomaly recorded by Ventusky, who then denied it as a data recording error, but the excuse does not hold up because the same anomaly was also recorded by satellite data from another platform. The anomaly occurred in the south-west of South Africa, north of Antarctica which coincidentally had its center in the misterious Bouvet Island.",
            "Ever heared, that there is an Aerospace Industry outside the US?",
            "Why?",
            "They could, but rare.",
            "Why can’t it be accurate?",
            "Might of meant 4000 mph",
            "Fuck, the aliens are here *and I'm a witch??*\n\nFuck me what a day",
            "It seems to be a typo if you try to trace back to who it came from you get to the \"Istituto geofisico toscano\" cited in the news articles. \nIf you look for the Italian news [here](https://sciencecue.it/misterioso-boato-in-toscana-cosa-e-stato/47736/) and [here](https://corrieretoscano.it/toscana/cronaca/boato-in-toscana-ipotesi-meteorite-a-sud-di-montecristo/) you will get a 400m/s. And for the curious and fan of google translation, there is a lot more detail [here](https://www.geopop.it/forte-boato-avvertito-in-toscana-potrebbe-essere-stato-un-bolide-cosa-sappiamo/).",
            "400 miles per second is almost 11x escape velocity it must be a mistake",
            "~~It is 100% a typo. 400 miles per second is faster than the escape velocity for the milky way. A 150 gram baseball going that fast would release nineteen sextillion six hundred quintillion joules, or a 4 trilli-ton bomb. I had to make up trilli-ton because we don't have a level of energy to describe that. It's more than all of the solar energy hitting the planet in a 24 hour period. It's 50% of the total oil reserves worldwide in energy. It's 75% of the world's coal reserves.~~\n\n~~Even if it were a grain of sand, it would still be a 2.5 megaton explosion.~~\n\nMath was wrong, misplaced a decimal. Still don't believe the object was going 400 miles per second and was likely going 40 miles per second and there was an error in translation.",
            "That’s 2.3 million KM per hour if anyone’s wondering.",
            "Maybe it was an extrasolar meteor.",
            "No meteor goes 400 miles per second.",
            "Considering an estimated 25 million meteoroids, micrometeoroids and other space debris enter Earth's atmosphere each day the odds are higher than you think. [https://en.wikipedia.org/wiki/Meteoroid](https://en.wikipedia.org/wiki/Meteoroid)",
            "meteors don't go anywhere close to 400 miles/sec",
            " a very small object going that fast i feel would be hard to see",
            "No meteor goes 400 miles per second. Not even close.",
            "[According to this article here](https://www.iltirreno.it/piombino/cronaca/2024/06/21/news/boato-sulla-costa-l-ipotesi-bolide-i-dati-e-le-prima-analisi-su-cosa-ha-spaventato-mezza-toscana-1.100542099) the shockwave was traveling at 400 m/s.\n\nI saw someone else link it. Not sure how reliable of a source it is. \n\n> velocità stabile sui 400 metri al secondo",
            "A jump from 400 to 600 m/s is still about a thousand times away from miles/s.",
            "To be fair I have no idea what physics does your speculation imply. It's to low for a gravity assist maneuver and idk about other skipping stones and shortcuts in space.\n\n\nAnyways to me it sounds improbable that aliens would randomly pick Mediterranean as a special region to vrooom around.",
            "At those speeds the influence of the earth specifically on speed or direction would be negligible; they’d use the sun instead, see ‘Oumuamua which some theorise might be a spacecraft, but either way it was an interstellar object passing by and getting its direction affected by the sun.",
            "For what, a gravity assist? We use Jupiter or the Sun for our own gravity assists, because they're way bigger. An intergalactic civilization, well, firstly, would possibly have no need for slingshot maneuvers, and secondly, they would have *way* better options than our measly planet. Jupiter, our Sun, other nearby stars that are even bigger, black holes, etc.",
            "You're confusing interstellar and intergalactic if you are talking about ʻOumuamua. It also had much more modest speed of 87300 m/s",
            "Do we have similar data from anywhere else in the world? \n\n\nDo we have labs that could supply such data anywhere else in the world?",
            "Perhaps, more appropriate for r/highstrangeness ?",
            "Meteors do not, and cannot, move at 0.2147% of C.\n\nEdit: pepper down voting this need to assert a physical way of DOJ for using the laws of physics, I’ll wait, it’s an extraordinary claim, not an explanation, at all.",
            "K",
            "Because our understanding of NHI technology, is one of the defining features is they don't do sonic booms.",
            "It's because this guy has no idea what he is talking about. A Meteor creating a Sonic Boom happens maybe a dozen times a year. Imagine this happening 4 times in 12 years on an island. Think about how big earth is as well. It's a simple probability analyse. Anyone can do it. It's like hitting the lottery twice in your life. Sure it is not impossible but what are the chances? \n\nImagine spamming sources and creating long posts trying to convince people when you don't understand probability and math. This guy is so convinced of his own 'logic' it's crazy. Like there is no doubt at all. Not 'likely' or 'perhaps' no he is sure man. I will be laughing my ass off if it's the most silly thing that creates these Sonicbooms like a jet for example.",
            "It says that the institute that measured the speed said it was in line with a meteor.",
            ">4 ‘meteors’ in 12 years all exploding over the same island isn’t unusual and worth investigation in your mind?\n\nNo, not at all. But that's because I'm familiar with the night sky when a lot of people aren't, including you.\n\n[Fireball events (amsmeteors.org)](https://fireball.amsmeteors.org//members/imo_view/browse_events?country=-1&year=2024)\n\nHere's the fireball log for 2024. It's June 21st. We are up to event #3012 today. 3000 in six months. 6000 a year. And keep in mind, these are fireballs, not meteors. Big, beefy, bright, noisy fireballs. Meteors would be many magnitudes higher in count.\n\nIt is not at all unlikely for a single island to have four fireballs over the course of a decade. In fact, it would be unusual if it were ONLY four. The actual number is likely much higher.",
            "It's infinitely healthier than assuming it's an object of exotic origin.",
            "Typo is actually the most likely option here.",
            "The linked article literally says it's a meteor, homie.",
            "Sardinia which is not far from the event, can count many military bases and it has been the site of Nato military exercises for years and Lockheed Martin is also involved in the business now ( those informations can be found in many public articles). What if the recent intensification of exercises had to do with the war in Ukraine? Not to be ruled out, given that Ukrainian soldiers have been trained in Sardinia in recent months.\n\nNow, the next things I'm going to say it's just speculation, so don't take it seriously, but it attracted my curiosity:\n\nAnother coincidence that occurred is that in the past 2 days right when the event occurred, the entire sky in most of Central Italy and part of Northern Italy was foggy, as if covered by haze. Not to be a conspiracy theorist, but what if some geoengineering operation was carried out to hide what could be visible in the sky by inducing the arrival of Sahara wind just in these days? \n\nReturning to the topic of geoengineering, a month ago there was a reoccurring anomaly recorded by Ventusky, who then denied it as a data recording error, but the excuse does not hold up because the same anomaly was also recorded by satellite data from another platform. The anomaly occurred in the south-west of South Africa, north of Antarctica which coincidentally had its center in the misterious Bouvet Island.",
            "Your only comment ever and you didn’t even proofread. Interesting.",
            "Because if something goes wrong and it goes down, it’s much harder to retrieve your proprietary tech and where this was, the Ruskies would be all over it.",
            "Because it does not fall inside of his current belief system so it must be dismissed as inaccurate",
            "Isn't m/s meters per second?",
            "Just above MACH 1",
            "That does make much more sense. Thanks!",
            "So basically something an F35 is capable of?",
            "u see me after 2 coffees in the morning and u will realise its no mistake",
            "It's *galactic* escape velocity.",
            "> A 150 gram baseball going that fast would release nineteen sextillion six hundred quintillion joules\n\nI think you missed a decimal point at some point, as I only get 31 gigajoules, or about 7.5 tons of TNT-equivalent for a 150g object at 400 miles per second (643,737.6 m/s).  A serious little boom, but surprisingly small for meteoric explosions in the atmosphere.",
            "Reminds me of this. One of my fav What If storie/videos.\n\nhttps://youtu.be/3EI08o-IGYk?si=yNcQ8r1qio7dNcSr",
            "Teraton, that's the word you wanted. Following the structure: kiloton, megaton, gigaton, teraton",
            "Math is not wrong, units are. The correct is 400 meters per second, good for the fastest quarter mile in the NHRA’s history",
            "Meteors burn very bright when they enter atmosphere.",
            "That's because this story is being mistranslated. It was estimated to be going 400 **meters** per second, not 400 miles per second. \"m/s\" is the symbol for meters per second. MPS is miles per second.\n\nThe article [here](https://www.geopop.it/forte-boato-avvertito-in-toscana-potrebbe-essere-stato-un-bolide-cosa-sappiamo/) also says 0.4 km/s.\n\nThe title of this post is completely misleading.",
            "Nothing does.  Also it's meters",
            "Might be a hyper sonic missile.",
            "Well if we imagine that reaching light speed is OK but slowing down is a problem then we perhaps see where this might come in handy. We might be a skipping point to aid deceleration. I hear you about the Med being the place it happens though. unless we start also allowing for time dilation effects or it could be craft arriving at pre set times and places in accordance with agreements with earth's rulers.",
            "No I'm talking about IM1 from 2014... But yes that would be interstellar. Intergalactic, just doesn't seem possible IMO. It would have found something by now and not run into Earth.",
            "When a meteor is loud enough and large enough to shake the earth and be heard for miles around it makes the news. I've never heard one. I don't know anyone who has ever heard one. It has to be very rare generally. ",
            "Nobody is disputing that? I think the point the post is making is, has anyone ever experienced this in their life? I’m 30 and never heard a sonic boom from a meteor. It’s strange that it’s happened 4 times in the same place. There may be a reason behind it?",
            "It's cool that you know this stuff, dude. Can you find us some data on meteors causing sonic booms? Especially over a given area over time? I don't even know how to begin searching for something like that and Google is failing me, lol.",
            "[removed]",
            "you're assuming it's something, which makes you no better than those you disagree with. you're guessing just like everyone else.",
            "[deleted]",
            "Maybe it ain’t as experimental as you think",
            "Fair enough.  I was thinking about Calvine, and Brentwaters in UK, where it could be argued that what was seen was experimental aircraft, both near American military bases. But of course it is an ally Nation,",
            "Belief has nothing to do with it. 1.5million MPH would explode surrounding atmosphere. That’s a LOT of energy. It’d be far worse than a sonic boom.",
            "For sure. Translated from the article it converts 340 m/s to .34 kilometers per second.\n\n> (about 400 m/s) that is much lower than that typical of a wave that propagates in the Earth's crust. In the air, the waves travel at the speed of sound, about 340 m/s (0.34 km/s)",
            "It's something the end of a wet towel would be capable of when whipped.\n\nThe speed of sound is 343m/s.  Complete non-story.",
            "400 miles per second, not meters",
            "No. We don't have anything that can go 1440000 miles per hour.",
            "Huh, looks like I did misplace a decimal on the metric conversion.",
            "Meteors **do not** travel anywhere near that speed.",
            "Haha, needed that, thank you.",
            "Government test site for shit or something. But someone else said it’s relatively impossible with current physics for man to create this",
            "It's not misleading, it's straight up wrong.",
            "Still not even close to 400 miles per second.",
            "far too fast for that.",
            "The space is mostly empty space. Especially the space between galaxies. There's not much to find there for a random rock flying at a relativistic speed",
            "650000 m/s is really a lot for a meteor. Asteroid's speed would generally be in 10s of kilometres per second, not in hundreds. 650000 m/s is also around 2% of speed of light.\n\n\nIf their calculations are right the object's velocity is more than galactic escape velocity and the objects they detect could be extragalactic in origin. It would make this detection the first of it's kind.",
            "There were many videos a few years back of one that passed over Russia",
            "It might just be that's where the tracking station is so it creates the illusion that it's weird and in the same place but it could just be that's where it gets recorded. If you Google meteor sonic boom you will find references to lots of sonic booms caused by meteors it's not an uncommon event.",
            "The link I provided has two columns, one for delayed sound (sonic booms, etc) and one for concurrent sound (which is a much weirder phenomenon that no one has been able to accurately explain, but is widely attributed to ionizing radiation). \n\nYou can filter by reports with sound and look for videos with a large number of reported delayed sounds.\n\nThe trouble is that meteors typically explode a very long way up in the atmosphere, so security cameras (which usually capture the bulk of these fireballs these days) have long since stopped recording. A sonic boom from a meteor might take two or three full minutes to reach the ground.\n\nYou can also search youtube for \"meteor sonic boom\" and get a ton of videos.\n\nHere's a fun one from Utah two years ago:\n\n[https://youtu.be/4sPfZ3l7p5c?si=oju5FmA0WklTnwgk](https://youtu.be/4sPfZ3l7p5c?si=oju5FmA0WklTnwgk)\n\nTulsa, OK last year:\n\n[https://youtu.be/WRfZjIVvkgs?si=FyjaISg7U2EbvWGd](https://youtu.be/WRfZjIVvkgs?si=FyjaISg7U2EbvWGd)\n\nSeattle a few years back\n\n[Caught on camera: Meteor streaking across Puget Sound ends in loud 'boom' (youtube.com)](https://www.youtube.com/watch?v=iIas_KYfvJU)",
            "Hi, Jonny2bi4. Thanks for contributing. However, your [comment](https://www.reddit.com/r/UFOs/comments/1dlfbj9/-/l9oqbzc/) was removed from /r/UFOs.\n\n> Rule 1: Follow the Standards of Civility\n\n> * No trolling or being disruptive.\n> * No insults or personal attacks.\n> * No accusations that other users are shills / bots / Eglin-related / etc...\n> * No hate speech. No abusive speech based on race, religion, sex/gender, or sexual orientation.\n> * No harassment, threats, or advocating violence.\n> * No witch hunts or doxxing. (Please redact usernames when possible)\n> * You may attack each other's ideas, not each other.\n\n\n\nPlease refer to our [subreddit rules](https://www.reddit.com/r/UFOs/about/rules/) for more information.\n\nThis moderator action may be appealed.  We welcome the opportunity to work with you to address its reason for removal. [Message the mods](https://www.reddit.com/message/compose/?to=/r/ufos) to launch your appeal.",
            "Right to ad hominem when confronted with facts, huh? Galaxy brain tier.",
            "Again, the linked article literally said it was a meteor.",
            "Yes, or more likely, the shitty news agency linked in the article misinterpreted it.\n\nDo you have a link to the joint statement itself?\n\nAlso, why are you suddenly clinging to the sacred nature of the INGV when they're the ones saying it was a meteor? You can't have it both ways, dawg. \n\n\"I believe them on the 400 miles per second thing, but the meteor? There's no way.\"\n\nLMFAO",
            " Could be part of NATO exercises but if not, I doubt it would pass a security risk analysis.",
            "Unless there is some mechanism in place that prevents that",
            "Depends on the size of the object, could have been super small",
            "Im saying because F35s are known for producing sonic booms and even the article states they suspect the airplane to be a cause.",
            "[deleted]",
            "Why would an Italian source use miles? Im pretty sure its meters.\n\n>According to the measurements, the waves propagated in the earth's crust with a speed that was too low, \"just\" 0.4 km/s against typical values of 5-6 km/s.",
            "All three of those articles say say \"400 m/s\" and the third one linked even specifies \"0.4 km/s\".",
            "Italians use miles?",
            "God I love it when someone can admit they made a mistake.",
            "Please add an edit to your comment referring to the correct calculation, or with the correct result, in that case. Thank you",
            "Generally not, though they theoretically could travel at almost any speed.\n\nI'd be curious whether the speed actually pans out.",
            "I know, I thought it might have been a typo and they meant 4000 mph",
            "Yes but once it enters our galaxy, it now has to go through all sorts of large gravity objects, only to hit a small blue planet deep inside? Seems unlikely",
            "[deleted]",
            "Yeah. 2013. That's the only one that I can think of off the top of my head. So 4 in one decade over a small island is very strange. ",
            "That shit is dope as fuck, bro. Good work. 🤘\n\nEdit: Damn, that first link you posted is a rabbit hole! That's a lot of data. We really are just a rock floating in the ether, man. Thanks for posting.",
            "[removed]",
            "If it is normal ole human tech and belongs to a NATO nation, I would guess they are testing its capabilities at avoiding detection which needs to be real world at some point, or it could be an adversaries tech and they are doing the same thing. \n\nOr either sides tech and they want their adversary to see it as a gorilla beating its chest type move. Or they used a craft with different specs in order to deceive and adversary into thinking it knows the capabilities or signatures but in reality they are different and it is a mind fuck type operation. \n\nI really think any of these are likely because counterintelligence stuff can get like a novel with how they try to deceive adversaries and allies. \n\nJust spitballin. I’ll be honest, I didn’t even read the article yet lol",
            "Anything going past the speed of sound will create a sonic boom.",
            "[removed]",
            "Just referencing the title of the post",
            "I do, too.  People deserve respect for that.",
            "Oh yeah, good point.",
            "Well, it also could be a mistake in reporting. I wish I could find the original report elsewhere",
            "I mean, not really. \n\nWe pass through the torrid belt twice a year. Objects come into the atmosphere all the time. \n\nThe Pacific Ocean takes up about 70% of the planets face. I’m sure a lot of not most of the large objects probably go over/into the ocean.",
            "Hi, Jonny2bi4. Thanks for contributing. However, your [comment](https://www.reddit.com/r/UFOs/comments/1dlfbj9/-/l9or527/) was removed from /r/UFOs.\n\n> Rule 1: Follow the Standards of Civility\n\n> * No trolling or being disruptive.\n> * No insults or personal attacks.\n> * No accusations that other users are shills / bots / Eglin-related / etc...\n> * No hate speech. No abusive speech based on race, religion, sex/gender, or sexual orientation.\n> * No harassment, threats, or advocating violence.\n> * No witch hunts or doxxing. (Please redact usernames when possible)\n> * You may attack each other's ideas, not each other.\n\n\n\nPlease refer to our [subreddit rules](https://www.reddit.com/r/UFOs/about/rules/) for more information.\n\nThis moderator action may be appealed.  We welcome the opportunity to work with you to address its reason for removal. [Message the mods](https://www.reddit.com/message/compose/?to=/r/ufos) to launch your appeal.",
            "Hi, visualzinc. Thanks for contributing. However, your [comment](https://old.reddit.com/r/UFOs/comments/1dlfbj9/-/l9qw95y/) was removed from /r/UFOs.\n\n> Rule 1: Follow the Standards of Civility\n\n> * No trolling or being disruptive.\n> * No insults or personal attacks.\n> * No accusations that other users are shills / bots / Eglin-related / etc...\n> * No hate speech. No abusive speech based on race, religion, sex/gender, or sexual orientation.\n> * No harassment, threats, or advocating violence.\n> * No witch hunts or doxxing. (Please redact usernames when possible)\n> * You may attack each other's ideas, not each other.\n\n\n\nPlease refer to our [subreddit rules](https://www.reddit.com/r/UFOs/about/rules/) for more information.\n\nThis moderator action may be appealed.  We welcome the opportunity to work with you to address its reason for removal. [Message the mods](https://www.reddit.com/message/compose/?to=/r/ufos) to launch your appeal.",
            "Thank you :)"
        ]
    },
    "Official Documents Related to the Fabled INERTIAL MASS REDUCTION DEVICE with Redacted Names and NAVAIR Backed FOIA": {
        "title": "Official Documents Related to the Fabled INERTIAL MASS REDUCTION DEVICE with Redacted Names and NAVAIR Backed FOIA",
        "score": 84,
        "url": "https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20INERTIAL%20MASS%20REDUCTION%20DEVICE%20(1)_0.pdf",
        "content": "",
        "num_comments": 25,
        "comments": [
            "\n\n\nThe following submission statement was provided by /u/FedsRGei:\n\n---\n\n[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf)\n\nTurns out its literally the guy who made the Patent for the NAVY\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/UFOs/comments/1dlmjxd/official_documents_related_to_the_fabled_inertial/l9pv728/",
            "It’s interesting that the patent office wrote to the navy to say “this doesn’t work obviously” and the navy wrote back to say “actually it does” and the patent office granted the patent.",
            "[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf)\n\nTurns out its literally the guy who made the Patent for the NAVY",
            "*They called it the greatest discovery in human history.*\n\n*But the civilizations of the galaxy called it…*\n\n*…the MASS EFFECT*\n\nQue mysterious synth music",
            "Those that can't acknowledge the possibility simply aren't worth convincing",
            "[deleted]",
            "Pais and his patents are the real deal. This is how we democratize what’s been kept hidden from us. In Ross’s interview with Gallaudet a couple of days ago, he highlights how the US Navy is more transparent about UAP/USO than the Air Force. Because the Air Force has been trying to monopolize what they’ve found.\n\nhttps://youtu.be/Qh_h5OUMKIE?si=Ne-o0N_cWSS2I160\n\nGallaudet’s Sol presentation is super important.\n\nhttps://youtu.be/oq7of1A7F_E?si=9Oam1gUe4tMRAO9_\n\nAs is his interview on the Shawn Ryan show recently.\n\nhttps://youtu.be/2NVDCtSxIac?si=npIN9ot-D-j3OPcq\n\nHaven’t watched this yet, but here he is with Ryan Graves on Graves’ Merged Podcast.\n\nhttps://youtu.be/2NVDCtSxIac?si=npIN9ot-D-j3OPcq",
            "Probably just some goofy project sent to the Navy at one time. Nothing is redacted except personal info which is what b(6) is",
            "Where do you see that?",
            "[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2022-006587%20FINAL%20VERSION%20Concept%20Papers.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2022-006587%20FINAL%20VERSION%20Concept%20Papers.pdf)\n\nThis one has some formulas but I'm no good at these things. Can someone take a look at them?",
            "Yup this guy is truly a fan of mine! If you listen to his podcast the one with Ashton Forbes are the best, where they aren’t blinded by ignorance and can talk about the facts in front of them. It’s very interesting to hear him speaking on those because he slips up a few times and I feel released to much information, that’s why he has been muzzled so to speak. One of my favorite quotes was with him is and some other guy that’s been developing these technologies and said “you have no idea what it feels like to be working in one of these labs where you’re working with literal magic, and have to hang your coat up and return to regular life driving cars or planes” I mean imagine what lays behind those sheltered doors. Or as the Lockheed Martin CEO said “It would take an act of got to release these technologies for the betterment of humanity” \n\nHow fortunate are we that we have those Videos of the planes getting teleported. We now have bonified proof, from which we’ve learned how the technology actually works, like everything is already out in the public sphere, for instance the DOI papers on freaking warp drive haha. I will say a cool site you can go to where all these papers are documented is “StealthSkater.com” there you can find a bunch of information about these special access programs. Also I did make a video discussing these technologies like teleportation and warp drive where I narrated the research paper and talked about the experiment done by Unitel in the 1990s haha. They are so far ahead of us it’s scary. Link below. \n\nhttps://youtu.be/2_41GBXIYVg?si=quT7F1OU2XEtIYuT",
            "I am Commander Shepard and this is my favorite comment",
            "Goated",
            "It seems to be a concept for a pitch that was given to someone. After further speculation it says that its a concept. The document asks for an investment of 250K to start (EDIT) \\*experimenting in order to establish a prototype",
            "I found one without the B(6)   \nIts the same guy who filed the patent in 2016 Salvatore Cezar Pais, Ph.D.  \n[https://patents.google.com/patent/US10144532B2/en](https://patents.google.com/patent/US10144532B2/en)  \nThis was in 2015.   \nEither way they had interest because the patent was indeed filed and assigned to the navy.",
            "i seem to have a really intuitive understanding of how all this works and i've been posting about it lately, no coincidence, so i'll try to explain as best i can, a lot of this is just hiding basic shit deep behind science jargon all of which is almost entirely plagiarized from nikola tesla.\n\nLet the future tell the truth, and evaluate each one according to his work and accomplishments. The present is theirs; **the future, for which I have really worked, is mine.** nikola tesla, 1926\n\nokay lets break this down, pais says ''It is possible to reduce the inertial mass, and hence the gravitational mass, of a system/object in motion, by an abrupt perturbation of the non-linear background of local Spacetime (equivalent to an accelerated excursion far from thermodynamic equilibrium, analogous with Symmetry-breaking).''\n\nfirstly its worth noting that ''local spacetime'' is never really in thermodynamic equillibrium because the background energy in any given point in spacetime is dynamic, constantly in flux with the universe around it. anyway ''an abrupt perturbation in local spacetime'' is simply any electric impulse outside of that normal background fluctuation. so what this is saying is that an electric impulse with the proper characteristics can reduce the inertial and gravitational mass of an object.\n\nhe confirms this when he goes on to say that the physical mechanism which drives this is the force exerted by the local vacuum energy state. he achieves this ''by a coupling of accelerated high frequency vibration with accelerated high frequency axial rotation of an electrically charged system/object''\n\na radio transmitter pulsing in the proper configuration\n\n[https://www.youtube.com/watch?v=9HyJuhqPayI](https://www.youtube.com/watch?v=9HyJuhqPayI)\n\nto understand how electricity and gravity are related one must return to basics. ''the vacuum'' is just a modern term for ''free space'' as in, the dielectric permittivity and magnetic permeability of free space. the dielectric permittivity of free space is a mathematical ''constant'' which reflects the ability of an electric field to pass through the vacuum.\n\nit is widely known that electrical engineering mathematics is idealized and no such ideal vacuum exists in nature due to the constant fluctuation which means that a dielectric is an electrically insulating material and the dielectric ''constant'' is a measure of that material's ability to permit electric fields. thus the dielectric ''constant'' varies depending on the material in question. here, we're talking about vehicles traversing inter-planetary/inter-stellar space so the dielectric we are dealing with here is atmospheres on planets and moons and the highly rarefied, ionized and DYNAMIC inter-planetary/inter-stellar winds.\n\nmathematically, the vacuum permittivity is equal to one over the magnetic permeability times the speed of light squared thus mathematically linking the speed of light with the dielectric constant. this is why satellite clocks run a little faster than clocks on earth because the atmosphere being thinner up there changes the dielectric constant which changes the apparent speed of light through the dielectric of the atmosphere\n\n[https://www.youtube.com/watch?v=KTzGBJPuJwM](https://www.youtube.com/watch?v=KTzGBJPuJwM)\n\nnow consider the secondary magnetic fields produced by an electric current. the secondary magnetic field can be controlled by controlling the primary electric impulse and this is how you get salvatore pais' vacuum engineering. throw that ass (the electric current) in a circle, you get a circular magnetic field, kinda like tesla's polyphase. so with the right circuitry you can use electric fields to engineer the dielectric permitivitty and magnetic permeability of free space thus allowing for apparent faster than light phenomena   \n\nspinning magnets can quantum lock without a superconductor\n\n[https://youtu.be/V5FyFvgxUhE?si=14D8G55UONYAFKO5%C2%A0%C2%A0](https://youtu.be/V5FyFvgxUhE?si=14D8G55UONYAFKO5%C2%A0%C2%A0)\n\nanother way to think of it, the local vacuum/whatever dielectric in question can be engineered to be a superfluid/ferrofluid. scientists have recently found they can tune the casimir effect by using a ferrofluid i.e they can tune quantum fluctuations with magnetic fields\n\n  [https://www.popularmechanics.com/science/a61148470/casimir-effect-control-nanotech-breakthrough/](https://www.popularmechanics.com/science/a61148470/casimir-effect-control-nanotech-breakthrough/)",
            "[https://www.archives.gov/declassification/iscap/redaction-codes.html](https://www.archives.gov/declassification/iscap/redaction-codes.html)\n\nThe redactions read as follows (I'm no American so please correct me if I'm making incorrect assumptions here!):\n\n\\* 1.4 (b)  Foreign government information\n\n\\* 3.3 (b) (6)  Reveal information, including foreign government information, that would cause serious harm to relations between the United States and a foreign government, or to ongoing diplomatic activities of the United States",
            "He's a fan of you? What did you do?",
            "Gotcha, thanks",
            "That's interesting. Do you concur?",
            "I won't comment on the rest, but satellite clocks run slower because of the decrease in gravity. The difference is perfectly calculated by Einsteins relativity",
            "[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2020-004558%20Patent%20documents\\_FINAL.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2020-004558%20Patent%20documents_FINAL.pdf)\n\n[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20233%20-%20HFGWG.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20233%20-%20HFGWG.pdf)\n\nWhen searching for \"HEEMFG\"",
            "No, he means when the weather is hot, he sits down while patent guy cools him down by waving large fans at him.",
            "they cant coverup the laws of physics forever. its just like galileo, the truth is out there, you only need to look through the telescope.",
            "einsteins relativity is not needed because mathematically the speed of light is related to the dielectric constant as i already explained so this decrease is accounted for classically. tho yes gravity is related to electricity, indeed gravity is a byproduct of electrodynamics",
            "You are suggesting that ALL modern understanding of physics is flawed. I don't understand how how physicists using the wrong formulas and the wrong fundamentals could possibly land a rover on Mars (which requires accounting for relativity) or keep the GPS system in sync (whose clocks are calibrated using relativistic formulas)\n\n\nIf gravity is a product of electricity, anyone with basic supplies could run experiments on altering gravity. In this sub reddit alone, more than a couple hundred people should be able to take video of them doing so. Why is there no video evidence? "
        ]
    },
    "James Fox promises to us all that we won't be disappointed": {
        "title": "James Fox promises to us all that we won't be disappointed",
        "score": 215,
        "url": "https://i.redd.it/6j3dssfg408d1.png",
        "content": "",
        "num_comments": 205,
        "comments": [
            "\n\n\nThe following submission statement was provided by /u/kake92:\n\n---\n\nAnd before you say James didn't answer the question, he did confirm that Jason Sands will be in his upcoming documentary [https://x.com/jamescfox/status/1793433632532521397](https://x.com/jamescfox/status/1793433632532521397)\n\nHe also said that it will take several months to roll it out once it's finished. Will release likely later this year.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/UFOs/comments/1dlgl0l/james_fox_promises_to_us_all_that_we_wont_be/l9onno8/",
            "That's not a promise, he said he doesn't think you'll be disappointed",
            "lol is this tweet really worth a thread/discussion about???",
            "Not a single question answered. I'm fine with him letting the work speak for itself but this isn't news. ",
            "I think that I will be disappointed.",
            "This is almost always the first sign that you’re going to be disappointed.",
            "I can’t get any more disappointed at this point. ",
            "No way, someone selling a product says the product is good?",
            "Lol. Guys. Years of this. Vague statements promising news. And yall still fall for it.",
            "oh but many of us will be. i dont care how many first hand witnesses tell me a story. we have many of those and as interesting as they are scientifically they mean nothing. we need a smoking ship a severed alien hand giving us the finger.",
            "“I don’t think you’ll be disappointed” is not the same as “You won’t be disappointed!”  \n\nIt’s like he saying “There’s a new pizza place in town. I don’t think you’ll be disappointed”",
            "The endless grift. Keep everyone looking, anticipating your next move. Always leave them wanting more.",
            "Not really a promise, more of a \"I doubt you'll be\"",
            "Documentary maker with poor vetting skills promises his finished film, mirred by a questionable star witness, won't disappoint.  He totally didn't say this to recoup as much revenue as possible when it releases. ",
            "we are all constantly disappointed, have been, and will be…for the foreseeable future",
            "Doesn't promise anything but I bet I'm still disappointed.",
            "\"Trust me bro\" should be a post flair.",
            "WTF does that means?",
            "\"I don't have conclusive evidence to confirm that your balls will be blue\"",
            "Yay more cliffhanger monetise my career BS, can't wait!!!",
            "Project Bluebook to Project blueballs",
            "What else is he supposed to say lol.\n\n\"Sands apparently isn't legit and it's too late to make any edits so honestly don't waste your time watching my movie\"",
            "\nThis is what will happen: there will be zero evidence identical to that of David Grusch. The reason for this is simple: there is currently no evidence to suggest otherwise. While I would be happy to be proven wrong, that would require evidence. \n\nLook these people are about making money and that’s their objective. Just look and see. You’re buying their fiction presented as a reality.",
            "Upcoming documentaries, books, podcasts, goatee styling gel. I wish people would wake up! These people are stringing you along.",
            "An announcement about an announcement about an announcement. Very disappointing.",
            "Never been disappointed with anything Fox produced. People seem to think they have some exclusive right to get exactly what they want or hope for, instetad of being grateful for th actual work put into things.",
            "Shut the fuck up (fox) and give us something tangible. I’m sick of all these fucks",
            "“I don’t think”",
            "Completely dodging the question I see.",
            "bet my life we will",
            "Funny how that Jason Sands guy just totally came and went. Mission failed, I guess? They really gotta start hiring better disinformation agents; like, shit, get Doty back in the spotlight.",
            "Yawn.  What is the point of a post like this?  Slow Friday?",
            "How long ago did he promise the Vagina Alien video would be shown?",
            "People like James Fox, Bob Lazar, Corbell, Lue Elizondo and co. got it figured out: while its fun to be a cult follower, it pays more to be a cult leader!!\n\n\nFollow the breadcrumbs! ",
            "??? do people have 0 reading comprehension? this is the shortest game of telephone ever played lmao",
            "Translation:  yeah.  Like sands through the hourglass these are the days of our cries.",
            "Remember when he bet that youtuber 1000 dollars full disclosure was coming within the year.\n\nWonder if he’s paid up",
            "I guarantee people will be disappointed",
            "James Fox lost a lot of credibility when he hyped up this unreleased video saying it will be definitive proof meanwhile Logan Paul has also seen the video and said it looked incredibly fake",
            "Those who truly believe will never be disappointed. That is how these things work. It doesn’t matter what it is , they will believe.",
            "So tired of this crap. Also sick of everyone mentioning their upcoming book on a podcast.  Lots of smoke, mirrors and snake oil out there.  Anything of substance will be after the election. The stuff most of us are curious about won't come from these people. It's going to be an unknown person from an unknown agency that ends up breaking the damn.",
            "I mean, a guy hyping his own movie says it's awesome.  Ok.",
            "I'll buy it regardless. There's just not that many quality UFO documentaries and his are always good, even if it doesn't entirely persuade me.",
            "He’s always hyping up the next big thing. I’ve yet to see anything of significance from his work.",
            "I originally read that as Jamie Fox and got super confused about what he had to do with UFOs.",
            "Here’s my dumbass wondering how and why actor Jamie Foxx is now involved in uap stuff",
            "I can't wait ! very exciting because Fox is going to introduce us to the Gyro-Plex platform which is suspected of powering most Class M UFO's, this has also been confirmed by Bob Lazar !",
            "The people will these nuts and bolt anti grav ships no longer consider themselves people of any nation on the planet. It's a complete breakaway society and civilization and they view themselves as Gods and will never let any disclosure ever happen. They would rather blow up the entire earth before giving up any tech they have.",
            "To be fair to James Fox, if his latest work is anything like his previous then he's probably correct.",
            "I don't believe it.",
            "Sounds like an ironclad statement to me. If anyone is disappointed please spread the word",
            "\nYeah, I wouldn’t get your hopes up. This is just gonna be another UFO/UAP documentary. \n\nUnfortunately, the big bombshell kind of things are gonna come from either the government, or someone like David Grusch / Luis Elizondo that has smuggled documents or some type of evidence that the public hasn’t seen yet.\n\nThe longer that this process drags out behind the scenes in my opinion, the higher likelihood there is for catastrophic disclosure. \n\nAnd that’s honestly a good thing because the government should be held accountable for what’s going going on here, and I think a lot of people are actually be upset when they learn what the governments been doing and getting away with for the last hundred plus years.\n\nto be honest, this feels like it’s more than just a UFO revelation and it’s more along the lines of massive fraud & waste, abuse, and people who have been harmed reengineering these crafts and people who’ve been murdered to cover this up. It’s just a lot more than just aliens at this point \n\nAnd in my opinion, that’s what the government fears more actually is the amount of repercussion that’s going to happen. People are probably gonna demand change for agencies like the Pentagon & the CIA and there’s gonna be another church committee. That’s the big problem.",
            "When is it out? I'll watch",
            "Yeah, ridiculous. All these guys know we all want clear cut, irrefutable evidence and none of them can give that.\n\nNot being a hater, I like these docos as entertainment, but come on...",
            "He did great work before but his reluctance to actually show what is so amazing is a bit annoying.",
            "I’ve been subbed for a while now, and I don’t really check in much anymore, but I regularly see posts about “this guy SWEARS the time is soon” and frankly it saddens me. I’m just as ready for the truth to be revealed but I have dinner to make, a dog to walk, I’m reading Grapes of Wrath. I know that not everyone here is locked into their computer at all times but I suspect that some of you may be and it might be helpful to go out and get an ice cream or go bowling. When the aliens show themselves we will never be as ready as we think we will be. Enjoy what we have while it’s representative of how you’ve always known it to be.",
            "Here’s me reading “Jamie Fox” 🤦‍♂️",
            "And before you say James didn't answer the question, he did confirm that Jason Sands will be in his upcoming documentary [https://x.com/jamescfox/status/1793433632532521397](https://x.com/jamescfox/status/1793433632532521397)\n\nHe also said that it will take several months to roll it out once it's finished. Will release likely later this year.",
            "People don't get tired of this shit?",
            "Waste of your time",
            "Trust me bro™ it's coming and you will be disappointed, especially when he says \"I can't reveal anything because I will be killed.or imprisoned\"\n\nKeep on grifting guys.",
            "If one of the UFO \"grifters\" (I'll remove the quotation when they actually deliver something substantial) tweets a letter, it will be in this sub as news.",
            "You are his market.  Think about that.  He just needs a few dollars from each of you.",
            "I like James Fox, but if you’re expecting evidence that will change everything, you’ll be disappointed. I like James Fox because he goes out to the places where these events happened and interviews the people. He also gathers evidence that’s out there and turns into a film that helps visualize what happens and shows the emotions of the people who witnessed it",
            "I haven't followed this too closely, but is it confirmed that Sands was cut out of the documentary?\n\n\nI'll watch it regardless, but the fact that Sands was ever included doesn't bode well... If you want first hand witnesses, just go to youtube - they're a dime a dozen and nobody pays them any mind because there's no way to verify any of what they say. If the quality of the other first hand witnesses in the doc is on par with Sands, then it's kind of just a sensational cash grab....",
            "Disappointed is our middle name in uap books",
            "I remember a little over a year ago, Fox was obsessed some incidents.\n\nVideotape of a pair of nerds trapped in a station wagon as a UFO floated over their car for a half hour. And then some \"bombshell\" Varginha footage or news. \n\nNothing ever surfaced. He may be more of a grifter than Lue is.",
            "Anyone still truly invested in these guys providing real info is a mark and is being taken advantage of.",
            "Now. I want you all to remember how many time you've heard the exact same thing in the past 2-3 years. Remember and never forget how much you'll disappointed. It's inevitable.",
            "How many times has this been promised and y’all still bite?",
            "Press X to doubt",
            "Can anyone tell me when this doc is supposed to be released? I can't find any info on google about it.",
            "\"Something big is coming\" ™\n- Grifter #3248",
            "Call me Doubting Thomas, but I kinda feel like that Jason Sands will tell us a story or 2, but won't JUST TELL US THE WHOLE TRUTH.\n\n\nTo be really honest, I started smelling bullshit right about the time the \"retired\" CIA guy started talking...the one who \"met a Reptillian\" and who said, \"Well, they said they were coming back in 2027...\"  THAT. That moment in time...then the whole interdimensional beings shit started, angels and demons...for fuck's sake, good ol' Tucker Carlson made mention that there is a \"spiritual side to all this\" and kind of hinted to the belief that the alie s, or at least *some* of the aliens were straight up demons, and oh-by-the-way, the US government cut a \"deal\" with the demons...\n\nThere are strange craft on the sky all over the world. Every day there are like 5 new videos, from S. America to Alaska to Greece to S. Africa...\n\nAND we just happen to be close to, imo, WW3.\n\nWhat makes more sense, to me, is that the US government is spouting bullshit left and right, freaking peopld out or getting them all excited, and in the meantime the IS military gets to flex and show off it's new weaponsto Russia and China all while denying they exist at all and putting up smoke and mirrors.\n\nNow, that being said, there teally is some straaaange shit going on.  I just watched a video today of craft going in and out of an active volcano...so, ya know, Idk...\n\nBut I *definitely* smell some kind of BULLSHIT.",
            "Laughable that we need a post about this, it just shows the little economy that many online 'influencers' have created for themselves. They'd rather string out the community on snippets like this than just be open, and the cynical among us would say it's because they don't know anything more than we do.",
            "I'm sure I'll be disappointed, because they never have evidence.\n\nI said it before and I'll say it again hearsay is not evidence. Congressional meetings is not evidence.",
            "“buy my movie”\n\nthis subreddit: WOW SOMETHING BIG HAPPENING",
            "Ah this line again. We've heard this so many times from James Fox and each time I'm disappointed. Never anything new or substantial. Just rehashed content in a shiny new package. Stop watching his crap.",
            "I'll just put that on the pile of promises over here",
            "It's bad enough this is even a thread but who are the 200+ dipshits upvoting this complete non-topic? Is OP James Fox? Did he buy these upvotes?",
            "I never understood this community and constant hyping. Release shit or shut the fuck up, no need to announce it in advance unless it's in fact not important.\n\nIf it were that important and paradigm-shifting, you wouldn't need hype to generate engagement.\n\nI'm really starting to think these people are all grifting",
            "Just 1 week more ...",
            "Which means, prepare to be disappointed.",
            "[removed]",
            "This reminds of Biden's State of the Union Speech when Tim Burchett greeted Biden on his way to the podium, and people here were celebrating that Tim had struck up a disclosure deal with him in the seconds' worth of interaction they had.\n\nPeople here will read into anything and everything\n\nEdit: People here also celebrated that disclosure was coming because of the UFO advertisements during the super bowl.",
            "After the Jayson Sands debacle, i don't trust his guessing abilities much.",
            "Specifically he doesn't think that one guy on twitter will be disappointed",
            "Such a classic \"I don't know anything but am going to pretend I do\" use of language. Ugh.",
            "'I don't think you can eat that donut'\n\n-Challenge Accepted",
            "And this is what leads to people unexplainably expecting disclosure level evidence from them.",
            "200 upvotes for a guy that says you won't be dissapointed in the movie that he's working in. As if would he have replied differently. \"I've been working on it for a year now and it will be a big nothingburger.",
            "You seen the other threads? Today?",
            "So did the Sands bit get cut?",
            "Can I offer you a subscription to my paywalled newsletter in these trying times?",
            "I BELIEVE I’ll be disappointed",
            "I already am ",
            "I dunno man, I heard that we may be getting big news that there might be someone who may be willing to potentially come forward with some earth-shattering information by the end of 2029. Big, if true.",
            "I'll raise you one. When has \"big ufo news\" ever had concrete proof or not disappoint?",
            "I’ve never been disappointed by a James Fox doc. No reason to think I’ll be disappointed this time around.",
            "Soon ",
            "perhaps be disappointed after you watch the documentary\n\n  \nthat would be a bit more reasonable",
            "Ohh fair point. I guessed when you go down. There is nowhere to go but UP.",
            "“i want to clear up a misconception about the Wha-Cha-Ma-Carcass Sandwich. I used non-diseased meat from diseased animals! Everyone does it!”",
            "Still falling for the editorialized headline the grossly misrepresents what was actually said while placing yourself above others.",
            "It’s grifting 101. Dude hasn’t moved to 200 level courses.",
            "Have you watched any of his documentaries? He has done really good work. I don’t know how any of that can be interpreted as “grifting.”",
            "What's the grift? He makes amazing documentaries, and we watch them for free. Grifting involves separating people from their money under false pretense. Not sure you actually know what you're talking about.",
            "I don’t think you know what that word grift means.",
            "The grift is strong with this one",
            "You don’t know what grift means.",
            "sure",
            "We should all just get together and disclose ourselves 👽",
            "It means \"oh shit that Sands decision was *so dumb*. Fuck. What do I say?? I'm *years* deep in this now! I need the fucking money!!!\"",
            "😂😂😂😂😂",
            "not exactly  https://x.com/jamescfox/status/1793433632532521397",
            "If Grusch gave zero evidence to Congress, why do you think there was a congressional hearing?\n\nAnd why do you think they’ll be another one? \n\nA lot has happened in the past year",
            "That's not at all what I see.  What I see is you selling fiction as reality.",
            "You hear about the CIA bots in social media platforms like Reddit forums who try to dissuade people from paying attention to this?",
            "Yeah we should all just stop paying attention to this... \n\nthey fooled Congress, fooled the Inspector General of the Intelligence Committee, fooled high ranking intelligence and military officials, flew drones over nuclear sites and Air Force bases causing them to panic and shut down and relocate their F22's, the've fooled fighter pilots by out maneuvering them with their drones, fooled Aircraft Carriers with their drones, fooled nuclear submarines in the ocean, they fooled everyone and are just stringing them along.\n\nSo.... stop looking at it guys...they are just fooling everyone and stringing everyone along with their planted classified above top secret \"evidence\" and elaborate drones.",
            "You must hate Mick West then",
            "Good god, we get it. Thank you for the PSA. The same PSA that is said on every single post in UFOs. You’ve opened our minds, you woke up the sheep. Rest easy and don’t bother next time.",
            "You really think you're super smart don't you 😂😭",
            "Asking people to both pay him for his content *and* be grateful is a bit much. I tend to reserve gratitude for people who aren't being compensated already",
            "Agreed. The phenomenon and moment of contact were just very decent. I don't know why people complaining here so much about him.",
            "Buy my movie :) I don't think you'll be disappointed. :)\n\nJason Sands? The guy who makes Steven Greer look like Sean Kirkpatrick? Is he still in my movie?\n\nI don't think you'll be dissapointed. :)\n\nI promise a very somber and laudatory viewing experience, thx. :)\n\np.s: 2027, trust me bro",
            "I think a real video would look fake",
            "The truth is what it is despite your disbelief. That is how reality works.",
            "Don’t you love watching UFO celebrities like Jeremy Corbell suck off a fake scientist and convicted pimp while making a 1 star documentary about him? Or how about the fake pentagon UFO program director using trust me bro claims to promote his new book with “big revelations”? Then whenever the real pentagon UFO program director comes and calls out UFO/alien promoters everyone rails at him.",
            "Sands being in it will in fact disappoint me. ",
            "James has confirmed in other comments that he will be in the documentary. Too lazy to search for them and link.",
            "I heard you won’t be disappointed",
            "Hi, super_circle. Thanks for contributing. However, your [comment](https://old.reddit.com/r/UFOs/comments/1dlgl0l/-/l9p79tv/) was removed from /r/UFOs.\n\n> Rule 1: Follow the Standards of Civility\n\n> * No trolling or being disruptive.\n> * No insults or personal attacks.\n> * No accusations that other users are shills / bots / Eglin-related / etc...\n> * No hate speech. No abusive speech based on race, religion, sex/gender, or sexual orientation.\n> * No harassment, threats, or advocating violence.\n> * No witch hunts or doxxing. (Please redact usernames when possible)\n> * You may attack each other's ideas, not each other.\n\n\n\nPlease refer to our [subreddit rules](https://www.reddit.com/r/UFOs/about/rules/) for more information.\n\nThis moderator action may be appealed.  We welcome the opportunity to work with you to address its reason for removal. [Message the mods](https://www.reddit.com/message/compose/?to=/r/ufos) to launch your appeal.",
            "People on here love the \"he didn't deliver on his promise\" narrative",
            "\"Disclosure\" is a myth anyway. People believe all kinds of different stories about what there is to be disclosed, so there's not even any kind of agreement on what would qualify as 'disclosure'. \n\nIf the US government released all of their stuff on UAPs and the conclusion was \"we've recorded and seen all kinds of weird things, but we don't know what they are\", then who here would believe it? \n\nIf they said that they'd concluded that UAPs were extraterrestrial in origin, but that they hadn't been able to make contact or recover any craft, who would believe that? \n\nIf they said that they'd recovered a partial or full craft, but no bodies, then we'd still have a sizeable portion of the community calling it lies because it didn't confirm their narrative about aliens working with the government, or whatever. \n\n\"Disclosure \" is essentially the McGuffin in a LARP. It doesn't really mean anything, and people don't actually know what it is or what it would look like or what would satisfy them, but it's something they can get behind.",
            "That’s all true and part of the slow drip method and we are here to re read and evaluate and speculate",
            "Disclosure has already happened. If you can't see that...",
            "I mean people who are into this subject a bit to far all seem to believe a grave robber with multiple convictions for fraud involving mutilated mummies going back 30 years is the Messiah of disclosure because he has some err…. Mutilated mummies.",
            "Remember when is the lowest form of communication.  ",
            "Is that really how you translate that lmao",
            "Manage your Fuckin expectations. I feel like these people just got in the game it's all or nothing for them. \"Well they aren't showing direct evidence right now so it's not real.\"",
            "Apparently not. Read the other post by the OP",
            ":) I don't think you'll be disappointed. :)",
            "I’ll take the egg.",
            "only after you sell me a book",
            "Lol, I see what you did there.",
            "Yes, 2029 is when we shift into the second phase of Project Blue Balls.",
            "What’s the TL:DR?",
            "That’s objectively untrue",
            "Doesn't need to, people are stupid enough to fall for the 101",
            "Impossible. He's not passing any suitcases.",
            "You also don’t have a clue what grifting is either.",
            "Bro wanted a 20 for that one a few years ago",
            "I haven't seen his docs, but I do like a good doc from time to time. I'm not speaking on this individual really, but really the whole UFO space. Disclosure \"soon\", wait and see, tune in next week for more.\n\nWhat happened to Grusch? Radio silence. Nothing. Zip. Zilch.",
            "Kinky",
            "Grusch revealed a system that allows the pentagon to avoid congressional oversight by using SAPs and the military industrial complex to launder money.  \n\n  Congress is interested because the military is stealing taxpayer money and cutting congress out of the deal and if *anybody* thinks Congress is going to be cool with not getting a piece of the grift they’re in for a rude surprise your elected representatives crawl up their ass with flash lights and magnifying glasses looking for the receipts.\n\n  When Congress suddenly stops sifting through the pentagon’s trash and starts claiming they can’t reveal what they found because “national security” you can assume they got their kick back and things are business as usual..   \n\n“Conspiracy? What conspiracy? Listen brother we didn’t see nuthin…”",
            "The same reason there are religious believers in government. It’s very, very simple. There is zero evidence now and there will be zero evidence after the hearing. \n\nIf I am wrong then I will be the first to admit it but after 60s years of no evidence then don’t hold your breath.",
            "Thanks,happy to help.",
            "it's getting seriously annoying",
            "So you've never been grateful for a great book, for instance? Or an amazing movie?",
            "Fun fact\n\nGuillermo del Toro Claims he once saw a UFO in Mexico but didn’t tell anybody because it looked so much like a cheesy stereotypical 1950’s movie prop flying saucer that he didn’t think anyone would believe him. ",
            "I agree. Belief is irrelevant, all that matters is actual evidence, not stories.",
            "I don't know who Jason Sands is or why would you be disappointed, can you elaborate ?",
            "ok",
            "People here also seriously thought that MH370 was taken by aliens so...",
            "Disclosure refers to the exposition and public explanation of what has been going on with the black budget programs, is it not?",
            "Your right. Disclosure how people individually want it and even collectively agree how it should happen won’t ever happen. Other than the people whose lives have been ruined due to the stigma there’s no reason anyone to want or need it. If you’ve seen or experienced and meet others who you know have seen or experienced this then why should the government be the deciding factor whether it was real or not? People need to come about conclusions on their own. I understand the need for the saviour to come and make everything okay but in a reality such as the one we possibly face there is no saviour coming. You have to stand up and do it yourself. Until people start realising that we’re just as screwed as we were yesterday.",
            "It has started, i don’t think we can say it happened yet.",
            "I would say adding needless comments that don't add anything to the conversation is the lowest form of conversation.",
            "PROMISER!",
            "Jason sands is a phony boloney liar liar pants on fire poopoo monger. \n\nJames did not do his due diligence and vet the guy before featuring him in his yet to be released but sure to disappoint documentary ",
            "Disappointed",
            "There is a cover-up so vast and well funded you'll find cars with US GOV plates behind your shed if you talk about UFOs too much.",
            "James Fox to UFO fans: “Lemme hold a twankie.”",
            "I've seen every one of his documentaries for free. I've never been asked for money. I've never hit a paywall. I've never had to subscribe to anything.",
            "Indeed",
            "Hear hear!",
            "Let’s see where we are at the end of this year",
            "It almost like there is a concerted effort to flood this sub with all these naysayers.  Surely no government organization would do that.",
            "I've enjoyed them, but I haven't felt an outpouring of sentiment for the creator. They produced content I enjoy in exchange for money, and did a good job of it.",
            "Unless you’re selling bibles lol. ",
            "Guy who seems to be caught in multiple lies. Search this sub for his name. ",
            "Maybe give them the slightest benefit of the doubt…? \n\nReputable former government officials are telling the American people that NHI exists and is interacting with humanity. \n\nA plane disappeared mysteriously 10 years ago.\n\nThese are 2 facts in a vacuum. \n\nWhen combined together, with a semi-convincing video, it’s easy to see how people could be **temporarily** persuaded into believing something that wasn’t true. \n\nIf 99% of the sub came back to reality and recognized it was a hoax, then why are you focusing on that 1%…?",
            "Odd comparison. 2 totally different groups of people.\n\nThe former is cynical, loves to complain, calls any person working on this a grifter. \n\nThe latter are more open minded. A bit gullible & might get carried away with ideas & theories. But no more gullible than the former, who's just as likely to call something debunked based on vague ideas.\n\nI don't see what one has to do with the other.",
            "Yes, but many don't believe it's as simple as \"they've been recorded doing anomalous things & we are unsure\" from US so they probably wouldn't count that as disclosure if that was the legitimate truth & was disclosed.",
            "On the surface, sure. But if the explanation of what's going on with black projects doesn't satisfy peoplea existing beliefs, it's just going to be called another lie and part of the cover-up conspiracy. My point is that there are so many flavours of belief that it's kinda like talking about some event or revelation which \"proves religion is true\". Well, which one? Naturally, people end up thinking it's their one.",
            "*Condescendingly* adding needless comments that don't add anything to the conversation.",
            "Somber",
            "I don't have a shed. They'll have to settle for the outhouse.",
            "Same here. You can legally watch them on Tubi and other streaming services without having to pay a dime.\n\nI don't know what people expect. They want someone who does investigative reporting on a topic that is never going to get venture capital backing or corporate sponsorship because the very nature of this topic is attempting to undo a large and powerful military contractor cabal and is unprofitable. \n\nFilm making is expensive. Traveling to locations where things happened is expensive. It's also time consuming.\n\nBut if a film maker or investigative reporter asks for financial help with these expenses, they're immediately labeled a \"grifter\". Oh, your film wasn't released on an accelerated schedule, like you're some kind of Hollywood studio with a $100 million budget? AND you have the gall to ask for money for your indie film when it comes out? Grifter.\n\nWe can very easily see what having no budget and investing little time into making investigative films looks like. There are dozens of YouTube channels that are exactly this. \"Film makers\" with no budget, amateur equipment, no connections, repackaging and rehashing information that is readily found on the Internet free of charge. Smash that Like button and check out Raid Shadow Legends if you want more. If you want this morally perfect, holy grail of free UFO video content, there you go.\n\nBut what people _really_ seem to want is high production value, high quality professional content containing new and ground breaking reporting from primary sources... for free. So what they want is someone who is already independently wealthy with the time, resources, connections and talent to break through the armor of the military industrial complex who then gives away all their work, free of charge, For The Cause.\n\nJust be thankful we have anyone willing to do actual investigative reporting on this. If you guys think you can do it better and not end up charging money for it, go do it.",
            "Indeed and I honestly hope I am wrong.",
            "Or a concerted effort by people not quite as deep in the hopium to keep fellow humans from falling for scams and hoping to unite them to ask the \"allied\" gatekeepers to spill the beans they claim to have. ",
            "It’s almost like this sub is full of disappointed people tired of the grifters that deliver nothing but more disappointment ",
            "Ty, I did try a quick google search and found nothing of interest.",
            "People here saying people here",
            "Hahahahahaha",
            "Yeah, black budget refers to the retrieval program and how SkunkWorks, etc. are reproducing supposed tech. I’m touching on what the other guy I replied to about disclosure is a myth and that it would be too confusing to agree on something but I think it’s pretty straightforward. Also, calling it a myth is invalid, little amendments are being discussed and one was passed, correct me if I’m wrong.",
            "Numb",
            "This sub is clearly being manipulated.  Why do you think that would be?\n\n[https://www.reddit.com/r/aliens/comments/1cnnq6g/comment/l3c6bg4/](https://www.reddit.com/r/aliens/comments/1cnnq6g/comment/l3c6bg4/)",
            "Not sure if you meant to reply to me, if so I'm not seeing the connection to my comment.",
            "I mean, it gives me hope that the rabid true believers are just bots pumping the nonsense. \n\nThe conspiracy loving side of me says it's just as likely those that could financially benefit from bots arguing both sides (seriously, why would the Gvt want to bolster borderline believers) would he the Lue's and Ross' of the community.\n\nIf bots were removed from the equation, what does this sub have?  Lots of grainy videos, speculation, and anecdotes without firm evidence. There'd be less  discourse without bots and less engagement. That doesn't hurt the government as much as it would those requiring fresh meat to pay for conventions and \"degrees\".\n\nOne \"degree\" tuition could easily pay for offshore API integration with GPT having a \"persona\" on Reddit.",
            "You replied to me that people don't believe in the whole “we’ve been observing UAP” idea and I reiterated what I meant on my comment that you replied to."
        ]
    }
}