{
    "Keep money in Norway or move it to the UK?": {
        "title": "Keep money in Norway or move it to the UK?",
        "score": 4,
        "url": "https://www.reddit.com/r/UKPersonalFinance/comments/1dlt0f1/keep_money_in_norway_or_move_it_to_the_uk/",
        "content": "Hi all!\n\nAfter a period of living and working in Norway, I have a chunk of cash saved there, and I'm wondering what to do with it after returning to the UK (with no intention or desire to go back).\n\nWith the NOK to GBP exchange rate being a train wreck, it seems like I will be losing a good portion of my wealth if I exchange it.\n\nI would ideally like to move my money over to the UK, close my Norwegian accounts and say goodbye to that period of my life, and also not have the headache of having to manage money/accounts in multiple countries.\n\nDoes anyone have any advice on what my best option(s) would be here? I assume the poor exchange rate could be temporary, and the NOK could bounce back, but that could take years, if ever?\n\nI've been thinking of looking for a financial advisor with specialist knowledge in this area, but I've no idea where to find one, and I assume that they'll take a hefty fee for their services.\n\nThe money I have in Norway is around 600-800k NOK, I also have a small amount of shares there.\n\nThanks. :)",
        "num_comments": 8,
        "comments": [
            "Reversing the situation helps clarify thinking.  If you had £60k in the UK, would you be considering moving it to Norway?\n\nI suspect there's a zero percent chance of you saying yes to that.\n\nSo move on with your life, transfer the money to the UK and be done with it, and then don't look back (at the exchange rates).",
            "If you have obligations in GBP then you are probably better off keeping your money in GBP. Otherwise you're just speculating on the foreign exchange markets. Just think, if you had savings in pounds now, would you convert them to kroner? And you have your answer.",
            "No one can tell you what the NOK : GBP rate will do in the future. So having what £60k in NOK is a bet that the FX rate will improve by the time you need to spend it. Unless you really know what you are doing this bet is a literal coin toss, heads it improves tails it worsens. It may be at record lows; so what? It can always get worse!",
            "Hi /u/Legitimate_Whole4573, based on your post the following pages from our wiki may be relevant:\n\n* https://ukpersonal.finance/financial-advice/\n\n\n____\n ^(These suggestions are based on keywords, if they missed the mark please report this comment.)\n\nIf someone has provided you with helpful advice, you (as the person who made the post) can award them a point by including `!thanks` in a reply to them. Points are shown as the user flair by their username.",
            "Whether it'll give you the best gains in the end is impossible to predict, but you could open up a Wise NOK account and transfer it there.\n\n\nThis would allow you to close all accounts in Norway and exchange it as needed when you want to in GDP or other currencies when travelling. You can even put it in stocks there. \n\n\nJust keep in mind that it's not an ISA account so will be taxable for capital gains.",
            "Crypto stable coin would do the trick",
            "Excellent point.",
            "Stock answers are always the easiest 😉"
        ]
    },
    "30 hrs free childcare eligibility - writing": {
        "title": "30 hrs free childcare eligibility - writing",
        "score": 3,
        "url": "https://www.reddit.com/r/UKPersonalFinance/comments/1dltyj2/30_hrs_free_childcare_eligibility_writing/",
        "content": "My wife and I have a 1 year old son. One of us will have a 4 day a week job (earning 30k) and the other will be full time writing (generating very little income other than passive income via unrelated investments) I'm wondering if there is anyone out there in a similar situation and did you manage to claim the UK childcare offers? I.e the 30 hours offer? I'm concerned we will be excluded due to one of us being a writer earning little or no earnings directly from that occupation ...",
        "num_comments": 9,
        "comments": [
            "It sounds like you’ll be eligible for the free 15 hours, but not 30 hours as it’s based on how much you’re both earning. I think the 30 hours is also currently only available from when the child turns 2 at the moment, but I’m not 100% sure about that. \n\nThis [website](https://www.childcarechoices.gov.uk/?utm_source=Search&utm_medium=keyword&utm_campaign=Childcare_Choices_2024&gad_source=1&gclid=Cj0KCQjw4MSzBhC8ARIsAPFOuyWiZyya2WejehHMKmUsSyiE3RRH-BO30zbKEu6GXUlEKMbk6Is9QGAaAkcKEALw_wcB&gclsrc=aw.ds) should give you a good idea of what you’re entitled to.",
            "A 1 year old will only be eligible for 15 hours funded, this increases to 30 when they reach age 3. \n\nAFAIK you both need to earn a minimum of £183 a week and have done so for Atleast 3 months to qualify and get the child care code. \n\nIt's also not as simple as getting the hours and sending them to nursery. Expect to be put on a long waiting list of you don't already have a space. Not all 'settings' are approved or will accept the governments free hours.",
            "Thanks - yes I was wondering if people have ways around the min earnings - I.e if you’re on a new venture working full time but not earning much… ",
            "It’s additive right ? So some people could be getting 45 hours?  Also the min income excludes passive income? I think we hit the min if we include passive income for one of us. So there are no options for people ‘just starting out’ on a new venture and career - they basically need to go get a standard job to hit the income requirements?",
            "No, there's nothing you can do other than getting your wife into work. In the eyes of the government she's not working, and can provide childcare, so why should they?",
            "No. It's a flat 15 hours per child 9 months to 2 years and 30 hours per child when they reach 3 to 4 years. After the age of 4 legally required to attend schooling. \n\n'Passive income' means nothing to me, can't comment. However If one of you dose not have a regular income but earn £9,518 or more a year, then in this example is the same as earning £2,379 every 3 months on average and you'll qualify.\n\nAnother possibility is if the lower earner is self employed, here You can earn less and still be eligible for free childcare for working parents.\n\nYou can also look into claiming universal credit for the lower earner as certain benefits qualify you for the child care hours.\n\nIn short the whole idea of it is to get parents back into work so yes, it would probably be simpler just to get a job even if it's minimum wage.",
            "No, you either get 15 or 30. You can’t combine both together to make 45 hours. I don’t know about it excluding passive income, but you do need to meet the minimum income requirements in order to get the 30 hours - there is no exception or way around them for ‘starting out’ etc.",
            "[Gov.uk](https://www.gov.uk/check-eligible-free-childcare-if-youre-working) is the best source:\n\nYour child’s age and circumstances\n\nThe number of hours of free childcare you can get depends on the age of your child. If your child is:\n\n- 9 months to 2 years old, you can get 15 hours per week of free childcare\n- 3 to 4 years old, you can get 30 hours per week of free childcare\n\nBased on the above, it would be 15 hours rising to 30 based on age.\n\nPassive income cannot be used as part of earnings to calculate eligibility.  \n\nUnder earnings:\n\nThis (£183 per week) is the National Minimum Wage or Living Wage for 16 hours a week on average.\n\nYou can use an average of how much you expect to earn over the current tax year if:\n\n- you work throughout the year but do not get paid regularly (annual income would need to be minimum of £9,518)\n- you’re self-employed and do not expect to earn enough in the next 3 months"
        ]
    },
    "HMRC get tax wrong every year. How do I stop this happening?": {
        "title": "HMRC get tax wrong every year. How do I stop this happening?",
        "score": 6,
        "url": "https://www.reddit.com/r/UKPersonalFinance/comments/1dlrd8a/hmrc_get_tax_wrong_every_year_how_do_i_stop_this/",
        "content": "HMRC miscalculate my husband’s PAYE tax every single year, and we end up paying thousands to HMRC every April. How can I make sure we’re definitely on the right amount?\n\nFor context, we’re both higher rate tax payers, and both have more than one income that is taxed by PAYE. Our incomes don’t change throughout the year, there are no bonuses, just standard small pay rises once a year like most people. My tax is only ever off by under £1k. Every year my husband calls up and they assure him it’s the right code this time, and then come April it’s not. \n\nWe called HMRC to query it again this year and the guy was the rudest person I’ve ever spoken to. Pretty much said it was our fault for earning this much and we should expect to pay lots of tax, and then said he was adjusting our tax code to increase the level he was paying as it didn’t look right. Now they’re taking more than ever before, over 40% of his total pay, even though he only earns £75K.\n\nIs it worth challenging this? We’ve called back HMRC and unfortunately got through to the same guy who was awful, so does anyone have advice as to how to challenge it?\n\n\n\n",
        "num_comments": 20,
        "comments": [
            "You need to create a HMRC tax account and check what your estimated income is for each job. If this is wrong correct it on there",
            "It sounds like it's actually sorted now.\n\n\n\nYou were paying loads every April, meaning the deductions weren't right throughout the year.\n\n\nNow the tax code has been changed to increase the deductions so they are closer to being right. ",
            "You might need to give some actual details like tax codes and deductions.",
            "What codes are his paye sources on? Is he able to say exactly how much he will earn from each source? Correct output requires correct input. So if the info his codes are based on aren't correct then the tax deducted won't be correct.",
            "You were paying loads in April because you unpaid tax all the way up to the end of tax year. So when you called, you actually asking them to tax you more in PAYE so you don't under pay tax. Therefore in April you might end up getting tax refund instead.",
            "In HMRC’s defence, having multiple income streams through PAYE is not an everyday situation, so it’s understandable that it’s not slick.",
            "I had this. It was because every year they set my tax free allowance based on my base salary and not accounting for bonuses. My bonuses are often an additional 50% which always pushed me into the situation of having no tax free allowance. \nEvery year now I go in and change my predicted earnings to what they will actually be and check I’m on a zero tax free allowance tax code. \nThis year I owed £309 for a bit of interest on a saving account. Much better!",
            "Getting tax codes correct is quite difficult in your situation.  It relies on calculating a basic rate restriction to ensure the correct tax is deducted. But, because HMRC cannot be precise with the exact amount of earnings for each job, then it can cause underpayments and overpayment each year.  \n \nThe best way, as others have said, is to keep HMRC with your earnings.  Be as precise as possible but you must still be aware that bonuses, overtime etc will knock the estimate and could cause the basic rate restriction to be changed and then cause under and overpayments.\n\nWhen PAYE was designed, it was when everyone had one job and that was usually for life.  Your current situation was very rare back then.",
            "If you earn £50,271 to £125,140 you are a higher rate tax payer. That is why your husband is now being taxed 40%. If he's now being taxed the right amount you won't owe loads in April. Surely that's your problem sorted right? I don't understand what you think you could challenge?",
            "If you provide the correct estimated pay at the start of the tax year for the two jobs then the right amount of tax should be collected from both, you need to check your tax code and make sure them figures are accurate.",
            "[removed]",
            "This 👆I do the same every year and no problems.",
            "Thank you for this! In all the years we’ve been calling HMRC they never told us this was something we could do, and despite us going over it and giving the correct details over the phone, when I’ve logged on it wasn’t correct.\n\nThey also don’t seem to have logged that we paid last year’s tax bill, and are calculating to take it still monthly.\n\nReddit truly is more helpful than hours of phone calls to HMRC… !thanks again!",
            "In HMRC's defence? That's literally their job. If this was a question of 15 different incomes coming from different countries, sure, there might be some confusion (but there still shouldn't be). I assume they have 2, maybe 3 incomes... so open the manual, find the policy and match it to the correct codes. \n\nI assume the person they reached usually does fuck all, so when he actually has to do some work gets upset and acts rude...",
            "The other approach to bonuses is to increase your pension contributions, or ask your employer to pay it directly into your pension (some employers will even add the 10% Employers NI that they save!)",
            "This wouldn't mean he'd pay 40% of his total pay of course, just on the elements in the higher rate tax band. However, there isn't enough information in the OP to answer the question properly.",
            "A human reviewed your comment and removed it from public view. The reason they gave was:\n\n\n**Rule 1 - Be nice, engage in civil discourse, don't judge** \n\nYou must read the [rules](https://www.reddit.com/r/ukpersonalfinance/about/rules/) to continue to post to our subreddit.\n\n\n**Responses must be helpful and high quality** \n\n* Give constructive help and advice. Be friendly and kind.\n* Top level comments must be on topic. No jokes or banter in top-level comments.\n* [No 'hookers and blow' or 'onlyfans' jokes](https://www.reddit.com/rhyc7i)\n* [Do not make contextless recommendations, especially high risk assets such as crypto, meme stonks, penny stocks etc](https://www.reddit.com/rkrnqi)\n* Don't pile on\n* Comments must be your own work and not a copy paste of someone else's comment, copied from ChatGPT or other AI writing services\n\nYou must read the [rules](https://www.reddit.com/r/ukpersonalfinance/about/rules/) to continue to post to our subreddit.\n\n\n\n\n_If you believe your post/comment has been removed in error, please [message the mods](https://www.reddit.com/message/compose/?to=/r/UKPersonalFinance&subject=Please%20review%20my%20post&body=https://www.reddit.com/r/UKPersonalFinance/comments/1dlrd8a/-/l9qvdec/) explaining why._",
            "This. Every year HMRC thinks I'm going to be loaded as some months my pay is up when my employer actually gets round to paying me, then extrapolated for the year. Get a tax account and correct HMRCs ass-umptions.",
            "Yeah it’s literally their job which is why they have set up a facility to handle this but the OP hasn’t set up their HMRC profile to allow HMRC to do their job of managing multiple PAYE income streams more effectively. \n\nAs I said, it won’t be slick because it’s a niche case, most people with multiple taxable revenue streams self assess.",
            "HMRC take what they think you'll earn for the year ahead in April, and calculate your tax code on that. But...a lot of people get bonuses in April, which means HMRC are getting an inflated figure and working your tax code out for the year ahead on that. \n\nYou can download the app or log on to their website and edit what you earnings will be for that year ahead, and your tax code will change accordingly. \n\nThis is what happened to me this year, I corrected my forecasted annual earnings, and my tax code is now what it should be. Pain in the ass, but only takes a minute to amend once you're all set up with an online account, and you only have to do it once a year."
        ]
    },
    "Received large amount of cash and do not know what to do": {
        "title": "Received large amount of cash and do not know what to do",
        "score": 70,
        "url": "https://www.reddit.com/r/UKPersonalFinance/comments/1dlaz8l/received_large_amount_of_cash_and_do_not_know/",
        "content": "Would really appreciate your feedback on my position\n\nMy grandad died about six months ago. I cared for him a lot especially in his last days. \nHe had three living children left alive. Two of them had nothing to do with him in the last few years., \nMy father and I mostly completed all the caring - nothing major, just weekend visits, doing the shopping, of course I done all tech support etc. \n\nHe left something for all his children (even the ones that ignored him) and grandchildren (mostly small amounts of money). He left me his clothing to choose what I wanted to keep and do what I want with the rest. He had several boxes and suitcases of old suits and hats. \n\nI recently got around to sorting through it and have found a significant amount of cash. It has the queens head on and is a mixture of mostly newer money and some old money. It is just over £360k. I have absolutely  no idea how he has this money. I immediately told my father who wa said I should keep it as clearly that is what grandad intended by hiding it in his clothes and giving them to me. \n\nI have so many questions about this money. \n\nMy personal situation is my wife is a pateaching assistant and also works part time at the gym. Between two jobs she brings in about £22k annual. \n\nI work in a start up in London as an assistant (low wage, minor stock and some perks mainly they let me start at 10am) and also work as a personal trainer at the gym. I get up at 530am run PT 6-8am head into London and finish work about 7pm head home or back to gym to run more PT. I also do a few jobs on the weekend to try and earn extra. I earn approx £33 -38k annual\n\nWe have three young sons. Who are all healthy. \nWe get Child benefit £170 per month. \n\nWe have a £290k mortgage (this was secured years ago when my wife earned a lot more money but she had a breakdown and had to reset her career). Two years ago I renewed mortgage and managed to get this on a low rate fixed for 5 yrs. We are on repayment at £1100 per month. \nWe have reduced debt on all credit cards - we had almost £23k of debt at one point but now down to £6k.\n\nWe.\n\nWe have not had a family holiday in over 5 years, since before the youngest was born. \nI have a car but it is an old Volvo and I bought it outright for £3k.  But its reliable. \n\nSo this money is beyond life changing for us. But \n1. I’m not sure where I stand on this as it was not stipulated in the will and I cannot even imagine where grandad got this money from as we used to do his shopping and drive him everywhere\n2. Even if I was able to use this money surely there is some massive tax consideration either immediately or as soon as I spend it. I mean I cannot pay off my mortgage with cash. \n\nI would really appreciate any advice. I’m so lost about what to do. \n I thought this was better in UK personal finance than UK legal but I don’t know. \n\nPlease do not DM me asking for money or with advice, I’m honestly under enough stress as it is and have waited weeks to build up the courage to post this on here (with a different account) but I’m so lost as to what to do. \n\nThank you for any help or idea",
        "num_comments": 49,
        "comments": [
            "## Don't advise OP to break the law!\n\nDoing so is pointless as your comment will be swiftly removed and you'll be banned from the subreddit - this wastes your time and the moderators'.\n\nAlso, read the existing replies before posting - please don't bother posting if the same ground has already been covered. This is in [our subreddit rules](https://www.reddit.com/r/ukpersonalfinance/about/rules), which you should read before posting or commenting here.",
            "I would suggest seeking legal advice in this. It is a complex situation and whilst your granddad wanted you to have the money, he did not state that in the will. Therefore this is a grey area as to whom the money actually belongs. Sorry, I’m sure it’s not the answer you want but you will have to declare to a bank where the money came from anyway.",
            "It's really not what you want to hear but taking this could be fraud. When your grandpa died his estate (which this is a part of) became the responsibility of the executor (had he given you it even the day before he died you would have tax implications but it would be yours). Ultimately the will it absolute and if it says his clothes you are to get his clothes.\n\nHad it been 20k or even 50k you could have (illegally mind you) probably have hidden it 360k it would need full on money laundering to hide it.\n\nYou have a couple of options here. \n\n1/Fess up in the hope you get a significant cut and the rest is divvied up in the estate (perhaps your dad will give you his share as well)\n\n3/Fess up and contest the will. If your grandpa was unwell at the end and if the executor is an arsehole they can probably claim he was infirm and had no idea he was hiding money. A good lawyer your end could suggest that he was of sound mind.",
            "[removed]",
            "Think about the physical security of the cash as well. Don't share your address with any lawyer, executor etc.",
            "Legal advice needed. The existence of this cash probably changes the IHT situation and it isn’t for your dad to decide it’s yours and it’s what your grandad intended. Even if it is what your grandad intended that doesn’t mean it can be carried out.",
            "Do get some proper advice as trying to use this as cash or bank it will trigger money laundering checks at some point. It's better to be upfront than try to sneak around that.",
            "[removed]",
            "[removed]",
            "Your personal circumstances, about how much you earn and how much your wife earns, are irrelevant right now - you need to take the cash to a bank, explain where it came from and deposit it, and you need to distribute it according to your granddad's will or the rules of intestacy. \n\nDid your grandad have a will? An executor or an administrator of his estate?\n\nIt doesn't matter that he's estranged from 2 of his kids - if he wanted to disinherit them then he should have put it in his will. Maybe he did? If he left small sums to each and the remainder to you then the money is yours, but you need to do this legal through probate and pay the inheritance tax.\n\nThere's nothing really to fret about as long as you do this by the law - it'll get processed in due course and you'll get the money, or your share of it. But your dad's idea to keep schtum is not wise - you'll get caught and you'll get in trouble eventually.",
            "[removed]",
            "Thank you. I will clearly have to get advice. I think he did mean to leave it to me and didn't want his other kids contesting the will or something. But this has created a real mess.",
            "Thanks for your response and I think it's clear I have very limited options. Appreciate it.",
            "[removed]",
            "Thank you. Do you think this would be covered by citizens advice. I don't want to pay for legal advice if I then get money taken off me too",
            ">If I had done this for my one child/grandchild who cared for me, I would feel irritated and feel you were stupid to give it up to the others.\n\nIt would however be much more helpful to write that child/grandchild into your will officially, rather than leaving £360k in cash under the bed for them, which is legally still part of your estate anyway, and for which the child/grandchild is not going to be able to keep for themselves on the side without engaging in a sophisticated money laundering scheme.",
            "If I was in the same situation I would be thinking “what if someone found out?”. Legally, morally, etc. etc. I’m not sure I’d want that hanging over my head. Life might be tough now but not doing things correctly might make it harder in the future. Hope it works out well for you and your family.",
            "[removed]",
            "Is your father the executor or is it one of the estranged kids? If your father is the executor he can make calls on this (the others could contest it) but in theory his job is to fulfill the deceased wishes.",
            "Citizens advice are not not usually lawyers (they can perhaps point you towards legal aid lawyers)  you are going to need a pretty high end estate specialist for this.",
            "No. However, think of paying a solicitor as something that is, hopefully, going to let you keep some or all of the money (minus any inheritance taxes) legally. And some of that money can be used to pay the solicitor.\n\nOtherwise, you have a large amount of misappropriated cash which you are not going to be able to 'keep' without money laundering.\n\nI wouldn't really consider going to a solicitor as 'losing' the cash.",
            "Citizens advice can't *do* anything for you, they can only give advice.\n\nThink of it as paying a lawyer to handle it so you no longer need to worry about the money and will just be able to keep whatever you are entitled to.",
            ">  Do you think this would be covered by citizens advice. I don't want to pay for legal advice if I then get money taken off me too\n\nWhy TF would you imagine the money would get taken off you?\n\n\"I have £300,000 in cash but I'm too cheap to pay a lawyer to protect my position and help me keep it.\"",
            "Im not sure but you could try their telephone or web helplines and see? If not they usually do have local solicitor information for the area.",
            " Absolutely. Hence all the worry and s t ress . Mostly from confusion of how he got this money and why me? The only family member I care about is my father and I told him immediately. But I totally get what you mean. Cheers",
            "A human reviewed your comment and removed it from public view. The reason they gave was:\n\n\n**No requesting or offering DMs** \n\nIt is forbidden to solicit private messages as a result of a person's activity in this subreddit. This is to protect all our members from \n\n* Low quality advice\n* Scams\n* Rulebreaking\n* Unlawful behaviour\n\nThe exception to this is the discussion of private and personal matters not related to PF, such as emotional support.\n\n[If you receive a DM as a result of UKPF, please report it](https://new.reddit.com/r/UKPersonalFinance/comments/alhhxp/psa_if_anybody_pms_you_as_a_result_of_a_post_on/).\n\nYou must read the [rules](https://www.reddit.com/r/ukpersonalfinance/about/rules/) to continue to post to our subreddit.\n\n\n\n_If you believe your post/comment has been removed in error, please [message the mods](https://www.reddit.com/message/compose/?to=/r/UKPersonalFinance&subject=Please%20review%20my%20post&body=https://www.reddit.com/r/UKPersonalFinance/comments/1dlaz8l/-/l9nncx5/) explaining why._",
            ">  a pretty high end estate specialist for this.\n\nHugh James then, if OP wants to contest with the other members of the family.",
            "OP has £360,000 in cash, there's no way he's getting legal aid.",
            "Because without a will the money is part of the estate and doesn't belong to op.",
            "Thanks again for taking the time",
            "I mean he found 360k it's not actually his",
            "Legal Aid isn't available for this anyway,anyway  regardless of means."
        ]
    },
    "Mortgage too high but living in house short term": {
        "title": "Mortgage too high but living in house short term",
        "score": 3,
        "url": "https://www.reddit.com/r/UKPersonalFinance/comments/1dlrmfz/mortgage_too_high_but_living_in_house_short_term/",
        "content": "Hi all. I wrote a post a couple of days ago about having a 3100 mortgage a month on a house we would buy for 720. Our monthly expenses come up to 6500 and our joint income is 8000. General consensus is that the mortgage is very high considering it is a 35 year term and taking that much out does make me worry. However if we live in the house for apptox 8 years of the 35 year term and sell it afterwards does this change the situation? I.e. we can just about afford it now but it comes with huge lifestyle sacrifices but I'm worried how this changes when we have children etc\n\nEdit: the other expenses are as follows \nTravel: £680\nBills: £500\nFood: £600\nCouncil Tax: £220\n\nThis doesn't include other outgoings, going out, gym fees, needing to upgrade car, house or life insurance and then any other income going into savings",
        "num_comments": 32,
        "comments": [
            "No one knows.\n\nIn 8 years you might be earning twice as much and interest rates might be back at 0.25%, which which case you'll be fine. Or your salaries might stagnate, interest rates could double, and you'll be completely screwed when you try and remortgage.\n\nHouse prices might have doubled, and you can sell and make a nice profit. Or we might be in a recession and you'll find yourself in negative equity.\n\nAnd having children will both significantly increase your costs, and mean that either one of you stops working or you need to pay someone else a lot of money to look after your children for you - neither of which you can really afford if you're that close to the wire.",
            "Can you clarify what your question is? I don't quite follow sorry.",
            "Need a better breakdown of the 3400 and a clear question. On the surface you’re sailing close to the wind but you possibly aren’t depending on the 3400.",
            "Your question doesn't seem any different from the previous one. No one knows what will happen in 8 years. The fact you're stressing about it probably means that 3100 is too high for you personally. Wouldn't bother me but everyone is different.",
            "I wouldn’t be able to sleep with that size mortgage 😂 would be in constant fear of one of us loosing our job, you need a pretty big emergency fund in case the worst happens, probably 20k at least",
            "This is quite inefficient as you're paying a lot of interest on a high value mortgage up front.\n\n  \nAlso it's a lot of stamp duty to pay for a house that you'll scale back from going forward.\n\nPersonally I'd avoid. Take a lower value property and plan to move somewhere larger when you have children.",
            "I’d look at the other £3400 that’s included in the monthly expenses.\nI’m guessing leased cars/holidays/savings are a part of that?",
            "Is the house worth not having(or at least less) holidays, not replacing cars for an extra 3 years, less meals out?\n\nThose lifestyle adjustments would likely covers the difference.\n\nMortgages get relatively cheaper over time due to inflation. (With everything else being equal).\n\nBut as others have said the volatility is in income, house price, interest rates, kids, health, life itself.\n\nPersonally I've found a that being stretched for a few years is worth it. But I've not had a life crisis at the same time.\n\nMake an informed choice, just don't skimp on lifestyle adjustments and get into consumer debt.",
            "Two of you are spending £600 a month on food? £680 on travel? With a further £500 on other bills? Respectfully, that's an insane budget and you should be fixing this before buying neck end of 3/4 of a mil property.",
            "Calculation should look at few things.\n\n1. What is the cost of renting in the same area. And the what is that in relation to interest payments vs. Capital repayment. When you look through that lens, at least you are banking repayment, and interest should be covered if you need to rent the place out or if you move to interest only repayment temporarily (on that note check that kind of mortgage, as you can usually overpay but you have some comfort should things goes south. \n\n2. Earning potential vs interest hikes.\n\n3. Single salary income, what happens if you are without a salary for 6 months.\n\n4. Children are expensive especially in the first 3 years. \n\n5. Make sure the place can accommodate children. If they come along they start taking a lot of space.\n\n6. Feel confident in your decision not necessarily comfortable.",
            "Do you have or plan to have children? If you do, this budget will never work.",
            "I think you may actually be better off renting as you will mostly be paying the interest anyways. \n\nWhy not buy a cheaper house and pay it off in 8 years and then use it to buy another house? You don't even have kids. You do not need to make yourselves miserable! \n\nIt's just weird. Like people on lower income spending 1/3 salary on a car loan.",
            "3100 pcm for a mortgage on 8000 is ok if you have minimal expenses, what the fuck are you spending 3400 pcm on without a child? Anyway, in your position a 3100 pcm mortgage is totally unaffordable imo with 6500 committed spend, if you have a child you would go bankrupt pretty quickly.",
            "I don’t really understand the question but in your situation I’d just buy a cheaper house. You’re engineering a stressful position for yourselves that may drag out for a decade.",
            "I don't want to put you off kids, I love my three, but they are not cheap and get more expensive over time. You need to do some financial family planning.",
            "Am I reading this right? Your expenses are 3100 + 6500 = 9600\n\nYour income is 8000?\n\nIf that’s the case you can’t afford this, you’d be 1600 over budget every month. Although that’s a huge budget so I’m assuming that’s not your situation?\n\nIf the 6500 includes the 3100, then you have 1500 a month spare, and you’ll probably be fine if you don’t go crazy and spend it all…\n\n8 years is a long time, even if it’s a fraction of the 35 year mortgage, what is your plan if one of you loses your job, or can’t work? You mention children, unless you have a great maternity / paternity pay package you’ll be losing income, and need to spend money on the kids (Kids are expensive, really expensive).\n\nDon’t have savings? Do you have a safety net? Could you buy a smaller house and upgrade when you need the bigger house?",
            "You also need to compare it to the alternative. You have to live somewhere and renting at the moment isn't exactly cheap.",
            "Just edited the post but basically the other expenses are as follows Travel: £680 Bills: £500 Food: £600 Council Tax: £220",
            "OP could get income protection insurance which would cover mortgage for 12 months whilst looking for another job if they did get made redundant",
            "Yes, classic example of we can’t really afford it, let’s borrow over a longer term to ‘bring down monthly payments’ but in reality just paying a shed load more in interest. Would make a lot more sense to buy a more affordable place or alternatively cut back on ridiculous expenses.",
            "No so the breakdown is Travel: £680 Bills: £500 Food: £600 Council Tax: £220",
            "5k left over after mortgage payment each month is miserable? Are you a bit slow?",
            "Commenting on Mortgage too high but living in house short term... I read it as the £6500 monthly expenses include the £3100 mortgage.",
            "That’s not the problem here. The problem is the other £4500 that you’ve not accounted for",
            "Pretty sure the max you can get on those these days is £2500 and they are also expensive each month, most of the known companies that used to do those policies pulled out years ago",
            "That only comes to £2,000. What’s the other £1,400 for?",
            "Can you give us a breakdown of the remaining £1400?",
            "Mathematics isn’t a strong suit right?",
            "Yes so it's 6500  monthly expenses ",
            "There are multiple insurers which still offer this as well as sickness protection (so normal illness/injury which stop work short term as well as critical illness too) and it's normally less than £50 per month",
            "Is there a reason why you're not actually providing a breakdown of the expenses despite multiple people asking?",
            "Yes for accident and sickness plenty, unemployment cover is a completely different story and a lot more expensive, that’s providing they would even pay out there’s plenty of terms, for example you have to prove you are looking for work through applications and interviews, they require updated evidence each morning it’s not an easy ride"
        ]
    }
}