{
    "Discussion/Question Thread": {
        "title": "Discussion/Question Thread",
        "score": 412,
        "url": "https://www.reddit.com/r/UkraineRussiaReport/comments/12bwp6n/discussionquestion_thread/",
        "content": "All questions, thoughts, ideas, and what not **about the war** go here. Comments must be in some form related directly or indirectly to the ongoing events.\n\nFor questions and feedback related to the subreddit go here: [Community Feedback Thread](https://www.reddit.com/r/UkraineRussiaReport/comments/128l61i/community_feedback_thread/)\n\nTo maintain the quality of our subreddit, breaking rule 1 in either thread will result in punishment. Anyone posting off-topic comments in this thread will receive one warning. After that, we will issue a temporary ban. Long-time users may not receive a warning.\n\nWe also have a subreddit's discord: https://discord.gg/Wuv4x6A8RU",
        "num_comments": 41374,
        "comments": [
            "Anyone else just want this war to end?",
            "Well, I believe all started because of this: \n\nhttps://preview.redd.it/1s5kukoe3gva1.jpeg?width=540&format=pjpg&auto=webp&s=acf93a1702de93c8057a8c139c2ccab3ec1284ef",
            "Shout-out to the mod who changed my flair from Anti Mods to I love the Mods. I'll keep because you made ma laugh.",
            "This sub needs Priogozhin back. No one can replace his content from challenging Zelensky to a dog fight from an SU-24 to signing boxes of Bakhmut wine in a recently captured underground storage area.",
            "[deleted]",
            "\"Russians are brainwashed by Russian propaganda into beliving that west want to destroy Russia!\"\n\n[meanwhile \"Russian\" propaganda that realy brainwashing Russians into beliving that west want to destroy Russia.](https://www.reddit.com/r/europe/comments/18pwsz8/the_entity_known_as_russia_was_built_on_the/)",
            "Got banned from /r/CombatFootage and suspended from reddit for 3 days for posting ... wait for it... combat footage on the /r/CombatFootage sub BEFORE reddit introduced a rule specifically targeting anything anti-Israel. This site is a joke. Even more so than when the Russian invasion began.",
            "Want to share some personal experience about the state of conscription in Russia.\n\nI am a Russian citizen living abroad. I have an artillery military specialization (doing command post math) and officer rank that I got after completing the military classes and training along with my main math major in a regular civilian university (kinda standard thing in Russia, inherited from USSR). This is not equal to the full military service though.\n\nIn summer 2023 my parents received a mobilization notice for me (povestka). Since I don't permanently live in Russia I can be detached from the service (weird but its the law). I did that legal procedure and came to Russia for this New Year.\n\nLeft Russia normally without any issues.\n\nP.S. Enjoyed my stay. The weather was great",
            "BREAKING: African leaders are on an emergency flight to Moscow with a new peace plan for Shoigu and Prigozhin.",
            "Biden: If Putin wins against Ukraine he is coming for all NATO countries therefore we should admit Ukraine to NATO because Putin will be scared to attack a NATO country.",
            "So a Russian plane was carrying S-300 missiles, but it was shot down over Belgorod.\n\nThe Russian in their evilness, to hide the destruction of the 3-4 S-300 missiles on board decided on a devious plan. They secretly move the 65 named POW that supposed to be exchanged that afternoon (remember that the Red Cross has access to ALL POW, so they can confirm their existence), probably secretly kill them somewhere in Siberia. Dispose their bodies with explosive, then recollect the remnants to spread some over the II-76 crash sites, or return to Ukraine later. Then silent the guards and any observers too, to make sure none of these information will leak out (like how they keep leaking pictures of Russian burnt plane and ship).\n\nYes, the Russian commit warcrime murdering 65 POW that could be exchanged for Russian POW. Halt all future prisoner exchange. Risk global outcry if information of such act ever leak out. Just to justify the loss of couple of S-300 missiles on a downed transport plane.\n\nAnd that theory makes sense for some people?",
            "Thank God we are back. Imagine being downvoted all over Reddit cause I have a different opinion. This place was one of the only neutral ones. We can’t let it die.",
            "Just imagine Prigozhin is just drunk sitting in his tent making angry messages on telegram and the entire Russian state shat itself and stationed tanks in Moscow and Putin fled on his train in reaction to it.",
            "[removed]",
            "UKR TDF Twitter account is really mad at Bild reporter Julian Röpcke \n\nhttps://twitter.com/TDF_UA/status/1667614748542640129",
            "So Wagner has shown that you can march on Moscow with a few thousand mercenaries, unsuccessfully coup the government and still end up with no reprisals. Certainly a good sign for a healthy state.",
            "Two threads have been killed discussing the Kyiv Independent's video about trying to rehabilitate Stepan Bandera's image  \n\n\n[https://www.reddit.com/r/UkraineRussiaReport/comments/14zc3a8/ua\\_pov\\_the\\_kyiv\\_independent\\_was\\_stepan\\_bandera/](https://www.reddit.com/r/UkraineRussiaReport/comments/14zc3a8/ua_pov_the_kyiv_independent_was_stepan_bandera/)\n\n[https://www.reddit.com/r/UkraineRussiaReport/comments/14ys3vu/ua\\_pov\\_was\\_stepan\\_bandera\\_good\\_or\\_evil/?sort=new](https://www.reddit.com/r/UkraineRussiaReport/comments/14ys3vu/ua_pov_was_stepan_bandera_good_or_evil/?sort=new)\n\n&#x200B;\n\nOnce under the \"no advertisement\" rule  \n\n\nSeriously, do you think user /u/AssocialSocialist was actually advertising for the Bandera apologia piece? It seems like we should be discussing how Ukraine's right wing is actively muddying history and cleaning up the image of fascists",
            "[Blinken tried to rewrite the history Babi Yar massacres and got fact checked by Twitter.](https://twitter.com/SecBlinken/status/1707826104759705760)\n\nhttps://preview.redd.it/b3bvvm91yerb1.png?width=590&format=png&auto=webp&s=217b53f9098ca20487b683a6847a10ecdcc0fb0a",
            "https://www.semafor.com/article/11/05/2023/satellite-companies-are-restricting-gaza-images\n\nSatellite companies that made photographs readily available to journalists covering the war in Ukraine are now restricting images out of Gaza, seemingly for Israel’s benefit.",
            "Henry Kissenger is dead and shockingly just about everyone is ecstatic in these divided times. From the Cambodia sub, the Chile Sub, Leftist subs, the default news sub, and way more are happy. Even the Conservative sub has little kindness for him and his actions. Can't say it's not deserved though.",
            "The reporting in this war on some technology matters (especially electronic warfare related) has been god awful.\n\nAs someone who has a couple of engineering degrees, worked in the industry, and follows recent tech advances, I'm incredibly disappointed by what I read as it relates to technology.\n\nRUSI (a legit credible source) normally puts out top notch reports. But in one of their recent publications, they veered into complete science fiction [suggesting that Russia honest-to-goodness cracked 256-bit AES](https://rusi.org/explore-our-research/publications/special-resources/meatgrinder-russian-tactics-second-year-its-invasion-ukraine) encryption. This is as preposterous as someone claiming they've manufactured a rocket that can carry 10 passengers safely to Mars (with return trip!), for only 1 million dollars.\n\nTo put this into perspective, 256-bit AES is good enough for certain top secret NSA applications ([page 28](https://www.nsa.gov/portals/75/documents/resources/everyone/csfc/capability-packages/WLANCPv2.2_20180626.pdf)). The NSA, even thought they should stop snooping on everything, knows a thing or two about cryptography. Also, 256-bit AES is even resistant against [quantum computers](https://crypto.stackexchange.com/questions/6712/is-aes-256-a-post-quantum-secure-cipher-or-not).\n\nIt's fine that RUSI made a seemingly honest mistake (the preposterous claim came from an interview, so they're merely repeating what someone else said).\n\nThe problem, however, is that this preposterous statement is repeated by other tabloids like the [Wapo](https://www.washingtonpost.com/business/2023/06/13/war-in-ukraine-so-far-favors-the-defense/b1d70ab8-09a1-11ee-8132-a84600f3bb9b_story.html): Russia is \"achieving real time interception and decryption of Ukrainian Motorola 256-bit encrypted tactical communications systems.\"\n\nThen, yesterday we get some [random youtube video](https://youtu.be/6qhWPuXpdA4?t=423) repeating this same claim.\n\nI love this quote from Michael Crichton:\n\n>You open the newspaper to an article on some subject you know well. In Murray's case, physics. In mine, show business. You read the article and see the journalist has absolutely no understanding of either the facts or the issues. Often, the article is so wrong it actually presents the story backward—reversing cause and effect. I call these the \"wet streets cause rain\" stories. Paper's full of them.  \n>  \n>In any case, you read with exasperation or amusement the multiple errors in a story, and then turn the page to national or international affairs, and read as if the rest of the newspaper was somehow more accurate about Palestine than the baloney you just read. You turn the page, and forget what you know.\n\n&#x200B;\n\nedit: Bottom Line: be skeptical of claims made in seemingly credible outlets.",
            "Why is [this](https://www.reddit.com/r/NAFO/comments/151edu4/duty_calls_over_on_ukrainerussiareport_the/) even allowed?",
            "The German government just announced that no Taurus missiles will be sent to Ukraine anytime soon.\n\nhttps://www.tagesschau.de/inland/taurus-scholz-ukraine-100.html",
            "We are witnessing the end of an era that lasted about a generation after the end of the Cold War, and the person of the years is... a singer 🤩",
            "For the map enthusiasts: Suriyak has started to edit his online map once again, after 9 days away. \n\nFor now, there aren't any actual posts, but expect to see some in the next day or so once he has caught up.",
            "For the map enthusiasts: Suriyak has made his first post in 10 days, and confirms his online map is now up to date. He'll be making the actual update posts and uploading them to his Telegram over the day, so I'll be making a post about the changes tomorrow.\n\nSome very interesting developments, as I've alluded to in other comments.",
            "There is no one hornier for war with China than Simon Tisdall, the very epitome of the sensible, centrist fanatic who has been a full on Ukrainian supporter in the Guardian for the past year. Looking like Ukr gets one last shot before its allies push it into a dirty peace before too long. One that Zelenskiy was minded to support a year ago before Boris was sent to tell him not to back down. \n\n[https://www.theguardian.com/world/2023/apr/23/truce-stalemate-ukraine-spring-offensive-volodymyr-zelenskiy?CMP=Share\\_iOSApp\\_Other](https://www.theguardian.com/world/2023/apr/23/truce-stalemate-ukraine-spring-offensive-volodymyr-zelenskiy?CMP=Share_iOSApp_Other)",
            "Why do some people call what Ukraine is planning a \"counteroffensive\" and not simply an \"offensive\"? Isn't it only a counteroffensive when the enemy has been attacking and hasn't prepared for defence? I this case, except maybe at Bakhmut, the front is prepared for defense.",
            "To no one's surprise, BBC Verify has [examined satellite images](https://www.bbc.com/news/av/world-europe-66114024) *(Video timecode: 2:08)* from 7/5 of the ZNPP roof and found no evidence of the explosives that Zelensky claimed were present.",
            "Battle for Avdeevka – Close Study\n\nhttps://simplicius76.substack.com/p/battle-for-avdeevka-close-study",
            "What an irony that same people who accuse and criticize Putin for being a dictator and cracking down on his opposition is hellbent on doing exactly the same thing. \n\nAt this point they behave more like a Putin lover than a democratic supporter.",
            "I have a theory. Remember the S-300s that were destroyed recently? So I'm thinking that Ukraine tried to move its launchers closer to deal with Russian planes that were hitting Bakhmut with FAB bombs. But the Russians were ready for this and picked off the launchers with Lancets. Reasonable?",
            "Shouldn't Russia be in possession of video of whatever happened to the dam?\n\nThis is the most high-profile target in the region, wouldn't they be monitoring it 24/7?",
            "What’s the sub for the Russian civil war lmao",
            "This sub seems to be getting successfully overtaken by one-liner comments and aggressive \"bots\". It already feels like a different place. Few months ago it was more balanced, now it feels that the discussion level fell into \"unproductive\" mostly.\n\nIs this a cyclical thing, or are there really hundreds/thousands newcomers that are flooding this sub with...low effort commentary, downvotes, etc?",
            "Italians lit up the Arch of Titus, erected in commemoration of the ruthless suppression by Roman legions of the Jewish uprising in 70 AD, in the colors of the Israeli flag.   \n    \nThe arch depicts scenes from the fall and sack of Jerusalem by Romans on its sides.    \n  \nUnreachable levels of trolling.\n   \nhttps://www.timesofisrael.com/romes-arch-of-titus-lit-up-in-tribute-to-israel/",
            "https://www.pbs.org/newshour/politics/the-biden-administration-once-again-bypasses-congress-on-an-emergency-weapons-sale-to-israel\n\n>The Biden administration once again bypasses Congress on an emergency weapons sale to Israel\n\nWhy didn't they do this for Ukraine?",
            "[removed]",
            "Is there a reason why there is plenty of Russian POV footage on this sub but literally zero (as far as I can tell) on /r/combatfootage? As far as I know, it's not explicitly against their rules. Yet, they only ever have footage of Russians getting hit by Ukrainians but never the other way around. \n\nIf I was conspiracy minded, I'd think some agency was behind this.",
            "The biggest indicator that Prigozhin has actually a shot to be successful is that Putin still hasn't said anything. I personally don't believe it but who knows in this war.",
            "Ok, lets entertain the idea this is only a smoke screen and a 4D psy-op. You marched convoys of your mercenary army from their staging post in Ukraine, up the Russian border. Said convoy surrounds your Southern command, and continue to advance to your capital. Small engagements are done, army aviation looses aircraft, your social and political landscape are in disarray. Your enlisted men and officers don't know whats going on, and just before anything severe breaks, you return to the status quo. What did you accomplish? You trolled the West, the Ukrainians, and your own people? Now you have to march those men back to their staging areas. Congratulations, your theatrics just showed the world how absurd is your political and military sphere are, but don't worry, you sure trolled them!\n\nNow lets look at it from the other point. This was a legitimate insurrection against the MoD. Said insurrection was able to get close to your capital with little to no opposition. Now, your president, who just gave a very ambiguous speech condemning those who are against the motherland, now has given concessions to said mercenary army which will not face any repercussions. Congratulations, you just showed the world you have no control of your government!\n\nIn either case, I can hardly see how the Pro-Rus crowd can spin this in a positive light.",
            "Matthew Chance(CNN) was able to go to St. Petersburg to interview people at the memorial of the death of Prigozhin.\n\nVery cool report. Mixed bag of thoughts on Prigozhin. A woman expressed sadness, said Prigozhin was treated terribly before his death. One Russian man interviewed at the memorial  said he hated Prigozhin but wouldn't comment about who killed him then this man walked off. CNN concealed his identity.\n\n\nThen everything went shit as Wesley Clark was brought on to promptly shit on Russian \"culture\". He said Russian culture embraces brutality. Something about serfdom only abolished in 1800s.",
            "[deleted]",
            "So there's this growing sentiment in the West that Ukraine will have to negotiate. And the focus seems to always be on Ukraine. It's like it all depends on Ukraine going \"ok ok let's stop this now\". But, I'm not sure Russia will be too keen on accepting any kind of ceasefire deal that is not overwhelmingly in their favor. After all, why accept a shitty deal if you can keep the pressure on and inevitably *force* a better deal when Ukraine is worse off? \n\nIn essence, Ukraine's position on the negotiating table would be \"accept this deal or else\". But what can \"else\" mean in this context that would make Russian pursuit of a better deal not worth it?",
            "Lindsay Graham is turning against Ukraine.\n\nNot good for them \n\nhttps://x.com/stillgray/status/1731763533556154865?s=20",
            "One of my Russian friends thinks that one of the biggest mistakes of the West was not creating a new Marshall Plan for post-Soviet countries after the fall of the USSR. According to him, if the USA had helped with a smoother transition of the economy in the 1990s, the economic growth of the 2000s would have been associated with Western investment instead of the strong hand of Putin or any other leader. Russian elites would have continued to be pro-Western, and right now, they would be part of the USA's plan of containment of China. The current conflict might be nonexistent because Russia, together with Ukraine and Belarus, would be moving towards more integration with Western countries. Is he right? Was this scenario possible?",
            "I’ve said it before but I really appreciate the posters in this sub. Pro RU, Neutrals and Pro UA make this a very great sub to understand the war better. We are not perfect but dammit are we so much better than any other sub covering this war.\n\nThere’s a lot of substance here and hopefully we keep it that way. Yes we differ in our opinions but usually both sides share more reasonable & logical posts than any other sub can. Yes it’s a very touchy subject and we are not perfect but I love the engagement. \n\nI also like to thank the mods for handling the bots that try infiltrate this sub. \n\nSlava multipolar world order!!!",
            "Thread:\n\nWhat’s brewing could be worst mass leak since Snowden 10 years ago. “leaked docs appear to go well beyond highly classified material on Ukraine… increasing trove also includes sensitive briefing slides on China, Indo-Pacific, the Middle East & terrorism.”\n\n\nhttps://twitter.com/shashj/status/1644585822472097793\n\nSnippets:\n\n> \"The documents show that nearly every Russian security service appears penetrated by the United States in some way. For example, one entry, marked top secret, discusses the Russian General Staff’s plans to counter [Western] tanks...\"\n> \n> \"One entry talks about the Russian Defense Ministry formulating plans to conduct missile strikes on Ukraine’s forces at specific sites in Odesa and Mykolaiv on March 3,\"\n> \n> Remember incident in Sep w/ a Russian jet firing a missile near a UK Rivet Joint surveillance plane (https://bbc.co.uk/news/uk-63327999)? The docs describe it as a \"near-shoot down\". They also suggest US secretary of defence has mandated that ISR flights maintain 40nm \"standoff\" from Crimea\n> \n> Slides have important USG assessment of Chinese calculus on military aid to Russia: says Beijing would most likely increase scope/scale of materiel sent to Russia if Ukraine \"hit a location of high strategic value or\" or senior Russian leaders. Puts Jan/Feb intel in perspective.",
            "Anyone else get the feeling both sides are waiting for the other to make a big move?",
            "[deleted]",
            "I'm reading some \"not-cheerleading\" twitter accounts who say the Ukrainians are advancing steadily despite the losses and in some areas have reached the second defensive line. Is there any truth in that? \n\nPlease no cheerleading/fanatical answers if possible.",
            "US to provide aid package including more Bradleys and Strykers to replace recent losses - VOA",
            "I did not have Wagner does a \"Rush Moscow\" on my bingo cards. It was more \"Rush Kiev\"",
            "[WAPO : Slow counteroffensive darkens mood in Ukraine](https://archive.li/1evHw#selection-331.0-337.46)\n\n***KYIV, Ukraine — This nation is worn out.***\n\n*For nearly 18 months, Ukraine has stood against its Russian invaders — rallying support for its troops by embracing last year’s battlefield victories in the Kyiv, Kharkiv and Kherson regions.*\n\n*Those wins carried beleaguered Ukrainians through a winter of airstrikes on civilian infrastructure and a brutal and symbolic battle for Bakhmut, the eastern city that fell to the Russians in May.*\n\n*Throughout, Ukrainian officials and their western partners hyped up a coming counteroffensive — one that, buoyed by a flood of new weapons and training, they hoped would turn the tide of the war.*\n\n*But two months after Ukraine went on the attack, with little visible progress on the front and a relentless, bloody summer across the country, the narrative of unity and endless perseverance has begun to fray.*\n\n*The number of dead — untold thousands — increases daily. Millions are displaced and see no chance of returning home. In every corner of the country, civilians are exhausted from a spate of recent Russian attacks — including strikes on a historic cathedral in Odessa, a residential building in Kryvyi Rih and a blood transfusion center in the Kharkiv region.*",
            "[The comedy writes itself.](https://www.reddit.com/r/LoveForUkraine/comments/15qyl7w/just_going_to_drop_a_bomb/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1)",
            "So the 40 babies beheaded news did it's damage. It has been garnered 1 billion views across social media platforms from JK Rowling to Obama. EU wants Elon Musk to give them free hand to silence anti NATO voices. Guys we are entering WW3. Emotions are high everywhere.",
            "So boys, there was [this thread](https://www.reddit.com/r/UkraineRussiaReport/comments/184yhvp/ru_pov_ukrainians_showing_off_their_flags_most/) featuring a woman carrying a white flag and a UPA flag with the Nazi reichsadler. \n\nIt attracted comments like;\n>How can we be sure these are official from a Ukrainian store? Like we’ve seen people from both sides fake this for propaganda reasons.\n\n>who’s to say this wasn’t recorded in Russia? By Russians?\nIs the location easily identifiable?\n\n>So glad to see RealThingsThatHappened.ru at work\n\n>russian propaganda bullshit\n\n\nSo I did some digging. \n\nThe flags in the video can be bought from [here](https://dp.prom.ua/p1919203982-flag-odnostoronnej-pechatyu.html), in the shop the product page feature screenshots form her videos.\n\n49000, st. Yarkaya, 19, Dnepr, Dnipropetrovsk-regionen, Ukraina\n\n[Here](https://pasteboard.co/olcVCCX5gP7U.png) is a screenshot from another video where one of the picture in the shop comes from featuring a Ukrainian flag in the background and a shop sign for WDS, a chain only with locations in [Ukraine](https://wds.ua/contacts/)",
            "So i'm listening to hotline with Putin live. Rhetoric is not changing, \"SMO will be over when we achieve our goals: demilitarization, denazification, neutral status \\[of Ukraine\\]\". Putin also stated that 482k soldiers signed a contract with MoD in 2023 while the goal was 412k so there is no need for second wave of mobilization at this moment.",
            " Deputy Head of the Center for Combating Disinformation of the National Security and Defense Council of Ukraine:\n\n>Those who evade have a lower chance of survival than those who fight  \n>  \n> All those who are now thinking about how to escape - you will not escape to Europe.   \n>  \n> No one will let you into Hungary, Slovakia, or Poland",
            "I remember for the first year of the war or so, there was this obsession with estimating the casualty numbers for both sides.  It was argued over on a nearly daily basis, it seemed like.  All kinds of wild numbers were being thrown around, everyone had their own theories and formulas.  \n\nThese days I rarely see it discussed, though.  I wonder what changed, have the numbers just become so grim that no one wants to talk about it anymore?",
            "I'm looking for a particular video of a Ukrainian squad taking over a house in a small rural village. I believe it was from the first year of the war.\n\nBut the distinctive part of the video is that inside one of the houses, the Ukrainians made close contact with a Russian soldier and as the firefight went on they literally had a dialogue, or rather a shouting match, but not just slurs or insults - I suppose they were trying to get him to surrender, but the Ukrainians were legitimately asking him, I remember their voices being almost distraught, why the fuck he'd come to their country just to destroy it, with the Russian soldier replying almost with confusion why they were fighting back and why didn't they want to be part of Russia? I remember after some back and forth the Russian says something like \"Okay, maybe I see your point.\" (!)\n\nI can't recall how the video ends. \n\nIt was a very strange, incredibly visceral but moving video that showed a snapshot of the  mindsets of individual soldiers on the ground on both sides, and I want to use it for some research I'm doing on the subject.\n\nAny leads with this would be deeply appreciated.",
            "Are ukrainians still in Krynky ? There hasn't been any news about it for a few weeks",
            "just found out r/N_N_N got banned few days ago. RIP.",
            "The crazy failed boat raid on the NPP that Russians talked about actually turned out to be real. At least one of them anyway.\n\nhttps://archive.is/yXGja",
            "The whole \"Donbass Devushka\" affair is crazy. Prominent Twitter account following the war. Turns out it's run by a 37year old woman from Washington State. Formerly a member of the U.S. navy. She claimed through the Twitter account that she was actually from the Donbass region.",
            "RIP /u/pronuclearwar\n\nI guess one could say that's the *fallout* from making that ill-advised bet 😂",
            "I really appreciate this sub. Too date, I haven't found a place where you see both Russian and Ukrainian supporters. The debate here is so much better than the circlejerks.",
            "If I was in the ghettos of Warsaw, and some Nazis were partying outside of the wall, I'll be sure to make the same decision that the Palestians did, they literally called Palestinians \"animals\", like holy fucking shit, and most westerners are just fine with that. They are gonna genocide them, they have been genociding them, a bit ironic that the same People Nazis tried to eradicate became Nazis themselves, settled in foergin land and slowly killing the natives. They will perform the \"final solution\" if they get push back from the land too.\n\nNo wonder why the biggest Isarel enemies are holocaust survivor's.",
            "So Israel seems to be killing Palestinian civilians at an alarming rate with a higher percentage of dead civilians compared to pre conflict population than that of Ukraine. According to the Palestinian Health Ministry, the death toll as of the last estimates from 12 hours ago are at around 1900-2000 dead and this is just one week into the conflict. \n\nIf the west cared about civilians they would apply their sanctions and charges equally. If the civilian death toll rises at an almost linear rate, Israel will overtake the estimate for civilian casualties in Ukraine within the month. This should put Isaac Herzog (Current President of Israel) in line for a ICC warrant and heavy sanctions levied against them. \n\nBut will either of those things happen? \n\nAnswer is a resounding nope, as it has been shown the West can illegally invade territory, break international law, commit war crimes, and forces regime changes without having warrants put out by the ICC or hell having the regular soldier be tried for war crimes (such as the widely publicized video known as [Collateral Murder](https://youtu.be/zYTxuW2vmzk?si=9Wn4HNJkj4QQ2BP0) in which US forces in Iraq (2007) fire upon and murder a group of civilians and journalists who they falsely identified as combatants, no war crimes charges were brought against the perpetrators, only charges were against the guy who leaked the video and other documents to WikiLeaks, without those leaks it would have been swept under the rug with the rest of western war crimes).",
            "2nd top post on worldnews regarding Iran:\n\n\"*This is ridiculous. At what point does this constitute as a direct declaration of war? So you know your enemy is fighting a war with you by funding militant groups that hate you, as not to get annihilated themselves. If its so obvious and widely broadcast, just strike Iran then.*\"\n\nThe irony of this being amongst top post in worldnews",
            "I initially thought that the huge number of 40,000 Russian troops near Avdiivka spelled trouble for the Ukrainian defenders, but it appears I was wrong \n\nThe geniuses at r/Ukrainian conflict [explained in detail](https://www.reddit.com/r/UkraineConflict/s/VJ01zVvYgI) why the 40,000 Russian troops is bad for Russia and no trouble for Ukraine \n\nI feel much more at ease now.",
            "This is the fucking best sub and there's no alternative at all. We have to protect it whatever the cost.",
            "[deleted]",
            "[WAPO appear to have the full story of how the document leak occurred](https://www.washingtonpost.com/national-security/2023/04/12/discord-leaked-documents/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWJpZCI6IjQzNzQ2NzEiLCJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNjgxMjcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNjgyNTY3OTk5LCJpYXQiOjE2ODEyNzIwMDAsImp0aSI6IjFlYmNjMjIyLThlMTgtNGRkYi1iZWFhLTNmNjM3NThhNGY3NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDIzLzA0LzEyL2Rpc2NvcmQtbGVha2VkLWRvY3VtZW50cy8ifQ.Z1JC1YDd7pyUK9L3e1fGs3TvBjtPeo8VLudKFcoP_7E), and it is a good one. For all the chatter about deliberate  disinformation I don't buy it - too much embarrassment for other countries mentioned in the now over 100 docs and would require a huge amount of co-ordination if it was such. Occam's razor would suggest they are real.",
            "What I’m interested in after Bakhmut is the future of Russian offensive operations, and how that shapes up for the rest of the Donbas campaign, and their future ambitions into Kherson, Zaporizhzhia, Kharkov, or lack thereof. Prigozhin has stated Wagner suffers from serious manpower issues now and might look to reshape itself post-Bakhmut, but I simply don’t trust a single word he says. I wouldn’t be surprised if Wagner can lick its wounds and replenish numbers off of volunteers due to its impending propaganda victory, but I’m not sure. I’m not a general and I’m not a political expert, so I don’t know how this plays out.\n\nLuhansk front will come down to that narrow strip of land that Ukraine still controls, the Svatove-Kreminna axis as I think it’s called. It hasn’t moved a lot but I don’t think either side has put much into it. Securing that axis would theoretically allow Russia to move back into Kharkov oblast but I highly doubly they could afford the manpower to do that after pushing through the Ukrainian fortifications on that axis, that’s my guess at least.\n\nGoing off of that, I need to look at the terrain and fortifications of Zaporizhzhia so if anyone can send that to me I’d appreciate it. Russia’s defensive entrenchments past Dnipro probably suggests they don’t have a ton of ambitions to attack Kherson city any time soon, at least I really wouldn’t understand how that’d work if they were planning an offensive here. Really what I’m getting at is if my pea-brained Redditor mind were to guess, we’re probably getting a “boring” outcome of just rinse and repeat defensive battles in Donetsk oblast where Russia aims to get incremental gains and Ukraine wants to drain Russian manpower. I know boring is quite a bad word in that we shouldn’t think of a horrific war in such terms, rather I’m saying that I think it’s the most likely outcome and not super eventful in regards to the other oblasts. \n\nLast part I’ll have on this is where russia attacks next after Bakhmut. Probably Chasiv Yar shapes up to be a really big deal, russia probably tries their luck again in Vuhledar, Avdiivka becomes a second Bakhmut. My question would be does Russia have enough offense capable units for these battles let alone any that could put pressure on the rest of the front?\n\nJust some random thoughts I had tonight, been away from the war news for a few days. Again I’m not an expert so I probably have some bad tales in here that will age poorly",
            "Romanov confirms Surovikin’s arrest:\n\nhttps://twitter.com/wartranslated/status/1674100048911532042?s=21",
            "Honestly what is the point of having neutral tags? No one here is actually neutral and is only used by those blinded by their own bias.",
            "*The Russia Contingency* podcast featuring Mike Kofman and Rob Lee's\n\n> Russia is defending in a highly competent manner along the front. They were caught completely unprepared during the Kharkiv offensive and learned many lessons from that. Southern lines are entrenched at the divisional and even combined arms army level. \n\n\n\n>They're fighting according to doctrine (multiple layers of minefields and trenches, presighted artillery, frontline troops have lots of AT weapons, semi-regular counterattacks, escheloned lines) but employing even more mines than doctrine calls for. They're mixing AT and AP mines, double or even triple stacking AT mines to knock out Ukrainian mine rolling vehicles, and specifically targeting Ukrainian engineering vehicles. They also regularly disperse new mines with their MLRS delivery vehicles, including behind lines Ukrainians have taken, especially roads used to resupply Ukrainian forces. \n\n\n\n> Russia is working hard to mitigate the weaknesses of their lower quality units. They have \"expendable\" troops holding first line trenches and less important areas, bolstered by higher quality units who are holding key parts of the line and used to launch counterattacks. Spetsnaz are being used extensively I'm this role, and are highly effective with ATGMs. By mixing units, lower quality forces are less likely to break. Marine infantry and more highly trained Motorized rifle units are also being used in similar role. \n\n\n\n>The mystery of why Ukraine didn't press Russian forces harder during Kherson withdrawal was answered, it was because Russia used tons of mines there as well. Some of the last equipment that they withdrew were mine-laying MLRS vehicles. \n\n\n\n>Russia is noticeably conserving artillery usage, giving Ukraine a relative but not decisive advantage in tube artillery. Russia still has an advantage in MLRS though Ukraine likely has an advantage in PGMs and long range precision strikes. Kofman stresses that overall Ukrainian fires advantage is *not* decisive and its limited by their supply of munitions from the West. \n\n\n>Ukraine has serious misteps in first days of the offensive, which were costly. Ukraine has a mix of newly raised \"NATO-trained and equipped\" units and more experienced units fighting in the South. The experienced units have taken most of the ground Ukraine has captured thus far. \n\n\n\n>Ukraine's big gamble in this offensive was forming those brand new \"NATO\" brigades. During Russian Winter offensive, Ukraine used highly experienced units like the 93rd Mechanized and 3rd Assault Brigade to hold off the Russian offensive while new brigades were formed. They suffered significant losses and weren't able to rest and refit before this offensive as a result. Unfortunately the newly formed \"NATO\" brigades haven't lived up to expectations and have underperformed thus far. Importantly, the whole units were brand new, including support, artillery, and infantry formations. As such, there's a seeming lack of unit cohesion among these new units and the accelerated training timeline didn't give them enough time to learn capabilities of new equipment or how best to employ them in combined arms operations. \n\n\n\n>The first days of the offensive revealed a number of issues with the new brigades related to reconnaissance of their routes and for their artillery, poor coordination with neighboring units, trouble finding the right targets, problems with engineering, poor coordination with the units whose positions they were taking (i.e. where minefields and terrain features were located), some units got lost at night and others didn't travel down lanes that been cleared of mines. One brigade's advance was apparently delayed by several hours and instead of attacking at night using their superior night fighting capabilities, they attacked at dawn instead. This delay also meant that the Russian units who had been bombarded by Ukrainian artillery were no longer suppressed when they did advance, leading to heavy losses from ATGMs. There was also a lack of a proper \"Plan B\" once they started running into these issues. Most of these problems wouldn't have occurred with more experienced units. \n\n\n> In the first days of the offensive, mines were a problem but the advance was really more blunted by Russian artillery and ATGMs. **The failures of these new units in the first days of the offensive squandered the Ukrainian element of surprise and gave them precious time to react.**\n\n\n\n>Kofman: Ukraine has proven itself highly skilled on the defense, but its struggled offensively the whole war, especially at scaling up operations beyond the company level. This offensive, while using brigades on paper, was handled more as a series of company or reinforced company-level assaults launched largely independent of one another.",
            "Who was it that said \"If you come at the king, you better not miss\"? Priggy was dead meat the moment he marched on Moscow. Died the same way those Russian pilots did.",
            "Thoughts on a Mearsheimer video [https://www.youtube.com/watch?v=t2451jFeZp0](https://www.youtube.com/watch?v=t2451jFeZp0)\n\nFrom a Pro-West/Ukraine POV it will be hard to tolerate, but to me Mr Mearsheimer is very well spoken on this topic, so it is worth it to watch the full 1 hour (ok, with lots of skipping)",
            "We are really really close to having Jim “fukk Ukraine they aren’t getting another dime ever. Ever” Jordan as speaker for the house.\n\nOh yes \n\nWhat would Ukraine do then?\n\nThey wouldn’t have any access to our Tax dollars anymore",
            "[removed]",
            "Funny that both side agree that Avdeevka becoming seccond Bakhmut, but have very different image of what actualy happened at Bakhmut.",
            "JIDF bots are working overtime lol like it matter...the hatred of Israel is reignited in the muslim world for an other 30 year at least",
            "For those who are interested, Simon Schuster, the author of the recent Time article, dispelled rumors that Arestovych was the anonymous source.\n\n[https://www.youtube.com/watch?v=87-l1bRea\\_k&t=3s](https://www.youtube.com/watch?v=87-l1bRea_k&t=3s)\n\n>\"If you carefully read the text, there is no mention of former advisers, nor is there any reference to 'former employees' of the president's office. We are specifically discussing the current advisers of President Zelensky. The term 'former' does not appear anywhere in any sentence.  Speaking of which, Oleksiy Arestovich has not been working in the president's office since the spring-summer of 2022. That was the last time we talked to him. \"",
            "jewish homes being marked in Parish - its Russia! why? because two moldowans who we caught sayd that Russian told them to do it. Are they lying? was he even Russian? does he connected to Russia? who cares, Russia bad.\n\nDagestan Airport - literaly have TG chanel that coordinated where and when crowd need to gather, chanel that belongs to Ukranian politician. Nope, Russian antisemite rhetoric is to blame (of which no one can give solid example).\n\nAnd they wonder why we in Russia dont care about \"evidence\" that west present when they blame Russia for something.",
            "[removed]",
            "I just rediscovered an interesting thread under one of my early posts, where the conversation addresses the Geopolitics of the UA conflict and more... ([recommended reading](https://www.reddit.com/r/UkraineRussiaReport/comments/w4nxn5/ua_pov_zelensky_arguing_with_one_of_azov/ih6g5u9/?context=8&depth=9))\n\n(Ironically this whole conversation was initiated by a comment from our \"special operative\")",
            "[Post](https://www.reddit.com/r/europe/comments/1abvrwy/soviet_soldiers_in_auschwitz_after_liberating_it/) about liberating Auschwitz, [average upvoted comment under it](https://www.reddit.com/r/europe/comments/1abvrwy/comment/kjrae7y/?utm_source=share&utm_medium=web2x&context=3)\n\nYea, something telling me that this hatred run deeper then current war.\n\nOh, and the obligatory [comments](https://www.reddit.com/r/europe/comments/1abvrwy/comment/kjrmew9/?utm_source=share&utm_medium=web2x&context=3) pointing out that everything good in red army was actualy done by Ukranians. Fact that current Ukraine goverment worshiping Ukranians who sided with nazi and destroying monuments to Ukranians who served in red army is never on their mind.",
            "[deleted]",
            "Confirmed with videos, Hamas destroyed 5 Merkava tanks and shot down 4 helicopters. They then captured another 2 Merkava, 14 APCs, and another15 wheeled vehicles with today attacks\n\nAnd Israel response seemed to be bombing everyone and everything.\n\n...which honestly made Russian strike on Ukraine so far seemed so so so much tamed in comparison. Like Russia will shoot like hundred of missiles and Ukraine will reports like 2-3 dead. Then there was a call on Russian 'war crimes' with (unconfirmed) tens of dead civilians. Meanwhile Israel just go 'fked it' and killed couple of hundreds in a morning.\n\nAnd I guess 'someone' can't bring out the argument '*well they deserve it because they vote for their government*' this time around",
            "This Time magazine article on the War and Zelensky is brutal.   It does NOT paint a pretty picture for Ukraine and Zelensky in particular.\n\n [Volodymyr Zelensky’s Struggle to Keep Ukraine in the Fight | TIME](https://time.com/6329188/ukraine-volodymyr-zelensky-interview/)",
            "Every single country in the world has voted at the UN to condemn the US blockade on Cuba except the US, Israel and Ukraine.  \n\nhttps://preview.redd.it/68x2wjsij2yb1.png?width=2560&format=png&auto=webp&s=1387f291cd64bff98765b20f674a8a14b8af4b00",
            "there was AMA at /r/CredibleDefense with an independent journalist in Ukraine and he was asked about conscription.\n\n> The high casualties Ukraine has incurred have forced them to conscript many people who do not want to fight. I know someone who is so scared of being conscripted, that he avoids going outside, and when he does, he carries a can of pepper spray in case draft officers attempt to force him to the local conscription office. There are telegram channels in many Ukrainian cities, that collectively monitor the movement and activity of draft officers, to help warn people when they are handing out draft papers in places like metro stations and supermarkets.\n\n> The people who tend to be conscripted are generally very poor, and hold a great amount of resentment towards draft officers and the upper class, as there have been many reports of wealthy people bribing these officers with substantial amounts of money for fake medical forms that exempt them from the draft.\n\n\n\n\n\nhttps://www.reddit.com/r/CredibleDefense/comments/17obg7f/credibledefense_daily_megathread_november_05_2023/",
            "Its actually sad to see the NATO keyboard warriors being extremely miserable. Many of them think Putin will now come for them. He's just not that interested though. NATO survives beyond this stupid conflict. \n\n\nI won't judge people for mocking them though.",
            "It's interesting to see how PRO-UA react to civilians in Russia being targeted. If you go to certain other subs, you will see the most depraved comments imaginable. Comments about how they loved to hear the panic, in a video where a child is screaming. How more civilians should be targeted and so on.\n\nThis sub is supposedly, according to the rest of reddit, pro-russian and full of horrible people or whatever. But I have never seen anything even close to resembling that kind of bloodlust in here. Not even once and if it ever happened I'm convinced it would be condemned by everyone and removed by mods.",
            "[https://www.youtube.com/watch?v=u2wvWvoS1fM](https://www.youtube.com/watch?v=u2wvWvoS1fM)\n\nHere the  T*he commander of the evacuation squad of the Red Cross Ukraine, Ihor Klymenko is saying litteraly.*\n\n>I support with my \"hands and feet\" the forced evacuation of all civilians from the combat zone, from the front line. \n\nMight be to interest to the army of pro-ukrainians who attacked me yesterday after daring to say, Bakhmut should be forcefully evacuated, in case you want to express your opinion with him too.",
            "[Secret pakistan cable documents US. Pressure to remove imran khan\n](https://theintercept.com/2023/08/09/imran-khan-pakistan-cypher-ukraine-russia/)\n\n> THE U.S. STATE DEPARTMENT encouraged the Pakistani government in a March 7, 2022, meeting to remove Imran Khan as prime minister over his neutrality on the Russian invasion of Ukraine, according to a classified Pakistani government document obtained by The Intercept.\n> \n\nSame US that won't shut up about sovereignty and democracy in Ukraine.",
            "https://preview.redd.it/p2h4jcv9fr0c1.jpeg?width=1284&format=pjpg&auto=webp&s=6d4ed158b1393261b170ff4746a071f5227b9222\n\nHere it comes!",
            "https://www.telegraph.co.uk/world-news/2023/05/03/eu-brussels-ukraine-weapons-arms-building-roads/\n\nEU diverts road-building funds into £1.7bn Ukraine ammunition plan",
            "Rybar's new daily digest format is kinda funny. A long paragraph of \"This, this and this are the main things that happened in this and that area\", and then a single line: \"Also, RAF destroyed a bridge.\" No name, no area, just \"also, a bridge\". Wanna know more? Go to our site and read it there!\n\nWonder if they are going to translate these snippets into English like they did before.",
            "Missile barrage on Kyiv again",
            "[removed]",
            "I think the only viable strategy for Russia is to play the long game, devote all resources to defend the territories it holds so far and wait for the political situation in the west to change, either due to fatigue or due to changes in governments, while at the same time rebuilding its military. \n\nBecause I don't see how else Russia can benefit from this war, they tried to advance for over a year now and the only success is Bakhmut suffering very heavy losses, while at the same time they lost Kherson and Kharkiv. They cannot advance further and the west keeps the supply of modern weapons to Ukraine that would make further successes of Russia even more unlikely.",
            "Anyone got the clip of russian/chechen troops inspecting a leopard and showing ammunition? Seems like it got deleted here.",
            "Who had Wagner beats Ukraine in Bakhmut, then attack Russia on their bingo card?",
            "[deleted]",
            "So, I have no words other than\n\n*WHAT?!*",
            "r/WagnerVsRussia\n\nmost active to dead subreddit record.",
            "Getting info about this war is significantly harder with this idiotic Twitter update",
            "Nato has proclaimed what will happen in the event of The Great Ukrainian Victory (it will become part of Nato, as is commonplace when expansive defensive alliances expand their sphere of influence). But what will happen if the Great Ukrainian Victory doesn't show up? Those kids are almost talking like a Ukrainian defeat is one of those famous \"red lines\".",
            "How do you think it is possible to end the Russian-Ukrainian war?  In addition to the victory of one of the parties by force or surrender.\n\nI am from Ukraine, one of my grandfathers is Jewish, the other is Russian, one grandmother with Polish roots was almost killed by Bandera, and the family of another grandmother was dispossessed by the Bolsheviks and deported from near Kiev to the Caucasus.  \n\nIt is difficult for me to take one of the sides, and I am looking for ideas for a non-military end to the conflict.  \n\nPlease give your opinions, I will be glad to provide links to historical facts.",
            "Official statement of the Ministry of Defense of the Russian Federation\n\n>From July 20, all ships in the Odessa region and the remaining coast of Ukraine will be considered as military targets.\n\nGood News:\n\nRussia will replace Ukrainian grain in the food market both commercially and free of charge to the poorest countries - President Putin",
            "The messaging on this new offensive is so weird, it will be interesting to see how it's shaken out in a week or two.  \n\nRight now you have lots of videos of UA convoys getting decimated, yet you have the pro-UA claiming they're winning and breaking through off camera and that Putin is lying about them being beaten back.  It's like two completely paradoxical narratives and I can't wait for the curtain to be pulled back and see what the reality on the ground is.",
            "interesting photo -  https://i.imgur.com/xooWXlo.png, this is what the Lancet looked like in 1946, this is the Soviet SB-1M TV-guided drone",
            "Despite Ukrainian deputy defense minister Hanna Maliar's claim that Ukrainian forces had broken through the Surovikin line, Pro-Ukrainian map resource DeepstateUA shows that Ukrainian forces have been marginally pushed back from the Surovikin line in the Robotyne area.",
            "Interesting fact: I noticed quite recently in my 1m population city in Russia army recruitment posters in all stores/supermarkets that I regularly visit changed to just simple army propaganda posters without any contract recruitment info.\n\nCan anyone report anything similar in their locations in Russia? (I understand the irony of asking this question on reddit in english, but still, I wanted to share that little tidbit and ask if anyone noticed anything similar.)",
            "\nJulian Röpcke(Bild): Ukrainian mappers say, the assault on Novomayorske in Western Donetsk oblast failed and Russians regained the positions, lost in early September.\n\nhttps://twitter.com/JulianRoepcke/status/1704821389847355510",
            "I was just thinking... What are we gonna do when this war ends? What will happen to this sub? Will it just stop functioning? Are we going to throw a party? Will we feel happy and saddened and melancholic at the same time? Will we miss those good old days of arguing on the sub? Will we tell our grandkids about the best memes from this sub? Will we come here from time to time just to reread the best threads? Will we then troll some old comments that proved to be wrong? Will we suffer from PTSD after this war (and war in comments)? Maybe the whole point of it was the friends we made along the way...",
            "Can someone recommend me where I can read/listen/watch OBJECTIVE stuff on whole Palestine/Israel history. I'm completely noob in this matter.\n\nMuch appreciation.",
            "Is there a similar sub,* but for Israel-Hamas war.  \n\n  \n*with multiple POVs",
            "Israel just ordered 1.1 million to be evacuated in 24 hours just to justify their killing later.\n\nLike honestly. Just think how fked up Hamas is, killing all of these innocents enmass. And then think how fked up it is. For them to still kill less than 'the good guy' Israel.\n\nLike imagine if Russia tell Ukraine to evacuate all civillians from Kiev, just so they can flatten it to the ground. All of us here will be like 'what the fk are these Russian thinking'. But apparently here we are",
            "[https://x.com/therecount/status/1712849145197633638?s=20](https://x.com/therecount/status/1712849145197633638?s=20)\n\nGoP is now entering cosplay mode\n\n “\\[Rep. Rashida\\] Tlaib has her flag, I got my uniform.”  — Rep. Brian Mast (R-FL), when asked why he’s wearing an Israel Defense Forces uniform to the GOP conference meeting today.",
            "[https://www.realnilubny.com.ua/ru/uklonenye-ot-pryzyva-na-voennuyu-sluzhbu-prygovor-zynkovskogo-rajsuda-otmenen/](https://www.realnilubny.com.ua/ru/uklonenye-ot-pryzyva-na-voennuyu-sluzhbu-prygovor-zynkovskogo-rajsuda-otmenen/)\n\n>On appeal, the Dikan District Prosecutor's Office canceled the verdict of the Zinkovsky District Court, which acquitted a resident of the Poltava region for evading conscription for military service during mobilization (Article 336 of the Criminal Code of Ukraine). This was reported by the press service of the Poltava Regional Prosecutor's Office.\n\nZelensky needs your life. Go and die",
            "From November 19th to the 23rd, Ukraine is anticipating a significant drop in temperatures. \n\nThere have been speculations that Russia might be strategically waiting for sub-zero temperatures to launch their missile campaign, as suggested by Ukraine. If this assertion holds true, we could potentially witness the beginning of the missile campaign next week. Initially, I thought it might have started in October, around the same time as last year, but that hasn't materialized.\n\nIt's important to note that Russia's commitment to such a campaign is still unconfirmed, despite various indicators pointing in that direction.",
            "It would be nice if we had more people here from Ukraine and Russia.",
            "https://www.reddit.com/r/SlavaUkrayini/comments/18rwfaw/im_apparently_a_liar_a_fake_but_i_have_secured/\n\nBearhunter continues to try to prove to everyone he's not a fake.",
            "Since the early 1980s when Pres. Reagan began the Strategic Defense Initiative \\[aka Star Wars defense\\] to develop defenses vs ballistic missile attacks,  I've casually followed the results.  Several  physicists remarked that intercepting ballistic missiles was far, far beyond present tech,  and that it was a near-impossible task.  The  physicists  likened the attempt to intercept these missiles as trying to \"hit a bullet with a bullet\".  \n\nAfter billions and billions spent,  40 years later,  intercepting ballistic missiles is still only a dream...From pro-UKR ISW: \n\n  ***Ukrainian forces notably did not intercept any of the*** *Kh-22/Kh-32 missiles, ballistic missiles (S-300s and Iskander-Ms), Kinzhal hypersonic air-launched ballistic missiles (Kh-47s), Kh-31P anti-radar missiles, or Kh-59 cruise missiles that Russian forces launched on December 29, which suggests that Russian forces have been able to successfully apply some lessons learned about effective strike package combinations and that the Shaheds that preceded the missiles may have distracted Ukrainian air defenses or otherwise enabled the strike.*",
            "https://www.theglobeandmail.com/politics/article-prime-minister-invited-waffen-ss-veteran-hunka-to-his-official\n\nPrime Minister Justin Trudeau invited Yaroslav Hunka, the Ukrainian Waffen-SS veteran who received two ovations in the House of Commons during a visit by Volodymyr Zelensky, to a reception he hosted in the Ukrainian President’s honour the same day.\n\nMr. Hunka did not attend the Toronto reception, but his invitation by the Prime Minister to the event with the Ukrainian President has raised fresh questions about who approved the Waffen-SS veteran’s attendance, and if his background had been checked.",
            "**A Ukrainian man tried to escape the country**\n\n>A Ukrainian man tried to flee to Romania, but could not swim across the Tisza River and drowned, — Ukrainian State Border Service. \n\n>\"Romanian colleagues informed the border guards about the deceased. He turned out to be a citizen of Ukraine, born in 1982, a resident of the Kharkiv region,\" — the border service writes.",
            ">In Spain, Russian Maxim Kuzminov, who hijacked an Mi-8 helicopter for the Ukrainian Armed Forces in August 2023, has been found dead.\n\n>A representative of the Defence Intelligence of Ukraine commented to Ukraнinska Pravda on the murder of pilot Maksym Kuzminov:\n\n>\"He decided to move to Spain instead of being here. From what we know: he invited his ex-girlfriend to his place and was found shot dead\".\n\n>The intelligence official added that a burnt-out car was found nearby, which was probably used by the liquidators.",
            "Honey, wake up -- new schizo post just dropped\n\nhttps://www.reddit.com/r/foreignpolicy/s/zu8Lxt9ELB",
            "To be fair the news have been going slow lately too.\n\nThe emotional time due to the terrorists attack passed, and now everything sorta slowed down. Russia still take a village here and there. And bomb Ukrainian power infrastructure, which sorta expected results of all of Ukrainian refinery strike (Not to mentioned Belgorod(?) shelling). But nothing major\n\n  \nThough, all of the masks trying to be civilised and contain the conflicts, slowly come off one by one. Gaza war should remind people how much uglier this war could be. But many don’t want to see it",
            "Is there a statement about what happened last week and what has been happening?\n\nThis sub is pretty important to alot of people. I see so many comments that resonate with me from people that missed it last week.\n\nIf there's anything that we can do to help do tell us please.",
            "Do you expect Russia to bring forward its alleged major offensive before Ukraine gets more American supplies?",
            "Apparently the News agency here in my country said that Ukraine apparently shot down the Russian Su-25.\n\nI can smell something fishy but do you guys got anything on that? Even Fighterbomber didn't say anything about it.",
            "I have a legitimate question for some military tech fanatics.\n\nHow exactly would the US military deal with the FPV drones and other \"birds\" when compared to the Russian Army? The Russian army does have electronic warfare capability, as [Ukraine is apparently losing 10,000 drones a month ](https://www.forbes.com/sites/davidhambling/2023/05/22/ukraine-drones-losses-are-10000-per-month/?sh=5cdd6437384a)to jamming, but how would the US military be different in this sense?\n\nAt face value, it seems like FPV drones are one of the most effective weapons of the war for both sides, and it would seem that the next enemy (likely Iran) that the US would face would use swarms of these things. How would they counter it?",
            "Suriyak updates soon.\n\nhttps://preview.redd.it/qpdkzffw7y6d1.png?width=510&format=png&auto=webp&s=89de0191f2526720d0625f844ff2d01c4951255a",
            "When was the last evidence of any partisan activity in any of the purple-highlighted patches on the ISW map, in particular the giant blob over Tokmak?",
            "What kinda partisan warfare you think is going on in this lake? (per ISW)\n\nhttps://preview.redd.it/r07syihy3n7d1.png?width=2293&format=png&auto=webp&s=ce684f556ebd543060c91a8de9acb67649463840",
            "[deleted]",
            "[Yevgeny Prigozhin's recorded statement in support of, what he calls, the liberation movement in Niger.](https://twitter.com/DD_Geopolitics/status/1687147606965903360) \n\n> 💬 \"I will answer what is the basis for the change of power in Nigeria. The basis is the economy. The population of Niger has been driven into poverty for a long time.\n> \n> For example, a French company that extracted uranium sold it on the market for $218, while paying Niger only $11 for it. You can work with investors on a 50-50 or 30-70 (%) basis, but it's impossible to give back to the indigenous people of the country, who were born in this country, who live in this country, and who expect that the natural resources of this country belong to them, and according to the Constitution, they belong to them, only 5% of the wealth you receive.\n> \n> To cover up these economic crimes, the country was saturated with a huge number of terrorists. This enormous number of terrorists, theoretically, should have been controlled by a vast number of different troops, financed by the UN, the European Union, Americans, the British, and others. As a result, the population of Niger, which should have been free and happy due to the economic opportunities in their country, was robbed, and to keep them silent, they were kept in fear for decades.\n> \n> To show that these thieves and plunderers are needed in the state's territory, I mean Western countries like France, the USA, and so on, crowds of soldiers were sent there who did nothing but received enormous budgets that were also embezzled at various levels. That's why the transformation in Niger was simply necessary.\n> \n> The power that was in league with Bazoum (ousted president) and his followers, simply covered up, allowing the coalition of people who plundered the nation to be present in Niger's territory. That's it. Therefore, this is a liberation struggle, a liberation movement for the independence of this country, and God grant them success.\"",
            "The amount of political intrigue coming out of Ukraine today and yesterday is quite high.",
            "Funny seeing all the NATO propagandists who were crying about Russian genocide for over a year are chomping at the bit over Israel carpet bombing Palestinian civilians in Gaza.\n\n[Flattening entire high-rise residential buildings is now okay when the west does it.](https://twitter.com/muhammadshehad2/status/1710692593212829753)",
            "The Times article talking about Zelenskys pessimism and Ukraines corruption has just been removed from r/anime_titties with the nebulous excuse of [being covered by the megathread](https://www.reddit.com/r/anime_titties/s/UIbP1jyCru)\n\nThat's their catch all excuse for removing articles they don't like, but which didn't break the rules.\n\nNaturally, it was removed from r/Ukraine as well.\n\nNow, NAFOids have begun to spread propaganda that Arestovich was the official the author interviewed, so as to discredit the article.\n\nThey are also attacking the authors ethnicity and calling him a Kremlin asset.\n\nFascinating to observe.",
            "We, who have been studying history and geopolitics and modern conflicts, have been talking from the beginning about the hypocrisy of the West and the double standards being applied to Russia. \n\nAnd many pro UA back peddled and said \n“We are against all war! All invasion! All civilians are precious! Law and order! Geneva convention!” \n\nAnd suddenly, the war in Palestine broke out and all of that went out the window. \n\nThe hypocrisy was exposed as day and night. \n\nThe same exact leaders and media outlets and influencers and individuals that were decrying these things suddenly have turned to\n\nYou have collateral damage…\n\nIf you fuck around, you find out…\n\nMight is right…\n\nIf you lose a war, you lose the land…\n\nAll targets are valid in a war zone…\n\nIt’s actually complicated and you have to know the history and both sides. \n\nHmmm. \n\nWhat happened to the mythological David vs Goliath? \n\nWhat happened to Gondor and the fight against the orca? \n\nWhat happened to the war between good and evil? \n\nMaybe it was never about human rights. \nOr SOVEREIGNTY. \nOr “international law”. \n\nMaybe it was, like those of us who are educated, have said from the beginning. Another geopolitical fight between global powers. \n\nAnd the end, those like Mearsheimer were proven right. And realpolitik was the correct analysis. \n\nSo if you support civilians in Ukraine but not civilians in Palestine. \n\nIf you condemn Russia as a terrorist state but do not condemn Israel as a terrorist state. \n\nThen know that you are not about human rights and international law. \n\nYou are supporting the Western empire and Western neocolonialism. \n\nSo perhaps we finally see that Nazism and Zionism are two faces of the same coin. And we can understand why Zionist Jews in Ukraine fight alongside Nazi battalions. \n\nBecause they both came out of the last century hyper nationalistic racialists movement of “every race has its homeland”. \n\nAnd for Germany, it was the Aryans. \nAnd for Zionist Jews, is it Israel. \n\nAnd the ultra nationalists Ukrainians followed that ideology and said “Ukraine for racial Ukrainians, not for USSR”.  \n\nSo support the side you want but know your history and know the consequences of what you are doing. \n\nIf you want a truly multi racial and multi ethnic and multi polar world build upon consensus and equality and equity and human rights. Then you cannot support apartheid and Neo colonialism and ultra nationalists. \n\nYou have to speak to Justice and truth no matter what side is fighting.",
            "https://i.imgur.com/tS95XDO.jpg\n\nhttps://i.imgur.com/9MHIJGZ.jpg\n\nlmao",
            "Wow, really have some wild 5d chess takes going on here.\n\nDo people actually think Putin would willingly allow himself to look this weak in front of the entire world?",
            "Poor /r/CombatFootage mods are too busy removing videos of slaughtered Israeli soldiers.",
            "IOC:\n\n\"discrimination against Israelis is unaceptable, atlets cant be responsible for actions of their goverment\"\n\nHoly f\\*cking sh\\*t",
            "Well we’ve seen the new year in over here in Australia. Here’s hoping for a 2024 that brings peace to Ukraine and Russia, two nations that have each contributed so much to world culture. And hopefully an end to the hot and cold wars that are holding us all back globally and leading to so many needless deaths.",
            "[deleted]",
            "Amongst the leaks included a map plan of Ukraine's air defences and \"consolidated air defence\" network planned to protect Front line forces, critical infrastructure and population centres.\n\nAccording to the report:\n\nSA-10 (S-300) and SA-11 (BUK) comprise of 89% of Ukraine's AD medium/high range.\n\nBUK will be depleted by 31st March 2023\n\nS-300 Will be depleted by 02 May 2023.\n\nhttps://twitter.com/War_cube_/status/1644390191627370498?t=RRz5f0ulMfmoFXCp4w1NnA&s=19",
            "To no one's surprise, Wagner got the ammunition it asked for:\n\nhttps://t.me/remylind21/1649",
            "Just now I've learned that there is a rumour that Zaluznyi may have been killed about 2 weeks ago, and that is why he's nowhere to be seen. Granted, it could also be explained by him simply hiding from a strike that could kill him. It's an interesting situation either way.",
            "People need to stop cramming narratives into titles. Like actually cramming, a narrative following the POV is fine, helps the post make sense, 2 or 3 is just being unhinged.",
            "I believe that this offensive will be remembered for s long while.\n\nAfter 80 years. Russian military is in a old school fight against the west.\n\nThis was avoided during the entirety of the cold war.\n\nThis is a traditional battle. Both forces are full on. No guerrilla warfare, no insurgents. Force on force.\n\nI now convinced that until Artillery is suppressed(by some hypothetical super trophy system) the most effective form of advancement will be incremental supported by precise logistical strikes.",
            "A very interesting interview with a German who fought in Ukraine. \n\nWhat is this subreddits view on Willy OAM? \n\nhttps://youtu.be/SCcqxPUuYnw",
            "It's hard to imagine that Prigozhin can stage a successful coup after Putins speech, unless he was able to cultivate an impressive network during the war. Well in any case, Ukraine wins.",
            "So how do people see this play out? I reckon it will be similar to what we saw in 1993. \n\nI pray that Russia does not fall into civil war. A nuclear armed state at civil war would be very very bad for pro ru and pro ukr alike.",
            "One has got to admit, the fact that Wagner's managed to pull their stunts overnight is an impressive level of coordination.",
            "I can’t exactly put my finger on it, but something seems fishy about this whole business. Not that it’s some sort of next-level psy-ops, but there’s just really something off about everything with Wagner right now and something off with the Russian military (e.g. it’s well-established they have a lot of men not on the frontline, so what’s up there?), and I think that Ukrainian-leaning media in the West is probably fanning the flames of this on purpose. I don’t know what’s going to happen with the situation of with the Chef, but I have a very strong feeling that Putin’s still going to be running the game in a few days and that fighting on the frontline will continue as it is.",
            "Where's the convoy? They were supposedly 200 miles away from Moscow over 4 hours ago.\n\n Is there a good English livestream to follow (preferably on youtube)?",
            "What's gonna happen to Girkin now? He got a bit ahead of himself and trashed Putin. Lol. Oh man, Prigozhin let down a lot of people.",
            "Little reminder for the many people who are disappointed that Putin wasn't ousted:\n\nPundits said nothing could be worse than Saddam Hussein in power. They said the same thing about Gaddafi. \n\nDo a little research on the so-called \"experts\" about regime change and you'll find that some of them supported the removal of those dictators.",
            "Russia: \"Ukraine is about to blow up this nuclear plant.\"\n\nUkraine: \"Russia is about to blow up this nuclear plant.\"\n\nMe: 😐",
            "As the disgraced Aussie performer Rolf Harris used to say \"Can you see what it is yet\". \n\n*In January this year, addressing the participants of the meeting of the National Association of State Chambers, Zelenskyy described American business as the “locomotive that will once again push forward global economic growth”. No one would blame Zelenskyy for choosing the lesser of two evils here: Western banks over Russian tanks. Yet, the grim fact remains that even if his nation succeeds in repealing the Russian invasion, the future in store for Ukraine is not necessarily one of sovereignty and self-determination but, most likely, one of Western economic tutelage.*\n\n[https://unherd.com/2023/07/the-capitalists-are-circling-over-ukraine/](https://unherd.com/2023/07/the-capitalists-are-circling-over-ukraine/)",
            "[After Suffering Heavy Losses, Ukrainians Paused to Rethink Strategy - NYTIMES](https://www.nytimes.com/2023/07/15/us/politics/ukraine-leopards-bradleys-counteroffensive.html)\n\nIn the first two weeks of Ukraine’s grueling counteroffensive, as much as 20 percent of the weaponry it sent to the battlefield was damaged or destroyed, according to American and European officials. The toll includes some of the formidable Western fighting machines — tanks and armored personnel carriers — the Ukrainians were counting on to beat back the Russians.\n\n>Some of the improvement came because Ukraine changed tactics, focusing more on wearing down the Russian forces with artillery and long-range missiles than charging into enemy minefields and fire.",
            "Any news about Klesheevka situation? Yesterday it was like UA attempting a huge push there, but today didnt see any news from there.",
            "Any news from the alleged massive push of the counteroffensive? \n\nHaven't really seen anything since it was annoucned yesterday. Russians said they've crushed it but neither side has really published anything credible so far.",
            "[deleted]",
            "Why isn’t Russia propping up the value of the ruble anymore?",
            "[“Russian companies inflate transportation costs to ease G7 oil price caps”: **Financial Times** admits that the Russians again deceived everyone and earn much more from oil than the West thought.](https://archive.ph/4TW8Q#selection-1581.0-1587.63)\n\n*“Russian companies are making much more profit from the sale of crude oil than previously thought, thanks to inflated shipping costs. Fees rose by more than $1 billion in a single quarter, according to Financial Times analysis.*\n\n*Oil producers in Russia have been selling crude oil to India at below $60 a barrel, which was imposed by Western countries in an attempt to limit the country's key source of income.*\n\n*But when you factor in shipping costs, they and the traders they work with charge much higher amounts.*\n\n*An analysis of ships sailing directly from Russian ports in the Baltic to India indicates that this is overpricing. Combined with commissions earned from transporting oil on ships linked to Russia, that could add up to $1.2 billion in the three months to July.*\n\n*James Cleverley, British Foreign Secretary, said: \"It is not surprising that Putin is becoming increasingly desperate and dishonest in his attempts to soften the effects of the price cap - something that has severely curtailed Russian revenues since its introduction.\"*\n\n*The price cap, imposed by 67 countries, is designed to keep Russian oil flowing while curtailing revenues that could be used to fund the war. But the restriction, which imposes requirements on buyers, shipowners and insurers from participating countries, does not impose any restrictions on the cost of transportation.*",
            "Apparently the Russian central bank has had an emergency meeting to raise interest rates in reaction to recent news that Russian inflation has climbed from an anual average of 4.4% over the last year, to [7.6%](https://www.cnbc.com/amp/2023/08/15/russian-central-bank-jacks-up-interest-rates-to-12percent-at-emergency-meeting-after-ruble-plunge.html)(bumped up by a surge in inflation in the last 3 months).\n\n7.6% is admittedly a high result but increasing interest rates to the current 12% seems quite high. In most countries such rates would severely impact things like house purchases (higher rates = more expensive to get a house loan) and reduce consumption (higher bank interest rate = more attractive to save money instead of spend it).\n\nPersonally I'd say 12% is unnecessary, but if there are genuine concerns in Russia about price inflation for core goods like food, and fuel, then it would make more sense.\n\nBut I was under the impression that price inflation in Russia hasn't really been in essential goods but more like luxury goods.\n\nCan anyone here living in Russia corroborate this? Apparently \"core inflation\", as reported by the Russian ministry of finance in the last 3 months rose 7%, which is significant, but is this true? Do you guys see basic necessities prices climb?",
            "Just another psyop downing with the Wagner plane. Man Putin and Prigozhin really are 6D chess masters.",
            "Q. Are you able to forgive?\n\nPutin: Yes, but not everything.\n\nQ. What is it impossible to forgive?\n\nPutin: Betrayal.\n\nInterview from 2018: https://twitter.com/parfitt_tom/status/972896704650530816",
            "[deleted]",
            "[deleted]",
            "I find the situation with the US soldier who went AWOL and fled to North Korea kind of amusing.\n\nNK is like \"Americans- if you ever want to see your soldier again, we demand that...\"\n\nUS: \"Yeah he sucks, do whatever you're gonna do.\"\n\nNK:  \"(sighs) ok fine, just take him...\"",
            "[deleted]",
            "&#x200B;\n\nhttps://preview.redd.it/449vacqdihrb1.png?width=670&format=png&auto=webp&s=87ea29f144d8fc01a73bdacb11d964d973d55929\n\nI really don't know how to answer this Q? Is this something from the Mods?",
            "Another great take about the Palestinian issue from [Norm Finkelstein](https://www.youtube.com/watch?v=G12Z0td-Nqo&t=602s)",
            "Zelocaine, future head of EU or NATO\n\n>“Am I scared assistance will decrease? There are risks because of all those reasons you described, but that’s not just a risk for Ukraine,” he said. “If you don’t help Ukraine, Russia will gain power and the war will not end, Russia will move forward in EU countries. The cheapest option for everyone is stop warfare in our country and to get them out of our territory.”\n\n>He said Russia would move to exploit the conflict in Israel because its interest was “permanent destablisation” and “decreasing assistance to Ukraine”.\n\nhttps://www.theguardian.com/world/2023/oct/11/volodomyr-zelenskiy-fears-hamas-israel-conflict-hit-military-aid-ukraine",
            "DeepstateMap (pro ukrainian) on the situation in avdeevka;\n\n> Avdiivka section - the enemy is advancing west of Krasnohorivka (A), coming close to the railway line. At the same time, the Katsap vanguard is trying to gain a foothold on the western side of the railway. The fighting continues. The map change shows the dynamics over the last 4 days. The enemy has stopped using equipment and is simply overwhelming us with manpower, like the Soviet army somewhere near Rzhev.\n\n>Analytical note: The situation near Krasnohorivka (A) is extremely difficult. Katsaps continue to put pressure on the west. The spoil heap was probably lost a couple of days ago as well, but let's wait for more accurate information. The enemy has enough reserves and will continue to throw manpower at our positions. It happens that a team of two soldiers is attacked by two dozen f**ks and it is almost impossible to survive or fight back. Our reconnaissance and artillery do their best. Katsap is being watered down with a cassette tape, but this does not affect the intensity of the personnel's involvement. Despite considerable losses, the enemy does not stop and does not spare its infantry.\n\nSeems like ukraine has issues deploying reserves? Otherwise I dont understand why they defend their positions with such few soldiers.",
            "China expresses strong protest to the United States in connection with American sanctions against some Chinese companies due to “support for the Russian military-industrial complex”; the United States is undermining “international order and rules in trade”\n\n— Ministry of Commerce of the People's Republic of China\n\nOn November 2, the United States imposed sanctions against 130 individuals and legal entities from Turkey, China and the UAE",
            "*\"American bases in Iraq and Syria have been hit by pro-Iranian forces at least 40 times since October 17.\"*\n\n***\"Are we hearing an official statement that Israel has nuclear weapons? Where are the international organizations? Where is the IAEA Where are the inspectors?\" - Russian FM spokeswoman Zakharova***\n\n**ISRAEL TOO SAVAGE TO OWN NUKES is basically what Russia is saying following mad REQUEST to DROP NUCLEAR BOMB on Gaza Strip by Israeli minister, stressing that the threat raises \"huge number of questions about Tel Aviv's possession of such arms\"**\n\n*\"We have requested an urgent open meeting of the UN Security Council in connection with today's attacks by the Kyiv regime on Donetsk.*\n\n*We expect that it will be scheduled for 23.00 Moscow time on November 8.\"*\n\n\\-First Deputy Chairman of the Russian Representative to the UN Dmitry Polyansky",
            "Whatever happened with Sokolov? The Ukrainians claimed he died, Russia had a zoom call a couple days later, and then the whole thing seemed to be forgotten. \n\nHas there been a recent meeting of the Russian commanders since, with vids?",
            "[Interesting interview with UA officer, UA POV.](https://censor.net/ru/resonance/3453607/komandir_roti_47_brigadi_mikola_melnik_rosyani_znali_nash_shlyahi_visuvannya_tudi_letlo_vse_152t_120t). About training, counteroffensive \nSome quotes: \n\nfirst you are an assault regiment and learn to storm houses. Then they say: you are a mechanized brigade, and give MaxxPro, which you see for the first time in your life. They put grenade launchers, it seems, MK-13, and you don't understand how to put them. And then they take everything away from you, and give you \"Bradley\", but you also have to go to study at them. That is, three learning processes actually took place, people passed three ~~KMB~~ military courses. Of course, they \"burned out\". \n\nHow is the training for BMP in the Ukrainian army? \"Children, here's the BMP, only we won't start it, because there is no ~~solar power~~diesel fuel. And here is the cannon, but we won't shoot, because there are no cartridges. And in general, don't touch anything with your hands, because it will fall apart. We'd better practice landing - that's all.\" \n\nThe Americans lost their minds and did everything that we need to storm. The only thing that was not foreseen was mine landings. \n\nThe whole plan of the big counteroffensive was based on simple things: a Muscovite sees \"Bradley\", \"Leopard\" - and runs away. ~~All~~That's it. \"Guys, you're going to wind them up there\"!\n\nYes, it was chaos. Due to this chaos, some companies finished in 15 minutes, some - in 30, other brigades generally demonstrated \"records\". \n\nYou know, I have a family of \"anti-Soviets\": some were in the Hitler Youth, others in the UPA. And everyone met in Siberia, ~~from this~~  so my mother was born there.\n\n\n EDIT fixed translation mistakes",
            "I have been playing around a bit with the lost armour map which geolocates ukrainian losses, and oddly enough, they show a ukrainian T-64 tank destroyed in FRANCE of all places. This has to be a mistake, right?",
            "I've been tracking the progress of the Robotyne salient.  The WaPo article stated that the 47th Mechanized Brigade \\[newly trained/equipped by NATO\\] was to attack on June 7.  Within 24 hrs. the 47th was to be at Robotyne,  and presumably have taken the city by June 7-8.  However, it was not until Aug. 28 that the 47th declared the city taken - 82 days.  \n\nThe 47th was redeployed to Avdiivka,  but since Aug. 28.  the Robotyne salient has been, for the most part, stalemated.  UKR has advanced in an area 11km \\[6.83 miles\\] wide by about 8.9km \\[5.53 miles\\] deep  in 6 months.",
            "At 7,8 December there will be investment forum in Moscow, Putin will be there. Not only him, but also minister of finances of and head of central bank. From the description:\n\n\" The Forum’s guests and participants include representatives of governmental bodies, members of the Russia business community, and investors from China, India, Turkey, the Gulf countries, the Middle East, Africa, Central and Southeast Asia, and other countries with which Russia is building partnerships. \"\n\nI expect that some important agreements will be made.",
            "The oil market is something to keep an eye on in the coming months.  OPEC is starting to lose their grip and they can't be happy about it.\n\nRight now OPEC+ efforts to stabilize high prices with output cuts have failed miserably, resulting in non-OPEC producers like the US, Brazil, and even upstart Guyana producing record volumes and eating OPEC's lunch.\n\nThe only real trump card that the Saudis have left to play against non-OPEC is to flood the market with cheap crude and cause oil prices to crash so far that expensive wells (particularly in the US) turn unprofitable and shut down, essentially resetting the market.\n\nSaudi Arabia has such low costs that they aren't really hurt too badly by this in the short term, they can drill profitably even with basement prices. \n\nRussia used to be able to sustain a somewhat low margin situation as well, but with the greatly increased shipping distances to Asia they're working with now, as well as their tight budget situation, things have changed and a crash in oil prices would hit them really hard now.",
            "[deleted]",
            "Just now watching one video about battles and assaults in forest and how hard they are, a thought came to me: are there large long range thermobaric weapons in Russian or Western arsenals? TOS is too low range. But anything that can bombard large swathes of land and clear a way for an assault would probably be very effective. My first thought was napalm, and even it is still legal it seems, so no one will probably outlaw thermobaric weapons anytime soon. It seems to me these are the weapons of the future in non-urban warfare.\n\nQuestion stands, share who has/produces such weapons.",
            "**John Mearsheimer, why was the initial Istanbul brokered peace deal abandoned? (re Russia, Ukraine conflict)**\n\n[https://www.youtube.com/watch?v=on1RrmspFIQ&t=4s](https://www.youtube.com/watch?v=on1RrmspFIQ&t=4s)\n\nSo, he outlines that the UK and US basically intervened in talks and \"scotched\" a peace deal that had supposedly been initialled, and said, \"let's just fight\".\n\nRecently, Putin has commented on this exactly;\n\nApparently the terms brokered and agreed upon were, \"thrown in the oven\".\n\nAnd now he's pursing conflict and will continue to do so, until those terms are attained?\n\n.......\n\nBut no one has specifically outlined what those terms are?\n\nWhat was the Istanbul peace deal comprised of? What was Putin looking for?\n\nAnd Ukrainian admin basically shot themselves in the foot at the behest of the UK and US?\n\n.....\n\nI was under the impression Putin's request was that NATO remove all forces from ALL Baltic states, something which would have required NATO to agree to, not just Ukraine....... and yet Ukraine has to bear responsibility for that?\n\nSome clarity needed please?",
            "[The Minister of Culture of Ukraine has added Russian singer Yaroslav Dronov \\(Shaman\\) to the list of persons who pose a threat to the national security of Ukraine.\n](https://interfax-com-ua.translate.goog/news/general/956500.html?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp)",
            "[deleted]",
            "KA-52 helicopters don't seem to be used nearly as much these days as when Russia was defending the Ukrainian counteroffensive. Did Ukraine become better at AA capabilities or it's a different type of warfare that make them impractical?",
            "[US propagandists freaking out over Putin's interview with Tucker](https://twitter.com/kylenabecker/status/1755618874970845487)",
            "Once in a while i open 9gag trying to look for something to make me laugh but everytime i do so, i see how ukraine is winning every minute on all fronts and there is no more russia. Quote from a comment: \n\n\"Putin: \"This years victory parade looks so nice\"  \nShoigu: \"Da\"  \nPutin: \"Much more tanks than last year\"  \nShoigu: \"Da\"  \nPutin: \"Why they\\`re carring Ukrainian flags, though?\"  \nShoigu: \"...\"",
            "What happened with the pocket/ encirclement in Avdeevka? Any reports of mass surrenders or did the Ukrainians mostly get out but taking casualties doing so?",
            "Do you guys think that if NATO countries join Ukraine with soldiers, that China will have to take a stand and perhaps send some non-combat or even participants in fights to aid Russia?\n\nSeems like this could escalate a lot of France or Canada joins the fight",
            "[deleted]",
            "[deleted]",
            "Ahh man, this sub was my primary source of information, I’m flying blind now!\n\nDoes anyone have a collated list of Twitter/Telegram accounts to follow to get a balanced view on things?",
            "It just dawned on me but no entertaining Arestovich rants lately?",
            "**to clarify i live in England** \nIve heard all the denazification arguements which I think is a bit spurious as its like arguing who's more racist except using guns. \n\nI genuinely feel with the way geo politics has been going the past 10 years Ukraine has been set up as the next big money maker for all the military manufacturers and their shareholders. If the uk and all allies genuinely cared about peace they would draw a hardline for both sides saying sit down at the negotiating table or each nation will lose a generation of young men. But we didnt, we have drip fed them enough to make the Ukrainians think that they have support so keep sending men to die. \n\nUkraine Russia Uk USA all have corruption in their infrastructure, local government and national governments so its like arguing with your neighbour to not crap on your lawn as you are squatting and crapping on their lawn. So thats the corruption arguement out the window. \n\nSo i am genuinely interested to hear from pro UKR why you want to die for the administration that for nearly 12 years has treated you all like idiots because while they have stirred up that national pride they have been making deals with the USA which will leave you country near bankrupt for the next 50 years. \n\nFrom the pro RU im interested how it feels to be in russia and see this all play out. Is there an undercurrent of nationilsm at play here or a genuine concern that the USA through its nato puppets is trying to UNO reverso on the cuban missile crisis an project power where its unnecessary and provacative?",
            "Why no turtletank at Moscow parade?",
            "Really fascinating to see a lot of commentary in /r/worldnews that Russia should have been nuked after WWII, and this is not being removed by moderators. Tacit approval. \n\n\nThe same people would say that they are the civilized ones.",
            "There are rumors amongst Russian military bloggers and mainstream media that Zaluzhniy will be Ukraine ambassador in UK. Allegedly, his resignation will take place in one of the next few days.\nTheir source is Ukrainian deputee Evgeniy Shevchenko.",
            "So the discussion thread was updated because the Omega Mini Hotel fell, wasn’t it?",
            "[removed]",
            "Is there genuinely not a single post of the Pavlograd explosions in /r/combatfootage? On a purely aesthetic level it is some of the most insane footage I've seen come out of this war.",
            "The amount of misinformation in this war is insane to me considering the amount of tech, media and third parties observing. We don’t even know real casualty numbers and attacks are always “repelled”\n\n\nI can’t imagine what it was like during WW2 if it’s this bad now. “Yea Stalingrad is going super well” “no nothing happened at midway island”",
            "We finally have the first footage of Leopard tanks unmistakably getting destroyed in Ukraine. Historic. I was here!",
            "For some reason, there has been very little coverage of the counteroffensive on r/worldnews over the past few weeks \n\nInstead, the only Russia/Ukraine news I've seen there in this time period are irrelevant stuff about the Polish border or scant Ukraine drone attacks into Russia \n\nWhy are there such few articles there on the much vaunted spring counteroffensive?",
            "[removed]",
            "I'm a big fan of the new censorship technique being employed by big news subreddits \n\n[Already covered in the megathread](https://reddit.com/r/anime_titties/s/8KtjON84jP)\n\nIncidentally, I checked the megathread after the post was removed, and saw no real discussion of the counteroffensive success in the time prior to my post \n\nFurthermore, the post had already been up for hours and garnered good discussion before the mods struck. \n\nTechnically this means they can take down whatever posts they like, because perhaps someone is bound to have previously made a tangentially related comment in the megathread at some point \n\nFascinating",
            "[deleted]",
            "[In 2 month's time, Putin's disinfo machine has frozen US congress, stopping US aid to Ukraine, elected a pro-Putin Slovakian government and now elected a pro-Russian Dutch government.\n](https://twitter.com/JayinKyiv/status/1727426494907977805)\n\nAnother victim of Putin-derangement syndrome.",
            "European rolled out red carpet for Netanyahu. Then r/europe get outraged when the UAE and Saudi do the same thing to Putin.\n\nIf something positive comes out of this and the Gaza war. It's to see how absolutely corrupted the globalists have become.\n\nAt least the realist (and the nationalists) admit different countries should be treated differently. Current crop of globalists, they have no rule to follow, just say one thing then do whatever that benefit them",
            "The panic and desperation all over the west is just sad. Biden just used the extremely weak *national security* narrative in a public address to argue for 60+ billion more in funding to Ukraine.\n\nSo, which one is it? Are the Russians a bunch of backwards savages running out into open fields in meat waves or will they reach Lisbon, then sail to New York if they aren’t stopped in Ukraine? I mean, who the hell is writing these speeches?",
            "You know that redditor see this war as a game, as lots would disappear when their 'team' lose, and only turn up when their 'team' score a victory.\n\nThat would explain the lack of principles, as they cheer the same act their 'team' make, but despise it if the  opponent does",
            "'*Those who are calling for ceasefire in Gaza, is backed by Putin, I want the FBI to investigate into that*', Pelosi, one of the most powerful Democrat politician claimed. \n\nIs this the hill where you all want to die on?",
            "\"There cannot be grey zones anymore around Europe, you have to decide either you are with Putin, or you are with the democracies.\" - Ursula von der Leyen\n\nThe volontary escalation  by western leaders is worsening by the day.",
            "What interresting in this whole Ivan Khruz saga is that this sub is practicaly the only place where discusion ih going, most of reddit just accepted Ukranian fotage as definitive end.\n\nThats how propaganda about \"Russia always lying\" is working - Russia say something, west media provide \"explanation\" or \"evedince\" why its lie, Russia provided definitive evedence that no, Russian position are true, but eather this last part being ignored (like here), or whole \"debunking\" being memoryholled (anyone remember misslle that shot down MN17? peperidge farm remember) and new \"debunking\" appear.",
            "Regarding the Moscow concert hall terrorist attack, I found it very odd how certain the Americans were about their intelligence but the bombing of the Nordstream pipeline remains an unsolvable mystery a year and a half later.\n\nIn less than 24 hours after the terrorist attack the Pentagon immediately surmised that:\n\n* Ukraine took no part in the attack.\n* The attack was orchestrated and carried out by ISIS, with no state-level backers.\n* Any oddities and peculiarities between this attack and how ISIS normally conduct themselves is purely coincidental.\n\nKnowing this, I guess it is somewhat understandable why a lot of people do not believe the Pentagon’s story.",
            "I am really interested: why do you personally care who wins? or why you don't care? does the war outcome affect you directly and how?\n\nQuestion for everyone. It'd be nice if you gave some background about yourself with your answer. I'll start.\n\nI live in Russia and I care about who wins only as much as it affects my life, because all wars are the same to me, just violent human nature manifesting itself and masked with various rationalizations. I'm with Leo Tolstoy on that subject: “War is murder. And no matter how many people come together to commit murder, and whatever they call themselves, murder is still the worst sin in the world.”\n\nThere you are. Share your point of view if you wish, it'd be great to read about various views. Cheers.\n\n(edit: added one more question)",
            "There's a craziness to this war I don't think history books will be able to capture. It's borderline comical at times. Makes you think about all the bonkers sh*t that happened in past conflicts that we couldn't possibly understand if we didn't live through it.",
            "Day 480 of the special military operation of mexico.\n\nWalmart Security forces (pmc) have agreed to stand down and camp 100 miles away from washington dc.\n\nWalmart pmc's leader (guy fiery) issued a statement that the 7 US Airforce blackhawks he shot down are not such a big deal. And that he and president Trump are on good terms after Sarah Palin (President of Alaska) settled the dispute with an agreement to fire defense secretary Lloyd Austin.",
            "We’re the real losers today, no more entertainment value from Prig.  This next season is going to be such a disappointment.",
            "Zelensky on Twitter:\n\n> We value our allies. We value our shared security. And we always appreciate an open conversation.\n> Ukraine will be represented at the NATO summit in Vilnius. Because it is about respect.\n> \n> But Ukraine also deserves respect. Now, on the way to Vilnius, we received signals that certain wording is being discussed without Ukraine.\n> \n> And I would like to emphasize that this wording is about the invitation to become NATO member, not about Ukraine's membership.\n> \n> **It’s unprecedented and absurd when time frame is not set neither for the invitation nor for Ukraine's membership. While at the same time vague wording about \"conditions\" is added even for inviting Ukraine.**\n> \n> It seems there is no readiness neither to invite Ukraine to NATO nor to make it a member of the Alliance.\n> \n> This means that a window of opportunity is being left to bargain Ukraine's membership in NATO in negotiations with Russia. And for Russia, this means motivation to continue its terror.\n> \n> Uncertainty is weakness. And I will openly discuss this at the summit.\n\n\nWhat a brat, lol.  Not your decision dude, you're not in the club yet, they're free to decide whatever rules and wording they want.",
            "Surely we are in the end game now when Z gets forced to the table. \n\n[https://www.telegraph.co.uk/world-news/2023/08/08/ukraine-russia-war-latest-news-putin-attack-drones/](https://www.telegraph.co.uk/world-news/2023/08/08/ukraine-russia-war-latest-news-putin-attack-drones/)\n\n*Ukraine is “highly unlikely” to make a major breakthrough in its counter-offensive to retake territory held by Russia, senior US and Western officials have said, citing “sobering” intelligence.*\n\n*Ukraine is struggling to break through Russia’s defensive lines in the east and south of the country and the map has barely changed since the highly anticipated counter-offensive began two months ago.*\n\n*“Our briefings are sobering. We’re reminded of the challenges they face,” Mike Quigley, an Illinois Democrat who has recently met with US commanders training Ukrainian forces in Europe, told CNN. “This is the most difficult time of the war.”*\n\n*“They’re still going to see, for the next couple of weeks, if there is a chance of making some progress. But for them to really make progress that would change the balance of this conflict, I think, it’s extremely, highly unlikely,” a senior western diplomat told the American news channel.* \n\n*“Russians have a number of defensive lines and they \\[Ukrainian forces\\] haven’t really gone through the first line,” another senior Western diplomat told CNN. “Even if they would keep on fighting for the next several weeks, if they haven’t been able to make more breakthroughs throughout these last seven, eight weeks, what is the likelihood that they will suddenly, with more depleted forces, make them? Because the conditions are so hard.”*\n\n*While the autumn is set to bring the long sought-after Abrams tanks from the US, it will also bring more challenging weather conditions for advancing.*",
            "I don't understand.\n\nJust this morning, Ukraine announced that they had killed [820 Russian soldiers yesterday and destroyed 17 artillery pieces](https://www.reddit.com/r/ukraine/comments/15m53k1/losses_of_the_russian_military_to_982023/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1)\n\nAnd looking at their reports over the past week, they have been killing an average of 600 Russian soldiers per week \n\nSo where is all the footage? Glancing round this sub, most of the videos from the past week show Russia destroying the hell out of the AFU \n\nLooking around r/combatfootage and r/Ukrainewarvideoreport over the past week, most of the videos are either reposts from long ago, individual drone drop videos which show 1 dead Russian soldier, or even more infuriatingly, a video of Russian soldiers defeating Ukranian soldiers, which normally doesn't make it to hot.\n\nFinally, mainstream media is awash with lurid tales of how badly the counteroffensive is going.\n\nCan anyone please explain the dissonance between the Ukrainian claims, the footage we've seen over the past week, and mainstream medias increasingly negative tone?\n\nThanks",
            "https://www.telegraph.co.uk/world-news/2022/04/01/vladimir-putin-running-missiles-parts-made-ukraine/\n\n>Vladimir Putin ‘running out’ of missiles – because parts are made in Ukraine\n\nSo I guess Russia is finally going to stop the missiles...\n\noh the news is from 1.5 years ago. nevermind...",
            "It is going to become much harder for anyone to investigate war crimes or anything else in this war.\n\nNot that it was easy at any other point but this NYT report is just so damning. Bit of a buried lede that the Ukrainian \nauthorities tried to stop the NYT journalists. \n\nIt's just really straining credulity to suggest the Ukrainians are trustworthy at this point. In a way, it's a good thing. Healthy skepticism is good. Verify everything. All allegations. Dismissing out of hand and obsequiousness to authority has been embarrassing and maybe an understatement.",
            "So that it. With the focus switching back to the East, its safe to say the counteroffensive has ended, and was a Russian victory.",
            "As I repeatedly mention, I am here only from economics perspective.\n\nThe US Treasury sales last week was a complete disaster.. almost zero demand and most of the sales went to \"dealers\". Looks like no one is buying US debt anymore and china is even dumping bonds. \n\nTechnically US is running out of money, not arms. \n\nEven if the speaker is elected, there is no way way out. Saudi is also pissed at us and dumping bonds.\n\nApparently, US convinced Israel to delay the ground launch.\n\nInteresting times. End of pax Americana?",
            "[The Kremlin has never been richer – thanks to a US strategic partner\n(CNN)](https://edition.cnn.com/2024/02/19/europe/russia-oil-india-shadow-fleet-cmd-intl/index.html)\n\n>Russia is entering its third year of war in Ukraine with an unprecedented amount of cash in government coffers, bolstered by a record $37 billion of crude oil sales to India last year, according to new analysis, which concludes that some of the crude was refined by India and then exported to the United States as oil products worth more than $1 billion.\n\n>This flow of payments, ultimately to Moscow’s benefit, comes from India increasing its purchases of Russian crude by over 13 times its pre-war amounts, according to the analysis by the Centre for Research on Energy and Clean Air (CREA), exclusively shared with CNN.",
            "Step 1: deploy EU troops for guarding areas not facing actual combat, for instance along the Belarus border. Explain that this  frees Ukrainian soldiers so that they can be redeployed to the active fronts. No EU soldiers are facing combat, so why should anyone complain ?\n\nStep 2: Once troops are actually inside Ukraine, things become easier. Now redeploy some EU troops to areas that are not at the front, but are directly threatened by the russian advance, say in front of Odessa. Call them \"peacekeepers\". Sternly warn Russia about attacking them. If Russia does attack, complain loudly and show a tearful TV ceremony of Macron in front of the coffins, giving them medals. \n\nStep 3: Define a no-fly zone above the area where EU troops are located to prevent \"further russian aggression\". You don't want our soldiers to be sitting ducks under russian bombs, now do you ? Actively engage any russian aircraft and start the aerial conflict. Ask the US to help enforce the no-fly zone. Bring in AD, artillery, the works. \n\nCongratulations, you can now enjoy WW3.",
            "Real talk, here is a question generally directed to the pro UA here. If one is justifying not negotiating with Russia or accepting the march 2022 peace deal with reasons such as \"trust\", and \"atrocities\", how does one say this yet see Israel and Palestinians negotiate year after year, people who have far more animosity and far less trust towards eachother, with a much bloodier history between the two. If they can negotiate, why can't Ukraine negotiate with Russia?",
            "Does anyone think the war will be over in under two years, and if so, what series of events do you think will occur that will enable the war to end in under two years?\n\nIt seems impossible to have any confidence in the likely outcome because so much depends on countries that aren't even directly fighting.  Does China supply Russia with thousands of vehicles or join sanctions followed by India against Russia (neither seems likely).  Does US support for Ukraine suddenly disappear or does the US get semi serious about supporting Ukraine and give them more than <1% of their stuff - maybe something like 20+ F16s (over 4k made) and thousands of JASSMs (370km range so only a few could destroy the Crimean bridge) and other munitions (this doesn't seem likely either).",
            "Are map posts now banned? Feels like there hasn’t been a current situation map in a while",
            "[removed]",
            "Petition to call the kinzhal, Matryoshka bomb if it turns out it is a bomb inside a bomb inside a rocket.",
            "What do you think of the recent drama on the frontlines?\n\nIs Russia actually collapsing due to infighting or is it a trap to make Ukraine start the offensive early when they see weakness?",
            "I thought prighozin and wagner were going to step out of bakhmut and get replaced by the chechens. What changed?",
            "So what now really? All I really care about what now beyond where Russia goes next is the casualty figures, simply because Avdiivka, Chasiv Yar, Vuhledar can all become different versions of Bakhmut, and the sustainability of Russian offensives is important. Since Wagner is unlikely to mount an entire full frontal attack(I would rely on Prigozhin’s word that they’re a partially spent force, but I don’t trust anything he says just cause it’s Prigozhin) maybe the propaganda victory causes an influx of volunteers, idk. But costly assaults are going to likely have to be on the part of RAF going forward, that at the very least feels like a safe assumption. \n\nKherson, Zaporizhzhia, Kharkov, nothing changes there. This isn’t a victory that will allow them to be more aggressive there, at least I highly doubt it. But the sentiment seems to be that Bakhmut will become a logistical hub for future campaigns. It’s undeniably a bad defeat for Ukraine which again emphasizes the need to know casualties, if Ukraine was able to make it a cauldron where Russia exhausted offensive potential to take a smaller city, then it starts to sound a lot better. But if casualties were even close to even, it’s bad, Russia/Wagner could’ve even lost a bit more and come out ahead attritional, they can replace their losses easier after all just from having a much larger pool of manpower to draw from. If Russia needs to quietly mobilize/conscript a few tens of thousands they easily can. \n\nIt’s gonna be something that takes a few months to tell. If Russia flounders in the next few months, then we can probably infer that Bakhmut was too costly on offensive capable units. If this is the start of a string of Russian victories then we’ll see that Ukraine sent too many men in, so it really is a time will tell thing cause I don’t feel wholly convinced by what is pretty obvious propaganda",
            "https://twitter.com/snekotron/status/1666847226054713344",
            "How many KA-52 helicopters Russia has lost so far in this war? \nHow many more do they have?",
            ">Russian President Vladimir Putin, said Moscow had observed a \"lull\" in Ukraine's counteroffensive, which began early this month. Although Ukraine still had some offensive potential, Kyiv understood it had \"no chance\", Putin said in televised remarks.",
            "It seems Kadyrov is supporting Putin. Priggy vs Kadyrov cage match when??",
            "The good news for Russia is that they only need to take out Prigozhin to somewhat immediately cease hostilities \n\nThe bad news for Russia is also the above, going to be very hard to find him\n\nI really (actually unfortunately) don’t see Prig gaining much traction and as soon as his troops understand that they are sitting on the wrong side of the fence, desertion from the group will be inevitable.\n\nWarner’s core is mercenaries and prisoners, respectively, people who fight for money (that they won’t receive) or freedom (they will lose again).\n\nIn hindsight makes me wonder if MoD purposefully limited ammo and purposefully sent Wagner to get slaughtered, because intelligence suggested a potential for uprising. \n\nThis is definitely a win for Ukraine and they definitely should push to attack.",
            "I just noticed that Wagner is basically repeating the invasion of Ukraine with a mad dash towards the capital in the hopes that the government will collapse like a house of cards. Would be deeply ironic if it works this time.",
            "This whole thing is so weird. They are actually driving to Moscow with such little engagement. \"They have anti air\" isn't a good excuse when they are right at the door of your capital. Where are the jets at? Maybe im missing something?",
            "The last picture bevor his death.\nhttps://img.pr0gramm.com/2023/06/24/bc93c7449c312b6c.jpg",
            "Lukashenko probably now progozhin’s handler",
            "Is Sergei Shoigu still the defence minister?",
            "prigozhin's 1st update since flying to Belarus.\n\nhttps://preview.redd.it/4tkq78mud89b1.png?width=941&format=png&auto=webp&s=1fd35a7374b7f187e5e08abbfbc7c91c501ebd35",
            "Question to pro ukrainians, pro russians, and especially moderates/ neutral - what are some good methods you use to protect yourself from and identify russian propaganda and ukrainian propaganda. What are the red flags and telltale signs its propaganda?",
            "To the naïve people who keep saying things like \"the other side's media is only reliable when it agrees with me\": this is a well-established heuristic for evaluating the reliability of sources.\n\nhttps://en.wikipedia.org/wiki/Criterion_of_embarrassment\n>The criterion of embarrassment is a type of historical analysis in which a historical account is deemed likely to be true under the inference that the author would have no reason to invent a historical account which might embarrass them.\n\nhttps://definitions.uslegal.com/a/admission-against-interest/\n\n>An admission against interest is an exception to the hearsay rule which allows a person to testify to a stament of another that reveals something incriminating, embarassing, or otherwise damaging to the maker of the statement. It is allowed into evidence on the theory that the lack of incentive to make a damaging statement is an indication of the statement's reliability.\n\nAlso, courtesy ChatGPT:\n>Embarrassing admissions: Historians may give more weight to historical documents or accounts that contain embarrassing or damaging information about the author or the source's own interests. If a document reveals negative aspects or failures of a particular individual or institution, it may be viewed as more reliable since it is less likely to be intentionally fabricated.",
            "Dave Smith on the Significance of Tucker Carlson's Interviews at the Blaze Media Summit\n\n[\"What Mike Pence is doing here is typically how politics worked...This is how the establishment perpetuates its agenda...In one second Tucker Carlson just blows this entire thing up.\"\n](https://twitter.com/TheChiefNerd/status/1681033448973037568)",
            "[deleted]",
            "Kind of a random thought experiment, if you’re pro-UA or pro-RU:\n\nIf given the choice between:\n\n- A peace deal happens right now where both sides fall well short of their demands\n\nOr\n\n- the war continues basically as-is for X more years, but in the end your side wins decisively\n\nwhich would you prefer?  And is there a value for X where your answer changes?",
            "A trip back in time\n\nhttps://www.vice.com/en/article/vbnqb3/poroshenkos-promises-of-safety-and-peace-ring-hollow-in-eastern-ukraine",
            "Does anyone know delivered m777 numbers vs lancet hit numbers?\n\nSeems like lancet killed the majority of m777... at least i havnt really seen m777 or artillery hits from ukraine lately?",
            "[deleted]",
            "What's your speculation today on how this war will progress and end? What is the final picture going to look like, territorially, politically, etc, in the final settlement if there is one?\n\nThis is just to see various takes on this.",
            "This is a genuine question, and I really would rather not have the answer to this be completely insane/unrealistic... but if you were Vladimir Putin/the senior Russian military command, what would you do in this position right now? Assuming the counteroffensive goes from its current state of progressing poorly to stalling out without having completed any or only a few objectives, what's Russia's next step? Like, from a tactical standpoint, what best helps you accomplish your goal (somewhere from annexing part of Ukraine to taking all of it)?",
            "[removed]",
            "[deleted]",
            "Are there any video evidence of Prigozhins plane being shot down by AA missile?\n\nThey tend to leave a long white smoke trail in the air",
            "Russian foreign minister Sergey Lavrov said at his Q&A at MGIMO: \"We won't cooperate with the West in those areas on which our security depends, in every meaning, miltary-political security, economic, technological, etc.\"\n\nI find this noteworthy in the light of all the talk about peace talks/negotiations. Seems it is ignored that current position and course of Russia's leadership is that no promises and even treaties with the participation of the West can be trusted, a position Lavrov states further in his answer to a question. So I doubt there can be any negotiations, since the West can't suddenly abandon it's anti-Russia position, and the current position of Russia's leadership seems to be that only path left forward is military defeat of the current Ukrainian regime and imposition of the satisfactory conditions by force.",
            "[removed]",
            "[Fighting for Equality: Women on the Frontlines of Ukraine's Armed Forces | The Gaze](https://www.youtube.com/watch?v=UlEpGuEDkE0)\n\nthis channel is funded by UA government. Bizarre world.",
            "An interesting recent development that I haven't seen mentioned here: \n\nRecord exchange prices for fuel, delays in the delivery of petroleum products by Russian railways (interestingly fuel transportation by rail doubled compared to last year) and cases of fuel shortage led to some gas stations being closed due to becoming unprofitable or logistical problems, especially in the Nizhny Novgorod and Rostov region.\n\nRussia announced yesterday to restrict their export of gasoline and diesel fuel to stabilize fuel prices in the domestic market. Aleksandr Dyukov (Chairman of the management Board of Gazprom) however warns that this may help short term, but in the long run it could lead to a fuel shortage. Also it would obviously mean even less revenue for the state and involved companies. Imo it's hard to see how this step by the government solves the reason for this problem (a weak ruble incentivising the export of fuel, while production for the domestic market becoming more and more unprofitable).",
            "My main concern with this platform, whether it's in general or on the more pro-Ukrainian focused subreddits, is the tendency for news to be overly sensationalized and exaggerated. Even significant news stories get blown out of proportion by a factor of 100%.\n\n In reality, you could go for months without tuning in to the news about this war and not miss much. Even larger events like the Wagner incident, the dam, or the Bakhmut situation, not to mentione smaller events like the HQ situation are rather insignificant. However, when these events occur, people tend to suggest that they mark a turning point in the war. In reality, the war has remained relatively unchanged since last summer.",
            "What happened to all the helicopter videos?",
            "[deleted]",
            "Ruble [set to hit 100 per usd again](https://english.alarabiya.net/amp/business/markets/2023/10/02/Russian-ruble-close-to-seven-week-low-vs-dollar-in-early-trade). Looks like interest rates might have to go up again. The central bank rate is currently at ~13%.\n\nHow big of a problem this is really depends on the effect of high interest rates on the economy. Higher interest rates means that companies borrowing money from banks and investors need to provide at least 13% return on investment, otherwise those banks and investors will just keep cash in bank accounts earning the interest.\n\nIs this a problem? Well it depends on how Russias economy works. Most of its gdp comes from large private or state owned enterprises, which in theory should be able to weather this kind of storm. Smaller business will struggle but they account for less of Russia's economic activity.\n\nAnother side of high interest rates are mortgages and property. Higher interest rates makes it harder to afford a loan to buy a house. But I am not aware if housing affordability is much of an issue in Russia to begin with. \n\nFinally, interest rates can only go so high before the financial markets drastically suffer. The reason Russias central bank wont stop is because the alternative (less valuable ruble leading to more inflation) would be far worse.\n\nHigh interest rates affects mostly citygoers and urban population. High inflation affects everyone.",
            "[removed]",
            "[deleted]",
            "Can someone explain the big red arrow pro-ua meme?\n\nLike rybar claims there are attacks in certain directions and visualize them with arrows on the map. At first I thought the big red arrow comments imply these attacks are fake, and only exist on paper. But now I see the pro-ua do not deny the existence of such attacks and actively post ru casualties associated with those, while keep calling it big red arrows. What exactly are they trying to mock?",
            "[deleted]",
            "**First Story:**\n\n NATO urges the Western military-industrial complex not to raise prices due to increased demand\n\nStoltenberg,  against the backdrop of rising ammunition prices in NATO countries,  called on industry representatives to \"show responsibility\" and refrain from increasing the cost of shells.\n\n\"The challenge here is that when we increase demand, we want more supplies,  not higher prices,\" the alliance's Secretary-General said.\n\nHead of the NATO Military Committee Admiral Rob Bauer:\n\n\"The price of one 155mm artillery shell has increased to €8,000 from €2,000 before the Ukrainian war.\"",
            "Twitter thread from a journalist who has been in Ukraine at various times covering the war:\n\n\n> Almost five full months into Ukraine's counteroffensive, with action winding down, I think it's safe to say it has been a serious failure. The overarching goal was to liberate a large amount of territory, including the cities of Tokmak and Melitopol, and this has not happened.\n> \n> \n> There's obviously a million caveats and context/explanations you can add, but if you showed the above map of the next five months of gains to someone on June 1, they would undoubtedly regard it as a serious failure\n> \n> There's a lot of people responding to this who don't seem to understand that Ukraine needs to liberate its territory in order to win. There were a ton of resources compiled for this offensive with this goal in mind. It hasn't succeeded. Don't know what else to tell you.\n> \n> The biggest issue is ammunition. There was an enormous amount of artillery ammo (especially bought from South Korea, but also concentrated from other sources) that was put together specifically for this offensive. That's gone now and very likely won't be replaced for a full year.\n> \n> Ask any Ukrainian serviceman (as I have, repeatedly, on frontline visits in Donbas and Zaporizhzhia for the past year and a half) and they will tell you ammo is the biggest issue. They had a lot for this offensive and it won't be repeated soon, and goals weren't achieved.\n> \n\nhttps://twitter.com/NeilPHauer/status/1718985842713112701",
            " So, what's the next step for Ukraine? One thing is clear: they won't be seeking peace or a ceasefire.\n\n As I mentioned a few weeks ago, it seems crucial for them to reassess the situation, step down from any perceived high horse, and genuinely address their internal issues instead of deflecting blame elsewhere. At least, this is just my perspective, and while I've come across opinions in other subreddits, I'm curious to hear what this community thinks about Ukraine's possible actions and strategies moving forward.",
            "[Top comment](https://www.reddit.com/r/worldnews/s/G3ncBuAPSp) on r/worldnews on Western leaders broaching the possibility of peace talks\n\nLooks like even they are beginning to understand how the West operates lol\n\nhttps://preview.redd.it/vxdv8rjzzayb1.jpeg?width=640&format=pjpg&auto=webp&s=fb812bc758c38420ad2c9c0dfcaad7a6d5230e3f\n\n*Just kidding*",
            "\\- *The United States admits that China did not supply Russia with weapons for use in Ukraine.*\n\n*This was stated by Biden administration national security adviser Jake Sullivan.*\n\n\\- **Polish carriers did not agree to lift the border blockade after negotiations with Ukraine.**\n\n**The Guardian writes about this.**\n\n**We have not reached an agreement. The Ukrainian side does not take our demands into account, ” said Rafal Mekler, organizer of the protest in the border town of Dorogusk.**\n\n\\- *Israeli media: Knesset members from the Likud Party discuss no confidence in Netanyahu*\n\n\\- **Ukraine will receive 60 twice-decommissioned Gepard self-propelled guns to counter Russian drones, reports De Telegraaf**",
            "Anyone knows if Oryx is still operating ? I thought they were no longer tracking Russian and Ukrainian equipment losses after October 1st but im seeing a few new records",
            "There is theory among Ukraine political analysts that Zelensky is repositioning himself to ally with Trump/republicans. Pompeo appointment, interview to Fox News, public offer \"to discuss peace plan with Trump\", meeting with Murdoch etc. The idea is he milks democrats for what they can provide now, then helps Trump during election campaign in exchange for republicans picking up the bill for another 4 years. In theory Zelensky and friends still hold a lot of information regarding Biden dealings with Burisma and some other things from the time he was king of Ukraine in 2014-2016. Guess my question is, can Ukraine stories from 2016 really damage Biden at this point enough to guarantee Trump win, is impeachment viable etc. Would be nice if any americans comment.",
            "I hate to think about what Russia`s next moves are regarding their ever growing pile of missiles is. \n\nThey have barely been firing anything and we know they have ramped up productions far higher than pre-war period. \n\nI wonder if they are planning an ultimatum to Ukraine before firing a big number missiles simultaniously towards major cities in Ukraine.",
            "Question to those familiar and fluent well-versed in USA politics:\n\nWhat are the odds of USA managing to push another big aid package, and what are the internal political processes at play there?",
            "From the NYTs:\n\n *Ukrainian officials insist that they are cracking down on corruption. President Volodymyr Zelensky recently said the government was going to change the mobilization system, though he did not provide specifics.*  \n\n \n\n**On 11/24 Zelensky** publicly promised to address the \"issues\" with mobilization. This new policy was supposed to be made public last week. From RBS Ukraine:\n\n*According to the president, he heard reports on the challenges in the mobilization sphere and the options for addressing them during today's Staff meeting.*\n\n***\"I would like people to understand the entire action plan, where we are going, what challenges there are. The comprehensive plan on this issue will be available next week. Very much believe, next week,\" added the president.***\n\n&#x200B;\n\nStill no new mobilization plan from Zelensky.  \"Very much believe\" Eh?",
            "What is a better analogy for this war: boxing or chess?   \n\n\nFor me it is more like boxing.   \n\n  \nTrying and sometimes landing the big blows, but none of them are knock-out fight-ending punches,  and then it comes down to who has more stamina.    \nConsidering brutality of what we see here daily, I find it harder to see it as a chess match, where some moves were sacrifices that would pay later.",
            "Who else here had a full measures or no measures approach to the war? Like an all or nothing over half measures? \n\nThis is ignoring my beliefs before the war, but like in the beginning if my government were going to be pro war, pro Ukraine, pro NATO, I want them to go at it because I believed that can shorten the war over prolonged war, even if it’s a glass half full or a glass half empty situation. So a full measure here if they were committing to pro war, but I also would have been fine with no measures. \n\nBut now that the war is approaching it’s 2 year anniversary, NATO and it’s members seems to be full of half measures. If Russia was really a threat, especially this whole time, why so many NATO members can’t even reach their 2% military budget despite being some of the richest countries in the world? Why aren’t they more nuclear weapons to combat those of Russia and Belarus? Why are governments still relying on foreign governments for military when it’s better to be self sufficient?",
            "Do you think the spring will lead to any new developments in the war?",
            "Do the people that live in current occupied Ukraine by Russia government see themselves as being occupied? \n\nI heard Donbas and Crimea is basically the Kurdistan or Artsakh of Ukraine, so why all defacto states was fine with foreign governments “protecting” them and they disliked their own federal governments. \n\nClearly US/UK/France governments weren’t planing to annex or even occupy parts of Iraq in the 1990s, but obviously they supported the defacto control of parts of Iraq by third parties, but this didn’t result in an independent country. When it came to former parts of Yugoslavia, they did support independent countries and it seems like there was consent (doesn’t mean legal) to all of this unofficially by people and local governments.\n\nDoes the same apply for parts of Ukraine and Georgia? The main difference is the foreign government “helping” is a neighbor, while US, UK, etc are nowhere near the countries they do this too. But it’s the same concept right? So why we don’t see massive resistance to the occupation in parts of Ukraine?",
            "If according to Suriyak, then the Avdivka battle gonna enter a new phase now, after the Russian took over the Ivushka Dacha.\n\nThe Russian is roughly 1km from Avdivka main supply route. So if the Russian can make through that 1 km of suburb warfare , they gonna cut Avdivka in half, and effective cut off supply of the entire South (which is 80% of the city).\n\n&#x200B;\n\nFeel like the best thing Ukraine can do right now is putting up a minimum effort to defend then slowly retreat from the city like Zaluzhny would want. Leaving or fighting tooth and nail trying to salvage the situation, this probably gonna test the rift between Zaluzhny and Zelensky",
            "Where is the next strategic stage of operation for Russia?\n\nThey will take back Robotyne, of course, but mostly just to increase buffer on their southern defensive line. Why stay so far away from their reinforced line and make themselves vulnerable?\n\nThey want to exploit as much as possible from Avdivka front too. But why push the line so far from their recently taken stronghold? Won't cross it out, but with Avdivka, they now could easily defend this part of the frontline with minimal amount of troops. Unless they feel like Ukraine does not have a strong 2nd line of defense. Then maybe\n\nTake Novomykhailivka and surround Vuhledar and take it from the north is obviously happening. But looks like it will be more of a slow operation there instead of massing troops.\n\nSo that leaves the north, with Chasiv Yav + Siversk front. And Lyman+ Kupyansk. Both have all chatacteristics of Russian operations: surrounding Ukranian forces/ force Ukraine to defend with their back against the river. It will also seriously shorten the frontline and free lots of their troops\n\nOf course there is that wild card of pushing out at Khakiv to prevent future shelling of Belgorod. But generally Russian doesn't stray away from their long term plan due to recent events",
            "Deepstatemap shows the Russians have entered sieverne (near avdiivka) and ivanivske (near bakhmut).",
            "When does the mud dry out on the battlefields?  \n\n4 weeks, 6 weeks? I am guessing at least another 2 months before any major land operations can start.    \n\nOn a separate note, not sure what the desired outcome of these incursions into Russia was?   \nSome suggested it was to undermine the election of Putin, but I think it just adds to his ticket, as now he can show how he is a defender of the Fatherland which is under the attack.",
            "Maybe the purpose of the Belgorod actions are to fail so bad that the Russian rethink the chances of success of a major offensive in that area?",
            "Do there exist any estimates on how much equipment ukraine has (\"left\")? Must be lowering since aid is much smaller now",
            "Anyone have any theories about the limited use of smoke on both sides? Is a doctrinal/operational thing or a lack of equipment? Has smoke fallen out of favor in modern militaries?",
            "Do you guys know what happened to RussianWarFootage sub. I think they got banned after showing terrorist attack footages, torture of terrorists and lack of moderation but I tought they will re-open another sub. Did they open another one or It is just perished. Also I do not understand the ban for the sub. Other channels showing humilation, torture, highly graphic contents too. Did they got banned becasue of what specific reason. Is It bc they are pro-Ru or other stuff. Curious...",
            "Is it just a weekend thing or was there a huge influx of combat footages in the last 24 hour?",
            "Is there any good explanation of what is happening around Avdeevka? The Ukrainians should have had reinforcements already but the Russians continue taking land. Same for advances in Chasov Yar. I haven't seen a serious discussion about what actually happened, why the Ukrainians cannot deal with the situation and what forces they can send to stop the Russian advances.",
            "[removed]",
            "Based on the heated discussion in this [thread](https://www.reddit.com/r/UkraineRussiaReport/comments/13cjjvb/ua_pov_the_only_tank_at_the_russian_victory/) and out of boredom, I decided to watch a total of 16 victory parades, especially those in the largest 15 cities. Unfortunately I couldn't find a video for Chelyabinsk, Volgograd and Ufa, but for Moscow, Saint Petersburg, Novosibirsk, Yekatarinburg, Kazan, Nizhny Novgorod, Samara, Rostov, Omsk, Krasnoyarsk, Voronezh, Perm, Tomsk and Khabarovsk. \n\nI was particularly interested in the number of tanks. The answer: apart from the T-34, which of course always belongs to every parade, there were *17 tanks in total*, all of them T-72s (I think, I am very bad at such identifications). One in Nizhny Novgorod, six in Rostov-on-Don, two in Omsk and eight in Khabarovsk. The three largest victory parades were in the following order: Moscow, Khabarovsk/Saint Petersburg and Rostov-on-Don. Average number of military vehicles: ~30, if there were any.\n\nSome other things I noticed:\n\n* Russian media has some very professional camera work on their victory parades, making the number of vehicles appear much higher than in reality.\n* In Omsk and Samara almost all vehicles had a Z symbol, rather unusual compared to the potrayal in Moscow. \n* Although Kazan is the fifth largest city in Russia, there was only one T-34 at the military parade, nothing else. Quite a sad sight. \n* I have no idea why Khabarovsk has for some reason not only one of the highest number of vehicles and tanks, but also the highest number of self-proppelled artillery (four 2S19 Msta, but still!).",
            "Back in early March, when Russia's state budget was deep deep in the red, and people were freaking out over it, prime minister Mishustin dismissed the concern, stating that the huge  increase in expenditure  was the result of \"advanced financing\" aka frontloading the expenses to the start of the year.\n\nIt was sus, but could have been reasonable, as expenses were starting to come down over the next couple months in February and March.\n\nWell, in April, the expenditure increased OVER the level it was in January, demolishing that argument.\n\nHere is the monthly breakdown for any whose interested:\n\n\\--------------------------January February March  April\n\nRevenue (billion ruble)\t1356\t1807\t2514\t2105\n\nExpenses - (billion ruble)\t3117\t2627\t2333\t3129\n\nsurplus (billion ruble) -1761\t-820\t181\t-1024",
            "I wonder what up with Ukrainian propaganda becoming so over the top this last few weeks? Is this just their attempt to keep eye western on them? Or is there more to it?",
            "I pretty rarely comment on the war events even if I am I guess pretty up to date most of the time. I feel the situtation, the war pretty upsetting, personally. I have my own opinions and I like to distance myself from the very vocal NAFO/Slava Ukraini Crowd but I still am very much pro ukraine. I'm not anti russia, I don't even care for russia outside what their army is doing in ukraine.\n\nMy main problem with this whole expierence on reddit and TikTok/Twitter/Telegram is that its pretty crazy. For one the amount of hypocrisy, cheerleading and specatating is off putting to say the least. \n\nSome compare this to sports and saying people just blindly root for their team, but we must have very different expierence then because you won't see Real Madrid claiming to have won the Champions League when they have just not. Nor will you see fans come up with the most creative writing excersies why their 17th Placed team should have won. And no one goes into a match with their rival team and says they are going to beat them 10:0.\n\nThe war has been going on for close to 500 days, I have been on pretty much all major war subreddits, even the weirder ones. The amount of times I have seen you people cheer for one thing and a few months later flip flop and take in the cope from the other side while the other side is cheering the same thing they coped earlier about is insane.\n\nInformation War is a really fitting description, though sadly most here do that not as a job but free. I'll never understand how you can for three weeks convince yourself someone is dead, which already was a very weird claim, get disimissed and a few weeks later repeat that with the next person unironically.\n\nI'll also never understand how people can disect RU MOD claims and put 100 hours into discrediting someone, everyone knows is lying but then unironicially believe in everything the UA MOD says and dismissive any evidence pointing in the other direction.",
            "I think the biggest game changer for Russia has been the increased amount of recordings of killshot footage\n\nAt the beginning of the war the almost one sided video evidence really made most of Ukraine and Europe believe the Russian armed forces where a complete joke \n\nNow that Russia is rolling out new killshot footage on an hourly basis, I feel like the perception of how the conflict is going has massively shifted \n\nRussia sucked hard at the beginning of the invasion because it was an occupational force and not much fighting besides a few skirmishes was expected \n\nThe Kharkiv and Kherson retreat where necessary due to poor logistics and unavailable manpower, from a strategic point of view it made complete sense and I really wouldn’t consider it as a humiliating loss \n\nI think right now, is when we can properly analyse the fighting power of both Russia and Ukraine on a somewhat level playing field (in terms of numbers and assets).\n\nI don’t support Russia but truthfully the amount of propaganda on every other sub excluding this one since the beginning of the invasion has been delusional and nauseating. I actually believe 90% of it is fuelled by a bot army.",
            "50 year old Ukrainian woman finds a bf within a few weeks in Finland and leaves 30 year old marriage. The 51 y/o man, a psychotherapist, is left on the frontlines counseling depressed soldiers.\n\n>I was so exhausted I spent the first days just sleeping, walking and thinking. Suddenly I had some free time when there was no need to go to my job or take care of my parents. And then one moment I surprisingly realized: I don’t miss home. I don’t want to go back. I mean, it’s not that I don’t love my parents or my husband. I wasn’t thinking about divorce. I just realized that I wanted to be by myself.\n\n>A few weeks into her life as a refugee, Tetiana met a Finnish man. She said it was very difficult to bring this up with Andrii. She called him on the phone and said: “I don’t want to continue our relationship. I want a new place, a new relationship, a new everything. I want a new life.”\n\nNY Times: https://www.nytimes.com/2023/07/25/world/europe/ukraine-war-divorce.html\n\narchived https://archive.is/nneW5\n\nSlava Zucchini. Can some old account post it in the main sub under civ pov?",
            "Nothing else to say, but iam glad that this subreddit exists, worldnews and other circlejerk subs gave me cancer.",
            "US: \n\n> [Senator Marco Rubio: China’s new policy to seize sovereign assets is a reality that threatens the United States and our allies.\n](https://twitter.com/SenMarcoRubio/status/1699784417806528713)\n\n\nAlso US:\n\n> [US seizes Russian foreign assets worth over $1 billion\n](https://news.yahoo.com/us-seizes-russian-foreign-assets-051257936.html)",
            "[Germany went from envy of the world to the worst-performing major developed economy. What happened?\n](https://apnews.com/article/germany-economy-energy-crisis-russia-8a00eebbfab3f20c5c66b1cd85ae84ed)\n\nSanctions working as intended. Germany is paying the price for letting the US bomb its main cheap energy source.",
            "In my opinion, western hypocrisy is what’s keeping the global south from supporting NATO.\n\nIn the same breath, the west can condemn the Russian occupation of Ukraine but support the American occupation of Syria. The west can issue an arrest warrant for Putin but Bush and Obama remain free. The west can issue countless sanctions over Russian war crimes but there are no sanctions for the millions killed by the United States in the Middle East.\n\nAs far as I can see, the rest of the world doesn’t necessarily support Russia but they can see right through western hypocrisy.",
            "I just randomly came across this post from Reddit recommendation, and I can’t believe (actually I can) some pro-ua people are now defending the SS soldier that was celebrated in Canadian Parliament like [this comment](https://reddit.com/r/canadian/s/1YxtNXePRP) I posted.\n\nCrazy to me how these ppl consider themselves pro-ua, while doing so much better job at damaging the reputation of Ukraine than any Kremlin made bots could ever have done.",
            "Interesting pov coming from your always logical “pro-ua” supporters, the same people who:\n\n**Calls for the destruction of Russia and its people for taking over Ukrainian land, while celebrating any retaliation done by Ukraine**\n\nBut\n\n**Supports Israel for illegally occupying Palestinian land, and labels Palestinians as terrorists for attacking the occupier**\n\n\nWhile\n\n**Condemns and Pins the blame on Russia for interfering and meddling in Donbas against Ukraine and triggering conflict**\n\nBut\n\n**Cheers for US to get involved with Taiwan against China.**\n\n\nMake it make sense",
            "Israel cutting off water, power and supplies to gaza = No problem.\n\nUkraine cutting water to crimea = No problem.\n\nRussia bombing power stations and infrastructure warcrimes!",
            "[deleted]",
            "[Glenn Greenwald](https://twitter.com/ggreenwald/status/1716140225779384689): \n\nOne of the most influential \"OSINT\" accounts, \n@Osinttechnical\n - whose decrees on Ukraine and Israel goes viral - works for an entity funded by the USG. It exists solely to serve CIA and Pentagon.\n\nCalling yourself \"OSINT\" is as easy, and meaningless, as \"disinformation expert.\"",
            "Remember Putin got sanctioned as a war criminal. Yet Israel who is literally destroying every single hospital, infrastructure, civilian building. \n\nWho is targeting every single tall building in Gaza. \n\nThat literally goes into a hospital and let babies die in incubators. \n\n…is the “most moral army in the world”. \n\nThis is why we don’t take this hypocrisy on Ukraine seriously. \n\nIt’s never about human rights. \nOr sovereignty. \nOr civilians. \n\nOr anyone. \n\nIt’s only been about money and power. \n\nI honestly want to salute Putin having conducted such a war with such minimal civilian casualties and humane treatment of civilians. \n\nGuy looks like a saint compared to the likes of Netanyahu and emperor Biden.",
            "Are there subs covering all current wars besides r/combatfootage? I thought ppl here were lying when they said they got banned merely for criticizing Ukraine. I guess they weren't. \n\nI got fucking permabanned for forming a theory, not even a criticism, of israel's strat:\n\n>It seems IDF might be leveling vacant housing to make Gaza City uninhabitable, so that they can prevent refugees from returning and gradually annex the north.\n\nThat's all I said. Fucking fascists regards banned me for an objective prediction that's probly accurate.",
            "/r/worldnews is now lionizing the CIA. You can't convince me that it is organic. \n\nThe CIA fosters influence campaigns the world over. Some are non-violent(reddit), but most are extremely bloody.",
            "Is anyone else here reading the credibledefense sub? These people have somehow managed to make so many wrong predictions and yet still hide behind the pretense of credibility. It is absolutely funny to see how every time something happens that is not in favour of Ukraine, most of the people there are surprised. I also noticed how they manage to spin every single situation so that its in favour of Ukraine or not in favour of Russia. For example, the counteroffensive is a failure - oh, but the attrition rate is in favour of Ukraine. There are maybe two-three people in the whole sub who are actually worth reading.",
            "[deleted]",
            "September 7, 2021:\n\n“The European Commission (EC) will study the consequences of the law in Belarus to stop issuing documents to citizens outside the country. This was stated at a press conference in Brussels by EU Foreign Service Representative Peter Stano.\n\n\"The European Union strongly condemns this decision and we will continue to stand with the people of Belarus\"\n\nApril 24, 2024:\n\n“The European Commission did not comment on the decision of the Ministry of Foreign Affairs to limit consular services to Ukrainian men abroad.\n\n“It is not for us to comment on the decision of the Ukrainian government on the measures that need to be taken in the context of the conflict”\n\nSame situation. In one case it is the law of a dictator, in the second case it is democracy",
            "I don't see how this war doesn't end with a negotiated ceasefire and ultimately Ukraine losing territory in exchange for something akin to putins demands. I think all these security agreements Ukraine is signing are part of this.\n\nIts like the cogs need to be lubricated with more blood before we all see the obvious come to fruition",
            "[deleted]",
            "I would like to suggest that you read the text written by a resident of Ukraine, to some extent this will allow you to understand what is happening:\n\nI live in a country house. It seems that he has not left here since 2014, when he fled from Kyiv from the then first mobilization. How many have there been? In years, nine. Nine years of empty expectations, meaningless hopes. Although what am I talking about? Probably about the fact that everything repeats itself and at some point you begin to feel like a hero of a book you read in childhood.\n\nThere is something symbolic and non-random in this, but in my youth I fell in love with Mikhail Bulgakov's novel The White Guard. When I read this book, I felt like one of those officers who, in the house on Alekseevsky Spusk, drank bitters in the hopeless expectation of changes. Then it seemed to me that all this madness described in the novel had long been left in the past. Kyiv-city was not much different from other cities of the Soviet Union, but Ukraine already existed, it was simply not noticed by many. To understand this, I had to face the Ukrainian intelligentsia of the Zhmerinsky spill, sit with her in the kitchens, listen to what she says, which I did not have time to do due to my age. Now I understand what kind of monster they hatched in their kitchens ...\n\nToday, living in Ukraine is living in exile in one's native land. Around - no one. Talking is dangerous. Maybe the neighbors will not hand over to the special services, but they will definitely make him an enemy of the people. They feel everything - they have a dog's scent. If you say IN Ukraine, they are already looking askance. However, for some, Russian speech and Russian music are enough ... Here you are a stranger, if you do not curse everything Russian, Russian, Putin. And as if on purpose, it was in my presence that some notorious patriots start talking about the “Russian brothers” who came to their land and destroyed the “Ukrainian paradise”. And they do not care that Ukraine from the first day of its independent existence was rolling into the abyss, that the economy was consistently destroyed and infrastructure turned into dust. They don't care. They are not to blame. There was an explanation that would write everything off: the Russians came!\n\nThey say nonsense that the people of Ukraine lack information to make their right choice. They have everything. Internet and beyond. In any phone there is an application with a full set of Russian stations. Installed - listen. Do not want. They are not going to. And it's not about fear, but rather about attachment to some incomprehensible substance called Ukraine. Substance, from which they run headlong, but are just as headless tied. Because each of them sees Ukraine the way they want to see it, but not the way it is in reality.\n\nSomehow, in a discussion of one of the articles, I was asked if there are many people in Ukraine with such views (for a united and indivisible Russia)? Then I was silent. I will answer now: units. Remember how in Mark Zakharov's film, Munchausen asked his beloved to tell him something important at parting? She babbled something to him about love, about what would be waiting for him, and he answered: not that! Yes, exactly, it was important for him to hear the words that raw gunpowder was poured into the cannon. This is how we talk about anything, but not about the most important thing.\n\nThe fact is that for the majority of Ukrainian citizens, Russia is already a foreign country. Their capital is Kyiv, not Moscow. And they associate their future with Ukraine, not Russia. And even those refugees from Ukraine, with rare exceptions, feel like a part of Ukraine, and not of Greater Russia from Uzhgorod to Petropavlovsk-Kamchatsky. They are at best pro-Russian, although in essence they are no different from Ukrainian nationalists. They can see this very Ukraine in different ways, but by and large they don’t give a damn about Russia. And today, many of them dream that the Russians will come, hit the Ukrainian nationalists in the hat, they, “pro-Russian”, were brought to power and left alone ... For them, like their opponents, everything that happens to Ukraine is the mistake of certain personalities, but not system flaw of the project itself.\n\nIt is no coincidence that I started this article with Bulgakov, because the pseudo-state entity Ukraine materialized during his lifetime in the form of the Ukrainian Radian Socialist Republic. Under the Soviet regime, the URSR somehow tried to tame, re-educate, but in vain. Whenever the Moscow government weakened control over the territory of the South-Western Territory of Rus', some rustlings came and began to build their own special Ukraine. And they can also be called pro-Russian, because Russians have been systematically eradicated here since 1917. And it is not surprising that there are practically no more of them ...\n\nUkrainian nationalists, for all their madness and demonic possession, are right about one thing - Russia has indeed begun to liquidate the Ukraina project. And for those who have some feelings for the “brotherly people”, I want to recall the classic plot from American horror films, when the good guys face the evil that came to kill them in the form of their relatives and friends. Exactly the same thing is now faced by Russia in Ukraine - with ALIEN, hidden under the outer shell of the \"fraternal people\". Why did the special operation to denazify and demilitarize Ukraine start so late? Athis is a question for the director of modern history. And this is a question about the fact that in life, as in good dramaturgy, not a single event is possible without the previous one. Otherwise, the whole logic of the story breaks down.\n\nWhen a “Ukrainian” talks about something lofty, this does not mean at all that he thinks about something lofty. Quite the opposite. As a rule, his desires are mundane and limited to material goods. Here he is talking about some \"European values\", but, believe me, he does not mean freedom, not democracy, not human rights - he does not give a damn about them. For example, if you ask a “Ukrainian” about the meaning of the Maidan, he will certainly launch into lengthy arguments about the “bloody regime” of Viktor Yanukovych. Lying! Try to imagine any Ukrainian revolution without promises of material benefits, which will fall on the heads of \"Ukrainians\" without any effort on their part? Does not work? Me too…\n\nAbsolutely all Ukrainian independence smells not of sweat and blood, not of labor and willpower, but of a piece of bacon with vodka on the table, which the “Ukrainians” should bring by the very fact of their existence on Earth. And for the sake of this carefree existence, they are ready to go to any meanness, to humiliate and kill their own fellow citizens, and in fact, a person in himself. And everything that is happening in the South-Western region of Rus' is a clear confirmation of this.\n\nOh, how they do not like the Russian leader in Ukraine and how they curse him! And I'll tell you exactly how. Putin is not loved as God, who looked and looked at the biblical Sodom and Gomorrah, repeatedly warned sinners, sent signs to them, and finally incinerated these cities to hell.\n\n\"Ukrainians\" still do not understand, \"and we are for sho\" arrives! They forgot that the declaration of independence provided for the neutral status of the Ukrainian state with guarantees for the Russian-speaking population of the country! And what did all Ukrainian regimes actually do? Anti-Russian policy?! Rewriting history?! Oppression of the Russian population of the country?! Constant trade wars with Russia?! An attempt to change the neutral status of a state by becoming a member of the EU and NATO?! This is not about 2014, but about the “NATO Membership Action Plan” in 2008…\n\nIt is unprofitable for “Ukrainians” today to remember that the 2014 coup d'etat took place under anti-Russian slogans and threats to join the EU with a clear prospect of further entry into NATO. They did not draw any conclusions even when they lost the Crimea. \"Ukrainians\" started a war in Donbass, which went into a frozen phase as a result of the two Minsk agreements. More precisely, two warning blows \"in the teeth.\" Did it teach them something? No!!! They poked Moscow in the United Nations, PACE, CE and other international venues!\n\nOr maybe they thought about Putin's words about the territorial gifts that Ukraine received from the Russian Empire and the Soviet Union? And they also did not hear the statements of the Russian leader that Moscow would not put up with the Ukrainian concept of “anti-Russia”. The \"Ukrainians\" were preparing for a victorious march on Moscow, and not only because \"the whole world is with us\", but above all because they did not feel the power of Russia. And if my Ukrainian fellow citizens still don’t understand “for what Russia attacked them,” then it means that they are terminally ill, they have neither brains nor conscience left. This means that the special operation will continue until the very end of the Ukraina project with the forced seizure of all the “gifts” of Russia, which the Ukrainians could not appreciate. History must make its circle and return to where the mistake was made. The historical mistake is the Ukrainian state itself. Lord, burn!",
            "> The counteroffensive is moving slowly because we didn't send #Ukraine enough artillery, long-range missiles, air defense, jets, tanks, & armored vehicles in time to enable rapid advances against heavily mined RU defensive lines backed by air support across a 1000km+ long front.\n> \n\n\nhttps://twitter.com/berlin_bridge/status/1679934822305677337\n\nSo this is the narrative they're going with. It may be true. I don't know. What I do know is that they present it as though it was a reasonable proposition. \n\nIt was and still is pure fantasy.",
            "[deleted]",
            "[removed]",
            "There was a video posted here about 2 weeks ago of two dudes trekking through a mountainous pass to Hungary to avoid draft. I wonder what became of them..",
            "How long will it take for people to acknowledge that the current Russian army is stronger than the one they had in February 2022?\n\nSure they got a portion of their hardware blown up. But their military industry has expanded massively. And the war itself trained up the ragtag inexperienced bunch they had before the war into a very capable army now. \n\nAnd i yet to even mention integrating drones into modern combat\n\nJust looks at the current Hamas-Israel and how the later just got smashed due to their inexperience. That’s something only real war can teach",
            "Sorta unrelated \n\nBut there was a thread in r/soccer. About a Palestine player got killed by Israeli bombing of Gaza. Was immediately locked by mod (Has 0 comment). But still made to the front page just due to upvotes \n\n[https://www.reddit.com/r/soccer/comments/174vc1s/ibrahim\\_khadra\\_rashid\\_dabour\\_midfielder\\_for\\_ahli/](https://www.reddit.com/r/soccer/comments/174vc1s/ibrahim_khadra_rashid_dabour_midfielder_for_ahli/)\n\n(And the thread on Ukrainian player killed by Russian bombings were allowed to stand before. So it was not because of that sub forbid this kind of post)",
            "[I was looking for cooper, and find ~~gold~~ salt cave.](https://www.reddit.com/r/ukraine/comments/17kgso3/a_note_from_the_mods_why_we_removed_the_time/)",
            "Man If Blinken was not such a despicable human I would feel sorry for him...\n\n[https://www.youtube.com/watch?v=dqNEFTAFhlY](https://www.youtube.com/watch?v=dqNEFTAFhlY)",
            " Since the Time article and the subsequent column in The Economist, the overall discourse on Ukraine has taken an overwhelmingly negative turn. It's astonishing how rapidly and dramatically the narrative has shifted. While I've never shied away from acknowledging Ukraine's flaws and expressing my fair but critical opinions throughout the year, I find myself perplexed by the sudden and widespread shift in sentiment. Is it solely due to the realization that the counteroffensive, has unequivocally failed? Did people really a month ago believe it didn't? Did the acknowledgement from up to, allow now finally for negative discourse in regards for Ukraine?\n\nNow, blame is being cast in all directions—towards the West, the Ukrainian people themselves, and the Ukrainian government. The blame game is in full swing, with everyone finding someone to fault. While there may be some truth in each perspective, it's hardly just one thing being faulty.\n\nCertainly, there are still commendable pro-Ukrainian individuals who skillfully quote the one propaganda line that makes it sound good for Ukraine in an otherwise negative article every day . Nevertheless, the constant blame game has made discussions less engaging. It seems that whenever a challenging aspect of Ukraine is brought up, people are quick to point fingers rather than engaging in a constructive dialogue.\n\n \n\nAlso, I think people are ridiculous in how fickle opinions are. Crazy, to be honest. Not much that's happening is actually new. We knew pretty much everything to some degree, in large parts thanks to the Pentagon leaks.",
            "I was browsing r/ukraine for my daily laughs when I noticed people commenting about “Crimean Beach Party 2024”. These people really are living in fantasy land snorting lines with Zelensky",
            "I want the war to end in a definitive way that resolves the conflict, so we’re not all right back here 12 years from now.",
            "Like 482 days ago.",
            "I think the misunderstanding goes way beyond that. \n\nWhen putin is agitated and extremely annoyed that \"the west has gone completely crazy and is destroying everything, therefore the west must be contained\" he is talking about Kanye West.",
            "They will get what they want most likely. A lot of people are already dying but safe to say it hasn't truly started.",
            "Saw this lol, at least a lot of the commenters did point out how dumb and unrealistic the scenario would be, gives some faith in humanity",
            "[deleted]",
            "What's the context of this? Also if that's the official territorial defense account I can't believe the clown world this has become with the way they publicly communicate. Then again I don't have Twitter so I was probably living in blissful ignorance anyway lol",
            "Nothing screams out \"I'm in control\" more than someone coming for the King, missing, and walking away without consequences. It's absolutely bizarre that Russian became the hostage of a hotdog seller turned mercenary leader",
            "Can someone explain what is he even trying to claim here? Why would Soviets bury this history? How does Russia use it against Ukraine? This doesn't make any sense.",
            "I think when people look at the media, there's a lot of \"attributing to malice that which can be adequately explained by stupidity\" going on.\n\nThe fact is that journalism has always been a shit career that has only gotten much worse since the slow demise of print media.  Add to that the constant pressure to churn out a high volume of articles with fewer and fewer staff, and obviously proper due diligence in background research is going to be the first thing to go out the window.  I myself worked in media early on in my career (not as a journalist/editor) and saw this happening first hand.  It's all about just delivering *something* in a timely manner over actual quality.  As long as the average idiot isn't going to notice obvious mistakes in your work, it's good enough.  The publisher/executive editor will probably have a select few prestige projects that they think will win Pulitzers that they give their favorite reporters a lot more leeway on to do a good job, but for the high volume of stories it's going to be just fucking do it already.\n\nI doubt that even higher end publications can do much to attract top minds away from working in the corporate world and making huge $$$, especially subject matter experts in technology fields.  And even if they do give it a try, they'll quickly get fed up with the way things work and quit anyway.",
            "Holy moly! I knew there was an uptick in NAFO style talking points and degradation in quality of conversation. That’s crazy that it’s actually allowed - isn’t it literally brigading?",
            "> Why is this even allowed?\n\nIt isn't, it's called brigading and against Reddit rules.",
            "I think thats callled brigading",
            "/u/ZelenskiysHighHeels you're famous among the NAFO crowd",
            "It seems like a frequent Pro Ukrainian poster u/Bochnik_cz is part of the cabal of neckbeards known as NAFO. Seems to be calling for them to brigade the sub, but he can't do much with a ban from the sub.",
            "As long as they respect the rules NAFO is welcome. If they come to argue politely I see no problem.\n\nIf they come to downvote, attack users and report abusively then we or Admins will ban them.",
            "Reminds me something. Like /r/sigmarxism are after /r/40klore, /r/enoughpetersonspam after /r/JordanPeterson , etc.\n       \nHappens with every rational neutral place - from particular groups of people, where unconditional acceptance of corresponding facets of the globalist political propaganda is seen as a virtue.  \n       \nSome animals are more equal than others, and this kind of people is getting punished by moderators to a lesser degree. /u/inconvenient_human can see that as a technique, being used for preparing color revolutions and similar things (blm).\n\nhttps://unherd.com/2020/01/cast-out-how-knitting-fell-into-a-purity-spiral/",
            "Well, this end of an era will take more than just one year, emergence of new new world order is not tailoring very swift, you know.",
            "We are so back, whatever news it is good or bad we'll face it.",
            "Thank you for the update on the updates! o7",
            "I guess some consider the entire Russian invasion to be their offensive, and any attack against territory they control is a counteroffensive.",
            "Very interesting post\n\nThe poster is obviously biased for Russia. But the way he interpret the event (with geolocating) does show the Russia is cooking something up there. \n\nUnfortunately we don't know whose narrative is true. Only time will tell really. If the pro-Ukrainian is right then Russian loss will mount to nothing. If the pro-Russian is right, then Avdeevka will fall one step at a time like Bakhmut",
            "As a Hungarian reddit kinda depresses me.\n\nAll these western forums engage in worse censorship and propaganda than our government yet the people who criticize the government on r/hungary refuse to see it when censorship benefits them. Anti-government people are even more brainwashed than pro-government people.",
            "The irony is incredible. There is a star of david on the arch showing the bounty the Romans recovered from Jerusalem and now here we are 2,000 years later. Crazy.",
            "[removed]",
            ">  As far as I know, it's not explicitly against their rules\n\nOfficially no, but the mods will remove it if it doesn't get downvoted.",
            "Used them and then dumped them. On to the next war.",
            "Like others said it was not a mistake, it was by design. And this was not a conspiracy theory either\n\nProf. Jeffrey Sach helped carrying out US economic reform in Poland to great success. But when he tells the US government that they could/ should do that in Russia too, he was told to go kicking rocks.\n\nIt frustrated him greatly to this day. You can watch any of his interviews about the topic, and he will tell the story in great detail.\n\nA strong and independent Russia, even if it is a liberal democracy, was not in US interest. They want weaker vassal who will follow their foreign policy at every step. Like German, who even I, thought was a strong independent state. But then they cheered on Israeli genocide, clamp down Palestinian protest, right after condemning Russian on their humanitarian aggression. Not to mention watching the US blew up their own  natural gas pipeline (the lifeline of the economy) is forced to buy natural gas at triple price from the US, and can't even muster any protests. That's when i realised that German is just another US vassal state.",
            "it's 254,381 now because I am dead after reading that",
            "This goes against my beliefs which I have formed from official NATO narratives so therefore This is Russian Propaganda™",
            "The köpe on that post was unreal lmao.",
            "Wow! That seems amazingly crazy! I wonder how they thought that could result in something good? Even if they managed to cross the river and take the plant without the battle leading to a disaster, there would still be the issue of holding it. They would need to bring supplies accross the river by boats, and there would probably be dangerous counterattacks.",
            "Mad respect he actually went through with it (although he would always be reminded probably if he didn't do it). Hope he comes back though, he wasn't the worst person here.",
            "Despite what some people say, this has to be one of the best subs for providing a equal view on the conflict. All the larger ones end up slanting more towards a Pro-Ukrainian viewpoint, and some of them ban anyone repeating Pro-Russian talking points. The only problem here is when the b*ts brigade the sub with low effort posts and comment the dumbest things.",
            "I hope it doesn't go too downhill because I don't know another English-speaking place that has content and discussion from all sides.",
            "\n> They are gonna genocide them\n\nI’m very worried about this too and more people in the west should be concerned.\n\nIsrael announced they would totally blockade food and water to Gaza. Considering how little food was in Gaza prior to the war and whats likely going to be a brutal urban siege, the Palestinians who aren’t killed in the fighting are unfortunately going to starve. \n\n\nThat said, I don’t understand why you keep wanting to die on the hill about those ravers getting massacred. \n\nDo you  expect people to have zero sympathy for non combatants who got massacred?",
            "According to Al-Jazeera 324 people have died and over 1000 injured in the last 24 hours alone. \nAnd 66% of the victims are women and children.",
            "Israel is going to collectively punish the Palestinians, the West will standby and watch, the Arabs won't/can't do anything about it.\n\nOnce they've had their fill though you can expect the carnage to fuel more hatred for another couple of decades.",
            "When Trump striked Iran \"Stop this now drumpf you're causing WW3\"",
            "It's a sad world when we're considered the pinnacle of normality. We have plenty of crazy here, but other subs have almost exclusively crazy.",
            "Two cowboys are riding across the prairie. One says to the other:  \n  \n\"Joe, I bet you a hundred dollars you won't eat my shit.\"   \n\"I will,\" replies the other.    \nThey make the bet. Joe eats it, and Bill has to hand over a hundred dollars.    \n    \nThey ride on. Joe, feeling a bit embarrassed about what he did, says:  \n  \n\"Bill, I bet you a hundred dollars you won't eat my shit.\"  \n\"I will.\"  \nThey bet again. Bill eats it, and Joe hands over a hundred dollars.     \n   \nAs they continue riding, Bill suddenly remarks:  \n   \n\"Joe, it seems to me that we just ate shit for no good reason.\"",
            "[deleted]",
            "The interesting part is how desperately they are all trying to discredit this article on social media. They claim that this is nothing but anonymous sources (except the named ones), and claim that the author has done nothing but write hit pieces and Russian propaganda about Ukraine since 2014. \n\nThe author wrote the time Magazine Person Of The Year article for Zelensky... Lmfao\n\nOh yeah he also committed the worst crime of all, being Russian",
            ">Despite the recent setbacks on the battlefield, he does not intend to give up fighting or to sue for any kind of peace. On the contrary, his belief in Ukraine’s ultimate victory over Russia has hardened into a form that worries some of his advisers. It is immovable, verging on the messianic. “He deludes himself,” one of his closest aides tells me in frustration. “We’re out of options. We’re not winning. But try telling him that.”\n\nFucking YIKES lmao and even now NAFO pretends Ukraine is winning.\n\n#**Zelensky's own closest advisors think Ukraine is losing and that Zelensky is DELUSIONAL.**\n\nRead and re-read all of this slowly, Ukroshílls. You know who you are.",
            "Holy shit this is crazy from a western publication",
            "Pretty crazy the Ukraine abstained. Seems like a sovereignty problem.",
            "The US government will never risk a “headache state” in their “backyard” so why they continue this policy on Cuba. In terms of international relations, Cuba can be used against the United States. \n\nCuba is just a Taiwan, Israel, Pakistan, Ukraine, or Kosovo type of state, but now it’s against the US government itself. US doesn’t want to taste their own medicine, especially after that 1962 event, so Cuba needs to remain outlawed from the US government perspective.",
            "Inb4 UN is useless or USA is right and everyone is wrong",
            "One would think the situation would be easier given the reported 1:27 casualty ratios in favor of Ukraine.",
            ">Does russia use barrier troops, stationed behind front line keeping the  russian soldiers from fleeing by making sure their survival is greater  if they stay at the front and fight the chance of survival is greater  than fleeing back to the barrier troops. Is this true? Is Ukraine using  barrier troops as well?\n\nhis reply\n\n>Yes, this is well documented on Russia's side. [https://www.theguardian.com/world/2023/mar/27/russian-soldiers-commanders-used-barrier-troops-stop-retreating](https://www.theguardian.com/world/2023/mar/27/russian-soldiers-commanders-used-barrier-troops-stop-retreating)In regards to Ukraine using barrier troops, I have yet to hear any stories or see any substantial reports.\n\n&#x200B;\n\n> Does Ukraine have conscription as russia did? In Russia the men were (or  still are) afraid to be conscripted, are the Ukrainian men afraid as  well? \n\nhis reply\n\n> Yes.  Both sides use conscription.  I know people from both countries who are afraid of being conscripted as well. \n\nThats about all you need to know about this \"independent\" jurnalist",
            "I'm not sad for them at all. Screw those fellas. They are contributors to the atmosphere of delusion that allowed the suicidal counteroffensive to proceed the way it did, leading god knows how many Ukrainian men to their senseless doom.",
            "CIA is the cancer of this world",
            "So, what are the bets now?  \nIs Zaluzhny wounded and undergoing a treatment?  \nHiding in a bunker and preparing the hyped assault?   \nIsekaied to another world?",
            "are they still pretending they're following OPSEC and can't share their advances? \n\nthat shhhh campaign was cringe",
            "When even /r/worldnews sees it for what it really is, you know it's fucked up. How can the US/EU explain not imposing sanctions upon Israel when a precedent is literally still ongoing? \n\nRules-based order strikes again",
            "lmfao remember when nancy pelois and crew wore those african garments and kneeled down on the capitol floor after george \"not born in africa\" floyd was killed?\n\nI hate all of them so much lol",
            "Absolute fucking clownery.",
            "Another senseless death. I really wish there could be an armistice and negotiations instead of more war and drafting.",
            "What the hell is that post? Guy literally wrote an essay worth of words for a Reddit post.",
            "Pinned right under this thread",
            "[removed]",
            "Extreme partisan fishing, to deprive the occupiers of fresh-water delicacies.",
            "Who thought a warlord like Prigo would actually  be a smart stateman as well? As an African, his words ring true. There is an anti neo colonialism wave in Africa and Russia has tapped into the pulse of it. Same way it did during the colonial liberation struggles and wars.",
            "It's been pretty high for a month now. It feels too high, honestly. It sounds so much like there is going to be a coup any day now that it makes me wonder if someone isn't feeding us some TMZ level gossip. Either Washington either wants this talk or else so the situation is so out of control that Washington can't put a lid on it.",
            "I did read the article and it seems to be pretty down on earth and expected in that situation, I don't know why they are so annoyed.",
            "the double standards in the west are just sickening...and they wonder why the rest of the world is fed up",
            "The weird thing is not how many fewer posts there are but how many fewer comments there are on the posts that are here. Like have there actually only been 50 of us humans here to start with?",
            "I'm still having a hard time believing these leaks are true. It's Ukraine entire air defense mapped out in great detail. Even showing the amount of missiles on hand. Just Amazing.",
            "His bias is known, but he tries to be Objective, which is rare for a pro-western commentator/blogger.\n\nI also appreciate his interviews with mercenaries/foreign fighters.",
            "Fanning the flames? There are literal videos of Wagner engaging Russian aircraft. \n\nThe flames are fanning themselves my man",
            "Yesterday the AFU managed to capture about 50% of the settlement, now the Russian army has sent reserves and the AFU had to change to a defence on the captured area, it is reported that the reserves of the Russian Armed Forces are attacking not through the centre but on the flanks, which threatens the encirclement of the AFU forces. I think in 2-3 days everything will be over for one or another side",
            "Do not waste time.",
            "unbearable",
            "> a team of two soldiers \n\nwtf is this, some new insane military doctrine? This is like that scene in matrix revolutions when they send two guys to disable the machine digging...",
            ">from Turkey\n\nLet that sink in for a while.\n\nWhich alliance is turkey part of again?",
            "And Ukraine is fked in Robotyne now too.\n\nFlat land. Surrounded from 3 sides. No hard structure to hide in. Can't withdraw cause of the sunken cost fallacy. It is like a dead trap that the Ukraine chose to stay in",
            "Based on my experiences, this often means some important agreements already were made. This sort of 'forum' for the Russians (and for the Chineses) most of the time is just their celebration party. \n\nThey don't go to a conference/ forum to discuss things. They discussed things, sorted out all of the dot and the T, and then set up a forum to announce to everyone on their achievement.",
            "IEA is really fucking OPEC sideways, left and right. OPEC is out of options. Saudi needs oil to be above $80 to be profitable and US never allows is to go above $75. At this rate Saudi reserves is depleting and you can see they are selling of their treasury bonds. Saudi could halve their output and IEA next day: \"Oil demand has halved and our reserves have gone up 50%\", oil falls even further.\n\nIts all mind games going on on top level.\n\n\nUS also forced Saudi to sell its stake in Sam Altman's AI startup. Saudi's twitter stake will also soon be worthless.\n\n\nRussia is also getting BTFO with lower oil prices and my sources tell me that India is insisting Russia pay for shipping prices.\n\nThere is bit of respite for Russia though. China has built a ton of shipping carriers for oil and LNG and they dont use western insurance. They will soon start shipping (and charging Russia!)\n\nNot an easy situation for either Saudi,Russia or China. India is going googoogaa over all the deals and US also started manufacturing in India leaving China; though Indian efficiency is an absolute nightmare compared to China and will take decades to catch up to China.",
            "Most of them are broadly pro-Western/pro-US foreign policy agenda. Since the US supports Israel as well as Ukraine, they generally support both.\n\nSomething else to note is that the percentage of Americans that support Russia is relatively small. Plenty are neutral and oppose Ukraine aid, sure, but the number that legitimately believe Russia is the morally correct side in this conflict is only about 2-3%. This contrasts with other conflicts like Israel/Palestine, where a considerable percentage of the US population support Palestine despite US government support for Israel. In my opinion, this is just because Israel/Palestine has been going on for longer and Israel receives less aid than Ukraine currently does. Back in the 1960s and 70s when US aid to Israel first started, pro-Palestinian sentiment was almost non-existent in the US. Moreover, if you look at surveys in places like India, China, the Middle East, Africa, South America, etc., you'll generally see more divided opinions on who's morally right in the Russo-Ukraine conflict. \n\nGenerally, sustained US opposition to a particular nation or group is only going to be ironclad if American troops are in overt conflict with them. You never saw a majority of Americans supporting the Vietcong, for example, no matter how unpopular the Vietnam war got. So unless American troops are ever directly fighting Hamas or Russia, you'll at some point see American citizens supporting their sides in their respective conflicts.",
            "They don't want to make the investment in increased production. They would have to sign long-term contracts.",
            "Capitalism.",
            "They are winning on the front that matters. 9gag comment sections.",
            "He switched up his rethoric... again. He flip-flopped between being soft on Russia and being hard on Russia quite a few times during this war, earning himself disapproval from both sides of the conflict. He claims to be objective, yet you can clearly see (and many UA/RU people have noticed) his sudden tone switching, indicating that he's more concerned with building narratives to suit his personal needs at the moment.",
            "Those Russian bloggers were really damn accurate.",
            "Somebody should ask his family member who brought him to the parliament. What the hell was he thinking?",
            "The censorship and propaganda is too me so much more dangerous than anything on the planet including nuclear war.\n\nI understand how the nazi's came to be how a seemingly normal people can be made to do horrible things and its a slow trickle of propaganda over decades of time dehumanizing people or making people feel morally superior.\n\nIts why free speech is super fkin important.",
            "This has always been a problem with megathreads and why they're abused by mods.",
            "I am from India and giving an honest opinion which benefits my country from my understanding. No morality taken into account here. \n\nA stronger Russia helps india easily. With the political capital of not voting against Russia in Un, buying oil undercutting sanctions, India is in a much better position.\n\nObviously russia won't help india everytime but their occasional veto now and then will be highly valuable.\n\nIt's funny how I don't like the current ruling part of India for becoming more undemocratic, cutting the knees of public institutions and checks and balances. But I will support russia a full fascist state.\n\nGeopolitics is hypocritical I guess. I would happily ignore the hypocrisy of US too if only the Govt officials and media didn't act like they are the epitome of moral high ground. But they don't and it really infuriates me.",
            "Morally I support Ukraine - they have the right to self defence and to self determination, which Russia have violated. \n\nHowever being from the UK my criticism should go to where it holds any weight (small that may be) and that's towards my government and media. I find the goals of our support for Ukraine unclear and the bellicose nature of that support unhelpful. I don't think Ukraine can truly win - which is to say, fully defeat Russia and retake Crimea - and we certainly aren't giving them enough support to do that if they even could. So the end goal surely must be to create conditions for a favourable peace - but the support and rhetoric doesn't seem to match that either.\n\nMy worry therefore is that the UK foreign policy is completely one dimensional - let's give Ukraine random support, shout at Russia, and see what happens. Which I find both irresponsible and dangerous, and uncaring of the lives spent in the now seemingly stalemate war. \n\nI am hoping that if and when Ukraine's offensive stalls out, as seems to be happening, both parties can see the fruitlessness of the conflict and peace negotiations can begin in earnest. Unfortunately I worry that Russia will just be emboldened by their successful defence, and seeing their growing air superiority, will launch more attacks. If those were successful I truly sorry NATO would intervene and cause a massive escalation - people are already saying they would support that in some places, which was unthinkable a year ago.",
            "I dont want anyone to win. I just want the war to end. Ukrainians and Russians are one of the most intelligent people I have come across and I always struggled to hire them for my startup from India since the wages for Ukrainians/Russians are 6x that of average Indian.\n\nAnd then I see this war where these humans are dying for nothing.  Please just join my startup with my wages I can afford and give me your brains!",
            "Some of this is strictly bizarre. Apart from his overall fit of pique, the richest bit is claiming that not promising Ukraine membership is giving Russia motivation to wage war--despite the fact that plans for membership have been an impetus for war. Like if they just popped some champagne bottles and declared Ukraine engaged to Nato peace would magically appear? Perhaps Russia would get quite dispirited at learning they had been declared vanquished at Vilnius and go home with its tail between its legs? This is weirder than stuff that gets posted here.",
            "Imagine the US government having the worlds currency and biggest economy for decades and not even using it to improve the lives of Americans, but instead using it to start wars and sanctioning other countries, priorities. \n\nTo quote Osama Bin Laden’s non-terrorist son Omar, “I was still in Afghanistan when Bush was elected. My father was so happy. This is the kind of president he needs, one who will attack and spend money and break the country. Even Bush's own mother says he is the biggest idiot boy of his family.”\n\nUS government in recent years always had the wrong priorities, war instead of economics. Definitely a decline in the US world order.",
            "I wonder why that is...",
            "Be the change you want to see in the world.",
            "[removed]",
            "The whole thing had a flavor of WWE rehearsed drama. Best not to pay too close attention to that stuff.",
            "Everything is propaganda. You maybe mean, how to identify what's true and what's false ?\n\nThe answer is critical thinking. But there is no simple recipe, it's a difficult and complex skill.",
            "Let's examine a post right after yours.\n\n> Tomorrow is the 5th of July. Ukraine has announced that there will be 'Russian' provocation in the Zaporizhia nuclear power plant between the 5th and 7th of July. There have been multiple videos coming out from Ukraine to its citizens on how to deal with a nuclear fallout. I have linked below an interview made on the 29th of June by France24 to Rafael Grossi (IAEA General Director) who categorically denies any Russian military activity at the nuclear power plant.\n\n> Ukraine chances of doing anything significant before the upcoming NATO summit is less than 0. So they are either planning Chernobyl 2.0 and blame it on the Russians or they want to celebrate the 4th of July with the biggest of all booms as Ukraine is de facto a future American colony courtesy of Blackrock.\n\n> IAEA saw no evidence Moscow planning attack on Zaporizhia nuclear plant, but 'anything can happen\nat around min 5\n\n> Q: Zelensky says Russia moved vehicles with explosives onto the NNP & mined cooling ponds. Does your team on the ground sees this?\n\n> Grossi: I would never argue with Ukraine's President but I can say I was there and didn't see this kind of development. Our teams are there and report everyday.\n\nThis is posted by a neutral user, but it's nothing short of pro-Russian propaganda. The user may not even recognize that they're parroting Russian propaganda, but they are. \n\nHere are some telltale signs of this being a regurgitation of Russian propaganda.\n\nThe second sentence puts Russia in quotes. \n\nHere it is\n\n> Ukraine has announced that there will be 'Russian' provocation in the Zaporizhia nuclear power plant between the 5th and 7th of July.\n\nWhy? Why would the author of the post need to put the word Russia in quotes when reporting what Ukraine announced? What are they trying to convey? \n\nI'll tell you. They're attempting to discredit Ukraine's claims.\n\nThen there's this sentence:\n\n> I have linked below an interview made on the 29th of June by France24 to Rafael Grossi (IAEA General Director) who categorically denies any Russian military activity at the nuclear power plant.\n\nIt claims that the interviewer denies **any** Russian military activity near the nuclear power plant. \n\nThat is patently false. The plant and its surrounding area are currently occupied by Russian military. If they weren't Ukraine would have taken it over by now.\n\nThe next paragraph is where the propaganda begins to flow freely. First, they claim that Ukraine, who had to deal with the ecological and economical effects of Chernobyl would want a repeat of that, then they claim that Ukraine is a de-facto colony of US. \n\n> Ukraine chances of doing anything significant before the upcoming NATO summit is less than 0. So they are either planning Chernobyl 2.0 and blame it on the Russians or they want to celebrate the 4th of July with the biggest of all booms as Ukraine is de facto a future American colony courtesy of Blackrock.\n\nThis claim of Ukraine can't be an independent country and therefore must be a colony of Russia or US is a tired trope in Russian propaganda. \n\nThe next paragraph after that is using  IAEA  nuclear experts as a source of truth about things they're not experts in. \n\n> IAEA saw no evidence Moscow planning attack on Zaporizhia nuclear plant, but 'anything can happen at around min 5\n\nIAEA are not counterintelligence experts. Nor are they military experts. Them not seeing evidence does not mean Russia is not planning it. Or as they say \"absence of evidence is not evidence of absence.\"\n\n_____\n\nSo, what can we learn about Propaganda from this post? \n\n1. Using experts outside of their domain of expertise to push a narrative.\n2. Quoting an expert, but then interpreting their quotes to mean whatever they want it to mean, such as claiming that IAEA denies **any ** military presence.\n3. Pushing completely unhinged narratives that have nothing to do with the content they're quoting or discussing, such as referencing Blackrock or claiming that Ukraine is a colony of US.",
            "Russia: We are fighting  war of attrition\n\n\\*\\* before counter offensive\n\nUkraine: after those leopards we will smash you with combined arms and take melitipol and attack crimea\n\n\\*\\* currently\n\nUkraine: We are fighting a war of attrition",
            "\"Ukraine is doing poorly, but somehow Russia is worse off.\" These people always have to insert propaganda don't they?",
            "Nice. Someone should compile a database, or link one. Counteract some of the \"It started when the Ruzzians invaded\" stuff. \n\nHas anyone noticed how crappy the past news search features have gotten the last few years? Google especially. You can set the thing to search for articles between 2013 and 2015, search for Ukraine, and just get the message that's coming out now. The search giant with the lion's share of searches making the collective memory very miopic...",
            "Where is he getting support from exactly? Qatar and the West? That's not really gaining support. Those countries were already on Ukraine's side.",
            "What is left of their \"goal\" is to be realistically achieved though? \n\nThey've got control of the major ethnically Russian spots, already failed in a KO blow against the Ukrainian regime/Kiev and a decent chance they'd fail if tried again. The further away they get from the Donbas/Crimea the more Ukrainian Ukraine gets and thus the population less controllable so they probably never had serious ambitions on occupying the entire country (install a puppet regime perhaps, sure)\n\nConsolidation of the currently occupied regions and then achieving a political settlement w Ukrainian recognition of loss of these territories seems like the most real thing. \n\nMaybe a Russian offensive to put themselves in a better spot at the negotiating table is more of a consideration than any territorial ambitions at this stage",
            "> when we increase demand, we want more supplies, not higher prices\n\nSomeone missed the first class of economy.",
            "Wait, wait wait!   \nSooooo, Russia is using North Korea's ammo, and Ukraine is using South Korea's ammo?   \n\nHow is this not weird to anyone?",
            "It's a pretty big mess. It seems likely that something will get through just because politicians are the main group of Americans among whom the war is still popular. If the Republicans in the House wanted badly enough to stop it they certainly could--some package would get enough votes if it was voted on, but Johnson doesn't have to let it be voted on--but it seems like there may have been a compromise when Johnson became speaker to be open to something, at least if a majority of Republicans support it. Of course the concessions to get it through might be poison, so it could get held up or stopped based on that. So in general there are a tons of ways it doesn't happen but probably still more likely that it does.",
            "Last big visibility prop up before primary season starts   \n\nFor the next 18 month, starting with florida man bad vs orange man bad",
            "The contrast at the end between him saying he still loves her and his obvious suffering and her saying she’s happy and apparent indifference is quite something. Ice cold heart if one is to believe the quotes.",
            "r/worldnews banned me for 'trolling' because I said there was video of US patriot system got hit, that proved the whole 'Ukraine shot down 100% of Russian missile to be lying'\n\nNot even 24 hours later, even the US government admit part of a Patriot system got damaged by Russian missiles",
            "[removed]",
            "just fyi, r/canada is the correct Canadian reddit. This one is obscure and run by only one mod take whatever is posted there with a grain of salt.",
            "In fairness, serious people in the U.S. military establishment said that Russian attacks on infrastructure were probably not war crimes (because they were smart enough to know that America would want to do it again in the future). Of course, Israel has definitely taken it to the next level when they explicitly state that their intent is to cut off all food, water, power, etc.",
            "What’s hilarious about them is they now admit “ok we downvote Russian but just search by controversial” \n\nGo search controversial for the last week and tell me how many ru pov vids you find lol. \n\nAnd by the way apparently Reddit admins told them even hamas POV was bannable for glorifying terrorism. \n\nAs if there aren’t daily posts of terrorist groups on there lol",
            "[deleted]",
            "It is not even a prediction\n\nThe Israeli openly state that they want to 'expand Israeli security zone' to like 40% of Gaza.",
            "There isn’t. I think the closest you get is /r/GazaInvasionFootage for Israel and Palestine but that is very small, but anything Israel/Palestine related on this site is just a “you’re either with me 100% of the time or against me” echo chamber",
            "It is definitely weird. I have never much looked at that sub, due to its reputation, but it is  unusual how few posts get upvoted with decent numbers at all (mostly Ukraine and Gaza) and then the CIA director is at 1.4 K and counting. I don't know if that is strictly non-organic upvotes or if certain stories get promoted elsewhere (e.g. the front page).",
            "I read it pretty exclusively for the comments from two users, Larelli and Duncan-M, who post great analysis. There are few users there with actual military experience.\n\nThe rest of the content isn’t particularly different from the rest of Reddit, just includes more text to sound “credible.” Users generally interpret everything in the most pro-Ukraine way possible to fit their biases. Prediction quality is no better than here.\n\nThat said, I appreciate that the sub moderators recognize that’s the case and at least make people organize their posts and keep flaming down.",
            "[deleted]",
            "Training conscripts and NCOs will only get you so far. When your leaders make you drive MaxxPros into minefields, it doesn’t matter if you got a NATO drivers license",
            "The implication is that more Ukrainians will be forcibly conscripted.",
            "It's a reply to this tweet from Julian.\n\nhttps://twitter.com/JulianRoepcke/status/1667418018370945024\n\nYes that is the official account for the TDF.",
            "He just lies. In 1961, after visiting the place of executions, Yevgeny Yevtushenko wrote his famous poem \"Babi Yar\", which formed the basis of D. D. Shostakovich's 13th Symphony.\nIn the 1960s, mentions of mass shootings in Babi Yar appeared in the Soviet press. In 1966, an abridged version of Anatoly Kuznetsov's documentary novel Babi Yar was published in Yunost magazine.",
            "They are pushing extreme propaganda as much as possible. Black is white and white is black",
            "Whoever supports the *current thing* is allowed to do that. \n\nBad people try to trick good people into thinking critically. Emotions are much more important than any factual information.",
            "they triggered just by existence of pro RU flair, yea, they would respect rules for sure.",
            "As is tradition.",
            "It's the current leadership, Schultz is weak and an Anglophile. There is a reason this war didn't happen during Merkels time in office. Merkel understood that Ostpolitik is very important for Germany and Europe",
            "> I hope it doesn't go too downhill because I don't know another English-speaking place that has content and discussion from all sides.\n\nJust go to wherever the pro-RU content is allowed, the pro-UA will naturally follow and try to counter the narrative, they can't help themselves.",
            "\"No, Bill, we increased the US GDP by two hundred dollars and created two new jobs.\"",
            "TIME 2022 Person of the year Volodymyr Zelensky /  by Simon Shuster / December 7, 2022     \nhttps://time.com/person-of-the-year-2022-volodymyr-zelensky/  \n       \nTIME Inside A White Supremacist Militia in Ukraine / TIME Correspondent, Simon Shuster, travels to Ukraine in the summer of 2019 to investigate white supremacists militias that are recruiting people to join their fight.     \nhttps://www.youtube.com/watch?v=fy910FG46C4\n  \n      \nTIME Why Arming Ukraine Would Only Make Matters Worse / by Simon Shuster / September 3, 2014    \nhttps://time.com/3264472/arming-ukraine-will-not-end-this-conflict/",
            "Yep - he is ordering offensives on cities and **his senior commander are ignoring the orders** **due to a lack of manpower, ammunition and weapons.**   He is also demanding the offensive not stop over the winter.  If this is all true, and taken at face value, he could push the Ukranian military towards a collapse OR a coup.",
            "They're a really good case study in what happens if you spend too much time online or in a bubble\n\nEcho chambers are one thing but they were actively supported by the strongest media apparatus in the world and it made them delusional",
            "Right? God forbid some brown people fight for their freedom. Only the White man and his Nazis have that right apparently.",
            "Lot's of alt-accounts especially from that welfare collector youknowwho",
            "Team Erdogan.",
            "  *It is like a dead trap that the Ukraine chose to stay in* \n\nThe mainstream narrative for the Battle of Bakhmut was that the RU forces,  besides charging into MGs,  were inept,  and incapable of pushing UKR forces out the city.  However,  it may also be possible that RU forces chose to prolong the battle.  With an obvious positional advantage,  and dominant artillery/mortar fire, why waste troops with a costly urban assault?  As long as Zelensky opted to deploy more troops into the cauldron,  despite advice from the Secretary of Defense Lloyd Austin,  keeping the status quo was acceptable.  \n\nDanilov \\[UKR\\] claimed a casualty advantage of 7.5 to 1,  but Budanov \\[UKR} admitted the RU forces were firing 20k shells per day \\[down from 60k previously\\].  \n\nMy guess is that Robotyne might be the next Avdiivka, but I doubt there's a rush.",
            "Indeed.",
            "America: where its people live paycheck to paycheck and the country lives war to war.\n\nBut on Reddit they will go around swinging their schlong about GDP etc",
            "interesting comment there\n\n> The original Open Asia article is on archive.org : https://web.archive.org/web/20160125040849/http://openasia.asia/ukraine-as-a-solution-rethinking-living-with-russia-for-europe-1311\n> \n> There is a comment under that archived article by Shiping Tang on June 26, 2014. It reads as follows:\n> \n> As the author of this piece, I feel much sadness that my prediction (or warning) came to become reality, and even elites in Ukraine could not grasp the dire situation their country faced (before the war), until the wham on their face.\n> \n> Here is John Mearsheimer’s reply after reading this piece. “Wow! This is a great piece, and to think you wrote it in 2009. It is so amazing that you could not get the piece published. That speaks volumes about the state of the discourse about foreign policy in the West.“",
            "This is what they call prescient analysis.",
            "The power mod who banned me is a avowed socialist who got mad I called out his support of literal Neo Nazis lol",
            ">“you’re either with me 100% of the time or against me” echo chamber\n\nThe irony is that I'm more pro Israel than pro Hamas, cuz I detest radical islam. But I'm not some idiot who's gonna pretend that the IDF is conducting this war humanely",
            "That goes without saying. But even with their aggressive conscription policies, they are still consistently missing their recruitment targets by *50%*? That sounds...completely horrible and unsustainable? Am I overestimating the significance of this figure? I can't even tell.",
            "For a developed country, United States has low living standards compared to EU countries, Canada, Japan, Australia, etc. I don’t understand why they think it’s a good idea to spend all this money abroad instead of the home country.\n\nUS President Lyndon B Johnson wanted to be remembered for his Great Society program, but he decided to expand the Vietnam War, and that took away budget from the GS, something that saved American lives, not take them, like the Vietnam War. Imagine if the US government never got involved in Vietnam, the GS could have been properly funded and succeeded. \n\nAll that War on Terrorism money should have been money used in the United States, but nope, the US government rather fight these enemies that barely existed than help Americans."
        ]
    },
    "Civ pov Pictures in Comments are back, but...": {
        "title": "Civ pov Pictures in Comments are back, but...",
        "score": 141,
        "url": "https://www.reddit.com/r/UkraineRussiaReport/comments/1btbi9w/civ_pov_pictures_in_comments_are_back_but/",
        "content": "They are only the be used to add context to the post such as Hardware / Maps. Any Shitposting or memes will result in a ban ( possibly permanently). We would like to keep them, so don't abuse this. ",
        "num_comments": 72,
        "comments": [
            "I miss prigozhin memes in comment section",
            "I will miss that photo of Zelenskyy in a barrel plane that occasionally appeared in the comments",
            "a sub without memes is like a war without Prigo, come on...",
            "Tbh some pictures were comedy gold and gave me good laughs many times, shame they can’t come back",
            "Unfortunate, but understandable, given how fragile these \"controversial\" parts of Reddit can be. One wrong post and the entire thing is vanished by the website admins.",
            "do warn for the first day of errors first.",
            "lameeeeee",
            "Hmmm... Sad we can't do memes... But yeah, better follow the rules than never....",
            "Booooooo! It's a minor inconvenience but life goes on.",
            "Didn’t even know this was a thing in the first place. I was still able to link pictures since forever.\n\nLike [this.](https://styles.redditmedia.com/t5_613zyp/styles/communityIcon_x9j02tikrtp81.jpg?format=pjpg&s=9aef60d6b70bce4e2233c542bc065f85ea6251d6)",
            "I miss the Vilnius of Z on his own looking very annoyed with the caption\" I still get my money don't I\". But that said understand and accept the reasons why. We need to look after this place, or we will lose it, and we know how that feels now.",
            "Could we not have just one stickie where we can run riot within reason with shitposts and memes which can be ignored by those that wish to? Maybe without karma to discourage abuse ?",
            "Yes finally!",
            "[removed]",
            "[removed]",
            "Shitposting rule is what make this sub great!\nNot only that meme littered sub is a cesspool, but posting memes on a war sub, where there are often dying people videos is just tasteless.\n\nI don't car if it's nafo or russian bot army. Both are disgusting.",
            "p\n\n\n\nL",
            "[removed]",
            "I think it’s fair if pro ru can post the plane if pro UA gets the pointing Prigozhin",
            "The ghost of kyiev.",
            "If this war has given us anything, it was good memes",
            "[removed]",
            "It is still Hardware, yes?",
            "[removed]",
            "There are no less funny photos. Two admirals, American and Ukrainian, solemnly take part in the parade of the Ukrainian Navy on the occasion of replenishment in 2008. The Americans handed over 70 rubber boats to the Navy. Each boat has a proud captain and crew.",
            "No warning, guaranteed min. ban, severity based on previous bans and content posted up to permanently.",
            "We've never allowed memes or Shitposting here, but you are welcome to do it all day on our Discord.",
            "https://preview.redd.it/t2kr9n5f6xrc1.jpeg?width=1080&format=pjpg&auto=webp&s=c00209be0b65099c6d308100c959a159f4995599",
            "It wasn't activated until now.",
            "No, but go wild on Discord if you can handle it. \n\nhttps://discord.com/invite/Wuv4x6A8RU",
            "Sorry, You need to verify your email with Reddit to comment. This is to protect against bots and multis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineRussiaReport) if you have any questions or concerns.*",
            "Sorry, You need to verify your email with Reddit to comment. This is to protect against bots and multis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineRussiaReport) if you have any questions or concerns.*",
            "See a post where Mod say that uploading images that are considered shitposting can result in  ban. \n\n\n Post anime girls anyway    \n\n\nRefuse to elaborate further and leaves.",
            "Rule 1. Temp ban issued. Recurrence WILL result in a permanent ban.",
            "Is there anyone who actually liked Prigozhin on either side?",
            "kyiev, is that the final evolution when kyiv and kiev finally become one? 😂",
            "ever since they clapped the hotdog salesman out of the sky life hasn't been the same...",
            "Damn! Not gonna lie, those F16 look cool af!",
            "secret NATO technology",
            "Sorry, You need to verify your email with Reddit to comment. This is to protect against bots and multis.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineRussiaReport) if you have any questions or concerns.*",
            "that seems very handed considering people may not read this post at the time of posting, unless rules on the side are changed as well.",
            "Was that rule ever enforced? Every time reported shitty memes in the comments nothing happened.",
            "Didnt even know there was a discord",
            "not when you are banned on the discord by a power tripping head mod.",
            "Oh. I’m on mobile.",
            "No but I was able to link pictures even before.",
            "is it possible to do a meme or shitpost fridays on this sub to bring in a little bit of humor and fun. We dont need to be super serious all the time! It should be fun as well in here.",
            "He was a corrupt man who led a vicious mercenary company. I didn't like him when it comes to morality and virtue.\n\nBut he was endlessly entertaining in the war.",
            "Cynically, yes. He was funny as hell all things considered. And there's definitely a before and after Prigozhin in this war.",
            "is there anyone who actually disliked preggo? He was the best part of the entire 2023 war saga.",
            "Those who believe he's still alive",
            "He was pretty much a hero to Pro-RU, a person leading a valiant charge... up until his little March to Moscow. Then about 95% of them fell silent, waiting for orders on who to support before pivoting to \"We never supported Prigozhin\" when paychecks started to return.",
            "Yes. It's the special edition.",
            "To me the war ended on that day, whats the point of watching anymore lol",
            "No memes / Shitposting was always a rule, for the ignorant it now says \"post / comment\". Very few subs even allow pictures in comments due to misuse, so we as always must be heavyhanded to keep order.",
            "Yes, but it doesn't happen instantly. Mod queue could take over 24h if it's only reported once.",
            "Be warned  it's the exact opposite of Reddit as far as rules go.\nhttps://discord.com/invite/Wuv4x6A8RU",
            "i wouldn't recommend it... it's a cesspool of both sides and essentially just a battleground of verbal shitflinging\n\n\nThey're very radical on both sides there.",
            "It's filled with pro russian nazis lmao. They type some wild shit there.",
            "[deleted]",
            "His feud with MOD raised a few eyebrows. It was counterproductive all along.",
            "Now THAT's a good case of flair NOT checking out. If in any doubt, it's the silly second part",
            "the show really went down when the preggo-storyline ended. That B-plot was better than the main story.",
            "I left cuz its all brainrot gay porn posting",
            "I don’t think you’ve even been in the server",
            "The Russian army avoided the painful reforms China undertook after Desert Storm. Wagner was a cheap and dirty way of forcing those reforms to be implemented on a limited basis. It worked to a limited extent. Russia still doesn't have the NCO core of a NATO army, but they're a lot flatter and a lot less hierarchy-bound than they've always been. Their kill chain used to take hours, now they're often down to minutes from observation to response.\n\nRussia didn't use to have JDAMs because their command structure just wasn't built to work that way.",
            "Why wouldn't I. It's not really a private server.",
            "Because why would I believe you’ve joined the server if your comment regarding it, is a blatant lie",
            "Just because you say it, doesn't make it not true.",
            "> Just because you say it, doesn't make it not true.\n\nThat’s exactly what I’m saying, because anyone can join the server and see you’re just lying",
            "Yeah, they can. I would even encourage people to join it for all the nazi filth."
        ]
    },
    "UA POV- Vladimir Putin has threatened to arm North Korea if Western countries continue providing military aid to Ukraine, as the Russia president’s new defense pact with Pyongyang sparked a series of diplomatic reverberations in the region. The US called Putin’s remarks “incredibly concerning” - CNN": {
        "title": "UA POV- Vladimir Putin has threatened to arm North Korea if Western countries continue providing military aid to Ukraine, as the Russia president’s new defense pact with Pyongyang sparked a series of diplomatic reverberations in the region. The US called Putin’s remarks “incredibly concerning” - CNN",
        "score": 55,
        "url": "https://www.cnn.com/2024/06/20/asia/putin-ukraine-north-korea-south-korea-intl-hnk/index.html",
        "content": "",
        "num_comments": 165,
        "comments": [
            "Tit for tat",
            "Just transferring better ICBM technology would be incredibly painful for the USA.\n\nRight now they can hope to shoot down the 10 or so ICBMs North Korea can fire at the USA. If Russia transfers even old Soviet technology - the NK ICBMs gain 10 warheads each, plus penetration aids. That's 100 nukes (plus penetration aids) to intercept and the task becomes impossible.\n\nThe article is also ingenious on South Korea. It says:\n\n>\"Reports from earlier in the war say South Korea may have provided 155mm artillery shells to the United States to replace 155mm rounds sent to Ukraine.\"\n\nIt is common knowledge, verified by video evidence, that SK provided millions of 155mm shells for Ukraine. What Putin is doing now is just payback.",
            "Why threaten? I'd move missiles there by the end of the month.",
            "I dont see any problem if Putin helps NK with ICBMs. He needs to station some in Cuba and Nicaragua, too.",
            "Yeah he would totally arm NK, russia just need 50 more years to catch up with their own demand first.",
            "Is korea in need of some t-55?",
            "NK is arming Russia",
            "lol isn’t it NK who are arming Russia? wtf he smoking?",
            "He is getting real desperate when your begging for north korea foe help, what an embarasment.",
            "Can't even supply his own soldiers with real gear and body armor",
            "Ironically Russia voted for all the UN sanctions in the SC that it now wants to help NK to circumvent.\n\nWhy are Russians still surprised that nobody considers Putin to be a serious negotiation partner? Or that the Russian regimes “word” is worth anything? To negotiate a thing with them would just be a colossal waste of time and make the British appeasement talks with Hitler look credible.",
            "So he wants to just piss off South Korea?",
            "Finish what's on your plate, Vlad.",
            "Arm with what? They are receiving shells and weapons from NK, not vice-versa",
            "Good. Flood them with weapons down to the last bullet available to spare and give those arrogant PoS plutocrats in Western capitals who talk and act like they run the world a taste of their own medicine jammed straight down their throats. That's how it should and must be done. \n\nMake any who support NATO anywhere in this world pay in the same way they have for so long done to others in their sights. Nothing could be more necessary or deserved.",
            "Oh please, he could barely arm himself",
            "They would never share the nuclear tech. Nobody did it during the cold war, and nobody is going to do it now. China would be extremely upset if RU wete go help NK with nuclear tech (and pro ably even with bigh rande missile tech too).\nEven if they didn't care about China's opinion - additional nuclear weapon im NK is bad for Russia too (because of the proximity).\nThere is a reason USA and RU/USSR were working hard against the proliferation of nuclear weapons - especially outside of their respective countries.",
            "Wait a second. You say it’s common knowledge, but it’s the first time I’m hearing that ANYONE let alone SK, transferred MILLIONS of 155mm shells to Ukraine. When I google it, nothing of that sort comes up. Could you post your source please?",
            "Man pro-Ru really can't go 5 minutes without threatening to plunge the world into nuclear war because they're failing to conquer Ukraine.\n\n\nRussia has demonstrated itself to be a genuine risk to the whole world with their constant nuclear threats",
            "No one cares since putin has nothing to spare to NK.",
            "South Korea has said that if Russia does that, it WILL supply and at minimum match that, for Ukraine. This move was weird and stupid by Putin. South Korea has a GDP of at least 57 times that of the north, and probably a lot more than that. Think about it. Pissing off South Korea means not only does he need to have North Korea on side, but he then would need ANOTHER 56 countries identical to North Korea, JUST TO MAKE THIS CHANGE EVEN!\n\nIf you ever don't want a COMPANY fighting against you, then it's a company like Samsung. Russia has all the tactical genius of a drunk.",
            "[removed]",
            "NK already has their own nuclear missiles, and honestly is a very marginal improvement over the span of Russian territory. Honestly, I'd have to check but I'm pretty sure Russia's widest angle of attack towards the US is from the northern end across the north pole. This is just saber rattling and more threathening to south korea than anyone.",
            "Yep. And then ti e ICBM to UA and poland (if they dont already have)",
            "The war will end sooner or later, after that Russia will have a pretty significant amount of manufacturing capacity it won't need.",
            "*I got this from a Korean analyst's commentary, it's not mine - the analyst was responding to Claims of China being miffed at the Russia - North Korea rapprochement .*\n\n*Part1* \n\n*Quote:* \n\n*You know as a professional analyst specialising in the DPRK.  Been doing it for 40 years now. Some of the things you got right, but you're still looking through Western eyes, so you miss some nuances. You get it much better than most amateurs, but there's more to it.*  \n  \n*They share a border with Russia, embrace the Juche philosophy, and follow old-style communism. Their equipment might look like crap to us, but it's designed as part of an overall structure. They control everything from mining materials to weapon production, using old designs that don't require imported materials. They've been sanctioned so long they've made their society self-sufficient and self reliant. That's the basic Juche philosophy in a nutshell. They actively don't want trade because that trade makes them dependent on others.*  \n  \n*They know we think their weapons are bad, but they see our weapons as equally unsuitable for their strategy. Their weapons are designed for immediate activation, mobilising the entire population for war. Everyone in their 25 million population is part of the military and government, working together to produce what’s needed. They don't think of those things as being separate. To be a citizen, you are part of the government and military. They are all one thing. They have a system where labour is free because it earns social credit, which is essential for purchasing anything in the DPRK. Without social credit, money is useless.*  \n  \n*Since they never westernized like Russia, nothing was privatized, and their production facilities remain fully intact. If the go button is pressed, they can produce millions of rounds per month. Their entire nation is built to outproduce the rest of the world (excluding China and Russia) in wartime, which is why they structured their society this way.*  \n  \n*They can rival modern Russia in arms production because that's their system's advantage. Their population sits in factories, ready to start producing weapons and ammunition from the moment they’re needed.  If they get jobs to make other things they will do it but if they get no jobs, they sit there doing nothing just in case they get the order to make shells.*  \n  \n*The deals they're doing with Russia aren't about what Russia will give them. They'd give Russia anything for free if asked. (that's a much bigger discussion on multi polarity of the 1950's and China's betrayal from their eyes (joining the US side in the Sino-Soviet split plus \"abandoning\" them in the Korean war) and Russia coming to their aid with nothing asked for in return. What Russia provides them simply changes what they mass-produce. for example, If Russia gives them T-14 design plans and they can manufacture them with their resources, they'll produce them. If Russia limits them to T-50s, then that's what they'll produce. That's their mindset.  They don't ask Russia for anything (it would not escalate Un as a great leader) but will take anything Russia gives them.*   \n  \n*Always remember, they're old 1950s Russian communists who believe in Stalin's saying, \"Quantity has a quality all its own.\" They think a thousand low-quality rounds today are better than one high-quality round tomorrow, and the same goes for tanks and everything else they make.*  \n  \n*Also, keep in mind the DPRK hasn't mobilised for war production yet. What they're giving Russia now are just spares. Their philosophy is that when the UN and US decide to invade them again, they'll throw everything from stores into battle from day one and keep building 24/7 to swarm their enemies. Think of Russia in the 1940s during WWII to understand their mindset. They have stayed prepared to do this since the 1950's. They have starved millions and had millions die from other things just so they can be sovereign, independent and fully self reliant. The only thing they desperately crave from anyone outside of the DPRK is respect - earned by helping them.*  \n  \n*This is what motivates the DPRK: No other great leader has been able to pay back the honour debt to Russia for coming to their rescue in the Korean war - from their perspective unasked and unexpected. When Russia could have let them die or demand restrictive things that would have put them in debt for years, they didn't.* \n\n*No great leader has been able to pay back this honour debt because Russia has never needed anyone else - until now.  For Un to get back to equality - to be able to stand next to Putin as an equal in DPRK eyes and give them unwavering support, without question, without expectation and without payment required does something that no other Korean leader has ever been able to do. It escalates Un to be the greatest of the great leaders.  Right now, he isn't even a great leader, just the leader.*",
            "They can, say, open cruise missiles production. And share finnished goods. Some will go for Russia, some for NK. Just some thoughts.",
            "Different weapons, and they can also share their designs.",
            "*Part 2:*\n\n*That's why payment is kind of shunned by the DPRK - and why they will quickly and easily activate everyone - and I do mean everyone - if Russia asks.  But here's the catch. Russia HAS to ask because giving to them if they don't ask for help is also an insult to Russia - so the DPRK will sit there doing nothing until Russia asks.*  \n  \n*As to why did Un train into Russia? - old style communist and all of their leaders would have done the same. No aircraft.  But Putin took an aircraft into Pyongyang and they didn't say a thing.  That's how much they feel the honour debt with Russia.  They don't feel it with China because they feel that China is their pole leader and their pole leader didn't die to help them reunify the south and didn't support them when they thought they were going to lose it all - there is still anger there.  But the fact that Russia, the head of the European (not Asian) pole did what it did has never been forgotten.*  \n  \n*(also calling them \"North Koreans\"  is a massive insult to them because it implies acceptance of a south Korea - a nation that they do not recognise and consider a US/UN occupied part of their nation)  When you said \"big boss little subordinate\" - thats one thing they would never accept - they demand being treated as an equal.* \n\n *Truth is, CHina and Russia know it. The DPRK know that China is their pole leader, Russia is the European pole leader but they have not forgiven China for it's failure during the Korean war to live up to their title as pole leader and have not forgotten Russia stepping in when it was unexpected.  The DPRK have zero fear of China - due to their brainwashing and indoctrination. \"*\n\n*End Quote*",
            "No. NK is trading arms with Russia. Totally different.",
            "Ironically, the countries getting all riled up about this voted to recognise the sovereign borders of Yugoslavia as of 1999, then recognised it as unilaterally independent less than a decade later.\n\nPeople who live in glass houses shouldn't act surprised if their word isn't worth shit either.",
            "Why would they continue supporting that agenda given the West’s actions over the last two years?",
            "Change your tag mate",
            "The West totally fooled Putin with Minsk 1\\2, before that the West fooled Russia by \"not a single inch for NATO territory\".\n\nWhy would any russian president ever trust the West before all these betrayals?",
            "South Korea has no capacity for military conflict. It is far too densely populated. It also needs resources Russia provides. What is it going to do if it’s pissed? Send BTS to dance the Russians to death?\n\nSouth Korea doesn’t have the privilege to be pissed at Russia. It can’t afford it. Especially not after it has sent 4 million of its shells to Ukraine. It has nothing, no leverage.\n\nRussia is about the only country on the planet right now that is capable of waging a proper war.\n\nThe idea that South Korea, Japan or even the United States fighting a peer-vs-peer conventional war is laughable. Taiwan? Don’t make me laugh.\n\nThe entire NATO and all of its allies cannot even support Ukraine to win against Russia.",
            "You mean the US vassal state? The state that already dutifully followed it's master's orders to sanction Russia?",
            "This might be hard to believe but there are more weapons out there than shells.",
            "North Korea are interested in missiles and air defence most of all. \n\nAnd Russia has plenty of technology in the area to help them with that.",
            "Technology Transfer. DPRK has no patents so it's likely Russia will provide them the know-hows especially in semiconductor technology.",
            "Shovels, what else?",
            "You forgot to write Russia is out of everything. They will clearly provide them with shovels and washing machines stolen from Ukraine.",
            "transfer of technology. And important resources which are sanctioned.",
            "Allegedly",
            "They’re receiving the manufacturing capacity and Russians have so many sophisticated weapons NK would kill to get their hands on.",
            "Give em nukes. I still see pro-UA not take this seriously and still ridicule Russia by making jokes now about \"What can Russia possibly supply since NK is supplying Russia with shells.\" The answer is russia can supply a lot of technology and weapons and make the Korean Penninsula a little more uncomfortable.",
            "Sanction world and dollar denominated world exist as long as most countries agree and comply with modest U.S.A requirements. U.S.A has abused that respect and Putin is offering a hand to NK and helping them level up in the new post sanction world and dollar denominated world. This is an appropriate, systematic, proportional response to express with actions, not words how the world is feeling about the USA role in the conflict. \n\nNow this de-dollarize world has too many dollars in circulation and those have to be reeled in by the Fed or left out in gen pop.  If all those dollars stay in gen pop dollar inflation will take off again, if the Fed reels the unneeded dollars in it will increase interest rates.  The dollar denominated world needs to realize that they may not agree with Russia, but that that Russia has means and  methods to respond to US actions at a time and place and format of their choosing. A big thanks goes out to Nuland and Lindsey Graham for their great investments in the Ukraine.",
            "Ha ha. Don't forget that Russia is so screwed that it's begging North Korea for weapons. \n\nRussia is so lame. They go around the world trying to rile up wars in Ukraine, Cuba, Syria, Africa and North Korea (with a GDP smaller than HAITI), then get all upset with NATO, an organisation that was literally dying off and only existed to deal with Russia if it went crazy and started going around the world screwing everyone. \n\nRussia is unable to actually create and innovate. But they're also unable to tollerate other people being able to. It's like the crabs in a bucket. They will keep pulling each other back down to make sure nobody can do anything. It's pathetic.",
            "Russia has just gone with a begging bowl to NK for military assistance and you think the RF is capable of arming *them*?",
            ">China would be extremely upset if RU wete go help NK with nuclear tech\n\nWhy? Where's the evidence for this? The USA is creating an anti-Chinese pact in the region, and China would be upset if somebody made life more difficult for the USA?\n\nAnd providing NK with better missile technology is not nuclear proliferation. NK already has nukes, and already has inter-continental missiles. It's just helping them improve their missiles. Kind of, you know, how the USA is helping Ukraine hit targets in Russia.",
            "Someone could argue that ZSSR was more sane partner than Russia. ZSRR didn't feel like it needs to re-conquer anything, project anything, threaten anyone.",
            "Sure\n\n [In fact, South Korea in 2023 indirectly sent more 155mm artillery shells to Ukraine  This has played an important part in helping Ukraine, which is suffering from serious shortages of ammunition.](https://responsiblestatecraft.org/russia-north-korea-south-korea/#:~:text=In%20fact%2C%20South%20Korea%20in,from%20serious%20shortages%20of%20ammunition)",
            "Why is it when one party sends weapons to a foreign country it's fair, but when the other *just mentions* doing the same they're \"threatening nuclear war\"? Wouldn't that make both countries risks to the world by your logic?",
            "Mmm I seem to remember the US actually using nukes on civilians about 80yrs ago.\n\nAnd in the last 20yrs they’ve killed a few million in the ME after getting embarrassed by 9/11.\n\nRest of the world/global south knows the real danger to peace and it ain’t Russia",
            "Giving that NATO countries keep suggesting that they want to send troops to Ukraine maybe Russia should actually do stronger threads to keep us all away from a nuclear war.",
            "ICBMs aren’t being used on Ukraine , but they will let NK reach US homeland.\n\nTry to use your brain sometimes",
            "The level of ignorance...",
            "The US buys weapons from South Korea with the express purpose of sending them directly to Ukraine which the South Koreans themselves understand. Not sure why South Korea is now going to send weapons to Ukraine is even a talking point.",
            "South korea is 3 trillion ppp north korea 300 billion ppp\n\nOh no russia is so scared of being unable to use a company its already been banned from using",
            ">South Korea has said that if Russia does that, it WILL supply and at minimum match that, for Ukraine. This move was weird and stupid by Putin.\n\nSouth Korea has already been massively supporting Ukraine with shells. If I remember correctly, they sent more shells than the whole of Europe.\n\nNow Putin is saying - here is some payback. Yes, it's painful, but it is a lesson that your actions have consequences. And, yes, you can start providing more weapons to Ukraine, but Russia can also make this much more painful. Your choice.",
            "Sorry you need 20 subreddit karma to unlock the word 'you', this is to make sure newcomers understand [rule 1](https://www.reddit.com/r/UkraineRussiaReport/about/rules)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineRussiaReport) if you have any questions or concerns.*",
            "Poland does or did, and no one is going to give ua an icbm lmao",
            "The war will end sooner or later, but Russia seems to forget that that doesn't stop the sanctions. Russia can't now go back to \"life as normal\". And when you consider that the real affects of the sanctions won't really show any effects until the war chest is empty (looks like another 1 to 2 years for that still, then for Russia it's going to get very real over the next 10 to 20 years.",
            "That's an extremely optimistic take, russia won't have capacity or manpower by the time this war ends, as Ukraine will be able to strike more and more  plants in russia proper.",
            "And with what is NK gonna pay for it?",
            "True. Even BRICS seems to have dropped Putin. Now he’s trying to make RINKS a thing (Russia, Iran, North Korea and Syria)",
            "I was banned for tag gatekeeping once... lets see",
            "To be pro Russia is to be anti Putin and his regime, the way I see it? \n\nAnd no Redditor can convince me otherwise considering how he’s turned the country into an oligarchy and enriched himself, never mind how he’s destroying the county.",
            "> Russia is about the only country on the planet right now that is capable of waging a proper war.\n\nChina? The US? Israel? Iran?",
            "SK has a strong military industry and huge stockpile due to officially still in war with NK.",
            "That would personally kill me. Please don't send BTS",
            "*There are also many other societal and demographic issues as well, that set the two nations apart. For instance even though South Korea has twice the population of North Korea.*\n\n*South Korea has an average age of 45 years (with most of the population being older than this), as well as the worlds lowest replacement birth rate,  while N.K has an average age of 36, and the entire population is Militarised - 8 years of mandatory military service (down from 10).*\n\n*While unlike most nations in its GDP range it doesn't have a pyramid shaped demographic (with the very youngest being the majority - which has been attributed to past famines). The majority of the north Korean population is in the 20s - 30s range, perfect age for the military. A lot of the younger fighting S. Korean population is very \"westernized\" - with all the short comings that this entails.*\n\n*The entire North Korean population is geared for war - from children to old ladies in the street, ever activity is seen as being part of the military and required to uphold to the same disciplinary standards and due to their Juche ideology, they are militarily self sufficient - that psychopath Stalin (Iosif Vissarionovich Dzhugashvili)  is supposedly quoted to have said - \"Quantity has a quality of its own\".*\n\n*While so Western analysists, pundits and policy makers may arrogantly scoff at North Korea's military tech, it would be like a larger supposedly dangerous predator being swamped by a super colony of fire ants, or hornets - they are able to churn out vast quantities of soviet era weaponry with zero input from anyone - and have a population that is intimately versed in how to use this soviet tech.*\n\n*Being given updated Russian weapon blue prints will simply change what they are able to churn out in vast quantities. Being given a secure food supply , fertilizers etc will also divert more resources to updating their military. Their juche ideology prohibits them from becoming dependent on anyone even their bosom buddies.*\n\n[*https://en.wikipedia.org/wiki/Juche*](https://en.wikipedia.org/wiki/Juche)\n\n*So with those numbers, I am not sure S. Korea can afford to lose even a single digit percentage of its population (even just Ukrainian style refugee outflows), to a conflict with the North. The along with Japan will be too tied up with dealing with North Korea to be of any assistance to the US, and will in fact drain the US of military resources it would need to devote to the Taiwan gambit -*\n\n*China has zero issue with this - as it will only leave the Philippines to deal with. With Russia's relationship to Vietnam, making it extremely unlikely Vietnam will ever join theUS in a throw down with China (because Vietnam has territorial disputes with China, the US might want to enflame like with the Philippines).*\n\n*Leaving the US with the Philippines also creates many issues that, will pop up in case of a conflict, the poverty level will require the US to sink resources into assuaging the population to try and quell any internal rebellions, few will be willing to die for the empire and its elite vassals due to empty promises of \"democracy\" or \"joining the EU\" and what not.*\n\n*People might have forgotten but there were brutal anti colonial wars fought between the Filipino peasantry and both Spain and the US, these sentiments can be re-enflamed, and turned against the US, and its elite vassals like President Marcos, creating a guerrilla style partisan army split within the Philippines - because some elite factions like that of former President Rodrigo Duterte are pro-China/Russia.* \n\n*This potential split echos what happened with both Vietnam and Korea.* \n\n*A very truncated history - It used to be one Korea, Japan Colonized it for 35 years, they were then eventually expelled by the USSR and Peasantry of Korea. The US came and sided with a group of the former Japanese Collaborators who used to be the elites under Japanese rule, who had been driven back and hence the divide started the Korean War leading to North and South. The US tried to do the same in Vietnam (North - communist vs South - capitalist) as well.*",
            ">South Korea has no capacity for military conflict.\n\nApart from being armed to the gills, South Korea is [the 10th biggest arms dealer](https://www.sipri.org/sites/default/files/2024-03/fs_2403_at_2023.pdf) in the world and its exports are rapidly growing since the war in Ukraine began. \n\nI'm not sure why you think that the fact that they're indirectly supplying Ukraine with shells by resupplying US stocks and production sent to Ukraine mean that they have \"no leverage\". It's probably more rational to think that they'll increase the production.",
            "Russia is the only country capable of waging a proper war? Ah yes i forgot grinding on the borders of your neighbor is proper war for russia.",
            ">Russia is about the only country on the planet right now that is capable of waging a proper war.\n\n\nYes only glorious Russia is strong enough to wage war, weak little USA with their trillion dollar budget and million strong armed forces is powerless against the great bear lol",
            ">South Korea has no capacity for military conflict.\n\nhttps://www.globalfirepower.com/country-military-strength-detail.php?country_id=south-korea",
            "LOL. The Samsung company on its own could deal with North Korea and large swathes of Russia. The \"entire west\" is a stupid way to look at this because the west is being very, very, very restrained. It's like the tiny drunk hitting the bouncer at a night club, and being convinced he's winning because the bouncer hasn't hurt him yet.",
            "And what that might be? Nukes? already have them, Launch vehicles? already have them, Tanks? already have a native production.\n\nIf anything NK is better prepared for an attritional war regarding military equipment than Russia is.\n\nThis is the same thing as with Houthies, Russia can't supply them anything that Iran hasn't already provided them.\n\nIt's a bunch of empty threats.",
            "Joking? Semiconductors?Lol, wow. North Korea can't feed itself and Russia has zero, repeat ZERO, skills in semi conductors. It's why they keep stealing washing machines - for the chips. The only tech transfer between Russia and NK would be the sickle.",
            "The word \"blyat\" is really booming atm.",
            "Russia is running out of arms and weapons its pretty clear !",
            "\"sophisticated\"\n\nBombs that fall on the wrong country.\n\nAA that shoots down russian airplanes or gets destroyed by missiles it was supposed to defend against.\n\nA flagship that was supposed yo protect the whole fleet from missiles, sunk by just two missiles.\n\nTanks that get destroyed by IFVs.\n\nYeah, sophisticated.",
            "Typical proru nuclear sabre rattling.",
            "NK already has nukes so whats the point?\n\nNK also doesn´t have the ressources or the brains to maintain cutting edge technology. Not that Russia has any to offer...",
            "Do you honestly think NK developed it's nuclear weapons program in house?  Russia is responsible for nuclear proliferation in NK.",
            "Most North Koreans are starving to death on Russia's doorstep. But Russia refused to help them and the last state visit was a quarter of a century ago. This is diplomatic desperation.",
            "If China wanted NK to have that tech, they would have given it to them already.  China has complete control over that relationship and sets the bottom line for NK tech.",
            "Because there is no valid reason at all for an anti China pact to be created is there. Non at all /s",
            "Russia started a war in Ukraine, so why can’t Ukraine attack inside Russia? You are using a logic fallacy. Also providing missile technology made to deliver nukes is considered nuclear proliferation.",
            "What is ZSSR?",
            "Because some of us actually read the comments before replying. The pro-RU poster said that because SK provided 155mm shells, RU should give NK ballistic nuclear missile delivery systems. \n\n\n\nIn this example, we can see why only one side is threatening nuclear war.",
            "Maybe the difference is that on one side uninvolved countries send conventional weapons to the defender while on the other side, the invader sends nuclear capable weapons to an uninvolved country.",
            "What else would you use ICBMs for?",
            ">Why is it when one party sends weapons to a foreign country it's fair, but when the other just mentions doing the same they're \"threatening nuclear war\"?\n\n\nThe difference is obviously whether or not the weapons in question are nuclear ICBMs, as the person I was responding to was suggesting.",
            "You speak it like 80 years we were at peace, and 9/11 was an act that didn't warrant breaking peace.",
            "Regional conflicts are very different to world wars which are very different to nuclear wars. It's only Russia which keeps threatening to escalate a regional conflict that they started into a global nuclear war.",
            "In what universe does Russia making worse nuclear threats somehow *reduce* the threat of a potential nuclear war?\n\n\nThink man, what you're suggesting is absurd",
            "And that will likely never happen. As if NK is more of a threat than russia is…\n\nSorry but hearing nuclear threats from russia so often i started to set use it as an alrm for when i need to take the clothes in after drying. Could not care less what russia has to say at this point.",
            "Don’t be insulted m8. I just do not think putin is credible, worthwhile or a remote threat to anyone at this point. All you will hear from him is whinning and threats. Different day but same story.",
            "But it's a dumb move to have South Korea start supporting Ukraine with ammunition. Right now they can't do so directly. Not a good move by Putin of you ask me.",
            "The West is done being threatened by Putin. He doesnt get to conquer his neighbors, he doesn't get to get things by threatening nuclear war. There will not be a new Munich.",
            "Russia is circumventing sanctions right now. Sanctions were created with loopholes so that they don't bite the European economy too hard. But even if we assume Europe suddenly gets serious about sanctions, Russia can get pretty much everything it needs domestically and the stuff they can't produce on their own they can import Chinese substitutes. \n\nRussia is too big to sanction effectively. While Russia was on board sanctions against Iran and North Korea had a decent amount of effect. But with Russia in the same boat those countries now have access to Russia's resources.",
            "Nah... Russia can flatten whole Ukrainian cities. So far Russia has been holding back a lot but if they feel threatened enough they will start dropping nukes. \n\nSo far Ukraine is limping along as the largest open air prison in the world sending out handfuls of prisoner soldiers out to the front to get butchered. But at some point the prisoners will start to riot and realize that Zelensky is butchering them for kickbacks.",
            "North Korea has a good amount of mineral wealth.",
            "Most of the world isn’t too worried about him. Your acronym is cute but you might want to find a way to put China, India and Vietnam into it as well.",
            "This subreddit is obviously about the war, and the tag about what side you \"support\" in said war. I cant make my tag pro-Ukraine and hope Russia annihilates Ukraine because \"I believe that is the best outcome for Ukraine.\"",
            "No,glorious soviets only army in the worlddd💪🇷🇺 URAaaa.\nThis sub sometimes seem 100% satire with the bullshit they write",
            "Russia will bomb HYBE entertainment, SM, JYP and YG entertainment if South Korea is annoying. No more BTS, BlackPink, TWICE, NEWJEANS, LESSERAFIM, AESPA, etc.",
            "The guy said russia is the only country capable of waging war,the guy is beyond reasoning",
            "The guy is delusional or just straight spreading propaganda. Not worth engaging with in any rational way.",
            "Air defense systems and anti ship missiles obviously.\nPerhaps not now in current scarcity but a modern s300 variant would bolster North Korean defense substantially.",
            "Lancet drones? Jamming equipment?",
            "Making more effective and smaller nuclear warheads also a big deal.\nMaybe some rocket technologies to make sure NK ballistic missiles won't miss next time. Or even reach US shore.",
            "He hasn’t gone to NK like a pauper because they’re flush with arms and materiél.",
            "They wouldn't have to buy weapons in the first place from North Korea and Iran if they had the domestic capability to produce what they needed for a regional war in Ukraine.",
            "Yeah pretty clear. \n\nThey are running out of Ukr as we speak.",
            "The bombs that fell on the wrong country were UA AA\n\nThe AA shot down russian airplanes as russian AA doesnt have way to discriminate between enemy (soviets didnt do this as they didnt expect to be able to contest air, and russia didnt decide to implement it after the fact) and friendly, all AA also has inherent interception % explaining the second part\n\nThe missile protection wasnt armed for reasons\n\nAll tanks can get destroyed by IFVs, its one of their purposes for self defense\n\nIn the end nothing you pointed out was about sophistication",
            "Typical pro-UA whining and complaining.",
            "Yeah, they don't have the \"brains\". Must be some kind of inferior humans to Anglo-Saxon Britons and Americans and those western Ukrainian Galician ubermensch. \n\nIs that you, Danilov?",
            "Don't forget that the Russians stole all that technology from the west.",
            "Yeah, because NK doesn't need 155mm shells like Ukraine, they need better ballistic missiles. \n\nYou give them what they need. \n\nYour example is retarded, because you don't understand how spread out this conflict became. \n\nAnd the only party constantly escalating it, is the USA.",
            "Russia has never threatened the use of nuclear arms aggressively. USA is the only country out of the 2 that has ever nuked another country, and is the only one in recent years to continuously threaten to nuke other countries (just a few years ago, the US president threatened to \"push his nuclear button\" on North Korea).\n\nFYI to everybody wondering, /u/GroftheFnords is a disinformation bot. He claimed the other day that over 30 republicans were convicted of conspiring with Russia. The real number? 2.",
            "Russia isn’t threatening US homeland, just US interests in Europe (Ukraine).\n\nNK wants its own security, so wants to hold SK and US military there at risk.\n\nIf NK can hold US homeland at risk through ICBM/nukes (which it currently does but seems like only a small credible threat), then that makes US aid to SK less likely in event of war \n\nSoviet/Russian ICBM tech will increase credibility of NK threat to US homeland.",
            "South korea was already supporting ukraine using a middle man so doesnt change too much, imo its a bad move by south korea to send ammunition to either side since they still have north korea, which weakened itself by sending its ammunition, as a potential problem",
            "They alread are supporting Ukraine (back doors).\nNevertheless, Russia can help NK by easing sanctions, and maybe with conventional weapons. They certainly won't help them with nuclear weapons. That story os much more complicated than current interests (or even long term interests)",
            "This is entirely baseless. Russia is not “circumventing” sanctions. The fact that Russia economy is growing is a ballon effect from industry kicking into gear. Defence spending. Nothing to do with avoiding sanctions. Some Chinese buildings are legitimately made of polyester materials. People ripping rebar out of weight bearing beams on construction sites. Chinese model is an unpopular one amongst the moralists for a very valid reason, it’s dystopian.",
            "Third year of russia holding back and throwing people at the problem instead of bringing in the *ACTUAL* russian military. Just you wait westoid, you poked the bear. (/s just in case)",
            "Russia is not dropping any nukes in Ukraine.",
            ">Russia has been holding back a lot\n\nYeah you are right, if Ukraine keeps resisting then Russia might even start a war or invasion.\n\n>if they feel threatened enough they will start dropping nukes\n\nThats Ruski mir comrade!",
            "Unlike Russia?",
            "I would re-think this, China is absolutely happy that it can sell 15 kilo thrust brushless motors to ***both*** sides.",
            "India’s primary interest is, as always, India. Vietnam is playing all sides.\n\nGiven that Russia can’t provide security to the Armenians there’s little to be gained these days in sitting under their defence envelope.",
            "Dude literally half of the people in this sub tagged as pro-Ukraine are completely pro-Russia and repeat Kremlin talking points constantly, you're clearly pretty new here lol",
            "There are a lot of delusional Pro-UA and Pro-RU here, yeah.",
            "Russia has absolutely no capacity to attack South Korea right now. Let that sink in.",
            "Yeah good idea!\nEnd a 70 year old ceasefire…what could possibly go wrong?",
            "All I see is excuses for the failures of crappy systems. Sophisticated would overachieve, not under.",
            "In fairness the whining and complaining about Ukraine being supported by their western allies is pretty constant from pro-Ru lol",
            "Yes , Klaus Fuchs rings a bell",
            "A friendly reminder that, as always, escalation started with Russia’s invasion of Ukraine and its attempt to subjugate its people and instituted regime change.",
            "Christ you simpleton. Nuclear capable ballistics are a different tier of escalation vs artillery.",
            "why does NK need better ballistic missiles?",
            "Doubtful. Russia has very little credibility at this point. Do not see how them helping NK will improve anything. But yeah good luck with that. Haha",
            "It changes a lot. They are limited on what they can send and are mostly sending artillery shells. If they alter the constistution to provide aid directly It open a whole new menu and shorten the logistics of sending to US and them sending it to Ukriane.",
            "Not nuclear weapons, but missile technology? That would make Washington scream.",
            "I doubt Ukraine will present enough of a threat to warrant it but it's also not an option that's off the table.",
            "Mined minerals are a lot more valuable than the those still in the ground. Russia can easily sell its natural resources if it scales production, just as it can easily flip NK resources.",
            "That's really not their goal nor what they were saying.\n\nThey just make sure that the DPRK has the ability to do so.",
            "There is no need to. Missiles in NK will simply complement the regional control of China in the Pacific.",
            "What would go wrong? Nothing. What would anyone do? Is the US/Israel going to open another front and fight China? Who would serve as its proxy? SK? Japan? As if they will do that.\n\nWhich country, in their right mind want to be the next Ukraine?",
            "since when is whinning and complaining associated with discussion and intellectual debate?\n\nEveryone expects hypocrisy and weasel like behavior from the west. I would have been much more surprised if they didn't act in that manner to supply ukraine with weapons and support. The west is too cowardly to fight russia on their onw so why not send in the poor Ukrainians to do the job?",
            "Ugh no it didn’t. It began with an illegal coup in 2014. That where all this ACTUALLY began. Whether you believe the US was behind it or not is up to you, but everyone here knows that this war began in 2014 and all actions have been escalations (on both sides) since then.",
            "Putin was rather clear about it - the current deal Russia struck with North Korea is payback for South Korea's support for Ukraine \\*so far\\*.\n\nIf South Korea decides to increase its support for Ukraine, Russia is going to make its deal with North Korea much more painful for Seoul.",
            "It’s absolutely off the table.",
            "It’s completely off the table.",
            "Yes I know, I was just referring to the previous unhinged poster who was talking about Russia bombing everything there.",
            ">since when is whinning and complaining associated with discussion and intellectual debate?\n\n\nHey man you're free to call it \"intellectual debate\" when you're whining and complaining about the west if it makes you feel better",
            "The illegal coup where the president fled?\n\nYou’re working off some very poor history there.\n\nEither way the biggest escalation was a Russian full scale invasion in 2022, designed as a short, sharp operation to topple the Ukrainian government and bring their people to heel. And now two and a half years on Russia has weakened itself to a point where Putin needs to take his begging bowl to North Korea.",
            "Keep telling yourself that. Russia will flatten Kiev long before it surrenders to Ukraine.",
            "ROFL salty",
            "The President fled AFTER an illegal coup. This isn’t the first time something like this has happened before, you know that right? And again, the invasion is a result of US escalation and arming of Ukraine in the 8 years after the coup. If NATO wasn’t on the table for Ukraine, this war never would’ve happened.",
            "No, you’re embarrassing yourself.\n\nAlso you should fix your flair - don’t be ashamed about what you believe in!"
        ]
    },
    "UA POV: Fight in the barracks of the Odessa TCC": {
        "title": "UA POV: Fight in the barracks of the Odessa TCC",
        "score": 97,
        "url": "https://v.redd.it/73f82rw9r28d1",
        "content": "",
        "num_comments": 81,
        "comments": [
            "They were playing a game of \"who doesn't jump is a Moskal\" this guy lost",
            "Where are all those defenders of Ukrainians at? Russia is so barbaric, dedovchina, systematic rape, dog food rations. Ukraine is a bastion of European values, right? EU membership tomorrow? \n\nEvery propaganda story Ukraine and the west came up with in their creative writing process has been true for Ukraine, not Russia. Barrier-morale troops, forced conscription, press gangs kidnapping men for the army, locking up the country in an open air gulag. \n\nAs someone who lived in this society majority of my life it has been funny and at times frustrating reading comments from westerners saying how Russia is so backwards with no toilets and Ukraine is so progressive and tolerant. It goes as a wise Thai person said Same-same but different.",
            "Weve seen 3 videos of this barracks already, shows the ukraine barrack life pretty well i guess",
            "Black shirt got the hands, dropped him twice",
            "You no die for Bandera ? Then I punch you.",
            "Wonder how bad is the fraggings in Ukraine compared to Vietnam.",
            "I hope the kidnapper got the worst of it.",
            "How to keep up morale in Ukraine 💯💯",
            "Does anyone have any data on Ukrainian suicide rates after 2022? Between a dystopian authoritarian regime and an imperialistic invading force, the Ukrainian people (men especially) are stuck in the most miserable, hopeless situation on the planet.",
            "Any idea what is it about, what they saying?",
            "It's easy to think this fight has political causes. But it could easily be just a bunch of drunk and / or angry guys.",
            "[removed]",
            "i think they just practicing hand to hand combat",
            "Here in the Czech republic opinion was always held that Ukrainians are very similliar if not same as Russians, like Slovaks and Czechs, literally everyone thought this until 2022 when some youngsters bought what TV Nova (those guys werent even pretending impartiality) and other western owned media told them (this is basically the main reason i started being pro-ua after one month of the war) it wasnt, the rest of the populace think this just doesnt say it",
            "You forgot about their lovely word: mobiki",
            "yeah, projection seems to be one of the most powerful forces on the planet",
            "Huh, my brother speaks in the language of facts",
            "Why are you writing so much dog shit for a fist fight? Are you 12 years old? Normal young men will get into a fight for pretty much anything, much less military aged full of testosterone men.\n\nRuzzkies mental gymnastics are so weird, man.",
            "There is not such thing. Now it's working propaganda. Everyone thought that Ukrainians and russians are brothers and very similar nations. I will give you the example with my mother, an old woman from Eastern Europe. She doesn't like Russia because she thinks Russians kill their brothers, not because most areas in Russia are underdeveloped. But you do have the example of Belarus and the rest of the EU, the difference in living standards is visible from space.",
            "True, but I think the more remarkable part is he got up twice almost instantly. Apparently, no brain = no damage.",
            "[deleted]",
            "Not bad at all compared to Russian fragging, we can all agree on that.",
            ">Does anyone have any data on Ukrainian suicide rates after 2022?\n\nI don't think there's any reliable data on Ukraine right now, especially in regards to deaths.\n\n>the Ukrainian people (men especially) are stuck in the most miserable, hopeless situation on the planet.\n\nIt's not *that* bad. IMO Palestine is in a much desperate situation.",
            "Unfortunately, there is nothing meaningful in their words. At the end one called the other drunk",
            "-hey, guys, stop, stop, guys, stop  \n-f\\*ck  \n-stop, stop, calm down\n\nnothing significant\n\nI prefer the IPSO inscription that this is Russian propaganda)))",
            "Sorry, you need a 1 month old account to comment in r/ukraineRussiaReport. This is to protect against bots and multis\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineRussiaReport) if you have any questions or concerns.*",
            "It's comical, really. Of course there ought to be differences, but in online discourse they are portrayed like almost a different species. Mostly by the people who couldn't even tell them apart by one cultural  example. Hundreds of years of shared history be damned.",
            "We're all slavs, after all. A lot of common history, very similar languages, similar culture. Kievan Rus, which Ukrainians claim was Ukrainian, was in fact both Ukrainian and Russian (and partially Scandinavian), because at the time Russians and Ukrainians were one people. Only in the XII-XV centuries when Kiev was taken by the Mongols and then by Lithuanians, and Russian principalities became isolated from the rest of the world, the cultural split began.",
            "I'm not sure I understood you well. You became proUA, because of the proUA propaganda on TV?",
            "I love it, when Europeans and Americans bring up the living standards argument. Of course living standards are really good. It's all built up on colonialism. Europe and US have exploited countless countries, countless millions to achieve these \"living standards\". Until last year France was buying uraniam for peanuts from Africa, reparations for declaring independence from France. Netherlands, Spain, Portugal, US, France, Italy. All of these countries built their industry on cheap materials acquired through slave labour or labour that was so cheap, might as well be slaves. They did not develop a single country they exploited and discarded them, when they were done. So yea, West can take their living standards and shove it. I'm not Russian btw, but I'm from a part of the world that was exploited dry by the West. So i know.",
            "Based on US experience in Vietnam. More fraggings happened to Vietnam drafts than Gulf War volunteers.",
            "Nuh uh. \nRussian volunteers, Ukrainian forced-conscripted.\n\nAlso https://www.theamericanconservative.com/azov-leader-admits-to-ukrainian-use-of-blocking-detachments/",
            "You have no idea what they are talking about, don't you?",
            "Gaza Will be miserable and hopeless for at least the next 50 years. Poor souls",
            "Cheers for your reply👍🏻",
            "You can get genetic testing on the street in Lvov to see if you or your prospective mate are contaminated with one of the 11 \"Moskal\" genes. \n\n\nNationalists of Ukraine have a mythology even worse than that of Aryans because it's less ahistorical.  They claim Ukrainian descent from the Scandinavian *Varangians\", who used to hunt for Moskals and use them as slaves. For such people, there is less difference between a farmer and his cattle: \"Muscovites\" are said to lack the divine spark that animates the soul. Killing one, you feel no more regret than if you broke a pot. They are an \"internal occupation\" in Ukraine and must be either driven out or killed. ",
            "And then you get certain ukrainians who call russians mongols, i guess this is a good response",
            "Brainwashed russian bot!!1111 West is prosperity to all!!!\n\n\n/s",
            "But you are telling me this like USSR never exist. Im from country which was exploited from USSR. It's not cool. Because of USSR we had labor camps. But you don't care, because you like Russia.",
            "[removed]",
            "sure ruzzkie",
            "I have the idea that ruzzians in this sub are very aware of what they're talking about.",
            "We Wuz Vikangz",
            "USSR creat many labor camps in many countries. He is not russian bot, he just don't know history.",
            "Which country was made worse by USSR compared to before?",
            "Almost all countries were elevated by USSR. All citizens of USSR were equal and had prominent places. USSR had Georgian and Ukrainian premiers.\n\nTell us what country you are from so we can tell if you are lying or not.",
            "Which country you from?",
            "Sorry you need 20 subreddit karma to unlock the word 'you', this is to make sure newcomers understand [rule 1](https://www.reddit.com/r/UkraineRussiaReport/about/rules)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineRussiaReport) if you have any questions or concerns.*",
            "Dont feed me with your BS. I have long been tired of you, so offended and oppressed, whom everyone offended in the USSR. But for some reason, who lived better than others.\n\n\nLabor camp is a  just part of the prison system. Prisoners have to work. A lot and hard. To redeem for their guilt in front of society, and not just sit on a bunk  like nowadays. \n\n\nAnd tag /s on reddit means \"sarcasm\".",
            "Which country? What labour camp? Don't just talk ambiguous, generalised bs. Give us detailed examples.",
            "Prison labour wasn't invented by the USSR and it is still used in the USA. \n\nhttps://en.m.wikipedia.org/wiki/Penal_labor_in_the_United_States",
            "What does that even mean. Many people in many countries lost their property because of the USSR. Do you know which people have no right to property? Slaves.",
            "Tell me you to see if you are lying.",
            "Which country you from?",
            "Yes, you're right what is a labor camp. Only that on orders from Moscow many innocent people ended up there. I just remind that when talking about evil forces, here in this sub, directly forget saints like Stalin. But if you exploit people because of ideology it's ok for you, but when it's for profit, it's really bad 🤡",
            "But did you give when you were talking about the \"west\" countries? Why you didn't give detailed examples?",
            "So now we are changing the topic. In my country there wasn't labour camps before the red terror to come. Yeah they didn't invented them. Did I say it somewhere?",
            "Ok. Don't tell me. Just give me an example of a random country, that was exploited by the USSR. With legitimate sources of course. I'll wait.",
            "Lol just a shitty propaganda bot or you actually offended that someone asked which country was exploited by USSR?",
            "Are you actually denying to colonialism in Africa and Middle East? Really?\n\nhttps://en.m.wikipedia.org/wiki/Colonialism\n\nhttps://en.m.wikipedia.org/wiki/Colonisation_of_Africa\n\nhttps://www.bbc.com/news/world-middle-east-66984152\n\nhttps://www.dw.com/en/are-nigers-uranium-supplies-to-france-under-scrutiny/a-66711717\n\nFrance buying uranium from Niger for 1/10th of the market price. \n\nhttps://edition.cnn.com/2013/03/19/opinion/iraq-war-oil-juhasz/index.html",
            "Source? Proof?\n\nAlso i never said my country was exploited. I said i come from a *region* that saw colonisation and exploitation from the West for centuries. If you had any historical knowledge, you could guess where that is.\n\nAnd I'm not changing topics. You are talking about gulags, which are prisons with labour camps. Which is literally the prison industry complex of USA, operating to this day for the past century.",
            "But why? You don't make it? Why I should? \n\nI gave little example above. People lost their properties when usssr come to many countries. Slave don't have right to own property. I can continue but I don't see sense. You are asking for stuff which you don't make. No point.",
            "No, I just don't discuss my country with people I don't know where they're from. Often people here hide where they are from. I love how everyone is bot here, if they don't do what exactly pro-russian want.",
            "Because i actually know history and people that also know history, realise I'm not making anything up. Anyway, I'll copy my other comment. Feel free to reply to either. You, on the other hand, are lying. \n\n\"Are you actually denying to colonialism in Africa and Middle East? Really?\n\nhttps://en.m.wikipedia.org/wiki/Colonialism\n\nhttps://en.m.wikipedia.org/wiki/Colonisation_of_Africa\n\nhttps://www.bbc.com/news/world-middle-east-66984152\n\nhttps://www.dw.com/en/are-nigers-uranium-supplies-to-france-under-scrutiny/a-66711717\n\nFrance buying uranium from Niger for 1/10th of the market price. \n\nhttps://edition.cnn.com/2013/03/19/opinion/iraq-war-oil-juhasz/index.html\"",
            "You were the first who jumped to this discussion with an example of your \"exploited by USSR\" country, and now you are telling us that you don't want to discuss your country. This is ridiculous.",
            "I didn't, I just show that you want stuff which you don't provide. Still I don't know is it true for your country, but difference is that I don't care. How people who know history, know where are you from and that your country was exploited? Telepathic?",
            "I didn't say I don't want to discuss it. I don't want with him."
        ]
    },
    "UA POV - Russians capture Shumy village and break through to Toretsk – DeepState - PRAVDA": {
        "title": "UA POV - Russians capture Shumy village and break through to Toretsk – DeepState - PRAVDA",
        "score": 23,
        "url": "https://www.pravda.com.ua/eng/news/2024/06/22/7462019/",
        "content": "",
        "num_comments": 9,
        "comments": [
            "The Russian offensive in the Kharkov region is bearing fruit in the most unexpected places",
            "In before \"winning too slowly\",  \"3 day special mission operation\" and \"at this rate Russia will conquer Ukraine in about 500 years\" comments come in.",
            "True if big",
            "Something is definitely going on in the area.\n\nhttps://preview.redd.it/kwfnoynwl48d1.png?width=1733&format=png&auto=webp&s=252c1d0c6e279fce894d4eb1222e6382cf4396f2",
            "Hughmungus if Hugh",
            "Big if true!",
            "\"After endless Russian meat-wave attacks and 20k losses our defenders heroically moved to more advantageous positions\" (i.e. retreated)",
            "You forgot \n\n> It’s pathetic that Russia can’t defeat the “*poorest”* country in Europe"
        ]
    }
}