{
    "[GIVEAWAY - GLOBAL] Samsung Odyssey OLED G9 x UWMR: Win an OLED G9 to celebrate Samsung All Stars!": {
        "title": "[GIVEAWAY - GLOBAL] Samsung Odyssey OLED G9 x UWMR: Win an OLED G9 to celebrate Samsung All Stars!",
        "score": 52,
        "url": "https://www.reddit.com/r/ultrawidemasterrace/comments/1ditetd/giveaway_global_samsung_odyssey_oled_g9_x_uwmr/",
        "content": "https://preview.redd.it/ece80r8gkc7d1.jpg?width=3936&format=pjpg&auto=webp&s=d2e57967fde72eea5dec488633c0b57fb0769608\n\nHey r/UltraWideMasterRace. Samsung’s back and this time we have a global giveaway for a chance to win an Odyssey OLED G9. In celebration of the Samsung All Stars event happening on the Samsung Odyssey Twitch channel, we want to help one lucky winner ascend. \n\n**How to Enter:**\n\nHead to the Gleam Link and follow the Samsung Odyssey Twitch channel: [https://samsung-odyssey.com/UWMRxOdyssey-Twitch](https://samsung-odyssey.com/UWMRxOdyssey-Twitch)\n\nBe sure to do it through Gleam as our winner will be chosen there. \n\n**More Chances to Win During the Samsung All Stars Event:**\n\nTune in to the final All Stars event with basketball superstar Mikal Bridges and Nadeshot on Samsung Odyssey Twitch @ 7pm 18th June EDT for an additional monitor giveaway. \n\nP.S **every** Samsung Odyssey Twitch stream has a global monitor giveaway - even more reason to follow! \n\n**Check out the key specs of the OLED G9:**\n\n* OLED & Neo Quantum Processor Pro\n* 49” Dual QHD\n* DisplayHDR True Black 400\n* 0.03ms(GTG) Response TIme and 240Hz Refresh Rate\n* AMD FreeSync Premium Pro\n* Gaming Hub\n\n**TLDR:** \n\n**Prize:** [Samsung Odyssey 49” OLED G9](https://samsung-odyssey.com/SamsungUSOLEDG9)\n\n**Eligibility:** Global. 18+. \n\n**Duration:** June 18th - July 2nd\n\n**Entry Method:** [Follow the prompt on Gleam to follow the Samsung Odyssey Twitch channel](https://samsung-odyssey.com/UWMRxOdyssey-Twitch)\n\n**Winner Selection:** Random. Winner will be chosen via Gleam. \n\n**Terms and Conditions:** [On Gleam](https://samsung-odyssey.com/UWMRxOdyssey-Twitch)\n\n",
        "num_comments": 12,
        "comments": [
            "sounds cool, will watch",
            "How are we contacted if we win?",
            "Glhf everyone",
            "cool sadly its at like 2 am for me so I cant make todays steam but gl to others",
            "Why not. Sounds like a lovely way to win a beast of a monitor",
            "Idk, gleam doesn't seem to work for me right now.",
            "Amazing!",
            "Samsung Odyssey OLED G9 x UWMR!!!",
            "Awesome, GL everyone",
            "None of the links seem to be working at the moment",
            "randomly stumbled upon this thread while looking for good trading monitors, LG !"
        ]
    },
    "Shadow of the Erdtree in 32:9 is GORGEOUS": {
        "title": "Shadow of the Erdtree in 32:9 is GORGEOUS",
        "score": 98,
        "url": "https://i.redd.it/k04bxlklk08d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "A travesty that it is not officially supported.",
            "it should be a crime to play Elden Ring in anything less than 21:9. When you get to the Cerulean Fields it's just \\*chefs kiss\\*.",
            "I started ER yesterday on 5120x1440 and to my surprise it ran in full resolution for like 3 minutes. Then, stuttering and BAM, black bars back again...",
            "did you encounter and issues using flawless ultra wide? I’ve heard people have trouble after the update",
            "Is there a guide in how to play this in ultrawide and offline mode?",
            "Do you play this in offline / are you already banned for this?",
            "Do you still have to deactivate anticheat for ultrawide fixes to work? It is legitimately the one thing holding me back from a purchase.",
            "Just from small clips I’ve seen the environment looks all the same and not very appealing at all.",
            "The amount of passes this game gets for its technical shortcomings is staggering.  I get it’s a stellar game but the PC port left lots to be desired on the tech side of the table.",
            "I had really hoped that with AC6 natively supporting at least 21:9 that by now Elden Ring (which already *renders* the full 21:9 anyways) would have native ultrawide support, but *noooo*.",
            "100%. Walking over the hill was the dlc's siofra river moment!  I had to stop and just look around. ",
            "I had the exact same experience, for a minute there I actually thought they removed those stupid black bars lol",
            "They actually render the full scene, and add the black bars on top of it.  Seriously.  You can Google it if you don't believe me.  You're still taking the performance hit (minimal as it is for most of us) for those bits you aren't seeing too.",
            "There was a lighting issue which was fixed by just toggling flawless ultra wide on and off once or twice",
            "Flawless Widescreen works.\n\nBut the mod \"Ultrawide UI Fixes\" needs an update. It adjusts UI elements to properly fill in the screen.",
            "Google elden ring flawless widescreen",
            "This guy's video walks you through it pretty quickly   \n[https://www.youtube.com/watch?v=m8Y24o1q6ew](https://www.youtube.com/watch?v=m8Y24o1q6ew)",
            "Yes, I’d like to know this",
            "There's a mod to toggle EAC off, and then you just play offline.",
            "From small clips I have seen Porsche 911s look all the same not very appealing at all. That’s a typical internet pick opinion.\n\nSeriously you feeling ok under the hud ?",
            "I didn't know this! It's finally time for me to play!!!",
            "Yeah it was definitely the Siofra River moment for me too lol",
            "The worst is that they actually do render the full scene in those resolutions.  Then, put black bars on top of it.",
            "Is the lighting issue you’re talking about related to flickering shadows? Flawless Widescreen is working just fine for me but I’m seeing flickering shadows every now and then.",
            "I saw that there were a lot of bugs and the guides are almost 3 year old",
            "Sorry my opinion offended you",
            "In case you’re confused ER still does not support 21:9 natively",
            "Yeah that's what I noticed, it's a fucking stupid decision and makes no sense",
            "Yeah but not a fast flicker, more like someone turning a light switch on and off every now and then",
            "copy eldenring.exe into the same folder. rename start\\_protected\\_game to something else. rename the copied exe to start\\_protected\\_game. If you did that right you shouldn't get the EAC popup when starting the game. The main menu will tell you something about activity detected and go offline, that's fine. if it doesn't go offline then just go offline manually. Oh, make sure flawless widescreen is started and open before starting elden ring.",
            "It’s a stupid opinion and not based on experience or facts",
            "You should game in 4:3 then eh.\n\nSeeing more of the game is a feature, a bonusl, that's not an opinion. It doesn't change anything it looks the same, just more of it.",
            "Oh I know ER doesn't. I've been playing on an LG 45.",
            "As soon as seamless coop works again i will play through ER again with a friend and with Flawless Widescreen.",
            "What? I’m talking about the game not the aspect ratio.",
            "Haha I had the exact same plan",
            "Same. How long do you think it’ll be?"
        ]
    },
    "Took me a second to realize why my monitor was having a seizure": {
        "title": "Took me a second to realize why my monitor was having a seizure",
        "score": 166,
        "url": "https://v.redd.it/2exzc88f7z7d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Maybe it's allergic to the cat, idk.",
            "My phone is also currently having a seizure.. not because of a cat though. good times.",
            "Fellow melvor player!",
            "Been there. Many MANY times.",
            "Literally doing the cartography grind as I type this, I was super confused",
            "youtube shorts on the ultrawide......",
            "![gif](giphy|vyVxeMNGUBT7q)",
            "![gif](giphy|3o85xGocUH8RYoDKKs|downsized)\n\ncats he he he",
            "you canny control the little things",
            "Which way is up?",
            "lol cat tings",
            "I miss my plugin that automatically turned YT shorts into default video sized players :("
        ]
    },
    "ODYSSEY G9 to ODYSSEY OLED G8": {
        "title": "ODYSSEY G9 to ODYSSEY OLED G8",
        "score": 14,
        "url": "https://www.reddit.com/gallery/1dloo88",
        "content": "Was using the G9 for both sim racing and gaming but after only sim racing in VR now, I felt the need to upgrade my display.  And OLED was something I really wanted to try, I can say the HDR and pure blacks vs the VA panel on the G9, the upgrade was indeed worth it. I know the word upgrade is kind of subjective as I indeed did lose screen real estate and the higher refresh rate, the oled feels just as fast if not faster even with the lower 175hz. ",
        "num_comments": 4,
        "comments": [
            "Whats that stand you use for the speakers to be put sideways?",
            "Nice setup 😍 will get mine next week very excited how oled is and i hope the screen is wide enough 🙏",
            "This G8 Oled sexy as hell. Pls let us know if you face any issues with it. I really want to buy it rn but everybody seem to say not to 😩"
        ]
    },
    "I finally ascended": {
        "title": "I finally ascended",
        "score": 33,
        "url": "https://i.redd.it/v34ks26rw08d1.jpeg",
        "content": "You’ll have to forgive the clutter as I’m still cleaning things up and organizing. Feels good to streeeeetttchhh out",
        "num_comments": 8,
        "comments": [
            "Love that layout!  do you mind linking whatever monitors/stands you are using?  Thats awesome!",
            "Sure! So the stand is a Atdec AWMS-2-BT75-H-S from Amazon\n\nTop monitor is a Gigabyte g27q (I used to have three of them)\nThe ultra wide is the G93SC\n\nBelow that I made my own desk stand- just a couple bits of oak, some stain and then a cannibalized Ugreen iPad stand that I took the base off and screwed into the wood. \n\nI really wanted the balao riser but the cost was insane",
            "Cool and what is the little touchscreen? Been thinking of one for flight sim. Congrats",
            "There's a stream deck on the right, the touchscreen is just an ipad, however I also have a Lenovo portable monittor that I can plug in there instead, I just need to run the cable to my machine",
            "Thanks, hope it goes well",
            "Thanks, hope it goes well",
            "Thanks, hope it goes well",
            "Thanks, hope it goes well"
        ]
    }
}