{
    "VALORANT 8.11 Bug Megathread": {
        "title": "VALORANT 8.11 Bug Megathread",
        "score": 10,
        "url": "https://www.reddit.com/r/VALORANT/comments/1dejz8d/valorant_811_bug_megathread/",
        "content": "Greetings Agents!\n\nNew patch, new Bug Megathread! To avoid bug reports cluttering the subreddit and/or going unnoticed, a Megathread is posted after every patch so users may submit reports in one place. This allows Riot to easily keep track of the bugs by providing a central hub and also allows other users to confirm that they might have encountered the issue as well.\n\n##[**View the Current VALORANT Patch Notes!**](https://playvalorant.com/en-us/news/game-updates/valorant-patch-notes-811/)\n\n> ###Official Sources\n\n>> #####[**Submit an Official VALORANT Support Ticket**](https://support-valorant.riotgames.com/hc/en-us/requests/new)\n\n>> #####[**Official Article on VALORANT Error Codes**](https://support-valorant.riotgames.com/hc/en-us/articles/360045619633-Error-Codes-in-VALORANT)\n\n>> #####[**VALORANT Server Status by Region**](https://status.riotgames.com/valorant?)\n\n\n> ###Community Help\n\n>> #####[**Find Additional Help on /r/ValorantTechSupport**](https://reddit.com/r/ValorantTechSupport)\n\n>> #####[**Seek Help In the /r/VALORANT Discord**](https://discord.gg/zGkN8upuf7)\n\n---\n\n# Reporting a Bug\n\n1. A bug will ideally be accompanied with a screenshot or a video. This provides credibility to your report.\n2. Steps to recreate the bugs should be submitted if possible. This helps Rioters recreate the bug and helps them find the cause behind it.\n3. Unformatted, mematic, or joke reports are automatically indexed and may be removed by moderators to reduce the effort needed from Riot to view all reports.\n\n---\n\n# Formatting\n\n[**Reddit Formatting Guide**](https://reddit.zendesk.com/hc/en-us/articles/360043033952-Formatting-Guide)\n\n######When reporting a bug, please provide as much information as you can about your computer.\n\n    - Region:\n    - Type of Bug:   \n    - Description:   \n    - Video / Screenshot:   \n    - Steps to Reproduce:   \n    - Expected Result:\n    - Observed Result:\n    - Reproduction Rate:   \n    - System Specs:\n\nCopy paste the above text as a comment below and fill in your details!\n\n---\n\n\n# Example Bug Report\n\n• **Region:** EU ^(*<The region you are playing in when you encountered the bug.>*)\n\n• **Type of Bug:** Matchmaking ^(*<Client Bug, In Game Bug, etc.>*)\n\n• **Description:** Matchmaking doesn't work properly ^(*<Describe what was the bug that occurred.>*)\n\n• **Video / Screenshot:** image/video hosting site link ^(*<Example of the bug that occurred.>*)\n\n• **Steps to Reproduce:** Try to launch a game ^(*<Provide the steps necessary if someone else had to reproduce the bug.>*)\n\n• **Expected Result:** Match starting ^(*<What should have been the result when you follow the steps mentioned above?>*)\n\n• **Observed Result:** Getting stuck in infinite queue ^(*<What was the result you obtained when you followed the steps mentioned above?>*)\n\n• **Reproduction Rate:** 10/10 (happened 10 out of 10 times) ^(*<How successful are you in causing it to occur, out of 10?>*)\n\n• **System Specs:** Intel i5 Processor, Windows 7, Nvidia Graphics card (insert model number) etc. ^(*<System specifications hardware/software details.>*)\n\n---\n\n*From this Megathread the list of bugs will not be summarized and put up in the main body of the thread. Instead, Rioters go through and log all comments -- don't worry if you submit the 1500th or 3000th comment, they will all be progressively read.*",
        "num_comments": 65,
        "comments": [
            "**Please ensure that your comment is formatted with the template above** and that you have looked to see if your bug has already been reported by another user. Sometimes common bugs have already been listed (and even solutions discussed). Un-formatted or off-topic comments will be removed.\n\n_If you would like to discuss and ask for additional technical support, please head over to /r/ValorantTechSupport!_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/VALORANT) if you have any questions or concerns.*",
            "    - Region: Pacific (Mumbai Server)\n    - Type of Bug:   1068  \n    - Description:   Game crashes suddenly with the error that you lost connection  \n    - Video / Screenshot:   \n    - Steps to Reproduce:   Open game, happens on it's own\n    - Expected Result: Game crashes\n    - Observed Result: Game crashed\n    - Reproduction Rate:   100% with this new update\n    - System Specs: Ryzen 5000 series, integrated graphics",
            "- Region: EU\n\n- Type of Bug: In Game Bug\n\n- Description: It seems like Dizzy is holding Gekko's gun for a moment. (Maybe Gekko's gun was just a few meters away from him and looking down, but still connected to him idk)\n\n- Video: [https://vimeo.com/957420849](https://vimeo.com/957420849)\n\n- Steps to Reproduce: I have no idea. I tried playing Gekko in a custom game, but it didn't work\n\n- System Specs: AMD Ryzen 5 3600X 6-Core Processor, Windows 11, NVIDIA GeForce GTX 1660 SUPER",
            "- Region: Oceania\n- Type of Bug:   in game\n- Description:   if you fall off the map and die you can't ping the map while dead.\n- Video / Screenshot:   \n- Steps to Reproduce:   fall off the map, press tab, click on map.\n- Expected Result: should ping as normal\n- Observed Result: not able to ping\n- Reproduction Rate:   100%\n- System Specs: doesn't matter",
            "* Region: EU\n* Type of Bug: In Game\n* Description: Lower Framerates + Abnormally high Game-to-render latency. While this only seems to be minor and not having any impact on the game, some data seems to be misread.\n* Screenshot: [Image](https://imgur.com/xIfS3Ua)\n* Steps to reproduce: Simply boot up the game and be at least in the agent selection, mode + map doesn't matter.\n* Expected Result: Normal latency numbers \n* Observed result: Latency numbers that would result in a 54 year latency delay.\n* Reproduction Rate: 10/10\n* System Specs: AMD Ryzen 7 5800X, Windows 11 23H2, Nvidia GeForce RTX 3080 OC from ASUS, updated on newest drivers with yesterdays patch.",
            "* Region: APAC\n* Type of bug: Agent selection\n* Description: FPS drop then freezes during agent selection\n* Video / screenshot: N/A I can't record when it freezes haha help\n* Steps to reproduce:\n   * Open VALORANT\n   * Queue to any game mode\n   * Even when not selecting or selecting, FPS drop happens\n* Expected result: should not FPS drop by a lot, should be at least 700 FPS based on stats before patch\n* Observed result: After FPS drop, game freezes and causes \"queue dodge\" when I have no choice but to wait\n* Reproduction rate: Happens 100% during the first game queued, happens not as much as more games queued\n* System specs:\n   * Windows 11\n   * 32gb 5200hz\n   * R9 7900X3D\n   * Radeon 7900 XTX",
            "- Region: North America\n- Type of Bug: In-game\n- Description: If you are in the process of collecting an ult orb and the spike finishes planting, you can hold the interact key to continue “collecting” a nonexistent orb.\n- Video/Screenshot\n- Steps to reproduce: have a teammate start planting the spike, start collecting an ult orb, finish planting the spike\n- Expected result: The collection animation ends\n- Observed result: The collection animation does not end\n- Reproduction rate: 100%\n- System specs: doesn’t matter (I have observed this in various versions of the game)",
            "- Region: APAC\n- Type of Bug: Frame drops during Agent Select\n- Description: In any gamemode with an Agent Select, frames drop significantly to a slideshow and immediately goes back up to normal framerate rapidly\n- Video / Screenshot: \n- Steps to Reproduce: Queue for a game and wait until Agent Select\n- Expected Result: Normal framerate\n- Observed Result: Framerate drops significantly and goes back to normal and vice versa rapidly\n- Reproduction Rate: 10/10\n- System Specs: AMD Ryzen 5 3500, AMD RX560, Windows 11, 16GB DDR4 RAM 3.2GHz",
            "- Region: BR\n- Type of Bug: In Game bug\n- Description: Bullet tracer issues, setting bullet tracer to off doesn't apply for all guns, only yours, when it’s my own gun/skin, I do not see a single bullet tracer. However, if it is someone else’s gun, or even spectating an ally I would see the bullet tracers even if I have the settings to off\n- Steps to Reproduce: Turn off bullet tracers, get a skin from someone dropped on the floor, shoot it and you'll see bullet tracers\n- Expected Result: Don't see the bullet tracers, even when spectating an ally or shooting any weapon/skin\n- Observed Result: Able to see bullet tracers even when you have it turned off\n- Reproduction Rate: 10/10\n- System Specs: doesn't matter",
            "Region: US west\nType: controls \nDescription:\nHeads up I’m not sure what causes it but there’s a glitch in the beta that’s keeps u frozen once u leave the buy menu. I think what happened was I bought a gun while also voting no on a surrender and it broke it but I’m not sure. I would just be careful doing too many inputs at once. \nExpected results: able to buy and vote surrender\n\nObserved results: frozen locked out of your controls\n\nReproduction rate: unsure not willing to test it since I don’t want to get penalized \n\nSystem specs: PS5 beta",
            "- Region:  Any\n- Type of Bug:  In-Game\n- Description:   On Lotus, the minimap and overlay map at the breakable door choke into B site still has not been updated to reflect the map changes since patch 8.0. This causes players who play controller agents like Brimstone and Clove to smoke that chokepoint shallower than intended from defenders, or attackers coming from breakable door.\n- Video / Screenshot:   [image](https://www.dropbox.com/scl/fi/lrgspkzm6pyg0l6kwktb4/astra2.PNG?rlkey=9nbo870wut32ogjh2k4bhb62c&dl=0)\n- Steps to Reproduce:   Play any controller agent on Lotus, use smokes at breakable door room at chokepoint into B site, notice the difference between in-game map boundaries and minimap/overlay map\n- Expected Result:  Minimap / smoke map overlays should reflect the map changes from Patch 8.0\n- Observed Result:  Minimap / smoke map overlays do not reflect the map changes from Patch 8.0\n- Reproduction Rate:  100%\n- System Specs:  AMD Ryzen 7 7700X 8-Core Processor, Windows 10, AMD Radeon RX 6800 XT",
            "- Region: Pacific\n\n- Type of Bug:   client\n\n- Description:   game freezes completely\n\n- Video / Screenshot:   \n\n- Steps to Reproduce:   someone queue dodges in agent select\n\n- Expected Result: exit out of agent select, returns to party in queue\n\n- Observed Result: game freezes completely, does not respond to anything, must force quit the game using task manager and restart\n\n- Reproduction Rate:   100% (the 2/2 times my game has been queue dodged by someone else)\n\n- System Specs: \n\nProcessor\t12th Gen Intel(R) Core(TM) i7-1255U   1.70 GHz\n\nInstalled RAM\t16.0 GB \n\nSystem type\t64-bit operating system, x64-based processor",
            "**Region:** Mumbai  \n**Type of Bug:** Client Crash  \n**Description:** Was getting an issue \"we are unable to successfully install while a riot client process is already running\". So, I deleted all the Riot Games folder. I reinstalled it by running it as Administrator. Now whenever i open Valorant or Riot Client app, I get a white Screen with \"Not Found\" written on the top left corner.  \n**Screenshot:** [https://imgur.com/a/ZnQ6rhK](https://imgur.com/a/ZnQ6rhK)  \n**Steps to Reproduce:**  Delete all the riot games folder. -> install valorant (with run as adminstrator) -> run the client app.  \n**Expected Result:** Riot Client app should open  \n**Observed Result:** Getting Not Found Error.  \n**Reproduction Rate :** 10/10\n\n**System Specs:** AMD ryzen 6800H, Windows 11, Nvidia RTX 3060.",
            "- Region: South East Asia / SEA\n\n- Type of Bug: In Game Bug\n\n- Description: Omen can use Shrouded Step/teleport to out of bound outside of barrier in Abyss, particularly at buy phase\n\n- Video / Screenshot: [Video 1](https://x.com/oviodamion/status/1802241808854089925) [Video 2](https://x.com/oviodamion/status/1802245496867577979)\n\n- Steps to Reproduce: Video 1: Shroud Step to the edge of the barrier at B Site, then after falling down outside barrier, Step again to Danger | Video 2: Step to the top edge of the barrier at A Main from Attacker Spawn.\n\n- Expected Result: Should be teleported to outside of the barrier\n\n- Observed Result: Video 1: Teleported outside of barrier before buy phase finished | Video 2: Potentionally having advantage position\n\n- Reproduction Rate: 100% with little window time and precision in 2nd Step at Video 1, otherwise it's 100% for Video 2\n\n- System Specs: N/A, Friend's Posts",
            "    - Region: OCE/APAC/NA\n    - Type of Bug: VOICE CHAT NOT WORKING \n    - Description: Party chat and team chat (voice) both not working on my NA and OCE account\n    - Steps to Reproduce: idk im just playing and randomly itll disconnect\n    - Reproduction Rate: Every hour on oce, 10 minutes on NA\n    - System Specs: Ryzen  5 3600, Nvidia GTX 1660",
            "**Region:** NA\n\n• **Type of Bug:** In-Game Bug\n\n• **Description:** Gekko ability reclaim doesn't work in TDM\n\n• **Steps to Reproduce:** Queue TDM, pick Gekko, use Dizzy or Wingman (Thrash reclaim works fine), reclaim the used ability \n\n• **Expected Result:** Ability should have a shortened cooldown\n\n• **Observed Result:** Ability continues to have the longer cooldown it would have if it hadn't been reclaimed\n\n• **Reproduction Rate:** 10/10 \n\n• **System Specs:** Irrelevant",
            "**Region:** EU (Irrelevant but still provided)\n\n**Type of Bug:** In Game\n\n**Description:** On Abyss, Yoru can use his teleport to get below the map on A site\n\n**Video / Screenshot:** [https://outplayed.tv/media/04JX7v](https://outplayed.tv/media/04JX7v)\n\n**Steps to Reproduce:** Jump off the left side (left side compared to defender spawn) of the bridge on A site. After a bit (no exact time/distance, easy to guess after watching video of me doing it) place a Yoru gatecrash (E) using right-click. Instantly use gatecrash to teleport below the bridge. Use another gatecrash or Dimensional Drift (X) to get to an even lower part of the map, allowing for an off angle to hold the spike with an operator (can hold spike with any gun, operator is easiest to hold spike with).\n\n**Expected Result:** The gatecrash should have been broken instantly, as seen with using the gatecrash on other areas below the map.\n\n**Observed Result:** The gatecrash does not get broken, allowing Yoru to teleport below the instant kill-zone. Another gatecrash or Dimensional Drift allows Yoru to get to even lower areas of the map without dying.\n\n**Reproduction Rate:** 10/10 (Very easy to replicate)\n\n**System Specs:** Irrelevant",
            "**Region:** EU (Irrelevant but still provided)\n\n**Type of Bug:** In Game\n\n**Description:** On Abyss, Yoru can use his teleport in certain locations where they get instantly broken to stack multiple Gatecrash (E) icons above his ability symbols.\n\n**Video / Screenshot:** [https://outplayed.tv/media/OKla2J](https://outplayed.tv/media/OKla2J)\n\n**Steps to Reproduce:** Find an area of the map where Yoru can place his gatecrash and the gatecrash instantly breaks due to the kill-zone (An example of this shown in the video). Using multiple gatecrashes will cause the icons to stack, none of which are real, as in no actual gatecrashes exist on the map.\n\n**Expected Result:** After the gatecrash is broken, the icon should disappear.\n\n**Observed Result:** The gatecrash icon does not disappear, instead using multiple gatecrashes cause the icons to stack.\n\n**Reproduction Rate:** 10/10 (Very easy to replicate)\n\n**System Specs:** Irrelevant",
            "* Region: SEA\n* Type of Bug: Settings Bug\n* Description: In Controls > Actions, I have a jett profile, even before patch 8.11. Which binds my tailwind ability set to \"Thumb mouse button\", and all profiles will reset everytime I log in to Valorant\n* Video / Screenshot:\n* Steps to Reproduce: Restart Valorant\n* Expected Result: Agent profile not missing\n* Observed Result: \n* Reproduction Rate: 100%\n* System Specs: doesn't matter",
            "- Region: NA\n- Type of Bug: in game   \n- Description: Can't ping map when dead. This is specifically only in Abyss\n- Expected Result: Can ping map when dead.\n- Observed Result: Cannot ping map when dead. My teammate couldn't either, but another teammate could. \n- System Specs: Don't think it matters since my teammate couldn't ping either. 10400F + 6800 XT",
            "    - Region: NA\n    - Type of Bug: In game\n    - Description: Neon has movement error at the end of her slide as she stands up. If you continue to hold crouch there is no movement error. Feels inconsistent to expected changes to her slide.\n    - Video / Screenshot: \n    Posted about this before thread was up -  https://www.reddit.com/r/VALORANT/comments/1ddyu3j/neon_movement_error_at_end_of_slide/  \n    - Steps to Reproduce: Slide (release all movement keys) with neon, shoot at the end of slide. Shooting error graph shows movement error, bullet goes in expected places even if only one bullet is shot.\n    - Expected Result: Slide, no movement error should appear throughout the entire slide animation. Holding crouch vs release crouch should not have different results in respect to movement error.\n    - Observed Result: Slide, at the end of slide there is movement error. If crouch is held, movement error disappears.\n    - Reproduction Rate: 100%",
            "- Region: NA\n- Type of Bug: In game coms wheel\n- Description:   comm wheels and menus all jacked up. Duplicate items, scroll wheel appears where shouldn't, menu options aren't correct.\n- Video / Screenshot:   \n- Steps to Reproduce: Validate comm wheel and menu options\n- Expected Result: Comm wheel works normally and menu comm options work properly\n- Observed Result: Don't work right. Menu > quiet says \"lets play slow\" not quiet. Multiple duplicate options across various comm wheels pre-round attack side combat and strategy wheels have duplicate options.\n- Reproduction Rate:   100%\n- System Specs: 4090 7800x3d",
            "- Region: US/NA\n\n- Type of Bug:   In game Bug\n\n- Description:   When in a custom match with cheats enabled, and you toggle your Ghost state (on/off) cyphers cam camera starts to fall through the map,\n\n- Video / Screenshot:   \n\n- Steps to Reproduce:  start a custom match. and choose cypher.  Place a cypher cam anywhere, and turn ghost on and off\n\n- Expected Result: Cypher cam doesnt fall through the map\n\n- Observed Result: it does\n\n- Reproduction Rate:  Every time 10/10\n\n- System Specs: Doesnt realllly matter, i7 12700k, 3070 windows 11",
            "    - Region: NA\n    - Type of Bug: In-Game\n    - Description:   Viper's orb expected location is incorrect\n    - Video / Screenshot:   \n    - Steps to Reproduce:   View orb icon on minimap and throw to see actual location\n    - Expected Result: Orb lands where the preview shows\n    - Observed Result: Orb doesnt land where the preview shows  \n    - Reproduction Rate:   10/10\n    - System Specs: N/A",
            "* Region: NA\n* Type of Bug: In-Game\n* Description: Clove's movement is faster than intended.\n* Video / Screenshot: [Video](https://youtu.be/6fRJb_wipZU)\n* Steps to Reproduce: Aim duel against Clove after they've used Pick Me Up (i think that's the cause?)\n* Expected Result: Normal strafe speed when an enemy crosses.\n* Observed Result: Abnormal strafe speed when crossing, exaggerated to almost the new Reyna Dismiss speed.\n* Reproduction Rate: Unknown, first encounter of this.\n* System Specs: Intel i7 13700KF, Nvidia RTX4080, 16GB 5600 RAM, Windows 11",
            "**Region**: EU  \n**Type of Bug**: In game  \n**Description**: There is a specific wall on Abyss where Cypher's camera just stops working. It kind of looks like x-ray but I don't think it actually is x-ray, just looks weird, making that cam usage unusable.  \n**Video**: [video](https://imgur.com/a/S8XKNcA)  \n**Steps to reproduce**: Play Cypher on Abyss attack side and place cam on that specific wall.  \n**Expected result**: Cam not bugged, just like on other walls.  \n**Observed result**: Cam bugged on this specific wall.",
            "\\*\\*Edit\\*\\*: I would like to retract this bug report, I was accidentally pressing L3 (melee switch) in conjunction with Triangle which swapped me to preferred weapon and then to secondary weapon almost instantly making it seem like it was just switching to secondary.\n\n• **Region:** US East\n\n• **Type of Bug:** In Game Bug\n\n• **Description:** While using \"Traditional\" controller setup and running with a knife, pressing Triangle to switch to your stronger weapon does not always switch to the stronger weapon as indicated in the menu.\n\n• **Reproduction Rate:** 6/10 times\n\n• **System Specs:** PS5",
            "- Region: NA\n- Type of Bug:  in game\n- Description: controller cursor will disappear mid game\n- Video / Screenshot:   \n- Steps to Reproduce: happens randomly \n- Expected Result: cursor should always be visible \n- Observed Result: cursor not visible \n- Reproduction Rate:   100%\n- System Specs: Xbox Series S",
            "* Region: North America \n* Type of Bug: In-game\n* Description: A fresh Gekko ultimate (not picked up) will not drop a thrash orb if you have already picked one up in that round. Mostly relevant for spike rush but could technically happen in ranked.\n* Video/Screenshot:\n* Steps to reproduce: Pick Gekko in a custom game with cheats on (this can also occur in a real game without cheats, and has happened to me in spike rush, but it is easier to test in custom games). Turn on infinite abilities and use Gekko ultimate a few times in front of you, each one will drop a thrash orb. Now pick up one of the thrash orbs. Use Gekko ultimate a few more times, none of these ultimates will drop a thrash orb whether or not it has been picked up from the thrash orb (you can tell if you are using the picked up ultimate since it will color the ability yellow on the UI).\n* Expected result: All Gekko ultimates that are not from a thrash orb should drop a thrash orb, and all Gekko ultimates that are from a picked up thrash orb should not drop a thrash orb.\n* Observed result: All Gekko ultimates in a round will no longer drop thrash orbs after picking up a thrash orb in that round.\n* Reproduction rate: 10/10\n* System specs: irrelevant",
            "* Region: EU- Type of Bug: In Game\n* Description:   Aim assist on PC (Suspected)\n* Video / Screenshot:   N/A \n* Steps to Reproduce:   Play valorant on Console then play on PC- Expected Result: No aim assist\n* Observed Result: Aim slows down in the general vicinity of enemies  *even through walls* this is very noticeable on round start and it slows down mouse input so much it can make turning impossible. The speed slowdown is very severe and the area to trigger it is fairly large.\n* Reproduction Rate:   Unknown\n* System Specs: PS5 => FX 8350 + GT 710",
            "• **Region:** ASIA, APAC\n\n• **Type of Bug:** Game Bug\n\n• **Description:** 8000hz is unplayable (because of lag) if I change polling rate 8000hz to 1000hz, not a aim senstivity (Ingame sensitivity and dpi is same value, just change polling rate/ Raw input is on)\n\n• **Steps to Reproduce:** Change up to 2000hz, 4000hz, 8000hz polling rate\n\n• **Expected Result:** Aim sensitivity is very different and 8000hz not playable\n\n• **Reproduction Rate:** 10/10\n\n• **System Specs:** AMD 5800X3D, 32GB RAM, RTX4060, Windows 11",
            "    - Region: Brazil\n    - Type of Bug: In Game Bug\n    - Description: the container on bombsite A becomes invisible when Astra enters Astral Form or Omen is in Dark World. However, it is still possible to smoke over the invisible container.\n    - Video / Screenshot: https://rb.gy/19b486\n    - Steps to Reproduce: Enter the new Map Abyss\n    - Expected Result: Able to see the container\n    - Observed Result: Invisible container\n    - Reproduction Rate: 100%\n    - System Specs: doesn't matter",
            "Region : Eu\n\nType of bug: Cannot load the game.\n\nDescription: Instantly says connection lost. We are having trouble reaching the riot servers. I played all day on saturday but since yesterday the game does not start up anymore. \n\nExpected Result: be able to start up the game. \n\nSystem specs : Xbox",
            "[removed]",
            "• **Region:** OCEANIC\n\n• **Type of Bug:** Design bug\n\n• **Description:** I dont know if this is a bug or a feature, but its uhhhh.. yeah\n\n• **Video / Screenshot:**  \n[https://ibb.co/1qCqQqR](https://ibb.co/1qCqQqR)\n\n[https://ibb.co/yfLTjm0](https://ibb.co/yfLTjm0)\n\n[https://ibb.co/5rhbLq7](https://ibb.co/5rhbLq7)\n\n• **Steps to Reproduce:** Open buy menu and look at the close icon in the top right\n\n• **Expected Result:** No missing pixels\n\n• **Observed Result:** X in the top right is missing pixels a triangle of them\n\n• **Reproduction Rate:** 10/10 (happened 10 out of 10 times)\n\n• **System Specs:** All pc specs. tested on 2 pcs and 1 laptop.",
            "- Region: EUW\n\n- Type of Bug: UI Bug / Error\n\n- Description: \"SPIKE CARRIER KILLED\" message is misaligned to the right in some resolutions\n\n- Video / Screenshot: This error is even shown in a post by the X page of Valorant itself. https://x.com/VALORANT/status/1765452728518480095/photo/1\n\n- Steps to Reproduce: Kill the spike carrier. In my case it does not happen when playing at 1440p, but it does when playing at 2160p resolution.\n\n- Expected Result: A non-misaligned text\n\n- Observed Result: A misaligned text\n\n- Reproduction Rate: 10/10, if we consider that you are playing at 4k resolution. Other resolutions might have the same issue.  \n\n- System Specs: Ryzen 5 5600x, RTX 3060ti, 16GB DDR4 3000Mhz, Windows 11 Pro Version 10.0.22631 Build 22631",
            "     Region: na east \n    - Type of Bug:  Ui not responding. \n    - Description:   sometimes when playing the game for a few matches the ui will completely stop working ether in game or on the main menu.\n    - Video / Screenshot:   na\n    - Steps to Reproduce:   play a few matches or make a full party seems to cause it. \n    - Expected Result: Should be able to use the ui lol \n    - Observed Result: cant use the ui without quiting the game.\n    - Reproduction Rate:  50 percent of the time\n    - System Specs: Xbox Series consoles both s and x as well as ps5 (friends have had the same issue.)",
            "* Region: EU\n* Type of bug: VAN -79\n* Description: Game crashes on opening\n* Video/screenshot: \n* Steps to reproduce: launch game\n* Expected result: game launches\n* Observed result: game crashes before reaching the main menu\n* Reproduction rate 100%\n* System specs: Intel i5 processor, windows 10, NVIDIA GeDForce GTX 1070ti",
            "- Region: EU\n\n- Type of Bug: Game freeze\n\n- Description: After many alt-tabing from game my screen went black, and i need to hard reset my pc\n\n- Video / Screenshot: just black screen\n\n- Steps to Reproduce:  alt tab a few times\n\n- Expected Result: alt tabing without freezing my pc\n\n- Observed Result: alt tabing without freezing my pc\n\n- Reproduction Rate: 70%\n\n- System Specs: i7-12700KF, RTX4070, Windows 11",
            "Region: EU\n\n\nType of bug: in game fpa drop and freze a lot\n\n\nDescription: FPS drop then and a lot of freeze \n\n\nVideo / screenshot: N/A \nSteps to reproduce:\n\n\nOpen VALORANT\n\n\nQueue to any game mode\n\n\n\n\n\n\nExpected result: should not FPS drop by a lot, should be at least 700 FPS based on stats before patch\n\n\nObserved result: After FPS drop, game freezes and and fps drop i have no choice but to wait\n\n\nReproduction rate: Happens 100% during the first game queued, happens not as much as more games queued\n\n\nSystem specs:\n\n\nWindows 11\n\n\n32gb 6000hz\n\n\nI7 13700kf\n\n\nRtx 4070 ti",
            "    - Region: NA\n    - Type of Bug:   in game\n    - Description:   Wingman can clip into walls when attempting to bounce and follow the wall.\n    - Video / Screenshot:   https://imgur.com/a/bz1BbX1  and https://imgur.com/a/afDn4LH\n    - Steps to Reproduce:   aim at wall, look slightly to the left or right (10-20 degrees) and run up and throw wingman\n    - Expected Result: wingman to bounce off wall\n    - Observed Result: wingman will clip into the wall and make alot of noise while folloing the wall\n    - Reproduction Rate:   8/10 (its not super precise but with practice is fairly consistent)\n    - System Specs: Not relevant.",
            "• **Region:** NA\n\n• **Type of Bug:** Wallhacking\n\n• **Description:** Guy openly wallhacking in immortal/radiant games and then putting it on his youtube channel. Note that I attempted to report him on the official website and the official website wouldn't let me because he wasn't in my past 20 games.\n\nIn-game name was rakkastakka\n\n• **Video / Screenshot:** [https://www.youtube.com/watch?v=-G3k-921pMs](https://www.youtube.com/watch?v=-G3k-921pMs)",
            "    - Region: Oceania\n    - Type of Bug: in game bug / visual bug\n    - Description:   when a projectile with a trail (e.g. raze nade) travels through a teleporter, the trail stretches from in front of the teleporter to the destination\n    - Video / Screenshot:   https://youtu.be/yFVc_pl6tYo\n    - Steps to Reproduce:   go in range, select raze, throw nade through tp\n    - Expected Result: the nade tps, no trail\n    - Observed Result: trail extending from a bit infront of start tp to end tp\n    - Reproduction Rate:   100%\n    - System Specs: rx570, ryzen 5 2600",
            "• **Region:** EU\n\n• **Type of Bug:** Team and party voice chat push to talk delay\n\n• **Description:** There is sometimes a delay between the moment I press the push to talk button and the moment my icon appears ( that's when it shows that I can talk and everyone can hear me ).\n\n• **Video:** [https://youtube.com/shorts/l3tMyvIFSpI?feature=share](https://youtube.com/shorts/l3tMyvIFSpI?feature=share)\n\n• **Steps to Reproduce:** While trying to talk in a game the party and team voice chat won't work for a couple seconds.\n\n• **Expected Result:** I should be able to talk as soon as I press the push to talk button.\n\n• **Observed Result:** I cannot talk for a few seconds until my icon appears on the left side of the screen.\n\n• **Reproduction Rate:** 10/10 of the times. Yes, this bug occurs every single game without fail and it happens multiple times during a single match.\n\n• **System Specs:**  Intel i5 8600k Processor, Windows 10, Nvidia Graphics card GTX 1080",
            "I am getting a bug where it's only tracking my playtime as xp and not anything else. So I am barely getting xp every match. Weekly and daily challenges are still getting completed as normal though. Please fix this. it's very annoying",
            "    - Region: EU\n    - Type of Bug: In Game Bug\n    - Description: Enemy player is invisible\n    - Video / Screenshot: https://imgur.com/a/D37Q9RK \n    - Steps to Reproduce: not a clue, i did lag in the game of said video though\n    - Expected Result: players stay visible throughout the game\n    - Observed Result: player turned invisible\n    - Reproduction Rate: once\n    - System Specs: Ryzen 7 3700X 8-Core Processor, Windows 10, NVIDIA Geforce RTX 3080",
            "- Region: NA  \n- Type of Bug: UI  \n- Description: In addition to all of the other comm wheel bugs already posted here, the comm wheel doesn't come up at all during the warmup phase in the escalation game mode  \n- Steps to Reproduce: Press the button assigned to the comm wheel in escalation during warmup  \n- Expected Result: Comm wheel should come up  \n- Observed Result: Comm wheel does not come up  \n- Reproduction Rate: 10/10",
            "• Region: OCE\n\n• Type of Bug: In Game Bug? Not sure.\n\n• Description: Sage was able to build her wall on top of spike and completely hide it, requiring wall destruction to defuse. (Lotus, spike site C)\n\n• Video / Screenshot: https://youtu.be/DutpKZX_Qj8\n\n• Steps to Reproduce: I guess plant spike and build a wall in that exact configuration as Sage?\n\n• Expected Result: Wall is apparently supposed to break if Planted spike is present in the wall build location?\n\n• Observed Result: Sage wall was able to completely obstruct spike.\n\n• Reproduction Rate: No idea, haven't tried reproducing myself.\n\n• System Specs: AMD Ryzen 7 3700X, Windows 10, Radeon RX 5700XT, 16GB DDR4-3200 CL18.\n\nEDIT: Fixed the link, forgot to publish it lmao.",
            "* Region: EU\n* Type of Bug: Client Bug\n* Description: If I buy a skin, favorite it, then refund it, I can no longer remove that skin from my favorites\n* Video / Screenshot: [https://imgur.com/a/SPPunn2](https://imgur.com/a/SPPunn2)\n* Steps to Reproduce: Buy skin, favorite it, get refunded, try to remove from favorites\n* Expected Result: The favorite button should be enabled (clickable) for previously owned skins, and unfavorite by default when refunded\n* Observed Result: I have a favorite skin that I no longer own\n* Reproduction Rate: 10/10\n* System Specs: Ryzen 7 7800X3D, Windows 11, RTX 4080 Super",
            "I have also seen this bug in Mumbai servers (India). Its impossible to replicate. I threw my dizzy and dizzy had my gun so if I shoot my gun then dizzy replicates my shooting.",
            "the reclaim not working is set by devs and is not a bug. the reason is that because you need to kill/wait/play to get your ability percentage (%) and reclaiming it gets it back instantly, which is unfair and destroys the point of the TDM mode",
            "if this is on viper v3 pro, i think that mouse has some bugs with 8k sens",
            "This is on xbox your game is 4 years old you got no excuse for the lack of foresight",
            "Hi, didn't you notice any changes in your cpu temperature since this update? For me sometimes the vanguard service mode do a super scanning eating 1 core and then stop. I'm asking bc I have the same cpu as your."
        ]
    },
    "VALORANT Console Limited Beta Megathread": {
        "title": "VALORANT Console Limited Beta Megathread",
        "score": 759,
        "url": "https://www.reddit.com/r/VALORANT/comments/1dfpxse/valorant_console_limited_beta_megathread/",
        "content": "### Greetings Agents!\n\nToday the VALORANT Console Limited Beta officially launches and codes are released. This thread will act as a megathread for sharing codes, discussing the release, and finding help as players begin their console journey.\n\nPlease be sure to check the below resources first if you have any questions.\n\n---\n\n###[VALORANT Console Beta Main Page](https://beta.playvalorant.com/en-gb/)\n\n###[VALORANT Console Beta FAQ](https://playvalorant.com/en-gb/news/game-updates/console-beta-faq/)\n\n###[VALORANT Console Limited Beta Support Guide](https://support-valorant.riotgames.com/hc/en-us/articles/29205299064595-VALORANT-Console-Limited-Beta-Guide)",
        "num_comments": 14937,
        "comments": [
            "\n# !!!!!!!!! Do not accept any requests for payment via PMs. Please report any users trying to sell codes. !!!!!!!!!\n\n\nMonetary transactions are **not permitted**. Attempts to sell or buy codes will be met with a ban. We do not want any users being scammed during this launch.",
            "if anyone wants to share codes to each other if some of us get lucky just reply",
            "I only have one friend to play with so if i get a code ill be sure to share the extras here\n\nEdit: I didnt get a code. Good luck friends",
            "Let me in!!!",
            "I like to imagine thousands of Valorant players frantically checking their email",
            "[removed]",
            "I don’t have any friends on Xbox so I’ll give 4 codes on Xbox ! 🤝",
            "I'm the only one with PS5 among my friends. If I'm lucky, I will have 4 codes to give out. Stay tuned.\n\nPs. I'll prioritize SEAsia, Asia and Oceania compatriots.\n\nPss. Looks like I'm probably not getting it. Only available for US, Canada, EU and JPN. RIP. Please share amongst yourselves.",
            "Codes are still not out yet, 1PM PT or 4PM eastern if you on the east coast. Sorry I have to say for the 10,000th time but yeah. Also be weary of sending complete strangers on X your Riot ID for codes. I try to be optimistic but some people online are no good liars. Have patience everyone, better to wait and have peace of mind… than to be scammed or hacked.",
            "**XBOX PLAYER THREAD POST**: All players looking for Codes. Reply under message. All players looking to support players by giving them codes also post here. UPVOTE THIS TO REACH TOP!",
            "I’ll share the code if i get it, hopefully someone else will with me if i don’t!",
            "I hope I get one. I played Valorant on PC but I could never get mouse and keyboard feeling natural, so I'm hyped. I will also share any extra codes I get.",
            "LETS MAKE A MEGA POST: UPVOTE THIS FOR ALL PEOPLE WHO STILL NEED XBOX CODES!",
            "Could share 4 codes if I get an invite. If not, I would need one :)",
            "I’m desperate for one! Do we know if they already got released?",
            "I signed up on both Xbox and PS5 and just have 1 friend to share with, so if I get accepted I’ll have 9 codes to share on here. If anyone can return the favor as a backup that would be great!",
            "Warriors. I’m tapping out. I’ll just play it when it releases. Best of luck to everyone! 👍🏻",
            "Not getting the codes earlier so we could predownload feels a bit silly.\n\nEdit: The game took like 10 mins to download. Guess I'm silly. \n\nEdit edit: I'm out of codes. Sorry.",
            "THERES A POST TO UPVOTE ABOUT ALL PEOPLE STILL NEEDING XBOX CODES. Go upvote it. WE ARE MAKING A MEGA POST!!!",
            "Been refreshing my email and reddit for more than an hour... Yeah guys i'm done. I'll just wait for my turn to come cause this is making me go insane and anxiety doesn't help at all",
            "I’ll have 3 extra codes to give out if I get in. Can anyone help me out if I don’t?",
            "They will be sending codes over the hour so don't be disappointed if you don't have one already",
            "The life of a code beggar its so damn hard",
            "Signed up but don't have a PS5, will give out codes if I get some.",
            "I'll have xbox codes to give out",
            "I have zero friends to play with so I’ll have plenty of codes too. NA east coast",
            "I registered With 2 Accounts 3 Days ago,if i dont get a Code Its Kinda Hard to get a Code i guess then",
            "If codes are sent around the OCE area I'm happy to send my extras out to anybody who wants 'em. That is, *if* OCE gets codes.",
            "Can we just agree the ones who got into the beta must carry a flag for us all who couldn't make it into it someone can be forward charge into battle",
            "IVE REFRESHED THIS 1000TIMES IM GOING INSANE",
            "Fuck this I'm giving up it was nice knowing you all",
            "If i get a spare playstation code i will share 5x",
            "**Announcement:(Codes Being Released)** ~ There will be codes floating around for the next couple hours as Riot releases them. All players wishing to make pacts with other players should do so now. As well I still need an Xbox code so some please DM bless me. Thats all.",
            "ive officially retired after the almost two hours of searchiing i just hope i get lucky in the next batch or if one of yall get a code a dm would be greatly appreciated and good luck yall searching still but i wouldnt waste your time its a 1 in 1 million to get it right now GGGGGGGGGGGGGGGGGs",
            "I got 4 if anyone needs",
            "Will be happy to get an access and share the codes if I get lucky myself. My PSN - Ajelpwnz and my Discord - ajel \n\nGood luck everybody 🤞",
            "**UPVOTE ALREADY MADE XBOX PLAYER THREAD POST. We gotta beat 90 votes for top spot**",
            "First of all, very excited to try this game out.  I’m on Xbox and no friends so I’ll be sharing all 4 if I get invited 😎",
            "i'm an xbox user and if anyone has any extra codes please one my way. if i get in i'll also try to send the codes out",
            "Will give 5 codes if selected!",
            "I’ll share 4 codes if I get the email",
            "My wife is going to divorce me if I don't get a PS5 valorant code. Please help me save my marriage!!",
            "Been playing since beta day 1 on pc.  Just played through the tutorial.  Evertything is polished as hell. One thing I thought is that there wasn’t going to be aim assist but it’s clearly there when you’re aiming at bots in the tutorial.  I thought the focus mode was a thing so that there wasn’t aim assist?? I haven’t played a match so maybe aim assist isn’t there?",
            "Got 5 Xbox codes. First 5 PMS gets them.",
            "Here here my code enjoy this is my first time playing valorant I hope I do good 😅\n\n https://beta.playvalorant.com/en-us/invite?code=9d85cc92-95f4-45bb-a14f-cba98eab519d",
            "[deleted]",
            "As promised on the posts that got hidden yesterday here are the codes (PS5):\n\n[https://beta.playvalorant.com/en-us/invite?code=771b3a18-fd70-4c69-afa7-4765a3fc0282](https://beta.playvalorant.com/en-us/invite?code=771b3a18-fd70-4c69-afa7-4765a3fc0282)\n\nThis link can be clicked on 5 times only, so act fast and follow the instructions after clicking the link.",
            "[deleted]",
            "Will have two extra codes if I get chosen. Who’s tryna return the favorrr",
            "If i get a code i have two to spare 😆 but if i don’t get them.. please think of me as well😅",
            "I can share my codes with you guys. If i dont get the codes, hopefully someone else will share with me 🙏🙏",
            "XBOX here, if I get accepted I will have 3 codes to give 🙌",
            "[deleted]",
            "No codes have yet been sent out keep checking your emails guys",
            "Super bummed I didn’t get codes :/ new dad who doesn’t have time for my pc room but has time for occasional console gaming in the my bedroom with the baby. Super curious about people’s feelings plying the console version! Someone here let me know how it (aim assist break the game????)",
            "Didn’t get a code. If someone wants to be really nice to slide me a code for ps5 on dms it would be much appreciated🙏🙏",
            "Doesn’t look like I got codes… does anyone have a spare code? PM me.\nI’ll give out all my codes if I get them later.",
            "SOMEBODY PLEASE SEND YA BOY A CODE ToT",
            "[deleted]",
            "anyone else seeing errors whenever accepting someone's referral link?",
            "Is the \"That was unexpected\" error when the code is used?",
            "\"That was unexpected\"",
            "They are rolling them out in groups, I'll attach one to this thread if I get one and if anyone does please let me know",
            "I just might be speculating but do you guys think there might be bots trying to scrape up renewals or am I really that slow because I refresh and it keeps saying that was unexpected",
            "These guys are feinin for it lmao (I am to dw)",
            "I wish they gave out individual codes to send and not a general link.  If you share the link with anyone they can just copy & paste and send to their friends.",
            "the most i’ve ever used reddit fr fr",
            "Selling left nut for a xbox UK code",
            "all my friends are on PC so I have 5 codes who wants one just PM me! They are free and if I dont respond I ran out I am on PS5",
            "If I get an invite I’ll be giving em out to the ppl who will do the same if they get one🙏",
            "Me and my girl both didnt get codes even tho we signed up on announcement if I could just get 1 for her cause shes a valorant die hard I would appreciate it we need 1 or if possible 2 xbox codes",
            "I got an invite with no referral code. If anyone can help I will give them an invite",
            "These fuckers that say they have the code don’t have shit",
            "Alright whoever wants a code, you can friend me on PS5 Watermxlonn (My profile picture is a watermelon) might as well make some friends to play with since all of mine are on PC.",
            "Sad... No one on my Xbox friends list has an invite. Are they still sending in batches or is it done?",
            "If anyone has an Xbox NA code lmk I'll pay",
            "[deleted]",
            "Ight guys, just summoned a demon, sold my soul, yall codes arriving soon. Enjoy, while I burn in the deepest pits of hell 🔥",
            "who needs codes dm me😘",
            "first 5 ppl to dm im sending code so its fair 🙏",
            "lol @ all the guys being like \"I have 2 extra links, dm\" then they respond \"$10\" when you do",
            "https://beta.playvalorant.com/en-us/invite?code=9b9cd6c3-3eb2-4e95-b601-27a61ea343f5\n\nbe quick my friends",
            "As promised to my fellow bros here's a beta invite link  https://beta.playvalorant.com/en-us/invite?code=72d4be4d-d23c-4247-bb46-53d19443e828",
            "I got Xbox codes DM me",
            "no one get fooled by the “i have xbox code” or “i have ps5 code” it comes with a link and you choose what code you want",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "I can still give away 4 codes. Just dm me and I’ll send you. Don’t need them",
            "Been playing all night, so far it’s been awesome",
            "If i get more codes i'll paste them into this but im still waiting for more.",
            "I have some extra codes if anyone needs",
            "DO NOT DO A SURRENDER VOTE, IT WILL BREAK YOUR GAME AND WONT ALLOW YOU TO BUY. Riot needs to fix this asap.",
            "this is such BS, shouldnt have hyped the beta up this much if they were only gonna send out 9 codes",
            "The ones that are selling the codes are the worst lmao, $5 for something that’ll be free? Foh",
            "LOL I just seen someone streaming on tiktok saying that a lot of PC Valorant streamers got into the beta! WHY IN THE WORLD do they need to play this beta!? That just makes it harder for the rest of us to get a chance at playing. You literally have access to the game why take up space. ",
            "But do we know when the codes drop?",
            "I’d appreciate a code if I don’t get one and would share if I do",
            "could give away up to 8 codes if me and my friend get accepted, otherwise any codes would be really appreciated if we shouldn‘t get in :)",
            "USA Central PS5, I’ll have 2 extra if I get in. Let me know if you wanna play.",
            "I don’t think my friends are interested in the game. So I guess I’ll share the codes.",
            "[deleted]",
            "Please anyone who can share it with me, I will share too once I have it",
            "I only have one person to play with, so will have codes spare if needed",
            "I will share a EU code if i get them.",
            "If anyone is lucky to get in can I get one of the codes I will try to return the favor if I get in as well.",
            "I would love if someone could share me a code. If I get chosen then I will be giving 2-3 out.",
            "If anyone has a key I'd love one I got ps5 and xbsx",
            "I got 3 codes ledt if im lucky so just reply if you need one\nEurope Prio ;)",
            "Since all of my Val friends don’t play on console, I would have all 5 of my PS5 codes to share on NA West if I get it.\n\nEdit: All of my friend codes are now reserved if I get myself a code. If some of the people that reserved the code get their own and I get my own, I’ll edit this again in a hour saying how many codes I got.",
            "I have 5 people if somebody doesn't have anyone to play with hit me with the link plz!",
            "Myself and my partner signed up so we should have ~8 codes to share if we're lucky!\n\nIf we aren't, then we'd appreciate the codes all the same from those of you that managed to get in.",
            "I’ll have 4 extra codes, a buddy of mine should have a couple spare as well! Lmk if you’re interested in trading if you get in :D",
            "Happy to help anyone who doesn't get a code. Hope fully I'll get one 🤞",
            "i got yall with a code if i get one",
            "I registered 8 emails so hopefully I get a code. Whoever wants to do a code share session so we can play reply this post.",
            "Anyone who can share a code with me, it’ll be greatly appreciated. If my buddy and I get accepted I’ll have up to 9 codes to give out. Help me, help you. 🖖",
            "I’ll have codes to share on NA PS5 4 of them if I get an email. If anyone wants to group up to increase our chances let me know !",
            "Hey my birthday is tomorrow and all I want is a code to play the beta I’ve beeen waiting on this game to come to console ever since I found out about it  but could never afford a pc on ps5 as well",
            "I still haven’t gotten a code. I’ve been wanting to play this game since release on pc too. Big sad :(",
            "I can share the remaining codes i have if I get in if I dont hopefully someone can send me some 😭",
            "A buddy and mine signed up, and we only need a code from each other. If we have extras, I will definitely share some here! Also, it would be great to get some if we don't. (NA - and xbox)",
            "i don’t play valorant with anyone and i’m going to be on PS5 so if i get a code i will give all of them out. but i started late so who knows. if someone else is down to give me one in exchange it would be appreciated",
            "Has anyone gotten a code yet?",
            "I can share 3 codes as well if I get one.",
            "I'll also be sharing a 3 codes if I get them. I only have 1 other friend I'd want to play console with so I'll post the rest down here if the get them!",
            "Never played Valo before and I'm excited to try it out on PS5. If you have a code to spare, I'd gladly accept it! (And if I get some, I'll gladly share too)",
            "[deleted]",
            "Anyone got me if I don’t get a code?",
            "If you got an extra code and want to share it with me I'm down to play with you on NA for PS5! I am very funny I promise",
            "Signed up with 4 emails if anyone is willing to share the sugar as well",
            "Anyone get any PS5 codes I didn't 😔",
            "If I get a code, I can share it with 4. :)",
            "gonna share my codes if I get one!!! would appreciate a code if I don't get in, though🫶🏻",
            "What time does beta codes release if I’m her in Texas??",
            "I have codes to give for free IF I GET IN pm me first come first serve",
            "Can someone hmu with a code, I forgot to register for the beta",
            "I can share at least 2 codes (if I get in), maybe more if other friends get in as well",
            "I have one friend who I’ll play with. Giving away the other 3 If I get in.",
            "Hey there folks, looking for a key if I can get it. Ill have 2 to share if I get one. Dont know if they've been sent out.",
            "Am I the only one who thinks cross progression shouldn't include ranked.",
            "Anyone willing to share? I have 3 accounts signed up. I’ll do the same for anyone here - EU Playstation",
            "1 more hour over here, central time! If I get codes I will share. I hope the same for others!",
            "I have a PS and my gf has an Xbox, if only one of us gets in will we still be able to share our codes with one another?",
            "i probably won’t get in so if anybody can cover me i’ll appreciate it. :)",
            "Good luck everyone, I will send my additional codes to whoever bc none do my friends play, hopefully somebody will do the same for me if they get it",
            "Can I get a code for Ps5 please?",
            "any good person who will shere ps5 code with me?",
            "Isn't playing on PC painful enough???",
            "No code recieved yet.. PS EU",
            "Has anyone actually gotten a code yet?\n\nEdit: if codes exist please lmk",
            "[deleted]",
            "Anyone got a spare Xbox code I would  really appreciate it",
            "Still no codes .... sadge if any spare maybe.... (on ps5)",
            "Any Xbox codes?",
            "Yo if I get a Xbox code I’ll drop links here and vice versa if anyone else gets Xbox codes please drop them here for people to use",
            "If you got a email with a code reply to this! So people know. Seems like no codes have been sent yet",
            "I will suck sum body if I get 4 codes👉🏿👈🏿",
            "[deleted]",
            "[deleted]",
            "Hope the closed beta is fun for those who get a code  everyone will just have to wait kind of annoying it's random emails picked for those lucky ones Have fun and use the odin in my name",
            "https://beta.playvalorant.com/en-us/invite?code=edcb1b28-fb8c-4e1a-92a2-d46317e48265",
            "I just got the code but I dont know how to invite people",
            "Can’t believe I actually got a code!! I hardly ever get into these. Hell yeah I can’t wait to finally be able to dig into Valorant. Just couldn’t get with MnK",
            "I got the code I got 4 spare keys PlayStation",
            "I got the link but I can’t log in, I think there is too much traffic rn",
            "XBOX: QQTJM-3V2HM-HF6T3-CKJF4-DQ93Z",
            "3 more codes, DM",
            "5 for PS5\n\nhttps://beta.playvalorant.com/en-us/invite?code=d6c2d720-f4cc-4800-a0d7-08373883d3e9",
            "[deleted]",
            "I have the invitation, will share with you after i got my bros in… 2 left for you guys.. PS EU user",
            "anyone else getting a error when going to the website?",
            "If I get accepted I’ll share all my codes on here if someone would be willing to do the same if I don’t get accepted",
            "Hey If I will get a code, i can give away the others. Just comment so I can know who needs one.\n\nWould also appreciate if someone has a spare code for me if I am unlucky.",
            "I have five referral codes for anyone who needs one! Just pm me\n\nEdit: no more codes :(",
            "I don't think I linked my RIOT accoutn to my xbox login so may have screwed myself on the invite. Re went in and did the register but I assume its too late :(",
            "[deleted]",
            "I got my code & I'm excited to finally be able to play this game :)\n\nIt gives a link that can be used for up to 5 other people to be able to play. I'll share the link to the first 5 people who comment reply \"Valorant\". Sorry to those who aren't able to play, & I hope you can get a code soon. Happy gaming, everyone 🎮",
            "PS5 NA Codes 5 Left shoot DM",
            "ZEUS GIVE ME A CODE AND MY LIFE SHALL BE YOURS ( made by the no code gang )",
            "How do I get the referral link after I used my code ?",
            "My eyes are melting but I need to get the code",
            "Anybody need a code??",
            "Refreshing for a Hour only to get recked at Game",
            "I know everyone and there mom is asking but if someone could be as kind as to hook me up and maybe even pick me up if I'm decent enough 😭🙏 I'll send out my codes when I get mine",
            "i need a xbox code plssssss",
            "Need a Xbox eu code please pm me and make my 18th birthday the best!🫶🏼",
            "I have two left PM",
            "I  am a Ultra Super Beggar (Short for USB). Can I get a PS5 EUNE code?",
            "How are people so quick wtf",
            "I have 0 friends and will happily give out codes to anyone who helps me figure out how the heck I get my invite to work😭😭😭",
            "Are Eu codes out yet?",
            "If anyone has a spare code, i would love to try out the game (Playstation)",
            "across the entire gaming group no one has gotten xbox codes. we must be unlucky",
            "[removed]",
            "Nice I just got invited",
            "Anyone have extra code for Playstation?😭😭😭😭",
            "Anyone know if codes have been given out or still getting given out?",
            "Aight got a code to give away drop a reply and i will select someone to give too <3 ( i all out now cuh)",
            "I have codes for US Xbox just dm\n\nedit: all gone",
            "just got the email lowkey so lucky",
            "are the codes limited or coming out to everyone in batches ???",
            "I got in here the link for codes. I gave one to my brother, so it should be however many is left. Have fun everyone. https://beta.playvalorant.com/en-us/invite?code=e52b1de3-583c-4286-8e29-d520901dc8a6",
            "Can I please get a Xbox code I NEED IT",
            "Are the links broken? I got a referral, but I keep getting an unexpected error",
            "Alright soldiers, I'm giving up. Wish u all the best of luck",
            "Are they sending them out in waves or something???",
            "I ended up not getting a code but I’m watching some stream and I got to say it looks pretty fun",
            "Even on console I still suck. Just went 0 kills and 7 deaths in a swiftplay:(",
            "if i get some codes ill send them your way :D",
            "Have they finished sending invites?",
            "I got the invitation and played already, but haven’t received the referral link. Anybody know when those are supposed to come in?",
            "[deleted]",
            "I have five extra codes I can give away. The first 5 replies will get the link to get the code.",
            "[deleted]",
            "[deleted]",
            "I beg no one sends me an xbox code!,\nCouldn’t think of anything worse to happen!",
            "I will go against my morals for a ps5 code",
            "Does anyone got ps5 codes😭",
            "[deleted]",
            "Absolutely loving this game so far, scratches that csgo itch that's I've had for years since not owning a pc. Only thing is I can't find the perfect sensitivity, has anyone else found a good setup for their sense yet?",
            "I'll give an extra 3 inches to whoever so graciously sends me a code",
            "How does push to talk work in game? It doesnt seem to do anything currently, or at the very least the settings are hard to find.   \nIdeally i'd like to set party chat to open mic and have a push to talk for team chat (like probably one of the D Pad buttons) but I can't figure out how to make that work.",
            "If anyone can give a ps5 code ill double it and give it to the next person when I get mine",
            "ALL GONE. SORRY I COULDN'T GIVE THEM TO EVERYONE. GOOD LUCK EVERYONE. Have a referral link. I'm on PS5. I don't know if you have to be PS5 or can choose from the link.",
            "Anybody have a spare code? No luck so far",
            "this is so damn deperesssing",
            "When does valorant fully release",
            "Xbox NA code PLEASE good people!",
            "how do we share codes to friends?",
            "Ill do unspeakable things for a ps5 NA code",
            "I was invited but still no code, big sad",
            "[removed]",
            "I have two PS codes from my friend if somebody can trade an Xbox code for it",
            "[deleted]",
            "I received an email that said I was chosen for the beta but I go through the steps and it’s telling me to register? I don’t see any steps to get a code. The emails says “You’ve been invited to play the VALORANT Console Limited Beta.”",
            "Has anyone gotten an error when accepting a friend code? My cousin can’t seem to get his working.",
            "I've been refreshing for two hours. Kill me.",
            "Guess it's time to give up hope...",
            "I can't share a code, when ever multiple friends try it comes up with a error.",
            "[https://beta.playvalorant.com/en-us/invite?code=d2ae3ca6-693a-412d-a82b-44386cf56046](https://beta.playvalorant.com/en-us/invite?code=d2ae3ca6-693a-412d-a82b-44386cf56046) USA PS5",
            "We all spamming refresh like a bunch of fiends lmao",
            "If you redeem a code someone gives you can you still get your 5 codes?",
            "could i get an xbox code please",
            "My dad works at riot, he said he will send all of u codes 🙏🙏🙏",
            "Trading an xbox one for a playstation one",
            "Guys i Think the Codes are the Friends we made Along the way",
            "I doubt anyone still has an extra, but could I get a code, please, because God I been wanting to play for so long.",
            "lGBTQ-GEYFE-GSBLM-LGBTQ-DAGIT",
            "https://beta.playvalorant.com/en-us/invite?code=a6cb0944-8d8e-4724-b00d-5c247c8672fa      Here is my Xbox code",
            "Damn everyone is fast with those links😭 give me a chance damnn🥲",
            "Anyone have a code for ps5?",
            "I got one, I’ll give the code to whoever says, yes king",
            "First five people to send me the number in thinking of get the link. 1-20\n\nEdit: four claimed, one left\n\nEdit edit: games over. Number was 7. Had fun playing!",
            "Have a link for some of you peeps have fun for me, gotta wait till Sunday to play..\n\n Code: https://beta.playvalorant.com/en-us/invite?code=c20875e5-4c2d-4aee-8e94-3a5518b3017c",
            "Ain't nobody trying to hit a lick for this PS5 code bruh, I'm a lonely 20 year old gamer guy.......*sighs* been single for years..... gets really cold at night without any cuddles maybe I'll just cuddle with this PS5 code unless someone comes by to replace it",
            "i have codes for xbox and ps 🫡",
            "Bro I just want to get in 😭",
            "I need an Xbox code and I’ll have at least 2 to give away if I get some so I’ll be back",
            "Good luck, https://beta.playvalorant.com/en-us/invite?code=8fc8307e-e98c-4fe9-ae6a-f9ed187e4957",
            "I have PS5 friend codes if someone wants? Should i just share it here or DM? Just let me know i dont have anyone to play with.\n\nEdit: guys there are lots of replies within a minute so apologies but im only gonna add the link here so i don't have to choose.\n\nEdit 2:\n[Link to Code]( https://beta.playvalorant.com/en-us/invite?code=7d1d2d59-24ad-4aa9-b278-13c46c216e69)\n\nEdit 3: whoever got the link to work plz let me know and if i can add you on PSN so at least i have someone to play with thanks",
            "your final challenge, let yo bih go through yo phone!!!",
            "Was given a code, they didn’t want money so donated to charity. If I get some codes, I’m giving right back to y’all 🙏🏽🤝🏽",
            "Search this on twitter under latest.\n\nGot it my first try\n\n[beta.playvalorant.com](http://beta.playvalorant.com)",
            "[removed]",
            "[deleted]",
            "hi everyone! friendly girl here looking for an xbox code, let’s play together!",
            "[deleted]",
            "https://beta.playvalorant.com/en-us/invite?code=2827e065-26c5-4cf2-9eae-b65a7bfb75e3\n\nGood luck have fun",
            "I got a code but none of my friends play on my console so have 5 codes to share! Reply below and I'll select the 5 at random.",
            "I have 5 codes to give out! Who needs them?",
            "Does anyone know if they are still rolling out at the moment? Seems like people are still giving out links but idk if it’s from older emails this afternoon or from now.",
            "Got in lmk if you want a code first come first served\n\nEdit: no longer have any",
            "Is anyone else’s saying this Facebook login not detected even though they didn’t use Facebook????",
            "I would suck a golf ball through a garden hose for a code rn",
            "I know yal greedy ahh got codes",
            "[deleted]",
            "[removed]",
            "How do I share the link",
            "Is it because I’m ugly? Was it that time I shit in a urinal? Was I not funny enough, riot? What did I do to deserve this? Was it because I rear ended that guy at a yield sign one time? What have I done that they have not?",
            "okay i got the link dm me and i’ll send it!!",
            "i have my code how do i post the link? is the “visit beta hub” the link?",
            "i got the link to work finally dm and i’ll send the link",
            "DMs are open for codes",
            "Hey Valorant team please include text chat in game!",
            "Feel like a beggar the way I’ve been refreshing and asking but think imma call it a night good luck to yall tho 🤙",
            "Here u guys go good luck \n\n\nhttps://beta.playvalorant.com/en-us/invite?code=e94838e9-8308-4bec-acf0-0de33abd8d9e",
            "[removed]",
            "I love how most of the comments are people asking for codes\n\nBut i get it\n\nBecause i want to play too and i still haven’t gotten access to the beta",
            "Someonw pls get me in",
            "[deleted]",
            "[deleted]",
            "Does anyone have a code left? 😩",
            "I give up it’s impossible :(",
            "English or Spanish ? Whoever dont share code is gay",
            "Fellas, my wife won the code in the divorce and I got the kids, can someone give me a code instead?",
            "I have a code left if anyone need just dm",
            "Give me head and I’ll give you a code",
            "Ps5 code should have 3 slots left \nhttps://beta.playvalorant.com/en-us/invite?code=0060330c-04d9-4222-8a60-a5c36ab619cc",
            "anyone got a ps5 code for EU? 🥹 since my pc died a while ago, i really want to play valorant 🥹",
            "[deleted]",
            "Anyone know when the game fully releases? I'm a console only player and want to get into it but I don't want to get hyperfocused only to then have to wait for the full release.",
            "Anyone hook me up with a Xbox EU code s",
            "Anyone got a spare Xbox code?😭",
            "Someone has a Beta key Left ? Pls send 🥺",
            "I have 5 PS5 NA codes, dm me",
            " I'm not a time waster, first 5 people will recieve access to the console beta as it's my referral link. Please enjoy. https://beta.playvalorant.com/en-us/invite?code=28a26fdd-14d8-4aac-b9c0-f44450306787",
            "I’ve got two codes left: https://beta.playvalorant.com/en-us/invite?code=64020b51-8c41-4328-b91a-5c0630a39835",
            "[https://beta.playvalorant.com/en-us/invite?code=2f661957-5a9d-4d8a-b7e2-9b27cbbccf7d](https://beta.playvalorant.com/en-us/invite?code=2f661957-5a9d-4d8a-b7e2-9b27cbbccf7d)",
            "Just got a set of codes but already received it from a kind friend here",
            "Ive got 5, first people to PM get them\n\nEDIT - All gone",
            "To everyone on here tryna get codes try the official Val discord you might have better luck, but most of the codes are probably gone by now since it was such a rush to find them earlier, they still out there though so hit the discord",
            "Anybody knows how to get my referral link? If you can help me, I can give you a code!",
            "got eu ps5 codes to share, dm",
            "[deleted]",
            "The battlepass only has 9 days left will it carry on if i purchase now or should i wait until the next one?",
            "Hey if anyone has any Xbox codes left im only looking for one please dm me 🙏💜 will be giving codes out if I get a email from riot",
            "https://beta.playvalorant.com/en-us/invite?code=e94838e9-8308-4bec-acf0-0de33abd8d9e \n\nHere's one if u need it good luck",
            "https://beta.playvalorant.com/en-gb/",
            "If anybody is willing to part with an EU PS5 invite and help a guy out in the process, dm me please. After 8 hours I am just sick and tired of how many people will try to fake goodwill and sell invites like it’s the second coming of Christ. Thank you in advance!",
            "To all the scumbags contacting me via DM trying to sell me a code - go to hell. I'm not paying for a code to play a beta. Nobody is there desperate as to pay money for access to a game I'll eventually get to play free. So kindly stop.",
            "Anyone got a ps5 code? THANK YOU IN ADVANCE",
            "I got in. Can’t find codes for others. If yall tell me where those can be gotten, I’ll share em.",
            "looking for a ps5 codes alot of people scamming on twitter id appreciate some help i will come back to this thread once i get my codes !!",
            "i got it !!!",
            "idk if this works but here u go\n\n[https://beta.playvalorant.com/en-us/invite?code=565e8786-0bc4-4728-9d6e-2b37ad3ea74a](https://beta.playvalorant.com/en-us/invite?code=565e8786-0bc4-4728-9d6e-2b37ad3ea74a)",
            "If someone sends me a Ps5 or Xbox NA code you get one free picture of my cat",
            "Who wants a code?",
            "My thumb is hurting from refreshing so much. Some kind soul please ease me of this pain",
            "If you have a decent reddit history hmu for a code. 4 left. Be quick. I don't want to end up giving it to a reseller.",
            "Here's my invite link.  Godspeed \n\n\nhttps://beta.playvalorant.com/en-us/invite?code=d43c4e32-7721-450f-a5fe-7749dfabf9c0",
            "I was blessed by someone here with an invite so I’ll post my link at 45 so it’s fair",
            "Looking for a code for PSN. Please send me one if you have a link. Thanks in advance!!",
            "Got 4 codes hmu",
            "Have 4 UK/EU for PS5, DM for link, first come first serve\n\nEdit: gone sry",
            "Since I got a free code on this thread , if I get the email I’ll give them out to yall on here",
            "I just got mine, DM me if you want one",
            "I have some beta codes, would prefer people I can play on PS5 with. Just shoot me a DM.\nEDIT: All codes shared.",
            "I have 2 beta codes left. I'll dm the link to first 2 replies. Will check back at 4pm est as I have notifications off.",
            "I have 2 invites left. Download The Finals and dm me.",
            "still waiting for my email 💔 if i end up getting accepted ill share the other 4 codes!!",
            "my dog finished college. please share a code",
            "Dm me if you would like a code",
            "Heads up. Playing on PS5 via 2k monitor with 120hrz refresh. Valorent will go black when firing with the 120 hrz setting on within the PS5 settings. Once disabled everything works fine.",
            "would anyone mind letting me use a ps5 code? it would be greatly appreciated!! <3",
            "I have spare codes if anyone wants. PS and Europe if that even matters.",
            "Yo! I have five codes to give away if anyone wants it!\n\nEdit: out of codes!",
            "I have no friends to share a code. Will share one as soon as I get one. Love this community.",
            "Anyone have a spare European Psn code I would greatly appreciate it.",
            "[deleted]",
            "Anyone got a spare European Psn code, would greatly appreciate it",
            "Really dislike they just used one link for all 5 referrals, someone shared mine and now i can't share anymore. :/ I did not give it out to 5 people.",
            "Lads I got 5 codes for ps5 of my link message me if interested",
            "I have 3 codes, dm me if you guys need one",
            "dm me you have any codes for Ps5 I’ll love you forever",
            "I NEED A US PSN CODE PLEASE DM 🙏🙏🙏",
            "Can I please have a code for Xbox America",
            "Can I get a code for Xbox?",
            "Can I get a dm for a Xbox code North America? I wanna play but I’ve never got a email.",
            "Yo guys i got accepted if u want codes just say not a scam it coat 20£ jk na for free i really wnated them and i just want to give some ojt i got 4",
            "Where do is see my beta codes on the Website after receiving an email",
            "Just got home and recieved the invite on 2 emails. So I have 10 codes, dm me if u want one\nEdit: wow you are fast guys all codes gone jn 2 mins",
            "DM for code only 3 left",
            "Oops, checked my email a day late... and I'm IN! I have no one to play with so first 4 to ask can have a code :)\n\nedit: that's a wrap all taken, ill message yall when I'm off work :)",
            "Hey guys, I have 4 codes left for europe...pm me..the fastest one, will get one...",
            "Did anyone get accepted today like I did?",
            "Code for Europe, PlayStation: https://beta.playvalorant.com/de-de/invite?code=2ae87735-d69a-4b47-a989-9fa21cf8bf66\nGLHF <3",
            "There are a lot of scammers here dont accept anyone who tells you i will charge you for a code, just wait and at the end you will lickly get one like i did\nYou just need to be fast \nGOOD LUCK FOR UALL",
            "[deleted]",
            "Does anybody still need ps5 codes I've got 6 if anyone wants them",
            "2 mins I'll post a psn code get ready to type it in",
            "PSA for everyone!! The referral links are not console specific! If someone shares a link on here, you can use it for either xbox or ps5. No need to look or ask for a specific link!!! Happy Gaming everyone",
            "https://beta.playvalorant.com/it-it/invite?code=ee36bd46-c8e6-44f3-8e22-050b4a31da1d\n\n\nEUW",
            "Got 3 extra codes, pm me for link",
            "Anybody want a code. Send me a dm I have 2 extra.",
            "I've got 5 available on PS.\n\nEdit - Went within seconds.",
            "Where do I find my referral link? I’ve checked everywhere! I’ll send a code to whoever shows me where to find it!",
            "I got codes anyone wants?",
            "Anyone have an extra code? Xbox",
            "PS Key NA: H25J-69G4-KEJ4",
            "I have 6 codes available ",
            "Just got accepted, got 4 invites for anyone who wants (XBOX) here:\nhttps://beta.playvalorant.com/en-us/beta-hub-complete/",
            "https://beta.playvalorant.com/en-us/invite?code=c79fdfb9-d23f-4432-9470-d09e89c98b60",
            "got invited and have no friends that would play val on console \ndm if you want a link :)\n\nedit: got no more codes",
            "I got accepted to the game and I have 5 invites from the link. The first five people to respond to the post I will dm you the link. If you say it doesnt work I cant help you because this will be the first time sharing the link.",
            "Good luck!  \n\n\nhttps://beta.playvalorant.com/en-us/invite?code=33989296-28d7-4cc1-9b5c-09451314f376",
            "I got accepted into the beta, I have 4 extra ps codes anyone want them?",
            "does anyone need beta codes. I have 5 to give away.",
            "After 25 games, I just can’t do it man. I can’t find controls that feel fluid at all. Feels exactly like the Xbox 360 version of CS:GO. I wanted to like it so badly. Love this game on pc. Feel more comfortable with a controller than a mouse in 99% of games, but man, this shit just does not compute. \n\nNot for everyone I suppose, really stoked people seem to be having so much fun though. ",
            "Should be 4 invites left with this code for PS.\n\n8PQ5-65KC-R9BH",
            "I’m gonna post the link here, I want chaos for it",
            "[https://beta.playvalorant.com/en-us/invite?code=8ab346f7-0c0b-4cc5-a802-1f8ad3d8fb67](https://beta.playvalorant.com/en-us/invite?code=8ab346f7-0c0b-4cc5-a802-1f8ad3d8fb67)\n\nFirst 5 get in!",
            "Does anyone have a code for me?",
            "[deleted]",
            "Still have 2 keys left just dm 🤙🏼",
            "[deleted]",
            "https://beta.playvalorant.com/pt-br/invite?code=949ed465-365a-4668-b0e1-7422dc3583ae\n5 links ps europe/oceania",
            "So I got invited to the beta not gone lie I'm enjoying it so far even though I'm garbage m getting the hang of it but I got 4 codes left cause I invited one of my friends but Don want them to go to waste so I'm willing to share for people really wanting to play 😁 I play on Xbox by the way\n  \nEdit I only got 2 left only inviting people that had they account for a while don't want to send to just anyone also add me on xbox SOULxSAVAGEx",
            "If anyone gets an extra ps5 code, I would love one. idk if riot is giving out new codes, but if iget one ill post the 5 extras here for US PS5!",
            "first 4 to DM me get a code (edit: no more codes now)",
            "Yo can I get a code so O can join my friends",
            "Free kisses for the first code to him my DMs are open",
            "Someone please hook me up with a ps5 code",
            "Please PM me a PS5 code and I will send you the bhole selfie I have been saving for Shakira if I ever meet her. It’s that good.",
            "Is anyone willing to send a code to me please?",
            "IF ANYONE HAS AN EXTRA CODE PLS DM ME, I WILL TREASURE THAT FOREVER . I WANNA PLAY SO BAD😭😭",
            "Can someone send code?",
            "If anyone needs i have 6 more codes and one of them is ps.\nEdit: and its free\n3 left",
            "Hey guys. I have 3 codes left. It's first come first serve.\nThe codes are region locked my codes are NA and SA only. Good luck\n\nhttps://beta.playvalorant.com/en-us/invite?\ncode=2c36138e-fe6f-421b-b751-08bfae891223",
            "https://beta.playvalorant.com/en-us/invite?code=0bbad1d2-cbb7-457f-a486-d6076e6a303b\n\nCodes for anyone that needs em 🙂",
            "I’ll need a code to please I’ve been waiting for this game! :(",
            "https://beta.playvalorant.com/en-us/invite?code=85a471ce-63f8-4174-ba4f-fe26f5aff13a",
            "Hey who wants my code? I can inv 4 more people\n\nReply if you want it  \n\nJust know you need a next gen system",
            "Got some code to share!\nFirst 4 people to dm me to make it fair :)",
            "Can someone give me a codeeee",
            "We still don't know if Riot will add more regions to the beta? I really want to play and I'm in Middle East",
            "I got into the beta. I have a link that it says to share with up to five friends, not sure if that is how you get codes. None of my buddies are interested, so if you want the link, send me a DM. First five can have it. I will edit when I have five.\n\n  \nEdit: Sent it to the first five who messaged.",
            "[deleted]",
            "Anyone has a free code for ps5",
            "[deleted]",
            "Looking for code for Ps5",
            "Count me in!",
            "Sounds good",
            "Pla",
            "I’m in",
            "yes pls",
            "EU pls",
            "It would be good",
            "count me in too!",
            "For sure!",
            "COUNT ME INNNNNNN",
            "i do!",
            "I got a ps5 code for EU\n\nhttps://beta.playvalorant.com/en-gb/invite?code=a24f524f-07f5-4f44-a0ca-0e9d757776c2",
            "https://beta.playvalorant.com/en-gb/invite?code=a3a5c018-df4a-4982-88d9-6ab4faeade24",
            "hero",
            "Appreciate it😭",
            "I bet that'll be tough!",
            "Welcome to the club 🥲",
            "Constantly refreshing lol",
            "That isn't imagination, that's reality",
            "Exactly what I’m doing",
            "if you still got one left, I would be glad if you dm it to me",
            "Your a real one 👊",
            "Im on Xbox so if you have any extras available that would be great",
            "I got you if i get one and you don’t aswell. Nobody to play with lol\nEdit: I didn’t get a code :/",
            "Me too my dude",
            "Man I’ll pay u to slide a code I’m bored asf of overwatch😭",
            "Hey same!",
            "Been playing val on pc for a couple years hope I get one",
            "Right back at you",
            "Sounds good. If i get the codes I’ll also share them",
            "We can share codes if one of us doesn’t get one",
            "Sure thing! I’ll do this!",
            "Sameeee well help each other 🤠",
            "Hi there, we are from the same reason lmk if you don't get a code and I will hopefully be able to share my link :)",
            "I think it’s 9pm I just read it on their website :)",
            "same , its been a miserable hour lol",
            "Same here I think I'm giving up",
            "I’m down",
            "Me too, man.",
            "No you must continue",
            "i salute you soldier",
            "i’ll take one pls if you get it",
            "Facts",
            "I know and it’s heartbreaking thinking I got lucky",
            "Some people suck",
            "Ill do the same brother we can share",
            "Should just gimme your code bro",
            "Wait until the next one",
            "Reminds me of college admissions lmao",
            "same guys, if i'm in yall top of my list lol",
            "Same. Counting down the minutes to the hour",
            "same, let's help each other 😃",
            "What time zone is that?",
            "Sounds good",
            "Count me in brother",
            "Me too. I have a series s so it would be nice to play some val when I’m not home",
            "Sorry, that’s U.K. Time so 1PM pacific",
            "I’ll give mine to you if I get one and you don’t. Does region and console matter?",
            "Coolio I’m in the uk as well so good to know, otherwise I’ll just spend the whole day refreshing haha"
        ]
    },
    "Welcome back, Iso (Art by me @NikkiKaji)": {
        "title": "Welcome back, Iso (Art by me @NikkiKaji)",
        "score": 809,
        "url": "https://i.redd.it/32d98csgf08d1.png",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Don't worry people, many are wondering where Chamber's participation is.\n\nHe's under the wheels of the car, run over. Now Viper is reversing to finish the job 💀",
            "WELCOME TO ELO HELL, MUTHAFUCKA!",
            "His 2-week prime will be remembered",
            "draw jett and chamber in the backseat looool",
            "Hmm, still oppressive,  but much more manageable. He's getting the Jett Dash treatment, and I don't think it's enough to push him back into obscurity, but enough to stop him from dominating.",
            "This is really good(artwork)",
            "Technically he’s **ISO**lated in the car with Viper\n\n^(im sorry)",
            "he's still really good though?????",
            "as someone who is out of the loop, what did they do to viper?",
            "I love your artstyle man,",
            "Lmao vi seems happy",
            "I miss playing viper",
            "I honestly thought just removing the initial shield on double-tap would be enough of a nerf, will be interesting to see how this plays out instead.",
            "Are these changes real 😭",
            "I love it 🥲",
            "Why does everyone hate iso?",
            "I don't understand this nerf. He even hasn't showed up in pro-play yet",
            "Viper finishing the job for chamber? That’s heaven for him",
            "I'm so glad someone got the reference lmao",
            "i think he will still be very decent and in meta even after this nerf",
            "He's still gonna be broken",
            "Chamber belongs in the trunk, and honestly never let him out. Not a real sentinel",
            "Technically that's literally why he's named Iso",
            "i forgot how long ago it was(maybe a bit over a month ago?), but they increased her fuel usage, gave her one molly, and made it so that you can't pick up her toxic orb.",
            "- Fuel now lasts only 11 seconds.\n\n- 1 molly.\n\n- Can't pick her orb up anymore.",
            "There are still plenty of viper maps in the rotation.",
            "I dislike the concept of a free damage negating ability in a very low TTK game. In the right hands it throws any first-shot accuracy skill advantage the opponent has out the window and obliterates snipers. It maybe isn’t game-breaking, but it feels unfair and frustrating to play against. \n\nHe can be played around, but the duration of the shield was too generous.",
            "Peak Chamber, and Reyna (throughout her ups and downs) were annoying because they helped someone who is better than you to dominate you.\n\nIso is infuriating because he helps someone on your level, or even worse, beat you regularly. Iso is so powerful he's not even a smurf agent at this point - he's just a walking boost.",
            "So?\n\nBeing op in ranked is a problem too.",
            "The OP iso patch drops today for pro play so teams can start picking the new iso from today. There is a 2 week delay between pro play patches and ranked patches.",
            "\"I just really love *zhose* women *zat* run over me at high speed *Isu*, *zhey* tempt me!\"\n\n* Chamber (I guess lol)",
            "Yea this nerf really feels.like it doesn't do anything am I wrong? Like he still gets the shield and still gets the resets on the shield....",
            "Half his kit is just More Gun, just slapping a single trip in there doesn't make him a real sentinel 🤬🤬🤬🤬🤬",
            "Not isometric?",
            "Yeah but I can't one-trick her now😔",
            "Sorry I'm kinda new to this game. I'm currently on Gold 3 I still see many pick Reyna or Jett",
            "He can still snowball at the start of the round, but now you wont see him with shields late into the round anymore",
            "The duration of his shield is significantly reduced with no chance to get it back when it runs out it seems",
            "Yeah but he won’t have those moments we’ve all seen already\n\nIso has shield, gets shot, puts on a new shield, gets shot, gets the kill",
            "I'm still in shock they didn't keep the two kill reset and remove the orb resets.\n\n\nOrb resets make breaking his shield feel unrewarding as if his team sets him up or you just lose the ensuing 50/50 he still gets his shield back.\n\n\nIf it was two kill reset using Util/taking a fight to break his shield and get some chip would at least feel somewhat rewarding.",
            "> still gets the resets on the shield....\n\n'removing the two kill reset on Double Tap'",
            "Really? I’m in gold and I’ve been seeing a huge uptick in Iso",
            "They are talking about the orbs after kills",
            "Yeah haven't played a match without Iso since the buff in g3"
        ]
    },
    "Yoru and Iso cosplay by me and my bf 💜": {
        "title": "Yoru and Iso cosplay by me and my bf 💜",
        "score": 27,
        "url": "https://i.redd.it/frqz64gu148d1.jpeg",
        "content": "I wanted to share me and my boyfriends Yoru and Iso cosplay with you! This is definitely one of my favourite valorant cosplays I have done to date 💙 \n\nYoru: https://www.instagram.com/brookiku?igsh=czB5bmVnZmdweXpl&utm_source=qr\n\nIso: https://www.instagram.com/ethn_dzn?igsh=MWJ2ZWF4M3EybmV5NA==\n\nphotographer: https://www.instagram.com/gepard79?igsh=MWQ3eDMzM3Q4YmdlcA== ",
        "num_comments": 1,
        "comments": [
            "that's sick"
        ]
    },
    "Flaming in Unrated is Cringe": {
        "title": "Flaming in Unrated is Cringe",
        "score": 116,
        "url": "https://www.reddit.com/r/VALORANT/comments/1dlmbib/flaming_in_unrated_is_cringe/",
        "content": "Pearl is back in the unrated pool and I played my first ever game on Pearl. When I started playing Pearl and haven were out of the pool.\n\nBefore the game even started I said over voice \"hey guys I haven't played this map yet bare with me\"\n\nThe Rayna on the team bailed in the first round so it was a 4v5 all game. We started on attack and we were even all the way up to the switch. At these point our Sova had 30+ kills and the Jett had 13 kills and I had 9 but I didn't get anymore because I somehow defended the wrong site everytime and because I still don't know the map well my rotation was slow\n\nNow the Jett decided they want to start talking shit. \n\nIn ranked I understand you grind all day and now someone is playing bad and it's going to lower your rank but unrated are you so unstable that you can't have fun when you are losing a no stakes game where people are clearly trying to learn.\n\nAlso I am pretty sure my Sova was cheating I'm not sure how but he always pinged exactly where the enemy was every round. A couple times and I can call it good game sense but evertime was a bit suspicious.\n\nSorry to rant but I just find it crazy that my unrated matches have been more toxic than my ranked matches. Anyone else experience this?",
        "num_comments": 30,
        "comments": [
            "Happened to me in swiftplay today, just mute them, there's no escaping it.",
            "unrated and swiftplay, im usually just playing to chill or knock out challenges, so i usually mute everyone off the rip. in ranked i'll keep it unmuted unless there is some weirdness or toxic shit happening.",
            "Flaming in anything is cringe.",
            "a lot of people never touch ranked so unrated is their ranked.  and they treat it like vct finals or some shit.  just mute them and move on.",
            "Just play Swiftplay. Any toxicity can only last 9 rounds at most, and you get to cycle through and familiarise yourself with more maps.",
            "It's so painful being a brand new player and having to get to level 20 through unrated before being able to play ranked. I understand why, but damn.",
            "I am coming back into FPS after 20 years not seriously playing. I was good when Action Quake 2 and Half Life DM where the things to play.\n\nThe ratio I get when I am playing poorly is about 1:4 of advice or help versus toxic assholes asking if I'm a girl or telling me to stop playing\n\nWe knew maybe half the people who played regularly in person, back in the day. One server based out of Christchurch, so that probably helped. Now if they aren't in your party, everyone is a stranger so that doesn't help. But I dunno if I want my kids playing this game because of the attitudes and language they will get exposed to. I can't police them to keep comms off all the time.\n\nEveryone started somewhere",
            "If you flame in any mode other than Competitive, that says a lot about your character",
            "Just yesterday somebody was so tilted in spike rush that they left the game. Its sad, what some people in the community have come to",
            "I don't ever get the point to call out that u are new or don't know something, feel like for the ppl that flame it opens up the floodgates and besides if we are spectating we can tell but yes getting tilted in anything than comp is stupid",
            "Bro someone decided to tell me I was shit while trying console Val. Then their entire party piled on. Just mute and go about your game. ",
            "I don't agree with flaming but idk why people think it not being ranked absolves everything and you're not allowed to be frustrated.\n\n\nWhen my entire team is flanking instead of just safe rotating and dying every round yeah I'm gonna be like \"guys can you stop flanking it's not working\" and without fail out comes the \" it's just swift bro\".\n\n\nFrustration doesn't just come from bad play/aim it more often comes from bad play that is impacting your teammates if their game quality is going down because you're doing dumb crap it's gonna be frustrating.\n\n\n\nTo give an example the other day 2v1 situation and I'm Sova with 80 HP and a full HP Reyna we know where the enemy Jett who has no Util is.  \n\n\nI set up a double swing where I'm going wide Reyna peeks closer we do it and Reyna takes one shot and unpeeks meaning I got completely fucked because this guy is incapable of playing as a teammate and double peeking of Jett wins the 1v1.  This is the tilting stuff I wouldn't mind if he just whiffed his shots on the double peek but being such an awful teammate as to do this or when duelists will hang in the back bait their teammates and then get a couple kills on enemies rushing because they get greedy and die then flaming is so annoying no matter the queue.",
            "[deleted]",
            "This thread is cringe.",
            "That's a good point. Communication isn't that important in unrated, especially if it's not constructive.",
            "In Swiftplay? Lmaooo that guy probably doesn’t have a life bro",
            "ESPECIALLY in swift play haha, most toxic game mode IMO",
            "Flamers gon’ flame",
            "Right lol like we ain’t getting paid to be here it’s a video game",
            "Yeah even in ranked it’s weird tbh. I know everyone is competitive and such but I’ve never understood just randomly flaming someone for I t",
            "Swiftplay is such a bliss for someone who has limited time for gaming now.",
            "That's a good point",
            "Depends the age of your kids I’m thinking tbh. If they’re hella young children like 7 or 8 then def don’t let them play. If they’re like 15+ tho they should be fine bcuz they’ll hear that shit at school anyways",
            "Why even flame in competitive. It’s not like it actually helps the player improve. Whenever I’ve been flamed, ive never improved. If they’re encouraging me however, I play better usually",
            "100%, \"hey guys I haven't played this map yet bare with me\" is an invitation to trolls.  its like walking into a restaurant n saying to the host \"hi ive never been here n idk whats on the menu\" its like, ok, wait till you get to your seat n talk to the waiter aka just play the game its nbd",
            "Even in comp, no comms is better than bad comms. If a teammate is yelling over the sounds of enemy footsteps, they deserve to be muted.",
            "Huhhhh",
            "What"
        ]
    }
}