{
    "NY Canvassing Event w/ Progressive Victory - General Call for Volunteers!": {
        "title": "NY Canvassing Event w/ Progressive Victory - General Call for Volunteers!",
        "score": 58,
        "url": "https://www.reddit.com/r/VaushV/comments/1car61y/ny_canvassing_event_w_progressive_victory_general/",
        "content": "*Update from this previous* [*post*](https://www.reddit.com/r/VaushV/s/JjhCbyDYdF)*!*\n\n**As you may have heard, Vaush will be in New York for Progressive Victory’s weekend canvassing event for Congressman Jamaal Bowman!**\n\nJoin Vaush and PV on **June 22nd-23rd** for an electrifying canvassing campaign as we secure Rep. Bowman’s victory in the upcoming primary in New York’s 16th district.\n\nWe have to ensure progressives stay in Congress!\n\n**This is more than knocking on doors; it’s a weekend packed with political activism and community engagement, filled with joy, optimism, and fun!**\n\n**\\*** You’ll connect with members of this community committed to change!\n\n**\\*** You’ll participate in volunteer work and community activities that make a real difference.\n\n**\\*** You’ll star in a short documentary film!\n\n**\\*** You’ll meet your favorite streamer!\n\n**\\*** You’ll celebrate at night with the PV community to recognize and honor everyone’s hard work!\n\n**Show your interest by signing up** [**here**](https://progress.win/vaush-primary)**!**\n\n**FAQs**\n\n**Q:** ***Do I need prior political experience?***\n\n**A:** Absolutely not! We'll provide all the training you need before your first shift.\n\n**Q:** ***What should I bring?***\n\n**A:** Comfortable shoes, plenty of water, your phone, and a positive attitude!\n\n**Q:** ***What accommodations can I expect?***\n\n**A:** Financial assistance to volunteers is first-come, first serve. Included in the financial package is lodging, some meals, and transportation to and from the canvassing site and the hotel.\n\n**Q:** ***I can’t make it, but I want to help. What are some ways I can do that?***\n\n**A:** Consider making a small donation, phone banking, and joining our Discord to find local actions.\n\n**Q:** ***Where can I find updates to this event?***\n\n**A:** Your email-inbox, PV discord, and your favorite streamers.\n\n**Q:** ***Will there be other events?***\n\n**A:** Yes! There are events planned throughout the year and we are looking for innovative ways for you to get involved.\n\n**Let's work together for a weekend of action, empowerment, and progress.**\n\nWe can't wait to see you there!\n\n**\\~** ***Progressive Victory Team***",
        "num_comments": 2,
        "comments": [
            "# Please report comments that violate our [new rules](https://www.reddit.com/r/VaushV/comments/17co6jo/rvaushv_rule_updates)\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/VaushV) if you have any questions or concerns.*",
            "Yooo"
        ]
    },
    "It's Getting Warmer and Warmer and Warmer and Warmer and Warmer and Warmer and Warmer and Warmer and - The Vaush Pit": {
        "title": "It's Getting Warmer and Warmer and Warmer and Warmer and Warmer and Warmer and Warmer and Warmer and - The Vaush Pit",
        "score": 14,
        "url": "https://www.youtube.com/watch?v=XhvWQzz-moE",
        "content": "",
        "num_comments": 2,
        "comments": [
            "# Please report comments that violate our [new rules](https://www.reddit.com/r/VaushV/comments/17co6jo/rvaushv_rule_updates)\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/VaushV) if you have any questions or concerns.*",
            "It's over"
        ]
    },
    "Namibian court declares laws banning gay sex unconstitutional": {
        "title": "Namibian court declares laws banning gay sex unconstitutional",
        "score": 222,
        "url": "https://www.reuters.com/world/africa/namibian-court-declares-laws-banning-gay-sex-unconstitutional-2024-06-21/",
        "content": "",
        "num_comments": 8,
        "comments": [
            "A surprise to be sure.\n\n\nBut a welcome one.",
            "Ball to ball contact is a human right",
            "I must say, I don't think the combination of the Namibian flag and pride flag really works, but I respect the attempt.",
            "The anti-sodomy law was largely unenforced before it's overturning, a legacy law from when Namibia was occupied by Apartheid South Africa. So its overturning is symbolic, but still good news.\n\nA couple of months ago, the Namibian courts also declared that a same-sex marriage performed had to be recognized by the government. Hopefully, this momentum will continue and broader protections for LGBT people will be put in place.",
            "Of course the one african country to defend lgbtq rights is the one with Adolf Hitler (the based remake)",
            "Namibia went woke!",
            "WOKENESS IS UNDEFEATED!",
            "the cooler one"
        ]
    },
    "Jubilee Videos Are Too Insufferable To Watch Anymore - The Vaush Pit": {
        "title": "Jubilee Videos Are Too Insufferable To Watch Anymore - The Vaush Pit",
        "score": 35,
        "url": "https://www.youtube.com/watch?v=vGXFBvI6UDA",
        "content": "",
        "num_comments": 22,
        "comments": [
            "# Please report comments that violate our [new rules](https://www.reddit.com/r/VaushV/comments/17co6jo/rvaushv_rule_updates)\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/VaushV) if you have any questions or concerns.*",
            "Based. I always thought watching Jubilee videos was boring content, but it seems like everyone reacts to them.",
            "Damn i used to watch Greg doucette (guy in blue) 5 years ago. Sad to see he became a fascist",
            "i’ve always felt like Jubilee videos exist as slop content that feeds on people’s rage and i’ve always hated how little you learn from any of their videos. i despise their content.",
            "I have only ever watched a jubilee video of its covered by vaush. Too frustrating and boring to watch otherwise.",
            "Remember when vaush actually watched and reacted to stuff instead of talking for 10 minutes about shit?",
            "I cant bring myself to do it honestly.",
            "Blue Man Group really went downhill after the early 2000s",
            "I used to really love Greg Doucette but he really fell off and fell down the shaft of the vaccine-skeptic, anti-trans, anti-woman shit-pit.\n\nSimilar story with Alan Roberts/Every Damn Day Fitness. Used to be an aggressive, passionate fitness personality who was actually very empathetic and seemed to just want what was best for folks, but then went insane when Covid happened and started basically implying that if you got sick, it was on you for not prioritising your health/fitness enough….then proceeded to try and arrange an exclusive unmasked cruise (you know, in the middle of a plague).\n\nI think the roids must eventually rot all these dudes brains.",
            "Simply watch the video yourself and react",
            "He's always done this, what are you actually on about. His entire demeanor and channel is centered around talking about shit.",
            "Really? Him too? Jesus man the bodybuilder scene is cooked (not like it wasnt cooked to begin with tbh but thats besides the point)",
            "More Plates More Dates too. These guys just follow their right wing fanbases. All in the name of capital.",
            "I don’t watch those types of videos. And even if I did, it’s not the same as watching vaush react to it in the analytical way that he does, picking apart the arguments. Something I can’t do",
            "I don't know how to react",
            "No I get that. I’m talking about when he has a 10+ minute video with the title and thumbnail reacting to a video, and then he doesn’t watch any of the video. If he put out an hour long video, I expect that he goes off on tangents, but this is different",
            "Jeff Nippard and Mike Isreatel are still great at least, if either of those two ever go off the right-wing conspiracy nut deep end I’m ~~jumping off a cliff~~ quitting the gym",
            "Oh shit, More Plates More Dates too? I haven’t watched his content but I know him from brief collabs with fitness ‘tubers I *have* watched.",
            "I’m with you, but I also understand why Vaush and others don’t want to spend much time covering these sort of videos anymore. It’s honestly sad, I remember watching Vaush critique Jubilee, PragerU, etc. back in 2020 before/while I was canvassing, and it helped me a lot with my rhetoric when talking to voters. But when you watch what these channels are making now, they’re not even trying to make good arguments anymore (not that they were ever good to begin with), so there’s nothing to analyze. I watch TMR almost every day, and they try to do the same thing with Dave Rubin and Tim Pool clips, but I can’t honestly watch those segments anymore because it’s just total brain rot.",
            "Mfw he says he doesn't like watching the videos on the title, and he proceeds to not watch the video because he doesn't like it",
            "I thought he was going to at least watch more than a minute of it. Maybe 5 at the most"
        ]
    },
    "More pro Florida and Texas propaganda. ": {
        "title": "More pro Florida and Texas propaganda. ",
        "score": 12,
        "url": "https://www.travelandleisure.com/these-states-americans-are-moving-to-en-masse-8662887",
        "content": "Not saying New York and California don't have problems they need to fix but this is clearly propaganda to get more people to live in places like Florida and Texas because of \"low taxes and better housing\" which of course they don't and  not to mention some of the states mentioned about are of course becoming more authoritarian and corrupt then anyone can imagine and even worse crime and qualify of life stats. So yeah what do you guys think and solutions can you come up with for this problem?",
        "num_comments": 12,
        "comments": [
            "Poor people pay more in taxes in Texas than California. But grifters will only ever mention the highest tier of income tax.",
            "I don't have a solution but if anyone thinks moving to Florida for better housing is a good idea I think they have have very smooth brain. \"Wow! A house a can't insure, and is very likely to be underwater in 20 years!\"",
            "No state income tax but literally everything here has a sales tax and property taxes are insane. I literally spent less money living in South Carolina versus Texas.",
            "Anyone who wants to move to Florida or Texas is a sucker.  Both of those states are in total chaos right now, and it's only going to get worse.",
            "MAGA hogs from other states are absolutely flooding into North Carolina right now.  The political environment here is bad enough but if those pieces of shit get Mark Robinson elected then this state is fucked.",
            "I live in Florida, most of everybody hates it here",
            "Property taxes are horrible in Texas",
            "The only people who like this place are MAGAs and pensioners. The rest of us are living in hell.",
            "Every tax besides income tax. But idk, I guess income tax is the least abstract for people…",
            "agreed, don't forget the upper middle class who thinks they're poor.",
            "Same deal in Florida, we don't have a state income tax and people bank on that so hard as justification to live here, but they get us everywhere else they can and give absolutely nothing back. Plus because we're in hurricane alley we have to pay 8x more on average for home insurance, and because so many people are moving down here, rent has skyrocketed above what most people can afford.",
            "We need to start calling Capital Gains Tax a \"Robin Hood tax.\"  Top-end tax brackets too.\n\nTake from the rich and give to the poor!"
        ]
    }
}