{
    "Weekly VR - What Did you Play?": {
        "title": "Weekly VR - What Did you Play?",
        "score": 1,
        "url": "https://www.reddit.com/r/virtualreality/comments/1dlabi4/weekly_vr_what_did_you_play/",
        "content": "Hey r/virtualreality!\n\nAnother week in the VR space.\n\nDid a certain game or experience stand out to you? This is your spot to chat, share, and discover.\n\nWhen sharing, you might consider sharing:\n\n**Name** of the game or experience.\n\nA brief **insight** or **overview**.\n\nYour **personal rating** and a bit about why.\n\n*Example*: I got hooked on \\[Game Name\\]. It offers \\[Brief Description\\], and I've been having a blast! Rating it 8/10 mainly because \\[Reason\\].\n\nSo, what's been captivating you or challenging you in the VR world lately?",
        "num_comments": 3,
        "comments": [
            "Silent Slayer: Vault of the Vampire - a fun puzzle/horror game in the vein of the old table top game Operation with some good jump scares. \n\nYou are a vampire slayer tasked with dispatching 7 vampires while they sleep in their coffins. Each vampire has a series of increasingly difficult traps you must disarm before you can plunge a stake into its heart. A talking book (with a voice that bears more than a passing resemblance to Darth Sidious) will guide you along the way.\n\nThis is one of those games that is easy to learn but will take multiple tries to beat and has some really well done hand gesture mechanics. It took me about eight hours to see two of the game's three endings so I still have more to see and do.\n\nRating: 4/5 - The last two or three vampires can be really hard to kill and I wouldn't have minded a difficulty slider to make things just a little more forgiving. Also, when using one of your tools to disarm the traps your hands disappear, which has always been a little immersion breaking for me. But both of these are very minor quibbles.",
            "Hal Life Alyx (9/10) and High on Life (9/10) via UEVR :)",
            "Finished Max Mustard on Quest 3. Not a fan of linear level based platformers, but I absolutely loved Max Mustard. Beautiful game, fun levels and just challenging and long enough. Can't recommend this game enough. Btw, I bought it before 90% off code. No regrets. Absolutely worth its full price.\n\n\nPlaying Miracle Pool and this is one of the best MR games yet. Physics are on the same level as in Eleven Table Tennis, but MR graphics are even better and more realistic. Once I lined up MR table with my kitchen table, the realism went through the roof. Feels like playing a real pool game.\n\n\nPlaying around with Figmin XR. Another top MR app. Hours fly while playing around with it."
        ]
    },
    "MS Flight Simulator 2020 with the Map Enhancement Mod streaming the latest Bing Maps is amazingly stunning. The details. Wow. Flying in VR. Currently over Canada on my Cape2Pole journey (Quest 3 1440p direct video capture while gaming wireless over Virtual Desktop on a AMD3700X/3080RTX/32GB PC)": {
        "title": "MS Flight Simulator 2020 with the Map Enhancement Mod streaming the latest Bing Maps is amazingly stunning. The details. Wow. Flying in VR. Currently over Canada on my Cape2Pole journey (Quest 3 1440p direct video capture while gaming wireless over Virtual Desktop on a AMD3700X/3080RTX/32GB PC)",
        "score": 98,
        "url": "https://v.redd.it/6klps6v6m08d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Any settings, guides, or configs you can share with us? This looks amazing!",
            "Man imagine that sunlight in VR in HDR",
            "Oh I thought planes flew upside down over Canada.",
            "Man, I am doing a VR tour around the US right now in the black square TBM 850, also using quest 3 and VD and map enhancement mod. It’s such an incredible experience and I don’t know a single person in real life who has been able to do this. It seems so inaccessible to so many people (it is expensive and can be tough to get all the tech working) but holy crap man virtual tourism is the future. I am flying to different cities then switching to the Hype H160 helicopter and doing slow city tours with another VR browser window open playing YouTube videos about the city I am flying over (via OpenKneeboard). All on Vatsim or beyond atc and all flights tracked on Volanta.",
            "View looks stunning.  I just don't have the patience for flights.  I love crashing tho...that's fun. Lol",
            "I’d like to get into flight sim. Any sites that are good for a complete beginner?",
            "man i gotta get back into this but I was thinking of getting a new desk to get the height right for my hotas... it never felt right putting it either on the desktop at 31\" high or on the KB tray which groans when you use the keyboard or mouse.",
            "For anyone wondering about performance, something like as ween above will run at about 45 reprojected which is fine because of the slow paced nature of the game.\n\nThis game however is one of the best use cases of a Quest pro or other eye tracked headset. This game supports Quad Views which dramatically increases performance and is a feature only available on headsets with eye tracking",
            "I have Q3 and QP. Below are some hints for both. I play wireless over Virtual Desktop.\n\nClarity is always a thing. I have a 3080 ... and sure enough a 4090 would be better. The trick is to get acceptable results with the hardware at hand. I can live with my specs ...\n\n... Q3 on 72 Hz ... VD on Ultra/Godlike and with SSW always on!! (so fps halfed to 36!!) with streamer on VDXR HEVC10 ... MSFS DLSS(!!) on Balanced/Quality ... 5GHz dedi router 2m/6ft away\n\nThis should make things smooth. Check this with the VD framerate counter! Now tweak gfx, mid to high to ultra (eg clouds on high) etc. Dont push.\n\nDlss makes the picture somewhat soft, which I do not mind. I tried several sharpening flters. They work, but it feels somewhat artificial, so I go for some softness. Np for me.\n\nBtw, I have 32GB ram. And do recording on Quest3 (not on pc)\n\nOne trick for nightflying with Q3 is to lower the brightness all the way down to ZERO🤔👍 ... It will make nightflying a joy. Not oled joy but very workable. The 'grey mess' is gone and your eyes will(!) adapt to the lower brightness. Low light/Nightflying is a important part of MSFS for me\n\nAnother important setting ... TRAFFIC (cars, ships, fauna) ... set those to ZERO\n\nMicrostutters see https://youtu.be/I8PZJJ25olk \n\nMore info (I took my info form these 2 sources):\n\nhttps://www.avsim.com/forums/topic/645221-where-to-get-the-bing-version-of-google-maps-enhancement/\n\nhttps://www.youtube.com/watch?v=WzWCfIfxUjs\n\nHope this helps",
            "Yeah seriously.  I have the same specs basically and can't get anywhere near this framerate...",
            "that's Australia you're thinking of",
            "👍 ... I started in Capetown, then crossed Africa and Europe to the NorthPole, then to Siberia, BeringStraight to Alaska and now Canada ... direction Chicago for Route66 ... and slowly towards Mexico, SouthAmerica, Amazon river Cape and SouthPole.\n\nIn a Beechcraft Baron G56 \n\nAs you said ... It is virtual tourism, extremely relaxing (spotify in the background:)\n\n👍🛩️",
            "> I just don't have the patience for flights.\n\nFlying alone could never hold my attention, especially with my ADHD. But putting on an audiobook or podcast and flying is actually pretty relaxing for me.  \nI haven't done so in MSFS, but when I was playing Elite Dangerous more, I'd put up a virtual window and watch a movie while doing some space trucking.",
            "https://forums.flightsimulator.com, mostly flight sims fans.",
            "See my other comment",
            "Same 4090 and a 12900k, and I was struggling to get 45fps on my valve index with good looking graphics.  I’ll give this game another go with some of these settings",
            "I thought they just fell of the end of the world because we keep getting told its flat 🤷🏻‍♂️"
        ]
    },
    "Imagine a pod racing game built from the ground up for VR. Would anyone else be excited for that?": {
        "title": "Imagine a pod racing game built from the ground up for VR. Would anyone else be excited for that?",
        "score": 219,
        "url": "https://i.redd.it/tchy3n4o3y7d1.jpeg",
        "content": "Imagine this built from the ground up for VR. Piloting a pod racer from the cockpit, seeing those energy beams swirling in front of you, and maybe even having to manually repair your racer by flipping switches repeatedly and transferring power around like in the movie. That would be awesome.",
        "num_comments": 74,
        "comments": [
            "It should be modded directly to fan to simulate the wind speed and the speed of the podracer.",
            "What a neat idea! I am making something inspired by it and other cool things :) Still early, after so long, but getting better every day! Demo is available on Quest. Need to wrap up the garage soon :D  \nCheck it out: [Steam](https://store.steampowered.com/app/2401910/Dart_Racer/) [App Lab](https://www.meta.com/en-gb/experiences/4370464433009119/)",
            "It would have to be official.  Not cheap indie version because I'm pretty sure there already is that.",
            "Look up DEATHGRIP on steam, the devs talked about putting in a vr camera. Might be worth keeping an eye on.",
            "Hell yea",
            "Closest thing to this that I played was Wipeout Omega Collection on PSVR.  It's the first example of a game I can think of that was built in flat and translated perfectly to VR... I think it's proof that a podracing game would be cool as shit and could even be cross-platform between pancake and VR which would really help boost the lobby numbers.",
            "Try redout. Kinda similar and really fun in vr. I agree that pod racer is still one of the best racing games.",
            "BallisticNG plays perfectly in VR.",
            "ah yes... I literally pissed myself as a 12 yo because I couldn't stop playing it on my cousin's N64",
            "Absolutely down for this 👍👍",
            "Anything by this point.\n\nBut of course, don't use Disney's IP.",
            "Not me. I am the opposite of a Jedi, I would just slam into canyon walls over and over.  🤪🤣",
            "Closest we had was the arcade one, and that one rocked.\n\nAlso played the Pod Racing section in The Skywalker Saga. This idea really needs to be revisited.",
            "That would be absolutely incredible! Shut up and take my money",
            "I can 3d model these things. Anyone with Unity or UE5 skills out there that can program? 😃",
            "Only if Disney isn't involved.",
            "I would be so excite to cover my room in barf, yeah <3",
            "There's at least one project out there!\n\nThere was someone already doing proof of concepts. They had a discord but went silent after a while. I played their releases and it was genuinely a great feel and exactly what you're describing! Maybe someone could spill a bit more on what happened to the project. But it is 100% playable as proof of concept!!!\n\nhttps://discord.gg/zP6yYcBw  <--- discord for feedback and download\n\nhttps://ravstark.itch.io/podracer  <---- just want to download the game and try it",
            "Been wanting this for years. It's the perfect format for VR as a seated experience. Add HOTAS and other sim racing accessory support and you'd have a banger of a game.",
            "This is as close as you can get right now:\n\nhttps://ravstark.itch.io/podracer",
            "World love to see this ported as is for vr",
            "Would prefer Wipeout, now that would be incredible.",
            "Pretty sure there are podracer worlds on VRChat but not the real gamr",
            "I just want DR BEEF to mod the OG episode 1 racer game 🤷 that’s all we need tbh",
            "Would kinda work perfect with VR motion controllers, too.",
            "Just don't call it \"pod racing\" or Disney will send you a Cease & Desist and you'll have to change your logos and assets and marketing materials. It has to be a generic thing that won't be construed as being associated with Star Wars other than in similarity.",
            "Yes yes a thousand times YES!!!!",
            "With HOSAS support.",
            "Take my money",
            "Any quality game for VR right now is appreciated.",
            "Would it really be much different than current VR racing games?",
            "Just as any VR game idea, if done correctly it could be the shit, if done correctly",
            "The Pod Racing stuff in the movie or the game(s) never really appealed to me, but I could see myself enjoying it in VR. I'd love to see them add in some ship racing too. Star Wars Resistance was a show built around ship racing, so it'd make a nice combo to the Pod Racing. I especially love the setting for Resistance.",
            "I wish sony would make wipeout VR for PC.",
            "Yeah this is the shit VR needs to actually start producing.",
            "🥺😬😰😨🫨🤢🤮",
            "Me!! I played the absolute crap out of this on n64. Atleast I think it was n64",
            "Whatever that ship flying Star Wars game would also be dope",
            "There have already been multiple Star Wars games made for VR, it's really a no-brainer, although they might be waiting for the standalone market to catch up bc I don't know if Quest 3 could run a podracing game with huge arenas, a number of racers, and all this at high speed",
            "Ah yes, also known as \"Puke simulator 2000\"",
            "You can do that with most PC racing games, it's kinda fun",
            "I think someone made an actual physical mod for fans for psvr1 \n\n\nI used to put up a fan when I play (not just for summer). Honestly it does add immersion in most games.  I have it oscillate too.",
            "I played it back when you first posted and had fun, though there were some issues at the time. Have you been able to keep refining it since then?",
            "[Velocity Vector] (https://store.steampowered.com/app/1537470/?snr=1_5_9__205)\n\nHard as nails to play, but it simulates the pod and how you'd control it with motion controllers.\n\n[Vector 36] (https://store.steampowered.com/app/346460/Vector_36/)\n\nMore of a simulation, but it's essentially anti grav pod'ish racing.",
            "Official one would be EA games, since they own the Star Wars license.  \nWhole host of problems with that like just randomly not being able to access the game anymore when they decide to stop supporting it.  \n\nI'd rather a passionate indie dev with enough marketing money to get a good player base... but I know I'm dreaming.",
            "Oh damn, that does look promising. I wonder if you could do a VR camera and then some kind of double throttle setup for the controls",
            "DEATHGRIP is pretty great as well! Got inspired by few things :D",
            "I'm getting a lot of good suggestions from this post lol. I'll have to check this one out too.",
            "You'd get Obi-Wan's voice in your head:\n\n\"Use the instrument panel, u/JorgTheElder! You can't trust your feelings for shit, AI assist is there for a reason\"",
            "It would be awesome if they did multiplayer support too. I'd love to yell that someone drives like a Gungan as I pass them lol",
            "Redout",
            "**Ballistic NG**. It's awesome in VR, while being very PS1-aesthetic.\n\n**Redout**. More colorful-generic-modern graphics, also a bit hard to run in VR on cheaper hardware.",
            "The difference would be in the controls mainly. I would hope for either a double throttle setup, or at least using the controllers to simulate holding the 2 control arms of a pod racer. My personal dream would be double throttle setup with hand tracking so you could take your hands off the thrusters to hit other controls like repairs. Plus boosting, repairing on the fly from collusions and over boosting, turning sideways to squeeze thru cracks, stuff like that. Not too many racing games that do all that.",
            "Bruh. https://store.steampowered.com/app/473770/BallisticNG/?l=polish",
            "Star Wars: Squadrons does have VR support last I heard.",
            "It'll be interesting to see what the upcoming Quest 3 exclusives are able to accomplish like Arkham Shadow. I heard one dev say that the leap from developing for the Quest 2 to the Quest 3 was way bigger than expected.",
            "I'm fortunate I guess. I've yet to meet the VR game that could make me sick. Even when playing on the Rift S with it's pretty low refresh rate.",
            "Got any links? That sounds like a fun mod to do.",
            "I use a fan so I know my orientation while in VR",
            "Certainly! Ive been working on it almost daily. I think Im past the feature creep phase now, working on improving and implementing all the planned thingies :D Im working solo, so it goes slowly. But hopefully steady. The demo version is fairly old now, want the next update to be meaty!",
            "Vector 36 rocks. Tons of fun with a hotas, very tricky to get the hang of if you aren't used to more grounded and detailed physics",
            "Vector 36 is the real deal but it takes a bit of work.\n\n[https://www.youtube.com/watch?v=OPOMNAZpwSo](https://www.youtube.com/watch?v=OPOMNAZpwSo)",
            "The first one looks like a pod racing, robot jumping, trackmania in vr.",
            "Or this:\nhttps://ravstark.itch.io/podracer",
            "EA doesn't own the license, they had an exclusivity deal which expired in 2023.",
            "That actually makes a lot of sense. I didn’t think of the double throttle situation.",
            "It does. Works pretty well too.",
            "Thats the one! I'm guessing just for pcvr cause I tried to find it in the Meta store",
            "It was fun when it worked. I've just had so many issues with it and now I can't get past the EA sign in screen.",
            "It's not exactly super easy plug and play, but you'll need Simhub, an arduino and of course some fans (and some other bits).\n\nHere's a video: https://www.youtube.com/watch?v=Yud4duS2l2s",
            "it's on PSVR too",
            "Fkrs",
            "But not PSVR2 😭",
            "I miss Sony’s backwards compatible days :("
        ]
    },
    "Xbox should give up and try VR at this point.": {
        "title": "Xbox should give up and try VR at this point.",
        "score": 16,
        "url": "https://www.reddit.com/r/virtualreality/comments/1dln2nq/xbox_should_give_up_and_try_vr_at_this_point/",
        "content": "Do you agree with this take? I don’t think they should go all in, but they’re missing out.\n\nIt’s insanely strange that in the gaming community VR is not taken seriously or not even part of the discussion.\n\nI see people go “oh xbox is not selling that well so maybe they should try doing a steamdeck device” when Quest 2 itself has surpassed Xbox total sales this generation, and has 4x more than Steam Deck.\n\nI swear there is a MASSIVE market opportunity here but companies are boring, and traditional gamers keep asking for the same stuff.",
        "num_comments": 73,
        "comments": [
            "Microsoft had a whole lineup of VR headsets under the Windows Mixed Reality branding ready to go, the Xbox One even recognized them when plugged in, they just weren't interested.\n\nThey'll never outperform Meta, but they could partner with them (which it looks like they might be trying to do).",
            "seems they want to get out of the consumer hardware business and I don’t blame them",
            ">I swear there is a MASSIVE market opportunity here\n\nIf that were true, Microsoft would already be in the VR space. I'm more inclined to trust the company who has spent millions on market research.\n\n\"Xbox isn't selling consoles, so they should decide to move into a WAY more niche market\" is a wild take.",
            "Why do you care? Genuinely, why are you playing arm chair executive? I thought ppl were interested in video games and not profits lol. This is just weird. I do think Xbox should add VR options the same way that PlayStation has. At the same time they did try Windows Mixed Reality and that didn't work out. Give me good games on the platforms i want to play on. the other stuff is just noise.",
            "Do you remember they give up on WMR ?",
            "Given how poorly the PSVR2 has performed, I don't think the market is really there. People either want fully wireless standalone VR or VR tethered to a powerful gaming PC.",
            "There’s speculation that the next Xbox might be more pc-like and would support 3rd party stores. If so, then that might be how it gets VR (through Steam).",
            "It would be a waste of time at this moment",
            "Yes daddy, make more exclusive platforms.",
            "Well they already have a partnership going with Meta so why not just team up and allow VR games to play directly from the Series X via a dongle and have Meta convert some Xbox ABK exclusives into VR?",
            "I think VR makes 30% of people sick or spend a significantly less amount of time per gaming session. Both of those are really bad business #’s.",
            "99.9% of gamers would disagree with you",
            "Not enough demand",
            "VR is not taken very seriously because there isnt a big market for it. Hell even friends of mine who have VR, 4 outta 5 of them havent touched VR in years. One even sold theirs shortly after purchasing.\n\nI dont think its for everyone and alot of people see it as a gimmick. Itd be a big buy in for xbox to jump into the market so dominated by meta",
            "Where's the massive market opportunity?\n\nIf they try to sell VR hardware they have to go up against Meta who is selling almost at cost and is supposed to be their partner.\n\nThey could build VR support into Xbox and then have it wirelessly connect to Quests. That would be the most viable path but it doesn't do anything for them more than slightly increase sales of Xbox because if people already have a Quest they *might* see it as an advantage and buy one instead of a PS5. And it would require actual VR titles to run on the Xbox - they'd have to port over titles or VR enable existing titles. It's a lot of work.\n\nI do think this second one could be worth doing but only IF they partner with Meta and some studios to bring over the titles.",
            "In fairness, Sony has had 2 VR devices now, one for the PS4 and now one for the PS5 and it's not like either one has been a smash success. And Xbox has a much smaller player base than PlayStation at this point so I think it would do far worse on Xbox at this point. From what I understand, the PS4 outsold the Xbox one like 3 to 1 and PS5 vs the Xbox Series X/S is like 5 to 1.\n\nI think Quest and then PC are going to be the main platforms until VR really takes off. It still hasn't done that yet. It's easy to tell because whenever a famous IP gets a VR game there is an overwhelming negative response from gamers. Just look at the comments under videos for Metro Awakening and Batman Arkham Shadow.",
            "I dont think there's a point tryna go up against Meta at this point. Creating a whole new ecosystem of apps and games is too late, same reason Windows Phone was too late to the party. Microsoft already dropped out of the VR game and is slowly working on scrapping its hololens division. They already have their partnership with Meta for an Xbox edition quest 3 bundle.",
            "I think MS is working on a limited edition of the Quest 3 that's supposed to be compatible with their controllers and comes with Game Pass. It's possible they might eventually make an Xbox that's compatible with it.",
            "Sony have just cut their losses and given up on VR as have Ubisoft. There's no way Microsoft are going near it with Xbox. Not any time soon. They are targeting handheld gaming now which is the perfect strategy for them.",
            "They are still shaken up by the absolute shitshow the kinnect was.",
            "Developing a headset is expensive and judging by how PSVR2 fared it's not worth the effort. The other day we had news VR business went so good for Sony that they are limiting budget for the last 2 VR games and killing the support afterwards.\n\nWhat MS could do is mobile ports for Quest. They don't have problems releasing their titles on other platforms anyway.",
            "The future of VR is absolutely in a untethered version, so that would be pretty stupid if Xbox had a VR headset. \n\nAlso Sonys headset was a failure and they have a far far higher install base with PS. Even if a VR headset for Xbox wasnt a bad idea, which it is, they havent sold enough Xboxs for it concievably ever make a lick of sense",
            "They had the Kinect. VR goes hand in hand with body tracking. Shame that they didn't get into it.",
            "If Xbox is capable, they should just build compatibility with quest 3 like steam does. Being better optimized VR mods",
            "I think it'd be weird for them to go all in on it, especially with PSVR2 kinda failing in the market.\n\n\nI think the Kinect burned them when trying something weird and new and they don't want a repeat of that just yet.",
            "We are talking about a company that couldn't bother putting gyros into their gamepads, VR is obviously too radical for them.",
            "Nvidia bought Xbox",
            "I think they should just cooperate with Meta. Microsoft will fail hard if they try it. It's just like the handheld, rather than just introducing competitive to Ally X handheld, they try to reinvent the wheel by focussing on ARM rather than X86. Which on paper is very cool but we've passed that stage of shaping the market.",
            "I dont understand this take when sony who has a bigger playerbase atm are struggling to sell PSVR2. Both companies are going to a handheld future, not VR",
            "\"I swear there is a MASSIVE market opportunity\" i see it, it like sony pcvr2 make a lot of money and sell super well and have huge industry support right ?\n\nxbox is in a same boat , main problem about VR is how non standard it is, onlymeta have some development guidance and similar stuff, we need at least 5-8 years for VR to get in to easy to pick and develop stage",
            "Microsoft got burned by hololens and WMR.",
            "I think xbox was trying vr in a very final stage. Look at the new indiana jones game with this in your mind.  But they cancle it.",
            "As much as I'd like to see more vr games and competition; vr is a risky move. Most people buy it and it collects dust within a year. Gamers are lazy and judgemental of silly looking beat saber videos.",
            "Dont rush things, either we're at the start of a big thing and we'll all look back on these days with nostalgia or it's just not gonna catch on and reach a global scale as we hope it will and that's cool too because we're part of a niche hobby with an enthusiastic community (not counting the obligatory yelling kids). Both scenarios seem good to me.",
            "I believe the problem is that most people haven't actually tried vr yet. For me personally, I thought it would basically be a monitor up to your face.",
            "Microsoft has no interest in innovating. They are purely profit driven and have stated that the market just isnt profitable enough for them to care about it. This mentality has infected their gaming-branche years ago and it feels like every descision they make is determined by cold data in a  boardmeeting. They are out of touch with their customers.",
            "I could imagine them just enabling 3rd party headsets on Xbox before making their own. Quest users would explode.",
            "Yeah after they fucked up 2 consecutive console generations out of pure stupidity, it would be really hard and expensive for them to recover from that.",
            "Wasn't Microsoft making some mixed reality goggles back in 2017? I wonder why it died down for them. I remember playing around with those at some lab which also had a vive and oculus. It was sorta like a first look at spatial computing with these interfaces floating in the air, but had bad viewing angles.\n\nAH yes, it was Hololens. Just googled it. Apparently they stopped further development in 2021.",
            "Quest 2 sold almost as much units, as Series S&X combined; and there was a brief period when Q2 was actually ahead by a few hundreds thousands units. So, either Microsoft really sucks at gaming hardware, or VR is not a niche thing anymore. Either way tere's no point in beliving their market analysis team.",
            "The company that spent millions on market research to launch xbox one with picture-in-picture as the big selling point.\n\nResearch doesn't do any good if they have morons interpreting the data.",
            "Yeah and do you remember why?",
            "Lol we have been hearing that since the OG Xbox launched.",
            "no. they are not going pc route they are allowing other stores to sell console xbox games on the xbox",
            "I mean…depends how you’re counting. The original PSVR sold over 7 million units, which makes it the second highest-selling (real) VR system of all time behind only the Quest 2.",
            "They won’t necessarily have to compete with Meta. All they need to do is make Xbox work with Quest the way PC works with Quest. Maybe in next gen Xbox they can include whatever radio they might not have in current generation. \n\nIt’s a win win and I’m sure Meta would love to support it, I think the problem would be prioritization on Microsoft side.",
            "Paired with Microsoft Kinect for full body tracking :)",
            "That's because, you know, they promised this https://youtu.be/oyjNqksc-m8?si=ReOJuRxOZg7VXymL",
            "Ugh. I love how this story continues to get spun.\n\nSony is not doing well in VR, but...\n\nFinding a story that starts with \"2 new exclusives\" and then spinning that to \"only making 2 games\" is wild.\n\nNothing there says it's the last two games. This guy from Android Central has been going scorched earth on PSVR2 via his Twitter and no one questions it?",
            "Kinect was incredibly bad and incredibly bad for them. You’ve probably just highlighted one of the main reasons they’re not trying VR. They’ve also dabbled a little with HoloLens.",
            "Theres no way you actually believe this",
            "Yeah, they found some success in industrial fields, but consumers just didn’t want it.  Interestingly, you can still buy them, but they cost more than the Vision Pro and are objectively worse than the AVP in just about every technical way.\n\nI was excited about HoloLens when it came out, but it was so damn expensive that it never made sense for me to buy one.",
            "Sales volume isn't everything, especially for consoles. Retention matters even more, because game sales is where companies actually make money. And retention with VR is notoriously bad.\n\nMeta was able to get a lot of units out the door by selling below cost (before raising it a couple years after release). And their aggressive (subsidized) pricing pushed a lot of competitors out of the market, which just leads to more sales as they're the last one standing. But how many of those millions of headsets sold are actually used on a regular basis now?",
            "Quest 2 had a uniquely good set of circumstances at the time that contributed to its success. It had a very low price, no competition, a pandemic resulting in much increased savings for the middle class due to WFH and less recreational spending outside, and IT companies riding this high wave in general.\n\nNone of these would apply to a hypothetical Xbox VR headset.",
            "I do think they kind of suck at gaming hardware, they focus solely on performance, making sure you can run games on 60fps in 4k, but ignoring every innovation in tech in the last few years. Their controllers feel great in the hand but are now several generations behind in features. Try playing GT7 on the PS5 with VR, Haptic Feedback, Adaptive Triggers, Gyro Steering and compare that to Forza on XBox with just basic controller vibrations. And then you still have more features packed into the Dual Sense like infrared sensors, touchpad, lightbar. Meanwhile Xbox controller still requires batteries.",
            "Still don't know but what OP wants will never happen. Not enough money to make I guess.",
            "Nothing is for certain until we see actual products or announcements. The speculation is there. But yes, Phil has been most vocal about third party stores and a mobile Xbox.",
            "EU may have other opinions",
            "That's true, but it doesn't seem like the games have sold well and that's what's really important. Sony seems to be saying they are scaling back their VR games. And games are where they make money. I doubt they are making any money on headset sales, just like Meta doesn't make money in headsets. Those are subsidized to get you into their ecosystem. Idk, I don't see any signs of the playstation VR ecosystem being a big financial win for Sony. I'd love to be proven wrong tho. I'm really glad that PlayStation VR exists.",
            "it's telling that those 2 games would almost double number of first party PSVR2 exclusives so far. Horizon, Grand Tourismo and RE7 (last 2 are just VR addons not made from the ground up for VR so maybe should count as 0.5 game).\n\nMeanwhile HMD development cost at this scale is in hundreds millions of dollars. Why would you do that if you could leverage PCVR or Quest 3 instead and just add VR mode to one of your games?",
            "Eh they sold 35 million units and it was generally well regarded by critics",
            "Good question! And I have an answer for you; according to publicly awailable data, Queat 2 had 6.3M montly active users out of approximately 15M sold units as of October 2022, so roughly a 1/3 monthly users. What's the retention number for XBox? Anyway, regardless of retention, can one really call a 6.3M montly users a small, niche market, in context of gaming?",
            "To some degree that's true for Xbox. The only reason I own a series S is because it was impossible to get my hands on a PS5 (or series X) due to the pandemic/supply chain issues at the time.",
            "PSVR has been sold at a profit since launch day according to Sony, so your assumption there would be incorrect.",
            "Two first-party exclusives per year is more first-party titles than the PS5 has gotten in the last 12 months.",
            "I was one of those 35 million. Got it on launch day no less. It was awful. Name me one good Kinect game? Or Kinect use? Or even anything remotely good about it?\n\nEdit: I’ll go even further and say that Microsoft’s instance on bundling Kinect with the Xbox one and the impact this had on its price is a major contributing factor to the mess Xbox is in right now - and I say this as someone who has a series x and has owned an Xbox from every generation.",
            "Apparently Xbox had ~120 million monthly active users as of December 2022. VR is indeed quite niche in the context of gaming.",
            "Oh I didn't know that. Well that's great news then.\n\nGoing back to the original point tho, I'd still say the sales numbers would be worse on Xbox tho given the disparity between the size of the user base for the last 2 generations of PlayStation vs the last 2 generations of Xbox tho. Maybe if VR games were also on in gamepass that could be incentive enough for a good number of people to try it.",
            "Not just niche. How many of those users are children without disposable income playing free games like Gorilla Tag or Pop One? Since game sales are the significant factor, the actual viable user base is a niche within a niche.",
            "This number can not be accurate. Publicly available sales figures state that only 25M units of Series S&X were sold by the end of 2023, there's no way they have 120M monthly users.",
            "Gorilla tag is actually making tons of money because they focus on children.  Children these days spend money on in-game cosmetics all the time.  What else are they going to do with all the money they get from b-day and xmas presents?\n\nWhereas adults from my generation almost never spend money on in-game cosmetics.",
            "Maybe Xbox users on PC are included in that number. I guess in that case there’s no way to compare them.",
            "Xbox covers more than just the Series S&X - all the older Xbox version console users(and some PC users) are included in the active users on the platform.\n \n \nBut then, the leaked 6.3M monthly figure for the Quest platform wasn't just for Quest 2 users, but included Quest 1 users too(admittedly, those are estimated to only have sold to a million and a half, so likely only a few hundred thousand still active)."
        ]
    }
}