{
    "Community reminder - if moderator attention is needed on a rule-breaking post or comment, summon us by reporting it!": {
        "title": "Community reminder - if moderator attention is needed on a rule-breaking post or comment, summon us by reporting it!",
        "score": 15,
        "url": "https://www.reddit.com/r/Wrasslin/comments/1buehcj/community_reminder_if_moderator_attention_is/",
        "content": "How's it going, e-drones and dubbalos?\n\nSeriously though, while we try to keep this subreddit low on moderator intervention, we're ALSO getting a lot of feedback that the tribalism here is getting a little out of control. Is that overblown? Well, we catch plenty in some Reddit filters, but we aren't seeing many reports from users on this stuff.\n\nWe do casually browse the sub but if you report rule breaking posts and comments, it's a lot faster than waiting for us to stumble upon it.\n\n* Post links to images, memes, and gifs that **make wrestling fun.** -- that was literally the whole reason the sub was created.\n* Don't be an asshole. Taunting and belittling other wrestling fans is not **making wrestling fun**.\n\nY'all produce some absolute banger memes most of the time and I can not tell you how much I appreciate a great shitpost. We can be that sub 100% of the time if the community helps by letting us know that we've got someone trying to ruin the party before they've already punched 5 holes in the wall.\n\nAppreciate everyone's support on this. Now please, go have fun.",
        "num_comments": 3,
        "comments": [
            "Esret,wcsdfxff,x hctw",
            "Ayo lemme be mod i have experience on multiple subs trust me 🙏"
        ]
    },
    "He's here!": {
        "title": "He's here!",
        "score": 592,
        "url": "https://i.redd.it/gq1sifc8618d1.jpeg",
        "content": "This guy is star already ⭐",
        "num_comments": 103,
        "comments": [
            "THE FRIDAY NITE DIDDLER IS HERE",
            "HOLY SHIT. THAT WAS HOW YOU FUCKIN DEBUT SOMEONE",
            "I liked how Tonga Loa and Tama Tongo even seemed unsure about what Solo had unleashed.",
            "What a fucking episode, holy shit.",
            "He went beast mode",
            "What a sign in the background",
            "I'm booking it. OG bloodline with Roman usos and Sami vs new bloodline inside war games",
            "Yes, The Friday Nite Diddler is here.",
            "What a freaking debut that was.... But yeah, Roman is coming sooner than later... I can easily imagine Solo's stunned face when Roman's Tribal Chief music hits..",
            "Ok maybe I,'m lost but what's going on with the diddler jokes? Did he get caught doing some fucked up shit?",
            "what's the lore?",
            "Hikuleo is supposed to debut soon. This Bloodline will be packed to the gills.",
            "this debut along with how Carmelo was presented are the right way to intergrate a new guy into the system, Trips be cooking",
            "Is it just me? Or did the ref tell Jacob Fatu to go after Cody Rhodes? I'm not even joking. Nonetheless, first Joe Hendry outshines the whole NXT roster and now The Samoan Werewolf just overshadowed Solo Sikoa.",
            "Jacob fatu?",
            "Wait what really? Pls tell me this is true...I just woke up no kidding! I'm gonna cry.",
            "My absolute favorite wrestler of all time!  This is crazy… I am so friggin excited for him.",
            "Tha Samoan Werewolf is finally here.",
            "What a great week of wrestling!!!",
            "He's the Samoan werewolf because of the way he speeds around during his matches.\n\n after he took out Kevin Owens he frantically look to the left and the right remembered Randy Orton was in the corner went the complete opposite way at 100 miles an hour hit Randy Orton and went through the fan barricade.\n\n😳🔥**GOOD LORD**🔥😳",
            "His debut was awesome, like, they really made him look like million bucks and he's an impressive talent, easily the best member of bloodline on the mic and in the ring (I mean current, TV bloodline), but is IWC really going to forget that he, not long ago scammed a fucking charity?",
            "Game changer",
            "I honestly that he was gonna debut at Mitb but hey he’s here sooner! Solo’s team is looking Solid",
            "I loved the debut but what was that outfit",
            "Can’t wait to see what Fatu can do. Solo’s Bloodline is almost complete. Just waiting I’m on Hikuleo now.",
            "Trimmed up",
            "think you mean THERRRRRRRRE HERRRRRRE",
            "Solo should be scared 😂 coz he ain't on the level of Jacob fatu this guy will take the spotlight in no time if they book him right",
            "Great debut. Jacob is great, he can really go in the ring. Can't wait to see what he can do in WWE",
            "Not gonna lie, Jacob stole the show and almost the entire Bloodline.\n\nHow I'm supposed to believe Solo is the chief while this man exist ? He eclipsed the others members of the Bloodline in 3 minutes.",
            "Orton being on the wrong part of the barricade kinda scared me. Fatu ran him full force to almost a dead stop on his lower back",
            "Jacob looked like a beast and he looked chiseled as hell without the weight",
            "Why does everyone keep talking about Sami he’s moved on he’s not going back",
            "So when they finally reveal the rock as solos bossI think it'll be after Moana 2 and its live action for the First One because right now he's still working on the smashing machine",
            "Its still wild that G.O.D AND Jacob Fatu are in WWE.",
            "In Saudi Arabia they are planning on constructing a building that's 16km long (called The Line - Project Neom). I am convinced this is to house the Anoai family for Crown Jewel. They'll need every inch at this rate",
            "The competition is about to get diddled.",
            "I thought it fell flat 🤷‍♂️.  The crowd could’ve cared less too",
            "They’re on different brands now, but how awesome would a Jacob Fatu v. Bron Breakker match be?",
            "As David Spade once said in a famous SNL skit where he played a receptionist.  \"And you areeee?\"",
            "Rock, Solo, Jacob & Guerrillas vs. Roman, Hikuleo, Usos & Sami?",
            "Yeahhhh another chimichanga.",
            "Diddler",
            "It was a shit debut. At least wait for a PPV.",
            "I can't believe he debuted already!!!",
            "He's ashamed of being a diddler, but he's also a champion at it.",
            "The fuck are you guys talking about?",
            "HES GOT TWO WATCHES BECAUSE ITS ALWAYS TIME TO DIDDLE",
            "In his 3 minutes of screen time he already was more impressive than the other two new members",
            "He looked like an absolute monster my gawd. I didn’t know much about him before but I’m sure excited to see how they use him he looks like a maniac. And seriously how cool has this Bloodline storyline been from the beginning to now and to what the future will bring this is some good shit pal. Plus they have the other Samoan dude waiting in the wings too it’s gonna be awesome",
            "Reminds me of when the next big thing arrived and destroyed the Hardy Boyz",
            "Yeah I think a lot of people slept on how they hesitantly raised their fingers",
            "First a great Raw and followed up by a great smackdown in the same week. Wow.",
            "I feel this is going more towards a tag team match between Randy, Owens, Cody and the New Bloodline. Jimmy might make his comeback as Roman's guy to side in with Cody and team...",
            "Who will be the 5th member for the New Bloodline wargames team?",
            "Jakob Fatu talking to Def Rebel: \"You've gotta write a song about how I do NOT diddle kids!\"",
            "Take thattttt",
            "Dr. Disrespect?",
            "I've been hoping this will all end up in a reunited Uso's along with Reigns and one or two others vs the new Bloodline to put Solo and co in their place",
            "I'm going to miss \"head of the table\" I think they're going to change it and I won't like it",
            "Look at the fan sign in the background of the image.",
            "Fan sign in the background",
            "Say his name and he appears - the Friday night diddler. \n\nClap clap.",
            "Ref told him to go after cody and before that he told him to look at camera and solo told him to hold finger up",
            "Low bar tbf",
            "Confused how Henry outshine the whole roster when he was in the battle royal for 10 seconds? \n\nAnd why people are so gassed when it was just a TNA crossover and not a signing from what I understand. \n\nEvans was the absolute standout of NXT on Tuesday putting on 2 brilliant displays of wrestling. Young OG has a good career ahead of him.",
            "Friday Nite Diddler LFG",
            "They pulled the trigger because they were done being scared they took a leap of faith that's why he was held back so long for this reason",
            "Cultaholic",
            "The sign lol",
            "hes a diddler",
            "DIDDLE DIDDLE DIDDLE",
            "He was also more impressive than Solo",
            "I honestly really like tama tonga and I feel like I’m the only one",
            "Did somebody say 3 minutes?",
            "There's a reason he's called a werewolf. Dude's probably the most vicious Samoan yet",
            "Don’t forget Joe Hendry appearing in NXT",
            "Or you know, Jey.",
            "Frank Reynolds? Is that you?",
            "So there’s another unrelated diddler in the mix?",
            "\"we want to thank drake for lending us his song heart part 6...\"",
            "If I was diddling young girls, I promise I'd have been arrested\n\n\n\nI'm way too famous for this shit you just suggested",
            "Yeah most probably we are going to see Cody, Orton, KO vs The Bloodline at MITB.. Maybe Jimmy comes in as the 4th member for Cody's team there. Or maybe Roman also shows up when the whole match is going against Cody and team.. \n\nThen at Summerslam maybe the New Bloodline vs the OG Bloodline with Roman, Usos and Sami/Cody completing that team..",
            "Oh lmao I didn't even notice, thanks!",
            "I believe in Nite Diddler!",
            "Achievement Hunter actually.",
            "👏👏👏👏👏",
            "The fuck you get that from?",
            "You rang?",
            "That’s a pretty low bar though.",
            "Damn him with faint praise why don’t you.",
            "He is gonna turn on sikoa and join Roman n the usos in the Civil war.",
            "So is Michael Cole’s acid reflux",
            "And last Saturday was Clash at the Castle if you wanna count that within the 7 day window. One hell of a week of WWE programming. ",
            "👏👏",
            "Jey is already in the MITB match.... Soooooo..",
            "Now take allll of that, spread it over tue next 12 months or so and then at next years summer slam... THE FINAL BOSS RETURNS!",
            "The sign right next to his fucking face? 😂",
            "Dear God man use your eyes",
            "There’s no need for him to turn on Solo.",
            "Oh I thought we meant for wargames.",
            "For wargames definitely it's Roman and Usos al9ngside a 4th member on ones side. I want this feud with Cody, Randy, KO at MITB. Jimmy returns as the 4th member for them and when the match is just beginning to look awry for them, Roman's Tribal Chief music hits...."
        ]
    },
    "What a week to be a fan": {
        "title": "What a week to be a fan",
        "score": 258,
        "url": "https://i.redd.it/3l1xe4n4628d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "WWE is so hot right now",
            "I wish Seth stayed away longer. It's that old saying \"how can we miss you if you never go away?\"",
            "what happened this week? Its way too insane for a road to MiTB. Also Drew \"kill\" CM Punk in Chicago",
            "don’t forget Chad Gable being fucking murdered by the Wyatt Sicks the RAW after Clash at the Castle",
            "WWE keeps on cookin', and we fans keep on eatin'.👨‍🍳",
            "HHH Era is the best in the world.",
            "DX straigh cookin rn",
            "Meanwhile in AEW\n\nI AM THE LEARNING TREE!!\n\n📖🌲",
            "What would it be if the real tribal chief returns?",
            "And blackjack mulligans return rumoured for next week",
            "order is all fucked up... Joe Hendry in NXT is the biz",
            "Wrestling is cool again because of the rock\n\n/s",
            "While the other channel is getting their worst ratings of all time",
            "The problem with AEW now is that they have good performers and good matches but without any storyline/Drama or Direction. They're just like local live event with no lightning. So AEW is now boring and so dull.",
            "Spoiler tag would have been nice...",
            "Who is Wyatt Sicks?",
            "No one cares about the wyatt sicks",
            "WWE said hey the Dub is on a massive downwards spiral, what can we do to capitalize until they correct?",
            "Thanks Mugatu",
            "tbh i think his presence was sorely missed on RAW. The matches have been good but storyline wise, the top baby face on Raw was Jey Uso lol, and as much as i appreciate Jey he’s no Seth in terms of credibility and star power. The biggest indicator of this is, currently on the Raw roster it feels like an inevitability that Gunther will win the WHC at Summerslam whether it’s against DP, or whether someone else won it along the way like a Jey or maybe even Drew. It’s only really Seth who has the credibility to beat Gunther, clean, 1 on 1. \n\nThe main title scene, while the matches have been fantastic, have kind of been angles that lack heat due to it being Heel vs Heel or just not having the proper build but Seth is always incredible at convincing you he deserves to be there and it’s always possible he wins.",
            "He has been revived for next week triple threat match",
            "Is the learning tree in the room with us right now",
            "I'm a big fan of aew but have to agree, wwe has finally got itself together (HHH has always shown promise imo, I could only tolerate nxt gold at one stage). Just hoping Tony wakes up and pulls cohesion together now they have to actually compete. It was much easier for aew when crazy vince was running.\n\nOverall its a great time to be a fan of wrestling",
            "The faction inspired by Bray Wyatt’s characters led by Uncle Howdy (Bray’s real life brother who used to be Bo Dallas)",
            "How do you survive day to day if you can't even recognise a name with one character wrong? I mean there's slow and then there's you.",
            "It’s who Tony khan is booking for. Except there’s more members than AEW viewers this week.",
            "If you say so",
            "cope harder",
            "You can derelique my balls capitane",
            "I wish Gunther turned face but theyre booking him as a monster heel so yeah...",
            "Watch Priest beat Gunther",
            "I thought he was replaced with Ilja?",
            "He could be you, he could be me, he could even be",
            "Oh you mean The Wyatt Sick6\n\nSorry I was confused",
            "You tryin to get loco esse?",
            "Gunther works as a heel, not sure he would as a face",
            "lol nah",
            "They just announced that he is cleared (probably with witchcraft) to go ahead..I think they don't want to let ilja lose (since he was announced as replacement he probably not going to win in first place)",
            "It’s fine I’ve seen them referred to by a few slightly different names (Wyatt 6, Wyatt Sicks, Wyatt Sick6)",
            "[whatever](https://media3.giphy.com/media/hiEs8sF8KoYnu/giphy.gif?cid=6c09b952ci4b8gmpg5du3qiav8i4419wcj3zabr1ig2wns4i&ep=v1_internal_gif_by_id&rid=giphy.gif&ct=g)",
            "I feel like I’m taking crazy pills!!!",
            "Gunther can work as a face but not your usual face\n\nHe doesn't really need to change much imo and that's why he'd probably do great as a face, though I do agree he's less marketable as a face",
            "Hmm I feel like he should be out for a week or two, but I'm interested to see his reaction to the attack",
            "If you watch the return announcement it looks like they aren’t actually saying he will be back"
        ]
    },
    "Crazy to think about right?": {
        "title": "Crazy to think about right?",
        "score": 763,
        "url": "https://www.reddit.com/gallery/1dlg7ej",
        "content": "",
        "num_comments": 143,
        "comments": [
            "Not all heroes wear capes. Some do get strangled",
            "All because of real glass",
            "I think if it wasn’t that, it’d been something else. \n\nIt’s like a bad marriage ending, there’s not one reason.",
            "It's one of the greatest Domino effects in history. If Hangman Page didn't go off script, does any of this ever happen?",
            "OUR SCAPEGOAT",
            "Ten months later and boy oh boy is Jack Perry a made man, mega super duper gigantic superstar household name. They sure did capitalize on this!",
            "all because luke perry had sex",
            "CM punk wanted to leave AEW long before that as he said on Ariel Helwanis show. He asked for his release after the whole media scrum and backstage stuff after that but TK refused to release him.",
            "I doubt that is why damian won the title. It would of probably happened regardless",
            "thank u tarzan boy or whatever his name is",
            "Nobody gets wrestlers more over in WWE than AEW",
            "You missed the part where he got the piss best out of him at home",
            "\"Go cry me a river\"\n\nThe words that altered history forever",
            "Thank you for recognizing the lasting impact of HOUSE OF TORTURE\n\nTHE HOUSE ALWAYS WINS 🚬🚬🚬🚬",
            "Hey man TK was fearing for his life 🤣",
            "Judging by Punk's comments about his time in AEW, it was inevitable. This one instance just happened to trigger the \"I quit\" mindset.",
            "It’s funny because not too long ago i thought Punk was the exception when they say everyone eventually comes back to WWE.  I thought we would never see him in anything WWE related again.",
            "Not even. It’s because meltzer spread fake news about Colt being fired because of Punk a year and half earlier which wasn’t even true. Then the dominos fell.",
            "Thank you Jack Perfy should be chanted world wide",
            "What were the ratings like when Punk left???",
            "Tony Khan is the kid with the biggest box of crayons but no ability to color within the lines.",
            "He’s wrestled once",
            "From real glass to made of glass",
            "1 of many aew mistakes leads to 5 gains per for wwe",
            "This is some butterfly effect or something",
            "Jack Perry booker of the year!",
            "\"I wish AEW fans would stop going on about Punk, cry me a river\"",
            "\"Let him be their problem.\"",
            "Worst time line",
            "unironically best thing aew has ever done for wrestling",
            "Thank you Jungle Boy",
            "Well yeah. It was the issue with Jack. But also the countless injuries in AEW. And the incident with the bucks.",
            "So sad he’s retired now would have been great to see him wrestling in WWE. He will get injured again in his comeback match and that will be it for Punk",
            "Butterfly effect",
            "AEW is the modern day WCW.",
            "Jeez. CM punk being out of wrestling was more of a blessing that I thought. the glazing is crazy",
            "What are we getting from Punk again?",
            "What a circlejerk of losers this thread is",
            "crazy to think this is easily the 30th time this has been brought up",
            "Jungle Jagoff.",
            "Thanks to Jack Perry mouth  and Punk fragile body we got the 2 of the  best Wrestlemania main events of all time  back to back",
            "we can thank Jericho for going to Japan, having that match with omega, and then bro tony saw that match and decided to start aew and that's how everything started. according to Jericho at least",
            "At least one of them has had more than 2 matches in that timeframe.",
            "Mark Briscoe- “Get yo ass outta here Jack Perry!!!”",
            "I don’t get it.",
            "Wrasslin fans always cry about Bret, Punk and Danielson but hate eNdLeSs samoans booking and Goldberg.",
            "Punks been on the shelf almost the entire time. I fear he won't be wrestling too much longer, enjoy him while you can.",
            "And I'm 9+ months sober of AEW's BS.",
            "You have my thanks,Perry.",
            "Listen, I’m all for WWE doing well rn, but the man hasn’t wrestled once on TV since returning excluding the Royal Rumble. Story wise, it’s great but the matches should live up to the build up. Would you guys be ok if we get all this proper build only for a mid or terrible match?",
            "Imagine being sooooooo bad at your job your boss gives you a promotion and fires the help that makes you look passable…then puts you back out there and all anyone talks about is the guy that got fired!! - Tony Khan logic ladies and gents",
            "Meanwhile AEW had 500,000 fans tune in. Gonna be a lot of fun what if documentaries if Tony had simply decided to not sign Punk and also leave ROH alone",
            "What a fumble by Tony Clown. But then again his life was in danger",
            "Tony khan let punk go because of Perry is the worst business move ever. \n\nBangers after bangers doesn't move the rating needle, we need stories and aew have none.",
            "😂😂😂",
            "And some fucking deserve it.",
            "c'mon man it's no joking matter. Tony feared for his life!",
            "Some do super kicks",
            "*choked a little bit, ftfy",
            "The get guzzled",
            "Jack Perry the hero we all needed.\n\nThanks Jungle Bungle.",
            "I didn't punch him, I just choked him a little",
            "Some get scapegoated",
            "and some get injured lol",
            "To quote Tazz \"Oh oh oh oh oh oh oh oh oh oh...\"",
            "[deleted]",
            "Yeah, he was super annoyed with the unfortunate injuries, and TK’s inability to be a boss instead of a friend was all a powder keg waiting to blow.",
            "It would’ve been real fire",
            "I mean. Why start there? You can draw this all the way back to Dr Amaan being so incompetent that Punk talked about him in Colt's podcast, for which he sued them for defamation, which is where their mutual issues started that led to ALL of this.",
            "I feel like Hangman has pretty much come out of it without any dirt on his shoes. \n\nLucky to take time off with his new born so missed a lot of the aftermath",
            "What happened?   I’m not aware.",
            "With punk? Eventually yes. This guy cannot not be an asshole",
            "Ikr? He’s doing some damn good work with the elite",
            "People here are still talking about him a bunch, so he must be doing something right lol",
            "it's not about the outcome, it's about the journey.",
            "Jungle life, he's far away from nowhere...",
            "Slowly going down, even with Can't MMA Phil there...",
            "And it's more interesting than 100 matches of others",
            "People really like hearing someone talk I guess 🤷‍♂️",
            "and yet his run while injured is more over than Perry's entire career... lol",
            "Not even close",
            "The best of Drew McIntyre",
            "Right? You’d think this was some kind major shift in wrestling. People are treating like it’s the second coming of Austin.",
            "We might as well thank Jericho's parents for having him and Omega's too. And their forefathers.",
            "I know right, it's crazy how the guy who's been on the shelf has still been doing way more interesting things then the guy who's wrestled more",
            "He's contributed more while hurt than 90% of guys who work weekly",
            "I mean, Punk did point his finger at Tony and yell at him",
            "He did not deserve to be strangled. No one deserves to be strangled by a coworker. What a Neanderthal level thought you just had.",
            "I wonder if Tony wet himself",
            "Like half of AEWs roster lol",
            "Real Glass Jones over here",
            "You forgot an exclamation mark",
            "he has to deal with what he has. if he chases them out whos left?",
            "If I remember correctly, Hangman went off script about Colt Cabana, Punk assumed The Bucks spread that rumor, then he got injured and TK didn’t want him to drop the belt but Moxley refused to take the first pin so he had to drop the belt quickly.\n\nI’d start hating that place too.",
            "I think a boss being a friend is not necessarily bad, but when you're dealing with a lot of egos like a wrestling locker room, you really need to assert your authority.",
            "He was pissy because he wanted to be treated like the undertaker, but no one in AEW, apart from Tk, saw him in that way. How the hell you gonna tell the owner how to run his company? The guy has always been a walking time bomb and do not be surprised when he shit the bed again in WWE.",
            "I mean. Why start there? You can draw this all the way back to Jean Baptiste Point du Sable founding Chicago which eventually led to Punk's birth.",
            "Boots*",
            "He took a shot using Colt Cobana's situation, using it as a \"I'm protecting the company from you\" narrative and unravelling as a babyface - Punk was still getting huge babyface pops so it made sense that someone was going to have to get a little heel. It was good too as Punk's title win was inevitable and Punk had gone up against similar barbs when he faced Eddie Kingston. \n\nPunk took umbrage with it however as ~~1. He wasn't present in the building during the aforementioned promo~~, 2. He hadn't personally cleared it and 3. Convinced himself that Hangman was going to work uber stiff and hurt him.\n\nEverything could have been easily sorted out by sitting down and taking to each other.\n\n*Edit* As mentioned by someone below, he did the promo to Punks face, it was Punk who responded eventually by doing a promo without Page in the building.",
            "The man is literally fireproof!",
            "Just because someone's talking about you, doesn't mean that translates into viewership or being more over. At the end of the day, Jack Perry has a ceiling due to his lack of promo ability and refusal to work his size.",
            "We also talk about Lio Rush. Being talked about on this sub is actually a pretty low bar to clear",
            "Exactly! As he might love 5 star matches, he is making the audience match that number also - starting with 500k this week while the rookie brand made 715k and has the most seen video in wwe's year to date.",
            "this x infinite",
            "It's almost like he's only 27 years old 😱",
            "Ehh he's featured regularly, has a hot gf, and is likely making really good money. I'd say he's doing pretty well. Not everyone has to be a world famous, household name to do well in wrestling or any entertainment.",
            "I've been a punk fan a very long time, but i've equally enjoyed Jack's new heel run.",
            "You sound like someone who's been strangled by a coworker",
            "In a corporate setting? Sure, and yes you'd be right. Wrestling? MMA? Any form of sports? These aren't stages for intellectual discourse...and things tend to get a Lil heated at times. \n\nAlso, seeing how it went down...I'd say Ol' Punk handled it pretty well considering he could've punched his damn face in by the time the other folks built a human wall to separate the standing punk and the wall splattered Perry. \n\nSeriously speaking tho, the fault lies with both parties but  all of it could've been avoided had the upper echelon been responsible and authoritative. \n\n1) Why did Tony(Schiavone) and the producers have to go to Punk to stop Perry from using glass on Collision?\n\n2) What gave Perry the confidence that he could cuss out all those folks, and not listen to their advice; which mind you was reasoned with his safety in mind, and avoiding stuff that's lead to Backlash and bad rep with the network.\n\n3) Why did Tony K. not get both those guys in a room and address the issue, not only that, during the \"Punk got Colt fired BS\", why didn't Tony address that to the wrestling fart sniffers that we call wrasslin journalists?! It's more like the bully in the class getting the confidence to be a nuisance repeatedly cause the teacher turned a blind eye. Then the unbothered kid one day decides he has enough, takes that bully down with a single punch, and the principal comes in,  and does a Pikachu, suspending the one that actually stood up for what's right.\n\nTony should've known better after the whole locker room brawl incident.",
            "Neanderthals were likely less violent than homo sapiens, hence the extinction of the Neanderthals. Neanderthal dna is present to this day in homo sapiens however, as we also banged them into becoming us.",
            "Everyone deserves whatever they get when they step to someone bigger than them",
            "Jack Perrys alt has been found",
            "But I digress",
            "I'd be pissed off if the entire company around me just decided to try and sabotage every thing I was doing to help the company, and kept jumping to the conclusions that Hangman did rather than just address/discuss the issue or try to move past it for the sake of allowing the company to thrive. There was no need at all for it, and it wasn't entertaining or something any fans wanted. The difference between the kind of shoots Punk did, and what Hangman did, is huge. A shoot promo done well serves the fans desire to hear that reality spill out, and engage people in the product, this wasn't of any value to anyone. Punk's Pipe Bomb elevated WWE and re-engaged lapsed fans. Hangman shot a hole in AEW's own hull.\n\nPunk was taking AEW to a new level and helping people. He wasn't ruining anything. He was fucking helping. He helped Darby, Ricky Starks, FTR, Joe and MJF, he took their best stars even higher. He was doing his job perfectly. \n\nThe Bucks and Hangman haven't been in a professional environment for a long time and it started to show last year.",
            "It's when that boss tolerates shit from his friends and doesn't do anything about it.\n\nNothing erodes respect quicker than a boss with a bunch of favourites who they just tolerate and let run the place no matter how damaging to the bottom line they are.",
            "This is the key ingredient that seems to be missing from TK.",
            "I mean. Why start there? You could draw this all back to the existence of India, which Columbus was seeking and accidentally discovered America, which led to Chicago being founded and which eventually led to Punk's birth.",
            "Phil Chick Magnet Punk Brooks du Sable Lake Shore Drive\n\nWe will call it Lake Shore Drive for short",
            "You are mostly correct, but if you are referencing the “Worker’s Rights” promo, Punk was in the building and in fact in the ring with Hangman when it happened.",
            "idk why you’re getting downvoted, this is what happened",
            "He's been getting better at talking, and he absolutely works his size with how is offense is more acrobatic than being a powerhouse kind of wrestler.\n\nI just don't understand the focus on him by so many here, and why they hate him so much.",
            "Wasn’t Brock Lesnar insanely over and winning a world championship at like 25 or something? Perry is not worth the hype he gets lol",
            "Sounds like he had it coming with racist comments like that.",
            "The real reason is because TK wants to court controversy to drive interest. And ok, that works sometimes. But when it blows up you also need to be authoritative and fix it. Which he is incapable of.",
            "I mean. Why start there? You could draw this all back to the existence of man, Alien race creates man which led to Chicago being founded and which eventually led to Punk's birth",
            "This will teach me to rely on my memory in the early hours. I must have gotten my wires crossed; it was the other way round as Punk eventually did a promo in response while Page was out of the building.",
            "That's your opinion but I don't think it's shared by the majority. His mic skills still suck and his match against Dustin didn't show a slimy undersized heel. \n\nAs for why he's disliked, well personally dude has his head up his ass because of who he's friends with and needs to humble himself.",
            "Don't understand? The dude is almost the sole reason AEW lost their biggest star, and helped the rival company become hotter than it's ever been. How can people NOT talk about him, and it's not in a positive light whatsoever lol",
            "500k",
            "People want any reason to shit on AEW.",
            "Cena won his first WWE title at 27 too",
            "Perry gets hype?",
            "Even Randy who struggled as a babyface when 25 had shown enough promise that you could see why they'd invest in him. Imo Perry has shown nothing that makes you think he's going to be a big star.",
            "True, adding to that, he'd rather clean spilt water than make sure that the pot doesn't overfill. That brawl out, brawl in whatever...both of those incidents were not something that started in the morning and fizzled out by night. There were signs going back weeks and months. His authority isn't respected, the \"talent\" that he has given power to aren't impartial, they fail to separate personal and business...he must realise, it's his company. He owns it. He runs it. If he feels an issue needs to be addressed, he needs to air it out, and have his people definitely solve it. It isn't asking for a compromise, but an order. Wasn't there news that after the locker room thing that the bucks refused to mend things up in person...Who the fcuk are they to refuse the boss?! Either they comply or pack up.\n\nSounds like a tyrant? Good. At least better than a king that treats his crown as a toy, letting courtiers, plebians and criminals think that they can walk over him.",
            "True, adding to that, he'd rather clean spilt water than make sure that the pot doesn't overfill. That brawl out, brawl in whatever...both of those incidents were not something that started in the morning and fizzled out by night. There were signs going back weeks and months. His authority isn't respected, the \"talent\" that he has given power to aren't impartial, they fail to separate personal and business...he must realise, it's his company. He owns it. He runs it. If he feels an issue needs to be addressed, he needs to air it out, and have his people definitely solve it. It isn't asking for a compromise, but an order. Wasn't there news that after the locker room thing that the bucks refused to mend things up in person...Who the fcuk are they to refuse the boss?! Either they comply or pack up.\n\nSounds like a tyrant? Good. At least better than a king that treats his crown as a toy, letting courtiers, plebians and criminals think that they can walk over him.",
            "True, he can't seem to figure out when to turn a blind eye and when to put his foot down. I get they cater to the smart, internet stimulated audience, but at times, he seems to seriously overvalue his \"friends\". Punk & Elite stuff, and the Punk and Lil Tarzan stuff...got the people buzzing and got the bad rep from the industry...meh, happens. Now had TK ordered, instructed, and addressed them to mend things and work together...he could've made some serious bucks. What did end up happening? He asked them to mend ways, they didn't...yet continue to milk the topic every now and then...if Tony passively agrees with that...then 1) he's immature, 2) he's bitter abt losing Punk, 3) he's convinced AEWians would appreciate. \n\nAll of those could be true but imo what he fails to realise, by doing so, his vast company is being fragmented...those that want to pander to the crowd, those who don't, those without spotlight, those in only for the money....all of these people in it for their own interest. Fine, every company has those, but, in every company the staff knows that I must not piss off the boss, and stay in line.  With how he's handled things its more like his instructions are treated as greetings that you'd ignoredly exchange with your coworker in the hallway.",
            "I mean. Why start there? You could draw this all back to the Big Bang, which created the universe as we know it, which led to the existence of man and Punk's birth.",
            "Brother ive been watching since all in 1 which i was at live... there are plenty of reasons to be down on AEW right now and ignoring them is whats killing the company",
            "Well who started the tribalism? Why stop now?",
            "I know, I’m surprised too",
            "I thought you guys said the company was already dead, 3 years ago.",
            "They are saying it every few months",
            "How’s those ratings looking?"
        ]
    },
    "\"How dare you, a Raw superstar, come and beat up a fellow Raw superstar on SmackDown!\" ": {
        "title": "\"How dare you, a Raw superstar, come and beat up a fellow Raw superstar on SmackDown!\" ",
        "score": 122,
        "url": "https://i.redd.it/eonrcf7mf28d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Drew's not a Raw Superstar - he quit.",
            "\"i never say you shouldn't beat him up, I'm just saying you should do it on Monday!\"",
            "Ok so the draft concept lasted a lot longer this time but it ended the moment Punk showed up on smackdown",
            "Drew did the Larry David SNL thing.\n\nQuit.  Regret it.  Show up at work like nothing happened",
            "This is why I don’t give a shit about the draft.\n\nIt’s always just tossed to the side after a few months.",
            "I loved how they mentioned the extra security at the building last night, but still somehow managed to have a guy who quit, attack a contracted wrestler, and carry his unconscious body through the arena and out onto the stage. \n\nThe extra security clearly received no training prior.",
            "This was so stupid",
            "Ah shit how right you are ",
            "Surely he should have handed his backstage pass in, then? I think that WWE should take him to court to reclaim their property if he's still holding onto it. It's very unprofessional of him and I can't see them giving him a good reference when he's looking for a new job.",
            "He’s trying to pull a George Costanza and pretend that he didn’t quit",
            "So he's not officially signed to either show, making him a regular civilian, who broke into an arena without a ticket, and assaulted a performer...\n\nEffectively the same as jumping the rail.\n\nWonder if he'll face prison time for all this\n\n/s",
            "Eh, they're in Chicago and he's not yet cleared to wrestle so he's kind of in a brand limbo right now. I'll allow it. ",
            "\"Fuck you and I'll see you tomorrow\"? ",
            "Yeah lol. But didn't Heyman say they were for the Wyatts? They were probably told to look out for creepy dudes in animal masks so they saw Drew and were like \"Nah he's good\" but then took action once Aldis told them he was not in fact good. ",
            "Seriously. My keycard at work says it must be returned at end of employment with the company. I’m sure WWE won’t accept this nonsense Drew",
            "He was outside the building and the door attendant let him in. That falls on Aldis. Tsk tsk.",
            "But wasn't he drafted to Raw?",
            "He came back to do an exit interview.",
            "Imagine him showing up and you're the security guard. You let him in. The other security guard turns to you.\n\n\"Hey, didn't he quit last week? Shouldn't we have checked his pass?\"\n\n\"You want to go and ask to see his pass? Just shut the fuck up. We don't get paid enough to ask Drew McIntyre if we can see his pass.\"",
            "Yeah I'm aware he signed with Raw - I even acknowledged it in the title. But he's not active right now so as I said he probably has more freedom than active wrestlers. That's why we've seen him sometimes in an announcer role like the WM40 kickoff show. Idk I'm just coping trying to make sense of it all.  \n\n\nEdit: Or did they say Aldis had to clear it with Pearce to have Punk guest appear? I can't remember every little piece of commentary on the show. ",
            "Places the company can improve: Stop that darned Charles Michael Punk from interfering in other employee’s projects",
            "Yeah it's no different than Cody showing up on NXT, it's just a treat for the Chicago crowd since they weren't on RAW. Plus, like you said, Punk isn't medically cleared to compete yet so he has that freedom to pop in where ever he wants like he did at NXT Battleground. As for Drew, he \"quit\", which means he unofficially quit RAW, so he too is in brand limbo at the moment. I say it all checks out.",
            "Hey, it's Charles Montgomery Punk!"
        ]
    }
}