{
    "This sub has moved to r/Xbox, join us there for all your Xbox content and discussion!": {
        "title": "This sub has moved to r/Xbox, join us there for all your Xbox content and discussion!",
        "score": 0,
        "url": "https://www.reddit.com/r/XboxSeriesX/comments/1d5lf25/this_sub_has_moved_to_rxbox_join_us_there_for_all/",
        "content": "r/XboxSeriesX and r/XboxOne have merged with r/Xbox to have it be your one stop shop for all Xbox content on reddit. Certain things are still in separate subs like all tech posts in r/XboxSupport , but for all your news and discussions around Xbox will all be centralized in r/Xbox!",
        "num_comments": 0,
        "comments": []
    },
    "Xbox Games Showcase Followed by Call of Duty: Black Ops 6 Direct": {
        "title": "Xbox Games Showcase Followed by Call of Duty: Black Ops 6 Direct",
        "score": 86,
        "url": "https://www.youtube.com/watch?v=ZZ6gafqCjsY",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Senua's Saga: Hellblade II - Official Launch Trailer (ft. Animal Soul by AURORA)": {
        "title": "Senua's Saga: Hellblade II - Official Launch Trailer (ft. Animal Soul by AURORA)",
        "score": 609,
        "url": "https://www.youtube.com/watch?v=PRbOmIcVXak",
        "content": "",
        "num_comments": 325,
        "comments": [
            "[removed]",
            "My body is ready!\n\nMy mind, not so much.",
            "[removed]",
            "Who is PUMPED!   \n\n\nLooks incredible. Reviews drop tomorrow at 9am BST.",
            "wow 6/10 from gamespot",
            "My boss has just approved me to have the day off tomorrow, can't wait! Let's go",
            "I feel like there was already so much negativity in the discourse surrounding this game after reviews dropped and people started getting their hands on it. Well, I'm just about half way through and I'm puzzled. This game is fucking incredible. It's exactly what Hellblade is. And it takes the experience to a whole new level. \n\nI'm now convinced that everything Microsoft published is going to be under appreciated. There very much appears to be an understanding in games journalism that feeding the hysteria gets more clicks. So they are no help. PlayStation has the biggest voice of gamers, so their negativity surrounding Xbox, the acquisitions, and anything released exclusively on the console ultimately results in a toxic cloud hanging over every game release. But even the Xbox fan base feeds the hysteria if a release isn't \"better than [similar game on PlayStation]\". Because people seem disappointed that Hellblade 2 is like Hellblade 1, rather than the \"better than God of War\" game that they apparently wanted it to be. \n\nBut as a fan of the first game, I'm loving it. And I honestly appreciate the variety in Xbox Game Studios releases. From Psychonauts 2, to Pentiment, to Hi Fi Rush, to Hellblade, and Starfield, there is so much variety that is severely lacking over on PlayStation this generation. Not that I haven't enjoyed games like GoW Ragnarok or Horizon Forbidden West. But there haven't been any games from Sony that actually surprised me this generation or felt like a unique offering within the industry (Returnal being the exception). \n\nI dunno. I think too many people aren't taking the time to truly appreciate some of these games that Microsoft is actually publishing.",
            "[removed]",
            "Dang, I like this trailer. Aurora has a seriously haunting voice to go with these scenes.",
            "Barely anyone talking about this game even on an Xbox sub-reddit. Sad.",
            "I'm like 40% of the way through the first one and thus far am unimpressed outside of the graphics and sound design. Such a boring game IMO - am I stupid for not getting it? lol",
            "Awesome trailer",
            "I can't hear the voices over the ones I got in my head already 😑",
            "Need to finish Gotham knights so I can not keep leaving games unfinished.\n\nDo people recommend playing hellblade 1 first?",
            "Man, this looks so damn good",
            "I’m excited but there is part of me that feels like this may just be a walking sim lol\n\nI loved the first one, so I’m hoping I have the same kind of enjoyment as that and then some.\n\nCan’t wait!",
            "Can’t wait. Will play this once I finish Indika.",
            "One of the best looking games I’ve ever seen, but also one of the worst games I’ve ever played.  I have close to 3 hours in the game. Does it get better or is it pretty much the same for the rest of the game.",
            "I got bored 30 minutes in and unistalled. Cinematic and slow walking, boring.",
            "[removed]",
            "It's an outstanding walking simulator.",
            "Wow looks great",
            "I'm sorry but I gave up after 20 minutes of trying to play this game. It's just this weird auditory and visual assault on my senses that's very harsh and grating for no reason. This is more like a modern art installation rather than a video game. Some people might love it for that fact, but it's just not for me.",
            "Where is the Music of Heilung?",
            "Looks incredible. \n\nWill play it for sure",
            "Can’t fucking wait.",
            "[deleted]",
            "Pardon my ignorance, not trying to undermine the AAAA work and obvious love that goes into these games, but as someone who didn’t play the first one, is there actual gameplay or this an interactive story-driven tech demo?",
            "Welp, if I were at Ninja Theory right now, I'd be updating my resume, studio's not going to be there in 2025.",
            "My xbox is about to blow up with these graphics",
            "This game is amazing.",
            "tried this game the other night \n\nbasically a crazy psycho over powered bit** walking simulator, I literally dozed off walking (limping) across the shore. Absolutely over hyped, basic combat but hey great graphics right!?!",
            "Straight trash",
            "Man, this game poopier than the first one, how many millions did Microsoft pay for this glorified tech demo? \n\nlol",
            "I'll be skipping this one, unfortunately I did a bit too much acid in my twenties and not a fan of the pseudo auditory hallucinations. Hope everyone else has a blast with it, looks incredible.",
            "Unplayable, needs more marketing ;)",
            "I got a new headset just for this",
            "Graphics on this are insane. \n\nTook a min to get used to the letterboxed approach, but it's so cinematic, and now I'm loving it. \n\nIf the length is anything like the first one, I'll probably beat it by the weekend.",
            "But guys they aren't advertising the game. /S\n\n\nReally hyped for the game and can't wait.",
            "The first game absolutely blew me away, though I'm still not done with it, recently finished the Sea of >!Corpses!< So I've still got around 1 hour 30 minutes. By all means, the first game is a masterpiece. I'm so pumped for this one.",
            "if this were a Sony exclusive game, it would have been an instant 9 and goty candidate.",
            "Tried earlier to make a post to say that 30fps is completely unacceptable but was blocked.  For avoidance of doubt, I downloaded this and after finding out it it was 30 (after 1 min) immediately deleted it.  The current gen (series X) is a joke. 30 fps is NOT acceptable,",
            "From all accounts thus far, this game has appeared to be a labor of love from Ninja Theory. The game looks remarkable from a visual standpoint, and will likely perform well with critics. Why has Microsoft seemingly left the game to come out so quietly? A launch trailer a few days before release doesn't count. They need a win right now and some good press. They should of thrown more money at the marketing for this game. I just don't get Microsoft these days! They'll probably shut NT down for all we know after this.",
            "Xbox can’t make games",
            "60 FPS or no deal.",
            "Is the New Zealand trick gonna work for this?",
            "Fantastic trailer. Goosebumps. Wish it was on PS5. Damn",
            "Garbage.  And I loved the first one so much. They stripped away just about everything that made the original special.\n\nCombat is dumbed down even more than the original’s. - the narrative is nowhere near as good - I can’t be made to care about any of the side characters - senua’s voices are just a distraction at this point; they don’t offer any actual insights into her mind, and they NEVER stop.\n\nI could forgive the clunky combat, the letterboxing, the short playtime, IF they actually elevated the areas of the game that made the original special. They failed. This game is little more than a UE5 tech demo.",
            "Should I turn off Dolby atmos for headphones when playing this game?",
            "Someone tell me the size if the game",
            "It's a digital release.  What.  The.  Fuck.",
            "story: natives dont upset karen she can do away with murder",
            "Best game so far this year",
            "Great can't wait to see ninja theory close after this disappointment",
            "Yo",
            ".",
            "The sound design in this game is crazy good",
            "Incredible game. I could barely get thru the first 20 minutes of gameplay without entering photo mode 67 times",
            "Is this any good this game?",
            "[removed]",
            "The game is getting skewered by reviewers. Game looks like a better looking Ryse: Son of Rome. A boring interactive movie. I liked the first game all right but this ain’t it Chief.\n\nNice tech demo I guess for UE5 though but this is the end for Ninja Theory. They are fucked.",
            "Going to be a real shame when people write this game off due to some random numbers from online douches without even playing it for themselves. \n\n  \nThis is an xbox exclusive folks, it's not going to be some critic's darling.",
            "A lot of screaming and mouth agape in awe of one's surroundings ",
            "I can’t wait to play this game, l recently just came back to Xbox, I bought an xbox series x and this game looks amazing, I never played the first one..!",
            "So I just quickly popped on to play this game (I've not played the first one) this isn't usually my type of game, but my god what a fucking great looking game, everytime I move forward in the game I just can't help but stop and look at the world.",
            "fantastic game. xbox, finally!",
            "Ehhh song didn’t really vibe with the game but excited about the game",
            "The reviews I've been seeing are ruthless. I get the impression if this game was a Playstation exclusive, these same reviewers would be giving it perfect 10s like they do with similar Sony games.",
            "So, no 60fps? Pass.",
            "I hope theres a mod or ini to remove the letterbox on pc",
            "I'm super pumped! My pp is hard. My nipples are hard.\n\nCan't get any more pumped than that.",
            "lets hope they dont get shutdown after this games \"success\".",
            "Randy Orton walking sim",
            "This is embarrassing.  This game looks fine with its limited colour palette but it is the most basic combat I’ve played in years.  This is no game. It’s a walking simulator. How the fuck is THIS what we are served up after 7 years ? How is this getting a meta critic of 85? \n\nAm I crazy or is this one of the most basic, lame games from a gameplay perspective? I had to take the headphone off to stop the incessant chatter. \n\nThis is garbage.  Close Ninja Theory now.\n\n(I am about 85% through this disaster of a game)",
            "30fps in 2024? \n\nNot interested.",
            "Graphics look incredible. I think I might replay this one several times.",
            "looks AMAZING. but i won’t play it because the subject matter is just so fucking niche. it’s a shame to see so much money thrown at a game that so few people will actually play.",
            "I don't get the hype for these games, just release a show if you want to make a show. The gameplay was ass I barely got thru the first game.",
            "Remember to buy the games you like. Support your game studios",
            "I’ve never played. Should I pick it up?",
            "Weird that there's no review thread like other gaming subs have\n\n\n\nI guess that everyone here is just too busy playing it atm to make posts about it *(which is probably a good sign)*",
            "The first game I thought was solid. I love Ninja Theory but didnt find it anything beyond that. But this game has blown me away in so many ways. The themes, the story…its seriously like an action horror epic. A “zombie” kind of game but with a new take on it.",
            "This game is incredible. I’ve completed it twice.now I’m at a loss. What do I play now? Everything else will be a disappointment",
            "Looks sick",
            "Really weird song choice. I’m sure the lyrics were appropriate but the song just felt so out of place.",
            "Be interesting to see the sales figures. I would have bought it but I'm delighted it's on gamepass. I can't imagine many folk that are gamepass subscribers won't at least download it to have a look at.",
            "Please support and buy the game",
            "Haha man, I just played the first game again in the last week and was reminded there are some seriously tough scenes to get through.",
            "Oh yeah, my mind is going to be messed up. However I think I am ready?",
            "Hype",
            "[removed]",
            "Super pumped.\n\nWhat time is the release tomorrow for UK?",
            "I’m hyped!",
            "Luke Stephens has his first impressions up now and he is not impressed outside of visuals",
            "Not pumped specifically because of the reviews dropping alongside release. It could be the perfect game and that is still some anti-consumer bullshit",
            "Did you tell them that it was for playing Hellblade 2?",
            "Aren’t scores right around where the first one was? Why would there be negativity? I finally got a chance to play last night for an hour and I’m really enjoying it. With headphones it’s insane. The graphics are probably the best graphics of any console game. They are insane, especially the faces",
            "Xbox dreams of making games like Sony does bro what’re you on all the games you listed from Xbox absolute dogshit",
            "[removed]",
            "maybe it’s too dam short to the point nobody talks about",
            "What you see is what you get. It leans heavily into making you hear the voices (you should be using headphones) and grasp a presentation out of a fever dream. If you aren't impressed by those aspects, I don't think the rest of the game will grab you.\n\nI thought it was very cool but it definitely isn't for everyone. You shouldn't expect to like every well-received game either. Tastes are subjective.",
            "The best comparison I can make is that Hellblade was Xbox's Order 1886. Amazing graphics, simple, linear gameplay.",
            "No its a very overhyped game that has a cool audio features and not much more",
            "I thought the first game was solid but not amazing. The sequel is blowing me away",
            "I also felt the game was extremely over rated. Tried to play through it twice and always lost interest.",
            "I am with you buddy, I didn't really like it very much.  Didn't take the time to finish it.",
            ">Need to finish Gotham knights\n\nCongratulations, you're the first person to ever say that.",
            "yes its short",
            "Pretty much the same throughout. 90% walking through pretty scenery with a bit of combat and basic puzzles.",
            "Hey, that means you were already half way done! I kid but the game is only like 5 hours. lol. You can finish it easily in an evening. The game is already basically buried. Sadly.",
            "Well isn't that what everyone wanted? To copy Sony",
            "It's an outstanding rocking simulator.",
            "It's not for no reason though. Senua has a mental illness and that's how it is portrayed. Voices in your head, visual haalucinations, that sort of thing.\n\nThat being said, I totally agree that it isn't for everyone and it is....maybe not aggressing, but it's invasive to the senses. Just wanted to say it is by design and integral to the character.",
            "We might hear it in some other trailers. And I'm certain it's in the game.",
            "Just saw them play at Red Rocks Amphitheater. Can’t wait to hear their music in the game.",
            "It’s been on previous trailers and they performed one of the songs at the game awards",
            "I have the same problem. I couldn't play the first one, and I'm sure I won't be able to play this one. I guess I'm sensitive to the ASMR in this game. Shame. I wanted to play both of them.",
            "It’s a tech demo with a story.",
            "It's like a modern art piece, it's not trying to be a game it's trying to do be an interactive movie.",
            "The first one had constant combat, exploration and puzzles",
            "No chance. No other game has topped these graphics. Ms will keep them around just for their graphical prowess. They may get more involved in their next project to ensure it’s more of a commercial success but you don’t get rid of ppl that can make those graphics!",
            "Honestly, I suffered playing Senua 1 lol. Great game but too scary for me.",
            "5 -6 hours you can beat it in a day I already beat in the morning",
            "They aren't lol and that's always the bad sign",
            "This is the bare minimum. Literally a trailer telling you the game is out tomorrow.\n\nWhere were the previews, the posters and billboards, the tv adverts, the trailers before films?",
            ">Heheh, they've just released a trailer, checkmate doubters!",
            "[deleted]",
            "Ps5 couldn’t do these graphics",
            "Game so bad mf start lying now 😭",
            "Just get a ps5 so you can play some actually good games",
            "Cope.",
            "After playing the game, Microsoft would have been foolish to promote this game",
            "This game is a husk of what it should have been.",
            "No, it’s launching same time everywhere, it comes out in the middle of the night in NA",
            "No - global release time",
            "It'll come to PS5 eventually. I'm playing it now, not too impressed so far. The graphics are absolutely phenomenal but that's about it, I'm kinda bored already.",
            "Thank you for your submission. Unfortunately, your post has been removed for the following reason: Self-promotion is prohibited without the consent of the mods. Selling, trading, begging, and advertising of any kind are all also prohibited. All user created content should be free from links to or mentions of outside channels and hosted on reddit natively.\n\n[Please see our entire ruleset for further details.](https://www.reddit.com/r/XboxSeriesX/wiki/rules)",
            "It’s not even a good game though. They stripped away just about everything that made the original special.\n\nCombat is dumbed down even more than the original’s. - the narrative is nowhere near as good - I can’t be made to care about any of the side characters - senua’s voices are just a distraction at this point; they don’t offer any actual insights into her mind, and they NEVER stop.\n\nI could forgive the clunky combat, the letterboxing, the short playtime, IF they actually elevated the areas of the game that made the original special. They failed. This game is little more than a UE5 tech demo.",
            "That's because when Xbox actually makes a good game that becomes a critic's darling, like Hi-Fi Rush, they speedrun shutting down the studio.",
            "Xbox exclusives get middling reviews because they’re often mediocre.\n\nYou implying there’s some sort of vendetta or bias against Xbox is hilarious fanboy nonsense.\n\nThis game will get in the 70s as well because it’s a walking simulator with zero atmospheric variety. Trudge through the forest and dark beach, meet an enemy, cutscene, basic puzzle, rinse and repeat.",
            "> This is an xbox exclusive folks, it's not going to be some critic's darling\n\nHi-Fi Rush: i know i am dead to Microsoft but am i dead to you? 😡",
            "Going in with an overly positive bias isn't any better. You shouldn't want to be liking something just because it's an xbox exclusive, or because you want to like it, or because of some logo/franchise, but evaluate it on it's own merits and complete context.",
            "Different stokes aint it. I won't be playing it and writing if off because I found the first one incredibly uninteractive.",
            "First one is on gamepass so no reason not to! Unless you don't have gamepass I suppose lol",
            "Great looking is the only thing great about it, sadly.",
            "lol are you serious?  Don’t you remember the order 1886?  What about Detroit or beyond two souls? if this game was on ps, it would score the same.",
            "Whatever helps you cope. ",
            "They actually destroyed The Order 1886 which was playstation exclusive.\n\nAlso, hellblade 2 is reviewing the same as hellblade 1 did. Take off the tinfoil.",
            "Try 20 lol",
            "On console that’s what every current gen game is or will be. So you’re gonna miss out on the next gta? Cool",
            "?? You don’t play any games with niche subjects?",
            "The game is 5 hours long, people are done with it already",
            "with GPU, it's always on sale for less than a Starbucks macchiato. you can always buy it, unsub and play it in Microsoft's ecosystem some other time.",
            "? Isn't Microsoft 's modus operandi about Gamepass subscription first and game sales second?",
            "6 hour game.  Ill just sub real cheep into gamepass pc.  Play for a day, then unsub once again.",
            "[removed]",
            "https://preview.redd.it/a6ewpsu30l1d1.jpeg?width=3840&format=pjpg&auto=webp&s=acbc8346273cf344bf62274d9d590e1d35d109d0\n\nSame time as the reviews I think ☝️",
            "This happens all the time, games like Doom 2016, TOTK, and Elden Ring had embargos similar to this. This is also a story heavy game so giving out spoilers before people can access it isn't the best idea.",
            "Yeah, since he'll only need to book off one day.",
            "Yes, the metacritic is about the same. But I'm talking about the general discourse surrounding the game and what is actually being criticized.",
            "Well, the fact of the matter is that I own all of the major consoles and play them mostly equally. And on the PlayStation side I see a game like Spider-Man 2 getting heaps of praise. But that game kind of fucking sucks. \n\nHow can anyone who actually cares about gaming as an enthusiast think that the games I listed are \"dog shit\"? Lol. In reality, Sony fanboys dream of Sony actually going back to releasing titles like the games I listed. It's why something like Sea of Thieves is a best seller on PlayStation after the fanboys insisted that it was shit and that Xbox \"has no games\". Lol",
            "[removed]",
            "Probably. Gameplay is very repetitive unfortunately. But I like the stories and the character development.",
            "Thank you.  I might go back to it when I’m in the mood to look at the graphics or check out photo mode.",
            "PlayStation games literally have some of the best gameplay, Spiderman? God of war? Horizon? Ghost?",
            "They rode that crutch hard enough in the first, ultimately it's still a video game, it's still supposed to be entertainment.",
            "Lmao why the downvotes?",
            "I would not say constant combat.. it had combat... sometimes... It did have exploration and puzzles but some people call it a \"walking simulator\" haha.. Saying that I do tend to lean more on it being an \"interactive story tech demo\" than a game with gameplay.. Up to you if that's a bad thing or not \\*shrug\\*\n\nI'm excited to get off work for it.",
            "So that's the narrative huh? MS not building hype at all for it so it must be terrible. \n\n  \nSo I guess the standard now is if a game isn't blasted all over billboards then it sucks.",
            "Hellblade has been all over Reddit, Instagram, YouTube, the Xbox dashboard, in its own dedicated limited-edition jewelry collection, in specialized studies with health neuroscience professors at the University of Cambridge, through social media influencers being invited to their film set in Iceland to promote the game, in interviews and story recaps at gaming sites like IGN, and even in commercials in the NBA conference semifinals.\n\nThe no-advertising bullshit is literally just echo chamber confirmation bias.\n\nOh, and also the armchair marketing directors who are stupid enough to think a depressive character like Senua who represents grief, despair, and severe mental health trauma, really belongs on a bag of Doritos.",
            "You’re saying this right under a brand new trailer bro. Go to YouTube and search Hellblade 2 trailer and see how many come up.\n\nDid momma drop you on yo head?",
            "It's insane this \"no marketing\" narrative is still running rampant. There were previews. There are posters. There's been TV adverts. There's been trailers before films. There's been lots of ads on websites such as this. There's social media posts and Xbox Wire articles. There's been quite a lot of marketing for this game that has ramped up considerably the last two weeks. Just because you don't get out much or choose to bury your head in the sand doesn't mean the marketing isn't there. Then you've got all the people who actively block ads then complain they don't see any ads.",
            "Not every game needs that. I am less interested in a game the more it is shoved in my face. \n\nDrop the console wars already. It's 2024.",
            "You're blocking ads, of course you'd think that.",
            "You're literally on a thread about an advertisement for the game.",
            "nah, coping for London Studios, not for this game.",
            "It's soul crushing and not because of the themes. It's so boring. I almost quit every time a puzzle slows me down. Nothing drives me forward.\n\nThe Mental iilness aspect is strange to me (I'm suffering myself). How can she have all those insidious voices in her head and be all Lara Croft action heroine-ish?",
            "Don’t know why i was downvoted",
            "Wow, u just described 99% of PlayStation \"game of the year\" exclusive, interactive movies.\n\nDon't act like there isn't bias, to deny it that is fanboy shit. IGN and other sites have shown their xbox bias plenty of times",
            "Yeah i do but since i saw that this one was coming out soon never really tried playing the first one..! I just got my new xbox 2 weeks ago..!",
            "It doesn't have to be that way. There's some games that have 60fps on current gen. Most of which are on PS5, but they still exist. Why settle for mediocrity? Shouldn't we be past 30fps in 2024?",
            "of course i do. and i love them. this particular niche is not for me though. and it’s objectively odd to see such a niche title with such a budget behind it.",
            "[removed]",
            "Awesome. Cheers.",
            "Reviews are an hour ahead of launch.\n\nedit: yes, this seems to be incorrect. Several reviewers posted saying that the embargo lifted an hour before launch. This wasn't just a random opinion on what was happening.",
            "[deleted]",
            "I mean doesn't matter if the game ends up being good or bad, it's still heavily anti-consumer",
            "[deleted]",
            "I really wish this was true for me. First game has taken me 6 hours throughout 4 days and I'm still not done, I think I'm like 2 hours away. I'm just so damn busy with work stuff and when I'm not, I'm far from my console and I'm stuck in an environment where I can't do much.",
            "I don’t pay that much attention. Reviews are good so I decided to give it a shot. Not reading into the comments random ppl on the internet are making.",
            "Spider-Man was an absolute banger, and most people agree that the sequel was a disappointment, and yet it’s still better than ANY exclusive Xbox has made.  Xbox is a laughing stock atm, they fucked up halo, GoW, and 90% sure will ruin future Bethesda games as we have proof with starfield.  Like wtf is going on over there 😂",
            "Yeah it’s one you definitely should be in the mood to play. There is an achievement just for opening photo mode as well lol",
            "Disagree. But Sony said they want to go even more cinematic. Bleh. Glad there is. A ton more diversity on Xbox",
            "Not really. \n\nFor decades we've had games release that are more of an artistic approach than your classic video game would be. \n\nFor some players this game will be extremely entertaining whilst also being a breath taking attempt at portraying something. \n\nIn reality any gamer should tip their hat to Ninja purely for not following the 'path' and just making yet another AAA RPG/FPS etc. The trouble is from a business stand point this game has everything to lose and judging from the shitstorm brewing about game length and player numbers, I highly suspect Xbox are shitting a brick.",
            "because seeing them at Red Rock sounds incredible and I am jealous.\n\n(I didn't actual downvote them)",
            "I meant it has all those elements. Either you're exploring or fighting or solving puzzles. I wouldn't say it's a walking simulator at all.",
            "I'm more concerned that the reason MS isn't advertising is because they will close this studio as well after release",
            "Narrative?you are the part of problem by companies get away from these practice lmao.\n\nI didn't said it is terrible , witth 5 year of development they were unable to show us any gameplay, they are not hyping this up because \nA) game is mediocre or shit\nB) they don't care",
            "Well someone didn’t pay attention in their marketing class. The point of marketing is to direct potential customers to ur product and or service to make them want or need it…. You typing in Hellblade 2 on the YouTube site doesn’t require a marketing team you are already a potential sale, marketing directs ppl that knows nothing about the game and because of their terrible marketing there’s more of those than you.  The marketing team is doing their job when you’re on some random website and you see a random Hellblade AD, or when you see Hellblade AD on a billboard, or on a pizza box etc.",
            "The advertising has been very lackluster and really only started like a couple weeks ago. It's extremely underwhelming and not a great job by Microsoft getting the word out there that the game was coming out and building hype. Ive been looking forward to this game for a long time and a couple weeks ago I had no idea it was only 2 weeks away until I saw a comment on Reddit. Terrible job by Microsoft.\n\nEdit: to all the people who know nothing about marketing and just want to downvote - I'm obviously referring to the **marketing campaign** promoting the release of the game. Not a trailer that came out 5 years ago or behind the scenes videos posted throughout the years. I'm referring to a marketing campaign to build hype leading to launch. Microsoft dropped the ball.\n\n[When the VP om marketing at Microsoft has to tweet screenshots of the marketing because no one knows the game is coming out and people have barely seen any advertising and Microsoft is being criticized for it it's not a good sign.](https://x.com/aarongreenberg/status/1788369899729133683)",
            "[removed]",
            "I guess I do get out much because I haven’t been scrolling Reddit making notes of video game adverts",
            "I have a Ps5 and a series x. I have no preference over either platform. \n\nBut it’s pretty obvious they haven’t marketed the game very extensively or we wouldn’t be having this conversation in the first place",
            "[deleted]",
            "Yup, it's all a big conspiracy against the multi-billion dollar corporation that is Microsoft. Has nothing to do with their lackluster handling of studios and the games that come from them. /s",
            "Those ps exclusives actually have decent gameplay. GoW, Spider-Man, and tlou2 are all third person games, but they don’t play like each other.",
            "For real 😂\n\nPlayStation exclusives are so formulaic and paint-by-numbers.\n\nThey are third-person, cinematic experiences, with repetitive side missions, on-rail moments, and QTE boss battles.\n\nNot saying they’re bad games. But it’s odd to me how they don’t get knocked for all being similar experiences.",
            "There haven’t been many ps5 exclusives that are 60 fps. They’re mostly ps4 games. Gow2, tlou, etc. Sony hasn’t put out many games only for ps5. Once they get to the graphical level of hellblade 2 you know they will be 30 fps. Probably less. What’s next from Sony? Wolverine? If it’s ps4 graphics like spider man 2 it could be 60. Otherwise 30 all the way.",
            "Acc to what I am reading the reviews and the game both drop at 9am BST\n\n**Review Embargo:**\n\n[https://twitter.com/\\_Tom\\_Henderson\\_/status/1790824744176246965](https://twitter.com/_Tom_Henderson_/status/1790824744176246965)\n\n**Game Release:**\n\n[https://www.polygon.com/guides/24159102/hellblade-2-senuas-saga-release-time-date](https://www.polygon.com/guides/24159102/hellblade-2-senuas-saga-release-time-date)\n\nHave you seen different?",
            "No - reviews are the exact same time as launch",
            "To be fair that's not where New York is either. I think it's just a rough approximation map",
            "Oh come on, it’s like one inch down.",
            "I really fail to see how it's anti-consumer, especially since this is a story game and letting reviews drop before the game is out isn't going to help with spoilers.\n\nOther than that, consumers aren't forced to pre-order games (especially in this case when it's on Gamepass), you can always wait to see the reviews and public impressions before buying the game.",
            "It's crazy. I'm not sure what people are expecting exactly. Even the achievement list is straightforward.\n\nPeople are going into this game with crazy high expectations for the next epic adventure and I don't know why.",
            "I think if you were to book a day off specifically to play it you wouldn't have those issues.",
            "The fuck do you mean that they ruined Starfield? Starfield launched as like the least buggy Bethesda game ever. It was actually an extremely solid experience. \n\nAnd I'm not disagreeing that they haven't had these high impact titles like Sony has. I love a lot of what Sony released (just not Spider-Man or Horizon ZD). BUT I've also really loved a lot of these lower impact titles that Xbox has released. They've truly been some of my absolute favorite gaming experiences this generation. \n\nA game doesn't have to be a \"banger\" to be great.",
            "See cinematic is good when in between you have amazing combat. That’s what make Sony single players so good",
            "There's zero replay ability lol\n\n\nThis is a game you play a few nights a week. Say nice game. Never play it again.",
            "Man, fanboys are the worst. They get upset over the most obvious things. It's like living in denial.\n\nI like Ninja Theory, and I think this is gonna be an awesome game, but someone really fumbled the marketing. Compare this to The Order, Halo 5 where they were literally plastered everywhere, HB2 marketing feels incredibly shy. Let's see how this pays off",
            "When did you take marketing classes?",
            "> only started like a couple weeks ago\n\nSo they should be constantly advertising an ~8 hour game 1 month before it launches? I don't really see the logic in that. Starting an advertising campaign 2 weeks before the game comes through social media, streaming services and even some sports events is plenty enough, not to mention the AURORA collab and all the other Iceland stuff and getting Heilung to work on the OST.\n\nThough outside the US/UK, the advertising for Xbox in general is very lackluster and I hope that they can change this before it's too late",
            "Xbox can never win with the internet. For years it was “we’ve seen too much of HB2”\n“Stop showing it at shows” “too many trailers”\nNow it’s not enough. \n\nBro, they had a live musical performance at the FREAKING GAME AWARDS IN DECEMBER.\n\nGo get a job in marketing since you seem to know more than people who do it for a living",
            "According to the Anti Xbox crowd sure.",
            "> really only started like a couple weeks ago\n\nI seem to remember the first trailer being shown at the Game Awards a few years ago?  So...  no?",
            "You're talking about Hellblade as if it was the next Gears or Halo.\n\nIt's a small niche game made by a small niche company. What in the hell did you think the first one was?\n\nThis is neither the next Call of Duty or that Indy game Todd Howard is producing. Games that have already been heavily publicized by the way, just in case you show up in 6 months claiming Microsoft didn't spend a dime advertising an Indiana Jones game.",
            "a lot of it is gameplay footage, the game has no hud. if you mean a 40-minute gameplay youtube clip, then that's never going to happen with a game that barely scratches a 10-hour campaign. also, we got those gameplay teasers ages ago in one of xbox showcases.",
            "Thank you for your submission. Unfortunately, your post has been removed for the following reason: \n\nRule #1 - Keep it civil/no console wars\n\n* Personal attacks, racism, bigotry, and/or other prejudice are not welcome here. Discuss the topic, not the other user. \n\n* If you are here only to platform bash or console war, you also risk removal.\n\nNo Doom  & Glooming. If you have no prior history in this sub and just post doom and gloom to incite a reaction, your post will be removed. \n\n[Please see our complete ruleset by clicking here. ](https://www.reddit.com/r/XboxSeriesX/wiki/rules)",
            "You can say that about literally any game you want to. \n\nThis conversation only exists because console warriors are desperate to console war.",
            "The trailer is on X and YouTube as well.",
            "To be fair.. They're all pretty awesome games of that kind. Who doesn't love a great 3rd person adventure/action game with high production values and semi-deep gameplay? God of War, TLOU, Spider Man, Ghost of Tsushima, etc.. all pretty awesome games that had great characters, visuals, music, gameplay, stories.. just because they are 3rd person and often open world or semi open world isn't exactly a negative.",
            "So, how long until 60fps is the base on consoles? How far out are from being done with 30fps? 10 years? 20 years? How long until we get consoles that are as powerful as PCs are in 2024?",
            "Nah I definitely based that on what others have said so it's possible they are aligned time wise for sure.\n\nedit: others being other reviewers not randoms.",
            "It’s anti consumer. Picture if movies didn’t allow reviews to be released until the movie was in theaters.",
            "Because the first game was exactly that.\n\nAn epic adventure doesn't have to be a bloated 40+ hour open world RPG. Not everybody enjoys or has time for that.",
            "I originally thought they were doing a large scale up of this franchise as it was THE game they announced the Series X with, but a few months ago when news got out it was a similar scope and length to the first I got disappointment out of the way and realigned expectations. At this point I'm basically expecting nothing more than the first, which was a solid 7-8/10 game with an interesting story and and incredibly performance.",
            "It was short, but it was epic too.",
            "Either way I'm not sure that everybody can last 8 hours playing a game in one day, especially since the puzzle solutions likely won't be available day one.",
            "Most of them are pretty samey. Not a ton of diversity. Feel like nd has only been making three same tlou game for a decade or more",
            "A long time ago before they started lowering the standards to make sure ppl like you would pass the class.",
            "Not sure what you mean. Advertising literally only started within the last few weeks. This is a fact. I'm not anti Xbox. Like I said I've been looking forward to the game for years and literally had no idea it was being released until I read a comment on Reddit. I see tons of advertising for games I'm interested in and have literally never been surprised a game was coming out like I was for Hellblade 2. The advertising campaign has been awful.",
            "I'm not referring to a trailer that came was shown \"few years ago\". That's not marketing for the release of the game.",
            "Did I asked for 40  min trailer ? Can you give me link of any 8-10 min footage which shows gameplay ?",
            "Ready don’t care about the console war stuff. Like I said, I play on both platforms so I have no horse in the race. \n\nBut it’s been a frequent conversation, it came up in a kind of funny interview with the game’s director. \n\nI certainly couldn’t say that about Starfield which was marketed very heavily.\n\nYou’re the one falling on a sword here saying “NO THERE WAS MARKETING, IT DOESNT EVEN NEED MARKETING”. That sounds like a console war coping mechanism to me.",
            "[removed]",
            "They are good games, but they just aren’t my cup of tea. I just find it odd PlayStation doesn’t get dinged for being so formulaic with them.\n\nHell, I remember when 360 got dinged for being a “FPS Shooter” box when that actually wasn’t even a reality. \n\nIdk. I know I’m in the minority. Just feel like they’re all similar experiences. I miss the PS3 days when their console exclusives were diverse.\n\nLike I said…not saying they’re bad games. They’re just paint-by-numbers at this point.\n\nBut they figured out the formula which is why they sell so well…if you like GoW, then you’ll like Spider Man, and you’ll likely like Last of Us, Uncharted, etc.\n\nI’m hoping they’ll get back to the point of using their imagination, but I won’t hold my breath.",
            "It’s cyclical. Come the next Xbox and ps6 you’ll get 60 or 120 while we transition because those initial games will be cross gen. Graphics sell so devs will push graphics over frame rates every day. There will always be exceptions but the big hitters- gta, tlou, etc will be 30 fps on consoles. Hey a powerful pc if frame rates at important",
            "You can choose to wait until the review is out before you make a purchase. Nobody is forcing you to buy it now.\n\nIt is also not a fact that someone else's opinion will match yours. \n\nIt's in game pass, lots of people will try it. You will get both critic and use reviews at the same time. Isn't that better?",
            "I kinda agree with you in spirit, but I do not read reviews of movies, shows or games before I experience them for myself.  With the exception of pointing out technical issues that break the product, all a review does for me is give me pre-conceived notions of opinions swimming in the back of my mind, possibly tainting how I am to perceive the product.",
            "It was not an epic adventure 😂",
            "The first game wasn't an epic adventure...",
            "I feel like increasing the scope of the game to a whole new genre (like an open world questy RPG or something, or maybe go the Dynasty Warriors route) would have split the fanbase too much as not everyone who likes what the first did would like what the second is doing and visa versa, causing disappointment all around and \"OMG MICROSOFT RUINED THIS FRANCHISE AND DESTROYED NINJA THEORY\". Sticking to similar scope and similar gameplay but with a higher budget was the right move imo. \n\nI can't think of many games which change gameplay so dramatically while also becoming successful and not alienating the core fanbase.",
            "Its way better than the first honestly.",
            "Glad you enjoyed it.",
            "The puzzles to these games are literally walk until you line up a symbol, why would you need solutions?",
            "First of all I never took marketing classes. \n\nBut glad you said “a long time ago” because things have obviously changed since then.\nMaybe billboards aren’t as effective as they once were. \nAnd you know…the target audience that gets influenced by billboards, I’d guess they aren’t the target audience for video games. \n\nYou know. People who use technology. Advertise via technology. Like internet ads",
            "> Advertising literally only started within the last few weeks. This is a fact.\n\nActually the “fact” is that this game [has been advertised since 2019](https://youtu.be/2TR0gaG01do?si=G3v4otrseMlgEDWV).",
            "You didn't see the teaser with Heilung's music or the gameplay clip where they're fighting a giant? And you're interested in it? Have you also missed all the featurettes Ninja Theory have done over the years showcasing their mocap tech?",
            "Dude you’re talking to someone who knows nothing at all… these ppl could receive a package from Xbox with Phil Spencer’s fecal matter and they’d all be happy and posting “look I got my copy”",
            "Pretty sure all trailers count as marketing.",
            "I don't know if you're being deliberately obtuse asking for very specific timeframes. [This](https://www.youtube.com/watch?v=SkILE5tWx7c) is over 5 minutes and it's basically a paid ad on Gamespot",
            "Didn't say any of that but go for it. \n\nI said it has marketing, and too much marketing is annoying. I never said it didn't need marketing. But go ahead and make up things kid. Live in your console war fairy tale land\n\nI will just sit here and enjoy gaming.",
            "Thank you for your submission. Unfortunately, your post has been removed for the following reason: \n\nRule #1 - Keep it civil/no console wars\n\n* Personal attacks, racism, bigotry, and/or other prejudice are not welcome here. Discuss the topic, not the other user. \n\n* If you are here only to platform bash or console war, you also risk removal.\n\nNo Doom  & Glooming. If you have no prior history in this sub and just post doom and gloom to incite a reaction, your post will be removed. \n\n[Please see our complete ruleset by clicking here. ](https://www.reddit.com/r/XboxSeriesX/wiki/rules)",
            "You're not wrong. They are all quite similar in foundation. But I think Sony has some winners on their hands when it comes to their characters and franchises. People cared what happened to Nathan Drake. They care what happens to Kratos. But yes, they are very same same when it comes down to the nitty gritty gameplay. I borrowed a friend's PS4 last year and blew through Spider Man, Uncharted 4 and played a good chunk of God of War and Ghost of Tsushima all within a month or two timespan.  The formula was definitely getting a little old",
            "Better? No of course not. Always better to have reviews earlier so you can make an informed purchase. \n\nAllowing people more information before they buy is pro consumer. Limiting information is anti consumer.\n\nWhether people use the information doesn’t matter, it’s about whether or not the company or distributor allows them access to it to make an informed decision",
            "I’m not making an argument that reviews are useful to everyone. I am saying a company limiting reviewer opinions on a product until after the company can start making money on the product is anti consumer.",
            "How so? Can *anybody* give a half decent response or nah?",
            "In your opinion.",
            "I just think short doesnt mean bad . I see what you mean but Id rather a game knows when to quit. For example Banishers would have been better at maybe half length",
            "Stuff like the valravn puzzles, mask puzzles and even the cave maze could take the average person longer than usual.",
            "You’re missing the whole point, I understand why you don’t get how Xbox failed to properly market this game. Ask anyone in ur life if they know Hellblade now ask them if they know what God of War is. We know what Nike, McDonalds, Coke and Apple is because they created a brand that was heavily marketed they created a brand that makes people think they need it. Most gamers are not on YouTube or Reddit. Most gamers are casual gamers that don’t find out about games unless it’s through different types of marketing. Word of mouth also works but it only works when enough ppl have been exposed to the game because it was well marketed",
            "I realize you know nothing about marketing based on your comment so I'm not sure why I'm even bothering responding to you - but a trailer that came out 5 years ago is not great advertising for a game releasing tomorrow.\n\nNormally you'd want some sort of full blown marketing campaign shortly before release to hype up the actual release of the game. When people who saw the trailer 5 years ago and got excited and have been waiting all this time don't even know the game is releasing you've failed at marketing the game. Everyone outside of this sub knows the marketing has been a failure.",
            "Pretty sure they don't count as marketing for the **release of the game**.",
            "Lol do you know what gameplay trailer is?\n\n\n\nhttps://youtu.be/btmN-bWwv0A?feature=shared\n\n\n\nhttps://youtu.be/HZtc5-syeAk?feature=shared\n\n\n\nhttps://youtu.be/TXukPnO9IdY?feature=shared\n\n\nWatch these to see what \"trailer \"actually means",
            "[deleted]",
            "When did I say I cared about console wars?\n\nApparently we’re both utterly delusional but wishing that things that looked good, that I figure deserve to reach the widest possible audience isn’t exactly the L you’re making it out to be.",
            "Oh yea, they have certainly nailed the characters. They have plenty of iconic characters whenever you think of “PlayStation.”",
            "No, why is it always better to have the reviews early? When I read/watch the reviews as soon as the reviews are available then I also want to be able to directly buy and play the game if it looks good.",
            "> I am saying a company limiting reviewer opinions on a product until after the company can start making money on the product is anti consumer.\n\nBut you’re not describing what’s actually happening here. This launch is simultaneous with the lifted embargo, not after, which puts the decision squarely on the consumer themselves: read the reviews first? or purchase first? … unless you’re referring to pre-orders, which are almost always ahead of reviews and can be cancelled before the official release with a full refund (and the official \"play-early\" pre-orders do not stop early consumer reviews).",
            "I can respect that view if a company were to do that.",
            "Epic adventures are not usually described as being 6 hours long lol. Sorry",
            "A fellow fan of The Good Wife!",
            "It wasn't, the only good thing about the first game was the incredible sound design. The rest of the game was mid as hell.",
            "I never said short = bad. Have you seen my username? Most of SEGA's best games can be beaten in less than a couple hours.",
            "So the words “Out now” won’t mean anything? There’s always a huge ramp up in ads once a game is “Out Now” and if in a few weeks after release they just drop all marketing then I’ll concede that okay, yeah they should’ve done more. But we’re not there yet chief. \n\nAlso THIS GAME IS NOT GOD OF WAR LEVEL. It is the sequel to a previously indie studio’s art house game. They just got improved motion capture tech and increased the budget but we don’t know how much. It’s also being sold for $50.\n\nSome of yall need to properly set expectations",
            "Speaking of knowing nothing about marketing…\n\nThey featured the game [at last year’s Xbox showcase](https://youtu.be/CJ_hoLUHyvQ?si=jI8Zp4n8R1Clf-Yk). Then they debuted a [brand new trailer](https://youtu.be/2v6RL9PW3jg?si=O8XHx7vcbHRpJl70) and [a live performance](https://youtu.be/VWknSd6jbd0?si=SECMnZWKYirgZbYR) at the Game Awards. \n\nAlso this year we got a whole in-depth look at the game [in the Xbox Developer Direct](https://youtu.be/sVue2UHNAkE?si=1x2e5iAQOz-vSFeu)\n\nSo they didn’t just show a trailer 5 years ago and release the game tomorrow, they’ve been continually advertising and showing off the game for the past 5 years. \n\nBut again, I’m talking to someone who claimed it’s a “fact” that they “literally” just started marketing the game.",
            "So you're specifically mentioning the launch trailer??  Those generally come out about a week before the the game comes out.  Sometimes it's a little before. Sometimes it's a little after, but it's generally around launch time.  You just need to leave me alone now. Okay?  Just go back to your cave, troll.",
            "Right, you were being a dick just to get your point across, cool.\n\nTake care.",
            "That and solving puzzles is going to be the whole game, lol. Have you even played the first one? Don't lie. You people doubting the gameplay of a sequel is new levels of kooky crazy. It's literally going to be slightly improved more of the same.",
            "You're literally spouting console war propaganda. Saying \"They aren't advertising and talking about the game\" despite the numerous trailers, game show appearances and having a big appearance at the Game Awards. But apparently all of that isn't enough.",
            "Seriously? Your own example shows you why it’s better. You watch reviews and it impacts your desire or lack thereof of wanting to play the game.\n\nEdit: I can’t believe there are people advocating for less transparency about a game prior to release. Is everyone here a goldfish?",
            "Or boring walking simulators with terrible combat and terrible puzzles with irritating ASMR constantly blaring out at you",
            "How does you not liking the game have anything to do with the fact that it's *objectively* an [epic](https://www.merriam-webster.com/dictionary/epic) [adventure](https://www.merriam-webster.com/dictionary/adventure) game?\n\n*\"Set in a dark fantasy world inspired by Norse mythology and Celtic culture, the game follows Senua, a Pict warrior who must make her way to Helheim by defeating otherworldly entities and facing their challenges, in order to rescue the soul of her dead lover from the goddess Hela.\"*\n\nYeah, you're right, sounds more like a dating sim.",
            "Who’s going to see the “out now”?… u realize the grand majority of sales matter the most the first two weeks. Especially on a game that isn’t well known. This isn’t GTA or some Nintendo game this is a franchise that had poor sales to begin with and with Microsoft looking to axe brands and studios that aren’t bringing in $ how do you think this game is going to survive? This game is counting on PC sales. Speaking of managing expectations, it seems like doing the same thing that all your other studios that just recently got shut down did is a recipe to also get shut down… some of you ppl need to open ur eyes and stop pretending it’s all fine when every circumstance recently proves that this boat is sinking. I’m speaking as someone who’s been with Xbox for 22 years. I’m not going to pretend I have a crystal ball and say Ninja theory will be shutdown but I am very confident that the possibility of it shutting down in the next 6 months is extremely high. I also come from a corporate finance background so I understand this from a corp perspective and not just a gamer",
            "When did they start marketing the release date of the game? You know marketing strategies are broken up into campaigns right? Well of course you don't but they are. They **failed** at marketing the release of the game. The VP of marketing at Microsoft literally had to post screenshot on Twitter to prove they were marketing the release because they were doing such a poor job at it and receiving criticism for it lol. When the VP of marketing has to prove that they're marketing they've dropped the ball.",
            "No not the launch trailer. The marketing campaign promoting the release date and launch of the game.",
            "You dropped this 🤡",
            "Why are you so obsessed with consoles wars? Someone who plays on the same system as you who disagrees isn’t a console war warrior\n\nThey just have a difference of opinion. Please change the record."
        ]
    },
    "Take-Two CEO is highly confident in GTA 6's Fall 2025 release window but knows \"slippage\" can happen": {
        "title": "Take-Two CEO is highly confident in GTA 6's Fall 2025 release window but knows \"slippage\" can happen",
        "score": 243,
        "url": "https://x.com/shinobi602/status/1792565323234742470",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Already setting the stage for a delay 🤣",
            "That's what she said.",
            "Is there a reason these soft ass mods closed this sub?",
            "And slippage always happens, basically confirming the release date is bullshit.",
            "Spring 2026",
            "While nice to know a timeframe as fans, I bet other devs are very happy to know this even more so.  Now they know to avoid Fall 2025 at all costs lmao.",
            "Doesn't matter what the CEO is confident in. What are the actual developers confident in?",
            "I still think, given Rockstars track record, this game will delay into 2026.",
            "The longer we wait, the better. Maybe the next console will be out and we'll be able to play it at 60 fps.",
            "They want to release it as close to the end of this generation so the can sell us the next-gen, and next-next gen versions too",
            "GTA6!!!",
            "They should’ve never said a word till they knew the date for sure.",
            "I will have to wait to play it on the xbox series 720 one X",
            "Rdr2 got delay too, but it was worth it! :D",
            "Fall 2026",
            "I personally think the leaks are gonna get so bad they'll release it earlier than this.",
            "This has Spring 2026 written all over it lmao",
            "This has Duke Nukem “Whenever” feel to it.\n\nIf it’s not the best game of all time and almost entirely bug free the internet is gonna whine.\n\nI trust Rockstar though so hopefully they get extra time to perfect it.",
            "Not even sure why they announced it when they did if it's going to be delayed. Just another Elder Scrolls at this point",
            "I want them to troll real hard here. Pushing it out to 2026 for the delay….",
            "at this rate, I wouldn't mind gta 6 in my life time lol.",
            "Just announce a date then everyone will be happy",
            "Playing 5 now for the first time. Did I wait long enough?",
            "that is very close",
            "So slippage will happen. Got it.",
            "I don’t mind delays personally .I rather them release a fully polished product then to rush one out with bugs and stuff .",
            "I will be shocked if it releases.m next year. If it does we will be getting an unfinished product know doubt. But I just don’t see them releasing it without multiplayer fully ready to go this time.",
            "Crosses finger, as soon as a release date is\nPicked I’m hoping to plan a Miami trip for its release.",
            "GTA 6 will be delayed at least once, it is inevitable",
            "Gta 5 better",
            "Y'all setting yourselves for disappointment thinking GTA 6 won't be delayed into 2026.",
            "Lol no way this gets released on time. I'm already expecting 2027 or beyond.",
            "yes",
            "Its moved too r/Xbox",
            "that's why they didn't give a date, they gave a window",
            "They're a year and a half away from launch if they don't delay, it's really difficult to pinpoint something that far in advance. And they only gave a vague window, not a release date.",
            "November 2025. We decided to push the game back to make sure that the game is everything the fans expect from us. We are striving to make this the best GTA to date.\n\nFall 2026:…..\n\n\nEdit: mistyped the dates.",
            "They'll hit the window. It's crunch year.",
            "I'm thinking September or October 2026.",
            "They know to avoid Spring 2026. I'm not even sure Rockstar has hit their time frame since GTA3.",
            "Confident in forced overtime and no additional benefits when game makes a lot of money.",
            "Me too. It's just too big and polishing such a game is a nightmare.",
            "And the last time a company gave an exact date over a year and a half out, we ended up with a 10 month delay (looking at you Bethesda with Starfield) ",
            "So December 2027 then?",
            "Spring 2028 it is",
            "Certainly Autumn 2029",
            "[deleted]",
            "Coming to Xbox Savior D and Playstation Infinity in 2030"
        ]
    },
    "Hypercharge: Unboxed Dev Reveals FPS & Resolution Targets For Xbox": {
        "title": "Hypercharge: Unboxed Dev Reveals FPS & Resolution Targets For Xbox",
        "score": 220,
        "url": "https://www.purexbox.com/news/2024/05/hypercharge-unboxed-dev-reveals-fps-and-resolution-targets-for-xbox",
        "content": "",
        "num_comments": 67,
        "comments": [
            "From the article, here's the quote on FPS and resolution targets from their yet to be published interview: \n\n>\"Here’s a rough breakdown: The Xbox Series X generally runs in dynamic **2160p (4K)**, while the Xbox Series S usually hovers around **1728p** but can potentially hit 2160p as well. The Xbox One X operates at **1080p**, and the Xbox One S typically runs at around **972p**, though it might reach 1080p on occasion. Across all these platforms, our target is always to hit **60fps**.\"",
            "Nice to see a developer focusing on a 60fps target, no matter what. Even on last gen machines.\n\nI appreciate the attitude. I'm gonna check this one out.",
            "Excited for this game",
            "Actually kinda hyped for this game, will it support crossplay with PC?",
            "Anyone know why it died on pc but everyone is ecstatic it’s going on Xbox?",
            "A team of 5 made this?\n\nThe reviews show good. Yeah I’m down to support this. Console wise it’s exclusive to Xbox too? Nice.",
            "Previously commented I was excited for this game but the more I look into it it seems like a final cash grab the game has been out for a year on PC and it's dead and apparently playing with a controller is awful thankfully I didn't pre order",
            "This looks so fucking cool",
            "Played this game on PC last year. \n\nWas very disappointing. Feels shockingly bad on controller. The upgrade or power weapon system is rough, and most either feel way too underpowered or way over powered. \n\nAlso, the servers were big time dead. Maybe Xbox can spark some life back into it, but I think once people actually play it they won’t stick around.\n\nPicture a really bad feeling halo but as toys. Halo where no matter how hard you try to tweak the sensitivity it all feels terrible.",
            "I'm so looking forward to this one!",
            "I’ve never heard of this game but it sounds interesting",
            "So cool an idea. I wish it had real IPs like GI Joe, Heman, etc",
            "1728p and 60fps on the Xbox Series S is quite a feat. Props to them.\n\nHopefully other devs are taking notes on optimization.",
            "Any one know if this game is going to be on steam?",
            "Totally dead on pc",
            "Should have went to Game Pass if the Dev wanted and kind of Survivability. At $30 it’s a ripoff out the gate tbh",
            "Is it cross play with steam and other consoles?",
            "Games pretty fun, enjoying it so far.",
            "Trying to get my refund",
            "I mean its a competitive shooter, it has to hit 60fps on everything imo!",
            "Yes but the game is effectively dead on PC.",
            "It died because it sucks.\n\nThe controls are terrible, especially for controller. The upgrade and power system is bad, and they also feel weak OR incredibly overpowered - no in between. \n\nThe matchmaking system at least when I played it was also confusing mostly because the game was so dead it was hard to figure out what server was what.",
            "for now, they said they have plans for ps later",
            "I bought it on release date in 2020 on Nintendo switch, it looks like they’ve made improvement since then? When I played it was super rough, I really didn’t enjoy it.",
            "Played about 3 hours so far, controller feels fine to me and pretty fun so far. Also they are planning to release on PS5 by the end of the year so don't think it's just a cash grab, but who knows.",
            "It’s been on steam for a while but it died on arrival",
            "It's been on steam for years.",
            "Yet another positive",
            "Not having to  deal with keyboard and mouse is good for me, as I suck.",
            "It has crossplay",
            "True. Racers + shooters really need that extra fluidity.",
            "Nintendo Switch has entered the chat",
            "Isn’t Starfield a shooter?",
            "For some reason I thought this was another FTP BR",
            "Why",
            "the controls are really bad I have to agree",
            "Oh damnit. It looked so cool too.",
            "Don’t worry you can afford one some day",
            "No i mean like they don’t even have multiplayer on pc because it’s too dead. It’s just ai",
            "It's dead because it's a terrible game.",
            "No ,its an rpg.But anyway comparing this game to  Starfield is laughable.",
            "Isn't competitive and now it runs at 60FPS",
            "I'll edit my comment to clarify I'm talking about competitive shooters \n\nAlso Starfield isn't a shooter, the shooting part is like a secondary genre to the game",
            "You miss the “competitive” part just to be obtuse?",
            "Because it sucks, honestly.",
            "I don't know why, but on steam charts it had a 24 hour peak ok 82 players",
            "It released a long time ago. Its a co op game with no content updates so you only need a small squad of friends to have enough to play.",
            "Because it's terrible.",
            "Becuase people aren’t playing it?",
            "It’s stiff but somehow slippery. It’s wild",
            "Cool idea. Cool visuals. \n\nBad gameplay. \n\nLike off brand halo. \n\nLike if you asked for Captain Crunch from the store and your mom brought home Captain Crispys.",
            "Yeah, no thanks. I’m happy with my MacBook Air, iPad Air, XSX, PS5, Switch, Odin 2 Pro and LGCX for my gaming needs.\n\nI like my gaming comfortable without needing a desk, being easy to share with my partner instead of being isolated and my OS to not have AI spyware in it, lmao. (Copilot Recall)",
            "It’s a shooter.",
            "Yes he changed it to competitive.",
            "Of course it isn’t competitive and it’s secondary to loading and menus, which is its gameplay. \n\nI was just talking fps and more of a knock on how Starfield was widely accepted at 30fps on this subreddit.",
            "He changed it.",
            "still more of an rpg, but its also not competitive...",
            "Haha,lol ok whatever",
            "It’s an open world RPG. Its combat is shooting but it’s not its genre.",
            "By your logic Fallout 3 would be a shootee however I think everyone that played F3 would agree it's not a shooter.",
            "Don't pretend to be a dumbass, just because a game has shooting it doesn't mean it belongs to the shooter genre.",
            "Says the one who plays Destiny, a game where i wouldn't even know where to start if i wanted to buy the complete experience. A game that you can't even play the original campaign due to it being deleted",
            ">secondary to loading and menus\n\nYou are a [known troll](https://www.reddit.com/r/Starfield/comments/1cwhamq/comment/l4w7n0v) over at r/Starfield, dude go get a life instead of pathetically trying to slander games with a 85 Metascore. You ain't convincing anyone. lol\n\n>Starfield was widely accepted at 30fps \n\nEvery open-world game is \"accepted\" with 30 FPS if that's the only option. Didn't see you whining when Red Dead Redemption II released. Lmao",
            "What does that have to do with fps? It was always 60/120. And it actually has content, unlike Starfield.",
            "Destiny 1 was and is still 30 FPS on console.\n\nDestiny 2 launched at 30 FPS and got an update to 60 FPS in 2021.\n\nI also enjoy Destiny, but like, don’t lie about it. The fact it was such a fluid and responsive shooter, even at 30 FPS, is one of the things that kept it alive through its many disasters."
        ]
    }
}